{
    "authors": [],
    "date_download": "2018-02-03 19:28:18+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 15:23:16",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2018%2F02%2F02%2Fyouth-duterte-give-slot%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2018/02/ys-up-walkout-01.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“Duterte has created all the conditions that make it imperative and befitting for the youth to put down their books and march to the streets.”\nBy ANNE MARXZE D. UMIL\nBulatlat.com\nMANILA — “If there is anyone who needs to give up his slot, it is none other than Rodrigo Duterte himself.”\nThis is the response of the Student Alliance for the Advancement of Democratic Rights in University of the Philippines (Stand UP) to Duterte’s threat that UP students will be kicked out from the university if they continue to protest and give their slots to “bright Lumads” instead.\nOn Thursday, Feb. 1, progressive youth groups marked their first of a series of protests against Duterte’s rising tyranny and dictatorship. Led by Kabataan Partylist, several youth and student groups held protests in their respective universities and other protest centers across the country.\nIn UP Diliman, several students joined the walkout led by the Youth Act Now Against Tyranny (YANAT) and Stand-UP). Students from Cagayan State University (CSU), Holy Angel University (HAU), UP Los Baños (UPLB), Ateneo De Naga University (AdNU), University of Nueva Caceres (UNC), UP Miag-ao, Western Visayas State University (WVSU), and UP Mindanao (UPMin) also joined the protest.\nIn a statement, Stand UP said the protest manifests “growing unity amongst students and other sectors, which will only grow stronger as the Duterte administration continues on its anti-people track, as a fascist imperialist puppet.”\nAnakbayan secretary general Einstein Recedes also hit Duterte saying, “The Feb. 1 walkout is a resounding success that it has compelled no less than the president himself to take notice and speak.”\n‘Duterte continue to terrorize the people’\nThe youth groups lashed out at Duterte’s sudden concern to Lumad students when in July last year after his State of the Nation Address, he threatened to bomb Lumad schools.\nStand UP said the intense militarization continues to displaced the Lumad from their communities. In Jan. 29, Higala: Friends of Lumad in Caraga reported that 758 individuals in 12 communities in the municipalities of Lianga and San Agustin, Surigao del Sur were forced to leave their homes due to military operations. Students of Tribal Filipino Program of Surigao de del Sur Schools were affected of the operations as they were terrorized by the presence of the soldiers.\n“In the three years that UP has hosted Lakbayan, it has been proven that Lumad schools provide a genuine national, scientific, and mass-oriented education, yet the state unceasingly drops bombs, deploys battalions of military forces, and forcibly closes their schools and communities,” the group said.\nRecedes meanwhile said that Duterte’s “invitation” to Lumad students is unwelcome. He said that Lumad students are bright enough not to yield in to what they described as Duterte’s gimmickry after threatening to bomb their schools and tagging them as New People’s Army students and sympathizers.\n“But more importantly, the indigenous peoples of Mindanao have established a better and genuinely free system of education deeply rooted in their culture and heritage–a treasure they will not abandon if not for the consistent militarization of their communities,” he said.\nStand UP also belied Duterte’s claim that UP’s education is free. In UP Diliman, the group said, the administration continues the much-criticized socialized tuition scheme. The base pay in UP Diliman alone is P1,500 per unit ($29).\n“Delayed students, juris doctor and med students are still suffering from skyrocketing fees. Organizations are forced to pay venue rental fees,” the group said.\nKabataan Partylist Rep. Sarah Elago said that even with the passage of the Universal Access to Quality Tertiary Education Act, schools have increased miscellaneous fees and have required students to immediately pay unpaid loans or obligations.\n“Other universities use the free tuition policy against the exercise of students’ democratic rights, claiming that students should pay for the use of school facilities because the administration could no longer pay for its maintenance,” she added.\nBigger protests\nWith issues hounding the ordinary people, ranging from the newly implemented Tax Reform for Acceleration and Inclusion (TRAIN) which causes price hikes of basic commodities and utilities to the policies such as anti-drug policy Oplan Tokhang, the people had all the reason to rage against the government, said Kabataan Partylist Rep. Sarah Elago.\n“Duterte has created all the conditions that make it imperative and befitting for the youth to put down their books and march to the streets. He has created all the conditions for the Filipino people to rage against his regime. He has set up the stage for his own downfall,” Elago said.\nElago criticized the Duterte administration saying that Duterte beat the record of his predecessors in terms of human rights violations. In less than half of Duterte’s term, she said extrajudicial killings in the government’s war on drugs alone have reached 13,000.\nShe said this is thrice the record of the Arroyo administration’s counterinsurgency program Oplan Bantay Laya that also killed thousands of activists. Duterte also surpassed the human rights violations recorded in Ferdinand Marcos’s 14 years of martial law implementation, she said.\nDuterte’s so-called reforms are also bogus, said Elago, therefore not solving the roots of armed conflict in the country.\n“If it were, then it should have prioritized the Genuine Agrarian Reform Bill (GARB) over the bogus Tax Reform for Acceleration and Inclusion (TRAIN) program. If it were, then it should have been careful and vigilant of the implementation of the Free Education Act,” Elago said.\nAmid Duterte’s threats, a bigger protest is slated on Feb. 23. Elago encourages everyone to join the youth and students in expressing their rage against dictatorship and tyranny.\n“To remain quiet during a time of turmoil and chaos is to side with the tyrant; to remain passive in a time when killings by the state are considered ‘normal’ news is to tolerate the oppressor,” said Elago.\nRecedes meanwhile said that Duuterte will “witness an even greater number of students walk out of their classes as they symbolically give up their slots and fight for the rights of the Filipino people.”\n“Duterte must do likewise in his spot in Malacanang and not wait for the revolutionary movement to drag him to his rightful slot in the rotting hell of fascist dictators,” he added.",
    "source_domain": "bulatlat.com",
    "title": "Youth to Duterte: ‘Give up your slot’",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2018/02/02/youth-duterte-give-slot/"
}