{
    "authors": [],
    "date_download": "2017-12-12 08:24:55+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 07:22:20",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F12%2F12%2Fyouths-message-duterte-human-rights-abuses-breed-resistance%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/12/File_0001.jpeg",
    "language": "en",
    "localpath": null,
    "maintext": "By ANNE MARXZE D. UMIL\nBulatlat\nMANILA –Amid the worsening human rights situation under President Duterte, the youth also coe under attack, ranging from death threats against youth activists, to the food blockade of soldiers in Lumad communities.\nBut today’s youth have not wavered as they continue on the path taken by the people their age during martial law: resistance.\nYoung Filipinos wanted to tell Duterte to stop human rights violations, and to learn from the lessons of the past.\nBelow are the youth’s message to Duterte on international human rights day.\n“End martial law in Mindanao. It is not the terrorist that are being targeted but us, those who in the Lumad communities in the mountains. Soldiers are encamping in our schools causing the disruption of our classes. They are accusing us of being supporters of the New People’s Army. For the past two years, we have held classes in the evacuation center in Haran, Davao City and we have been here in Manila since July. We can’t come back home as long as the soldiers in our community.” – Jomar Malibato, student of Mindanao Interfailth Services Foundation, Inc. (Misfi) Academy, Capalong Davao Del Norte.\n“Stop the killings. Do not disregard human rights. It is only our right to have education, we should not be targeted because of that. We fight for our ancestral land because we inherit it from our forefathers. To fight for education and our land is just. He (Duterte) said during his campaign that ‘change is coming’ but it was not true. It was fake. And if he continue to oppress us, he should know that we will continue to fight, buhay man ang ialay.” – Jinky Malibato, 17, student of Misfi Academy, Capalong Davao Del Norte.\n“Give us our right to education. For the longest time, we are deprived of our education. Now that we have it, we are being attacked. They killed Obello Ba-ao. We only want out education, give us that.” – Rorelyn Mandacawan, 17, student of Salugpongan Ta’ Tanu Igkanogon Community Learning Center, Inc. Talaingod, Davao Del Norte.\n“Listen to the aggrieved Filipino people and not silence them. It would be good if he immersed himself with the masses to know their plight. No one will go to the streets if there is no flaw in this government. There is something wrong that is why there is resistance.” – Jerom Bacarra, 19, Social Work major in University of Rizal System.\n“Duterte should understand that he is taking away the Filipinos rights every day from extrajudicial killings to starving the Lumad communities, as his soldiers blocked the food supply from entering their community. He is not treating us as human, at all. Human rights is for all to enjoy. Not only for the rich, but also for the poor. I hope he will understand that.” Noelle Capili, 23, Behavioral Science student, University of Santo Tomas (UST).\n“We are challenging him, talk to the people who are directly being attacked of the state forces. Listen to the masses so that he will know how they feel, know their situation,” Adam Ang, 18, Journalism major, (UST).\n“Continue the peace talks between the National Democratic Front of the Philippines and the Government of the Philippines to address the root cause of the armed conflict. We also want to tell him that being a fascist only shows that he is not learning the lessons of history. The youth of the past has overthrown a dictator, we will not have second thoughts of doing it now.” Carhrihl Aguilar, 13, La Salle Greenhills.",
    "source_domain": "bulatlat.com",
    "title": "Youth’s message to Duterte: human rights abuses breed resistance",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/12/12/youths-message-duterte-human-rights-abuses-breed-resistance/"
}