{
    "authors": [],
    "date_download": "2018-02-03 19:28:43+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 11:58:09",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2018%2F02%2F03%2Fdeclining-adherence-rule-law%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2016/03/LumadKillings-.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Among 113 countries surveyed in 2017 on adherence to the rule of law, the Philippines emerged with the biggest drop in ranking – from 70th to 88th (or 25th from the bottom). Billed as the Rule of Law Index, the survey involved getting inputs from 110,000 households and 3,000 experts around the world.\nThe survey is conducted yearly by the World Justice Project (WJP), a nonprofit organization founded in 2006 by the then head of the American Bar Association. It has since developed a global network. Among its numerous honorary chairs are former US president Jimmy Carter, former Ireland president Mary Robinson, South Africa’s Nobel laureate Archbishop Desmond Tutu; from the Philippines, there’s former Chief Justice Hilario Davide Jr.\nIt may be of some comfort to the Duterte government that the majority of the 113 countries surveyed dipped in ranking with regards to human rights performance, constraints on government powers, and civil and criminal justice.\nBut what the WJP finds worrisome is the decline in the rankings of 71 countries in upholding fundamental rights: such as the right to life and security, due process, absence of discrimination, freedom of expression and religion, right to privacy, freedom of association, and labor rights. Moreover, 64 countries did poorly in constraining government powers – which reaffirms the rising tide of autocratic regimes across the globe.\nThe Philippines is described as the “biggest mover” in the Rule of Law Index, for registering the “most significant”declines in constraints on government powers, fundamental rights, [public] order and security, and criminal justice. We are ranked at no. 13 among 15 countries in the East Asia and Pacific region, and at no. 17 among 30 lower-middle income nations.\nTepid was the Duterte government’s reaction to the survey findings, dismissing them as “not based on reality.” However, presidential spokesperson Harry Roque acknowledged that the country’s criminal justice system is “really weak… Victims of crime and human rights violations wait for a long time to get justice.” But this condition had long been there before Duterte’s presidency, he added, and expressed confidence (tongue in cheek?) that under this administration the justice system would improve.\nPerhaps Duterte felt reassured of the Trump administration’s backing, since a State Department official described the United States as being “cautiously optimistic” that less extrajudicial killings would occur after the relaunching of Oplan Tokhang last Monday.\nHowever, US foreign policy experts are troubled by Trump’s “lionizing” of authoritarian personalities like the Russian president Vladimir Putin, Turkey’s Tayyif Erdogan, Egypt’s Abdul Fattah el- Sisi, and Duterte. Trump’s act, one expert quoted by The New York Times said, “cannot but help to embolden [these leaders’] efforts to crack down on civil society and crush dissent in their own countries.”\nChief Justice Maria Lourdes Sereno wasn’t surprised by the survey findings. Referring to the WJP Rule of Law Index as “the landmark for global perception-based studies on the administration of justice,” she remarked in a speech on Wednesday:\n“Despite all of (the) positive gains and even greater potential, we have to face the reality of the daily accounts of unsolved killings, many of them committed brazenly with public warnings against drug pushing and addiction. It is not surprising, therefore, that the perception of the rule of law in our country has swung from marked improvement to downgrade.”\nThe Philippines’ ranking in the survey, Sereno pointed out, had risen from 60th in 2014 to 51st in 2015, but significantly dropped to 70th in 2016 (the year Duterte became president). Thus, the country’s ranking steeply declined by 19 points in 2016 and by 18 points in 2017.\nThe Philippine judiciary, the chief justice advised, must take the index as an “indicator of the erosion of trust in the criminal justice system, in the civil justice system, and in regulatory agencies.”\nIndicative of this erosion of trust in the criminal justice system are public reactions to the Oplan Tokhang relaunching, which PNP Director-General Ronaldo dela Rosa has promised would be “less bloody” than its two previous versions.\nFor instance, the human rights alliance Karapatan wryly commented that the relaunching, with new guidelines, is a tacit admission that something was fundamentally wrong with the “war on drugs” policy. Invoking a resurgence in illegal drug activities and related crimes as rationale for the relaunch, it said, proves that Oplan Tokhang and Oplan Double Barrel were ineffective after more than a year of implementation. Laughable, it added, is the claim that the drug campaign adheres to the rule of law and respect for human rights.\n“How many policemen have escaped accountability? How many are emboldened to murder the poor with a free pass?” Karapatan asked. The right of the poor to due process, it noted, is routinely violated. “Ultimately this bloody campaign brings us to a dark realization: a still prevalent drug trade, a fraudulent police force, and thousands of poor Filipinos dead.”\nAs if affirming Karapatan’s prognosis, the Philippine Drug Enforcement Agency, which President Duterte had designated as lead agency in the anti-drug campaign in lieu of the PNP, has acknowledged that a group of Chinese inmates at the National Bilibid Prison have begun to supply illegal drugs inside and outside the penitentiary. Transactions are done via mobile phones that proliferate among the prisoners. Yes – despite security measures put in place by the Special Action Force, the supposed elite unit of the PNP which now handles the prison’s security.\nIn the same vein, Bishop Pablo Virgilio David, vice president of the Catholic Bishops Conference of the Philippines, in whose diocese, Caloocan City, the most numerous drug-related executions have taken place, remonstrated to the PNP and the Duterte government:\n“Good heavens, you have barely washed the blood, the blood that [has flowed] from Tokhang Parts I and II. You barely accounted for the lives [lost], and you would not accept one single case as extrajudicial killing, and then you launch it again. Let’s not fool each other. You never unlaunched it.”\n* * *\nEmail: satur.ocampo@gmail.com.\nPublished in Philippine Star\nFeb. 3, 2018",
    "source_domain": "bulatlat.com",
    "title": "Declining adherence to the rule of law",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2018/02/03/declining-adherence-rule-law/"
}