{
    "authors": [],
    "date_download": "2017-12-12 08:24:28+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 12:42:21",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F12%2F12%2Frise-resist-renew-campaign-binds-peoples-british-global-mining-plunder%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/12/photo3_camila.png",
    "language": "en",
    "localpath": null,
    "maintext": "By CLEMENTE BAUTISTA JR.\nLONDON, United Kingdom – In London during the last week of November, I represented Kalikasan People’s Network for the Environment and shared many stories of Filipino’s struggle against the destructive operations of British mining companies in the Philippines. The struggle has caused our people untold human rights violations. The event was dubbed as Rise, Resist, Renew: Alternatives to Mines and Money campaign. The London Mining Network, Gaia Foundation, War on Want and other concerned environmental groups based in London put this campaign together. I spoke in the event on behalf of the International Peoples’ Conference on Mining (IPCM), a global alliance against mining plunder.\nThe Rise, Resist, Renew: Alternatives to Mines and Money campaign delivered a message of protest to the then ongoing Mines and Money Conference of big mining corporations in London.\nBritish mining interests in the Philippines\nGold-seeking investors such as Harwood Capital LLP has brought only misery and environmental destruction into the areas they want to exploit. They ought to leave the Philippines alone. Harwood and Bluebird, in particular, should take their dirty hands off Batangas.\nWe protested in front of Harwood Capital LLP, an investor of Bluebird Merchant Venture operating in Lobo, Batangas. Some 470 residents of Lobo and Batangas City were forced to evacuate their homes last September 24 because of air strikes and aerial bombings by the Armed Forces of the Philippines (AFP). While the combat operations were purportedly directed at communist rebels, the anti-mining communities were also attacked. These communities’ resistance against mining operations has stalled Bluebird’s efforts to start mining operations.\nAnother British mining outfit with documented human rights violations is the FCF Minerals in Runruno, Nueva Vizcaya. FCF Minerals has recently begun commercial operations of its 3,093.51-hectare gold-molybdenum mine in Quezon Town, Nueva Vizcaya Province. Independent scientific tests have lined its operations to the unusual levels of copper in the rivers flowing down from the mining area. The copper concentration exceeds safety standards.\nFive years before, in 2012, FCF Minerals ruined communities to push its own construction phase. It injured six villagers in the process. Human Rights Violations (HRVs) such as killings, harassments, land-grabbing, and forced evictions, typically occur with mining projects and operations in the Philippines.\nOur group also protested at the head offices of mining giants such as Vendata Resources, Glencore UK Ltd., Paulson Europe LP (Ashanti Gold), Rio Tinto, and Anglo American Plc. We lobbied and raised the issue of mining-ravaged communities at UK government agencies such as the Foreign Commonwealth Office (FCO) and the All Parliamentary Party Groups in Human Rights.\nThe UK Government delivered positive statements like expressing ‘concern’ with regards to the state of Human Rights in the Philippines. But it needs to do more to make their corporations responsible for its violations against the people and the environment.\nThe Filipino solidarity group Campaign on Human Rights in the Philippines (CHRP) also organized a forum with Filipino migrant workers. We discussed with them how the Filipino solidarity campaigns in UK could contribute much in protecting the natural resources of the Philippines against foreign mining plunder.\nPeople’s Referendum in Cajamarca, Colombia bans inroads of mining giant\nCamila Méndez, land and human rights defender, shared the experiences of the Colombian people in exercising their democratic right to decide.\nLast April, the people of Cajamarca voted in a referendum to decide if they will allow the mining project of AngloGold Ashanti in their municipality. They voted against the entry of mining in their land. A resounding 97.92 percent of 7,241 voted No to Mining.\nAngloGold is a UK-based mining company which owns the La Colosa Gold Mining project. The project intends to extract 28 million ounces of gold in Cajamarca. AngloGold maintains that the people’s referendum does not affect their mining concession in Colombia.\nMéndez said, “Our movement defends water, territory and life in the small municipality of Cajamarca, which is recognized as a foodbasket of Colombia for its diverse and significant food production”.\nThe Colombian Solidarity Campaign along with the London-based campaign organizers led a protest action in front of the Paulson Europe LLP office. It owns shares in AngloGold Ashanti. The protesters demanded AngloGold to respect the decision of Cajamarca and pull out of Colombia.\nInternational Solidarity crucial in protecting rights, environment\nThe Rise, Resist and Renew activities have raised the demands of mining-affected people from different parts of the world to London, headquarter of the mining giants. Individuals representing solidarity campaigns against corporate mining in Brazil, Colombia, Bangladesh, India, Philippines, Romania, Uganda and West Papua attended the public forums, protest actions and solidarity activities in this city of mining corporations. The global workers federation IndustriALL also participated. They laid out stories of their struggle in defense of the rights of their people and protecting the environment from plunder and corporate mining. IndustriALL shared their campaign against Glencore, one of the worst exploiters of mine workers in the world.\nTo cap off the many activities of Rise, Resist, and Renew campaign, we granted the ‘Shame Award’ to choice mining giants. One of the awardees was the British-Swiss firm Glencore Plc.\nWith its partner Xstrata, Glencore became notorious in the Philippines after paramilitaries linked to it had killed at least ten people who were known opponents of the company’s entry. Among those killed was the Italian priest Fr. Pops Tentorio. He supported communities fighting Glencore’s entry (through its local subsidiary, the Sagittarius Mines) in the area. Glencore-Xstrata planned to dig an open pit mine to extract the abundant Tampakan gold-copper deposit in Southern Mindanao. The Tampakan project area contains 15 million tons of copper and nearly 18 million ounces of gold according to SMI/Glencore Xstrata.\nFrom the mining site in Tampakan, SMI reportedly planned to build a 100 km underground pipeline to ferry the minerals towards Maasim for loading to the ships. Alongside the pipeline, it wanted to build transmission lines to a dedicated 500MW power plant.\nThe open-pit mine, the underground pipeline, the dedicated power plant near the famous Lake Sebu – all of it cast a fatal implication to the indigenous tribes who are being displaced, not to mention all the communities downstream who will lose their sources of clean water.\nThe mining project was rebuffed by indigenous peoples and peasants living downstream and on the project’s way.\nAfter fourteen years of holding on to mines and bloodily trying to break through the people’s resistance, Glencore finally sold its share (in the SMI venture) to Indophil Resources-NL and pulled out of the Philippines in 2015.\nClemente Bautista is the national coordinator of the Kalikasan People’s Network for the Environment, a national environmental campaign center established in 1997.",
    "source_domain": "bulatlat.com",
    "title": "‘Rise, Resist, Renew:’ campaign binds peoples against British global mining plunder",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/12/12/rise-resist-renew-campaign-binds-peoples-british-global-mining-plunder/"
}