{
    "authors": [],
    "date_download": "2018-02-03 19:29:21+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 22:29:44",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2018%2F02%2F02%2Fillegal-arrest-ndfp-peace-consultant-follows-unbelievably-bad-script%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2018/02/Baylosis_Resist_02022018.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“He is a publicly known person involved in advancing the peace process.”\nBy MARYA SALAMAT\nBulatlat.com\nMANILA – “The incredible circumstances surrounding the illegal arrest of 69-year old Rafael Baylosis, as related by the police, follow an utterly bad script that it won’t pass even for cheap comics.” This is how lawyer Rachel Pastores of the Public Interest Law Center (PILC) described the police story of the events that supposedly led to the arrest of Baylosis and his companion afternoon of January 31.\nBaylosis was arrested without a warrant on January 31 in Quezon City. The police claimed he and his companions were carrying illegal firearms. Later, the police added that there was a grenade “associated” with his brown rice, an accusation which Rafael Baylosis’ wife, Lou, vehemently denied. She has just given him that rice that afternoon. “I will not put a grenade in my husband’s rice.”\nWorse, according to Pastores, there are “hallmarks of perjury” in the police story as the police hastened to supply justifications for why they happened to be tailing, surveilling and then detaining Baylosis and Roque Guillermo Jr.\n“They said they heard info that two armed men were seen moving about in the area (in Katipunan). And when the police took a look, they said they saw these two men boarding a tricycle. Then a gust of wind lifted their shirt, and the police saw their gun. And then, they swooped and made an arrest.” But according to Pastores, Baylosis and his companions were unarmed. As such, the guns were planted evidence, and this is not the first time the police had done that, Karapatan secretary-general Cristina Palabay said at a press conference.\nBaylosis has been researching and consulting with various groups as part of his task in the Reciprocal Working Group on Political and Constitutional Reforms. His wife, Lou Baylosis, said this assignment is all the more imperative now given the talk on federalism and the Duterte administration’s cha-cha drive.\n“He is a publicly known person involved in advancing the peace process,” Pastores said of Baylosis. She added that the police claims flew in the face of Baylosis’ record and known habits – “hindi po siya isang sanggano na pagala-gala at may baril, siya ay nagsusulong ng pagbabago at peace talks para pag-usapan ito.” (He is not a thug wandering with a gun, he is a man advocating for change and peace negotiations to talk about this change.)\nHarry Roque ‘ignorant’ about JASIG\nBaylosis’ original bail is still active and in force, too, as per a Regional Trial Court decision, Pastores said.\n“The only basis for his arrest was the concocted story that a known 69-year old peace consultant was swaggering around a busy city street with a gun in his waist and a grenade “associated” (the police’s term, not ours) with the brown rice he was holding. What a way to plant and cook evidence,” Edre Olalia of National Union of People’s Lawyers said in another statement.\nAs to Presidential Spokesman Harry Roque’s statement, Pastores said he is clearly mistaken, or ignorant, about the JASIG (Joint Agreement on Safety and Immunity Guarantees). Roque had raised a brow when progressive groups demanded the immediate release of Baylosis citing JASIG.\nEven if the peace talks had been “terminated”, the JASIG has provisions that those who participated in it are granted immunity from surveillance, arrest and harassment, Pastores said. “It is expressly stated in the JASIG,” she added.\nWithout such a provision, there would have been no chance of a peace negotiations, Pastores said. That’s because this is the way to encourage both parties to the talks. How else would anyone participate if, in an eventuality, the talks bogged down, their very participation would be used to violate their human rights? Pastores said those provisions remain in force whether or not the peace talks have been terminated. After all, she said, JASIG is an agreement duly signed by the Government of the Republic of the Philippines and the NDFP. The two parties who signed it are of course expected to abide by it.\nShe also cautioned Presidential Spokesman Harry Roque against making himself “an accomplice in the killing of the peace negotiations.”\n“There is a public clamor for the peace negotiations. Many are calling for the peace talks to continue rather than have a killing spree,” Pastores said. She also said they are “seriously considering” to file counter charges.\n“This practice (of planting evidence) has to stop. Mahirap masanay ang pulis sa ganito.” (The police shouldn’t get used to doing this.)\nBaylosis arrest a violation of signed peace agreements, human rights\nNot only was the arrest of Baylosis a violation of the JASIG, it is also a violation of the Comprehensive Agreement on Respect for Human Rights and International Humanitarian Law, which the Philippine government and the NDFP had also signed. According to Renato Reyes Jr., secretary general of Bagong Alyansang Makabayan, this arrest is clearly a violation, too, of human rights and an attempt to sow fear among the people to prevent them from questioning the Duterte administration.\n“It’s a Marcos tactic, a tokhang tactic,” Reyes said of the arresting team’s planted evidence. He called this is an attack not just on the progressive organizations but on dissent.\nKarapatan noted numerous rights violations in the government’s conduct of the arrest of Baylosis and Guerrero. This included denial access to lawyers and human rights advocates. Palabay said, “We were there at 10 p.m.; we’ve seen him but the team was not allowed to get access to him” on January 31.\nBaylosis’ lawyer also said he had been asking for a lawyer since he was arrested but it was denied to him. He was also not read the Miranda doctrine at the time of his arrest.\nKarapatan and NUPL questioned the supposed guns seized from Baylosis and Guerrero. According to Palabay, seven in every 10 political prisoners in the country are slapped with trumped up charges related to possession of illegal firearms and explosives. “It’s the easiest way (for the government troops) to just plant so-called evidence and file criminal charges on activists to curtail their liberty,” she added.\nIn Baylosis’ case, the handgrenade that appeared out of thin air and which the police tacked into their first trumped-up claim will make the case non-bailable, Olalia told Bulatlat.\nInstead of sowing lies, violence, and tyranny, President Duterte and his administration would do better to respond to the needs and demands of the people, COURAGE chairperson Ferdinand Gaite said at the press conference. Other mass leaders also vowed not to be intimidated by the looming crackdown on dissent.\nVencer Crisostomo, leader of youth group Anakbayan, invited the public to join and support the commemoration of People Power on February 25, an anti-Martial Law day.",
    "source_domain": "bulatlat.com",
    "title": "‘Illegal arrest of NDFP peace consultant follows an unbelievably bad script’",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2018/02/02/illegal-arrest-ndfp-peace-consultant-follows-unbelievably-bad-script/"
}