{
    "authors": [],
    "date_download": "2017-01-02 10:18:14+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 17:23:37",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F01%2F02%2Fbooks-read-2016%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/01/books.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "1. Open Secrets, Alice Munro. I think there is a Munro Effect: A reader is initially lulled into thinking that a storyline is dull but it is only when the short story is about to end that he finally begins to see how he is completely immersed in the Munronian world.\n2. Discontent and Its Civilizations: Dispatches from Lahore, New York, and London. Mohsin Hamid. The novelist as essayist treats the readers with his fascinating views on literature, politics during the War on Terror, and the ‘discontents’ of globalization.\n3. People On Our Side, Edgar Snow. Difficult to read because of the horrors it exposed during the war against Fascism. An important historical record of Soviet military victory and China’s political situation in the 1940s.\n4. What is Philosophy? Martin Heidegger. Who better to introduce philosophical concepts like being and truth than the great philosopher himself?\n5. Beethoven Was One-Sixteenth Black and Other Stories, Nadine Gordimer. The stories here reflect the lives of South Africans during the post-apartheid era; but also a poignant portrayal of the human condition.\n6. Ill Fares the Land, Tony Judt. The historian explaining the roots of our economic uncertainties, a progressive critique of modern politics and the socialist alternative.\n7. Interpreter of Maladies, Jhumpa Lahiri. Stories of migrant families, Indians inhabiting strange places, individuals connecting with fellow human beings.\n8. Hateship, Friendship, Courtship, Loveship, Marriage: Stories, Alice Munro. Love for all ages, romantic relationships that defy stereotypes, stories that affirm the enduring power of humanity.\n9. The Tao of Pooh, Benjamin Hoff. Eastern philosophy introduced to the general public in a creative and entertaining format\n10. Death with Interruptions, Jose Saramago. Always impressed with the imagination of the author, his realistic depiction of the social condition, his belief in the strength of individuals.\n11. Babae, Obrera, Unyonista: Ang Kababaihan sa Kilusang Paggawa sa Maynila (1901-1941), Judy Taguiwalo. The situation of women workers and the role of unionism during the first half of the 20th century.\n12. The Book and the Brotherhood, Iris Murdoch. Less about the Marxist book in the novel but more about the ‘brotherhood’ of intellectuals, their middle-class/middle-age issues, and how they tried to overcome the crisis in their lives. Typical Murdochian.\n13. Mrs. Dalloway, Virginia Woolf. First person narrative of what transpired on a single day in early 20th century London.\n14. This Side of Paradise, F. Scott Fitzgerald. The world of a privileged young intellectual in pre-depression America.\n15. Hidden From History: 300 Years of Women’s Oppression and the Fight Against It, Sheila Rowbotham. A short course on the early history of the women’s movement.\n16. Displaying Filipinos: Photography and Colonialism in Early 20th Century Philippines, Benito M. Vergara Jr. An exposition of the colonial uses of various technological apparatuses.\n17. The Best of A. Lipin, Jess Abrera. Philippine history in the past three decades through the political cartoons published by the country’s leading newspaper.\n18. Philosophy Today #1, Jerry H. Gill. Bonus material here is an essay by philosopher Ludwig Wittgenstein.\n19. Ang Hayop na Ito! Virgilio S. Almario. Not just for kids but also for everybody who wants to appreciate folk history and poetry.\n20. The New Imperialism, David Harvey. Dissecting the militarism of the United States, the politics of empire building, and the global contradictions it engenders.\n21. Love in the Time of Cholera, Gabriel García Márquez. The social history of a previous era through the perspective of a man determined to win the love of his life.\n22. The Little Prince, Antoine de Saint-Exupéry. The touching story of a dreamer, an imaginative sketch of our world, a plea for hope.\n23. Tales for Little Rebels: A Collection of Radical Children’s Literature, Julia L. Mickenberg. An overview of literature intended to educate a new generation of progressives. Interestingly, the previously ‘radical literature’ is now part of mainstream culture. An obvious legacy of radicalism in contemporary society.\n24. Greenwash: The Reality Behind Corporate Environmentalism, Jed Greer. Beware of so-called green initiatives which mask the plunder and dirty activities committed by transnational companies and their local apologists.\n25. Planet of Slums, Mike Davis. Unmasking the real impact of capitalism and blind worship of the free market in urban societies.\n26. The Audacity of Hope: Thoughts on Reclaiming the American Dream, Barack Obama. Here is Senator Obama unveiling his liberalness, his confident belief that he is an agent of progressive change. An overview of American electoral politics.\n27. Sebyo, Carlos Humberto. A proletarian novel elucidating the principles of the national democratic struggle amid the decay of Philippine society.\n28. The Point is to Change it: An Introduction to Marxist Philosophy, John Molyneux. Suggested reading material for all those who want to learn more about Marxism, its basic tenets, historical legacy, and continuing relevance.\n29. Chronicles of Interesting Times, Gregorio C. Brillantes. Creative non-fiction essays on Philippine history, literature, and politics.\n30. In the People’s Republic: An American’s First-Hand View of Living and Working in China, Orville Schell. An American academic narrating his observations of China during the Cultural Revolution.\n31. Amusing Ourselves to Death: Public Discourse in the Age of Show Business, Neil Postman. Written three decades ago but still applicable today as TV continues to deaden the minds of the future generation.\n32. Republic or Empire: American Resistance to the Philippine War, Daniel B. Schirmer. Not all Americans supported the invasion of the Philippines. This book tells the story of the anti-imperialist movement which made a huge impact on American politics.\n33. Recapturing Democracy: Neoliberalization and the Struggle for Alternative Urban Futures, Mark Purcell. Useful text to understand how neoliberal economics is destroying cities and how the grassroots can challenge the dominant pro-business paradigm.\n34. Daughter of Fortune, Isabel Allende. The California Gold Rush made alive through the stories of migrants, adventurers, fortune-seekers, natives, people of color, lovers.\n35. Undermining Patrimony: The Large-Scale Mining Plunder in Mindanao and the People’s Struggle and Resistance, Rural Missionaries of the Philippines. Unique for highlighting the struggles of the Lumad and the people of Mindanao against corporate mining. Unique because it featured testimonies from NPA leaders.\n36. How to Write a Thesis, Umberto Eco. And also for those not writing a thesis but want to pursue research and other types of writing.\n37. China and Socialism: Market Reforms and Class Struggle, Martin Hart-Landsberg. China is no longer adhering to socialist aims and more importantly, its market-driven reforms are destroying the lives of the poor not just in rural China but also in neighboring countries.\n38. The Bell, Iris Murdoch. Individuals dealing with various psychological problems as they try to build a religious community. A novel, a semi-philosophical treatise, a Murdochian book.\n39. The Name of the Rose, Umberto Eco. Historical novel about a murder in a medieval abbot. But the book is also a comment on modern scholarship.\n40. The Old Man and the Sea, Ernest Hemingway. While reading the book, what I imagined were the childhood trips we took in a small fishing village in Unisan, Quezon\n41. Sociology in the Age of the Internet, Allison Cavanagh. The author covers many topics that continue to engage academics about the sociological impact of the Internet in our world today.\n42. The Pristine Culture of Capitalism: A Historical Essay on Old Regimes and Modern States, Ellen Meiksins Wood. An alternative reading of British capitalism, the formation of the capitalist state, and the rise of global capitalism.\n43. The Zinn Reader: Writings on Disobedience and Democracy, Howard Zinn. Historian and activist exposing the myths of American propaganda, defending radicalism, and exhorting the people to continue the struggle for real democracy.\n44. My Century, Günter Grass. A hundred years of German history from various witnesses.\n45. Welcome to the Urban Revolution, Jeb Brugmann. An optimistic view of the urban revolution, a reminder for policymakers to balance the profit-motive with the need to co-develop societies with ordinary stakeholders.\n46. Diego Rivera: A Revolutionary Spirit in Modern Art, Andrea Kettenmann. Portrait of an artist as an independence advocate, communist sympathizer, and communist cadre.\n47. Einstein and Relativity, Paul Strathern. My problem is that before I read this brief profile about Einstein and his theories, I stumbled upon an article alleging that the scientific contributions of Einstein’s wife were ignored by mainstream scholarship.\nMong Palatino is a Filipino activist and former legislator. Email: mongpalatino@gmail.com",
    "source_domain": "bulatlat.com",
    "title": "The books I read in 2016",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/01/02/books-read-2016/"
}