{
    "authors": [],
    "date_download": "2018-02-03 19:29:08+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 19:11:05",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2018%2F02%2F02%2Fwebsite-alternative-news-outfit-attacked%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2018/01/defendpressfreedom_cegp.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "NUJP sees the attack on Kodao as part of the Duterte government’s “efforts to silence critical media, as seen in the continuing attempt to shut down Rappler, threaten other news outfits, and other voices of dissent.”\nBy BULATLAT\nMANILA — The website of alternative news outfit Kodao Productions (www.kodao.org) was attacked, rendering it inaccessible.\nThe website was subjected to a code injection attack through online publishing platform WordPress around midnight last night, Feb. 2, that prevents its website technicians from logging in.\nIn a statement, the National Union of Journalists of the Philippines (NUJP) condemned the attack on the alternative news outfit’s website, noting that the attack came when other media organizations are also “under relentless attacks from enemies of press freedom and other human rights.”\nLast month, he Securities and Exchange Commission’s (SEC) revoked the registration of Rappler, an online media outfit. At least 54 radio stations under the country’s Catholic Media Network (CMN) are in danger of being silenced as its application for renewal of franchise remains pending at the Lower House.\nNUJP sees the attack on Kodao as part of the Duterte government’s “efforts to silence critical media, as seen in the continuing attempt to shut down Rappler, threaten other news outfits, and other voices of dissent.”\nFILE VIDEO: A Filipino journalist narrates his near-death experiences in covering the news. Raymund B. Villanueva, an alternative journalist for over two decades, says: “Our job is to tell the stories, to report the stories and not to become the stories ourselves.”\nEstablished in 2000, Kodao is the second oldest existing alternative media outfit in the country. It is known for its comprehensive coverage of the GRP-NDFP peace process, indigenous peoples struggles, human rights, environment and other social issues.\nThis is not the first time that Kodao was targeted. In 2006, when Gloria Arroyo declared a State of National Emergency, Kodao was the first media victim when its award-winning daily show “Ngayon na, Bayan” in DZRJ was suddenly prevented from airing. Kodao was also wrongfully accused and charged with rebellion, which was subsequently dismissed for lack of merit.\n“The NUJP stands with Kodao Productions and all other legitimate media outfits that only seek to amplify the voice of the people against tyranny, neglect and abuse by those in power,” NUJP Acting Chair Atty. Jocelyn Clemente and Secretary General Dabet Panelo said.",
    "source_domain": "bulatlat.com",
    "title": "Website of alternative news outfit attacked",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2018/02/02/website-alternative-news-outfit-attacked/"
}