{
    "authors": [],
    "date_download": "2017-12-12 08:24:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 10:33:20",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F12%2F12%2Fchristmas-mix-protests-duterte-martial-law-human-rights-day%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/12/just_peace.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Some came in costumes depicting the horrors of rights violations.\nBy MARYA SALAMAT\nBulatlat.com\nMANILA – Bright and colorful Christmas lanterns and lights were twinkling at storefronts and light posts when an estimated 8,000 protesters marched to Chino Roces Bridge (formerly Mendiola) on December 10, International Human Rights Day. With the country already into its traditionally long Christmas season, and amid fresh news of threats of martial law in the air, how did it affect the protesters of human rights violations?\nThe usual program was still held to formally mark the day. They held it December 10 afternoon at the Bonifacio Shrine in Manila. Speakers from various groups and sectors contributed to the annual reckoning of how much the government has contributed to the statistics of extra-judicial killings, filing of allegedly falsified charges, criminalizing of democratic acts of dissent, and pushing “development” projects that force people into low-paid jobs, hunger and homelessness, evacuation, protests and rebellion, among others.\nHuman rights defenders from all over Metro Manila and some provinces shouted out the disparity between President Duterte’s claims and promises and what the people have actually received.\n“Duterte is not only lying about drugs, so-called federalism and the elitist RevGov. He and his court jesters are misrepresenting the Filipinos’ desire for authentic change with his drive towards one-man rule,” said Joel Saracho, spokesperson of LODI (Let’s Organize for Democracy and Integrity), a group of artists and media workers.\nRaling gabi with lighted torches, mural effigies\nThe human rights defenders marched to Chino Roces Bridge (formerly Mendiola) by nightfall of December 10. They lighted and carried torches and chanted slogans asking who the real terrorists are, as well as predicting the downfall of the “dictator, puppet Duterte.” Some came in costumes depicting the horrors of rights violations.\nProtesters from Caloocan such as the Youth Movement Against Tyranny wore black garbage bags to dramatize the increasing number of killed urban poor due to President Duterte’s drug war.\nThe Youth Act Now Against Tyranny, an alliance of more than 300 student councils, publications and organizations that mobilizes students and youth to join in protests in various areas of the country, denounced “the series of killings and human rights violations under a looming dictatorship of President Duterte.”\nAside from members looking like walking body bags, they brought a huge cross with the calls “Stop the Killings” on one side and “Just Peace” on the others side. Older women opted to diss the president’s penchant for tough talking and threatening or ordering the government troops to kill. They called Duterte a pest, and a “Boy Ratrat (Mr Pepper-you-with-bullets).”\nThe group Scientists Resist Tyranny raised high their fists and calls through cardboard cutouts.\nIn closing the Human Rights Day program in Mendiola, an enormous Duterte mural effigy with a design that took a politicized leaf from lantern parades was rolled near the stage.\nThe effigy visualized the ordinary people’s condemnation of President Duterte’s killings and trash talk. Meanwhile, protesters decried the growing number of human rights violations his various wars have been causing. The president’s evil eyes in the mural effigy were portrayed as lighted with fire.\nFive students of Fine Arts from UP who are members of Ugat-Lahi artists collective squeezed the making of the mural in between completing their requirements for finals. The enormous mural effigy “unfolded” to reveal Duterte’s “real face” inside. It lit up like a lantern at first and took 15 minutes, three songs, to burn.\nThe protesters concluded the rally with vows to persist in defending human rights. They will be back in Mendiola. It will not be a prosperous new year, this much they anticipated from the lack of wage hike and end to contractualization, the lack of land reform, lack of substantial improvement in health, education, transportation, jobs, and the new slew of regressive taxes under Duterte’s proposed tax reforms.\n“Instead of addressing the root cause of people’s discontent mainly borne out of landlessness, poverty and injustice through pursuing peace talks with revolutionary groups, President Duterte chose to launch an all-out war by terminating the peace talks and threatening to re-arrest NDFP peace consultants. He let the AFP and PNP a free hand to launch attacks against the mostly in poor rural communities,” warned Anakpawis Rep. Ayik Casilao.",
    "source_domain": "bulatlat.com",
    "title": "Christmas infuses protests against Duterte Martial Law on Human Rights Day",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/12/12/christmas-mix-protests-duterte-martial-law-human-rights-day/"
}