{
    "authors": [],
    "date_download": "2018-02-03 19:28:55+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 19:33:07",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2018%2F02%2F02%2Fduterte-crackdown-vs-left-govt-troops-also-target-unionists-mindanao%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2018/02/respect_freedom_CO_FB.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "On January 29, around 1 p.m., soldiers from the 66th IBPA & 25th IBPA gathered the residents of Sitio Pogi, Brgy. San Miguel, Compostela, and presented names of civilians they alleged to have links and tasks in the revolutionary NPA, including some union leaders of a banana company, namely Roland Cobrado, Perlita Milallos, and Elmer Atamosa.\nBy MARYA SALAMAT\nBulatlat.com\nMANILA – President Duterte had promised change, peace, and for workers, regularization on the job instead of contractualization. But nearly two years since he took power, what he has regularly brought to the working people are price hikes and increased threats on their democratic rights, the Kilusang Mayo Uno regional chapter in Southern Mindanao said in a statement this week.\nAfter Duterte announced on January 28 that his administration would go after what he and the military accused of being “legal fronts” of the New People’s Army (NPA), the progressive labor center noted an intensification in troops’ harassment of their leaders and unionists in the region.\nCarlo Olalo, secretary-general of KMU in Southern Mindanao, said that on January 29, around 1 p.m., soldiers from the 66th IBPA & 25th IBPA gathered the residents of Sitio Pogi, Brgy. San Miguel, Compostela, and presented names of civilians they alleged to have links and tasks in the revolutionary NPA.\nIncluded in the list are some union leaders of a banana company, namely Roland Cobrado, Perlita Milallos, and Elmer Atamosa. Olalo said the government troops brazenly told the residents to convince these union leaders to “surrender to the authorities within three (3) days or else be arrested or killed.” The soldiers told the plantation workers, relatives and friends of these union leaders that they are just implementing the order of the Commander-in-Chief to go after leaders of “legal fronts,” Olalo said.\nThe KMU-SMR condemned the threat to the union leaders as well as President Duterte’s announcement of a crackdown. The Compostela area has already been recognized as a hotspot of labor rights violations by the International Labor Organization (ILO). For years, various fact-finding missions have documented the government military’s intervention in labor-related matters.\n“Many of our union leaders have faced threats, harassment or death due to their resistance to capitalist oppression. Cobrado, Milallos and Atamosa are known not for being leaders of the NPA but for being unfailing opponent of illegal dismissal, contractualization and union busting,” Olalo said.\nAbout this time last year, the court ordered the release of a KMU labor organizer detained by the elements of Task Force Davao in Sirawan Toril, Davao City. The court dismissed the complaint leveled against him by state authorities. That case is a “testament that the AFP is only concocting fallacious charges against leaders and members of progressive organizations in a bid to suppress it”, Olalo had said at the time. Now they are back to fending off increased instances of similar threats of arrests. Then and now, they report noticeable surveillance of their legal, democratic activities. Many concerted actions including the holding of a strike, protest camp, union election and rallies of workers’ groups in Mindanao have been reportedly attacked also by the military even if the workers’ demands and conduct were as stipulated in the Labor Code.\nAs troops were going around civilian communities in Mindanao issuing threats against legal and progressive leaders, leaders of similar organizations outside of Mindanao were also targeted in simultaneous actions of the Duterte administration and the military.\nDays ago, the leader of the teachers’ union under the Alliance of Concerned Teachers in the National Capital Region (ACT-NCR) was targeted for arrest. Olalo said they have also monitored “calls for surrender” of known progressive leaders such as Sheena Duazo of BAYAN-SMR and Hanimay Suazo of Karapatan-SMR aired at local radio stations ABS-CBN’s DXAB and Maayong Buntag Mindanao. He shared that a so-called NPA “surrenderee” named Quiroga was being paraded by the military as a supposed coordinator of Anakpawis Partylist.\nOlalo said their members have also reported a seeming simulation of lockdown in Davao City and other parts of the country.\n“The workers will not consent but resist all attempts to violate their constitutional rights and rights provided for under international labor laws,” Olalo said.\nShould something untoward happen to the three union leaders and to other workers or unionists because “of this senseless government crackdown,” Olalo said, workers will hold both the AFP and the US-Duterte regime accountable.\nHe said the workers will continue calling for increased wages, more regular jobs, and respect for their democratic rights. He urged all workers to unite in opposing the terror acts of this regime and uphold the democratic rights of workers and the people.",
    "source_domain": "bulatlat.com",
    "title": "In Duterte crackdown vs Left, govt troops also target unionists in Mindanao",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2018/02/02/duterte-crackdown-vs-left-govt-troops-also-target-unionists-mindanao/"
}