{
    "authors": [],
    "date_download": "2017-10-06 18:05:20+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:34:44",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F10%2F06%2Ffinding-contentment-teaching-lumad%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/10/geming-03.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“They are determined and eager to learn.”\nBy ANNE MARXZE D. UMIL\nBulatlat\nMANILA – Geming Andrea A. Alonzo, 32, was a city girl who grew up in the capital region. She could have opted to work in the city, but instead, she chose to teach in a Lumad school in a remote mountainous village in Mindanao, which can only be reached after hours of trekking.\nBut she does not mind the long hike, or living without electricity and internet. She said she feels fulfillment in serving Lumad children, and adults too, some of whom only saw and held a pencil when their school, the Center for Lumad Advocacy Networking and Services Inc. (CLANS) was established in their community.\nAlonzo is the current executive director of CLANS Inc. She previously worked as a teacher at the Batibot Early Learning Center (BELC) in Marikina City.\nAlonzo said she learned the ills afflicting Philippine society because her parents were both community organizers, while they were still young. After college, she became a member of the Salinlahi Alliance for Children’s Concerns, a network of organizations working for children’s rights, and holds discussions with children on poverty and its roots.\nThe attacks on Lumad schools in Mindanao made her decide to settle down in the region.\nA turning point was in 2011, when she joined the fact-finding mission in Upper Suyan village in Sarangani province, which left a deep impact on her.\n“Soldiers encamped in the community, when in fact, there were no guerillas in the area. The families barely have food. They said they had to subsist on cassava,” she said in an interview with Bulatlat. The militarization forced CLANS and the Blaan Literacy School and Learning Center (BLSLC) to close down, affecting the education of the Lumad children.\nLumad students as inspiration\nAlonzo said Lumad students are her inspiration as she saw how the Lumad value education.\nUnlike the students in Batibot, she said, most of the students in the province are enmired in poverty. Many cannot afford to eat three meals a day. But even then, she said, the students as well as parents, show willingness to change their conditions. They persevere in their studies, both the Lumad children and their parents.\n“They are determined and eager to learn,” she said.\nLumad students are never late, she said. Parents would fetch the teachers 30 minutes before classes would start. “It was embarrassing if ever we wake up late,” she said.\nStudents come to school in their everyday clothes and wearing only slippers, no fancy shoes or bags.\nParents have classes during weekends. They have academic classes in the morning and agricultural classes in the afternoon.\nIn return, Alonzo said, her experience in the province as a teacher to Lumad also taught her contentment. “Wala na akong hinahanap pang iba.”\nLanguage was the only challenge she faced because she came from Luzon and had to learn the language of Dulangan Manobos. But this did not deter her, and to adjust, she had an interpreter during classes. Many students learned Tagalog, while she, in turn, learned their language.\nOvercoming motherly yearnings\nAlonzo’s son, four-year old Damian, is also with them in the region. But unlike the typical family set-up, Alonzo and her husband are not with their son 24/7. Her husband is an organizer among peasants in Davao, while she is in Sarangani. A relative takes care of Damian, who they get to visit during time off from work.\nEven then, she makes sure that Damian understands their situation. She is also grateful to the relatives who help explain to Damian why his parents have to be away. When asked about his mother, Damian would say, “At the office, working with the Lumad.” When asked about his father he would say, “At the office, working with peasants.”\nShe said they opted to bring Damian to the province for him to see the real condition of the people in the countryside.\n“Unlike me who grew up only hearing this from my parents, Damian would get to experience it,” she said, adding that Damian also goes to the farm and plays with peasant children.\nAs a mother, she also gets sentimental, because she does not get to put Damian to bed or be the one he goes to about his feelings and secrets. But she does not give in to emotionalism, and persists to overcome any anxiety, as she knows that her son is well cared for and loved.\nTo fight for the Lumad’s education\nClans have 52 schools in the Soccsksargen region. Due to the militarization in the communities, 29 of these schools were forced to stop operations. Just recently, Alonzo said four schools in Upper Suyan, Sarangani had resumed its classes because soldiers pulled out of the community. Other schools would also resume operations after being closed for the past eight months due to intense militarization.\n“The teachers and students have to be kept safe first,” she said.\nMartial law remains imposed in the whole of Mindanao until the end of the year, which gives the military leeway in their pursuit of supposed “enemies of the state.” This has worsened the attacks on the Lumad, with leaders getting killed and arrested every month.\nFour teachers of CLANS and members of the Parent and Teachers Conference have been charged with trumped-up cases.\nFor Alonzo, to feel fear because of their situation is normal. But the Lumad’s collective effort to fight for their right to education gives her strength to fight alongside them and give them the services that the government has long denied them.",
    "source_domain": "bulatlat.com",
    "title": "Finding contentment in teaching the Lumad",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/10/06/finding-contentment-teaching-lumad/"
}