{
    "authors": [],
    "date_download": "2018-02-03 19:28:30+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 10:15:47",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2018%2F02%2F03%2Fthe-worst-of-times%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2018/01/DTj_l23U0AAEO3N.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“The best in the world” was how former chief justice Hilario Davide, Jr. described during a Senate hearing the 1987 Philippine Constitution that he and other members of the Constitutional Commission created by then president Corazon Aquino drafted.\nThe description may not be completely accurate. But it suggests that because the present charter was drafted by individuals of different political persuasions (Mrs. Aquino named to that Commission even such personalities as the late Blas Ople, who was minister of Labor during the Marcos regime), and the discussions over its proposed provisions were, in former chief justice Davide’s words, “exceptionally deliberative and objective,” what was produced was outstanding in several ways.\nThe circumstances during which the basic law was drafted were also crucial. It was in a sense the best of times. The Philippines had just emerged from 14 years of dictatorship, during which the patriots who comprised the resistance to it had amassed enough experience and insight to recognize the need to defend and protect in the Constitution human rights and individual liberties; to put in place safeguards against the return of authoritarian rule; and to craft a charter committed to the democratization of political power by requiring the State to “guarantee equal access to opportunities for public service, and prohibit political dynasties as may be defined by law (Article II, Section 26).”\nThe Constitution also explicitly protects, in Article III Section 4, free expression, free speech, press freedom and freedom of assembly. It is for that reason that it is the envy of many journalists’ groups and human rights defenders in our neighboring countries, whose constitutions do not endow those rights with the same protection.\nIts framers understood so well the value of those freedoms, as well as the important role the press and media play in providing the information relevant to the people’s understanding of their economic, social, political, cultural, and natural environments, hence their limiting the ownership and management of the media to Filipino citizens rather than allowing foreign ownership (Article 16, Section 11).\nThe wisdom of that provision has since been validated by the negative experience of other countries that have allowed foreign media ownership. Australian journalists, for example, complain that much of what appears in foreign-owned newspapers and broadcast networks in their homeland, because they’re focused on profitability rather than relevance, is not serious but trivial, and that they publish and air public relations “flackery” rather than meaningful reports relevant to the concerns of their audiences. Instead of encouraging journalistic excellence, they dumb down the news profession.\nThe long reach of the biggest foreign media conglomerates (media mogul Rupert Murdoch’s News Corp.’s newspapers and television companies, for example, reach an estimated two billion people daily) endows them with the capacity to influence and shape the opinions, values, and ideas of their vast audiences and makes them more powerful than governments. And yet, in apparent ignorance of the implications of foreign media ownership on citizen awareness and understanding of public issues, the amendment of Section 11 has been proposed numerous times by members of the Philippine Congress.\nIn 2014, for example, then-speaker Feliciano Belmonte declared that once Congress convenes as a constituent assembly, it would amend Section 11 or remove it altogether from the Constitution to allow foreign media ownership.\nThe exact same thing, and worse, is likely to happen today, during the Duterte regime’s mad rush to amend or even completely replace the Constitution with one more consistent with its hunger for more power, contempt for human rights, and hostility to the democratic imperative of government accountability. In a cynical display of regime power, the Securities and Exchange Commission (SEC) used the Constitution’s Section 11 of Article 16 to revoke online news site Rappler’s registration, even as the Duterte regime’s “supermajority” is preparing to completely hand over not only the media but the entire country as well to foreign interests.\nFormer chief justice Davide’s skepticism over whether amendments will be proposed and adopted with some amount of deliberation, intelligence, and concern for this country’s future is understandable. The very same Congress whose leadership and members are contemplating the extension of their own terms of office, the suspension of elections, and other self-serving schemes, cannot be trusted with amending or framing a Constitution that will safeguard Filipino rights and liberties; assure justice for all; promote the rule of law; enhance and protect Philippine sovereignty; accelerate the democratization process through the dismantling of dynastic rule; and enable the adoption and implementation of those social and economic reforms needed to pull millions out of the deepening pit of poverty.\nThe shift to federalism from the present unitary form of government is supported by another former chief justice, Reynato Puno, who views it as a means of arresting the Philippines’ rapid decline into a failed democracy. And yet other countries with a unitary form of government have not been as outstanding failures in democracy as the Philippines (France is an example), while others under a federal form of government are similarly failing.\nThe United States federal government itself, under the Donald Trump presidency, has been criticized for its incompetence and authoritarianism, and some US states’ continuing descent to police brutality and racism. And although militarily powerful, the US, say informed observers such as the Massachusetts Institute of Technology’s Emeritus Professor Noam Chomsky, has acquired such characteristics of a third world country as hunger and poverty among a significant number of its population.\nThere is an entire library of studies on the characteristics, the merits, the advantages, and the disadvantages of both the unitary and federal forms of government. What is certain is that the shift to federalism in the Philippines cannot be rushed without risking, among others, the strengthening rather than dismantling of dynastic power at the regional and provincial levels and the resulting diminution in the democratic imperative of holding to account governments at every level.\nWhat is crucial to how and when the interminable process of Philippine democratization will ever reach fruition is not so much the form of government as the vision and intelligence, the patriotism, dedication, and honesty of the country’s so-called “leaders.” As recent events have amply demonstrated, the sycophants in power possess exactly the opposite characteristics. They are self-aggrandizing and self-serving, are the corrupt creatures of foreign interests, and concerned solely with protecting and enhancing their personal, familial and class advantages rather than the well-being of those they claim to represent.\nFormer chief justice Davide may not be entirely right. The Philippine Constitution may not be that perfect and may need amendment. Federalism, with its promise of the devolution of power and the enhancement of the independence of regional, provincial, and local governance, may be a preferable form of government.\nBut amending the Constitution is too serious a matter to be entrusted to clueless knaves who daily prove through their words and actions that they do not have the wisdom, the strength of character, the integrity and the patriotism of the framers of the 1987 Constitution. That task is best done in the best circumstances, and left to men and women better than those who today claim to represent the people but who’re only for themselves — and who have thus made these the worst of times for the Filipino nation.\nLuis V. Teodoro is on Facebook and Twitter (@luisteodoro). The views expressed in Vantage Point are his own and do not represent the views of the Center for Media Freedom and Responsibility.\nwww.luisteodoro.com\nPublished in Business World\nFeb. 2, 2018",
    "source_domain": "bulatlat.com",
    "title": "The worst of times",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2018/02/03/the-worst-of-times/"
}