{
    "authors": [],
    "date_download": "2017-10-06 18:05:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:36:11",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F10%2F06%2Fcity-mountains-teachers-dedicate-lives-lumad-right-education%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/10/michael-sumbian.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Despite the attacks on Lumad schools, there are dedicated teachers who choose to continue their work for Lumad children. They have also become the target of the attacks as there are trumped up charges against these teachers and some are even languishing in jail.\nThe attacks have continued and intensified since martial law was declared in Mindanao. On World Teachers’ Day, Oct. 5, Aubrey Masalon, teacher-in-charge of the Center for Lumad Advocacy and Services Inc. (Clans), her husband Nestor Masalon and four other community leaders were held by the 73rd Infantry Battalion. As of this writing, the Save Our Schools (SOS) Network said they have not yet contacted the teachers. A quick reaction team was already dispatched to the area.\nTwo teachers interviewed by Bulatlat shared joys, inspiration, and overcoming anxieties as they help the Lumad children with their education, which they were deprived of for so long.\nFinding contentment in teaching the Lumad\nGeming Andrea A. Alonzo, 32, was a city girl who grew up in the capital region. She could have opted to work in the city, but instead, she chose to teach in a Lumad school in a remote mountainous village in Mindanao, which can only be reached after hours of trekking. (Click here to read the whole story)\nNursing student becomes Lumad educator\nBecause of the tradition of the Manobos, Michael Sumbian, 30, chose to be a teacher to his fellow Lumad in Agusan Del Sur. While still a nursing student, his elders told him that a Lumad should give back to his tribe after finishing studies. (Click here to read the whole story)\nRead also:\nRonnie Garcia | Mansaka educator dedicated life for fellow Lumad\nSeptember came with sadness for the Lumad of Davao del Norte, as they mourned the death of their classmate, Obello Bay-ao, who was killed last Sept. 5, but also the unexpected passing of a dear friend and teacher, Ronnie Garcia.\nTeacher Miguel, helping Lumad children fulfill their dreams\nThe 24-year-old teacher came from Arakan Valley, North Cotabato. After graduating from college and passing the licensure examinations for teachers, he left behind his parents and seven siblings and traversed five mountains to teach at STTICLCI.\nFrom Diliman to Lianga | UP grads teach, serve the Lumad\nDriven by the call to serve the people, three young graduates of the University of the Philippines (UP) took that risk and left everything they were used to, everything familiar, to teach and help defend the Lumad community.",
    "source_domain": "bulatlat.com",
    "title": "From the city to the mountains, teachers dedicate lives for Lumad right to education",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/10/06/city-mountains-teachers-dedicate-lives-lumad-right-education/"
}