{
    "authors": [],
    "date_download": "2017-10-06 18:05:33+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:18:34",
    "description": null,
    "filename": "http%3A%2F%2Fbulatlat.com%2Fmain%2F2017%2F10%2F06%2Fnursing-student-becomes-lumad-educator%2F.json",
    "image_url": "http://bulatlat.com/main/wp-content/uploads/2017/10/michael-sumbian.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“They asked, ‘Are you our new teacher?’ and the elders began to thank me. It was a touching moment.”\nBy ANNE MARXZE D. UMIL\nBulatlat\nMANILA – Because of the tradition of the Manobos, Michael Sumbian, 30, chose to be a teacher to his fellow Lumad in Agusan Del Sur. While still a nursing student, his elders told him that a Lumad should give back to his tribe after finishing studies.\nAlthough he was not able to graduate, he still ended up teaching his fellow Lumad.\nHis group Yumabagan, an organization of the Manobos pushing for their right to self-determination, facilitated his exposure to the communities in the mountainous area of Agusan Del Sur.\nHe remembered the Lumad children’s excitement upon seeing him. “They asked, ‘Are you our new teacher?’ and the elders began to thank me. It was a touching moment,” he told Bulatlat in an interview.\nThat moment convinced him to become a teacher to the Lumad community. In 2013, he underwent the necessary training to be able to teach and became a volunteer teacher of the Religious Missionaries of the Philippines-Northern Mindanao Region (RMP-NMR)’s literacy and numeracy program.\nAs a teacher of RMP-NMR’s literacy and numeracy program in San Luis, Agusan Del Sur, Sumbian was not spared from the harassment by soldiers and even survived a strafing incident in 2015. He was not discouraged but became even more committed to teach Lumad children.\n“Nasabi ko na dito na ako sa kanila (I told them that I now really belong with them),” he said, adding that Lumad children are not only his students, but had also become his family.\nAdjustment from the city to the mountain\nAlthough his family are Lumad, they are based in the city where he grew up and studied up to college. He admitted that it took some time for him to get used to the life in the far-flung community.\nAt first, he said, he had difficulties adjusting. At times, food is scarce, and they only eat root crops. There is also no electricity in the community.\nBut the Lumad community is warm toward him. He was treated like family, which later gave him the courage to stay. The dire condition of children was also a factor, he said.\nLike in other provinces, Lumad children in Agusan Del Sur and Bukidnon were deprived of government services like education. He said it prompted the elders to seek help from non-government organizations and religious groups, like the RMP-NMR. The RMP-NMR acted on their appeal immediately, he said. There are now eight non-formal schools in Agusan Del Sur and seven in Bukidnon.\nHe said most of their students have not set foot in any school because the community is too far from the town proper of San Luis, Agusan Del Sur. The travel time is three hours on the road and then another six hours of walking going to the community. The fare costs P2,500 ($49). It is exhausting, he said, but the smiles of Lumad children take all his fatigue away.\n“Seeing my fellow Manobos’ hunger for education made me decide to continue to teach. The elders are thanking me even if I was not a graduate of education. I was deeply moved by it,” he said.\nAttacks against Lumad schools\nRMP’s schools were not spared from the attacks of the military. He said the communities where there are RMP schools were also heavily militarized. Soldiers even encamp in their schools and interrupt their classes.\nSince April this year, operations by soldiers and paramilitary groups triggered an evacuation in Cabangcalan and San Fernando, Bukidnon, and the RMP school in the area has joined residents who encamped in the Malaybalay City Capitol grounds.\nSoldiers threatened to kill the teachers or to have them jailed on false charges just to make them stop teaching the Lumad. “All these, just because of the accusation that we are a school of the New People’s Army, which is not true,” he said.\nIn fact, most of their students who have finished high school were also able to make it to college.\nSumbian was not spared from threats. Aside from the strafing incident in 2015, he said he has been receiving death threats sent through his mobile phone.\n“Kung hindi raw kami titigil sa pagtuturo papatayin kami. At wag na lang daw kaming magpakita sa kanila kasi pag mahanap kami, papatayin kami,” he recalled. (If we don’t stop teaching we will be killed. We should not let them see us because they will kill us.)\nBut, he said, the teachers are not afraid because the truth is on their side. “We are not doing anything bad, we’re just teaching Lumad children,” he said.\n“The government wants the Lumad to remain uneducated so that they could grab their land and abuse its resources. Their land is their life,” he added.\nHe said leaving the community never crossed his mind despite attacks on schools and educators. To be terrified because of harassments and attacks is inevitable, he said. But the children’s dreams are their motivation to continue.\n“What will happen to the dreams of the children? Some parents ask us, who will teach them if we leave. That’s my motivation,” he said.\nIn fact, their students were able to pass the Junior High School exams and are currently Grade 8 at the\nLumad high school. Some students of the DepEd school also transferred to the RMP school. However, some Lumad families were threatened that if they do not remove their children from the school, they will get less financial assistance from the government’s Pantawid Pamilyang Pilipino Program, or be completely removed from the list.\nBut life continues for Sumbian. Despite attacks, teachers like him continue to serve their students to help them fulfill their dreams and that of their ancestors who taught them to give back to their communities.\n“If we die because of the baseless accusations, then it’s okay. At least the children knew that we contributed to making their dreams come true and we have not done anything wrong,” he added.",
    "source_domain": "bulatlat.com",
    "title": "Nursing student becomes Lumad educator",
    "title_page": null,
    "title_rss": null,
    "url": "http://bulatlat.com/main/2017/10/06/nursing-student-becomes-lumad-educator/"
}