{
    "authors": [],
    "date_download": "2017-06-14 23:12:56+00:00",
    "date_modify": null,
    "date_publish": "2017-06-13 05:04:56",
    "description": null,
    "filename": "https%3A%2F%2Fbatibleki.visitaruba.com%2F8am-buzz%2Fabout-aruban-culture-a-conversation-with-glenn-thode-rector-ua-universidad-di-aruba%2F.json",
    "image_url": "http://batibleki.visitaruba.com/wp-content/uploads/2015/11/batibleki.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Glenn says we have to pay close attention to details, for example the third couplet of our national anthem: Grandeza di bo pueblo ta su gran cordialidad.\nMany consider the famous friendliness of Aruba’s people a virtue, an element of added-value that comes with sun, sand and sea.\nBut Glenn says it is a core value of the island’s culture. Arubans, and the residents of Curacao and Bonaire to a certain extent, enjoy a rare gift, he calls it “cultural code switching,” and it occurs intuitively and instinctively when we alternate between two or more languages, in the context of a single conversation.\nIn Aruba we alternate between five. Kids do it, adults do it, even babies do it: Papiamento, English, Dutch, Spanish and whatever else is thrown into the heritage, Italian, Chinese, Hindi.\nAnd that is a unique, authentic and particular aspect of the island’s culture.\nHere comes the part which some might contest: You cannot say that Papiamento is the sole communication vehicle in our culture. It’s simply not true. Our culture is inclusive and makes room for five languages, including a sixth, body language.\nArubans can act like Americans one moment, speaking in a clear gringo accent, then switch to Dutch and douse their French fries with Mayo; then order an Old Parr on the rocks in perfect Spanish, and always address the server as dushi.\nSo that openness to other customs, tastes and sounds, typifies our culture, Glenn states. We are not protectionists, exclusionists, on the contrary we invite in, assimilate, and adapt.\nWe were sitting in the coffee shop at UA, as Glenn referred to Star Trek, where the Borg, a fictional alien group, collects other organisms and links them to the “collective” so they all become part of the “hive,” and, quoting THE famous line: “Resistance is Futile.”\nThe beauty of this is that you do not have to give up anything to become Aruban, because all of your cultural distinctiveness of origin, can just be introduced and added to the local customs.\nAruba is a bit like that “hive,” says Glenn, when people come here from all over the globe, in a short time, they start switching between languages and developing a fondness of Bami Goreng and Keshi Yena. Aruba transforms immigrants into Arubans by teaching them the Aruban ways and by accepting and assimilating their imported cultural contributions.\nIt makes the island very cosmopolitan, Glenn reiterates. Our strength is in our flexible mentality. We easily make people feel at home by communicating in their language and by reading their particular social cues correctly!\nGlenn also points out that the island has no China Town, no Little Italy, no isolated communities. We live together, Chinese and Haitian, Venezuelan and Dutch, everyone mixes, there is no aristocracy or elite, we’re all equals.\nGlenn who has a PhD in Criminal Law from the University of Groningen, is himself a graduate of the University of Aruba and Colegio Arubano. He served as the governor of Bonaire, at the time when the island was preparing to pick the federation of the Netherland Antilles apart, reverting to the Kingdom of the Netherlands.\nIt wasn’t easy to serve as Kabinet Gezaghebber, says Glenn, but I lasted three years, two months and fourteen days.\nGlenn hopes that one day the UA will study our Aruban code switching competency, and then teach it to the rest of the world. The curriculum will include how to identity key components, how to absorb the influences and finally, how to assimilate them, on just about everything. It’s a survival strategy and it works beautifully and intuitively on the island!\nThe Dutch, he conclude, operate from their head. Latin communities often operate from the area above the heart to below the crotch. Some unenlightened communities just use their legs, they do the work but don’t feel it, nor do they think about it.\nWouldn’t it nice to incorporate our heads, hearts and legs, for the good of humanity, and think with all three holistic parts?.\nThanks to educator Gershwin Lee for educating me about Glenn Thode.",
    "source_domain": "batibleki.visitaruba.com",
    "title": "About Aruban Culture, a conversation with Glenn Thode, rector UA, Universidad di Aruba",
    "title_page": null,
    "title_rss": null,
    "url": "https://batibleki.visitaruba.com/8am-buzz/about-aruban-culture-a-conversation-with-glenn-thode-rector-ua-universidad-di-aruba/"
}