{
    "authors": [],
    "date_download": "2017-06-14 23:12:44+00:00",
    "date_modify": null,
    "date_publish": "2017-06-13 05:12:57",
    "description": null,
    "filename": "https%3A%2F%2Fbatibleki.visitaruba.com%2F8am-buzz%2Fguy-bavli-at-the-alhambra-ballroom-the-master-of-the-mind-is-back%2F.json",
    "image_url": "http://batibleki.visitaruba.com/wp-content/uploads/2015/11/batibleki.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Guy Bavli is a Mentalist, illusionist, an Entertainer and a friend of Aruba. He was here last summer for a short engagement and returns this summer for a longer run every, Thursday and Friday at the Alhambra Ballroom until the end of August.\nBavli will be taking audiences on a journey into the mysteries of the human mind, as the evening is filled with mind-games and humor, demonstrating Bavli’s hidden powers, which defy logic and science. His astounding telekinetic powers can move objects without the use of a touch!!\nLaughter is great medicine, says Bavli, and his interactive audiences laugh and shake their heads in disbelief as he reads their mind with a mix of mentalism and illusion, psychology, physiology and intuition, that’s pure entertainment.\nBorn in Tel-Aviv, Israel, Guy began performing before live audiences at the age of five. When he was eight years old he had his first professional performance at a swim club in Tel-Aviv, it was his first-paid show and he hasn’t gotten off stage since them.\nTickets for Bavli’s performances are $35 per person, including a drink during the show, children under 12 escorted by two paying adults, are free. A Dinner & Show option is $55, including a starter and a main dish, at Fusion Restaurant Wine & Piano Bar; children pay $15.\nYou may buy tickets at the theater or at any De Palm Tours desk, at all hotels; doors open at 7:30pm, show starts at 8pm. Ticket-holders are advised to leave their logic at the door, and take a walk on the mind’s wild side.\nDivi Resorts is proud to introduce the celebrity mentalist who appeared on TV more than 400 times, in more than 60 countries, and performed 1,200 shows at Caesar Palace, Las Vegas, Nevada. The show is suitable for kids 7 years and up. They will love you for taking them.\nYou are advised to leave your logic at the door.",
    "source_domain": "batibleki.visitaruba.com",
    "title": "Guy Bavli at the Alhambra Ballroom, the Master of the Mind, is back",
    "title_page": null,
    "title_rss": null,
    "url": "https://batibleki.visitaruba.com/8am-buzz/guy-bavli-at-the-alhambra-ballroom-the-master-of-the-mind-is-back/"
}