{
    "authors": [],
    "date_download": "2017-06-14 23:12:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-13 05:28:08",
    "description": null,
    "filename": "https%3A%2F%2Fbatibleki.visitaruba.com%2F8am-buzz%2Fbeach-clean-up-please-lend-a-hand-its-our-beach%2F.json",
    "image_url": "http://batibleki.visitaruba.com/wp-content/uploads/2015/11/batibleki.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For the upcoming 2 weekends Parke Arikok will be having an oil spill cleanup at different beaches in the park. The dates will be: Saturday June 17, 2017; Sunday June 18, 2017; Saturday June 24, 2017; Sunday June 25, 2017. Each day from 7:00am to 11:00am\nThe aim is to have a minimum of 20 Volunteers at each location. Kindly sign up for the next two weekends. If you have a volunteer list, please submit with Volunteer Name & Number.\nIMPORTANT INFORMATION FOR VOLUNTEERS\nWear old clothing or clothing you can dispose of after the cleanup in case you can oil spots on your clothing. Please bring a change of clothes with you, any clothing with oil spots on them would have to be disposed in a bag before leaving. We will have Dawn Soap, Corn Oil and Tissues available if you have oil spots on your body.\nUse plastic hand gloves.\nSunblock, Hat and Sunglasses recommended.\nMaterials: If they can supply mini garden shovels will be great if not we will have available.\nIf the shoes you will be wearing get covered considerably in oil, you will have to dispose of them.\nFurther, explanation will be given by Park Rangers and cleanup volunteers will be supervised by Parke Arikok Rangers and DOW.\nThe park will have containers with Ice Water, additionally they will have Apples and Oranges for all volunteers. They will have garbage bags. If volunteers would like to bring their own gloves, they can use plastic gloves. They are free to bring additional food items on their own expense.\nThe meeting point will be Visitor Center at Parke Arikok. The groups start leaving at 7:00 AM. You can start arriving as of 6:30 AM. Briefing will be given by Park Rangers.\nIf you have a vehicle that can handle the Park roads we encourage you to bring your vehicle so we can transport additional volunteers to all the points where we will have the cleanup.\nThe cleanup will be supervised by Park Rangers and one DOW staffer and is organized by Parke Arikok, DOW and Rampenbureau.\nIf you have any questions please call cell phone 7496191, or write to: c.quant@arubanationalpark.org.",
    "source_domain": "batibleki.visitaruba.com",
    "title": "Beach Clean Up, please lend a hand, it’s our beach!",
    "title_page": null,
    "title_rss": null,
    "url": "https://batibleki.visitaruba.com/8am-buzz/beach-clean-up-please-lend-a-hand-its-our-beach/"
}