{
    "authors": [],
    "date_download": "2017-04-18 04:27:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "North Korea is preparing for \"any mode of war\" triggered by US military action, Pyongyang's envoy to the United Nations warned Monday, saying his country would respond to a missile or nuclear strike \"in kind.\"",
    "filename": "http%3A%2F%2Fbhcourier.com%2Fnorth-korea-says-its-ready-to-react-to-any-mode-of-war-from-us%2F.json",
    "image_url": "http://bhcourier.com/wp-content/uploads/2017/04/WTmgCBW0.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "North Korea is preparing for “any mode of war” triggered by US military action, Pyongyang’s envoy to the United Nations warned Monday, saying his country would respond to a missile or nuclear strike “in kind.”\nThe statement from North Korea’s deputy ambassador to the United Nations, Kim In Ryong, followed warnings from US Vice President Mike Pence to Pyongyang not to test US resolve.\n“If the United States dares opt for a military action (…) the DPRK is ready to react to any mode of war desired by the Americans,” Kim told a news conference at UN headquarters in New York.\n“We will take the toughest counteraction against the provocateurs,” he said.\nNorth Korea has taken “self-defensive” measures in response to US threats of military action and these reflect Pyongyang’s determination to “counter nukes and ICBM in kind,” Kim said, referring to intercontinental ballistic missiles.\nPence earlier told a news conference in South Korea that “the era of strategic patience is over” after North Korea on Sunday test-fired another missile and fears mounted that it may be preparing a sixth nuclear test.\nPyongyang is seeking to develop a long-range missile capable of hitting the US mainland with a nuclear warhead, and has so far staged five nuclear tests, two of them last year.\nKim also confirmed that a new nuclear test was under preparation, saying that the plans had been announced and that “it will take place.”\n“As far as nuclear test is concerned, it was already announced to the public. It is something that our headquarters decided. At a time and at the place where our headquarters deem necessary, it will take place,” he said.\n- ‘Got to behave’ -\nUS President Donald Trump’s decision at the weekend to send the Carl Vinson carrier-led navy strike group to the Korean peninsula shows that the “US reckless moves for invading the DPRK have reached a serious phase,” said Kim.\nThe North Korean deputy envoy asserted that Pyongyang would hold the United States “wholly accountable for the catastrophic consequences to be entailed by its outrageous actions.”\nThe envoy criticized the US missile strikes that hit an air base in Syria last week, saying Washington was resorting to a “gangster-like logic” that its military action was proportionate and could apply to the Korean peninsula as well.\nTrump on Monday said his message to North Korean leader Kim Jong-Un was: “Got to behave.”\nUN spokesman Stephane Dujarric separately expressed concern over rising tensions on the Korean peninsula and said the latest missile test was “troubling”.\nHe urged North Korea to “take all the steps necessary to de-escalate the situation and return to dialogue on denuclearization.”\nUS Secretary of State Rex Tillerson will next week chair a special meeting of the UN Security Council on North Korea.\ncml/jm\n© Agence France-Presse\nShare this Story",
    "source_domain": "bhcourier.com",
    "title": "North Korea Says It’s Ready To React To ‘Any Mode Of War’ From US",
    "title_page": null,
    "title_rss": null,
    "url": "http://bhcourier.com/north-korea-says-its-ready-to-react-to-any-mode-of-war-from-us/"
}