{
    "authors": [
        "Nova Safo"
    ],
    "date_download": "2017-04-18 04:27:18+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Police on Monday widened a manhunt for a gunman who shot and killed an elderly man, and then posted a video of the seemingly random Easter Sunday attack on Facebook.",
    "filename": "http%3A%2F%2Fbhcourier.com%2Ffive-state-manhunt-underway-for-suspected-facebook-killer-steve-stephens%2F.json",
    "image_url": "http://bhcourier.com/wp-content/uploads/2017/04/stevie-steve-141.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Police on Monday widened a manhunt for a gunman who shot and killed an elderly man, and then posted a video of the seemingly random Easter Sunday attack on Facebook.\nPolice in Cleveland, Ohio said they believe the suspect, 37-year-old Steve Stephens, is armed and dangerous, and have alerted authorities in four neighboring states to be on the lookout for him.\nRobert Godwin Sr, 74, was shot and killed on Sunday, apparently at random as he walked home after an Easter dinner, police and local media reported.\n“We know that Steve is still out there someplace,” said Cleveland police chief Calvin Williams. “We don’t know his condition and, of course, right now we don’t know his location. We’re asking the public to remain vigilant.”\nPolice issued an arrest warrant for aggravated homicide against Stephens, described as a six-foot one-inch, 244-pound (1.85 m, 110-kilo) black man with a full beard who was last seen in a white Ford Fusion with temporary license plates.\nIn a video uploaded to Stephens’s Facebook page, a man resembling him is seen exiting a vehicle and approaching his victim, who is shown with a gun to his head and then falling to the ground after a shot is fired.\n“I killed 13, so I’m working on 14 as we speak,” the suspect says in a second video clip. “I’m just driving around hitting motherfuckers, man. I just snapped man, fuck.”\nPolice said they have not verified his claim to have committed other murders.\nFacebook subsequently took down the videos.\n- ‘Mad with his girlfriend’ -\n“This is a horrific crime and we do not allow this kind of content on Facebook,” the company said in a statement.\n“We work hard to keep a safe environment on Facebook, and are in touch with law enforcement in emergencies when there are direct threats to physical safety.”\nStephens’s mother told CNN she called him on Sunday after learning about the video and he told her he was shooting people because he was “mad with his girlfriend.”\nPolice said the woman he referred to was in a safe place.\nCleveland detectives also made contact with Stephens by phone early in the investigation, Williams said.\n“They tried to, of course, convince him to turn himself in and, of course, that hasn’t happened to date so again, we’re asking the public’s help in finding this guy. We know he’s out there someplace,” he said.\nThe last “ping” from Stephens’s cellphone was from Erie, Pennsylvania, about 100 miles (160 kilometers) east of Cleveland.\nCleveland police have asked the states of Pennsylvania, New York, Indiana and Michigan to be on alert.\n- Dozens of searches -\nThe Federal Bureau of Investigation and the US Marshals Service have joined the hunt.\n“This man is dangerous and he could be nearby, he could be far away, anywhere in between,” said Stephen Anthony, the FBI special agent in charge.\n“We’re going to make this individual’s world very, very, very small, so I’m very optimistic,” said Peter Elliot, the marshal on the case. “I think things are going to happen, and I believe things are going to happen pretty quickly.”\nBut Williams said police had searched dozens of locations overnight “to no avail.”\n“If there’s somebody who is helping Steve or think you’re helping Steve, you’re really not. You’re going to get yourself in trouble, along with him,” he warned.\nStephens worked for Beech Brook, a behavioral health agency serving children through mental health services, foster care and adoption, at-risk youth and other programs.\nIn his video, Stephens displayed his Beech Brook badge.\n“We are shocked and horrified like everyone else,” Nancy Kortemeyer, a spokeswoman for the facility told CNN. “To think that one of our employees could do this is awful.”\nbur-jm-nov/sst\n© Agence France-Presse\nShare this Story",
    "source_domain": "bhcourier.com",
    "title": "Five State Manhunt Underway For Suspected Facebook Killer Steve Stephens",
    "title_page": null,
    "title_rss": null,
    "url": "http://bhcourier.com/five-state-manhunt-underway-for-suspected-facebook-killer-steve-stephens/"
}