{
    "authors": [],
    "date_download": "2017-04-18 04:27:07+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Beverly Hills Mayor Lili Bosse is taking the \"Beverly Hills Healthy City\" initiative to a whole new level. Spiritual leader and alternative health advocate Deepak Chopra and the City of Beverly Hills will host a free, public meditation on the Crescent grounds of City Hall at noon on May 12. Everyone is invited.",
    "filename": "http%3A%2F%2Fbhcourier.com%2Fbeverly-hills-news-save-the-date-to-meditate-with-deepak-chopra-in-beverly-hills%2F.json",
    "image_url": "http://bhcourier.com/wp-content/uploads/2017/04/Chopra.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Beverly Hills Mayor Lili Bosse is taking the “Beverly Hills Healthy City” initiative to a whole new level.\nSpiritual leader and alternative health advocate Deepak Chopra and the City of Beverly Hills will host a free, public meditation on the Crescent grounds of City Hall at noon on May 12 and everyone is invited.\nThis is the first time that Chopra has worked with a City in this fashion. The extraordinary circumstances of a City-sponsored group meditation with one of the world’s most revered spiritual activists is anticipated to draw international attention.\nThe Healthy City initiative is to be expanded to include a cutting edge program for inner health that Bosse calls SOUL Sessions, an acronym for “Seek Original Unique Learning,” which will include a unique partnership with renowned leader in alternative health and well-being Deepak Chopra, M.D. Chopra will introduce his new Jiyo technology, which can enable smart phone app users to access a schedule of lectures, meditations, and workshops around the world where a HumaGram of these experts will be available to interact with them. It is a well-being platform intended to be a tool to enable personal transformation. Jiyo focuses on five pillars of wellness including personal growth, exercise, nutrition, sleep, and relationships.\nThrough the Healthy City initiative, Chopra will launch Jiyo Beverly Hills Healthy City that is connected through the app, where everyone who uses the platform can measure their participation and progress, and access teachings from experts as part of the collaboration.\n“Who knows wellness better than Deepak Chopra?” said Bosse, who has incorporated daily meditation into her wellbeing routine.\nShare this Story",
    "source_domain": "bhcourier.com",
    "title": "Beverly Hills News - Save the Date To Meditate with Deepak Chopra - in Beverly Hills!",
    "title_page": null,
    "title_rss": null,
    "url": "http://bhcourier.com/beverly-hills-news-save-the-date-to-meditate-with-deepak-chopra-in-beverly-hills/"
}