{
    "authors": [],
    "date_download": "2017-04-18 04:26:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Delta Air Lines has increased the maximum possible payout to passengers to nearly $10,000 if they voluntarily give up a seat on an overbooked flight, the company told AFP Monday.",
    "filename": "http%3A%2F%2Fbhcourier.com%2Fdelta-to-pay-up-to-10000-to-bumped-customers%2F.json",
    "image_url": "http://bhcourier.com/wp-content/uploads/2017/04/Delta-Airline-Hike.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Delta Air Lines has increased the maximum possible payout to passengers to nearly $10,000 if they voluntarily give up a seat on an overbooked flight, the company told AFP Monday.\nThe boost is part of the airline industry’s response to the global outrage sparked by last week’s violent removal of a customer from a United Airlines Chicago flight after he resisted being “bumped” by the carrier.\nDelta customer service employees will be permitted to offer up to $2,000 in these cases, up from the prior cap of $800.\nSupervisors will be able to grant up to $9,950, up from the prior limit of $1,350.\nThe increases came after United came under fire after it called security officers to forcibly remove passenger David Dao from an overbooked flight in order to seat crew members for another flight.\nVideo of the episode went viral, sparking calls for greater scrutiny of airlines from politicians.\nUnited, which is undertaking an audit of its practices, already amended some policies, saying it will require employees to be booked at least 60 minutes prior to departure. United evicted Dao and three other passengers from the flight to make room for employees.\nThe incident shined a new light on the practice of overbooking, which airlines increasingly rely upon to avoid losing money on seats left when some passengers do not show up for scheduled flights.\nDelta has described overbooking as a necessary industry practice, in part because of weather uncertainty, and said the process can be managed effectively.\nlo-jmb/hs\n© Agence France-Presse\nShare this Story",
    "source_domain": "bhcourier.com",
    "title": "Delta To Pay Up To $10,000 To Bumped Customers",
    "title_page": null,
    "title_rss": null,
    "url": "http://bhcourier.com/delta-to-pay-up-to-10000-to-bumped-customers/"
}