{
    "authors": [],
    "date_download": "2017-04-18 04:27:04+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "A star on the Hollywood Walk of Fame honoring \"Criminal Minds: Beyond Borders\" star Gary Sinise for his Emmy-winning television career will be unveiled Monday.",
    "filename": "http%3A%2F%2Fbhcourier.com%2Fhollywood-walk-of-fame-star-for-gary-sinise-to-be-unveiled%2F.json",
    "image_url": "http://bhcourier.com/wp-content/uploads/2017/04/Gary-Sinise-Cast-as-Lead-in-Criminal-Minds-Spinoff.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A star on the Hollywood Walk of Fame honoring “Criminal Minds: Beyond Borders” star Gary Sinise for his Emmy-winning television career will be unveiled Monday.\nU.S. Air Force Gen. Robin Rand, commander of the Global Strike Command, and Walk of Fame honorees Patricia Heaton and Joe Mantegna are set to precede Sinise in speaking at the 11:30 a.m. ceremony in front of The Supply Sergeant store on Hollywood Boulevard.\nSinise’s star will be the 2,606th since the completion of the Walk of Fame in 1961 with the first 1,558 stars. The ceremony will be livestreamed on walkoffame.com.\nSinise’s best-known television role was starring as New York Police Department Detective Mac Taylor in the 2004-13 CBS police procedural “CSI: NY.”\nSinise received two Emmy nominations, both for portrayals of elected officials. He received the Emmy for outstanding lead actor in a miniseries or movie in 1998 for TNT’s “George Wallace,” two years after being nominated in the category for HBO’s “Truman.”\nSinise’s other television credits include the 1994 ABC miniseries “The Stand”; the 1989 and 2003 “Hallmark Hall of Fame” productions “My Name is Bill W.” and “Fallen Angel”; and Showtime’s 1999 adaptation of the Pulitzer Prize-winning play “That Championship Season.”\nSinise received a best supporting actor Oscar nomination in 1995 for his portrayal of Army platoon leader Lt. Dan Taylor in “Forrest Gump.” Sinise later appeared in two other films with “Forrest Gump” star Tom Hanks, “Apollo 13″ and “The Green Mile.”\nSinise’s other film credits include “Ransom”; “Snake Eyes”; “The Forgotten”; “The Human Stain”; “Imposter”; “It’s the Rage”; “Reindeer Games”; “Mission to Mars”; “A Midnight Clear”; “Jack the Bear”; “The Quick and the Dead”; “The Big Bounce” and “Albino Alligator.”\nSinise was born March 17, 1955 in the Chicago suburb of Blue Island, Illinois.\nSinise’s acting career began on the stage when he was 18 and co-founded the famed Steppenwolf Theatre Company of Chicago with friends Jeff Perry, now a cast member on the ABC drama “Scandal,” and Terry Kinney, whose career as an actor and director includes a Tony nomination in 1990 for best featured actor in a play for “The Grapes of Wrath.” Sinise starred in that play and received a Tony nomination for best featured actor in a play.\nSinise was the company’s artistic director for seven years and has starred in more than a dozen of its productions including the 2001 revival of “One Flew Over the Cuckoo’s Nest,” which brought him a best actor in a play Tony nomination under Kinney’s direction.\nCNS-04-17-2017 07:42\nShare this Story",
    "source_domain": "bhcourier.com",
    "title": "Hollywood Walk Of Fame Star For Gary Sinise To Be Unveiled",
    "title_page": null,
    "title_rss": null,
    "url": "http://bhcourier.com/hollywood-walk-of-fame-star-for-gary-sinise-to-be-unveiled/"
}