{
    "authors": [],
    "date_download": "2017-04-18 04:27:22+00:00",
    "date_modify": null,
    "date_publish": "2017-04-30 00:00:00",
    "description": "The United States is ruling nothing out in its dealings with North Korea, Vice President Mike Pence said Monday during a visit to the heavily militarised border between the two Koreas.",
    "filename": "http%3A%2F%2Fbhcourier.com%2Fpence-all-options-on-table-with-north-korea%2F.json",
    "image_url": "http://bhcourier.com/wp-content/uploads/2017/04/30652117521_d59dd9cf76_b.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The United States is ruling nothing out in its dealings with North Korea, Vice President Mike Pence said Monday during a visit to the heavily militarised border between the two Koreas.\nWashington wants to achieve security “through peaceable means, through negotiations. But all options are on the table as we continue to stand shoulder to shoulder with the people of South Korea,” he said at the border village of Panmunjom.\nPence, speaking at Freedom House, a few metres from the military demarcation line that he described as a “frontier of freedom”, said America’s relationship with South Korea was “ironclad and immutable”.\n“The message of the people of the United States of America is that we seek peace, but America has always sought peace through strength and my message here today standing with US forces Korea, standing with courageous soldiers from the Republic of Korea is a message of resolve.\n“The people of North Korea the military of North Korea should not mistake the resolve of the United States of America to stand with our allies.”\nPence’s visit to the DMZ comes a day after North Korea’s latest missile test failed, when the rocket exploded seconds after blast off.\narb-hg/tm\n© Agence France-Presse\nShare this Story",
    "source_domain": "bhcourier.com",
    "title": "Pence: ‘All Options On Table’ With North Korea",
    "title_page": null,
    "title_rss": null,
    "url": "http://bhcourier.com/pence-all-options-on-table-with-north-korea/"
}