{
    "authors": [
        "Brett Glover"
    ],
    "date_download": "2018-05-30 19:21:20+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 13:09:32",
    "description": "Three Suspects Wanted After Sea-Doo Theft",
    "filename": "http%3A%2F%2F1075koolfm.com%2Fthe-rap-sheet-166%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2018/04/The-Rap-Sheet-NEW-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "BARRIE POLICE SERVICE\nOn Sunday, May 20th, 2018 at approximately 10:25 pm three (3) suspects were caught on video surveillance entering St. Onge Recreation located at 65 Hart Drive, in the City of Barrie. A white Jeep Grand Cherokee entered the premise after moving the trailer blocking the entranceway. The vehicle immediately went to a trailer and Sea-Doo along the side of the building, hooking it up and leaving the premise with it in tow. A short time later, just before 11:30 pm the same Jeep with three suspects entered the lot where they hooked up a second trailer with two (2) Sea-Doos loaded. Officers noted the vehicle as all white with a sunroof, darker tinted windows and distinctive black after-market hood vents located both front corners of the Jeep. Two (2) of the suspects were stocky build and dressed in dark clothing with the third suspect wearing a white coat and jeans.\nSea-Doo #1 Description:\n2017 White RXTX 300\nMarine number ON5663449\nWhite in colour with yellow accents and a black seat\n* Sitting on galvanized silver single trailer with 2 and 1 red decals on the side\nSea-Doo #2 Description:\n2017 GTI SE 900\nMarine number ON5830746\nBlack in colour with silver seat\nSea-Doo #3 Description:\n2017 GTI 900\nWhite in colour with neon green seat and black accents\n* Sitting on a black Kara double trailer with plate number R1683F\nPolice are continuing their investigation at this time and wish for anyone who may have information to please contact Constable A Tombs of the Barrie Police Service at 705-725-7025 ext. 2794 or atombs@barriepolice.ca. Any information can be provided anonymously to Crime Stoppers at 1-800-222-TIPS or leave an anonymous tip online at www.p3tips.com. The Barrie Police Service reminds business owners of the importance of maintaining and updating video surveillance equipment. Quality images helps to identify suspects, and can aid in arrests and have a tremendous impact during court proceedings.",
    "source_domain": "1075koolfm.com",
    "title": "The Rap Sheet",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/the-rap-sheet-166/"
}