{
    "authors": [
        "Dan Blakeley"
    ],
    "date_download": "2017-02-15 15:16:09+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 06:09:52",
    "description": "Contract for work awarded",
    "filename": "http%3A%2F%2F1075koolfm.com%2Fwork-to-begin-on-cardiac-care-unit-at-rvh%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2016/09/RVH-entrance-via-Twitter-1000x500.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "RVH says work on its advanced cardiac care unit can begin by late this month and be completed by the fall. The hospital has awarded the $5 million contract to CHART Construction Management Inc. of Concord. “We’ve been building the foundation for a strong cardiac program for many years now,” says Janice Skot, president and CEO, RVH. “Over the past five years, we’ve recruited a team of eight heart doctors, added state-of-the-art diagnostic equipment, partnered with the YMCA to provide cardiac rehab in the community, opened a cardiac renal inpatient unit, a cardiac intensive care unit and an urgent cardiology clinic to identify at-risk patients. This really has been no small undertaking, but today’s announcement makes our goal of providing an advanced cardiac program seem more real than ever.” The unit will be North Simcoe Muskoka’s only advanced cardiac centre. It will mean fewer trips to Southlake Regional Health Centre in Newmarket.\nFrom left – David McCullough, chair, RVH Foundation Board of Directors; Michael O’Keefe, vice chair, RVH Board of Directors; Ann Hoggarth, MPP Barrie; Janice Skot, president and CEO, RVH; Dr. Brad Dibble, medical director, Cardiovascular and Renal program, RVH; Gerry Marshall, warden, County of Simcoe; Selma Mitchell, operations director, Cardiovascular and Renal program, RVH.",
    "source_domain": "1075koolfm.com",
    "title": "Work To Begin On Cardiac Care Unit At RVH",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/work-to-begin-on-cardiac-care-unit-at-rvh/"
}