{
    "authors": [
        "Brett Glover"
    ],
    "date_download": "2018-05-30 19:21:29+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 14:13:40",
    "description": "Innisfil Employee Instructed By Scam Artists Posing at CEO To Make Bulk Gift Card Purchase",
    "filename": "http%3A%2F%2F1075koolfm.com%2Fnew-twist-on-old-gift-card-scam-now-involves-texts-from-a-phony-boss%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2018/05/gift-card-scam-1000x500.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "South Simcoe Police say it is dealing with a new twist on the gift card scam. This time, an Innisfil business says an employee got an email from what appeared to be the boss, really a scammer, who had the worker go buy a large amount of iTunes gift cards supposedly as gifts for clients. The phony company CEO also had the employee’s cell number, through which different instructions were issued to the point where the employee became weary and contacted the boss directly.\nFraud Alert: New twist on gift card #scams. #Innisfil employee out several thousand dollars after receiving bogus email from ‘boss’ to buy large amount of iTunes cards. Please check with employer to confirm email is legit before shopping. #giftcards #fraud pic.twitter.com/DVd1E7lywy — South Simcoe Police (@SouthSimcoePS) May 30, 2018\nThat’s when the scam was discovered and some of the iTunes purchase transactions were cancelled; the fraud still amounted to several thousand dollars. Police are warning the public to be suspicious of any large-purchase requests from the boss, confirming it is legitimate before going through with any purchase.\nThis scam mirrors another type of fraud that has someone purportedly from the Canada Revenue Agency calling, demanding payment on a phony debt through the purchase of iTunes gift cards. South Simcoe Police say the scam artists on the other end of these transactions are able to use the information on the back of the iTunes card, given by the unsuspecting victim, to retrieve the funds used to purchase them.\nThe so-called CRA Scam became so prevalent at one point that South Simcoe Police even introduced a new initiative in the Spring, aimed at stopping gift card scams before they start. The imitative included printouts at the point-of-purchase, along with increased training for cashiers. Police say, in the fraud involving a phony boss, the cashier at the store even asked the employee if these cards were for the CRA.",
    "source_domain": "1075koolfm.com",
    "title": "New Twist On Old Gift Card Scam Now Involves Texts From a Phony Boss",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/new-twist-on-old-gift-card-scam-now-involves-texts-from-a-phony-boss/"
}