{
    "authors": [
        "Jon M"
    ],
    "date_download": "2018-05-30 19:21:26+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 13:22:37",
    "description": null,
    "filename": "http%3A%2F%2F1075koolfm.com%2Fnew-highway-crossing-for-barries-congested-south-end%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2018/05/DSC00642_1-1000x500.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In announcing the official start to the Harvie Road, Big Bay Point Road, Highway 400 crossing project Wednesday, Barrie Mayor Jeff Lehman said one of the nice things about this project is that there really is no impact on traffic.\n“There won’t be any impact on traffic”\nHe says because it’s a new bridge there isn’t any traffic going through the area right now, “the only impact will be when we tie in at Fairview and Harvie Road.\nLehman says this all reduces existing traffic congestion and also supports development growth. He says after some stellar years for industrial development property sales, the City is in need of more land. Both Bell\nMedia and Smart Centres own the lands adjacent to Harvie Road – which are zoned industrial and commercial.\nThis past Barrie City council meeting plans for subdivision on the Bell Media lands were presented. Lehman says “it’s going to be great to get thisland to market and spur more economic growth in the south end.”\nThe crossing is expected to open to traffic in the Fall of 2020\nThe City says a contract to construct access roads for the utilities along Fairview has been tendered and will be constructed this June. The overall project tender is expected to be advertised soon and construction to begin in the Fall of 2018. Opening to traffic is expected in the Fall of 2020.",
    "source_domain": "1075koolfm.com",
    "title": "New Bridge for Barrie’s Congested South End",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/new-highway-crossing-for-barries-congested-south-end/"
}