{
    "authors": [
        "Jon Meyer"
    ],
    "date_download": "2018-07-04 20:35:34+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 13:59:08",
    "description": "Just Released: Simcoe Muskoka Action Plan to Combat Opioid Crisis",
    "filename": "http%3A%2F%2F1075koolfm.com%2Four-drug-problem-is-off-the-rails%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2018/07/IMG_1370-1000x500.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It wasn’t too long ago the words fentanyl and carfentanil were foreign to most of us. If we heard the words ‘opioids’ amd ‘drug user’ in the same sentence chances are we were not picturing someone living next door or sleeping in the bedroom beside us. We more likely pictured a strung- out person living on the streets in a downtown metropolis surrounded by used needles. That has changed.\n74 confirmed opioid overdose deaths in Simcoe | Muskoka in 2017.\nHere in Ontario we saw the opioid crisis spread like a plague across most of B.C. after it took a hold of Vancouver’s most vulnerable population, who resided on the downtown Eastside. The fentanyl fueled problem then spread to smaller outlying communities and then we heard about young parents – just having a good time on the weekend with something like a line of cocaine – overdosing.\n“We cannot let this become our new normal.”\nLike most trends that start out West, this one slowly crept East…and here we are. After over a year’s worth of work, Dr. Rebecca Van lersel, co-chair of the Simcoe Muskoka Opioid Strategy Steering Committee, says it’s time for action. Dr. Lisa Simon, co-chair of SMOS, says the impact of opioids in our region has been devastating. Dr. Simon says “deaths are only the tip of the iceberg, with huge effects on individuals, families, communities, and service providers.”\n“None of us are safe until we get on top of this.”\nEvelyn Pollock lost her son on Sept 15th 2017 after using drugs with fentanyl. At the time Daniel, who was over 40 years of age, didn’t know he was using fentanyl.\nShe asks, “where is the outrage from our community?” Pollock noted the response to the SARS outbreak and asks why we are not acting with the same urgency? My son had a lot of help and counseling and support but he fell victim to this terrible thing.\nNo slowdown for hospital staff\nThe problem isn’t getting any better. It was last summer (2017) that overdose opioid emergency visits peaked. Already, from March to May of this year, there have been 83 overdose visits reported at hospitals in Simcoe Muskoka and 68 overdoses among Simcoe Muskoka patients visiting any hospital in Ontario – approximately half of what officials saw during that huge spike last summer. Who are most prone to end up in the E.R? The data shows emergency visits for opioid poisonings highest among young adults, 15 years and older, and higher for males.\nA Bad Batch hit the streets in June\nJune was a horrible month for those dealing with the drug problem. In the span of a few days, June 17 – June 26, hospitals in Simcoe and Muskoka saw 44 suspected drug overdoses – or about twice the recent daily average in the region.\n“Most overdoses patients were young women”\nMost involved women between the ages of 15 and 44. The majority of cases involved visits to Royal Victoria Regional Health Centre and Orillia Soldiers’ Memorial Hospital, which saw 21 and 10 cases respectively. However, there have been overdose visits to other hospitals in Simcoe and Muskoka as well.\nThe Plan: 7 key pillars for action\nPrevention treatment/clinical practice harm reduction enforcement emergency management data and evaluation lived experiences\nFind out more about the action plan and how to fight the war on drugs here",
    "source_domain": "1075koolfm.com",
    "title": "Our Drug Problem is off the Rails",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/our-drug-problem-is-off-the-rails/"
}