{
    "authors": [
        "Hinda Koza-Culp"
    ],
    "date_download": "2017-10-06 14:30:56+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 10:18:03",
    "description": "Mmmmmm, Turkey!",
    "filename": "http%3A%2F%2F1075koolfm.com%2F7-tasty-ways-to-use-your-thanksgiving-leftovers%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2017/10/Thanksgiving-Leftover-Sandwich_final.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ahhhh, Thanksgiving. It’s the holiday that’s impossible to hate. It’s all about one thing – food. Lots and lots of delicious food. While Thanksgiving dinner itself is incredible, some say that leftovers are even better. With that in mind, here are 9 tasty ways to use your leftovers. You’re welcome.\nA Thanksgiving Sandwich\nListen – there’s an art to turkey sandwiches. You can’t just slap some turkey on bread and call it a day. Anyone who has watched Friends knows what I’m talking about.\nYou’ve got to take it to the next level! Turkey, mashed potatoes, stuffing, gravy and cranberry sauce between two pieces of bread. Get. In. My. Belly. (bonus points if you give it a quick toast on the panini grill)\nCheesy Mashed Potato Pancakes\nWe checked, and science has proven that this is the greatest use for leftover mashed potatoes of all time.\nTurkey Soup/Stew\nA classic. Is Thanksgiving really Thanksgiving without next-day turkey soup/stew? The answer is no, so bust out those slow cookers!\nA post shared by The Inspired Home (@theinspiredhome) on Sep 15, 2017 at 5:45am PDT\nTurkey Poutine\nNow that you think about it, isn’t it obvious?!?\nBacon Wrapped Stuffing Bites\nWhen two of the most beautiful foods known to human kind come together, magic happens.\nTurkey & Cranberry Quesdillas\nA great way to get your kids to eat leftovers. Whip this up for a quick day-after lunch that is as tasty as it is easy.\nCasserole\nCasserole’s don’t get the love they deserve these days. They’re warm, comforting and you can pretty much put anything in them and it’ll still turn out great. This option can also be swapped out for a Shepard’s Pie if that’s more your thing.",
    "source_domain": "1075koolfm.com",
    "title": "7 Tasty Ways To Use Your Thanksgiving Leftovers",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/7-tasty-ways-to-use-your-thanksgiving-leftovers/"
}