{
    "authors": [
        "Hinda Koza-Culp"
    ],
    "date_download": "2018-07-04 16:30:09+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 11:00:42",
    "description": "Explore The Beauty Of The Region!",
    "filename": "http%3A%2F%2F1075koolfm.com%2Fday-trips-to-georgian-bay-you-want-to-plan-this-summer%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2018/07/DSC00895-1000x500.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This Kool FM feature is presented with The Heart of Georgian Bay\nWe all know that familiar refrain from kids in the summer…”I’m bored“. Nip that problem in the bud with a quick road trip to Georgian Bay! You don’t have to travel far, but, but you’ll feel like you’ve been transported to a whole different world!\nSainte-Marie Among The Hurons\nSainte-Marie Among The Hurons is a world renowned historical site, and it’s less than an hour from Barrie. Originally the headquarters for the French Jesuit Mission to the Huron Wendat people, the members of the community were forced to abandon and burn the settlement in 1649. Sainte-Marie was recreated on the original site and now visitors can see a little slice of early pioneer life in Canada. Kids will love interacting with the different presentations, and won’t even realize they’re learning while they’re at it. That’s a win-win!\nA post shared by Sainte-Marie among the Hurons (@saintemarieamongthehurons) on Sep 6, 2016 at 11:15am PDT\nDiscovery Harbour\nDiscovery Harbour is a must visit, as it has something for absolutely everyone. Originally a British Naval establishment during the war of 1812, visitors to Discovery Harbour can experience what is was like to be a sailor, officer, or artisan living at the base in the 19th century. There are also two full scale replica ships (the H.M.S. Bee and H.M.S. Tecumseth). Ghost ToursFor those of you who like things on the spooky side, start July 4th.\nA post shared by Discovery Harbour (@discoveryharbour) on Jun 12, 2018 at 4:52am PDT\nSS Keewatin\nHave a history buff in your midst? Then take a tour of the SS Keewatin. The Keewatin is the last remaining British steamship that was built over 100 years ago. What’s a British steamship doing in Port McNicoll?? That’s exactly the kind of question that the tour will answer 🙂\n﻿\nBalm Beach\nBalm Beach is the absolute perfect place to spend a day with the family, alone, with friends…honestly, anytime with anyone, ever. Besides the usual beach exploits of sand and sun (we highly recommend renting a SUP board and taking in the views), there’s also the Georgian Grill Restaurant & Arcade (which will make you feel like you’ve stepped in to a time machine) & Balm Bay Go-Karts. Per. Fec. Tion.\nA post shared by Michelle (@michelleschmichelle) on Jul 1, 2018 at 12:24pm PDT\nCastle Village & The Enchanted Kingdom\nDid you know there is an actual castle in Midland? If you have a few hours to spend, this is a great place to while away an afternoon with the kids. There is a wide range of activities for all different age groups. There’s a playground, and educational nature trail through the woods, escape rooms and life-size cottages decorated in detail according to traditional fairy tales. A true hidden gem!\nA post shared by Gemma Mage🏳️‍🌈 (@gemma_adventure) on Sep 3, 2017 at 5:35pm PDT\nMidland Boat Tours\nIt’s easy to take the stunning beauty of Georgian Bay for granted, but the truth is we have one of the most beautiful places in the world right in our backyard. On the Miss Midland 30,000 Island Boat Cruise you will get up close and personal with all of that beauty. You can take a morning, lunch or dinner cruise. The dinner cruises are particularly special, as you will catch the spectacular Georgian Bay sunset.",
    "source_domain": "1075koolfm.com",
    "title": "Day Trips To Georgian Bay You’ll Want To Plan This Summer",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/day-trips-to-georgian-bay-you-want-to-plan-this-summer/"
}