{
    "authors": [
        "Brett Glover"
    ],
    "date_download": "2017-12-11 16:49:35+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 10:35:20",
    "description": "Monday, December 11th",
    "filename": "http%3A%2F%2F1075koolfm.com%2Fthe-rap-sheet-66%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2017/10/Rap-Sheet.png",
    "language": "en",
    "localpath": null,
    "maintext": "BARRIE POLICE SERVICE\nOn Friday, December 8th, 2017 shortly after 4:00pm a male was captured approaching the front door of a house located in the Mapleton Avenue and Essa Road area of the City of Barrie. The male appears to drape a black and red jacket or sweatshirt over a box recently delivered to the front porch and is seen carrying it from the property. Another person was seen waiting for the male on street, watching as the theft occurred. The box contained a quantity of assorted scarves from Old Navy valued at over $100.00. Surveillance video captured the male on a security doorbell camera.\nDescription\nMale, white\nThin build\nWearing light grey washed jeans, winter “Raptors” toque and carrying a grey and black backpack\nPolice are continuing their investigation at this time and wish for anyone who may have information to please contact PC C Reid of the Barrie Police Service at 705-725-7025 ext. 2666 or email at creid@barriepolice.ca. Any information can be provided anonymously to Crime Stoppers at 1-800-222-TIPS or leave an anonymous tip online at www.tipsubmit.com.\nBarrie Police Service is investigating a blatant theft that occurred on Sunday, December 3rd, 2017 shortly after noon at Loblaws located at 472 Bayfield Street in the City of Barrie. The male was seen on surveillance video selecting a case of 24 Carling Ice beer and placing it in a cart. He proceeded directly past the cash registers and attended the Customer Service desk to make a small purchase before exiting without paying for the beer. He was last seen walking to the rear of the building and taking a walking path coming out on Kozlov Street. Description:\nMale, white\nApproximately 200-230lbs\nShort brown hair\nWearing a black jacket and a black “Hurley” baseball hat\nPolice are continuing their investigation at this time and wish for anyone who may have information to please contact PC E Savoie of the Barrie Police Service at 705-725-7025 ext. 2555 or email at esavoie@barriepolice.ca. Any information can be provided anonymously to Crime Stoppers at 1-800-222-TIPS or leave an anonymous tip online at www.tipsubmit.com\nCOLLINGWOOD & THE BLUE MOUNTAIN OPP\nOfficers from the Collingwood and The Blue Mountains detachment of the Ontario Provincial Police (OPP) are investigating a break and enter which took place at a store in Collingwood and are asking for the public’s assistance in solving this crime. The break-in took place sometime overnight from December 8 to December 9 at The Source store located at 99 Balsam Street in Collingwood. Suspect(s) gained entry into the store and stole a number of video gaming consoles, tablets and various electronics, the exact amount and descriptions are not known at this time. If you have any information on this crime, please contact the Collingwood/The Blue Mountains O.P.P. at (705) 445-4321 or Call Crime Stoppers at 1-800-222-TIPS (1-800-222-8477) or submit your information online at www.crimestopperssdm.com or www.crimestoppersgb.ca. Crime Stoppers does not subscribe to call display, you will remain anonymous. Being anonymous, you will not testify in court and your information may lead to a cash reward of up to $2,000.00.\nOfficers from the Collingwood and The Blue Mountains detachment of the Ontario Provincial Police (OPP) are investigating a break and enter which took place at a residence in The Blue Mountains and are asking for the public’s assistance in solving this crime. The break-in took place at a residence on St-Moritz Crescent in The Blue Mountains sometime between November 26 and December 8 where suspect(s) gained entry into the dwelling and stole a number of bottles of liquor and wine, two Apple Televisions, Onkyo stereo system, Nintendo Wii, Sony Playstation 1 and Playstation 3 gaming consoles and DVD movies.\nBRACEBRIDGE OPP\nBracebridge Ontario Provincial Police (OPP) officers responded to a call from management at the Walmart in Bracebridge on Sunday, December 10, 2017 at 9:15 p.m. after two men stole items from the store and then fled in a U-Haul van when confronted. Officers were able to locate the vehicle and suspects at a rest stop on Highway 11 North in Bracebridge and after a short struggle, both men were placed under arrest and have been charged with Theft Under $5000, Possession of Property Obtained by Crime, Possession of Break In Instruments, Resist Peace Officer, Possession of Schedule I Substance (Cocaine) for the Purpose of Trafficking, and Possession of Schedule I Substance. The accused parties will appear in Bail Court in the Ontario Court of Justice in Bracebridge on December 11, 2017 to answer to their charges.",
    "source_domain": "1075koolfm.com",
    "title": "The Rap Sheet",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/the-rap-sheet-66/"
}