{
    "authors": [
        "Lisa Morgan"
    ],
    "date_download": "2018-07-04 16:40:02+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 11:56:48",
    "description": null,
    "filename": "http%3A%2F%2F1075koolfm.com%2Fa-message-from-the-past-hidden-in-the-walls2%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2018/07/Shinseki_Tweet_crop.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Alex Monney and his wife Jess were having their bathroom remodeled when their contractor uncovered a message from the past.\nAlongside a photo of the couple who last remodeled, was the message “Hi! We’re the Shinseki’s! We remodeled this bathroom summer 1995. If you’re reading this, that means you’re remodeling the bathroom again. What’s wrong with the way we did it?!?”\nThere was also a photo of a rabbit that said “Hi! I’m Cassie the Bunny Rabbit. I lived here too! (I’m potty trained)” and “I’m going to be the next Cadberry [sic] Bunny”\nThe tweet from Alex has gone viral.\nPeople are speculating about the OG couple.\nSome just want to know that Cassie the Bunny is OK.\nHave you ever found something in the wall when doing a remodel? Apparently there is a tradition among builders to put a can in the wall when building houses.\nSome people shared what they found hidden in their walls:\nRachel said it well “The best part about this is these sweet people did it before social media. So it was just for the simple joy of knowing another couple would see it someday and giggle.”\nFollow the original tweet to see what Alex and Jess will add to the wall!\nWe’re remodeling our bathroom and our contractor just sent us this @Jess_Monney pic.twitter.com/CgaguMhgMf — Alex Monney (@alexmonney) July 3, 2018\nHave you ever found anything hidden on or in your walls?",
    "source_domain": "1075koolfm.com",
    "title": "A Message From the Past Hidden in the Walls",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/a-message-from-the-past-hidden-in-the-walls2/"
}