{
    "authors": [],
    "date_download": "2017-08-14 20:36:42+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "http%3A%2F%2F1075koolfm.com%2Fjakestock-gilfords-annual-music-festival%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/themes/child-koolFM/images/defaults/landscape-1000.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Gilford Community Hall will be holding JAKESTOCK 2017 on Sunday September 3, 2017.\nThis annual end of season fundraiser has been held every Labour Day Sunday since 1989 and is celebrating its 28th year. Highlights of the day include a cross section of live music from some great local bands as well as lots of children’s activities including a bouncing castle, kids maze and face painting. This year we are pleased to welcome Mirene’s food trailer to provide a wide variety of hot and cold food items. As always there are raffles as well as silent auction items for the adults too.\nBands scheduled to perform include; Bridget Gowan, Dickie & The Boys, Screaming Charlie, Cousin Jack, Cardinal Street and Midlife Crisis. Live music will run from 3:00pm until 11pm.\nThe event is open to all members of the hall. Active membership is available to all residents of the Gilford area and Honorary membership is granted to anyone else who supports the objects of the hall. One-year hall memberships are available in advance for just $25 for a family of four at Mirene’s Chip Truck on IBR or through board members of the hall (gilfordhall@yahoo.ca). Tickets are also available at the gate for $15 per person or $30 for a family of four plus any donation over $25 can receive a tax receipt if desired. Gates are open at noon and we will run until 11pm rain or shine, bring a lawn chair and small personal coolers are permitted.\nThe Gilford Community Hall is a not for profit business that dates back to the 1800’s and is one of the last community owned venues and is run by a dedicated volunteer board to insure the hall is well cared for and open to all residents. As we receive no subsidies or tax breaks we rely on memberships, rentals and donations to ensure all bills are paid. Having been rebuilt after a fire in 1925 the hall doesn’t necessarily qualify as a historical landmark but is a great rustic local hall which continues to be an economical location for country weddings, stags, showers, kid’s parties and even fitness classes.",
    "source_domain": "1075koolfm.com",
    "title": "Jakestock Gilford’s Annual Music Festival",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/jakestock-gilfords-annual-music-festival/"
}