{
    "authors": [
        "Jacob Mccourt"
    ],
    "date_download": "2017-06-14 20:01:10+00:00",
    "date_modify": null,
    "date_publish": "2017-06-16 00:00:00",
    "description": "Everyone's favourite not-French sparkling water is crossing the border!",
    "filename": "http%3A%2F%2F1075koolfm.com%2Flacroix-sparkling-water-launches-saturday-in-canada%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2017/06/16870305933_db6019f482_k-1000x500.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "You may be looking for a way to reduce your soda intake. If so, LaCroix, a very popular brand of flavoured sparkling water launches in Toronto at Whole Foods on Saturday! But what is LaCroix?\n🇨🇦 #Canada, you’re officially invited to share our special debut with us & experience LaCroix on June 17th from 11:00AM to 3:00PM at @wholefoods in Yorkville! ✨Head over to the link in our bio to RSVP for special access on our big day. 😉 A post shared by LaCroix Sparkling Water (@lacroixwater) on Jun 14, 2017 at 9:15am PDT\nLaCroix is a naturally flavoured, sparkling water drink that originated in La Crosse, Wisconsin. Launched in 1981, it was positioned as an alternative to Perrier. The drink, which has become very popular in the past few years in the U.S., contains natural flavours but no sweeteners.\nIts rise in popularity comes at a time where American consumers are looking for a fizzy alternative to soda. The drink may be popular, but the pronunciation of LaCroix may be controversial in Canada (in the U.S., the brand is pronounced La-CROY).\nIf you plan on heading to the Canadian launch in Yorkville on the weekend, your flavour research has been condensed down to 12 minutes thanks to Good Mythical Morning.\nCC Image courtesy of Tony Webster via Flickr",
    "source_domain": "1075koolfm.com",
    "title": "LaCroix Sparkling Water Launches Saturday in Canada",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/lacroix-sparkling-water-launches-saturday-in-canada/"
}