{
    "authors": [],
    "date_download": "2017-06-15 11:14:20+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 07:12:43",
    "description": "Who knew your underwear could be so revealing -- about your personality, that is!",
    "filename": "http%3A%2F%2F1075koolfm.com%2Fyour-undies-reveal-your-personality%2F.json",
    "image_url": "http://1075koolfm.com/wp-content/uploads/2017/06/boxer-briefs-1000x400.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Handbag.com, TheSite.org and Arizona State University have it all figured out. Remember, your underwear doesn’t dictate who you are, but instead expresses your personality.\nFor Women:\nHigh-cut briefs\nLadies who wear “granny panties” tend to be perfectionists, except when it comes to style. They care most about comfort and function.\nBoy shorts or thongs\nWomen who don these are confident go-getters who enjoy a challenge. (The challenge is not to let people see you picking your butt) They like to show off their curves, are outgoing and open to new things.\nMatchy matchy\nSome women must have a matching bra and panty set. These confident women are quite fashion-conscious and enjoy pampering themselves. Some might even call them spoiled or high-maintenance.\nFor Men:\nBoxers\nWearing boxers is all about comfort, but men who prefer boxers are generally laidback, not too flashy and light-hearted. Boxers are the No. 1 choice in underwear for men.\nBriefs\nNicknamed tightie-whities even if they are red, blue or some other colour, briefs are worn by men who are inhibited and like the restricted feel of this kind of underwear.\nBoxer-briefs\nCan you say the best of both worlds? Men who opt for boxer-briefs are very good at committing in relationships. Hey, they already know how to compromise since they’ve done it with their underwear!\nThongs\nMen who wear thongs are tremendously outgoing and even exhibitionists at times.\nGoing commando\nEither someone forgot to do the laundry or he is very down-to-earth and embraces a natural way of life.",
    "source_domain": "1075koolfm.com",
    "title": "YOUR UNDIES REVEAL YOUR PERSONALITY",
    "title_page": null,
    "title_rss": null,
    "url": "http://1075koolfm.com/your-undies-reveal-your-personality/"
}