{
    "authors": [
        "Abc News",
        "More Andrea"
    ],
    "date_download": "2018-04-24 15:02:34+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Monday's episode of \"American Idol\" was the season's most dramatic yet!",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Famerican-idol-meet-top-10%2Fstory%3Fid%3D54688258.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/american-idol-jurnee-ht-abc-mem-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Monday's episode of \"American Idol\" was the season's most dramatic yet, as we learned which six of the 14 finalists had been voted through to the top 10 by America, and which of the remaining contestants had to sing for their lives in hopes of being chosen by the judges.\nIn the end, we had our top 10:\nEric McCandless/ABC\nCatie Turner -- Chosen by America\n-- Chosen by America Dennis Lorenzo -- Judges' pick\n-- Judges' pick Michael J. Woodard -- Chosen by America\n-- Chosen by America Jurnee -- Judges' pick\n-- Judges' pick Gabby Barrett -- Chosen by America\n-- Chosen by America Ada Vox -- Judges' pick\n-- Judges' pick Maddie Poppe -- Chosen by America\n-- Chosen by America Michelle Sussett -- Judges' pick\n-- Judges' pick Cade Foehner -- Chosen by America\n-- Chosen by America Caleb Lee Hutchinson -- Chosen by America\nEric McCandless/ABC\nHere's how it went down:\nThere were two sets of chairs onstage: the Victory Zone and the Danger Zone. Over two hours, Ryan Seacrest revealed whether each contestant had been voted into the top 10 by America. Those who were voted through got to sing a song without being judged, and then take a seat in the Victory Zone. Those who weren't had to \"sing for their lives,\" and their fates were revealed at the end of the show.\nMichelle Sussett, the first contestant in the \"Danger Zone,\" sang an original song called \"I'm a Dreamer,\" with lyrics in both English and Spanish, which made a powerful statement about the immigrant experience. \"This is my home and I love this country and I'm grateful to be here,\" the Venezuelan singer said. Judge Katy Perry was thrilled that she sang in Spanish, and she was the one who announced that she'd been chosen for the top 10.\nMarcio Donaldson sang \"Jealous\" by Nick Jonas and it wasn't his best performance. You could tell from the judges' comments that there was no way they were putting him through.\nGarrett Jacobs sang \"Have You Ever Seen the Rain\" by Creedence Clearwater Revival and, though Perry said it was the best he'd ever sounded, he wasn't chosen.\nDennis Lorenzo sang Maxwell's version of the Kate Bush song \"This Woman's Work.\" Perry called the performance \"brilliant\" and \"dynamic\" and said she'd fight for him; Lionel Richie said he didn't know what America was thinking by not putting him through. Luke Bryan was the one who announced he'd been chosen for the top 10.\nJonny Brenns sang a compelling version of \"Demons\" by Imagine Dragons that got him a standing ovation from the judges; Perry praised him for looking like a rock star, but criticized him for not having enough stage presence. In the end, he failed to make it through.\nMara Justine sang \"Love on the Brain\" by Rihanna, which made Bryan say he was \"in shock\" that she wasn't voted through by America. But Perry told the young teen that sometimes it's just about timing, which was a big giveaway that she wasn't going to be chosen.\nJurnee sang \"Never Enough\" from \"The Greatest Showman.” Richie simply said, \"I love you\" and he announced that they'd picked her for the top 10.\nAda Vox was the last contestant to sing for their lives, and sang \"And I Am Telling You I'm Not Going,\" so memorably delivered by \"American Idol\" alumna Jennifer Hudson in \"Dreamgirls.\"\nTo say Vox brought the house down is an understatement; after the performance, Perry took off her earrings and announced that she and the other judges were making an executive decision: They ordered Vox to go to the Victory Zone immediately.\nAfter Vox was chosen, the remaining seven contestants had to wait to hear which three would be staying. After Jurnee, Dennis and Michelle were declared the lucky ones, the rest of the pack were told by Perry, \"Over 10 million people are watching this. So what are you going to do with that information? You're going to launch off on your own.\"\nThe top 10 will perform Disney's greatest hits Sunday, and there will be the first-ever, coast-to-coast, live vote, with the results coming at the end of the show.",
    "source_domain": "abcnews.go.com",
    "title": "'American Idol': Meet your top 10!",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/american-idol-meet-top-10/story?id=54688258"
}