{
    "authors": [
        "Abc News",
        "More Dr."
    ],
    "date_download": "2018-03-20 03:01:14+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The researchers want to encourage young adults to transfer what they’ve learned about not drinking and driving to not riding with a driver who’s \"altered.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2Fyoung-adults-ride-impaired-drivers-study%2Fstory%3Fid%3D53859952.json",
    "image_url": "https://s.abcnews.com/images/US/GTY_driving_texting_mm_160223_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“Designated Driver” is a well-known catchphrase and there are public service announcements aplenty on the dangers of driving while impaired (DWI). But what about riding with impaired (RWI) people?\nMotor vehicle crashes are the leading cause of death and injury in the young, according to the Centers for Disease Control and Prevention (CDC). Previous research has shown that impaired drivers are more likely to be male, have previous driving offenses, risky driving behaviors and troubled family backgrounds. But this type of driver will likely also have a history of riding with the impaired.\nResearchers at Colorado State University and Colorado School of Public Health looked at data from the NEXT Generation study that followed a group of more than 2,000 teens (they began in 10th grade) from 81 schools across America as they emerged into adulthood. They looked at driving-related behaviors in relation to alcohol, marijuana and illicit drug use, with data from two years -- one year after high school and, again, two years after high school.\nThe survey asked, “How many times in the past 12 months did you ride with someone drinking alcohol,” asking again for marijuana and illicit drugs, like ecstasy or cocaine. Researchers also asked who was driving and if the students participated in binge drinking or used marijuana in the past 30 days.\nOne in three young adults reported being a passenger of an impaired driver at least once in the past year. To break it down further, 23 percent of drivers were marijuana-impaired, 20 percent alcohol-impaired and 6 percent illicit drug-impaired.\nSTOCK/Getty Images\nThese drivers included older adults -- of concern because impressionable youth can “model” what they’ve lived, and driving with impaired adults at the wheel may influence their own choices as adults.\n“Parents should be a role model by not driving while impaired, and real friends should stop their friends from driving after using substances -- if using substances cannot be stopped,” said author Kaigang Li, Ph.D., in a press release.\nIn the second year of the study, increased odds of riding with impaired people were highest with an alcohol-impaired peer driver (four times higher than the first year after high school), next to a marijuana-impaired older adult driver (three and a half times greater than the first year), an alcohol-impaired older adult driver (nearly three times), and a marijuana-impaired peer driver (slightly over two times).\nWho was the most likely to choose to get in the car?\nYoung women were more likely than young men to RWI the first year that the study followed them. They found that 25.1 percent of young women said they were passengers in a car with an impaired driver compared to just 21.9 percent of young men. But it evened out the next year with 32.9 percent of young women opting to ride in a car with someone impaired, in comparison to 33.2 percent of young men.\nHispanics were nearly five times more likely to ride with an impaired illicit drug user the second year. Those not in college or attending community college were more likely to RWI than those in four-year colleges, and the same trend was seen in those that were unemployed or working part-time compared to peers with full-time jobs.\n“These behaviors are not isolated, especially in young people. When one risk behavior is present, it can definitely influence other behaviors,\" said Li. “We want them to conclude that ‘friends don’t let friends engage in risky behaviors.’ If they know that their friends don’t do these risky things, they won’t do it themselves.”\nOverall, the researchers hope their findings will encourage young adults to transfer what they’ve learned about not drinking and driving to not riding with a driver who’s \"altered.\"\nDr. Najibah Rehman, MD, MPH, is a third-year preventive medicine resident at the University of Michigan, working in the ABC News Medical Unit.",
    "source_domain": "abcnews.go.com",
    "title": "1 in 3 young adults ride with impaired drivers, according to new study",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/young-adults-ride-impaired-drivers-study/story?id=53859952"
}