{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:25:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Irving scores 37, Cavs hold on to beat Pacers 117-111",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Firving-scores-37-cavs-hold-beat-pacers-117-46852723.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_09286422761b41c2a3862e72f470acdd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kyrie Irving scored 37 points, Kevin Love added 27 and the Cleveland Cavaliers avoided another fourth-quarter collapse in Game 2, beating the Indiana Pacers 117-111 on Monday night to take a 2-0 lead in the series.\nAfter squeaking out the opener by a point, LeBron James and Co. showed more intensity on defense, more swagger in general and won their 10th straight first-round game over the past three seasons.\nHowever, they nearly blew an 18-point lead in the fourth as the Pacers got within four before Cleveland closed it out at the line.\nJames added 10 rebounds and seven assists, but had eight of Cleveland's 19 turnovers.\nGame 3 is Thursday night.\nPaul George scored 32 and Jeff Teague 23 for Indiana, which showed more fight, but now has a steep hill to climb to get back in the series. Cleveland is 12-0 when starting 2-0 in the postseason.\nThe Cavs vowed they would play better after their near-disaster in Game 1 and they backed up their talk, delivering the kind of performance that was routine last season but very rare in 2017.\nLove scored 10 straight and drew a charging foul on Lance Stephenson in a span of two minutes as the Cavs opened an 89-70 lead. Irving closed the quarter by draining a 3-pointer over Stephenson and the All-Star made sure Indiana's antagonizing guard knew about it, yapping in his direction long after the horn sounded.\nThe Cavs still led 109-91 with 6:09 left, but the Pacers ripped off 13 straight points and were within 113-109 when George hit a 3-pointer with 20 seconds left.\nIt continued a disturbing trend for the Cavs, who have been giving up late, big leads with regularity.\nThe other hitch for Cleveland was that starting guard J.R. Smith didn't play in the second half because of a left hamstring injury. Iman Shumpert, who sat the opener, replaced Smith and played 20 solid minutes.\nDespite losing the opener, Pacers coach Nate McMillian insisted his team hadn't lost any confidence.\n\"We believe,\" he said. \"We came in believing, we still believe.\"\nIt just got a lot harder.\nTIP-INS\nPacers: Glenn Robinson III returned after missing the past 12 games with a strained left calf. He scored four in nine minutes. ... C Al Jefferson was active, but didn't play. He's been out since March 26 with a sprained left ankle. ... George has made at least one 3-pointer in 19 consecutive playoff games. ... McMillan said the team was told by security officials to stay in their hotel Sunday night while Cleveland police searched for a suspected killer, who randomly murdered an elderly man while posting the shooting on Facebook. ... Indiana is 0-9 when dropping the first two games in a series.\nCavaliers: James (357) jumped Magic Johnson (358) for third place in career playoff steals and hopped Robert Parish for eighth in rebounds. ... A moment of silence was observed for Robert Godwin Sr., the 73-year-old tragically gunned down by the Facebook assailant. ... Stephenson had a strong workout with Cleveland in January before latching on with Indiana, but coach Tyronn Lue said his recent injury issues — groin surgery and an Achilles issue — dissuaded the Cavs from signing him. ... James has scored at least 30 points with 10 assists in 13 career playoff games, trailing only Jerry West (14) and Michael Jordan (15).\nUP NEXT\nAfter two days off, the series resumes in Indianapolis on Thursday. The Pacers went 29-19 at home during the regular season.\n———\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "Irving scores 37, Cavs hold on to beat Pacers 117-111",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/irving-scores-37-cavs-hold-beat-pacers-117-46852723"
}