{
    "authors": [
        "Abc News",
        "David Rind",
        "Kelly Terez",
        "More Brad",
        "More David",
        "More Kelly"
    ],
    "date_download": "2018-04-25 00:06:15+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "It's Tuesday, April 24, 2018. Here are some of the stories we're talking about on ABC News' new daily podcast, \"Start Here.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fstart-here-iran-deal-menu-state-dinner-french-president%2Fstory%3Fid%3D54606437.json",
    "image_url": "https://s.abcnews.com/images/US/macron-1-gty-er-180423_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's Tuesday, April 24, 2018. Here are some of the stories we're talking about on ABC News' new daily podcast, \"Start Here.\"\nWashington was star-struck yesterday as French President Emmanuel Macron and the first lady of France, Brigitte Macron, took a stroll around the monuments of D.C.\nThey arrived at the White House for their second visit, but for the first time since taking office, President Donald Trump will treat his guests to a full state dinner. And then later this week, he'll receive arguably the most powerful person in Europe, German Prime Minister Angela Merkel.\nBut for all the pomp and circumstance, both leaders are bringing deadly serious agendas. ABC News chief foreign correspondent Terry Moran says they will both attempt to convince Trump to stay in the Iran nuclear deal.\nMandel Ngan/AFP/Getty Images\n2. Carnage in Canada\nIn Canada yesterday, Toronto was playing host to the G7 Leaders Summit. Secretaries of state, foreign ministers and huge security details all gathered as some of the world's top diplomats got together.\nBut then, a van barreled down a busy sidewalk for nearly a mile and a half -- mowing down dozens of pedestrians. The police have named the suspect, but they haven't said much about his motive or the circumstances surrounding his apparent rampage.\nABC's Tom Llamas in Toronto says a police officer remained calm to take down the suspect alive.\nWarren Toda/EPA/REX/Shutterstock\n3. Spotlight on Arizona's 8th\nThere have been two big trends in Congress over the last year: lawmakers resigning after making inappropriate comments to women and special elections occurring in districts that voted overwhelmingly for Trump in 2016.\nBoth of these trends have collided in Arizona. Former Rep. Trent Franks, R-Ariz., resigned in December after talking to his female staffers about carrying a child for him and his wife. And with Franks gone, two candidates are fighting it out for his seat amid high tensions in both parties.\nWho will win tonight and what does it all mean for the midterms? ABC News political director Rick Klein predicts what will happen in Arizona's 8th Congressional District.\nAnita Snow/AP\n4. Confirmation controversy\nOne of Trump’s cabinet nominees may have seen his confirmation prospects mortally wounded.\nRear Adm. Ronny Jackson, the military doctor who serves as the president's personal physician, had been nominated to lead the Department of Veterans Affairs. And a lot of people were wondering if he can run a government department.\nNow, ABC’s Meridith McGraw says new allegations about his professional conduct raised by ABC News sources on Capitol Hill and at the White House could ultimately derail his confirmation hearing.\n5. Shift in succession\nYou've seen the pictures: William and Kate, the Duke and Duchess of Cambridge, in the doorway of St. Mary's Hospital in London, presenting their new baby boy to the cameras yesterday.\nEven though she might not know it yet, this moment was a big one for royal sibling Charlotte, too. That's because for the very first time in the history of the monarchy, she's not being passed over by her younger brother.\nABC’s James Longman says a new law from Parliament about the line of succession to the throne has flipped the script on hundreds of years of tradition.\nHannah Mckay/Reuters\n\"Start Here\" is a daily ABC News podcast hosted by Brad Mielke featuring original reporting on stories that are driving the national conversation. Listen for free at Apple Podcasts -- also available on TuneIn, Spotify, Stitcher, Google Play Music, iHeartRadio and the ABC News app.\nFollow @StartHereABC on social for exclusive content, show updates and more: Twitter, Facebook, Instagram.",
    "source_domain": "abcnews.go.com",
    "title": "'Start Here': Iran deal on the menu at state dinner for French president",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/start-here-iran-deal-menu-state-dinner-french-president/story?id=54606437"
}