{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 23:23:02+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Faustralians-commemorate-103rd-anniversary-turkish-battle-54705143.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_8d5b022ce1ce49e89962d90d278f9552_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Thousands of Australians gathered at pre-dawn services on Wednesday to commemorate the moment when Australian and New Zealand Army Corps troops waded ashore at the Gallipoli peninsula in Turkey 103 years ago in their first major battle of World War I.\nBecause extremists have targeted annual ANZAC Day ceremonies in the past, concrete barriers were placed around the service in downtown Sydney to protect those who gathered at Martin Place.\nPrime Minister Malcolm Turnbull, his French counterpart Edouard Philippe and the heir to the British throne, Prince Charles, will mark ANZAC Day in France with a service that also commemorates the 100th anniversary of Australian troops taking the town of Villers-Bretonneux from the Germans. Villers-Bretonneux is now home to the main Australian Memorial of the Western Front.\nAt Villers-Bretonneux, Turnbull and Philippe on Tuesday unveiled a memorial plaque at the new Sir John Monash Centre museum which is named after the Australian general responsible for taking the town.\nTurnbull and his wife, Lucy, also visited the grave of her great uncle Roger Hughes who was killed by a German shell in 1916 dive days after arriving on the Western Front as a young military doctor.\nTurnbull said in an ANZAC Day message that Australians remember veterans of every generation who risked their lives for their country.\n\"We best honor the ANZACs of 1918 and the First World War by supporting today's service men and women,\" Turnbull said on social media.\nHome Affairs Minister Peter Dutton represents the Australian government at a service at ANZAC Cove at Gallipoli, where the Australian and New Zealand troops landed under British command in an ill-fated attempt to take the Ottoman Empire out of the war.\nMore than 44,000 Allied soldiers were killed at Gallipoli. Turkish casualties were estimated at 250,000.\nAt the Australian War Memorial in the capital Canberra, an estimated crowd of 38,000 — 10 percent of the city's population — gathered in the cool autumn darkness for the dawn service which began with a lone soldier playing a didgeridoo.\n\"The attendance at this year's dawn service shows the enduring connection so many people have to Anzac Day,\" Memorial Director Brendan Nelson said in a statement.",
    "source_domain": "abcnews.go.com",
    "title": "Australians commemorate 103rd anniversary of Turkish battle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/australians-commemorate-103rd-anniversary-turkish-battle-54705143"
}