{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 08:14:56+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fchinese-retail-tycoons-fraud-conviction-thrown-55553202.json",
    "image_url": "https://abcnews.go.com/Business/wireStory/chinese-retail-tycoons-fraud-conviction-thrown-55553202",
    "language": "en",
    "localpath": null,
    "maintext": "China's supreme court threw out a retail tycoon's fraud conviction on Thursday in an unusual show of leniency toward entrepreneurs amid a string of high-profile detentions and prosecutions that has rattled the Chinese business world.\nZhang Wenzhong, former chairman of one of China's biggest retail chains, Wumart Stores Inc., was released in February after serving 12 years in prison on charges that included improperly obtaining technology development subsidies.\nThe Supreme People's Court ruled that while Zhang, a computer scientist who studied at Stanford University and founded Wumart in the 1990s, violated rules in applying for the subsidies, he did so unintentionally and his company was eligible to receive them.\nZhang and another executive who was convicted had no \"subjective intention\" to commit fraud, the court said. It said their conviction was a \"misapplication of the law and should be corrected.\"\nThe ruling was a rare success by a high-profile defendant in a law enforcement system that is in the midst of a marathon crackdown led by President Xi Jinping on official corruption and financial misconduct.\nA series of Chinese businesspeople have been prosecuted or detained for questioning since 2016 about possible offenses including fraud, embezzlement and bribery.\nOn Wednesday, a lawyer for the imprisoned founder of China's biggest privately owned insurance company said he will appeal an 18-year prison sentence on fraud charges. Wu Xiaohui of Anbang Insurance, which owns New York City's Waldorf Hotel, was convicted of improperly raising billions of dollars from investors and diverting company to his own use.\nThe founder of a Shanghai-based company that was buying a stake in Russia's biggest oil producer, Rosneft, was detained in March, according to news reports. A Chinese-born Canadian businessman disappeared from Hong Kong in early 2017 and news reports say he might have been abducted by mainland police for possible trial.\nZhang was accused of improperly obtaining 31.9 million yuan ($4.9 million) from a government program for a logistics and information management project. Prosecutors said only state-owned companies were eligible and Zhang colluded with a subsidiary of a government enterprise, China Chentong, to obtain the money.\nThe supreme court said the rules had changed by the time Wumart applied and private companies were eligible.\n\"It is in accordance with the industrial and development policies of that time,\" the court said.\nIt gave no indication why a lower court that upheld Zhang's conviction in 2009 failed to notice the rule change that would have freed him.\nZhang stepped down as chairman of Wumart's parent company after being detained in 2006.\nThe supreme court also overturned Zhang's conviction on charges he and other investors improperly used 40 million yuan ($6.1 million) from a customer's account at an insurance company to trade stocks.\nThe facts of that case were unclear and \"lacked sufficient evidence,\" the court said.",
    "source_domain": "abcnews.go.com",
    "title": "Chinese retail tycoon's fraud conviction thrown out",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/chinese-retail-tycoons-fraud-conviction-thrown-55553202"
}