{
    "authors": [
        "Abc News",
        "Andy Fies",
        "Emily Shapiro",
        "More Alex",
        "More Emily"
    ],
    "date_download": "2017-04-17 20:17:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Robert Godwin Sr., 74, was shot and killed in Cleveland on Sunday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdaughter-man-gunned-facebook-video-fear-fathers-eyes%2Fstory%3Fid%3D46847374.json",
    "image_url": "http://a.abcnews.com/images/US/ap-facebook-shootnig-victim-robert-godwin-jc-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A daughter of the man whose killing was recorded and posted on Facebook Sunday told ABC News in an emotional interview that the video \"forever will be in my mind because I saw the fear in my father's eyes.\"\nIn the video of the Cleveland, Ohio, shooting, which has since been removed from Facebook, Robert Godwin Sr., 74, can be seen raising his hands in an apparent attempt to ward off his attacker before he is shot in the head.\nThe suspected gunman, Steve Stephens, has been on the run ever since and there have been no credible sightings of him.\nGodwin's daughter, Tonya Godwin Baines, told ABC News today that it \"feels like our heart is just ripped out of our chest. For somebody to brutally murder my father like that is unbelievable.\"\nBaines said her father was the epitome of a family man who \"would give you the shirt off his back.\"\n\"He taught us about God, he taught us love, forgiveness. Just to know that I will never ever hear my father's voice again is devastating,\" Baines said. \"My father was such an honest man that didn't drink, didn't smoke, no crime; he was just picking up cans [when he was shot].\"\n\"We can never replace him,\" she added, crying. \"A part of us died with him.\"\nBaines' sister, Debbie Godwin, told ABC News she didn't watch the video \"because I didn't want that to be the last remembrance of my father.\"\n\"He didn't deserve to just be picked out randomly,\" Debbie Godwin said. \"And then to add insult to injury you tape it while my father is begging for his life.\"\nBut the sisters said they have already forgiven the man accused of killing their father.\nFacebook via Reuters\n\"I truly can say I don't even feel any animosity against the guy that killed my father,\" Debbie Godwin said. \"I'm glad that my parents taught us to love people and to forgive even when they do us wrong. ... My dad would be the kind of person that would say, 'You gotta forgive.'\"\n\"I want him to get help,\" Debbie Godwin said of the suspected gunman. \"He needed that before this happened and I pray for his mother. I want to be able to meet her and hug her.\"\nBaines said she hopes Stephens surrenders.\nCleveland Police Chief Calvin Williams said of the suspect this morning, \"We don't know where he's at,\" and asked for the public's help in tracking Stephens down.\nWilliams said this afternoon that the manhunt has expanded to a national search.\nA reward of up to $50,000 is being offered for information leading to Stephens' arrest. Cleveland police have issued a warrant for Stephens on a charge of aggravated murder.",
    "source_domain": "abcnews.go.com",
    "title": "Daughter of man gunned down in Facebook video: 'I saw the fear in my father's eyes'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/daughter-man-gunned-facebook-video-fear-fathers-eyes/story?id=46847374"
}