{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 02:57:14+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Abortion opponents say the law violates free speech rights.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fscotus-hear-arguments-california-law-requiring-pregnancy-center%2Fstory%3Fid%3D53862095.json",
    "image_url": "https://s.abcnews.com/images/Politics/supreme-court-ap-jt-171001_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Supreme Court Tuesday hears arguments in a case challenging the constitutionality of a California state law requiring licensed “crisis pregnancy centers\" — pro-life facilities that offer pregnancy-related services — to post notices advising clients that they are not medical facilities and that abortion and other services are available elsewhere.\nThe notice reads: “California has public programs that provide immediate free or low-cost access to comprehensive family planning services (including all FDA-approved methods of contraception), prenatal care, and abortion for eligible women.”\nThe National Institute of Family Advocates contends California’s FACT ACT, which stands for Freedom, Accountability, Comprehensive Care, and Transparency Act, violates the First Amendment right to free speech.\n“California imposes this compelled speech only on centers that oppose abortion,\" the group says. \"The Act does not impose these compelled statements across the board but uses broad exemptions to exclude health providers that provide or promote abortion or abortifacients. Therefore, the only ones forced by the State to speak these government messages are those who oppose abortion.”\nMark Sherman/AP\nAttorneys for California argue the disclosure notice the centers must post under the act, “falls well within the First Amendment’s tolerance for the regulation of the practice-related speech of licensed professionals.”\nAttorneys for the state argue the FACT ACT provides needed information. “A woman who seeks advice and care during pregnancy needs certain basic information to make informed decisions and obtain appropriate, timely medical care,\" they argue. \"When she is offered assistance by a facility that provides pregnancy-related services of a type the public may associate with medical clinics, she needs to know whether the entity she is dealing with is in fact a state-licensed clinic staffed with regulated professionals.\"\n\"And when she visits a state-licensed clinic that caters to those not covered by private insurance or already enrolled in public programs and provides less than the full spectrum of relevant health care,\" they say, \"she needs to know that there are state resources available to access additional care if she wishes to do so.”\nThe U.S Court of Appeals for the Ninth Circuit upheld the California law. Both the Fourth and Second U.S. Circuit Courts of Appeals have struck down similar laws.\nABC News Supreme Court contributor Kate Shaw helps us understand the case:\nWhat’s this case about?\nThis case involves a First Amendment challenge to a California law called the “Reproductive Freedom, Accountability, Comprehensive Care, and Transparency Act,” popularly known as the FACT Act.\nThe FACT Act requires all pregnancy-related clinics in California to make certain disclosures. First, the law requires unlicensed pregnancy centers, which typically provide women with counseling, adoption services, free baby products, and other sorts of support, to post notices informing patients that they do not provide medical care.\nSecond, the law requires centers that are licensed to provide medical care to post notices explaining that publicly-funded family planning services, including contraception and abortion, are available in California.\nA group of clinics, who call themselves “pro-life pregnancy centers,” have challenged the FACT Act, claiming that it violates their speech and religion rights under the First Amendment.\nWhat are the two sides arguing?\nCalifornia claims it is simply imposing reasonable requirements to ensure that women do not inadvertently seek care at a center they believe to be a medical facility when in fact it is not, and that when centers do provide medical services like pregnancy tests and ultrasounds, they do not mislead women about their range of options.\nThe pregnancy centers argue that the state of California is forcing them to recite the state’s pro-abortion message, in violation of their religious convictions; they argue that they exist to promote childbirth and that California is requiring them to highlight the possibility of abortion.\nHow might the Justices rule?\nThe Justices could affirm the Ninth Circuit, which upheld that the FACT Act’s constitutionality. Or they could side with the challengers, striking down the FACT Act in its entirety. A third possibility is that they could uphold some but not all of the FACT Act—essentially the position of the Trump Justice Department, which has filed a brief arguing that they “unlicensed clinic” requirements are constitutional, but that the licensed clinic requirements are not.\nThis is the Court’s first significant abortion case since Justice Neil Gorsuch took the bench, so there will be a great deal of interest in how he votes in the case.\nWhat is the national impact of this case?\nPregnancy centers like the plaintiffs in this case operate in every state, so the Court’s ruling here could well have national impact—though even if the Court upholds California’s law, no state will be required to regulate these centers as California has done. If the Court sides with the centers, the state argues that pregnant women will be at risk of deception and misinformation at these centers, with state law essentially powerless to prevent it.",
    "source_domain": "abcnews.go.com",
    "title": "SCOTUS to hear arguments on California law requiring pregnancy center disclosures",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/scotus-hear-arguments-california-law-requiring-pregnancy-center/story?id=53862095"
}