{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 01:52:44+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2F20-ministers-convene-argentina-53855300.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_83045d86ce714e58a16b48b0b1a87b52_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Finance ministers and central bankers from the 20 leading industrial and developing countries are meeting in Argentina at a summit that has been eclipsed by growing concerns over the potential of a global trade war following U.S. President Donald Trump's decision to slap import tariffs on steel and aluminum.\nTrump's tariffs — of 25 percent on imported steel and 10 percent on aluminum imports — enter into force this week.\nThe issue had not been addressed officially at the two-day summit that began Monday in Buenos Aires. But some G-20 officials, who spoke on condition of anonymity because they were not authorized to speak publicly, said that Trump's measures have been a major talking point in private sessions.\nArgentina's Treasury Minister Nicolas Dujovne asked U.S. Treasury Secretary Steven Mnuchin on Monday to exempt the South American country from the tariffs. Trump is temporarily exempting Canada and Mexico.\nOther Latin American countries have also reached out to Trump for exemptions, and the European Union's top trade official said Monday that the EU should be excluded as a whole. The EU has already published a list of American products it plans to tax if it is not exempted.\nThe tariffs and the EU threat to retaliate with counter-measures have escalated the risk of a trade war with tit-for-tat tariff boosts that would harm exporting nations as well as raising prices for consumers in importing nations.\nThe EU considers itself to be caught in the crossfire of a dispute which is actually intended to punish China for being unfair in its commercial deals.\nAt news conference on Monday, Dujovne and OECD Secretary General Angel Gurria presented a report, but they declined to take questions.\nThe summit in Buenos Aires is the first of five meetings by finance ministers and central bankers scheduled in advance of a main G-20 meeting in Argentina that will be held Nov. 30-Dec 1.\nOfficials are also discussing issues including infrastructure development and the technology behind cryptocurrencies during the two-day meeting.\nThe Trump administration has banned all use by Americans of Venezuelan cryptocurrency, saying that its introduction is intended to skirt U.S. sanctions. Venezuelan last month announced a cryptocurrency known as the \"petro,\" for which the government says it has received investment commitments of $5 billion.\nMeanwhile, senior officials of several nations proposed that international lending institutions such as the International Monetary Fund move to help governments affected by flood of Venezuelans fleeing their crisis-wracked homeland, Argentina's Finance Ministry said in a statement.\nBrazil's Treasury Minister Henrique Meirelles said a multilateral fund to aid the refugees had been suggested.",
    "source_domain": "abcnews.go.com",
    "title": "G-20 meeting in Argentina eclipsed by potential trade war",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/20-ministers-convene-argentina-53855300"
}