{
    "authors": [
        "Abc News",
        "Emily Shapiro",
        "More Amanda",
        "More Emily"
    ],
    "date_download": "2017-12-11 23:34:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "He was in custody in NY on a Florida warrant for alleged custodial interference.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fsoccer-coach-allegedly-ran-teen-extradited-florida%2Fstory%3Fid%3D51724405.json",
    "image_url": "http://a.abcnews.com/images/US/missing-rian-rodriguez-ht-thg-171128_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A high school soccer coach who allegedly ran away with a 17-year-old girl is being extradited to Florida, an official told ABC News today.\nRian Rodriguez, 27, had been in custody in upstate Onondaga County, New York, on a Florida warrant for alleged custodial interference since 17-year-old Caitlyn Frisina was found safe in New York with him earlier this month. He's now been released from the Onondaga County Jail to be extradited to Florida, where he lives, said Jon Seeber of the Onondaga County Sheriff's Office.\nWYSR\nCourtesy Columbia County Sheriffs Office\nA spokesperson for the Columbia County Detention Facility in Florida confirmed to ABC News that Rodriguez is heading to the jail, but the spokesperson declined to say when he is expected to arrive due to security reasons.\nFrisina was reported missing from her Florida home on Nov. 26, sparking a massive search. She and Rodriguez -- a family friend and assistant soccer coach at the teen's Florida high school -- were found in a car together in Syracuse six days later.\nCourtesy Columbia County Sheriffs Office\nFrisina has since been reunited with her parents.\nWFOX\nChuck Keller, the Syracuse-based attorney representing Rodriguez in New York, told ABC News last week, “I can say that my client maintains his innocence of any charges and has consented to be extradited back to Florida as soon as possible so that he can clear up the matters there.\"",
    "source_domain": "abcnews.go.com",
    "title": "Soccer coach who allegedly ran away with teen being extradited to Florida",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/soccer-coach-allegedly-ran-teen-extradited-florida/story?id=51724405"
}