{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:32:03+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fyahoo-paying-35m-settle-sec-charges-2014-hack-54698928.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_12dd1b27ca6047bca73d3fd283b66bf9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The company formerly known as Yahoo is paying a $35 million fine to resolve federal regulators' charges that the online pioneer deceived investors by failing to disclose one of the biggest data breaches in internet history.\nThe Securities and Exchange Commission announced the action Tuesday against the company, which is now called Altaba after its email and other digital services were sold to Verizon Communications for $4.48 billion last year. The Sunnyvale, California-based company, which is no longer publicly traded, neither admitted nor denied the allegations but did agree to refrain from further violations of securities laws.\nPersonal data was stolen from hundreds of millions of Yahoo users in the December 2014 breach attributed to Russian hackers. The SEC alleged that, although Yahoo senior managers and attorneys were told about the breach, the company failed to fully investigate. The breach wasn't disclosed to the investing public until more than two years later, when Yahoo was working on closing Verizon's acquisition of its operating business in 2016, the SEC said.\n\"Yahoo's failure to have controls and procedures in place to assess its cyber disclosure obligations ended up leaving its investors totally in the dark about a massive data breach,\" Jina Choi, director of the SEC's San Francisco regional office, said in a statement.",
    "source_domain": "abcnews.go.com",
    "title": "Ex-Yahoo paying $35M to settle SEC charges over 2014 hack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/yahoo-paying-35m-settle-sec-charges-2014-hack-54698928"
}