{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:45:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "County Court Judge Eleni Derke appears live on \"GMA\" to discuss how she teaches yoga classes on the lawn outside of the courthouse where she works.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fflorida-judge-teaches-yoga-courthouse-46853547.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_breakfast_yoga_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Florida judge teaches yoga at her courthouse\nWe have a great story that gives any of you ever feel judged when you take a yoga class? Yes. You're nodding your head. You are going to feel it right now because we're about to meet a Florida judge who actually teaches yoga on the courthouse lawn. There she is right there, Eleni derke. How is it going this morning, Eleni? Good morning. We're here ready to do some yoga for you. Tell me how you came up with it. How did you come up with this idea. Uh-oh. She's going to derobe. Taking it off. I can't do yoga in the robe, you know. The women behind you -- About two years ago -- what's that? I'm sorry. Go ahead. Well, about two years ago the president of the Jacksonville bar association asked me to head up the health committee and I thought, what a better way to stay healthy than to do yoga so I started teaching yoga on the lawn every first Friday of referee month and right now we're just getting members of the legal community but the last is open to everybody because you know at the courthouse people need yoga. I'm sure of that. And -- High-stress situation. And I guess you're building a different kind of community out there. Well, yeah, I mean, it's -- people just love yoga. I think they need to destress, especially the legal communities, you know, yoga is the best form of stress release and by definition, the legal communities is an adversarial system so it's just made for a high-stress situation so these attorneys are in the courtroom. They're warriors in there. So they come out here and then they're warriors on their mats. Destress, they can refocus and then they can go back and do their jobs just right. Is it true you've also tried to use some of these techniques with your juries? I sure have. When you have a lengthy trial these poor guys just sit in those chairs for so many hours, I don't make them but I usually just say, why don't we all just stand up, inhale, arms overhead. Take a deep breath in and exhale them back down. That energizes them. No falling asleep on my watch. And, of course, you're the judge so they have to do what you say. But everyone -- You know what, I feel bad about that and I didn't really think about that when I was doing it. But it's for their own good. Absolutely. I would agree. Well, everybody behind you, one in particular she has been holding that pose the entire time in the glasses behind you. She gets credit for that. They are very well trained. Do you want to show us a few moves before we leave you. Of course, sure. All right. So warrior two on the left first. We're going to reverse it. Ah. Then we'll do our side angle stretch. In sanskrit and then the other side. Nice. Well done. All right. Well, we'll let you get to it. It looks like a beautiful morning there as well. Thank everybody for us, judge. It's a gorgeous morning. You are gorgeous. Namaste. Namaste. Now must go. Before we go it is a very\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Florida judge teaches yoga at her courthouse",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/florida-judge-teaches-yoga-courthouse-46853547"
}