{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 16:20:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "For Trump, the 1980s Still Hold Relevance",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Ftrump-1980s-hold-relevance-44508668.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_440e7d6e33bc4304b7c465fcf95d720f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bobby Knight. Don King. Sylvester Stallone.\nMany of President-elect Donald Trump's cultural touchstones, which he'd frequently name-drop at campaign rallies and on Twitter, were at their peak in the 1980s — the decade Trump's celebrity status rose in New York, Trump Tower was built, \"The Art of the Deal\" was published and he first flirted with running for public office.\nThe \"Go Go 1980s\" of New York were spurred by Wall Street's rise. It was a brash decade in which excess was the norm and ostentatious displays of wealth and power were celebrated in pop culture and among Manhattan's elite. And while much of what defined the 1980s has since gone out of style, Trump has seemingly internalized its ethos, which is reflected in the decor of the Trump Tower lobby and the celebrities he stood alongside during the campaign.\nAn outer-borough New York developer trying to prove himself across the East River, Trump always sought approval of Manhattan's ruling class and was eager to make a name for himself, according to those who tangled with him during that formative decade.\n\"He would relentlessly promote himself in the newspapers or on TV. He knew how to get press and squash his enemies,\" said Geoge Arzt, press secretary for former New York City Mayor Ed Koch, who served from 1978 to 1989. The me-first attitude that defined the 1980s \"has long been a part of who Trump is,\" Arzt added.\nIn the 1980s, as Trump came of age as a public figure, he opened up a refurbished Grand Hyatt on 42nd Street, took over the long-stalled renovation of Central Park's ice skating rink and purchased the New York-area team in the fledgling United States Football League.\nHe fashioned himself into a regular in the gossip pages, playing the city's tabloids off each other as he promoted his personal brand. He also took his first steps onto the national media stage, making his debut on \"60 Minutes\" in 1985. The long-running news magazine broadcast has continued to hold a special place in his heart. Several times at rallies, Trump invoked a \"60 Minutes\" segment he had just watched and he gave his first post-election interview to the show last month. That show was at its apex in the ratings in the 1980s.\nTime Magazine, which also wielded significant clout in the 1980s, also has remained an obsession for Trump.\nThe celebrity businessman, who complained in recent years that he wasn't named the magazine's Person of the Year, received the award in 2016. He called it a \"very, very great honor.\" That marked his eighth time on the cover this year alone — something that Trump would brag about during campaign rallies. He has taken to giving out autographed copies of the cover to visitors, including rapper Kanye West.\nBut while West is a current megastar, Trump mostly chose to trot out 1980s celebrities during his campaign, even if many of them had seen their star fade in the ensuing 30 years.\nKnight, the former Indiana University basketball coach who captured college basketball national titles in 1981 and 1987 but was later fired for attacking a student, became a favorite sidekick. He first appeared with Trump during the spring's Indiana primary and reappeared at rallies in the Midwest during the general election stretch run.\n\"One of the reasons I won: Bobby Knight! That's the gold standard, right?\" Trump exclaimed in August.\nKing, the flamboyant boxing promoter who hyped Mike Tyson's 1980s fights, was also saluted by Trump as \"a phenomenal person\" despite a conviction for manslaughter. King appeared with Trump in September at a Cleveland church and stood with the president-elect last week while Trump was answering questions from the press at his Palm Beach resort.\nTrump has been drawn to other 1980s stars. Tyson endorsed the celebrity businessman. Actor Scott Baio, an outspoken Trump supporter, reached the zenith of his fame in the 1980s with the shows \"Happy Days\" and \"Charles in Charge.\" And on Saturday, actor Sylvester Stallone — who starred in three \"Rambo\" movies and two \"Rocky\" sequels in the 1980s — was a star guest at Trump's New Year's Eve bash at Mar-a-Lago, the lush Florida estate Trump bought in 1985 two years after he opened Trump Tower on Fifth Avenue in New York.\nMuch of Trump's political philosophy was formed in the 1980s too. In 1987 as he first floated running for president, he took out a full page ad wondering why the U.S. was \"paying to defend countries that can afford to defend themselves.\" His frequent depictions of inner cities as dangerous and crime-ridden seem to to harken to the crack-plagued life of urban areas in the 1980s, more than the largely safer big cities of today.\nIn \"The Art of the Deal,\" he voiced positions on trade he still holds today. That book, which made him a household name when it was published in 1987, also holds many of the principles that guided Trump's business career — and, decades later, his bombastic campaign for the White House.\n\"I play into people's fantasies,\" he wrote. \"People may not always think big themselves, but they can still get very excited by those who do. That's why a little hyperbole never hurts. People want to believe that something is the biggest and the greatest and the most spectacular.\"\n———\nReach Lemire on Twitter at http://twitter.com/@JonLemire",
    "source_domain": "abcnews.go.com",
    "title": "For Trump, the 1980s Still Hold Relevance",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/trump-1980s-hold-relevance-44508668"
}