{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:15:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Boeing vote tells next chapter in Southern unionization",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fboeing-vote-tells-chapter-southern-unionization-45503726.json",
    "image_url": "http://abcnews.go.com/US/wireStory/boeing-vote-tells-chapter-southern-unionization-45503726",
    "language": "en",
    "localpath": null,
    "maintext": "Nearly 3,000 production workers at Boeing's South Carolina plant are deciding Wednesday on whether they want to unionize, writing the next chapter in efforts to organize labor in large manufacturing plants across the South.\nIf successful, the balloting on whether employees should join the International Association of Machinists and Aerospace Workers would send a significant message to politicians both in the region and Washington that workers here are demanding the same protections and benefits as their colleagues in other areas. And, to the leaders trying to recruit businesses by promoting their states' lack of union presence, it'd make their jobs more difficult.\nBut this most recent test of Southern acceptance of collective bargaining movements is an uphill battle for the union and its backers. The global aviation giant, which came to South Carolina in part because of the state's minuscule union presence, did so with the aid of millions of dollars in state assistance made possible by officials who spoke out frequently and glowingly with anti-union messages.\n\"It is an economic development tool,\" Gov. Nikki Haley, now President Donald Trump's ambassador to the United Nations, said in a 2012 address of how she sold companies on why they should come to the state. \"We'll make the unions understand full well that they are not needed, not wanted and not welcome in the state of South Carolina.\"\nAt least that part of the tactic has worked. While some South Carolina workers have representation — just more than 1,900, according to the U.S. Bureau of Labor Statistics' 2016 figures — most don't. Other major manufacturers in the state, including BMW and Michelin, aren't unionized or haven't experienced major campaigns to do so. The Machinists initially petitioned for a vote at Boeing in 2015 but withdrew the request because of what the union called a toxic atmosphere and political interference.\nSouthern states for decades have recruited manufacturers by promising freedom from the influences of labor unions, which except for some textile mills have been historically rejected by workers as collective action culturally foreign to a South built around family farms, said Jeffrey Hirsch, a law professor who specializes in labor relations at the University of North Carolina at Chapel Hill.\nA successful union vote at Boeing would have a greater impact on the general view of labor in the South than efforts by autoworkers to unionize Volkswagen in Chattanooga, Tennessee, as a foothold for organizing other Southern car plants. Anti-union advocates could always cite VW as an aberration since representatives of one of its key unions in Germany hold seats on the company's board of directors, Hirsch said.\n\"Boeing is very, very different,\" Hirsch said. \"No one will ever accuse Boeing of being pro-union.\"\nA \"yes\" vote would be meaningful throughout the region, said Daniel Cornfield, sociology professor and labor expert at Vanderbilt University. \"Given the dynamism of industrialization in the Southern region now, especially the development ... of the U.S. automotive industry, any type of heavy-industry union victory would certainly inspire other workers in related industrial sectors in the South to think about unionizing.\"\nWhat strikes Cornfield about the Boeing case is the company's silence over consequences for workers.\n\"The company has not been threatening to relocate its operations in the event of a unionization,\" he said. \"It is often the case that companies try to relocate outside of the United States to find cheaper labor and avoid U.S. unions altogether.\"\nBoeing already may have abstained from those kinds of threats because of its huge South Carolina plant investment and billions of dollars in federal defense contracts. Threatening to move manufacturing would come after Trump blasted Boeing for its cost of building a new presidential Air Force One for future presidents.\n\"Costs are out of control,\" Trump tweeted in early December. \"Cancel order!\"\nBoeing CEO Dennis Muilenburg met with Trump two weeks later.\n\"Given the recent pronouncements of President Trump about keeping manufacturing in the United States,\" Cornfield said, \"it would be interesting and an ironic twist that President Trump is possibly defanging large corporations in their efforts to resist unionization by encouraging companies to stay in the United States, giving workers a leg up and unions a leg up in the campaign period.\"\nCatherine Templeton, South Carolina's former labor director and successful anti-union lawyer, is no stranger to this fight. When Haley picked Templeton to lead South Carolina's labor department, the governor played up Templeton's union-fighting background and saying she needed her help to \"fight the unions\" at Boeing.\n\"They cannot legally deliver higher wages, better benefits or a different working environment. Even if they are promising it, they certainly can't deliver it,\" Templeton said.\nOn Monday, in a final gathering before the vote, several hundred Boeing employees gathered in a hotel ballroom just a mile from the Boeing plant, hearing from activists and members of other unions urging them to vote \"yes\" on Wednesday.\n\"Suppressing working people is the old way of doing business in South Carolina,\" Machinists organizer Mike Evans said, to cheers from the crowd. \"It's not going to be this way anymore.\"\n———\nAssociated Press writer Emery P. Dalesio in Raleigh, North Carolina, contributed to this report.\n———\nKinnard can be reached at http://twitter.com/MegKinnardAP . Read more of her work at http://bigstory.ap.org/content/meg-kinnard/ .",
    "source_domain": "abcnews.go.com",
    "title": "Boeing vote tells next chapter in Southern unionization",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/boeing-vote-tells-chapter-southern-unionization-45503726"
}