{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 04:05:05+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Rams win Coach of the Year, player awards; Saints take rookie honors",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Frams-win-coach-year-player-awards-saints-rookie%2Fstory%3Fid%3D52822435.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0203/dm_180203_ncb_bilas_on_trae_young/dm_180203_ncb_bilas_on_trae_young_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In his first season running a team and as the youngest head coach in NFL history, the? Los Angeles Rams' Sean McVay won The Associated Press 2017 NFL Coach of the Year award.\nNot to be outdone, his players, Todd Gurley II and Aaron Donald, won the Offensive and Defensive Player of the Year awards, respectively -- capping a remarkable turnaround season for the Rams.\nMcVay, who turned 32 on Jan. 24, led the Rams to an 11-5 record, a seven-game improvement from the mark they managed the previous season.?\nThe Rams won their first NFC West title since 2003, and second-year quarterback Jared Goff improved exponentially under McVay's guidance.\n\"What it means is we had a good season that I think we can build on,'' McVay said. \"But you have to earn it every single day. It's a very humbling league.''\nMcVay ran away with the voting by a nationwide panel of 50 media members who regularly cover the league. He drew 35 votes to 11 for Minnesota's Mike Zimmer. Doug Marrone of Jacksonville received two votes, while the Super Bowl coaches, Philadelphia's Doug Pederson and New England's Bill Belichick, each got one.\nGurley's 1,305 rushing yards, 13 rushing touchdowns and six TD receptions during the Rams' campaign earned him top offensive honors for the year. The third-year running back was the AP's top offensive rookie in 2015, then had a mediocre second season.\nGurley got 37 votes, which put him far ahead of Pittsburgh receiver Antonio Brown, who received eight votes. Patriots quarterback Tom Brady got four and Houston receiver DeAndre Hopkins had one.\n\"It just tells you the type of players we have on the team. We all help each other out, absolutely. We have some talent, but we're nothing without the whole nine yards and everybody together,\" Gurley said.?\nOnly two other Rams players have ever won the offensive player award -- Eric Dickerson (one) and Marshall Faulk (three).\nDonald, Gurley's teammate, became the first pure defensive tackle to win the NFL Defensive Player of the Year award since 1999?\nOften the province of outside pass-rushers and backs, Donald broke the trend by earning 23 votes from the 50-member panel.\n\"Words can't express what I'm feeling right now,\" Donald said. \"Trying to hold back the tears.\"\nWarren Sapp of Tampa Bay was the previous tackle to win the award.\n\"That's one of the best to ever do it, so for my name to be next to that guy's name is beyond a blessing,\" Donald said. \"My dad's been telling me since I was 12 years old working out in my basement trying to work to this point, all the work paid off. You put the body of work in, it's going to pay off for you.\"\nOther tackles to win the award have been Hall of Famers Joe Greene and Cortez Kennedy.\nWhile the Rams' defense didn't rank highly in league stats, Donald was a force. The 2014 top defensive rookie spent 2017 destroying blockers, leading all players at his position with 11 sacks and had 58 pressures while usually being double-teamed.\nDonald enters the final year of his rookie contract. He sat out last summer in hopes of getting a new deal and did not return in time for the season opener.\nDefensive end Calais Campbell, in his first season with the Jaguars, was second with 17 votes. Arizona's Chandler Jones got five.\nThe Rams' hat trick of awards was not unprecedented. In 2003, Baltimore's Ray Lewis was top defensive player, Jamal Lewis won best offensive player, and Terrell Suggs was Defensive Rookie of the Year. And in 1999, the St. Louis Rams had three award winners: Kurt Warner (MVP), Marshall Faulk (Offensive Player) and Dick Vermeil (Coach).\nSaints' Kamara, Lattimore win rookie honors\nThe future is bright in the Big Easy as New Orleans Saints running back Alvin Kamara and cornerback Marshon Lattimore won the top rookie awards.\nIn a year featuring outstanding rookie running backs, Kamara,?third-round draft pick out of Tennessee, beat another third-rounder, Kansas City's Kareem Hunt, for the Offensive Rookie of the Year award.\nKamara, selected 19 spots ahead of Hunt, received 28 votes to 21 for Hunt. Houston rookie quarterback Deshaun Watson, despite playing in only seven games before a season-ending knee injury, got the other vote.\n\"You get caught up in the season, you don't really get time to pat yourself on the back,'' Kamara said. \"But when the season is over you realize what you've done. I've kind of had to time to look back and say, I made some history this season.''\nKamara shared duties with veteran Mark Ingram as the Saints won the NFC South with an 11-5 record. He rushed for 728 yards with a 6.1-yard average and scored eight times. He also caught 81 passes for 826 yards, with 5 touchdowns.\nNo rookie had more impact on his NFL team this season than Lattimore, who won the 2017 NFL Defensive Rookie of the Year.\nThe 11th overall draft pick and first from his position selected, Lattimore was a shutdown defender for the Saints?\nThe Ohio State product had five interceptions and 18 passes defensed in 13 games, was a sure tackler and, by midseason, was someone opposing quarterbacks tended to avoid.\nHe missed three games, one because of a concussion and two with an ankle injury.?\nLattimore got 45 votes, far ahead of Buffalo Bills CB Tre'Davious White with four and San Francisco 49ers LB Reuben Foster with one.\nThe Saints are the first team to sweep the Offensive and Defensive Rookie of the Year awards since the 1967 Lions with Mel Farr and Lem Barney.\nChargers' Allen named comeback player\nLos Angeles Chargers wide receiver Keenan Allen returned from two devastating injuries to win the 2017 NFL Comeback Player of the Year Award.\nAllen missed half of the 2015 season with a kidney issue, then was lost in the 2016 season opener with a torn right ACL.\nThere were questions about whether Allen would ever play at a high level again. He answered those emphatically this season with the best year of his career. Allen caught 102 passes for 1,393 yards and 6 touchdowns. He was targeted 159 times, nearly 10 per game.\nThat performance earned him 28 votes. He easily outdistanced Minnesota quarterback Case Keenum, who had eight.\nKuechly honored with sportsmanship award\nCarolina Panthers linebacker Luke Kuechly has won the 2017 Art Rooney Sportsmanship Award.\nThe award recognizes the NFL player who best demonstrates the qualities of outstanding sportsmanship on the playing field, including fair play, respect for opponents and integrity in competition.\nThe award was founded in 2014 in honor of the late founding owner of the Pittsburgh Steelers and Pro Football Hall of Famer Art Rooney Sr. Kuechly will receive a $25,000 donation from the NFL Foundation to a charity of his choice.\nShurmur tabbed top assistant coach\nPat Shurmur heads to his new job as coach of the New York Giants with a prize. For his work as offensive coordinator with the Minnesota Vikings, Shurmur has won the 2017 NFL Assistant Coach of the Year award.\nWith a backup quarterback, Keenum, and without prized rookie running back Dalvin Cook for most of the year, Shurmur helped Minnesota go 13-3 and win the NFC North with a strong attack.\nThe Vikings ranked 11th overall in offense, doing so without a true star. Shurmur -- a former head coach at Cleveland -- earned 24? votes, as he outdistanced New Orleans defensive coordinator Dennis Allen, New England DC Matt Patricia, and Los Angeles Rams DC Wade Phillips, who all got four votes.\nESPN's Courtney Cronin, Alden Gonzalez and The Associated Press contributed to this report.?",
    "source_domain": "abcnews.go.com",
    "title": "Rams win Coach of the Year, player awards; Saints take rookie honors",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/rams-win-coach-year-player-awards-saints-rookie/story?id=52822435"
}