{
    "authors": [
        "Abc News",
        "More Dr."
    ],
    "date_download": "2018-05-30 19:55:29+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The drug is one of the most commonly used prescription sleep aids.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2Fambien-side-effects%2Fstory%3Fid%3D55530690.json",
    "image_url": "https://s.abcnews.com/images/Health/ambien-02-as-gty-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After Roseanne Barr posted a tweet comparing a former adviser of then-President Barack Obama to an ape, she later apologized in multiple tweets and said she made the racist comments while impaired by the pharmaceutical sleep aid Ambien.\nIn now-deleted tweets, she said, \"It was 2 in the morning and I was ambien tweeting-it was memorial day too-i went 2 far & do not want it defended.\"\nAnother tweet she wrote said she was \"not giving excuses for what I did(tweeted) but I've done weird stuff while on ambien- cracked eggs on the wall at 2am etc.\"\nMatt Petit/ABC via Getty Images\nThe manufacturer of Ambien, Sanofi-Aventis, admitted there are side effects to the sleep medication, but said in a tweet, \"People of all races, religions and nationalities work at Sanofi every day to improve the lives of people around the world. While all pharmaceutical treatments have side effects, racism is not a known side effect of any Sanofi medication.\"\nSo what exactly is Ambien?\nMore than a third of U.S. adults report that they do not get enough sleep, according to the U.S. Centers for Disease Control and Prevention. Since its arrival in 1993, the drug Ambien has become one of the most widely prescribed, and studied, sleep-aid medications.\nAmbien is the brand name for the drug zolpidem tartrate. It is part of a class of drugs called sedative-hypnotic, known to depress the central nervous system and promote sleep. It is also a schedule IV controlled substance under federal regulation because it can be abused or lead to dependence.\nWhen is Ambien prescribed?\nAmbien is indicated for short-term treatment of insomnia, a disorder in which one has difficulty with falling asleep, staying asleep or waking up too early. Doctors are recommended to re-evaluate Ambien prescriptions if the insomnia continues after seven to 10 days because that may indicate an underlying psychiatric or medical illness.\nGetty Images\nWhat are the most common side effects?\nFour percent of users reported side effects over the first 10 nights, including drowsiness, dizziness and diarrhea. The higher the dose, the higher the risk of side effects.\nWhat are the serious side effects of Ambien?\nAmbien does have more serious physical risks, reported in about one percent of users in studies. These risks include allergic reactions like swelling of the tongue or throat, trouble breathing, nausea and vomiting.\nWhat about behavioral side effects?\nAmbien can cause abnormal thinking, behavioral changes and affect complex behaviors like driving a car. Less than one percent of people in studies reported sleep-driving, sleep-walking, preparing and eating food, talking on the phone, having sex and having hallucinations while not fully awake, according to Sanofi-Aventis -- and they do not usually remember these events.\nLike any depressant, Ambien can also lower inhibitions. The use of alcohol and other depressants increases the risk of all of these behaviors. Although the FDA received more than 700 reports of Ambien-impaired driving, it was unclear what dose or time the medication was taken and if alcohol and other drugs were involved. Ambien has also been known to increase anxiety and depression, as well as suicidal thinking and behavior.\nSince Ambien is a central nervous system depressant, its use can also decrease alertness and ability to walk. It is known to cause falls and lead to hip fractures. Studies show poor recall after waking.\nSima Patel, M.D., is a third-year physical medicine and rehabilitation resident at the University of Minnesota who works in the ABC News medical unit.",
    "source_domain": "abcnews.go.com",
    "title": "What is Ambien and what are its known side effects?",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/ambien-side-effects/story?id=55530690"
}