{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 07:15:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "Jakob Silfverberg, Logan Shaw shoot Ducks past Carolina, 3-2",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjakob-silfverberg-logan-shaw-shoot-ducks-past-carolina-51732261.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_3c4e9435a5d34eaba02030ef263bbe84_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In the very first period after the Anaheim Ducks finally got captain Ryan Getzlaf and Jakob Silfverberg back from long-term injuries, Corey Perry hobbled off the ice with a lower-body injury that sent him to a hospital.\n\"It just seems like it's a regular day for us,\" Getzlaf said with a shake of his head.\nThe Ducks have been besieged by injuries all season long, yet they're still scratching out enough points to remain in the race.\nLogan Shaw had a goal and an assist, and Silfverberg returned from a five-game absence to score the tiebreaking goal late in the second period of the Ducks' 3-2 victory over the Carolina Hurricanes on Monday night.\nDerek Grant also scored and John Gibson made 28 saves for the Ducks, who won for just the third time in 11 games. The injury-plagued team was boosted by the simultaneous returns of Silfverberg and Getzlaf, who had missed 19 games after getting hit in the face with a puck.\nBut then the Ducks lost Perry to a potentially serious lower-body injury.\nPerry's right leg bent awkwardly as he ran into the back of Carolina's Jeff Skinner. The 2011 NHL MVP has played in 239 straight regular-season games and 40 playoff contests since Dec. 28, 2014.\nCoach Randy Carlyle said Perry was being evaluated at a hospital.\n\"I don't think there's much to say anymore,\" Gibson said of the Ducks' injury woes. \"We get frustrating playing with it, but we have what we have, and we keep playing. It's a credit to everybody here.\"\nJustin Williams scored and Scott Darling stopped 20 shots for the Hurricanes, who have lost four straight and six of seven. Carolina went winless on its three-game California road swing, although it picked up overtime points on the first two stops.\nVictor Rask scored for Carolina on a loose puck with 2:40 to play. The Canes couldn't get an equalizer past Gibson, who made several big saves down the stretch, including a stunning dive to stop Elias Lindholm.\n\"(Mistakes) are magnified when you're struggling to score, and obviously we are struggling to score,\" Carolina coach Bill Peters said. \"We got it to 3-2, and in the third when we pushed, I thought we had some real good looks.\"\nGetzlaf had been out since getting hit in the face by a puck Oct. 29 in Raleigh. The Ducks have been without Ryan Kesler, their other top center, all season long.\nGetzlaf even protected his recently repaired face with a visor, which he typically only wears during international play for Canada. He is among the few dozen NHL players who have chosen not to wear a visor after the league made them mandatory for new players in 2013.\nWhen asked if the visor was here to stay, Getzlaf snorted: \"I doubt it.\"\n\"I lost a few pucks in my feet, those things that I don't normally do,\" he added. \"Those are adjustments after coming back from such a long layoff.\"\nWilliams put the Canes ahead just 83 seconds into the first period with a nifty deflection in front, but Grant answered with his first goal in 10 games off a break with Shaw.\nSilfverberg roofed a wrist shot with 35 seconds left in the second period, capitalizing on a clear path to the net when Carolina defenseman Haydn Fleury fell down.\n\"It's a game of mistakes, we all say,\" Hurricanes defenseman Justin Faulk said. \"It gets tough when we're in a little bit of a tough stretch right now. Every mistake weighs on you a little bit more. You think about it more. You end up gripping your stick a little tighter, trying to bear down and make those plays.\"\nIn the third, Shaw ended his 20-game goal drought off a sharp pass from defenseman Andy Welinski, who got his first point in his NHL debut.\nNOTES: Anaheim D Hampus Lindholm missed his fourth straight game with an upper-body injury. ... The Ducks scratched LW Nick Ritchie, who was injured in their last game against Minnesota. Ritchie hadn't missed a game since Oct. 11. ... Anaheim made several roster moves before the game, sending RW Jared Boll, LW Kevin Roy and D Jaycob Megna to its AHL affiliate in San Diego.\nUP NEXT\nHurricanes: At Vegas Golden Knights on Tuesday.\nDucks: At St. Louis Blues on Thursday to open a six-game road trip heading up to the Christmas break.\n———",
    "source_domain": "abcnews.go.com",
    "title": "Jakob Silfverberg, Logan Shaw shoot Ducks past Carolina, 3-2",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/jakob-silfverberg-logan-shaw-shoot-ducks-past-carolina-51732261"
}