{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:56:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "US defense chief says N. Korea 'recklessly tried to provoke'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fus-defense-chief-nkorea-recklessly-provoke-46859040.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_06f3c5507da4445e9f29a312adef2d0d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Defense Secretary Jim Mattis says North Korea's latest failed missile launch was a reckless act of provocation.\nMattis commented on the weekend missile launch in an interview with reporters traveling with him Tuesday to Saudi Arabia, where he begins a weeklong Mideast tour. His language was stronger than in an initial written statement he issued shortly after the launch, in which he simply said he was aware of the failure.\n\"The leader of North Korea again recklessly tried to provoke something by launching a missile,\" he said.\nMattis did not identify the type of missile but said it was not of intercontinental range, meaning it could not reach U.S. territory. He did not comment on what might have caused the missile to fail.\nMattis credited China with trying to help get the North Korea situation \"under control\" with the goal of denuclearizing the Korean Peninsula.\nAsked about his visit to Saudi Arabia, Mattis said the desert kingdom is a \"pillar of our security framework for the region.\"\nThe U.S. military is providing support for a Saudi-led coalition fighting anti-government Houthi rebels, but Mattis said the U.S. focus is on arranging a United Nations-brokered negotiating team to resolve Yemen's civil war diplomatically.\n\"This is something, with the number of innocent people dying inside Yemen, that simply has to be brought to an end,\" he said.\nThe U.S. security alliance with Saudi Arabia, dating to 1944 and based largely on the Saudis' oil riches, has made Washington the kingdom's most important arms supplier.",
    "source_domain": "abcnews.go.com",
    "title": "US defense chief says NKorea 'recklessly tried to provoke'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/us-defense-chief-nkorea-recklessly-provoke-46859040"
}