{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:55:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Germany worried of jobs cuts from possible sale of GM's Opel",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fgermany-concerned-sale-gms-opel-45508036.json",
    "image_url": "http://abcnews.go.com/International/wireStory/germany-concerned-sale-gms-opel-45508036",
    "language": "en",
    "localpath": null,
    "maintext": "German politicians are expressing concern about a possible takeover of General Motors' Opel division by France's PSA Group, maker of Peugeot and Citroen cars.\nChancellor Angela Merkel's Cabinet discussed the possible consequences for German workers Wednesday.\nOpel employs 19,000 people in Germany out of a total work force of 38,000. And it's an election year in Germany, which means politicians are particularly sensitive to anything that might mean job losses.\nLabor Minister Andrea Nahles said that Opel's headquarters must remain in Ruesselsheim, Germany, the dpa news agency reported.\nPSA and GM said Tuesday that they were talking about expanding their current cooperation, with one option being PSA acquiring Opel. There is no guarantee a deal will happen, they said.\nEconomy Minister Brigitte Zypries has said it was \"unacceptable\" that the two companies did not inform employee representatives, the IG Metall industrial union, and the local and national governments about their plans.\nA ministry spokesman also said Zypries would speak to her French counterpart. The French government holds a stake in PSA.\nMeanwhile, GM CEO Mary Barra was at the Ruesselsheim headquarters on Wednesday.\nDetroit-based GM has been trying to return its European business to profit. It last made a full-year profit there in 1999. GM and PSA already cooperate on several vehicle projects. A tie-up between Opel and PSA could help reduce costs by creating a bigger company that would spread fixed costs over more vehicles.",
    "source_domain": "abcnews.go.com",
    "title": "Germany worried of jobs cuts from possible sale of GM's Opel",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/germany-concerned-sale-gms-opel-45508036"
}