{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 15:11:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-ukraine-faked-death-russian-journalist-55531833.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_fdb589d2f58e4f13abca33a48d07d569_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the reported slaying in Ukraine of a Russian journalist: (all times local):\n5:25 p.m.\nRussian journalist Arkady Babchenko, who had been reported shot and killed in the Ukrainian capital Tuesday, has shown up at a news conference very much alive.\nVasily Gritsak, head of the Ukrainian Security Service, told a news conference on Wednesday the agency faked Babchenko's death to catch those who were trying to kill him.\nKiev and national police had said Babchenko, a strong critic of the Kremlin, was shot multiple times in the back at his apartment building and found bleeding by his wife.\nHe showed up at Gritsak's new conference on Wednesday and thanked everyone who was mourning his death.\nBabchenko, 41, one of Russia's best-known war reporters, spoke and wrote year about leaving the country because of repeated threats that he and his family would be harmed.\n———\n2:35 p.m.\nA top lawmaker says Russia is willing to help Ukraine investigate the murder of a Russian journalist.\nArkady Babchenko, who was scathingly critical of the Kremlin, was gunned down in the Ukrainian capital, Kiev, on Tuesday.\nBabchenko fled Russia last year, fearing for his life, and settled in Ukraine. He had served in the Russian army during the two wars in Chechnya in 1990s and became one of Russia's best-known war reporters.\nVyacheslav Volodin, speaker of the State Duma, told Russian news agencies Wednesday that Russia would be happy to help with the investigation if Ukrainian authorities requested it.\nUkrainian authorities have said they think Babchenko was killed because of his work. Several Ukrainian politicians blamed the Kremlin for the killing. Kremlin spokesman Dmitry Peskov dismissed those comments as cynical.",
    "source_domain": "abcnews.go.com",
    "title": "Ukraine faked death of Russian journalist",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/latest-ukraine-faked-death-russian-journalist-55531833"
}