{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:56:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Game on: Tragedy won't stop annual baseball game",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fgame-tragedy-stop-congressional-baseball-game-48039772.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_cce25002f94743c5a73da83f68c7a297_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The game will go on.\nThe annual Congressional Baseball Game, which dates to 1909 and is a summertime tradition on Capitol Hill, will be played on Thursday despite Wednesday's shooting at the GOP squad's practice in Alexandria, Virginia.\nIt's an annual tradition in which aging former Little Leaguers don their spikes and dust off their gloves in a game played for bragging rights and to benefit several charities. It's also a somewhat rare example of bipartisanship in an increasingly polarized Washington.\nHouse Speaker Paul Ryan, R-Wis., assured lawmakers assembled at a members' briefing that the game will be played as scheduled, prompting a standing ovation.\nOnce a relatively cozy affair, played at a minor league ballpark in Maryland, the game has gone big time in recent years and has been played at Nationals Park, just a few blocks from the Capitol.\n\"We do it for really three reasons. We do it for fellowship amongst ourselves. We do it for charity,\" said Rep. Joe Barton, R-Texas, the longtime GOP manager. \"We raise a lot of money for three charities. And we do it because we like to play baseball and try to recapture a little bit of our youth. It's a positive thing. Of all the things Congress does, this is one of the most benign, positive activities.\"\nMembers of Congress practice for months for the event, and typically don the jerseys of a team from back home. The Capitol Hill newspaper Roll Call sponsors the game and awards a trophy once a side wins three of five games.\n\"It's a good way raise money for charity and for members to get to know each other,\" said Rep. Cedric Richmond, D-La., whose election in 2010 upended the competitive balance of the annual event. Richmond played baseball in college and kicked off his congressional career with a one-hitter in 2011 and has been the game's dominant player pretty much since then.\nLast year, however, Democrats lost the game 8-7, ending a seven-game winning streak that mostly coincided with Richmond joining the Democratic side.\n\"I was fresh off of surgery, but they made more plays than we made last year,\" Richmond told reporters. \"This was a year we wanted to get even.\"\nCongressional leaders typically attend the event and former President Barack Obama — famous for shunning opportunities to rub shoulders with lawmakers — even went two years ago, watching from the Democratic dugout. Obama's appearance came as he was struggling to win Democratic votes for an unpopular trade-related measure.\n———\nOnline: https://www.congressionalbaseball.org/",
    "source_domain": "abcnews.go.com",
    "title": "Game on: Tragedy won't stop annual baseball game",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/game-tragedy-stop-congressional-baseball-game-48039772"
}