{
    "authors": [
        "Abc News",
        "More Dr."
    ],
    "date_download": "2018-05-30 15:20:01+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The American Cancer Society released new guidelines for rectal cancer screening.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2Famerican-cancer-society-guidelines-colonoscopy-screenings%2Fstory%3Fid%3D55530367.json",
    "image_url": "https://s.abcnews.com/images/Health/colonoscopy-2-gty-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Colon and rectal (colorectal cancer) is the second-leading cause of cancer-related deaths in the United States.\nNow, the American Cancer Society (ACS) is advising Americans as young as 45 to undergo a colonoscopy screening, down from the previous recommended age of 50.\nAn estimated 140,000 Americans will be diagnosed with colorectal cancer and about 50,000 will die from it in 2018, according to ACS. The reason for the guideline age change: cases of colorectal cancer for people under age 55 increased 51 percent between the years of 1994 and 2014.\nColorectal cancer has been called a \"lifestyle\" cancer because smoking, drinking alcohol and eating processed foods increase the risk.\n“Earlier screening gives us an opportunity to detect cancer earlier when it is at more curable stage, and provides an opportunity for some degree of prevention,” Dr. George Chang, chief of colorectal surgery at the MD Anderson Cancer Center in Texas, told ABC News.\nColonoscopy screenings are still recommended once every 10 years up until the age of 75, however, “if one experiences changes in bowel habits or blood in the stool, don’t blow it off, seek medical care,” Chang said.\nRemember, diet and lifestyle changes can be made right away. Early screenings will also hopefully reduce colon and rectal cancer numbers in the years to come.\nChantel Strachan is a second-year internal medicine resident from the University of Connecticut who works in the ABC News Medical Unit.",
    "source_domain": "abcnews.go.com",
    "title": "American Cancer Society has new guidelines for colonoscopy screenings",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/american-cancer-society-guidelines-colonoscopy-screenings/story?id=55530367"
}