{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 07:22:50+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Japanese siblings accept WWII soldier's flag from US veteran",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-wwii-vet-japan-return-flag-fallen-soldier-49217859.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_eb0094d4a1bc40718ed65a31d4f457f5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The former U.S. Marine knew the calligraphy-covered flag he took from a fallen Japanese soldier 73 years ago was more than a keepsake of World War II. When Marvin Strombo finally handed the flag back to Sadao Yasue's younger brother and sisters Tuesday, he understood what it really meant to them.\nTatsuya Yasue buried his face into the flag and smelled it, then he held Strombo's hands and kissed them. His elder sister Sayoko Furuta, 93, sitting in her wheelchair, covered her face with both hands and wept silently as Tatsuya placed the flag on her lap.\nStrombo said their reaction struck him. He reached out to Yasue's elder sister and gently rubbed her shoulder.\n\"I was so happy that I returned the flag,\" Strombo said. \"I can see how much the flag meant to her. That almost made me cry ... It meant everything in the world to her.\"\nThe flag is a treasure that will fill a deep void for Yasue's family. It is the first trace of their brother. The Japanese authorities only gave them a wooden box containing a few rocks, a substitution for the remains that have never been found.\nThe flag's white background is filled with signatures of 180 friends and neighbors in this tea-growing mountain village of Higashishirakawa, wishing Yasue's safe return. \"Good luck forever at the battlefield,\" a message on it reads. Looking at the names and their handwriting, Tatsuya Yasue clearly recalls their faces and friendship with his brother.\nThe smell of the flag immediately brought back childhood memories to the soldier's younger brother.\n\"It smelled like my good old big brother, and it smelled like our mother's home cooking we ate together,\" Tatsuya Yasue said. \"The flag will be our treasure.\"\nThe return of the flag brings closure, the 89-year-old farmer and a younger brother of the fallen soldier, told The Associated Press at his 400-year-old house on Monday. \"It's like the war has finally ended and my brother can come out of the limbo.\"\nYasue last saw his older brother alive the day before he left for the South Pacific in 1943. Tatsuya and two siblings had a small send-off picnic for the oldest brother outside his military unit over sushi and Japanese sweet mochi, which became their last meal together. At the end of the meeting, his brother whispered to Tatsuya, asking him to take good care of their parents, as he would be sent to the Pacific islands, harsh battlegrounds where chances of survival were low.\nA year later, the wooden box containing the stones arrived. Months after the war ended, the authorities told Yasue that his brother died somewhere in the Marianas presumably on July 18, 1944, the day Saipan fell, at age 25.\n\"That's all we were told about my brother. We never knew exactly when, where or how he died,\" he said. Yasue and his relatives wondered Sadao might have died at sea off Saipan. About 20 years ago, Yasue visited Saipan with his younger brother, imagining what their older brother might have gone through.\nThe only person who can provide some of those answers, Strombo said he found Yasue's body on the outskirts of Garapan when he got lost and ended up near the Japanese frontline. He told Yasue's siblings their brother likely died of a concussion from a mortar round. He told them that Sadao was lying on the ground, his leftside down, looking peacefully as if he was sleeping and without severe wounds.\nAt least the flag and his story suggest Yasue died on the ground, which also raises hopes of retrieving his remains.\nThe remains of nearly half of 2.4 million Japanese war-dead overseas have yet to be found 72 years after the World War II ended. It's a pressing issue as the bereaved families reach old age and memories fade.\nAllied troops frequently took the flags from the bodies of their enemies as souvenirs, as Japanese flags were quite popular and fetched good price when auctioned, Strombo said. But to the Japanese bereaved families, they have a much deeper meaning, especially those, like Yasue, who never learned how their loved ones died and never received remains. Japanese government has requested auction sites to stop trading wartime signed flags.\nStrombo said Tuesday that he originally wanted the flag as a souvenir from the war, but felt guilty just taking it, and that's why he never sold it and committed himself to a lifelong journey to return the flag to its real home.\nHe had the flag hung in a glass-fronted gun cabinet in his home in Montana for years, a topic of conversation for visitors. He was in the battles of Saipan, Tarawa and Tinian, which chipped away at Japan's control of islands in the Pacific and paved the way for U.S. victory.\nIn 2012, he was connected to an Oregon-based nonprofit Obon Society that helps U.S. veterans and their descendants return Japanese flags to the families of fallen soldiers. The group's research traced it to the tea-growing village of 2,300 people in central Japan by analyzing family names.\n———\nFollow Mari Yamaguchi on Twitter at https://www.twitter.com/mariyamaguchi\nHer work can be found at APNews at https://www.apnews.com/search/mari%20yamaguchi",
    "source_domain": "abcnews.go.com",
    "title": "Japanese siblings accept WWII soldier's flag from US veteran",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/us-wwii-vet-japan-return-flag-fallen-soldier-49217859"
}