{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:09:49+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Anissa Weier, Morgan Geyser and Payton Leutner had a sleepover and asked to go to the park the morning after.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2F2020%2Fvideo%2Fslender-man-stabbing-parents-recall-happened-morning-part-52809801.json",
    "image_url": "http://a.abcnews.com/images/2020/180202_2020_act1a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Slender Man stabbing: Parents recall what happened that morning: Part 1\nBreaking news, a 12-year-old girl is stabbed. Is lured into the area by two of her classmates, who allegedly stabbed her 19 times the girls would hope the attack would earn them a home in slender man's mansion. Slender man is a fictional horror character. Reporter: We have been there for the journey. Two different mothers now visiting their daughters locked up since they were 12. We try to visit at least once a week. On a good week I can get out there two to three times. Aknee -- Anisa was actually sent to the Washington county juvenile detention facility. Reporter: Kristi Weier, her daughter is Anissa. Reporter: Most children are only up there for an average of 4 months, and she's been there almost 3 years. Reporter: Angie geyser's daughter, Morgan, who came up with the plan and who held the knife. The children have no access to the outdoors, or even windows to look out of. In the last 35 months, Anisa has maybe had 40 hours of fresh air. And there is no physical contact. I can't wipe away a tear, I can't give her a hug, I can't kiss her. Reporter: Their daughters are now teenagers Morgan is 15 and Anissa is 16. They have spent countless hours driving to visit their daughters locked up, trying to wrap their heads around how their two little girls, just 12 years old at the time, could have done something so unimaginable. And all of it began that Friday night. What was the plan for that night? On Friday nights, skateland had free pizza, so the girls went a little early and ate dinner and skated. Reporter: And the third girl who was with them, Payton leutner. Also just 12. Stacie and Joe leutner remember their daughter had been looking forward to it for weeks. Reporter: You remember how excited she was that Friday afternoon? Oh my gosh, she was so, so excited. Reporter: Do you think Payton had any idea? No. She had absolutely no idea. She was blindsided. Reporter: Blindsided by what those two friends had in store and they had been planning it for months. After that night of skating they would return to Morgan's house. Morgan's mother, Angie, downstairs. They played up in Morgan's bedroom with Morgan's dolls I mean, it was just a Normal night. Reporter: And no sign that two were plotting against Payton? No, no sign whatsoever. The next morning, Morgan asked if they could go to the park. Reporter: How often would they go to the park? Well, we were actually, believe it or not, pretty strict parents and didn't let Morgan go out on her own very often. Reporter: But you thought because she had her two friends it would be safe? Mm-hmm. Reporter: The first sign anything is wrong. A police officer showing up at Angie's door. My heart dropped down into my stomach. Not only were there police in my living room, but they were wearing riot gear. Reporter: Across town officers are also arriving at Payton's house. Around the side of the house, up over the deck came, a uniformed officer. The first thing that goes through my mind is, something has happened to somebody that I love. They asked me, \"Where's Morgan?\" I said, \"She's at the park with her friends.\" Reporter: Angie geyser says the police tell her Morgan is missing. They think she may be hiding her daughter. They searched the house, and I just kept asking what happened, what's going on. And they wouldn't tell me, other than to say there had been an incident in the park and one of the girls was hurt. Reporter: At first, police refusing to reveal which one of those girls was hurt. They quickly also track down the parents of the third friend Anissa Weier telling them their daughter is missing too. My thought was child abduction. Where is my daughter? That's the only thought I had in my head. Reporter: It would take hours to piece together exactly what happened at that birthday sleep over. The first moment anyone would begin to learn of the horror is this call to 911. 911. I'm transfer over a caller on big bend. Reporter: 12-year-old Payton leutner had just crawled out of the woods covered in blood stabbed 19 times. And you can hear it in their voices the operators can not believe what they are hearing. He came upon a 12-year-old female. She appears to have been stabbed. She appears to be what? Stabbed. Stabbed? Correct. Reporter: Greg Steinberg was riding his bike that morning. On a path that had actually been chained off. It was pure chance he came this way. Reporter: And you were biking by, and she says to you what? Could you help me please, I have been stabbed multiple times. I quick got out my cellphone I was shaking. Reporter: He watches as the ambulance rushes her away. And when you looked at her, it was immediately apparent she had been stabbed multiple times? Yeah. To her chest, abdomen, arm and leg. Reporter: Doctors fear she might not survive. And her mother Stacie has just been told that Payton has been rushed to the hospital. And she's also been told it was She was terrified. She was crying. He couldn't breathe. Reporter: But she saw you there. She saw me. And she put her hand out. And I rushed over to her. And I put my arms around her. And I laid next to her. And I hugged her. And I said, \"You're gonna be okay. It's gonna be fine.\" But I could see that she was covered. Her arms and her legs and her abdomen, they were covered in stab wounds. Reporter: There were so many stab wounds, it took two nurses to count them, 19 in all. And her little girl is now being raced down the hall. Did you say anything to Payton as they were Wheeling her away? That I loved her and that she would be okay. Reporter: Payton's mother could not believe that her daughter's friend could be capable of this. Morgan didn't do this, is what's going through my head. There's no way. There no way that's what's happened. Morgan is 12. And Morgan has never hurt a fly. It was just unthinkable that Morgan would do anything to hurt someone else. Reporter: But that's exactly what investigators were telling Morgan's mother that her daughter and Anissa Weier had stabbed their friend multiple times. And now both girls were nowhere to be found. They had run away. And the police hadn't found them yet. Reporter: They were going to find a mansion in the woods? Oh the mansion, yeah the mansion in the woods. They were into the Nicolet forest, because they believed that there was a mansion there that slenderman lived in.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Slender Man stabbing: Parents recall what happened that morning: Part 1",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/2020/video/slender-man-stabbing-parents-recall-happened-morning-part-52809801"
}