{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 07:08:06+00:00",
    "date_modify": null,
    "date_publish": "2018-02-04 00:00:00",
    "description": "Rockets easily defeat Cavaliers after leading by as many as 35 points",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Frockets-easily-defeat-cavaliers-leading-35-points%2Fstory%3Fid%3D52824625.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180203_NBA_One-Play_Nene_huge_dunk_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CLEVELAND -- It's dangerous in the NBA to overreact; it gets people fired and it costs people wins, respect and money. The season is long, and that makes it forgiving, which is why anyone who has much experience preaches patience.\nBut the Cleveland Cavaliers are out of time. It's preposterous to say that in February for a team with a history of turning things around and doing it when they have to. However, they are in a preposterous situation.\nThey aren't just looking at losing this season, but they are looking at losing LeBron James. If tomorrow were the beginning of free agency, there's a good chance that would be the case.\nThe Houston Rockets played beautiful basketball Saturday night, and they destroyed the Cavs 120-88. Chris Paul was a maestro from the opening moments; it was a display of the reason why the Rockets are brilliant when he and MVP candidate James Harden are so great together (now 23-3 when both guards start). Paul was a breathtaking plus-47 for the night. The score probably could've been anything Paul wanted it to be.\nBut it was almost as if the Rockets were unwitting participants, executioners just there to do a morbid job and get out of the way. Before the game, Rockets coach Mike D'Antoni fell all over himself trying not to talk about the Cavs. In the postgame interview, Paul kept repeating over and over, \"It's about us\" to Lisa Salters, wanting to get on the plane and get the heck out of the way. The drama was all with the Cavs, and it was hard to miss and hard to watch.\nThe Cavs players do not trust each other. It appears as if some of them don't like each other. Two of them have been told they'd probably get traded two weeks ago but then weren't. And their coach has been hesitant shake up the lineup, as he has failed to motivate his veteran team.\nKevin Love, his left hand in a brace, had a slip of the tongue before the game. He said that sometimes with hand surgery \"you can actually come back faster. With this, I think it's great to be able to avoid that.\" He didn't have surgery; he will be sidelined for eight weeks.\nThe Cavs have until next Thursday to make significant changes to the roster. It is unlikely they could make a move or two that would fix all the structural changes they need -- they are old and slow by league standards, they have mostly poor defensive players and a number of their players are having substandard seasons that have negatively affected their value. But they so badly need a chemistry change that they might have no other choice but to switch out faces to try to change the energy flow.\nJames (11 points, 3 of 10 field goals) is completely dispirited. Never before in his career has he played like this. Maybe on the occasional midseason evening he has been less than energetic -- in the past, he has called it \"chill mode\" -- but never like this.\nThis is why it's unfair.\nSince the end of the Finals last season, James has watched as Jimmy Butler, Paul, Paul George, Carmelo Anthony and Blake Griffin have been traded. None of them were sent to the Cavs. When the Cavs traded Kyrie Irving, the centerpiece of the deal was a draft pick.\nLooking through his eyes, you can understand why he's frustrated. You can understand why he sometimes feels like the organization hasn't kept the pedal down. When he sees Isaiah Thomas struggling, trying so hard to fight through a devastating injury but having to go so slow that he's hindering the Cavs instead of helping them, he wonders why they traded Kyrie Irving at all. And why they took the deal with the Boston Celtics, even though they had a chance to back out.\nJames must wonder: If the organization won't go all-in to try to keep the best team around him, would he want to be elsewhere? Would he want to waive his no-trade clause?\nInstead, he stews.\nMeanwhile, the Cavs point out that James will not commit to them past this season. That they tried to mold a future in attempting a trade last June with George, and he wouldn't go there. They point out that they have the highest payroll in the NBA and are paying a hideously painful repeater luxury tax. That the team lost $18 million last season because it spent $25 million on luxury taxes.\nCavs owner Dan Gilbert has been here before. He spent wildly, got an old team and traded away a bunch of future picks in 2010 only to see James walk. The result was a miserable rebuilding process that lasted four years and was failing until James stunned them by walking back through the door.\nThe Cavs must wonder if they should just publicly come out and say they will trade everything, they will trade the Brooklyn Nets pick, if James were only to commit past this season. But if he won't, they can't sentence themselves to a miserable rebuild again. That would put it on his plate and take it off theirs.\nInstead, they stew.\nAnd the adversarial situation grows. And the team plays worse. And the pressure tightens. And the clock runs.\nTo those who know him, it was concerning two weeks ago in San Antonio when James came into a close game in the fourth quarter and seemed to just let the game go. He has come into hundreds of games like that, and if he didn't lead his team to victory, he went to the finish line clawing.\nIn the games since, James' defensive effort has further wilted. His aggression has waned. His frustration has extended. And his leadership, which at times has been controversial in its style but never questioned in its intent, has faded.\nHe is absolutely culpable; his past month has been one of the worst of his NBA life. This comes after the first two months of the season in which he was a leading candidate for MVP. Which makes his erosion all the more clear.\nAnd the Cavs are culpable for allowing the trust and the relationship with management to crack. The Cavs know crisis better than anyone, they've been immersed in it on and off for four years. But this is a different situation. Everyone can feel it.\nThey're almost out of time.",
    "source_domain": "abcnews.go.com",
    "title": "Rockets easily defeat Cavaliers after leading by as many as 35 points",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/rockets-easily-defeat-cavaliers-leading-35-points/story?id=52824625"
}