{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 09:42:43+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "Israeli ultra-Orthodox Jewish leader Shteinman dies at 104",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fisraeli-ultra-orthodox-jewish-leader-shteinman-dies-104-51733073.json",
    "image_url": "http://abcnews.go.com/International/wireStory/israeli-ultra-orthodox-jewish-leader-shteinman-dies-104-51733073",
    "language": "en",
    "localpath": null,
    "maintext": "Rabbi Aharon Leib Shteinman, the spiritual leader of Israel's non-Hassidic ultra-Orthodox Jews of European descent and one of the country's most influential and powerful rabbis, died Tuesday. He was 104.\nShteinman was hospitalized several weeks ago with shortness of breath and passed away early on Tuesday. Hundreds of thousands were expected to attend his noontime funeral in the central Israeli ultra-Orthodox city of Bnei Brak and major roads were being shut down in advance of the procession.\nShteinman was a longtime political kingmaker whose orders were strictly followed by his representatives in parliament. His influence, however, far surpassed just that and he was seen as the leading voice of the entire community on many issues of religion and state. Following the 2012 death of his predecessor, Rabbi Yosef Shalom Elyashiv, he was widely regarded as \"Gadol Hador,\" or \"leader of the generation.\"\nThe ultra-Orthodox, known in Hebrew as \"Haredim,\" or \"those who fear God,\" are the fastest growing sector in Israel. Due to their high birth rate, they now number more than 1 million people, or about 12 percent of Israel's 8.7 million citizens, with the majority living beneath the poverty line.\nShteinman was known for his rabbinic scholarship, his relatively pragmatic rulings and extremely modest lifestyle. He was often called to judge on sensitive matters such as how much the traditionally insular community should integrate with the larger Israeli society, embrace technology, pursue higher education, work or agree to serve in the largely security military. In recent years, he had faced a challenge from a more extremist rabbi in Jerusalem who sent thousands into the street to protest the small numbers of ultra-Orthodox who have enlisted.\nRabbi Yehoshua Pfeffer, an expert on the ultra-Orthodox community, said that until just recently Shteinman was of clear mind and hosting followers who sought his advice.\n\"He was a person who knew very carefully how to balance the needs of the community with the needs of the individual,\" he said. \"His legacy is greatness of scholarship ... but at the same time a very nuanced leadership.\"\nIsraeli President Reuven Rivlin praised Shteinman as a leader who \"carried on his shoulders the existential weight of the Jewish people.\"",
    "source_domain": "abcnews.go.com",
    "title": "Israeli ultra-Orthodox Jewish leader Shteinman dies at 104",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/israeli-ultra-orthodox-jewish-leader-shteinman-dies-104-51733073"
}