{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 02:52:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The Latest: Moon says North Korea crisis must end peacefully",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-top-us-officer-warns-nkorea-military-ready-49203518.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_5b687012dcc44306a29d3d9c5ef292dc_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the North Korea crisis (all times local):\n11 a.m.\nSouth Korean President Moon Jae-in says North Korea could create conditions for dialogue by stopping additional nuclear and missile tests.\nMoon in a speech Tuesday also said resolving the North Korean threat could begin with freezing its nuclear weapons program.\nTensions have increased as North Korea advanced toward being able to hit the mainland United States with a nuclear-armed missile. Its state media described in detail Tuesday its plans to launch missiles into waters near Guam. But it also reported that leader Kim Jong Un would watch U.S. conduct before giving his orders for the test. That appeared to signal a path to defuse the crisis.\nMoon says that his government shares a view with Washington that the purpose of strong sanctions and pressure against North Korea is to draw Pyongyang to negotiations.\n———\n10:45 a.m.\nThe South Korean president says the North Korean nuclear crisis must \"absolutely be solved peacefully\" and there can be no U.S. military moves without South Korean consent.\nMoon Jae-in, a liberal who favors engagement with the North, delivered a nationally televised speech Tuesday on the anniversary of the end of World War II and the Korean Peninsula's liberation from Japanese colonial rule.\nNorth Korea has said its military presented leader Kim Jong Un with plans to launch missiles into waters near Guam. But its comments appeared to signal a path to defuse the crisis by saying Kim would watch U.S. conduct before giving his orders.\nMoon said his South Korean government \"will put everything on the line to prevent another war in the Korean Peninsula.\" He says the \"North Korean nuclear program should absolutely be solved peacefully, and the (South Korean) government and the U.S. government don't have a different position on this.\"\n———\n6:30 p.m.\nNorth Korea says leader Kim Jong Un was briefed on his military's plans to launch missiles in waters near Guam days after the Korean People's Army announced its preparing to create \"enveloping fire\" near the U.S. military hub in the Pacific.\nThe Korean Central News Agency said Tuesday that Kim during an inspection of the KPA's Strategic Forces praised the military for drawing up a \"close and careful\" plan. Kim said he will give order for the missile test if the United States continues its \"extremely dangerous actions\" on the Korean Peninsula.\nThe KPA's Strategic Forces said last week it would finalize by mid-August a plan to fire four intermediate ballistic missiles near Guam and send it to Kim for his approval\n———\n8:10 a.m.\nThe top U.S. military officer says the United States wants to peacefully resolve a deepening standoff with North Korea but is also ready to use the \"full range\" of its military capabilities in case of provocation.\nThe comments by Marine Corps Gen. Joseph Dunford in meetings Monday with senior South Korean military and political officials appeared to be an attempt to ease anxiety over tit-for-tat threats between President Donald Trump and North Korea while also showing a willingness to back up Trump's warnings if necessary.\nDunford, the chairman of the Joint Chiefs of Staff, said that the U.S. is \"seeking a peaceful resolution to the crisis.\"\nDunford is visiting South Korea, Japan and China after a week in which Trump said he was ready to unleash \"fire and fury\" if North Korea continued to threaten the United States.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Moon says North Korea crisis must end peacefully",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-top-us-officer-warns-nkorea-military-ready-49203518"
}