{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 05:05:44+00:00",
    "date_modify": null,
    "date_publish": "2017-01-01 00:00:00",
    "description": "Giants' D Preps for Playoffs With 19-10 Win at Redskins",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fgiants-preps-playoffs-19-10-win-redskins-44505784.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/giants-preps-playoffs-19-10-win-redskins-44505784",
    "language": "en",
    "localpath": null,
    "maintext": "So what if Eli Manning and the rest of the New York Giants' offense is not exactly lighting up the scoreboard as the team heads to the playoffs? The defense looked about as good as any in the NFL in its final postseason tuneup.\nDominique Rodgers-Cromartie picked off a pair of second-half passes, the defensive line — playing without the injured Jason Pierre-Paul — sacked Kirk Cousins four times, and the Giants beat the Washington Redskins 19-10 in a regular-season finale Sunday.\n\"A physical, hard-nosed football game,\" New York coach Ben McAdoo said, \"against a hungry team, on the road, where we ran the ball, we stopped the run, we took care of the ball, and we took the ball away.\"\nIt was the Redskins (8-7-1) who needed a victory to have a chance at making the playoffs. It was the Giants (11-5) who were locked into the No. 5 seed in the NFC so had nothing at stake; they will play at Green Bay next week.\nAnd yet, McAdoo's club looked a lot more intent and focused right from the start, particularly when its defense was on the field.\nThe Redskins' strength is supposed to be their offense, led by Cousins, but they never got going on Sunday.\nWashington's first five possessions ended with punts; the sixth ended with a missed field-goal attempt as the first half finished with New York ahead 10-0.\n\"It was just business as usual for us,\" said Giants linebacker Keenan Robinson, who used to play for the Redskins. \"It's a good preliminary matchup for us, getting ready for the playoffs, because we're going to see really good offenses.\"\nBy halftime, Washington had only four first downs and only 83 total net yards. By game's end, the Redskins had run for a paltry 38 yards.\n\"They put a lot in the box,\" Redskins left tackle Trent Williams said. \"They smothered it, and we couldn't sustain a drive.\"\nAs for New York's offense, Manning, Odell Beckham Jr. and Co. put up one TD and 13 points — the other six came on a last-play fumbled lateral after the game's outcome was already clear — and that continued a season-long pattern of struggles.\nThe Giants failed to score at least 20 points in any of their final five games, and they never reached 30 in any game all season.\nAsked whether that increases the tension for the defense, safety Landon Collins replied: \"We live for the pressure. We don't think of it as pressure — we think of it as an opportunity to make plays and be the best that we can be.\"\nSo do the Giants own the best defense in the league after loading up on free-agent acquisitions last offseason?\n\"I feel,\" Collins said, \"like we are in the running for it.\"\nThe next test for his unit will come next weekend in the wild-card round against the NFC North champion Packers. The Giants like their chances — thanks not to two-time Super Bowl MVP Manning, but to the defense.\n\"I feel like our defense is very capable of keeping teams under 14 points, 17 points,\" New York linebacker Jonathan Casillas said. \"We got a great defensive line. We've got some capable guys. We don't have JPP, but everybody is playing bigger because he's down.\"\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL\n———\nFollow Howard Fendrich on Twitter at http://twitter.com/HowardFendrich",
    "source_domain": "abcnews.go.com",
    "title": "Giants' D Preps for Playoffs With 19-10 Win at Redskins",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/giants-preps-playoffs-19-10-win-redskins-44505784"
}