{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 04:31:43+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fcanada-van-victims-include-grandmother-avid-volunteer-54710512.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_13933a31985c42bc9a1dc5419a1495e5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An 80-year-old grandmother who loved Toronto sports teams nearly as much as her own family and a \"brilliant\" young woman who volunteered to build houses in the Dominican Republic were among the 10 people killed when a van plowed down a Toronto sidewalk.\nOther victims in Monday's attack included people from Jordan and South Korea, as well as a local college student. Though the names of most of the victims weren't immediately released, details began emerging about several of them as their families began mourning and memorials in their honor grew larger.\nToronto City Councilor Cesar Palacio identified one of the victims as 30-year-old Anne Marie D'Amico, who worked at Invesco, an investment management firm near the attack.\nPalacio said D'Amico was a friend of his daughter, and he remembers her as \"a brilliant young girl\" who was interested in improving society.\nPalacio said he spoke with D'Amico's parents, who live in his ward.\n\"You can imagine the nightmare, the living nightmare they're going through at this moment,\" he said.\nD'Amico volunteered at a Canada-based international humanitarian charity called Live Different. She helped build houses in the Dominican Republic in 2015 and 2017, according to Dave Hamilton, the charity's manager of school partnerships.\nHe said she was \"always up for a challenge and really wanted to help people out.\"\nBrodie MacDonald, a friend of D'Amico's, posted a video on Facebook of her playing baseball in the Dominican Republic and wrote that her love of the game is what brought them close.\n\"I am so angry at the world today and I am so sorry that this happened to you and as tears roll down my face thinking about the incredible person that you were, please know that you made a difference in so many peoples' lives,\" he wrote.\nAlso killed in the attack was Dorothy Sewell, an 80-year-old grandmother who was an avid sports fan, said her grandson, Elwood Delaney.\nDelaney, of Kamloops in British Columbia, posted on Facebook that he had to tell his three children and his wife \"that they will no longer get to talk to Nan\" on birthdays or holidays.\nHe said his grandmother almost had as much love for the Blue Jays and the Maple Leafs \"as she did for her family.\"\n\"You will always be loved and your love for sports will always be with me while I cheer with you,\" he wrote on Facebook. \"Go Toronto Go. Love you Nan.\"\nTwo of Sewell's neighbors, Paul and Eweline Matusiewicz, choked back tears at a shrine of flowers on Yonge Street, where they were paying their respects.\nThey had found out Sewell was among the victims just a half-hour before arriving at the memorial.\n\"She was just the sweetest soul,\" Paul Matusiewicz said.\nOthers killed included Munair Najjar, a citizen of Jordan who was in Toronto visiting family, according to state-run news agency Petra. Jordan's embassy in Ottawa is in contact with Najjar's family, the agency said. No other information about Najjar was released.\nSeneca College said one of its female students was killed, but declined to identify her, citing privacy reasons. President David Agnew confirmed the death in an email to students and staff in which he said two other students suffered minor injuries that did not require hospitalization.\n\"Along with the rest of the city, and world, we were stunned by yesterday's news,\" Agnew said.\nTwo South Koreans were among the dead, Yonhap News Agency reported, citing government officials. A third South Korean national was injured. None of their names were released. The Korean consulate general office in Toronto declined to confirm the report.\nInvestigators had not yet officially identified any of those who died as of Tuesday afternoon, said Dirk Huyer, Ontario's chief coroner.\n\"We're always balancing the need to know and the desire to know quickly to ensure that we have 100 percent accuracy,\" he said. \"That takes time, and that time can be very frustrating.\"\nToronto resident Konstantin Goulich created an impromptu memorial to the victims by taping four large sheets of poster board to a wall near the scene of the crime so people could leave messages of condolences and hope. By Tuesday afternoon, dozens of sheets were filled with notes in various languages. Floral bouquets covered the wall's top ledge and had begun covering the ground below.\n\"People have been traumatized by this,\" said Goulich, a 37-year-old dental hygienist. \"This is a time when we need to come together and I think people sense it.\"\n———\nAssociated Press writers Charmaine Noronha and Tammy Webber in Toronto; Blake Nicholson in Bismarck, North Dakota; Amanda Lee Myers in Los Angeles; and Ivan Moreno in Milwaukee contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Canada van victims include grandmother, avid volunteer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/canada-van-victims-include-grandmother-avid-volunteer-54710512"
}