{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 23:45:03+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fmedicare-require-hospitals-post-prices-online-54704785.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/medicare-require-hospitals-post-prices-online-54704785",
    "language": "en",
    "localpath": null,
    "maintext": "Medicare will require hospitals to post their standard prices online and make electronic medical records more readily available to patients, officials said Tuesday.\nThe program is also starting a comprehensive review of how it will pay for costly new forms of immunotherapy to battle cancer.\nSeema Verma, head of the Centers for Medicare and Medicaid Services, said the new requirement for online prices reflects the Trump administration's ongoing efforts to encourage patients to become better-educated decision makers in their own care.\n\"We are just beginning on price transparency,\" said Verma. \"We know that hospitals have this information and we're asking them to post what they have online.\"\nHospitals are required to disclose prices publicly, but the latest change would put that information online in machine-readable format that can be easily processed by computers. It may still prove to be confusing to consumers, since standard rates are like list prices and don't reflect what insurers and government programs pay.\nPatients concerned about their potential out-of-pocket costs from a hospitalization would still be advised to consult with their insurer. Most insurance plans nowadays have an annual limit on how much patients must pay in copays and deductibles — although traditional Medicare does not.\nLikewise, many health care providers already make computerized records available to patients, but starting in 2021 Medicare would base part of a hospital's payments on how good a job they do.\nUsing electronic medical records remains a cumbersome task, and the Trump administration has invited technology companies to design secure apps that would let patients access their records from all their providers instead of having to go to different portals.\nVerma also announced Medicare is starting a comprehensive review of how it will pay for a costly new form of immunotherapy called CAR-T. It's gene therapy that turbocharges a patient's own immune system cells to attack cancer.\nImmune system T cells are filtered from the patient's own blood and reprogrammed to target and kill cancer cells that had managed to evade them. Hundreds of millions of copies of the revved-up cells are then returned to the patient's blood to take on the cancer.\nThough only a couple of such treatments have been approved for blood cancers, the cost can exceed $370,000 per patient.\n\"It's a new area for the agency,\" said Verma. \"We haven't seen drugs priced at this level and we're having to think about our strategy.\"",
    "source_domain": "abcnews.go.com",
    "title": "Medicare will require hospitals to post prices online",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/medicare-require-hospitals-post-prices-online-54704785"
}