{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 21:27:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "USGA pledges no repeat of rules gaffe from last US Open",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fusga-pledges-repeat-rules-gaffe-us-open-48042268.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_e9979e3981a247d5941e8ca391514078_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Determined to avoid the embarrassing rules mess from a year ago, the USGA is shaking up the way it officiates the U.S. Open at Erin Hills.\nIt pledged to respond quicker and not wait to make a ruling.\n\"I think last year there were two things we fell short on — it took too long to make the ruling and it left uncertainty with the competition,\" said John Bodenhamer, the USGA's managing director of rules and competition. \"I think should a similar circumstance happen, I think we are poised to move quickly.\"\nThe U.S. Open, as well as the USGA's other biggest events, will no longer have referees who walk with each group, a practice that dates to 1991. Instead, officials will be stationed at various spots on each hole around the course.\nThe biggest advancement is having four video monitor stations, along with the use of tablets, that will allow officials to review any rules discrepancies on the course to reach conclusions immediately.\nThat might have made it a lot easier on Dustin Johnson — and everyone else — last year at Oakmont.\nJohnson's golf ball moved slightly as he stepped in for a 3-foot par putt on the fifth hole. He didn't think he caused it to move, called in the walking referee and no penalty was assessed. But when the USGA saw video, officials thought there might be a penalty.\nThey told Johnson when he was on the 12th tee, saying he might be penalized and they could review it after the round. That would have been fine except that it was the final round. Johnson played the last seven holes not knowing if he would be penalized, and thus not knowing the score.\nIt was a major gaffe, saved only by Johnson playing so well that he had a four-shot lead when he birdied the final hole to win the U.S. Open. After meeting with officials, he was given a one-shot penalty that affected only the margin of victory, not the name on the trophy.\nThe USGA has a five-member rules committee led by Thomas Pagel, the senior director of rules. Pagel will be the chief referee for the U.S. Open, who can make immediate decisions that would stand.\nA repeat of the Johnson incident is unlikely this year, and not just because the greens at Erin Hills are nowhere near as fast as Oakmont's putting surfaces. The USGA introduced a local rule last year that if a golf ball or marker moves accidentally, the player puts it back without penalty.\nHaving video more readily available for review should help avoid uncertainty.\nBodenhamer said the rules committee — not always the player, in some cases — would be able to look at the video and quickly decide whether it's a penalty.\nIt was the most significant change for a U.S. Open that is desperate to have a smooth tournament. The previous year at Chambers Bay, the grass on the greens was starting to die before the U.S. Open began and at times on the weekend, players were putting through what amounted to matted dirt.\nJordan Spieth won when Johnson, needing a 12-foot eagle putt to win, three-putted for par to finish second. He missed a 4-foot birdie putt on the bumpy green.\nPart of that could be attributed to weather in the Pacific Northwest that week.\nAs for Oakmont a year ago, that was a breakdown in communication and delivering the ruling at the right time.\n\"We not only learned from it, but we made changes,\" USGA executive director Mike Davis said. \"And I think that's the way you have to approach anything that doesn't go right: 'How can we make it better? How can we make sure it doesn't happen in the future?'\"",
    "source_domain": "abcnews.go.com",
    "title": "USGA pledges no repeat of rules gaffe from last US Open",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/usga-pledges-repeat-rules-gaffe-us-open-48042268"
}