{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:33:35+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Sophia Suwiryo will be playing a Mozart concerto on Saturday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fyear-play-cincinnati-pops%2Fstory%3Fid%3D52794372.json",
    "image_url": "http://a.abcnews.com/images/US/piano-2-abc-er-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It’s the dream of any amateur musician to play on stage under the big lights and in front of a packed crowd, and now that dream has become a reality for one very special musical prodigy.\nTakako Frautschi teaches piano to many talented musicians at the College-Conservatory of Music at the University of Cincinnati, but it's not often one of her pupils is chosen to play a Mozart concerto on stage with the Cincinnati Pops.\nEspecially when that pupil is only 9 years old.\n\"She has such a gift,\" I know she is so young, [but she's] feeling the music in such a mature way. She closes her eyes and plays from her heart, Frautschi told local ABC affiliate WCPO.\nWhen young Sophia Suwiryo found out she would soon be playing with the Cincinnati Pops, she and Frautschi immediately got to work.\n\"She has only been given two months to learn it,\" Frautschi said. \"It requires a lot of practice just to be aware of every note.\"\nIt takes most of Frautschi’s college students about a year to perfect the piece, but not Sophia -- she mastered it within two weeks, Frautschi said.\nWCPO\nMichael Suwiryo and Cindy Tanudji said they try and keep their daughter stimulated with several activities. She also attends Chinese school, swimming lessons and chess lessons.\nSuwiryo said even before Sophia was born he would place headphones playing classical music on either side of his wife's pregnant belly.\n\"I heard about the Mozart effect,\" he said.\nTanudji was not as convinced, \"I was like, 'OK, whatever.' I just watched comedy-drama on TV” she said.\nFrautschi said Sophia's parents refer to her as \"the boss.\" She truly loves playing piano and doesn’t get tired.\n\"Anything I demand, she gets back to me with everything I assigned, and everything seems so easy for her,\" said Frautschi.\nTanudji said her daughter wants to learn to play other instruments as well.\n\"We're holding back right now,\" she said. \"She keeps surprising us all of the time. We know she loves piano, but never knew she was capable of playing this tough music. It's beyond her age ... every year, she surprises us.\"\nWCPO\nSophia, who has been playing piano since she was 4, said she was ecstatic to learn that she was invited to play with the Pops.\n\"I was screaming and very happy. I am blessed that I get to play there,\" she said. \"It feels like I'm a famous person, that I can be with them on stage.\"\nSophia said she gets inspiration from both her parents.\n\"That is one of the things I want to be, [a pianist],\" Sophia said. \"I might want to be a surgeon, too.\"\nHer parents said they're nervous but also incredibly proud of their daughter.\n\"It's a huge opportunity that I never dreamed for my daughter, that can go and perform at such an awesome place,\" Tanudji said. \"There will be 3,500 people -- that is like playing at the [Cincinnati] Bengals stadium.\"\n\"It makes me forget she is only 9,\" her father added.\nSophia will have her big day in the spotlight Saturday morning at Cincinnati Music Hall.",
    "source_domain": "abcnews.go.com",
    "title": "9-year-old to play with the Cincinnati Pops",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/year-play-cincinnati-pops/story?id=52794372"
}