{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2017-01-02 11:50:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "It all happened before the new season of the ABC series even began.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fbachelor-contestant-admits-night-stand-nick-viall-series%2Fstory%3Fid%3D44471812.json",
    "image_url": "http://a.abcnews.com/images/GMA/161229_vod_bachelor_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When newest \"Bachelor\" Nick Viall meets the 30 women competing for his heart on the 21st season premiere of the hit ABC series, he may recognize one contestant.\nIn an exclusive preview of the season's first episode, contestant Elizabeth \"Liz\" Sandoz admits, \"Before tonight I actually met Nick at Jade [Roper] and Tanner [Tolbert]'s wedding.\"\n\"Bachelor\" alum Roper, 28, and Tolbert, 28, met while filming the second season of \"Bachelor in Paradise\" and wed last September.\n\"And there definitely was a connection and chemistry there and we had sex,\" Sandoz recalls of her encounter with Viall. \"It was just a fun night.\"\n\"I'm definitely nervous and I'm curious to see if he kind of figures who I am and remembers what happened that night,\" Sandoz continues in the video preview.\nIn the preview, we see Viall, 36, the two-time \"Bachelorette\" runner-up from Milwaukee, Wisconsin, hug and embrace Sandoz, a doula from Las Vegas, after she steps out of the limo at the \"Bachelor\" mansion.\nThe two hold hands as they greet each other.\n\"You look fantastic. That dress is great,\" Viall says.\nThey hug one more time, but viewers aren't certain if Viall remembers their rendezvous. Even Sandoz says she is unsure.\n\"So that made me feel like he doesn't know who I am ... and I kind of like that,\" she says in the preview. \"I like a little mystery. I kind of want to see how the night plays out and I can't wait to refresh his memory a little bit.\"\nViewers will have to wait to find out if Viall remembers Sandoz tonight when \"The Bachelor\" premieres at 8 p.m. ET.",
    "source_domain": "abcnews.go.com",
    "title": "'Bachelor' Contestant Admits to Having One Night Stand With Nick Viall Before Series Begins",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/bachelor-contestant-admits-night-stand-nick-viall-series/story?id=44471812"
}