{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 15:22:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Sergeant: 3 killed at race track were known gang members",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fsheriff-shot-dead-wisconsin-auto-racing-event-49199927.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_938d330a95c14bc8acb180cc2c8da7f9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Three Illinois men who were shot to death at point-blank range during a drag racing event in southeastern Wisconsin may have been targeted by a rival gang member, a sheriff's official said Monday.\nThe three were fatally shot as they stood near a concession area in the parking lot of the Great Lakes Dragaway near Union Grove about 7 p.m. Sunday, according to Kenosha County sheriff's officials.\nThe shooter remains at large, sheriff's Sgt. Mark Malecki said Monday.\n\"The victims were known gang members,\" Malecki said, adding that they came from the Aurora area in Illinois. Deputies were investigating the possibility that the assailant was a rival gang member.\nTwo of the men died at the scene and the third died in an ambulance on the way to a hospital.\nSheriff David Beth urged any witnesses to the shooting to contact his department.\n\"A lot of people may not have wanted to come up and talk to the sheriff's department initially because maybe they were afraid someone was going to see them,\" Beth said. \"So what I'm hoping happens is someone who knows what's going on or saw what happened will call us, give us more information and help us catch the individual who did this.\"\nThe sheriff's office estimated that more than 5,000 people were at the raceway for an event known as \"Larry's Fun Fest.\" The track's website shows the event included drag racing, tailgating, live entertainment and a car show.\nUnion Grove is about 25 miles (40 kilometers) south of Milwaukee.",
    "source_domain": "abcnews.go.com",
    "title": "Sergeant: 3 killed at race track were known gang members",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/sheriff-shot-dead-wisconsin-auto-racing-event-49199927"
}