{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 05:45:42+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "Today in History",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-51731723.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-51731723",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Tuesday, Dec. 12, the 346th day of 2017. There are 19 days left in the year. Hanukkah, the Jewish Festival of Lights, begins at sunset.\nToday's Highlights in History:\nOn Dec. 12, 1917, during World War I, a train carrying some 1,000 French troops from the Italian front derailed while descending a steep hill in Modane (moh-DAN'); at least half of the soldiers were killed in France's greatest rail disaster. Father Edward Flanagan founded Boys Town outside Omaha, Nebraska.\nOn this date:\nIn 1787, Pennsylvania became the second state to ratify the U.S. Constitution.\nIn 1897, \"The Katzenjammer Kids,\" the pioneering comic strip created by Rudolph Dirks, made its debut in the New York Journal.\nIn 1906, President Theodore Roosevelt nominated Oscar Straus to be Secretary of Commerce and Labor; Straus became the first Jewish Cabinet member.\nIn 1925, the first motel — the Motel Inn — opened in San Luis Obispo, California.\nIn 1937, Japanese aircraft sank the U.S. gunboat Panay on China's Yangtze River. (Japan apologized, and paid $2.2 million in reparations.)\nIn 1946, a United Nations committee voted to accept a six-block tract of Manhattan real estate offered as a gift by John D. Rockefeller, Jr. to be the site of the U.N.'s headquarters.\nIn 1947, the United Mine Workers union disaffiliated from the American Federation of Labor.\nIn 1963, Kenya became independent of Britain.\nIn 1977, the dance movie \"Saturday Night Fever,\" a Paramount Pictures release starring John Travolta, premiered in New York.\nIn 1985, 248 American soldiers and eight crew members were killed when an Arrow Air charter crashed after takeoff from Gander, Newfoundland.\nIn 1997, Ilich Ramirez Sanchez, the international terrorist known as \"Carlos the Jackal,\" went on trial in Paris on charges of killing two French investigators and a Lebanese national. (Ramirez was convicted, and is serving a life prison sentence.)\nIn 2000, George W. Bush became president-elect as a divided U.S. Supreme Court reversed a state court decision for recounts in Florida's contested election.\nTen years ago: Republican presidential rivals gathered in Johnston, Iowa, called for deep cuts in federal spending in a debate remarkably free of acrimony. President George W. Bush vetoed a second bill that would have expanded government-provided health insurance for children. Ike Turner, the rock pioneer and ex-husband of Tina Turner, died in San Marcos, California, at age 76.\nFive years ago: North Koreans danced in the streets of their capital, Pyongyang, after the regime of Kim Jong Un succeeded in firing a long-range rocket in defiance of international warnings. Pope Benedict XVI sent his first tweet from his new account; it read, \"Dear friends, I am pleased to get in touch with you through Twitter. Thank you for your generous response. I bless all of you from my heart.\"\nOne year ago: Senate Majority Leader Mitch McConnell and House Speaker Paul Ryan endorsed investigations into the CIA's belief that Russia had meddled in the November election to help Donald Trump win, a claim the president-elect called \"ridiculous.\"\nToday's Birthdays: Former TV host Bob Barker is 94. Basketball Hall of Famer Bob Pettit is 85. Singer Connie Francis is 80. Singer Dionne Warwick is 77. Rock singer-musician Dickey Betts is 74. Hall of Fame race car driver Emerson Fittipaldi is 71. Actor Wings Hauser is 70. Actor Bill Nighy (ny) is 68. Actor Duane Chase (Film: \"The Sound of Music\") is 67. Country singer LaCosta is 67. Gymnast-turned-actress Cathy Rigby is 65. Author Lorna Landvik is 63. Singer-musician Sheila E. is 60. Actress Sheree J. Wilson is 59. Pop singer Daniel O'Donnell is 56. International Tennis Hall of Famer Tracy Austin is 55. Rock musician Eric Schenkman (Spin Doctors) is 54. Rock musician Nicholas Dimichino (Nine Days) is 50. Author Sophie Kinsella is 48. News anchor Maggie Rodriguez is 48. Actress Jennifer Connelly is 47. Actress Madchen Amick is 47. Actress Regina Hall is 47. Country singer Hank Williams III is 45. Actress Mayim Bialik is 42. Model Bridget Hall is 40. Actor Lucas Hedges (Film: \"Manchester by the Sea\") is 21. Actress Sky Katz (TV: \"Raven's Home\") is 13.\nThought for Today: \"Experience has taught me that the only cruelties people condemn are those with which they do not happen to be familiar.\" — Ellen Glasgow, American author (1874-1945).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-51731723"
}