{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 08:12:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "Freed prisoner witnessed radicalization in Egyptian jails",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ffreed-prisoner-witnessed-radicalization-egyptian-jails-51732845.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_d8ab64c5e08c4ac2828fd9a980993624_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An Irish citizen recently acquitted after four years of being imprisoned in Egypt says he saw dozens of cellmates become radicalized and adopt views of the Islamic State group during his brutal captivity in overcrowded jails.\nIbrahim Halawa, 21, was arrested after security forces broke up a 2013 sit-in protesting the army's overthrow of an elected Islamist president, and was released in October after being held in a half-dozen detention centers. His experience provides a unique perspective on how conditions inside Egypt's notorious prisons have degenerated during an unprecedented crackdown on dissent.\nBorn in the Dublin suburb of Crumlin to parents of Egyptian descent, Halawa had faced death by hanging on charges that ranged from inciting violence to murder, and says regular beatings with bars and metal chains during captivity led him and others to the brink of despair.\n\"In the beginning, no one had even heard of Daesh, but by the time I left, maybe 20 percent were openly supporting their ideas,\" he said, using the Arabic acronym for IS. \"It could have been just talk — many of them were engineers, students and doctors who just wanted to get home to their families — but after all those years of being in jail with no explanation, many wanted revenge.\"\nThe extremist group boasts a powerful affiliate in Egypt's northern Sinai that has stepped up attacks in recent years, killing hundreds of security forces and civilians and expanding its reach to the mainland. Last month gunmen waving the group's black flag killed 300 people at a Sinai mosque in the deadliest terror attack ever carried out in the country.\nAuthorities have meanwhile waged a sweeping crackdown on dissent. Human rights groups say as many as 60,000 political prisoners are being held in Egyptian jails, mainly Islamist supporters of ousted President Mohammed Morsi but also several prominent secular activists.\nHalawa said prison officials routinely described him and his cellmates as \"political prisoners,\" even writing it on cells that were built to hold 10 men but were packed with dozens. The Egyptian government, which has branded Morsi's Muslim Brotherhood group a terror organization, denies holding any political prisoners.\n\"The prisons were packed — originally there were many members of the Muslim Brotherhood and April 6 (secular youth movement) but new people were always coming in,\" he said. \"Toward the end, the guards became really rough with us because they saw people who left were returning still politicized, posting their views on Facebook.\"\nHalawa was detained in the summer of 2013, just a few days after the army cleared out mass protests against the overthrow of Morsi, whose awkward one-year rule divided the country. Hundreds of protesters were killed.\nHalawa and his sisters travelled regularly to Egypt for vacation, and had arrived that summer, just after he finished secondary school exams.\n\"I had no clue what was going on in Egypt at the time. I went to a few protests, including anti-Morsi ones, but everyone did back then, and I wanted to see all sides,\" he said. Only after friends were killed by the military did he accept an invitation to speak on stage at the main sit-in, where he said organizers were inviting anyone to address the crowd.\n\"The place was full of lots of simple people who were just against military rule, like farmers who earned ($50) a month. And at the stage, they were desperate for speakers, especially foreigners,\" he said.\nHalawa's Egyptian-born parents urged him and his sisters to avoid the demonstrations, but their curiosity got the better of them, he said. His father, Hussein, is the imam for Ireland's largest Muslim community, in Dublin, and both he and Ibrahim insist they have nothing to do with the Brotherhood.\n\"Our relatives in Egypt aren't political at all, and everyone knows this — even the prosecutors and police never accused us of being a pro-Brotherhood family. My sisters and I, by going to a simple protest, were the most politically involved in the family,\" he said. Authorities released his three sisters after three months' detention.\nHalawa says he had a typical Irish childhood, even playing Gaelic sports like hurling. But as a devout Muslim of Egyptian descent who looks older than his age, he was seen by authorities as a threat. When they found him sheltering in a mosque during street clashes, it confirmed their suspicions.\nDespite speaking only rudimentary Arabic at the start of his sentence, he was treated as an Egyptian in prison, beginning with the customary welcome beating guards referred to as \"the party.\"\n\"The food was often rotten, although I luckily got packages from the Irish Embassy,\" he said. \"It was pretty corrupt in there, the guards could accuse anyone of anything and the charges would stick.\" Prisoners were often punished when high-profile attacks were carried out against the state over the years, such as the assassination of the prosecutor-general in 2015.\n\"When that happened they gave us a thorough 'inspection,' dumping out all our things in the middle of the cell and throwing food and water on it,\" he said. \"They also made us stand under the sun all day sometimes, but other times when they tried to get information they'd offer me extra food.\"\nHuman rights groups say torture and other abuses are rampant in Egyptian prisons. Egyptian officials deny any systematic abuse and say individuals are held accountable for any violations.\nToward the end of Halawa's imprisonment, the Brotherhood — previously known for organizing inmates in detention — had lost much of its pull inside jail, he said, with only die-hards sticking with the group.\n\"Most people wanted nothing to do with them after four years, they just wanted to get out so they'd avoid associating with them,\" he said.\nHalawa's case — a collective trial with nearly 500 defendants — began to be resolved only in March of this year, the first time he was allowed to come before a judge to declare his innocence. While most of the accused received sentences of between five years and life imprisonment, Halawa and some 50 others were declared innocent. He was released on Oct. 18 and returned home.\nNow he hopes to finally begin his studies in computer science and business, and get on with his life. Grateful for the sustained support of human rights organizations and the Irish government, he also wants to campaign for the unjustly detained, especially his countrymen.\n\"There are plenty of people out there imprisoned like I was for no reason, so I'd like to help.\"\n———\nFollow Brian Rohan on Twitter at www.twitter.com/Brian—Rohan",
    "source_domain": "abcnews.go.com",
    "title": "Freed prisoner witnessed radicalization in Egyptian jails",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/freed-prisoner-witnessed-radicalization-egyptian-jails-51732845"
}