{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 00:43:16+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Robert Meachem jailed for owing $400K in alimony, child support",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Frobert-meachem-jailed-owing-400k-alimony-child-support%2Fstory%3Fid%3D45497680.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0214/dm_170214_mma_okamoto_mayweather_mcgregor/dm_170214_mma_okamoto_mayweather_mcgregor_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "METAIRIE, La. -- Former Saints and Chargers receiver Robert Meachem began serving a 30-day jail sentence Monday after failing to pay nearly $400,000 in alimony and child support, according to court records in Jefferson Parish, Louisiana.\nMeachem, 32, can be released once $100,000 has been paid to his ex-wife, Andrea Rhodes. The couple divorced in 2014 and agreed to split custody of their two children.\nThe New Orleans Advocate reported that a judge ruled Meachem owed $588,000 and had paid only about $200,000. Meachem made more than $20 million in his eight-year career.\nBut according to the Advocate and NOLA.com, Meachem testified that he believed much of his money had been taken by a former officer of one of his charitable foundations and another assistant, since he didn't pay enough attention to his bank balances.\nMeachem said he had to borrow money from former NFL associates to get by.\nAccording to NOLA.com, an attorney for Meachem's ex-wife claimed in a previous hearing that Meachem secretly took millions out of their joint accounts. Meachem was also fined $500 for failing to produce an assistant in court to testify about his finances. A judge also denied Meachem's request for a new trial.\nMeachem, a first-round draft choice out of Tennessee in 2007, played a key role as a deep threat on the Saints' 2009 Super Bowl championship team. He had 178 catches for 2,914 yards and 29 total touchdowns in his career -- plus one touchdown in the playoffs.\nMeachem signed a lucrative long-term deal with the Chargers in 2012 that included $14 million in guaranteed money, but was released after one disappointing season and returned to the Saints in 2013. Meachem last played in 2014.",
    "source_domain": "abcnews.go.com",
    "title": "Robert Meachem jailed for owing $400K in alimony, child support",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/robert-meachem-jailed-owing-400k-alimony-child-support/story?id=45497680"
}