{
    "authors": [
        "Abc News",
        "More David"
    ],
    "date_download": "2018-02-03 09:17:04+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Lady Gaga cancels remainder of world tour due to 'severe pain' from fibromyalgia",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Flady-gaga-cancels-remainder-world-tour-due-severe%2Fstory%3Fid%3D52813826.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/gy_gaga_dc_020318_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The show won't go on.\nThat's the message from Lady Gaga, who announced early Saturday morning the cancellation of the last 10 dates of the European leg of her \"Joanne World Tour\" due to \"severe pain\" from the chronic pain disorder fibromyalgia.\n\"I'm so devastated I don't know how to describe it,\" Lady Gaga, 31, said in a statement posted to her social media accounts. \"All I know is that if I don't do this, I am not standing by the words or meaning of my music. My medical team is supporting the decision for me to recover at home. We're cancelling the last 10 shows of my Joanne World Tour.\"\nANGELA WEISS/AFP/Getty Images\nLady Gaga, whose real name is Stefani Joanne Angelina Germanotta, added, \"I love the show more than anything and I love you but this is beyond my control. London, Manchester, Zurich, Kiln, Stockholm, Copenhagen, Paris, Berlin. And Rio. I promise I will be back in your city, but for now, I need to put myself and my well-being first. I love you, forever. XX Gaga.\"\nThe singer's tour, which kicked off in Vancouver last August, was slated to end on Feb. 23 in Berlin.\nMatt Sayles/Invision/AP\nLive Nation said in a statement, \"Unfortunately, Lady Gaga is suffering from severe pain that has materially impacted her ability to perform live. As a result, Live Nation and Lady Gaga are announcing the cancellation of the final 10 dates of the European leg of her Joanne World Tour.\"\nThe statement further explained, \"Last night, with strong support from her medical team, Lady Gaga made the tough decision to immediately come off the road. She is extremely sorry and deeply saddened that she cannot perform for her European fans, who have waited so patiently. ?She is in the care of expert medical professionals who are working closely with her so she can continue to perform for her fans for years to come.\"\nLady Gaga first revealed in 2016 that she was living with fibromyalgia.",
    "source_domain": "abcnews.go.com",
    "title": "Lady Gaga cancels remainder of world tour due to 'severe pain' from fibromyalgia",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/lady-gaga-cancels-remainder-world-tour-due-severe/story?id=52813826"
}