{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 20:57:17+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Forlando-scandrick-stays-nfc-east-joins-redskins-year%2Fstory%3Fid%3D53858620.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0319/dm_180319_NBA_CAVS_WOJ_ON_LUE/dm_180319_NBA_CAVS_WOJ_ON_LUE_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Washington Redskins signed cornerback Orlando Scandrick on Monday.\nTerms were not disclosed but it's two-year deal worth up to $10 million, a source said.\nScandrick, 31, was released by the Dallas Cowboys on Saturday, granting his request to become a free agent.\nWith Washington, Scandrick will compete to start outside opposite Josh Norman. The Redskins had been in talks with Dominique Rodgers-Cromartie, but his price tag was too high for them.\nThe Redskins wanted a veteran presence at the position while hoping last year's third-round pick, Fabian Moreau, develops; he played 58 snaps last season. The Redskins also have Quinton Dunbar, who will challenge outside as well. Scandrick also likely would play inside versus slot receivers when needed.\nInjuries took their toll on Scandrick in recent years, with the most severe a knee injury that cost him the 2015 season. He also dealt with a back injury last season, and the Cowboys filled his void with younger players such as rookies Chidobe Awuzie and Jourdan Lewis at outside cornerback, and safety Xavier Woods in the slot.\nScandrick joined the Cowboys as a fifth-round pick in 2008 and outperformed their first-round pick from that year, Mike Jenkins. He served as a slot corner his first five years, becoming one of the best interior defenders in the league. He moved into a full starting role in 2013.\nIn 125 games spanning nine seasons with Dallas, Scandrick had 406 tackles, 63 passes defensed, 8 forced fumbles, 8 interceptions and 1 touchdown.\nESPN's Todd Archer contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Orlando Scandrick stays in NFC East, joins Redskins on 2-year deal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/orlando-scandrick-stays-nfc-east-joins-redskins-year/story?id=53858620"
}