{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:11:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Canada glacier melt rerouted in rare case of 'river piracy'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fcanada-glacier-melt-rerouted-rare-case-river-piracy-46844951%3Fyptr%3Dyahoo.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_dbe08088c73c42bd9cc4a22c6b137ab0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Scientists have witnessed the first modern case of what they call \"river piracy\" and they blame global warming. Most of the water gushing from a large glacier in northwest Canada last year suddenly switched from one river to another.\nThat changed the Slims River from a 10-foot (3 meters) deep, raging river to something so shallow that it barely was above a scientist's high top sneakers at midstream. The melt from the Yukon's Kaskawulsh glacier now flows mostly into the Alsek River and ends up in the Pacific Ocean instead of the Arctic's Bering Sea.\nIt seemed to all happen in about one day — last May 26 — based on river gauge data, said Dan Shugar, a University of Washington Tacoma professor who studies how land changes. A 100-foot (30-meter) tall canyon formed at the end of the glacier, rerouting the melting water, Shugar and his colleagues wrote in a study published in Monday's journal Nature Geoscience .\nThe term \"river piracy\" is usually used to describe events that take a long time to occur, such as tens of thousands of years, and had not been seen in modern times, especially not this quickly, said study co-author Jim Best of the University of Illinois. It's different from something like the Mississippi River changing course at its delta and it involves more than one river and occurs at the beginning of a waterway, not the end.\nThe scientists had been to the edge of the Kaskawulsh glacier in 2013. Then the Slims River was \"swift, cold and deep\" and flowing fast enough that it could be dangerous to wade through, Shugar said. They returned last year to find the river shallow and as still as a lake, while the Alsek, was deeper and flowing faster.\n\"We were really surprised when we got there and there was basically no water in the river,\" Shugar said of the Slims. \"We could walk across it and we wouldn't get our shirts wet. It was like a snake-shaped lake rather than a river.\"\nWhat had been a river delta at the edge of the Slims River had changed into a place full of \"afternoon dust storms with this fine dust getting into your nose and your mouth,\" Best said.\nThe lack of water in the Slims wasn't because of changes in rainfall, Shugar said. They know that because it's a river fed mostly by glacial melt, not rain, and the Alsek increased in amounts similar to what disappeared from the Slims.\nThe Kaskawulsh glacier covers about 9,650 square miles (25,000 square kilometers), about the size of Vermont. The front of the glacier has retreated nearly 1.2 miles (1.9 kilometers) since 1899, Shugar said.\nThe scientists calculate that there is only a 1 in 200 chance that the retreating glacier and river piracy is completely natural without man-made global warming. They used weather and ice observations and a computer simulation that models how likely the glacier retreat would be with current conditions and without heat-trapping greenhouse gases.\nSeveral outside scientists praised the study as significant and sensible.\n\"This is an interesting study and reconfirms that climate change has large, widespread and sometimes surprising impacts,\" Pennsylvania State University glacier expert Richard Alley, who wasn't part of the study, said in an email.\n———\nFollow Seth Borenstein at http://twitter.com/borenbears and his work can be found at http://tinyurl.com/sethap",
    "source_domain": "abcnews.go.com",
    "title": "Canada glacier melt rerouted in rare case of 'river piracy'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/canada-glacier-melt-rerouted-rare-case-river-piracy-46844951?yptr=yahoo"
}