{
    "authors": [
        "Abc News",
        "More Adam"
    ],
    "date_download": "2017-08-14 21:17:47+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "After violence over the weekend in Charlottesville, Virginia, House Minority Leader Nancy Pelosi called on the president to fire his chief strategist, Steve Bannon.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fpelosi-calls-trump-fire-steve-bannon-charlottesville-violence%2Fstory%3Fid%3D49213179.json",
    "image_url": "http://a.abcnews.com/images/Politics/nacy-pelosi-gty-hb-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After President Donald Trump denounced \"white supremacists\" and \"hate groups\" Monday in remarks about the violence over the weekend in Charlottesville, Virginia, House Minority Leader Nancy Pelosi called on the president to fire his chief strategist, Steve Bannon.\nBannon has been singled out by critics of the administration who believe his viewpoints reflect that of the so-called \"alt-right,\" a right-wing group with ideologies often defined as promoting white nationalism. In Charlottesville, a white nationalist rally protesting the decision to remove a statue of Confederate Gen. Robert E. Lee erupted in violence Saturday, eventually leading to the death of a woman who was struck by a car driven by an alleged Nazi sympathizer into a group of counter-protesters.\n\"If the President is sincere about rejecting white supremacists, he should remove all doubt by firing Steve Bannon and the other alt-right white supremacist sympathizers in the White House,\" said Pelosi, D-Calif. in a statement Monday. The minority leader additionally described Bannon as \"shameless enforcer of those un-American beliefs.\"\nIn November, upon Bannon's appointment to the White House team, Pelosi released a statement in which she called the former executive chair of the conservative news outlet Breitbart a \"white nationalist\" and criticized his hiring.\n\"Bringing Steve Bannon into the White House is an alarming signal that President-elect Trump remains committed to the hateful and divisive vision that defined his campaign,\" said Pelosi at the time. \"There must be no sugarcoating the reality that a white nationalist has been named chief strategist for the Trump administration.\"\nOn Monday, the minority leader was one of many politicians who expressed their disappointment with Trump's delay in forcefully identifying and condemning the hate groups involved in the rally and subsequent clashes.\n\"It shouldn’t take the President of the United States two days to summon the basic decency to condemn murder and violence by Nazis and white supremacists,\" she said.\nPelosi's call for Bannon's dismissal came a day after the Anti-Defamation League, an advocacy group that combats anti-Semitism, made a similar call for the White House to \"terminate all staff with any ties to these extremists.\" Some of the white nationalists in Charlottesville were seen brandishing swastikas and making Nazi salutes.\n\"There is no rationale for employing people who excuse hateful rhetoric and ugly incitement,\" ADL CEO Jonathan A. Greenblatt said in a statement on Sunday. \"They do not serve the values embodied in our Constitution nor the interests of the American people.\"\nBannon has previously denied that his political beliefs are racist in interviews given shortly after Trump's election victory last year.\n\"I'm not a white nationalist, I'm a nationalist,\" Bannon told The Hollywood Reporter in November, explaining that his positions have been misinterpreted and are pegged to economic policies intended to assist the \"American working class.\"\nABC News' Benjamin Siegel contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Pelosi calls on Trump to fire Steve Bannon after Charlottesville violence",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/pelosi-calls-trump-fire-steve-bannon-charlottesville-violence/story?id=49213179"
}