{
    "authors": [
        "Abc News",
        "More Luchina"
    ],
    "date_download": "2018-03-19 20:57:14+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The women came forward at a press conference today in Los Angeles.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fsteven-seagal-accused-women-rape-sexual-assault%2Fstory%3Fid%3D53854333.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/steven-seagal-gty-mem-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two women have come forward to accuse action star Steven Seagal of sexual assault and rape.\nInterested in MeToo? Add MeToo as an interest to stay up to date on the latest MeToo news, video, and analysis from ABC News. Add Interest\nRegina Simons and Faviola Dadis made the allegations during a press conference alongside their attorney Lisa Bloom. The women have also filed a police report with the Los Angeles Police Department, according to Bloom.\nThe women first went public with their accusations in a story by The Wrap.\nResponding to the accusations from them and others, Seagal told \"InfoWars\" that women have \"lied and been paid to lie about me without any evidence, any proof, any witnesses.\"\n\"This is just a complete tragedy,\" he told host Alex Jones.\n\"This isn’t just me but hundreds of people around the world,\" he said, adding that \"many of those people are completely innocent.\"\nHe also said \"40 percent of these claims are false.\"\nReps for the actor did not respond immediately to ABC News' request for comment.\nIMDB\nAt the press conference earlier, Simons said she first met Seagal when she was in her late teens and cast in his 1994 film \"On Deadly Ground.\" She said he invited her to the wrap party at his home, but when she showed up, no one else was there.\nInstead, she said, he led her to an adjacent room, which appeared to be a bedroom, and closed the door behind him. She said he then came up behind her and began kissing her and taking off her clothes.\n\"I was in shock and I was completely caught off guard,\" she said. \"Seagal was more than twice my size and twice my age. I was not sexually active. I froze.\"\nShe said he proceeded to have intercourse with her. \"There was nothing consensual about this,\" she said. \"I couldn’t move. And I felt as if I was watching my body from above. I felt tears coming down my face.\"\nShe said she focused on a picture of a woman from across the room. It was Kelly LeBrock, Seagal's wife at the time.\nAfter the encounter, Simons said Seagal asked her if she needed any money. She said she replied no and ran out of the house, never speaking to the actor again.\n\"Although it has not been easy, I am healing,\" Simons said, crediting the #MeToo movement for helping her come forward. \"For the first time in 25 years, I’ve allowed myself to process what happened and work through the pain. I pray that my abuser can also heal. I want him to be aware. I want him to acknowledge what happened. And apologize.\"\nFrederick M. Brown/Getty Images\nDadis said she also wants Seagal held accountable after accusing him of sexual assault. The former model, who is originally from Amsterdam, said she met the actor in 2002 when he was casting for a film on Genghis Khan. She was only 17 at the time.\nAfter two other auditions, in which other people were around, Dadis said she was invited to a private audition at the W Hotel and asked to wear a bikini under her clothes so that Seagal could make sure she had the right look for the part.\nDadis said she was surprised to find that there were no other people in the hotel room beside Seagal and his bodyguard. When Seagal asked her to do a catwalk in her bikini, she said she told the actor that she was uncomfortable.\n\"However, instead of respecting my boundaries, Steven slipped his hand underneath my bikini top and began pinching my nipples,\" she recalled, \"and simultaneously slid his hand across my vaginal area.\"\nDadis said she quickly yelled that the audition was over and began gathering her things. \"Steven sat there calmly as if nothing had happened while I was noticeably upset and terrified by the experience,\" she said.\nShe added that his security guard stood blocking the door and only moved once Seagal motioned him to.\n\"I left feeling horrified and totally violated,\" she said.\nAfter years of therapy and suffering from \"depression, anxiety, post-traumatic stress,\" Dadis said she broke her silence after Portia de Rossi came forward with an allegation of sexual harassment against Seagal in November.\nThe actress who is married to Ellen DeGeneres tweeted that Seagal unzipped his pants during an audition with her.\nMy final audition for a Steven Segal movie took place in his office. He told me how important it was to have chemistry off-screen as he sat me down and unzipped his leather pants. I? ran out and called my agent. Unfazed, she replied, “well, I didn’t know if he was your type.” — Portia de Rossi (@portiaderossi) November 8, 2017\nFollowing de Rossi's tweet, Dadis, who is finishing up her Ph.D. in clinical neuroscience, posted about her alleged incident on Instagram.\nBoth Dadis and Simons said they came forward on their own and are not seeking fame or money. Bloom also called Seagal's claim that women have been paid to lie \"ridiculous.\"\n\"I am representing them pro bono because I believe in them. And neither of them has asked him for a dime,\" Bloom said of Dadis and Simons. \"Listen carefully Mr. Seagal, some things are more important than money.\"\nBloom said the two women have not filed a lawsuit, although all legal options remain open. She said in Dadis' case the statute of limitations is extended for a minor. Prosecutors can also decide to file criminal charges within a year after a police report has been filed. Both women filed police reports within the last two months.\n\"We will see this through to the end,\" Bloom said. \"Steven Seagal may be a big action star, but it is Faviola and Regina who are taking action now.\"",
    "source_domain": "abcnews.go.com",
    "title": "Steven Seagal accused by 2 women of rape and sexual assault",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/steven-seagal-accused-women-rape-sexual-assault/story?id=53854333"
}