{
    "authors": [
        "Abc News",
        "Benjamin Stein",
        "More Tara",
        "More Benjamin"
    ],
    "date_download": "2018-03-20 00:01:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Zachary Cruz, 18, was arrested Monday afternoon.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fparkland-school-shooting-suspects-brother-arrested-allegedly-trespassing%2Fstory%3Fid%3D53861317.json",
    "image_url": "https://s.abcnews.com/images/US/parkland3-ap-ml-180228_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The brother of Parkland school shooting suspect Nikolas Cruz has been arrested for allegedly trespassing on the school grounds of Marjory Stoneman Douglas High School.\nInterested in Parkland school shooting? Add Parkland school shooting as an interest to stay up to date on the latest Parkland school shooting news, video, and analysis from ABC News. Add Interest\nZachary Cruz, 18, who was arrested at 4:30 p.m. Monday afternoon, allegedly rode his skateboard through school grounds, according to the Broward Sheriff's Office. According to the arrest report, he told deputies he wanted to “reflect on the school shooting and soak it in.”\nHis brother, Nikolas Cruz, 19, is accused of killing 17 people in the Valentine's Day massacre at the high school.\nPool via AP\nNikolas Cruz was formally arraigned last Wednesday on a 34-count indictment related to last month's mass shooting at a South Florida high school, for which the 19-year-old is now facing the death penalty. A plea of not guilty was entered on his behalf, though defense attorney Melisa McNeill emphasized that Nikolas Cruz is willing \"at any time\" to plead guilty \"in exchange for a waiver of the death sentence\" and instead spend the rest of his life behind bars.\nAmy Beth Bennett/South Florida Sun-Sentinel via AP\nDeputies said Zachary Cruz had been warned to stay away from the school campus previously, according to the arrest report. The alleged trespassing was captured on CCTV, the report states.",
    "source_domain": "abcnews.go.com",
    "title": "Parkland school shooting suspect's brother arrested for allegedly trespassing at Stoneman Douglas",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/parkland-school-shooting-suspects-brother-arrested-allegedly-trespassing/story?id=53861317"
}