{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:03:46+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Flatest-cuomo-touts-wins-cynthia-nixon-enters-race-53860273.json",
    "image_url": "http://abcnews.go.com/Entertainment/wireStory/latest-cuomo-touts-wins-cynthia-nixon-enters-race-53860273",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on Cynthia Nixon running for New York governor (all times local):\n5:55 p.m.\nA spokesman for Gov. Andrew Cuomo is responding to the gubernatorial candidacy of liberal activist Cynthia Nixon by saying Cuomo has delivered more progressive wins than any other Democrat in the country.\nFormer \"Sex and the City\" star Nixon tweeted Monday that she'll challenge Cuomo in New York's Democratic primary in September. In a campaign video, the public education advocate said, \"We want our government to work again.\"\nNixon in recent speeches has called on Democrats nationally to carve out a strong liberal identity instead of being merely the \"anti-Trump party.\"\nCuomo's campaign said the two-term governor's progressive wins include legalized gay marriage, tough gun laws, a $15 minimum wage, expanded school funding and a ban on a drilling technique known as fracking.\n———\n2:22 p.m.\nFormer \"Sex and the City\" star Cynthia Nixon said on Twitter Monday that she'll challenge Gov. Andrew Cuomo in New York's Democratic primary in September.\nHer announcement sets up a race pitting an openly gay liberal activist against a two-term incumbent with a $30 million war chest and possible presidential ambitions.\nIn a video on Twitter, the public education advocate said, \"We want our government to work again.\"\nNixon in recent speeches has called on Democrats nationally to carve out a strong liberal identity instead of being merely the \"anti-Trump party.\"\nThe 51-year-old Manhattan mother of three is an ally of Democratic New York City Mayor Bill de Blasio, who frequently clashes with Cuomo on various issues.\nThe 60-year-old Cuomo was favored 66 percent to 19 percent over Nixon in a recent Siena College poll.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Cuomo touts 'wins' as Cynthia Nixon enters race",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/latest-cuomo-touts-wins-cynthia-nixon-enters-race-53860273"
}