{
    "authors": [
        "Abc News",
        "Pierre Thomas",
        "More Luke",
        "More Pierre"
    ],
    "date_download": "2018-04-24 19:32:29+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "From France to London and New York to Ohio, vehicle attacks are increasingly a popular method used to carry out attacks by mass killers and terrorists.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvehicle-attacks-latest-threat-worrying-authorities%2Fstory%3Fid%3D54691016.json",
    "image_url": "https://s.abcnews.com/images/US/toronto-sh-er-180423_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "From France to London and New York to Ohio, vehicle attacks are increasingly a popular method used to carry out attacks by mass killers and terrorists.\nThe most recent attack occurred in Toronto on Tuesday afternoon. The suspect: 25-year-old Alek Minassian from the Toronto area. He appeared to be suicidal and neighbors described him as a loner and not social at all, sources told ABC News.\nCanadian authorities are not only searching Minassian's home, they are also looking at his social media footprint. U.S. Intelligence officials are also checking to see if there were any red flags.\nLaw enforcement sources say that vehicle attacks are becoming a preferred method of assault.\n\"Get a weapon that's easy to acquire and go to a place where a lot of people are congregating and that is the recipe,\" John Cohen, ABC News Contributor, and former counter-terrorism coordinator at the Department of Homeland Security said. \"That's the recipe that's being used by people who are conducting attacks on behalf of a terrorist cause, but that's the same recipe that's being used by individuals because of some perceived grievance [they] decide they want to go commit mass murder and that's the challenge facing law enforcement. It's not just a terrorism issue, it's a broader issue of mass casualty attacks.\"\nSince 2016, more than 14 such incidents have killed more than 100 people and injured more than 500 around the world, according to an ABC News review of the incidents.\nMohammed Taheri-Azar drove a car into an area of students in 2006 at the University of North Carolina at Chapel Hill (UNC-Chapel Hill), injuring nine. The suspect was sentenced to 33 years in prison.\nISIS and other terrorist groups have repeatedly called for these types of attacks. In 2010, an ISIS propaganda magazine touted trucks as a \"mowing machine\" to attack Westerners, and four years later an ISIS spokesperson suggested that followers could “run him over with your car.”\nSince the UNC-Chapel Hill incident, there has been a sharp uptick in the attacks.\nJust two years ago in Nice, France, 84 people, including numerous children, died after a terrorist plowed a truck loaded with explosives into a large crowd during Bastille Day celebrations. The assault left an \"apocalyptic\" scene, according to eyewitnesses of the attack.\nThat same year at Ohio State University, one person died and 13 were injured after a man rammed his car into a university courtyard, striking pedestrians. He then got out of the car with a butcher knife and started attacking bystanders.\nIn 2017, a 27-year-old Ohio man, James Fields Jr., drove his car into a crowd of people protesting the Unite the Right rally in Charlottesville, Virginia, killing one woman and injuring more than 35 others.\nMonths later, in New York City, the FBI charged a 29-year-old old man from Uzbekistan with providing material support for a terrorist organization after he allegedly killed eight people by ramming a rented truck into a city bike path.\nFederal, state and local Homeland Security officials have been warning of vehicle attacks for many years. Earlier this year, the New York Police Department installed barriers in certain parts of the city after the deadly attack last year.\n\"It's nearly impossible to protect every soft target,\" Cohen said. \"Groups like ISIS and al-Qaeda have changed the way they've inspired people to commit attacks.\"\nPlaces like concerts, sporting events, and public spaces have a lot of people in them, so by over securing them, they don't serve their intended purpose, thus making public spaces difficult to secure.\nEven the Transportation Security Administration (TSA) warned trucking agencies last year about the threat of a vehicle attack. The report called for drivers to be aware of suspicious activities and having cities install vehicle barriers around large gatherings.\n\"They are urging the followers to go to soft targets, places that are open to the public,\" Cohen continued, \"typically crowded and because of what they are -- they are very difficult to secure.\"",
    "source_domain": "abcnews.go.com",
    "title": "Vehicle attacks are the latest threat worrying authorities",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/vehicle-attacks-latest-threat-worrying-authorities/story?id=54691016"
}