{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:59:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "\"Nightline\" goes inside a top secret facility in South Korea, where soldiers are on high alert for North Korean missile launches.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fnorth-korea-test-missiles-challenges-us-nuclear-war-46855532.json",
    "image_url": "http://a.abcnews.com/images/Nightline/170418_ntl_north_korea_1239_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for North Korea test missiles, challenges US with nuclear war threats\nTonight, as the saber rattling intensifies on both sides of the Korean peninsula, ABC's Martha Raddatz takes us where cameras have never ventured. A top secret section of a military base near one of the most heavily fortified borders in the world. As north Korean dictator Kim jung-unthreatens the united States with nuclear weapons, some fear tough talk could provoke a tough talking president trump. ??? Reporter: Not 4 hours after a show of pageantry and force, and a provocative but failed missile test. ??? escalating tough talk from north Korea with no sign of backing down. A nuclear war may breakout at any moment. Foreign vice minister telling the bbc we will be conducting more missile tests on a weekly, monthly and yearly basis. With tensions on the rise, ABC news was granted rare access to the men and women on the front lines. Everything that is flying right now, these guys are managing? Yes, ma'am. Reporter: Even as vice president Mike pence arrived, visiting the border separating the two Koreas, sending a message north across the demilitarized zone. The world witnessed the strength and resolve of our new president. North Korea would do well not to test his resolve. Reporter: Back in Washington Donald Trump sending a similar message. Any message for North Korea? Got to behave. Reporter: In a less militaryistic venue. All eyes now on the peninsula. And this latest and perhaps biggest foreign policy test for the new American president. This is really the first time since 1953 that any U.S. President has, has escalated the relationship and the tension with North Korea to a degree that something has to be resolved. And if North Korea pulls the trigger, this is likely target number one. Osan air base, just 48 miles from North Korea, well within range of Kim jung-un's, arsenal of missiles carrying god knows what. A hardened bunker this is serious stuff. Yes, ma'am, your third set of blast doors here. Reporter: The first line of defense is always on guard. 24/7. F-16s on constant patrol. Anti-missile batteries primed, ready. Behind the concrete walls and steel doors, the top secret and rarely seen operations center. On high alert, watching for any north Korean missile activity. We live with it every day. The nice thing is for my folks, the mission is staring them in the face. Reporter: They're monitoring the possibility that one day, one of those missiles could reach as far away as the west coast of the United States. Once they're able to range and to hit targets within the continental 48, it now becomes an American problem. What used to be a regional or Korean problem has now marched across the pacific and become an American problem. Reporter: There is no doubt san is within range, the threat is up close, dangerous and continuous. One of the things you sort of sense as soon as you come on base, is how real the threat is. Absolutely. And what we do here, specifically is we are trained, day in, day out, to be fight tonight ready as we say it. Reporter: The clowe gain here \"Fight tonight\" you hear it often and always with a since of pride. There aren't many places where I go into, where it says fight tonight in giant letters. That is a little frightening. For us, our daily training. We are training at that level to be able to fight tonight. We don't know when the call is going to come. About four stories underground. The operation center is survivable against some high explosive blasts. That's why we are so deep. Reporter: We visited another top secret facility, the first time ever for a camera crew. If a missile is aimed at south Korea, the job here, blow it out of the sky. North Korea has conducted five underground nuclear tests in the last ten years. But missile launches are far more common. Several this year alone. Every one closely mitored on these screens including failed launches. What's it like in here when the ballistic missile is launched? Well you would thing it would be hectic. But due to the level of training of the soldiers here, actually a pretty, calm exercise. I would compare it to -- to maybe an air traffic controller tower. Reporter: Right next door, rows and rows of bunkbed. If war comes to South Korea, the staff will sleep right here. Reporter: You have food, you have everything you need? The we have food, showers, latrines. Reporter: Lieutenant general Thomas burgeonson is deputy commanderen South Korea. What concerns you most? Our biggest concern is he is going to miscalculate. Our conumber one concern. We want to make it crystal clear to the North Korea leadership this would be a few till endeavor were he to challenge this strong, ironclad, bilateral alliance. Reporter: Because we have a new president, and he no doubt, Kim jung-un, wants to test him in the same way that dynamic works. Is this from your time here from watching here, one of the more dangerous times? I would say that there is certainly you can feel the tensions. Clearly this is serious. And they need to know that we are prepared and that this, this defensive alliance is strong, and ready to fight tonight. Part of that defense, patriot missile batteries. Notice here in Korea we, we keep our launches loaded with live interceptors at all times. So that we are ready to fight tonight. Reporter: Tell me a little bit about the batteries in terms of of what nay can stop, how they stop them, how that works. Yes, ma'am. Well, this weapon system is capable of defeating a wide range of enemy capabilities from unmanned aerial systems to short-range and even long-range ballistic missiles. This battery is, designed to search for detect and engage those inbound ballistic missiles. At san they're confident in the system claiming the success rate of the patriot is nearly 100%. It is a bullet on bullet scenario where the patriot missile hits the threat missile and destroys it. Reporter: Far less successful, the recent north Korean missile tests. Causing some to speculate the U.S. Might be responsible for the rash of missile launch failures bedevilling the north Koreans perhaps using cyberwarfare, no proof of that, and no comment from the white house. These are delaying tactics. These are not going to stop the north Korean missile program, they're not going to stop the nuclear program. Reporter: A few miles from the patriots on the flight line are the growlers. So they have jamming capability, electronic jamming capability. They can deny the enemy ability to launch surface-to-air missiles at our aircraft. Facing the ever-present threat from North Korea, major Sean Walsh, up in the skies training at least three times a week. Often near that prohibited area close to North Korea. The other night I was up there on Monday night, just around sunset. And it's, you get to see the stark contrast. As the lights start to come on, you fly along the dmz, you can look out one window, bright as day, with the city of Seoul and then all of South Korea. And then you look out the other side of your cockpit. It is just darkness. Reporter: Make no mistake, it is that darkness which causes concern. The lack of hard intelligence. The unpredictability have created a region on edge. Kim jung-un, basically saying he could strike and take out an of the American military bases. Could that happen? No. No, they could try. But as you saw today, out here, you have air defense artillery brigade, and they have the technology, the capability and they're ready to intercept those kinds of missiles. So they could try. It would be to till. Reporter: As the the war of words escalates, it's helpful to remember that we have been here before. But as some Asia watchers point out, the difference this time, a new and yet to be tested president. The south Koreans are used to this they have lived in the shat shadow of the north Korean threat for 50, 60, 70ers, not unusual to hear the bellicose remarks. What they're not used to hearing it from the white house. Reporter: How president trump navigates this latest crisis will be watched and scrutinized closely just as the American forces in san are watching, waiting, and ready to fight tonight. Martha Raddatz, for \"Nightline,\" in Seoul, South Korea. ???\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "North Korea test missiles, challenges US with nuclear war threats",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/north-korea-test-missiles-challenges-us-nuclear-war-46855532"
}