{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 16:01:49+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-russia-iran-pullout-syria-unrealistic-56360338.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_22cce73c4fc84a93805ad25e93546ffb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the war in Syria (all times local):\n6:45 p.m.\nSyrian activists say the last round of talks with Russian mediators to reach a truce in southwestern Syria have faltered, threatening a relative calm that prevailed for days.\nThe Syrian Observatory for Human Rights, a war monitoring group, said the talks collapsed Wednesday because Russia wanted the rebels to hand in their heavy weapons in a surrender deal that would restore government control over Daraa province.\nThe opposition had also demanded safe passage to opposition-held northern Syria, a request denied by Russia, according to other activists.\nThe talks' failure comes after a relative lull in the fighting that has raged for two weeks in the south, displacing up to 300,000 people, many of them moved toward the Jordanian border. The government is already in control of most of Daraa province.\n———\n5:25 p.m.\nAnother six Russian combat jets have flown back home after a stint in Syria.\nRussian TV stations showed the Su-25 ground attack jets landing Wednesday at their home base in the Krasnodar region in southern Russia. The Russian Defense Ministry said that a total of 27 warplanes and helicopters have returned home in recent days.\nIt wasn't immediately clear if the redeployment represented Moscow's attempt to scale down its military presence in Syria or was part of a regular rotation. In the past, the military has rotated its aircraft in Syria, keeping their number at a few dozen.\nRussia has waged an air campaign in Syria since September 2015, helping turn the tide of war in President Bashar Assad's favor\n———\n4:30 p.m.\nIranian President Hassan Rouhani has reaffirmed his government's determination to stand by Syrian President Bashar Assad in the Arab nation's yearslong civil war.\nRouhani spoke to reporters in Vienna, where his country's nuclear agreement with world powers was drawn up three years ago and where the Iranian president held talks with Chancellor Sebastian Kurz on Wednesday.\nRouhani said the people of Iran \"will continue our path alongside the nation and government of Syria, until all terrorists are annihilated.\"\nShiite Iran — along with Russia and the Lebanese Shiite militant Hezbollah group — has been a staunch ally of Assad's government and advisers from Iran's elite Revolutionary Guard, as well as trainers, commanders and experts are stationed in military bases across Syria.\n———\n2:15 p.m.\nRussia says demands for Iran's complete withdrawal from Syria are \"unrealistic.\"\nForeign Minister Sergey Lavrov said Wednesday after meeting with his Jordanian counterpart that Iran is one of the key powers in the region, and that it would be \"absolutely unrealistic\" to expect it to abandon its interests. He said regional powers should discuss mutual complaints and negotiate a compromise.\nRussia and Iran have provided crucial military support to Syrian President Bashar Assad's forces, helping them turn the tide in the civil war.\nIsrael has said it will not tolerate an Iranian military presence in Syria and has launched military strikes against Iranian targets there in recent months.\nLavrov said Russian President Vladimir Putin and U.S. President Donald Trump would discuss the situation in southern Syria, where government forces are waging a new offensive, at their July 16 summit. He said a cease-fire in the region brokered by Russia, Jordan and the U.S. had envisioned the withdrawal of non-Syrian forces and the deployment of Syrian troops along the frontier with Israel.\n———\n10:45 a.m.\nIslamic State media outlets are reporting that the son of the group's leader has been killed fighting Syrian government forces.\nThe announcement of the death of the young son of Abu Bakr al-Baghdadi appeared on the group's social media accounts late Tuesday. It included a picture of a young boy carrying a rifle and identified him as Huthaifa al-Badri.\nThe statement did not specify when he was killed. It said he was an elite fighter who was killed while fighting Syrian and Russia troops at a power station in the central Homs province.\nAl-Baghdadi has been reported killed or wounded on a number of occasions but is widely believed to still be alive. IS has been driven from nearly all the territory it once controlled in Syria and Iraq.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Activists say truce talks on south Syria fail",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/latest-russia-iran-pullout-syria-unrealistic-56360338"
}