{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:24:23+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "7 Kenya medics union officials freed; strike continues",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fkenya-medics-union-officials-freed-strike-continues-45504275.json",
    "image_url": "http://abcnews.go.com/International/wireStory/kenya-medics-union-officials-freed-strike-continues-45504275",
    "language": "en",
    "localpath": null,
    "maintext": "A Kenyan court on Wednesday released seven doctors who are officials in the medics' union and who were jailed earlier this week for not calling off a strike by doctors working in public hospitals and other institutions.\nAbout 1,000 doctors outside the court celebrated the officials' release and held a peaceful march to Parliament and Nairobi's Freedom Park. More than 5,000 doctors from public hospitals are on strike for a 180 percent pay raise and to protest Kenya's dilapidated health care system.\nAt least a dozen people have died due to lack of medical care since the strike started early December over the government's fail to implement a collective bargaining agreement it agreed upon in 2013.\nThe decision to free the seven was made by three judges of the appellate court. Health minister Dr. Cleopa Mailu told the Senate committee for health that he supported their release to encourage negotiations to end the strike.\nPressure had been mounting on government after the seven doctors were jailed Monday. A peaceful vigil by their colleagues was dispersed by paramilitary police. Doctors from private hospitals protested the imprisonment of the seven by calling a 48-hour strike that started Wednesday and has paralyzed Kenya's health care. The Kenya Medical Association de-registered the health minister and the principal secretary in the health ministry for a year for \"disgracing the organization.\"\nIn addition to the pay increase, doctors say they want government to restore the dilapidated public health facilities, ensure continuous training of and hiring of doctors to address a huge shortage of doctors. Currently doctors, who train for six years in university, earn a basic salary $400-$850 similar to some policemen who it takes six months to train.",
    "source_domain": "abcnews.go.com",
    "title": "7 Kenya medics union officials freed; strike continues",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/kenya-medics-union-officials-freed-strike-continues-45504275"
}