{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 05:11:42+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Bangladesh condemns US attack in which citizen is suspect",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fbangladesh-condemns-us-attack-citizen-suspect-51731154.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_a11fb072de69414b8d31937f2bcd1d13_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bangladesh's government condemned an attack on New York City's subway system, as it emerged that the suspect is an immigrant from the South Asian nation.\n\"Bangladesh is committed to its declared policy of 'Zero Tolerance' against terrorism, and condemns terrorism and violent extremism in all forms or manifestations anywhere in the world, including Monday morning's incident in New York City,\" the government statement said in a statement.\nPolice in Bangladesh said Tuesday that they were not in a position to comment on the suspect, identified by U.S. authorities as Akayed Ullah, a 27-year-old Bangladeshi immigrant. Ullah is accused of strapping a crude pipe bomb to his body and detonating it during rush hour Monday in an attack in which only he was seriously wounded.\nUllah arrived in the United States in 2011 and the Department of Homeland Security said he's a lawful permanent resident of the U.S. who was living in Brooklyn. He came to the U.S. on a visa issued to him based on a family connection to a U.S. citizen.\nLaw enforcement officials familiar with the investigation said Ullah had looked at Islamic State group propaganda online and told investigators he was retaliating against U.S. military aggression, but had no direct contact with the group. The people spoke to The Associated Press on the condition of anonymity because they weren't authorized to speak publicly about the blast.\nUllah's family in the U.S. said in a statement that it was heartbroken and deeply saddened by the suffering the attack has caused.\n———\nAssociated Press writer Colleen Long in New York contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Bangladesh condemns US attack in which citizen is suspect",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/bangladesh-condemns-us-attack-citizen-suspect-51731154"
}