{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:50:53+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Woman Killed in New Year's Day Fireworks Explosion in Hawaii",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fwoman-killed-years-day-fireworks-explosion-hawaii-44511380.json",
    "image_url": "http://abcnews.go.com/US/wireStory/woman-killed-years-day-fireworks-explosion-hawaii-44511380",
    "language": "en",
    "localpath": null,
    "maintext": "A fireworks explosion at a large New Year's Day gathering on the Hawaiian island of Oahu has left one woman dead and a man critically injured, authorities said.\nPolice said the pair had been lighting illegal fireworks at the gathering when the explosion happened.\nEmergency personnel arrived just after midnight Sunday at the Campbell Industrial Park in Kapolei to find the two victims injured. The 38-year-old woman was taken to a hospital in critical condition and died from her injuries. The 36-year-old man remains in critical condition.\nPolice have opened an unattended death and prohibited explosive device investigation, but no one has been arrested or cited.\nHonolulu's Emergency Medical Services said the woman's death was among dozens of other fireworks-related incidents over the weekend. The agency responded to 28 calls within the first hour of 2017.\nFire Capt. Kevin Mokulehua said the Honolulu Fire Department also had a busy weekend.\n\"The Honolulu Fire Department responded to 19 fireworks-related incidents which doubled last year's incident totals,\" said Mokulehua. \"Most of the incidents were wildland fires, some structure fires and other miscellaneous fires.\"",
    "source_domain": "abcnews.go.com",
    "title": "Woman Killed in New Year's Day Fireworks Explosion in Hawaii",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/woman-killed-years-day-fireworks-explosion-hawaii-44511380"
}