{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:48:28+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsets-talks-aimed-salvaging-summit-trump-kim-55549222.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_d9de3fbb4e994f078ebadf0408deb17a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A top lieutenant of North Korean leader Kim Jong Un is in the United States conducting one of three sets of parallel talks aimed at salvaging a summit between Kim and President Donald Trump.\nKim Yong Chol is meeting with Secretary of State Mike Pompeo in New York to finalize plans for the summit, while lower-level officials have been meeting at the inter-Korean border and in Singapore for other pre-summit negotiations.\nA look at what is at stake in the three sets of talks:\n———\nU.S. TALKS\nKim Yong Chol is likely to convey to Pompeo that Kim Jong Un is serious about the summit and also to discuss the contents of a joint statement to be issued at its end.\nSome experts say major thorny issues are still unsettled between the two countries, and that is why a senior official like Kim Yong Chol has traveled to the United States to narrow the gap.\nTrump abruptly canceled the summit last Thursday before quickly reversing course and announcing the meeting could happen. His decision came amid widespread doubt in the United States that North Korea would be willing to actually scrap a nuclear program it has struggled for decades to build.\nMeanwhile, South Korean President Moon Jae-in, who met Kim Jong Un last Saturday, said the North Korean leader is uncertain whether he can trust Trump's promise to provide a security guarantee if North Korea abandons its nuclear weapons.\nGiven these basic concerns, Kim Yong Chol's talks with Pompeo are likely to focus on a possible compromise between Washington's push for a speedy nuclear disarmament and North Korea's preference for more gradual steps matched by corresponding benefits from the U.S.\nKim Yong Chol, 72, is the most senior North Korean official to visit the United States since 2000. His official title is vice chairman of the ruling Workers' Party. He previously headed North Korea's military intelligence agency and was believed to be behind two attacks in 2010 that killed 50 South Koreans and a 2014 cyberattack on Sony Pictures.\n———\nDMZ TALKS\nU.S. and North Korean officials started talks on the North's side of a Korean border village on Sunday to set the agenda for the summit. The village is inside the mine-strewn 4-kilometer (2.5-mile) -wide Demilitarized Zone, a buffer created at the end of the 1950-53 Korean War.\nThe U.S. delegation is headed by Sung Kim, the U.S. ambassador to the Philippines who served as America's top negotiator to now-stalled six-nation talks on North Korean nuclear disarmament, and as its ambassador to Seoul. In 2008, he witnessed North Korea's destruction of the cooling tower at its main nuclear complex in a show of good faith with the United States. In recent years, however, satellite photos have indicated that North Korea has restarted its plutonium reactor at the complex.\nHis North Korean counterpart is Vice Foreign Minister Choe Son Hui, the North's highest-ranking female diplomat. A recent statement by Choe threatening to scuttle the summit and warning Washington of a nuclear showdown led Trump to temporarily cancel the summit, citing \"open hostility\" from the North.\nThe two sides are believed to have exchanged their countries' views on North Korea's denuclearization, America's security assurances and other issues. South Korean media said they wrapped up their talks on Wednesday after Kim Yong Chol's departure for New York.\nChoe served as an English-language interpreter during the six-party talks, while Sung Kim, a Korean American, is fluent in Korean. Analysts say that is likely to have smoothed their talks because they could understand each other even when they were speaking their own languages at the negotiating table.\n———\nSINGAPORE TALKS\nThis meeting is to plan protocol, security and other logistical issues and might also include determining when and where in Singapore the summit would be held.\nThe two countries originally planned to hold the summit in Singapore on June 12. After putting the summit back on track, Trump tweeted Friday that it \"will likely remain in Singapore on the same date, June 12th, and, if necessary, will be extended beyond that date.\"\nA delegation led by another of Kim Jong Un's trusted aides, Kim Chang Son, flew to Singapore on Monday night. South Korean media reported that he began talks with Joe Hagin, the White House deputy chief of staff for operations, who is in Singapore with other U.S. officials.\nNo details have emerged about the talks. Possible venues for the summit include Singapore's presidential palace, the Shangri-La hotel and the Marina Bay Sands hotel.\nKim Chang Son served as Kim Jong Un's chief of staff after the 34-year-old leader took power in late 2011. His current official title is a departmental director at the State Affairs Commission, which is headed by Kim Jong Un.",
    "source_domain": "abcnews.go.com",
    "title": "3 sets of talks aimed at salvaging summit between Trump, Kim",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/sets-talks-aimed-salvaging-summit-trump-kim-55549222"
}