{
    "authors": [
        "Abc News",
        "Nicole Pelletiere",
        "More Michael",
        "More Nicole"
    ],
    "date_download": "2017-08-14 18:15:48+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "A lot of puzzle pieces were put into play last night.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fgame-thrones-burning-questions-eastwatch%2Fstory%3Fid%3D49210365.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/game-of-thrones-ht-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sunday's \"Game of Thrones\" wasn't the fireworks we got last week, but more of the planning from the rest of Westeros after Daenerys Targaryen introduced her dragons into the equation and tore through an entire army.\nAs Jaime Lannister aptly said, \"That was only one [dragon] ... she's got two more.\"\nIt goes without saying, MAJOR SPOILERS AHEAD!\nThis put the rest of the \"Game of Thrones\" kingdom on red alert with all sides rushing to figure out what to do next. Plus there are only two episodes left until the season 7 finale, so things should \"heat\" up.\nHere are the five biggest burning questions after last night's episode, \"Eastwatch.\"\n1 - Is Cersei really pregnant?\nIn this episode, Cersei has revealed to her brother Jaime that she is once again carrying his child. This news comes after Jaime tells Cersei that there is no way the Lannister army can win the war against Daenerys.\nCould Cersei be lying to Jaime in order to coerce him into not surrendering? Moments before hearing he was allegedly going to become a father again, it appeared as if the Kingslayer was ready to bend the knee to Daenerys. Perhaps Cersei made up the pregnancy to give him something to fight for.\n2 - Does Cersei really want to negotiate with Daenerys?\nAfter Daenerys’ dragon barbecued the Lannister army, Jaime goes to Cersei’s chambers to share the devastating news. During their meeting, Cersei tells Jaime that it may be time to make “accommodations” with the dragon queen.\nSomething about her tone seems far-fetched. Do we really believe that Cersei is now willing to make peace with her enemies? Or could this indicate that she’s plotting another setup like the Great Sept of Baelor, where she destroyed her enemies with wildfire?\n3 - Is Tyrion losing faith in Daenerys?\nAfter Dany used her dragon to rip through the army fighting on Cersei's side, she then gave Lord Tarly and Dickon a chance to bend the knee or die. After they refuse, despite Tyrion begging them to save their own lives, she burns them to death in front of their soldiers.\nAt Dragonstone, Tyrion expresses his concern to Varys. He tries to calm his friend's worries, especially with Dany being the daughter of the Mad King. Is she becoming too powerful for her own good? Only time will tell and how she handles her growing empire.\n4 - Is Littlefinger leading Arya into a trap?\nIt sure looks like it. After she follows the clever man, who has his eye on Arya's sister, Sansa, the now-fierce warrior finds a hidden scroll hidden under his bed.\nBut right when we think Arya may have outsmarted Petyr, we see him actually following her, smiling that she found the lost scroll. Looks like he's driving more and more of a wedge between the two sisters. It will be interesting to see what Jon Snow has to say when he gets back to Winterfell.\n5 - Is Jon Snow the rightful heir to the throne?\nWhich brings us to the biggest reveal, maybe, of the night!\nWhen Samwell and Gilly are researching and talking toward the end of the episode, she finds past documentation about an annulment for Prince Rhaegar, Dany's brother, who is rumored to be the father to Snow, though he doesn't know it.\nFurthermore, this could mean that he may have married Lyanna Stark in private in Dorne. Snow might not be a bastard after all and instead, the rightful king of Westeros. Dany is NOT going to be happy about this.\n\"Game of Thrones\" returns Sunday at 9 p.m. on HBO.",
    "source_domain": "abcnews.go.com",
    "title": "'Game of Thrones': 5 burning questions from 'Eastwatch'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/game-thrones-burning-questions-eastwatch/story?id=49210365"
}