{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:56:56+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Michael Bennett: Seahawks 'can't win' without Russell Wilson",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmichael-bennett-seahawks-win-russell-wilson%2Fstory%3Fid%3D48040404.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170602_NFL_trotter_on_seahawks_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Defensive end Michael Bennett defended his quarterback Wednesday, saying the Seattle Seahawks can't win without Russell Wilson under center.\n\"On a team with competitive people, there are going to be issues that are going to happen,\" Bennett said during an interview on 710 ESPN Seattle's \"Brock and Salk\" show. \"There's just a lot of alpha males running around, but everybody supports Russell Wilson. We can't win a game without Russell Wilson. Russell Wilson is a top-five quarterback in the NFL. We cannot win a game without a guy like that.\"\nBennett's comments come weeks after an ESPN The Magazine article about cornerback? Richard Sherman, Super Bowl XLIX and division in the Seahawks' locker room.\nLast week, Wilson called Sherman \"one of the best teammates\" he could ever ask for.\nBennett was asked how Wilson relates to the defensive players on the team.\n\"Russell relates best to me by just being himself,\" Bennett said Wednesday. \"I think as a human being, you accept the person for who they are. You don't try to change them. You don't make them who you want to make them, who you want them to be. A person that reveals themselves for who they are is who you accept them to be. Russell has revealed himself to me as a great person of great character, a person that gives back and a great leader. Also a great player.\"\nSherman has not yet been made available to the media during Seahawks practices.\nThe team wraps up its mandatory minicamp Wednesday and Thursday before a break until training camp in late July.",
    "source_domain": "abcnews.go.com",
    "title": "Michael Bennett: Seahawks 'can't win' without Russell Wilson",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/michael-bennett-seahawks-win-russell-wilson/story?id=48040404"
}