{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:48:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "US industrial production up 0.5 percent in March",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-industrial-production-05-percent-march-46860711.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_e11766ebd23d481a9995784126d5f29f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. industrial production posted a solid gain in March, reflecting a record rebound in utility output. But a closely watched gauge of manufacturing posted its first setback in seven months as auto production dropped sharply.\nThe Federal Reserve said Tuesday that industrial production rose 0.5 percent, propelled by an 8.6 percent surge in utility output, the largest on records dating to 1939. The utility gain reflected a return to normal demand for heating in March after an unusually warm February had cut demand.\nManufacturing output fell 0.4 percent last month, the first decline since August. The manufacturing decline was led by a 3 percent drop in the production of motor vehicles and parts.\nOutput in the mining sector was up a slight 0.1 percent after a 2.9 percent February gain.\nIndustrial production, which covers manufacturing, utilities and mining, had produced a scant 0.1 percent increase in February. Output in February was held back by the sharp drop in utility production.\nLast month's decline in factory production was a setback to what has been a rising trend over the past six months as factories recovered from a prolonged period of weakness. The weakness reflected a strong dollar, which cut into exports of American companies, and a drop in oil production, which caused cutbacks in investment by energy companies.\nThe 3 percent fall in auto output followed a 1.1 percent rise in February and a 1 percent drop in January.\nThe rough patch for manufacturing lasted from late 2015 through the middle of 2016. Sharply lower oil prices forced reductions in sales of drilling equipment, such as steel pipe.\nA strong dollar, which makes U.S. products more expensive overseas, hurt manufacturing export sales. But with energy prices rising and the surge in the dollar tapering off, there is optimism that manufacturing will fare better in 2017.",
    "source_domain": "abcnews.go.com",
    "title": "US industrial production up 0.5 percent in March",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-industrial-production-05-percent-march-46860711"
}