{
    "authors": [
        "Abc News",
        "More Bill"
    ],
    "date_download": "2018-04-24 18:01:38+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "As teachers plan to descend on the Colorado capitol, lawmakers propose an anti-strike bill.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2F10000-teachers-plan-descend-colorado-capitol-lawmakers-propose%2Fstory%3Fid%3D54662604.json",
    "image_url": "https://s.abcnews.com/images/US/teacher-protest-colorado-ap-1-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As thousands of Colorado school teachers get ready to descend on their state capitol this week to demand billions of dollars in education funding, lawmakers are proposing jailing them if they even consider going on strike.\nThe proposed law pitched by two Republican legislators threatens jail time for any educator caught \"directly or indirectly inducing, instigating, encouraging, authorizing, ratifying, or participating in a strike against any public school employer.\"\nDavid Zalubowski/AP\nThe jail term proposed by the prime sponsors of the bill, state Sen. Bob Gardner and Rep. Paul Lundeen, is six months.\n\"Clearly it's an attempt to limit the voices of educators,\" Kerrie Dallman, president of the Colorado Education Association, told ABC News. \"All we want to do is talk to our elected representatives about funding our schools appropriately. And here are two Republican legislators who've come out with a bill that is a clear attack on public school teachers in the state.\"\nColorado teachers are poised to participate in a lobbying effort in Denver Thursday and Friday, prompting at least a dozen school districts in the state to cancel school.\nDallman said she expects \"a couple thousand\" teachers to gather at the state capitol on Thursday and \"7,000-plus\" on Friday.\nShe emphasized the \"days of action\" at the capitol is not a strike or even a mass teacher walkout. She said most of the teachers participating in the event will be using the two personal leave days they earn annually.\n\"The fact that they're using one of their two personal days ... is a pretty strong signal about how important this issue is,\" Dallman said.\nIn a meeting with reporters on Monday, Gardner said his bill would not prohibit actions like the one teachers are planning this week, and he said it was \"absurd\" to say the proposal was intended to curb teachers' voices.\nGardner stressed that the bill deals with strikes which persist in defiance of a court order -- not the kind of protests teachers plan at the Capitol later this week. #copolitics #coleg #sb267 #context #context #context https://t.co/etlzLXVpBL — Colorado Senate GOP (@ColoSenGOP) April 24, 2018\n“I started thinking about the bill when I saw the news about teacher strikes in West Virginia,” Gardner said, according to The Denver Post. “It’s a wise thing to do, in some shape or form, in the state of Colorado because we have one district that’s already voted to strike. We have others discussing a strike. Strikes are not good for children.”\nGardner did not respond to ABC News' request for comment.\nWest Virginia teachers went on a nine-day strike earlier this year and won a 5 percent pay raise. The labor action ignited a string of teacher protests in red states like Oklahoma, Kentucky and Arizona where the governors' offices and state legislatures are dominated by Republicans.\nDavid Zalubowski/AP\nArizona teachers voted last week to go on strike as early as Thursday in an effort to win a 20 percent pay hike.\nColorado is the exception. The state's governor, John Hickenlooper, is a Democrat and Democrats hold a majority of seats in the State House.\nThe bill proposed by Gardner and Lundeen will likely not pass. In a tweet Monday, the Colorado Senate Democrats called the proposal \"anti-worker trash.\"\nThis bill is anti-worker trash. Republicans would rather pay to throw teachers in jail than pay them to teach. #copolitics https://t.co/WXxhIUEyFO — Colorado Senate Dems (@COSenDem) April 23, 2018\nDallman told ABC News that teachers in Colorado are frustrated that their efforts so far have not swayed lawmakers to adhere to Amendment 23, which was passed by voters in 2000 and requires the state to increase funding for education at the annual rate of inflation.\n\"We've had over nine years now of chronic underfunding of our schools,\" Dallman said. \"We have lobbied over those nine years and we are fed up at this point. Obviously, those nine years of lobbying around education funding have not achieved the results that we think parents want and what public school educators want.\"\nDavid Zalubowski/AP, FILE\nShe said Colorado spends about $2,700 less than the national per-pupil average of about $12,000 a year.\nDallman said that over the last nine years, state lawmakers have underfunded education by $6.6 billion.\n\"This year alone it was $828 million,\" she said.\nShe went on, \"So we want them to pay off that debt and adhere to Amendment 23 within the next four years. We want no new corporate tax breaks of any kind until we're funding our schools at the national per-pupil average.\"",
    "source_domain": "abcnews.go.com",
    "title": "As 10,000 teachers plan to descend on Colorado capitol, lawmakers propose jailing them if they go on strike",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/10000-teachers-plan-descend-colorado-capitol-lawmakers-propose/story?id=54662604"
}