{
    "authors": [
        "Abc News",
        "More Matt"
    ],
    "date_download": "2018-03-20 04:31:39+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-bans-americans-investing-venezuelan-cryptocurrency%2Fstory%3Fid%3D53861994.json",
    "image_url": "https://s.abcnews.com/images/Politics/donald-trump-new-hampshire-03-gty-jc-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump signed an executive order that prohibits Americans from dealing in any form of digital currency from Venezuela on Monday, a day before that country's launch of a state-owned cryptocurrency called the \"petro.\"\nThe executive order prohibits \"all transactions related to, provision of financing for, and other dealings in, by a United States person or within the United States, any digital currency, digital coin, or digital token, that was issued by, for, or on behalf of the Government of Venezuela on or after January 9, 2018.\"\nVenezuelan President Nicolás Maduro's administration introduced the oil-backed digital currency in February with his nation's economy in crisis and the bolivar experiencing hyperinflation.\nFederico Parra/AFP/Getty Images\nIn the order, Trump characterized the Maduro administration's actions as an \"attempt to circumvent U.S. sanctions by issuing a digital currency in a process that Venezuela’s democratically elected National Assembly has denounced as unlawful.\"\nMonday's executive order builds upon a body of existing sanctions directed at Venezuela, including those stemming from another executive order Trump signed in August that put restrictions on dealing in Venezuelan bonds or new debt, and one signed by President Barack Obama in 2015 that cited Venezuela's \"erosion of human rights guarantees, persecution of political opponents, curtailment of press freedoms, use of violence and human rights violations\" as justification.",
    "source_domain": "abcnews.go.com",
    "title": "Trump bans Americans from investing in Venezuelan cryptocurrency",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-bans-americans-investing-venezuelan-cryptocurrency/story?id=53861994"
}