{
    "authors": [
        "Abc News",
        "More Stephanie"
    ],
    "date_download": "2018-03-20 00:01:09+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "More than 100 members of Congress are asking for more funding to protect endangered species.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fcongressional-lawmakers-asks-money-protect-endangered-species%2Fstory%3Fid%3D53851808.json",
    "image_url": "https://s.abcnews.com/images/Politics/beyer-gty-er-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "More than 100 members of Congress are asking for more funding to protect endangered species, in a letter sent to the leaders on the House Appropriations Committee last week.\nThe Trump administration's budget proposed cuts to multiple agencies that carry out programs to protect endangered species, including an 18 percent cut to the U.S. Fish and Wildlife Service budget. The budget proposal for the FWS includes a $9.5 million cut to money available for listing new species as endangered, which is almost half the funding that program received in the 2017 fiscal year.\nThe non-profit Center for Biological Diversity said in a 2016 report that it would cost an estimated $2.3 billion per year to recover the populations of all endangered species. The U.S. currently provides just 3.5 percent of that funding, according to the report.\nThe proposed budget also includes a 64 percent cut for the Cooperative Endangered Species Conservation Fund, which provides grants for state and local governments for conservation.\nPaul Morigi/Getty Images for Fortune\nDemocratic Reps. Don Beyer, Debbie Dingell, and Raul Grijalva organized the letter which was co-signed by 103 Democratic Members of Congress and one Republican. In the letter, the lawmakers ask the leaders of the House Appropriations Committee to provide funding for Endangered Species Act programs in the budget for the 2019 fiscal year.\n\"The need for increased recovery funding is evident from the nearly 400 listed species that lack recovery plans. Congressional appropriation for both recovery and consultation, both insufficient, have not kept pace with the number of listed species,\" they wrote in the letter.\nI am leading a bipartisan letter with @RepDebDingell, @RepRaulGrijalva and 104 other Members of Congress calling for more robust funding for #EndangeredSpeciesAct protections. When 400 listed species currently lack protection plans, we can do better. #StopExtinction pic.twitter.com/h7rvE4kLQe — Rep. Don Beyer (@RepDonBeyer) March 16, 2018\n\"It is abundantly clear that Congressional ESA appropriations have not kept pace with recovery, consultation, and conservation efforts,\" Beyer said in a statement. \"Nearly 400 listed species lack recovery plans, and that is unacceptable. We need to adequately fund all aspects of the ESA process so that we can protect and preserve America’s national heritage.”\nThe letter was sent to the chair and ranking member of the subcommittees that recommend appropriations for the Interior Department and Department of Commerce.\nChip Somodevilla/Getty Images\nInterior Secretary Ryan Zinke was asked about the department's budget proposal and its impact on endangered species protection in a hearing Thursday, the day before the letter was released. Zinke said that the department proposed decreasing the Land and Water Conservation Fund, which is used to acquire and manage public lands, so it could focus specifically on wildlife corridors.\nZinke signed an order aiming to improve management of wildlife habitats in Western states in February, specifically for areas populated by game animals like antelope, elk, and mule deer.\nRyan Zinke once praised the Cooperative Endangered Species Conservation Fund for the work it was doing in his home state of Montana. But now as Secretary of Interior, Zinke has proposed to eliminate this important program. Yesterday, I demanded answers. pic.twitter.com/cwub4PTKdT — Rep. Don Beyer (@RepDonBeyer) March 16, 2018\nThe Center for Biological Diversity's endangered species director, Noah Greenwald, said he's glad to see congressional support to increase funding for endangered species protection. He said the center has identified at least 47 species that went extinct while waiting to be listed as endangered and that other species' recovery plans are decades old.\n\"Once species are protected if we don't identify what they need for recovery they could go extinct,\" he said in an interview with ABC News.\nRebecca Riley of the Natural Resources Defense Council said Endangered Species Act programs have been underfunded for years which contributed to delays in creating and implementing recovery plans for endangered species.\nFor example, Polar bears were listed as threatened in 2008, according to a Fish and Wildlife Service database, but the recovery plan for the species was only finalized in 2016.\n\"The underfunding of the Endangered Species Act has been going on for a long time, so the Trump administration is proposing to cut something that was already underfunded,\" she said.\nFunding for those programs is provided through the U.S. Fish and Wildlife Service as well as the National Marine Fisheries Service within the National Oceanic at Atmospheric Administration.",
    "source_domain": "abcnews.go.com",
    "title": "Congressional lawmakers ask for more money to protect endangered species",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/congressional-lawmakers-asks-money-protect-endangered-species/story?id=53851808"
}