{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 10:26:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Suicide Car Bomber Outside Mogadishu Airport Kills 3: Police",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fblasts-reported-airport-somalias-capital-44508807.json",
    "image_url": "http://abcnews.go.com/International/wireStory/blasts-reported-airport-somalias-capital-44508807",
    "language": "en",
    "localpath": null,
    "maintext": "A Somali police officer says a suicide bomber detonated an explosives-laden vehicle at a security checkpoint near Mogadishu's international airport, killing at least three people.\nCapt. Mohamed Hussein says the bomb detonated Monday as security forces were searching cars at the checkpoint, a few hundred meters (yards) from the main base of the African Union peacekeeping mission.\nThe checkpoint is close to United Nations offices and the Peace Hotel, which is often frequented by foreigners and officials. The powerful blast blew roofs off nearby buildings.\nA second blast and heavy gunfire could be heard at the checkpoint after the attack, but there were no immediate details.\nThere was no immediate claim of responsibility for the attack. However, the al-Qaida linked Islamic extremist group al-Shabab often carries out such attacks.\nDespite being ousted from most of its key strongholds across large parts of south and central Somalia, the group continues to wage deadly attacks across the country.\nSomalia's capital has seen frequent bomb attacks at hotels and military checkpoints. In July, two al-Shabab suicide bombers detonated explosives-laden cars outside the office of the U.N.'s mine-clearing agency and an army checkpoint near the African Union's main base, killing 13.\nThe assaults have threatened this Horn of Africa nation's attempts to rebuild from decades of chaos. The country's presidential election, a key step toward recovery, already has been delayed multiple times because of security and other concerns.",
    "source_domain": "abcnews.go.com",
    "title": "Suicide Car Bomber Outside Mogadishu Airport Kills 3: Police",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/blasts-reported-airport-somalias-capital-44508807"
}