{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 03:07:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fweeks-fulfilling-dream-meeting-tiger-woods-golf-fan%2Fstory%3Fid%3D54708721.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0424/dm_180424_Yates_on_Julio_Jones1143/dm_180424_Yates_on_Julio_Jones1143_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A man who fulfilled a dream to meet Tiger Woods at the Masters earlier this month died of cancer on Monday, his daughter announced on Twitter.\nShaun Caldwell, who was living with stage 4 lung cancer after having survived two bouts with colon cancer, had the opportunity to meet Woods just prior to the opening round of the Masters at Augusta National on April 5.\nThe meeting took place after a social media campaign by Caldwell's stepdaughter, Jordan Miller, who took to Twitter and Facebook to get word out about her father's condition.\nWith the help of Woods' girlfriend, Erica Herman, Caldwell met the golfer behind the driving range after he had warmed up prior to the first round. Woods shook his hand and gave him a signed golf glove.\nAccording to The State newspaper?in South Carolina, two weeks ago doctors at Duke University told the Caldwell family that the cancer had become too aggressive to fight. Caldwell chose to stop treatment rather than endure more radiation.\nMiller said in an earlier interview with the newspaper that her father was \"over the moon'' after the experience at Augusta National and that the family had arranged another surprise -- Masters badges for the final round, where they saw? Patrick Reed?win the tournament.",
    "source_domain": "abcnews.go.com",
    "title": "Weeks after fulfilling dream of meeting Tiger Woods, golf fan dies of cancer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/weeks-fulfilling-dream-meeting-tiger-woods-golf-fan/story?id=54708721"
}