{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:52:25+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Hits and misses: Notable NKorean assassinations or attempts",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fhits-misses-notable-nkorean-assassinations-attempts-45503111.json",
    "image_url": "http://abcnews.go.com/International/wireStory/hits-misses-notable-nkorean-assassinations-attempts-45503111",
    "language": "en",
    "localpath": null,
    "maintext": "The killing of the North Korean leader's outcast half brother adds to a long list of high-profile assassinations or attempts in which the country is suspected of targeting estranged relatives of the Kim clan, turncoats and South Korean public figures.\nKim Jong Nam told medical workers he had been attacked with chemical spray at the Kuala Lumpur airport before he died, Malaysian officials have said. Leader Kim Jong Un has executed or purged a slew of high-level government officials since taking power in late 2011, and experts believe he might have been trying to eliminate a potential challenger to his leadership. Others think he was enraged over recent news reports that his brother tried to defect to the South in 2012.\nNorth Korea has denied carrying out some of the killings and not commented on others. Some of the most notable assassinations or attempts it is suspected of doing:\nTRAITOR COUSIN\nLee Han-young, a nephew of one of the former wives of the country's second leader Kim Jong Il, was found dead of gunshot wounds in front of a Seoul apartment in 1997. Lee had defected to South Korea through Switzerland in 1982, but Seoul kept his arrival secret until 1996, when his mother also fled the North. Lee had harshly criticized the country and his dictator uncle. The investigation into his death concluded Lee was killed by North Korean agents sent to deliver Pyongyang's payback and the assailants returned to North Korea before they could be captured.\nBLAST IN YANGON\nNorth Korean agents set off a bomb meant for South Korea's leader while he was visiting Burma in 1983. President Chun Doo-hwan narrowly escaped the attack, but more than 20 people were killed, including four of his Cabinet ministers, his ambassador to Yangon and several top aides. One North Korean agent was shot to death by police, a second was executed and a third reportedly died in prison in 2008. Burma, now known as Myanmar, cut diplomatic ties with North Korea following the blast, but they restored relations in 2007.\nSOUTH KOREAN PRESIDENT\nA team of 31 North Korean commandos slipped undetected into South Korea in 1968 and came within striking distance of the Seoul presidential palace. South Korean security forces managed to repel the assault at the last minute. The only commando that was captured said he had come to \"slit the throat of (then-President) Park Chung-hee.\"\nA furious Park established a secret commando team tasked with demolishing the Pyongyang palace of North Korea's founder. Tensions later eased, but the South Korean commando team, incensed that the planned infiltration was aborted, mutinied in 1971, killing their trainers and marching on Seoul before being stopped.\nHIGH-PROFILE DEFECTOR\nIn 2010, two agents posing as defectors were arrested in a plot to assassinate Hwang Jang-yop, a former Workers' Party secretary who remains the highest-level North Korean to seek asylum in the South. South Korean officials said both agents were majors in North Korea's main army intelligence agency and were under orders to slit Hwang's throat. Hwang, who once tutored Kim Jong Il, bitterly criticized the North Korean government after his 1997 defection. North Korea called him a traitor and \"human scum.\" He died six months after the arrests at the age of 87.",
    "source_domain": "abcnews.go.com",
    "title": "Hits and misses: Notable NKorean assassinations or attempts",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/hits-misses-notable-nkorean-assassinations-attempts-45503111"
}