{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:14:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "The Latest: Calexit backers drop 1 secession bid, try again",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-calexit-backers-drop-secession-bid-46851906.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/latest-calexit-backers-drop-secession-bid-46851906",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on efforts to make California an independent nation (all times local):\n5 p.m.\nSupporters of one long-shot bid to make California an independent nation are ending their effort. But another group plans to seek a statewide vote next year.\nThe secretary of state's office confirmed Monday that Marcus Ruiz Evans, vice president of the Yes California Independence Campaign, notified officials he intends to withdraw the California Nationhood ballot measure.\nA new group, California Freedom Coalition, says it will file a new proposed ballot measure in coming weeks.\nThe movement drew extra interest after last year's election of Republican Donald Trump as president.\nYes California's president, Louis Marinelli, says in a message to supporters that he is seeking permanent residence in Russia.\nMarinelli says his group had nearly 100,000 registered supporters. However, measures need more than 585,000 signatures to reach the ballot.\n———\n3:18 p.m.\nSupporters of a long-shot bid to make California an independent nation are ending their effort to put it to a statewide vote next year.\nThe secretary of state's office confirmed Monday that Marcus Ruiz Evans, vice president of the Yes California Independence Campaign, notified officials he intends to withdraw the California Nationhood ballot measure.\nThe group's president, Louis Marinelli, says in a message to supporters that he is seeking permanent residence in Russia. He says supporters may try again to separate California from the United States at a later date.\nThe movement drew extra interest after last year's election of Republican Donald Trump as president.\nMarinelli says the group has nearly 100,000 registered supporters. Supporters needed more than 585,000 signatures by July to put a measure on the ballot.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Calexit backers drop 1 secession bid, try again",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-calexit-backers-drop-secession-bid-46851906"
}