{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 20:11:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Saakashvili freed by Ukraine court, urges government change",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsaakashvili-appears-court-ukraine-51715007.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_29479a4e4d0842abade297d52b224a4f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Mikheil Saakashvili, the former Georgian president turned opposition leader in Ukraine, walked free Monday after a court in the Ukrainian capital refused to sanction his arrest, vowing to push for a peaceful government change.\nSaakashvili was arrested Friday on allegations that he colluded with Ukrainian businessmen tied to Russia to topple President Petro Poroshenko, accusations Saakashvili rejected.\n\"I consider myself a prisoner of Ukrainian oligarchs,\" he said in an apparent reference to the business background of Poroshenko, who ran a chocolate business before he was elected president.\nProsecutors had asked to keep Saakashvili under house arrest, but the judge turned it down to the applause of Saakashvili's supporters.\nThe court's verdict marked a defeat for Poroshenko, who has faced mounting criticism for his failure to uproot endemic corruption.\nThe victorious Saakashvili said after the verdict that he will coordinate with other political forces in Ukraine to push for a peaceful change of government.\nSaakashvili, who was refusing food to protest the arrest, said that the first thing he now wants is to get back home and eat.\nYulia Tymoshenko, a former prime minister who leads an opposition party, attended the hearing in a show of support for Saakashvili.\nAbout 200 of Saakashvili's supporters gathered outside the court and scuffled with police earlier Monday.\nOn Sunday, thousands of Saakashvili's supporters marched across Kiev, demanding his release and calling for Poroshenko to be impeached.\nSaakashvili was a key figure in the 2003 Rose Revolution protests that drove Georgian President Eduard Shevardnadze from office. He served two terms as Georgian president in 2004-2013, winning broad acclaim for his anti-corruption efforts, but drawing criticism over a disastrous war with Russia and what his opponents saw as an authoritarian streak.\nPoroshenko named him the governor of Ukraine's Odessa region in 2015, but Saakashvili resigned the following year, claiming that Poroshenko and other officials were impeding anti-corruption reforms, and became a strong critic of his former patron.\nGeorgia stripped Saakashvili of his citizenship after his move to Ukraine. Poroshenko this summer rescinded his Ukrainian citizenship while Saakashvili was out of the country, leaving Saakashvili stateless.\nHe forced his way into Ukraine in September, barging across the border from Poland with the help of a crowd of supporters.\n———\nVladimir Isachenkov in Moscow contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Saakashvili freed by Ukraine court, urges government change",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/saakashvili-appears-court-ukraine-51715007"
}