{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 20:34:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Witness of explosion at major NYC transit hub: 'I believe in God today!'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fwitness-explosion-major-nyc-transit-hub-god-today%2Fstory%3Fid%3D51717844.json",
    "image_url": "http://a.abcnews.com/images/US/christina-bethea-witness-01-abc-jc-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Christina Bethea was on her way to her security guard job in Midtown Manhattan early Monday morning.\nInterested in New York? Add New York as an interest to stay up to date on the latest New York news, video, and analysis from ABC News. Add Interest\nBut she never made it to work.\nThe 29-year-old had arrived at the massive Port Authority terminal after taking a bus from her home in Yonkers north of the city and then a city subway. She was about to walk out of the transit hub to her job.\n“I walked down the stairs to go through the pathway that connects to the Port Authority and when I got to the end of it I heard a noise that went ‘boom’,” she told ABC News. “It sounded like a big gunshot. One time.”\nThe explosive sound was the result of what authorities are calling \"an attempted terrorist attack\" that injured three people.\nA 27-year-old suspect \"intentionally detonated\" an improvised, low-tech explosive device that was based on a pipe bomb and was attached to the suspect with Velcro and zip ties, authorities said. Three people were injured.\nBethea heard the sound first. Then she saw smoke.\n“I saw that so I started running to get out of there,” she said. “I didn’t know what was going on.”\nShe said others also fled at the sound of an explosion and smoke.\n“We all just ran,” she said. “We all ran up the steps, and someone said, ‘What the hell was that?’”\nPolice arrived quickly, she said.\n“Not even two minutes passed and all the police rushed into the Port Authority,” she said.\nAfter calling her family and her best friend, Bethea heard the news that the explosion and smoke were from a detonated device.\nRealizing she survived what may have been an attempted bombing, Bethea decided to head back home.\n“It shakes you up,” she said. “If I didn’t believe in God, I believe in God today,”",
    "source_domain": "abcnews.go.com",
    "title": "Witness of explosion at major NYC transit hub: 'I believe in God today!'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/witness-explosion-major-nyc-transit-hub-god-today/story?id=51717844"
}