{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:50:54+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Gambia Opposition Warns Longtime Ruler Against 'Rebel' Moves",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fgambia-opposition-warns-ousted-ruler-rebel-moves-44513774.json",
    "image_url": "http://abcnews.go.com/International/wireStory/gambia-opposition-warns-ousted-ruler-rebel-moves-44513774",
    "language": "en",
    "localpath": null,
    "maintext": "Gambia's political opposition said Monday that longtime ruler Yahya Jammeh could be considered a rebel leader if he takes up arms and doesn't step down later this month, a firm warning issued after the president recently vowed that any presence of foreign troops in the tiny West African nation would be tantamount to an act of war.\nTwo days earlier, Jammeh railed against the West African regional bloc known as ECOWAS that has urged him to step down. Jammeh claims that numerous voting irregularities invalidate the Dec. 1 ballot won by opposition coalition's Adama Barrow, and Jammeh's party is challenging the results in court.\nMeanwhile, Barrow says he is planning a Jan. 19 inauguration, which puts him on a collision course with Jammeh, who seized power in a bloodless 1994 military coup.\nHalifa Sallah, the spokesman of the opposition coalition, said Monday that Jammeh will be a private citizen as of Jan. 19, and would have no constitutional mandate to be in command of the armed forces of Gambia.\n\"Any president whose term of office expires who takes up arms against an incoming president whose term should begin according to law, would be regarded by the international community as a rebel leader,\" Sallah said in reading a statement by the coalition.\nThe president of ECOWAS — the Economic Community of West African States — has said that West African leaders will send troops into Gambia if Jammeh refuses to step down.\nBarrow, ECOWAS, the African Union and U.N. have carefully calculated their steps, Sallah said, adding that Jammeh should do the same \"so that no mistakes would be made that would undermine the peace and security of the country.\"\nECOWAS, the AU and the UN, however, would not need to manage Gambian affairs if the constitution is followed, and a peaceful transition is made, Barrow has said, urging Jammeh to open up a channel of communication, according to the coalition statement.\nThe coalition statement also comes a day after intelligence agents ordered two radio stations to shut down — Taranga FM and Hill Top Radio.\nHill Top Radio chief executive Basiru Darboe said three men identifying as National Intelligence Agents said the shutdown orders came from the outgoing president, but no reasons were given.\nThe Jammeh regime has long been accused of imprisoning, torturing and killing its opponents.\n———\nAP writer Abdoulie John in Dakar, Senegal contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Gambia Opposition Warns Longtime Ruler Against 'Rebel' Moves",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/gambia-opposition-warns-ousted-ruler-rebel-moves-44513774"
}