{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:47:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "IMF foresees global economy accelerating to 3.5 pct. in '17",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fimf-foresees-global-economy-accelerating-35-pct-17-46860461.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_0f764e99c4144a98b62e44fcab1bac80_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A resilient China, rising commodity prices and sturdy financial markets are offering a sunnier outlook for the global economy and helping dispel the gloom that has lingered since the Great Recession ended.\nThat's the picture sketched Tuesday by the International Monetary Fund, which predicts that the world economy will grow 3.5 percent this year, up from 3.1 percent in 2016. The IMF's latest outlook for 2017 is a slight upgrade from the 3.4 percent global growth it had forecast in January.\nThe IMF expects the U.S. economy to grow 2.3 percent, up from 1.6 percent in 2016; the 19-country eurozone to expand 1.7 percent, the same as last year; Japan to grow 1.2 percent, up from 1 percent; and China to expand 6.6 percent, down from 6.7 percent in 2016.\nThe monetary fund's latest outlook for the economy comes in advance of spring meetings in Washington this week of the IMF, the World Bank and the Group of 20 major economies. The meetings come against the backdrop of a gradually strengthening international picture, especially in many emerging economies, despite resistance to free trade and political unrest in some countries.\nFor years after the 2008 financial crisis and the Great Recession ended, the global economy remained trapped in what the IMF's managing director, Christine Lagarde, termed \"the New Mediocre.\" Banks were weak and reluctant to lend, and deeply indebted governments made growth-killing budget cuts.\nThe once-super-charged Chinese economy began a long slowdown, driving down global commodity prices and hurting countries from Australia to Zambia that fed raw materials to the world's second-biggest economy. Plummeting oil prices forced energy companies to slash production.\nNow, Lagarde and others say, the outlook is brightening. China's economy has steadied, thanks to government spending and an easy-money credit boom. Beijing said Monday that its economy grew at a 6.9 percent annual pace from January to March, the fastest in more than a year. Thanks in part to relief over China's prospects, global commodity prices have stabilized after plummeting from mid-2014 to early 2016.\nOil prices have surged nearly 40 percent in the past year, partly because oil-producing countries agreed to curb production.\nFinancial markets have marched upward. Investors expect the Chinese government to continue supporting economic growth. They also expect President Donald Trump to deliver tax cuts and infrastructure spending that could help boost U.S. economic growth.\nThe IMF does warn of downside risks to its optimistic forecast. They include \"the threat of deepening geopolitical tensions,\" the possibility that rising U.S. interest rates will squeeze economic growth and rattle financial markets and the threat that protectionist measures will damage global trade.\nWealthy economies also face deeper problems, in particular chronically weak growth in productivity — the output produced per hour of work — and aging workforces.",
    "source_domain": "abcnews.go.com",
    "title": "IMF foresees global economy accelerating to 3.5 pct. in '17",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/imf-foresees-global-economy-accelerating-35-pct-17-46860461"
}