{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2017-06-14 19:14:00+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Speaker Ryan declares 'An attack on one of us is an attack on all of us'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fhouse-speaker-paul-ryan-declares-attack-us-attack%2Fstory%3Fid%3D48028555.json",
    "image_url": "http://a.abcnews.com/images/US/gty-barton-shooting-react-ps-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Members of the House of Representatives gathered at the Capitol Building in Washington, D.C., today after the shooting at a Virginia park that injured five people, including U.S. Rep. Steve Scalise.\nDemocrats and Republicans held hands and prayed together at the start of the briefing, and leadership from both parties sat together throughout the briefing.\nHouse Speaker Paul Ryan, R-Wis., and House Minority Leader Nancy Pelosi, D-Calif., took to the chamber floor to encourage prayers for the victims and give praise to the \"tremendous bravery\" of the U.S. Capitol Police.\n\"We are all horrified by this dreadful attack on our friends and on our colleagues who serve and protect this country,\" Ryan said.\nRyan said the members of the house are \"united\" in their shock and anguish.\n\"An attack on one of us is an attack on all of us,\" he said.\nPelosi echoed those sentiments in her remarks, calling the shooting an \"injury in the family.\"\nPelosi added that she hopes the tragedy will allow her and her fellow House members to \"resolve our differences.\"\nThe House adjourned for the day after the briefing. The Congressional Baseball Game, for which Scalise and his GOP colleagues where practicing when they were attacked, will continue as planned Thursday at Nationals Park, Ryan said.\nPelosi said, \"Tomorrow we'll go out on the field. We'll root for our team. We want everyone to. .. do their best. And we will use this occasion to bring us together.\"\nPresident Trump was also among a wide range of politicians who reacted to the shooting, saying in a statement that he was \"deeply saddened\" by the attack.\n\"Our thoughts and prayers are the with members of Congress, their staffs, Capital Police, first responders and all others affected,\" Trump tweeted of the incident that left the alleged assailant dead and five people injured, including Rep. Scalise.\nCarlos Barria/Reuters/FILE\nTrump also described the Louisiana Republican as a \"true friend and patriot.”\nRep. Steve Scalise of Louisiana, a true friend and patriot, was badly injured but will fully recover. Our thoughts and prayers are with him. — Donald J. Trump (@realDonaldTrump) June 14, 2017\nPoliticians and public figures took to social media to react to the shooting:\nVice President Mike Pence\nKaren & I are praying for @SteveScalise, the Capitol Police, & all hurt for a speedy recovery. Our hearts are with them & their loved ones. — Vice President Pence (@VP) June 14, 2017\nFirst lady Melania Trump\nThank you to the first responders who rushed in to help protect those who were hurt in Alexandria, VA. My thoughts & prayers to everyone! — Melania Trump (@FLOTUS) June 14, 2017\nWhite House press secretary Sean Spicer\nBoth @POTUS & @VP are aware of the developing situation in Virginia. Our thoughts and prayers are with all affected. — Sean Spicer (@PressSec) June 14, 2017\nSpeaker of the House Paul Ryan, R-Wis.\nThis morning the hearts of the whole House are with @SteveScalise, the brave Capitol police, staff, and all those who were in harm's way. — Paul Ryan (@SpeakerRyan) June 14, 2017\nIvanka Trump\nIvanka Trump echoed her father's statement, offering prayers to Scalise and the other victims of the \"tragic events.\"\n\"We are grateful for their service and their dedication to this country,\" she said.\nSen. Marco Rubio. R-Fla.\nSen. John McCain, R-Ariz.\nPraying for @SteveScalise, my colleagues, staff & officers involved in terrible shooting- appreciate @CapitolPolice's bravery & swift action — John McCain (@SenJohnMcCain) June 14, 2017\nRep. Roger Williams, R-Texas\nIn a statement, Rep. Roger Williams said a member of his staff was shot and is receiving medical attention.\nWilliams was not hurt in the shooting.\nThe Republican baseball team holds practice every morning at 6:30 a.m. at the park, Williams said.\nSen. Tim Kaine, D-Va.\n“I am praying for Representative Scalise and all hurt in the outrageous attack this morning in Alexandria,” Sen. Tim Kaine said in a statement. “Thank you to the Capitol Police, Alexandria Police, first responders and everyone helping those harmed.”\nFormer Rep. Gabby Giffords, D-Ariz.\nMy heart is with my former colleagues, their families & staff, and the US Capitol Police- public servants and heroes today and every day. — Gabrielle Giffords (@GabbyGiffords) June 14, 2017\nRep. Jeff Duncan, R-S.C.\nRep. Darin LaHood, R-Ill.\nMy prayers are with @SteveScalise this morning as he's treated after this morning's shooting & will continue to monitor developments closely — Darin LaHood (@RepLaHood) June 14, 2017\nRep. Erik Paulsen, R-Minn.\nI wish everyone a speedy and full recovery and am relieved that this was not worse — Rep. Erik Paulsen (@RepErikPaulsen) June 14, 2017\nThank you to the @CapitolPolice for their courage and bravery, and acting so quickly — Rep. Erik Paulsen (@RepErikPaulsen) June 14, 2017\nRep. Mo Brooks, R-Ala.\nPraying for those injured at this morning's practice. I'm especially thankful to the US Capitol Police who risked their lived to protect us. — Mo Brooks (@RepMoBrooks) June 14, 2017\nRep. Ed Perlmutter, D-Colo.\nDeeply saddened and praying for Rep. Scalise & all the others who were shot. I never expected something like this to happen. — Rep. Ed Perlmutter (@RepPerlmutter) June 14, 2017\nRep. Jared Polis, D-Colo.\nThoughts and prayers w my Republican baseball friends this morning. Dem practice cancelled holding in dugout w security — Jared Polis (@jaredpolis) June 14, 2017\nCongressional votes cancelled for today\nThoughts and prayers for the victims of the baseball shooting — Jared Polis (@jaredpolis) June 14, 2017\nSenate Majority Leader Mitch McConnell, R-Ky.\nMy prayers are with those wounded this morning & their families. Continued appreciation to Capitol Police & first responders. — Leader McConnell (@SenateMajLdr) June 14, 2017\nSen. Chuck Schumer, D-N.Y.\nSaddened by news of the shooting in VA this am. Thoughts & prayers for Rep @SteveScalise & others injured & hope for a speedy recovery. — Chuck Schumer (@SenSchumer) June 14, 2017\nAlways so grateful for the US Capitol Police officers. Their bravery saved lives in VA this morning. Thank you. — Chuck Schumer (@SenSchumer) June 14, 2017\nRep. Patrick McHenry, R-N.C.\nI was not at today's practice. My prayers are with my good friend Whip Scalise, staff, and the Capitol police officers injured this morning. — Patrick McHenry (@PatrickMcHenry) June 14, 2017\nGod bless @CapitolPolice. Their quick, heroic actions saved many lives today. Thankful for their dedicated service keeping us safe each day. — Patrick McHenry (@PatrickMcHenry) June 14, 2017\nRep. Bob Latta, R-Ohio\nMarcia and I send prayers to @SteveScalise and victims of today’s shooting. Grateful for @CapitolPolice + @AlexandriaVAPD for their actions. — U.S. Rep. Bob Latta (@boblatta) June 14, 2017\nRep. Earl Blumenauer, D-Ore.\nMy thoughts are w/ Steve Scalise, colleagues & all affected in the horrific shooting. Grateful for brave Capitol Police & others who acted. — Earl Blumenauer (@repblumenauer) June 14, 2017\nSen. Bob Corker, R-Tenn.\nMy prayers are with all those affected by this morning's shooting. I am extremely grateful for our brave Capitol Police officers. — Senator Bob Corker (@SenBobCorker) June 14, 2017\nSen. Roy Blunt, R-Mo.\nPraying for all of those hurt in today’s horrific shooting at the congressional baseball practice (1/2) — Senator Roy Blunt (@RoyBlunt) June 14, 2017\nIncredibly grateful for our law enforcement officers who put their lives on the line every day to keep us safe. (2/2) — Senator Roy Blunt (@RoyBlunt) June 14, 2017\nSen. Chuck Grassley, R-Iowa\nMy prayers are w my colleagues, congressional staff + Capitol police at GOP congressional baseball practice this morning — ChuckGrassley (@ChuckGrassley) June 14, 2017\nRep. Jason Chaffetz, R-Utah\nPraying for my colleagues this morning. God bless — Jason Chaffetz (@jasoninthehouse) June 14, 2017\nRep. Matt Gaetz, R-Fla.\nPraying for my friend @SteveScalise — Matt Gaetz (@mattgaetz) June 14, 2017\nRep. Roger Marshall, R-Kan.\nI am alright. Please pray with me this morning. — Dr. Roger Marshall (@RogerMarshallMD) June 14, 2017\nRep. Patrick Meehan, R-Pa.\nMy thoughts and prayers are with my colleagues, the staffers and the U.S. Capitol Police officers involved in this morning's shooting. — Patrick Meehan (@RepMeehan) June 14, 2017\nHouse Minority Leader Nancy Pelosi, D-Calif.\nMy thoughts and prayers with @SteveScalise, Capitol Police and staff at the shooting in Alexandria, VA this morning. — Nancy Pelosi (@NancyPelosi) June 14, 2017\nSen. Claire McCaskill, D-Mo.\nPlease people. No partisan politics over this. Let's come together against evil. United by our common decency. — Claire McCaskill (@clairecmc) June 14, 2017\nUnspeakable evil. Pray that Rep Scalise, police officers and everyone else will be ok. — Claire McCaskill (@clairecmc) June 14, 2017\nSen. Mark Warner, D-Va.\nPrayers for Steve Scalise & others injured. Grateful this and every day for our brave police & first responders. — Mark Warner (@MarkWarner) June 14, 2017\nRep. Pete Sessions, R-Texas\nWatching the news unfold this morning and my prayers are with my friend @SteveScalise and the several others who were harmed this morning. — Pete Sessions (@PeteSessions) June 14, 2017\nRep. Bill Shuster, R-Pa.\nPraying for my colleague @SteveScalise, @CapitolPolice, and all staff targeted this morning in this horrific shooting. — Bill Shuster (@RepBillShuster) June 14, 2017\nSen. Jerry Moran, R-Kan.\nShocked & saddened by this AM's shooting, praying for all impacted. Thankful for efforts of those working to keep Congress & staff safe. — Jerry Moran (@JerryMoran) June 14, 2017\nRep. Gus Bilirakis, R-Fla.\n.@SteveScalise is one of the toughest people I know. Praying for his speedy recovery and for all staff & USCP officers involved this morning — Gus Bilirakis (@RepGusBilirakis) June 14, 2017\nRep. John Shimkus, R-Ill.\nPlease pray with me for my friend @SteveScalise, USCP and all those there. https://t.co/ugvaL6n0kY — John Shimkus (@RepShimkus) June 14, 2017\nRep. Mike Coffman, R-Colo.\nMy thoughts and prayers are with my colleagues and staff who were at the Congressional baseball practice this morning. — Rep. Mike Coffman (@RepMikeCoffman) June 14, 2017\nRep. Robert Aderholt, R-Ala.\nPlease join me in praying for my colleagues and Capitol Police. I am fine. Thank you to those who have asked. — Rep. Robert Aderholt (@Robert_Aderholt) June 14, 2017\nRep. Ileana Ros-Lehtinen, R-Fla.\nThoughts and prayers for @SteveScalise, staff, + @CapitolPolice heroes who are victims of cowardly shooting. Grateful for courage of police — Ileana Ros-Lehtinen (@RosLehtinen) June 14, 2017\nRep. Tim Ryan, D-Ohio\nMy prayers are going to @SteveScalise, staff, and Capitol Police officers who were involved with this horrible incident this morning. — Congressman Tim Ryan (@RepTimRyan) June 14, 2017\nRep. Mike Quigley, D-Ill.\nHorrified to hear of attack in VA—My thoughts are w/ my colleagues, their staff & Capitol Police, as we continue to gather more information. — Mike Quigley (@RepMikeQuigley) June 14, 2017\nRep. Darrell Issa, R-Calif.\nAsking you to join me in prayer for @SteveScalise, @CapitolPolice, their staff & others at the Congressional baseball game practice this AM — Darrell Issa (@DarrellIssa) June 14, 2017\nSen. Bill Cassidy, R-La.\nReports saying that @SteveScalise is in stable condition. Please keep him and all those injured in your prayers. — Bill Cassidy (@BillCassidy) June 14, 2017\nRep. Chellie Pingree, D-Maine\nThinking of our colleagues & staff involved in Alexandria baseball shooting. We are grateful to Capitol police for their service to us all. — Chellie Pingree (@chelliepingree) June 14, 2017\nRep. Jeff Fortenberry, R-Neb.\nI'm shocked, I'm grieved, I'm numb about the shooting of my friend Steve Scalise. — Jeff Fortenberry (@JeffFortenberry) June 14, 2017\nRep. Brian Higgins, D-N.Y.\nThinking of my colleagues after a horrible attack on members of Congress, staff and @CapitolPolice. Wishing all a full and speedy recovery. — Brian Higgins (@RepBrianHiggins) June 14, 2017\nRep. Virginia Foxx, R-N.C.\nPlease join me in praying for those injured in the shooting at @thehillbaseball practice this morning. — Virginia Foxx (@virginiafoxx) June 14, 2017\nRep. Gregg Harper, R-Miss.\nMy staff and I are safe. We are praying for Rep. Scalise, the staffer and the two Capitol police officers who were injured this morning. — Gregg Harper (@GreggHarper) June 14, 2017\nRep. Cathy McMorris Rodgers, R-Wash.\nHorrifying news of @stevescalise, aides, & @capitolpolice shooting. Join me praying for him, his wife Jennifer, kids, staff & all involved — CathyMcMorrisRodgers (@cathymcmorris) June 14, 2017\nRep. Michael Burgess, R-Texas\nI am praying for Rep. @SteveScalise and others affected by this morning's events. Thank you to @CapitolPolice for your heroic work. — Michael Burgess, MD (@michaelcburgess) June 14, 2017\nRep. Kurt Schrader, D-Ore.\nThankful every day for the courage of Capitol Police who keep us safe day in & day out. Thoughts with @SteveScalise, the officers & staff. — Rep. Kurt Schrader (@RepSchrader) June 14, 2017\nRep. Vern Buchanan, R-Fla.\nMy staff and I are safe. Praying for @stevescalise, congressional staff and @CapitolPolice officers involved. — Rep. Vern Buchanan (@VernBuchanan) June 14, 2017\nRep. Jim Himes, D-Conn.\nHorrified by the attack on the Congressional family in VA this morning. Praying for those injured and grateful for those who keep us safe. — Jim Himes (@jahimes) June 14, 2017\nSen. Ed Markey, D-Mass.\nTo @SteveScalise, the other shooting victims and their families: I am praying for you. You have the strength of our nation w/ you right now. https://t.co/baCsmCJXbU — Ed Markey (@SenMarkey) June 14, 2017\nI, and all of my Congressional colleagues, cannot thank the @CapitolPolice enough for their service to our safety each and every day. — Ed Markey (@SenMarkey) June 14, 2017\nSen. John Boozman, R-Ark.\nI'm horrified at the senseless act of violence at congressional baseball practice. Praying for @SteveScalise Capitol Police & other victims — Senator John Boozman (@JohnBoozman) June 14, 2017\nSen. Jeff Merkley, D-Ore.\nMy thoughts and prayers are with my colleague @SteveScalise, the brave Capitol Police, and others who were injured in this tragic incident. — Senator Jeff Merkley (@SenJeffMerkley) June 14, 2017\nSen. Sherrod Brown, D-Ohio\nPls join me in thinking of @SteveScalise, @CapitolPolice, staff, their families, & everyone affected by the senseless violence this AM. -SB — Sherrod Brown (@SenSherrodBrown) June 14, 2017\n.@CapitolPolice protect members, staff & visitors every day - as we learn more about this AM's events, esp grateful for their tireless work. — Sherrod Brown (@SenSherrodBrown) June 14, 2017\nFormer Rep. Dennis Kucinich, D-Ohio",
    "source_domain": "abcnews.go.com",
    "title": "House Speaker Paul Ryan declares 'An attack on one of us is an attack on all of us'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/house-speaker-paul-ryan-declares-attack-us-attack/story?id=48028555"
}