{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 18:01:35+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Mayor David Briley says victims of the shooting \"deserve leaders who will step up and take action and do something to get these weapons off our streets.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fnashville-mayor-calls-gun-reform-wake-waffle-house-54696651.json",
    "image_url": "https://s.abcnews.com/images/US/180424_vod_orig_nashville_mayor_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Nashville mayor calls for gun reform in wake of Waffle House shooting\nTragedies like today shouldn't happen. It's been only seven months since we had another mass shooting here in Nashville. And that is far too frequent. We need. Comprehensive gun reform to address mass shootings. Domestic shootings. Accidental shootings and homicides. If we can all just come together. For this and for the greater good we can take these weapons of war off the streets of our country. I know. That we all want to live in a safe environment that allows everyone to go to work or school and feel and be safe. We all want to live up to our greatest potential. And it's my responsibility is the mayor of natural to try and make that happen. Clearly the victims of this shooting deserve our prayers and our thoughts. But they also deserve leaders. Who will step up and take action. And do something to get these weapons off our streets. For a moment let's be honest about what happened. Last night innocent Nash billions. Worth terrorized. My man with an a let's be honest. Some people see these weapons. As having a purpose of terrorizing other people. It's happening too much. Enough is enough.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Nashville mayor calls for gun reform in wake of Waffle House shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/nashville-mayor-calls-gun-reform-wake-waffle-house-54696651"
}