{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2017-01-02 19:49:59+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Mark Hamill Opens Up About His Friendship With Carrie Fisher",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fmark-hamill-opens-friendship-carrie-fisher%2Fstory%3Fid%3D44513416.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-Mark-Hamill-Carrie-Fisher-ml-161228_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Mark Hamill is still coming to terms with the death of \"Star Wars\" co-star Carrie Fisher.\nThe actor, who played Luke Skywalker in the franchise films, penned an essay for The Hollywood Reporter detailing some of his favorite memories of the late actress.\nThough their friendship endured its ups and downs, Hamill wrote, Fisher, \"was able to make you feel like you were the most important thing in her life.\"\n\"When you were in her good graces, you couldn’t have more fun with any person on the planet... And then you could go 180 degrees opposite, where you were furious with one another and wouldn't speak for weeks and weeks,\" he wrote. \"But that’s all part of what makes a relationship complete. It’s not all one sided. Like I say, she was a handful. She was high maintenance. But my life would have been so much drabber and less interesting if she hadn’t been the friend that she was.\"\nFisher was 60 when she died Dec. 27 in a Los Angeles hospital, four days after she went into cardiac arrest on a transatlantic flight. At the time, Hamill tweeted that he was devastated by the news, and in the essay, he elaborated on why.\nWriting that he and Fisher \"occupied a unique area in each other's lives,\" he recalled meeting Fisher for the first time for dinner before they started filming \"Star Wars.\" Though they were from different backgrounds -- she was the daughter of Debbie Reynolds and Eddie Fisher, while he was \"so middle class\" -- and five years older, he was \"bowled over\" by her, he wrote.\n\"I mean she was just so instantly ingratiating and funny and outspoken. She had a way of just being so brutally candid,\" he wrote. \"I’d just met her but it was like talking to a person you’d known for ten years. She was telling me stuff about her stepfather, about her mom, about [her father] Eddie Fisher — it was just harrowing in its detail. I kept thinking, 'Should I know this?' I mean, I wouldn’t have shared that with somebody that I had trusted for years and years and years. But she was the opposite. She just sucked you into her world.\"\nHamill wrote that as they continued their working relationship, his favorite hobby was making Fisher laugh, calling it \"a badge of honor.\" The actor, 65, added that he was grateful to have worked with her on the more recent \"Star Wars\" movies.\n\"We ran the gamut over the years, where we were in love with each other, where we hated each other’s guts. 'I’m not speaking to you, you’re such a judgmental, royal brat!' We went through it all,\" he wrote. \"We were a family.\"\nOne day after Fisher died, her mother, Debbie Reynolds, followed her in death. The two are expected to be memorialized at a joint funeral, according to Fisher's brother, Todd, though no plans have been announced.",
    "source_domain": "abcnews.go.com",
    "title": "Mark Hamill Opens Up About His Friendship With Carrie Fisher",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/mark-hamill-opens-friendship-carrie-fisher/story?id=44513416"
}