{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:57:41+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "New twists in probe of Natalie Wood's mysterious 1981 death",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Ftwists-probe-natalie-woods-mysterious-1981-death-52806864.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_f44a24e189674e55978554bf927cd2e1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The mystery of the death of acclaimed actress Natalie Wood has endured for nearly four decades as the investigation has ebbed and flowed like the tides off a California island where her body was found floating on Thanksgiving weekend 1981.\nRenewed interest came this week when the lead detective in the case said her widower, actor Robert Wagner, now 87, is considered a person of interest.\nHere's a look at what's known about the death and the investigation over the years.\nALL ABOARD\nThe body of Wood, 43, was found off Catalina Island, a scenic getaway about 30 miles south of the Los Angeles-area coastline. The three-time Academy Award nominee who starred in \"West Side Story\" and \"Rebel Without a Cause\" couldn't swim. She was wearing a red down jacket and nightgown.\nShe had been drinking heavily aboard a yacht with her husband and with actor Christopher Walken, who was filming the thriller \"Brainstorm\" with Wood. The only other person aboard was the boat's captain.\nWagner, who was starring at the time in the TV drama \"Hart to Hart,\" has denied any involvement in his wife's death, and no charges have been filed.\nTHEORIES FROM TWO KEY WITNESSES\nWagner wrote in a 2008 memoir that he and Walken argued that night. Walken went to bed and Wagner stayed up for a while, he wrote. When he went to bed, he noticed his wife and a rubber dinghy that had been tied to the yacht were missing.\n\"There are only two possibilities,\" Wagner wrote, \"either she was trying to get away from the argument, or she was trying to tie the dinghy. But the bottom line is that nobody knows exactly what happened.\"\nWalken has said little publicly over the years about the incident and has offered brusque replies at times when pressed. However, he told Playboy in 1997 that he thought Wood was probably half-asleep and slipped, hit her head and fell from the dinghy.\n\"Anybody there saw the logistics — of the boat, the night, where we were, that it was raining — and would know exactly what happened,\" Walken said. \"You hear about things happening to people — they slip in the bathtub, fall down the stairs, step off the curb in London because they think that the cars come the other way — and they die. You feel you want to die making an effort at something; you don't want to die in some unnecessary way.\"\nCHANGING INVESTIGATION\nAuthorities initially ruled the death an accidental drowning, but that changed. They reopened the investigation in 2011 after the boat's captain, Dennis Davern, said he heard the couple arguing the night of her disappearance.\nThe Los Angeles coroner's office amended Wood's death certificate in 2012 to include \"drowning and other undetermined factors.\"\nThe change was due in part because investigators couldn't rule out that some of the bruises and marks on Wood's body happened before she went into the water, according to the report. Wood wasn't wearing a life jacket, had no history of suicide attempts and didn't leave a note.\nThe report also revealed that investigators hadn't preserved Wood's fingernails to determine if she had tried to claw her way back into the dinghy. Scratch marks were found on the craft's hull.\nWhen the case was reopened, Los Angeles County sheriff's Lt. John Corina said Wagner was not a suspect.\nThis week, Corina told CBS News that he didn't believe Wagner had told the whole story about what happened and called him a person of interest in the case.\nInitially, a sheriff's spokeswoman downplayed the report Thursday and said there was nothing new in the case. But later, the department issued a statement confirming that Wagner is a person of interest.\n\"Do we have enough to make an arrest at this moment? No,\" spokeswoman Nicole Nishida said.\nWHAT WALKEN AND WAGNER TOLD INVESTIGATORS\nInvestigators made at least 10 attempts to interview Wagner again after reopening the investigation in 2011, including tracking him down in Colorado. But either Wagner or his lawyer refused.\nWagner's attorney, Blair Berk, issued a statement five years ago saying neither Wagner nor his daughters had any new information and blaming people for trying to exploit the 30th anniversary of Wood's death.\n\"Mr. Wagner has fully cooperated over the last 30 years in the investigation of the accidental drowning of his wife in 1981,\" Berk said at the time. \"Mr. Wagner has been interviewed on multiple occasions by the Los Angeles sheriff's department and answered every single question asked of him by detectives during those interviews.\"\nAt the time, Corina said Walken gave a prepared statement and spoke to detectives for an hour.\nDetectives also interviewed other actors who knew Wagner and Wood to learn more about their relationship.\nNEW WITNESSES COME FORWARD\nNew witnesses interviewed since the case was reopened gave statements that \"portray a new sequence of events on the boat that night,\" said Nishida, the sheriff's spokeswoman.\nOne witness described hearing yelling and crashing sounds coming from the couple's stateroom, she said. Shortly afterward, other witnesses heard a man and woman arguing on the back of the boat and believe the voices were those of Wood and Wagner.\nThose statements differ from the version of events originally provided by witnesses, including those who were on the boat, she said.\nWagner's publicist, Alan Nierob, declined to comment Thursday.",
    "source_domain": "abcnews.go.com",
    "title": "New twists in probe of Natalie Wood's mysterious 1981 death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/twists-probe-natalie-woods-mysterious-1981-death-52806864"
}