{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:06:00+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A judge has given defense lawyers until June 15 to make their case for attorney-client privilege.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fclock-ticking-sides-court-fight-trump-lawyers-documents-55543824.json",
    "image_url": "https://s.abcnews.com/images/WNT/180530_wn_pjillips2_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Clock ticking for both sides in court fight over Trump lawyer's documents\nSanders in the briefing room. Nex tonight, there are R developments involving the president's former attorney and friend,ichael Cohen. Attorneys giving him adeadline in the case, and re's ABC's Kyra phis. Reporter: The clock now officialicking in the fight over millions of documents seized in those ids of ident trump's personal torney, Michael Cohen. High stakes on both sides. E judge today giving Cohen until June 15th to get through 3.7 million ments seized I those raids to make their case for attorney/client prige. But Cohen's attorneying they L need to get through two-thirds of that material.today, pleading re time. Have people sleeping on couches. We king around clock.\" The government also under pressure to build their case. Prosecutors today revealing for E first time that among items seized in thoseraids,en's shredder. Normally, W we shred document think they're gone. UT they're not. If they're in strips, you can pu them back together and poteially find new criminal Ence. Reporter: Other potential evidence secret tape recording S. Michael avenat srmy Daniels' ey, argues they could be explosive. They are goi pose host of problems for Michael Cohen and for the president. Reporter: Avenatti appeared in court, but withdrew his quest to join case after receiving aft slapdown from the judge. \"You will not be able to use this court as a platfo Reporter: If Cohen doesn't meet that juneth Dene, the VI all this material will be L the government, and they wave toide ify hav a criminal case against preside trump's long-time lawyernd fixer,hael Cohen. David? Kyra Phillips live in washington.kyra, thank\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Clock ticking for both sides in court fight over Trump lawyer's documents",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/WNT/video/clock-ticking-sides-court-fight-trump-lawyers-documents-55543824"
}