{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 02:57:11+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The profiles of up to 50 million users may have been harvested in 2014.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fpolitical-data-firm-ties-trump-campaign-scandal-facebook-53860787.json",
    "image_url": "https://s.abcnews.com/images/WNT/180319_wn_thomas_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Political data firm with ties to Trump campaign behind scandal with Facebook\ntonight, and to new undercover video here involving a company hired by the trump campaign, a company that allegedly got its hands on up to 50 million Facebook accounts here in the U.S. Without you knowing. Your likes, your religion, your friends. And then, using that information to try to sway your vote. ABC's chief justice correspondent Pierre Thomas with the video tonight, and what that company also allegedly offered. Reporter: Tonight, new undercover video from Britain's channel four making headlines today. Reporters posing as foreigners with political ambitions are meeting with Cambridge analytica. The political data firm with ties to the trump campaign is making its sales pitch to potential clients. If you are collecting data on people and you're profiling them, that gives you more insight that you can use to know how to segment the population. To give them messaging about issues that they care about. And we use that in America. Reporter: Cambridge analytica is the company behind that growing scandal involving Facebook and how the profiles of 50 million of the social media company's users may have been obtained without them knowing. The reporters even meet this man, Alexander nix, one of the company's founders, who promises to send an attractive woman to trap a rival candidate. Send some girls around to the candidate's house, we could bring some Ukrainians in on holiday. I'm just giving you examples of what can be done and what has been done. Reporter: Tonight, nix is saying he was playing along and had no intentions of breaking any laws. Tonight, questions about Cambridge analytica's ties to the trump campaign. Steve Bannon helped secure early financing and Cambridge analytica has even touted its research in helping trump win the presidency. Here's the founder, the same person who discusses entrapping the rival candidate, speaking at a conference. But we were able to use data to identify that there was very large quantities of persuadable voters there that could be influenced to vote for the trump campaign. Reporter: Now, with press reports surfacing, Facebook is banning the company, saying, \"Protecting people's information is at the heart of everything we do.\" Christopher Wylie was an early key employee of Cambridge analytica. He left in 2014, but told ABC's James Longman that they tested some slogans long before the campaign. We tested things like drain the swamp. We started testing before they really gained prominence in American political discourse. Reporter: Cambridge analytica acknowledges the information was inappropriately obtained by a third party, but says it was never used and deleted as soon as they learned there was a problem. And the company is blaming this man, aleksandr Kogan, a researchers hired as a contractor described as a russian-american. How concerned are you that they might have ties to Russia? I'm very concerned about their ties, potentially to Russia, but also their activities in a number of countries where I believe they have proven to be a destabilizing force. So, let's get to Pierre Thomas, live with us tonight. Pierre, there are concerns tonight that some of that data taken from millions of Americans and their Facebook accounts, is still out there? Reporter: That's right. Claiming they deleted all this voter information, but tonight, Facebook is not taking their word, announcing they've hired investigators to figure out exactly what happened. David?\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Political data firm with ties to Trump campaign behind scandal with Facebook",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/political-data-firm-ties-trump-campaign-scandal-facebook-53860787"
}