{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:22:46+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frights-chief-syria-siege-involved-war-crimes-53861927.json",
    "image_url": "http://abcnews.go.com/International/wireStory/rights-chief-syria-siege-involved-war-crimes-53861927",
    "language": "en",
    "localpath": null,
    "maintext": "The U.N. human rights chief told an informal meeting of the Security Council Monday that the Syrian government's five-year siege of the Damascus suburbs of eastern Ghouta has involved \"pervasive war crimes,\" use of chemical weapons and starvation as a weapon of war.\nHigh Commissioner for Human Rights Zeid Ra'ad al-Hussein was blocked from addressing a formal council meeting by a Russian procedural maneuver, but he delivered his hard-hitting speech to an open meeting anyway, decrying \"mind-numbing crimes\" committed by all parties in Syria using \"unlawful methods of warfare.\"\nHe said multiple parties to the conflict, now in its eighth year, \"claim to justify their military offensives based on their struggle against terrorism.\"\nBut Zeid said \"never before have the campaigns against terrorism been used more often to justify the unconscionable use of force against civilians than in the last few months in Syria.\"\nHe was especially critical of Syria, singling out President Bashar Assad's claim that his government makes every effort to protect civilians.\nThe U.N.'s top human rights official dismissed it, saying: \"When you are capable of torturing and indiscriminately killing your own people, you have long forfeited your own credibility.\"\nZeid pointed to eastern Ghouta as an example.\n\"The siege of eastern Ghouta by the Syrian government forces, half a decade long, has involved pervasive war crimes, the use of chemical weaponry, enforced starvation as a weapon of warfare, and the denial of essential and life-saving aid,\" he said.\nZeid said this has culminated \"in the current relentless, month-long bombardment of hundreds of thousands of terrified trapped civilians.\"\n\"Families are now streaming out of the area,\" he said, \"but many civilians fear reprisals will be taken against them for their perceived support for opposition groups.\"\nZeid stressed that \"those who have perpetrated and are still perpetrating these mind-numbing crimes committed in Syria must be made to answer before a properly constituted court of law.\"\n\"This must be assured and made non-negotiable — for the victims,\" he said, but also for the legitimacy of the U.N. and the Security Council, and to prevent future violations and advance human rights around the world.\nHe again urged the council to refer Syria to the International Criminal Court.\nThat remains highly unlikely, however, since both Russia and China vetoed a resolution backed by more than 60 countries in May 2014 that would have referred the Syrian conflict to the ICC.\nZeid also said justice and respect for human rights must be at the center of any peace talks.\n\"No settlement which shields the perpetrators from prosecution is worth discussing, simply because such a settlement would be utterly empty,\" he said. \"For peace in Syria to be meaningful and lasting, a guarantee of justice for the Syrian people must be assured.\"\nZeid had been scheduled to speak at an open council meeting Monday afternoon, but when it started, Russian Deputy Ambassador Gennady Kuzmin protested that it was a question for the Human Rights Council in Geneva, not the Security Council, which is charged with ensuring international peace and security.\nHe demanded a procedural vote on whether the meeting should be held.\nTo proceed, at least nine of the 15 council members had to vote \"yes,\" but only eight did so. Four countries voted \"no\" — Russia, China, Bolivia and Kazakhstan — while the three African countries, Ethiopia, Ivory Coast and Equitorial Guinea abstained.\nLongtime U.N. observers said it was exceedingly rare for a scheduled council meeting to be halted by a procedural vote.\nFrance's U.N. Ambassador Francois Delattre criticized Russia for refusing any discussion of human rights in the Security Council, when rights violations in Syria \"are at their very peak.\"\nBritain's deputy U.N. ambassador Jonathan Allen said Russia \"doesn't want the truth of ... the appalling human rights abuses taking place.\"\nBut he said: \"We mustn't let them silence us.\"",
    "source_domain": "abcnews.go.com",
    "title": "UN rights chief: Syria siege involved 'war crimes'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/rights-chief-syria-siege-involved-war-crimes-53861927"
}