{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:50:01+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "President Donald Trump is warning that if Iran restarts its nuclear program it \"will have bigger problems than they have ever had before.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrump-warns-iran-restarting-nuke-program-54692159.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_vod_orig_trump_iran_deal_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump warns Iran against restarting nuke program\nWe will be talking about a lot of different subjects but the Iran deal will be one of them were yeah yeah. We're going to be talking about it Wilson and enough people know my views on the random it was a terrible deal should have never ever been made we could've made a good deal or reasonable deal. They rent it was a terrible deal we paid a 150 billion dollars we gave one point eight billion in cash. That's actual cash. Barrels of cash. It's in saying it's ridiculous it should have never been made. But we will be talked it about it. Brand new is an important issue we'll discuss about that. Bids we have to take it as a part of rather be here. Which has security in fuel or return and we have certain situation. We have a common militiamen then in Iraq. We have festivities he'd be preserved for all eyes and the ration. And what we want to do is to contain Iran and the presence of agents and decent viewing it's part of this book brought it. Wherever there's probably Yemen Syria no matter where you haven't. Iran is behind it and now unfortunately Russia is getting more and more involved. The book Iran seems to be behind everything where there's a problem. And you just have to take a look you look at what's happening you look at the fighters. A rent is just always there and we're not going to allow certain things to happen that are happening and the Iran deal is a disaster. We will find out he'll find out about that. Won't be so easy for them to restart this cannot get a B restarting anything they restarted take an epic problems bigger than they've ever had before. And you can market cap. They restart there nuclear program. They will have bigger problems than they have ever had before thank you very much everybody.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump warns Iran against restarting nuke program",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trump-warns-iran-restarting-nuke-program-54692159"
}