{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 02:56:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Floyd Mayweather remains heavy favorite over Conor McGregor",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ffloyd-mayweather-remains-heavy-favorite-conor-mcgregor%2Fstory%3Fid%3D48047323.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170614_BOX_Rovell_on_fight_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's official: Boxing champion Floyd Mayweather will come out of retirement to face UFC star Conor McGregor in a fight that has already attracted big bets in Las Vegas.\nThe fight will be held Aug. 26 in Las Vegas.\nMayweather is currently a -1,100 favorite at the Westgate SuperBook, with McGregor paying back 700.\nThe Westgate posted odds on the fight in February, with Mayweather opening as a -2,500 favorite. The early action was almost all on the underdog McGregor, driving the price down on Mayweather to as low as -800.\nOn May 30, the Westgate took a $50,000 bet on Mayweather at -800, two weeks before the fight was made official. That bet would net a $6,250 profit with a Mayweather win.\nAs of Tuesday afternoon, 92 percent of the bets placed on the fight at the Westgate were on McGregor, including multiple $1,000 bets.\n\"There's going to be a lot of McGregor support,\" said Westgate assistant manager Jeff Sherman, who oversees the boxing odds. \"A lot of tickets, a lot of probably $20 bets, $100 bets that might keep the price down. But I know you're going to see, once the fight is officially announced, larger wagers come in and support Mayweather.\"\nLas Vegas sportsbook operator CG Technology also had seen primarily McGregor money before the fight was announced.\n\"The ticket count is a lot [on McGregor] to three [on Mayweather],\" Jason Simbal, vice president of risk for CG Technology, told ESPN on Tuesday.\nBut in the first few hours after the fight was made official Wednesday, CG Technology took a $45,000 bet on Mayweather.\nThe fight had already generated close to $100,000 in betting handle at the SuperBook.\n\"Usually, you put these up in anticipating of a marquee event to try to draw some handle, but it's usually the smaller variety,\" Sherman said Tuesday. \"We've seen some dime wagers [$1,000] on McGregor and the support that we saw on Mayweather. There are people who are betting a little more than usual for a fight that hasn't been announced yet.\"\nMGM sportsbook managers found out the fight was official Wednesday afternoon by watching TV reports and began the process of putting up the odds for a fight they expect to be a massive betting event.\n\"It's going to be huge,\" MGM sportsbook manager Jeff Stoneback said. \"It may not bring in the money of the Pacquiao-Mayweather fight, but I think it will exceed that fight in number of tickets.\"?",
    "source_domain": "abcnews.go.com",
    "title": "Floyd Mayweather remains heavy favorite over Conor McGregor",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/floyd-mayweather-remains-heavy-favorite-conor-mcgregor/story?id=48047323"
}