{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:10:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Top EU economic powers warn US about tax plans",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ftop-eu-economies-warn-us-tax-plans-51719036.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_119d8ab5627b421b89b30e17a187ca96_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The European Union's top five economies are warning the United States that its massive tax overhaul could violate some of its international obligations and risks having \"a major distortive impact\" on trade.\nIn a letter to U.S. Secretary of the Treasury Steven Mnuchin, the finance ministers of Germany, France, Britain, Italy and Spain wrote they had \"significant concerns\" about three tax initiatives in particular.\nIn the letter, seen by The Associated Press, the five wrote that \"it is important that the U.S. government's rights over domestic tax policy be exercised in a way that adheres with international obligations to which it has signed-up.\"\nEU nations have been warily eyeing President Trump's domestic tax proposals as they made their way through congress and have long expressed fears they might hurt world trade and EU companies in particular.\n\"The inclusion of certain less conventional international tax provisions could contravene the U.S.'s double taxation treaties and may risk having a major distortive impact on international trade,\" the five wrote.\nThey specifically targeted the so-called Base Erosion and Anti-abuse Tax (or BEAT) Senate bill. This measure aims to combat what is called base erosion and profit shifting, the practice by some multinationals to avoid tax by exploiting mismatches in countries' tax rules to artificially report their profits in countries with low or no taxes.\nThe finance ministers lauded the measure's aim to ensure companies pay their fair share in taxes to the U.S. But they said that under the current plans, the measures would also hurt genuine commercial deals. In the financial sector in particular, \"the provision appears to have the potential of being extremely harmful for international banking and insurance business.\"\nThey said it \"may lead to significant tax charges and may harmfully distort international financial markets.\"\nThe EU's 28 finance ministers had already expressed concern about the U.S. plans during a meeting last week, but now its five biggest economies have gone ahead with their own warning.\nIn Washington, Republicans are upbeat about finalizing the tax bill from the House and Senate versions for Trump's first major legislative accomplishment in nearly 11 months in office.\nTrump has set a Christmas deadline for signing the bill into law, giving lawmakers named to a special conference committee two weeks to iron out major differences in the House and Senate versions of the legislation. The conference committee has scheduled its first formal meeting for Wednesday.\nBoth measures would cut taxes by about $1.5 trillion over the next decade while adding billions to the $20 trillion deficit, combining steep tax cuts for corporations with more modest reductions for most individuals. Together, the changes would amount to the biggest overhaul of the U.S. tax system in 30 years, touching every corner of society.",
    "source_domain": "abcnews.go.com",
    "title": "Top EU economic powers warn US about tax plans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/top-eu-economies-warn-us-tax-plans-51719036"
}