{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 15:19:45+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The White House now says it expects the June summit between North Korea and the U.S. to take place as planned.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Ftop-north-korea-official-travels-us-55527646.json",
    "image_url": "https://s.abcnews.com/images/GMA/180530_gma_moran2_0710_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Top North Korea official travels to US\nrobin. No new T in that again off again summit with north korea.thwhite housow say it's ctthe summio take. A top Korean official is laying the groundwork and Terry M is tracking all the back and foh. Good morning, Terry. Reporter:d morning. This morning a flurry O diplomatic activity takinglace across the globe a officials inthe U.S. And North Korea a South Korea all a scrambling toe this summit racing againse clock. It was just six days ago, remember, that president trump called the W Thi off but nowhite house press secretary Sarah Sanders telling them we expect to take place. It could take place ached on June 12th or at later date and today Kim yng ol will plan it. U.S. And north Korean oials are planning security and other logistics. So what we' seeing is two leader who want to talk. Trump and kim.whe their top aides and cia, some of whom are eplykeptical on bothid they're scrambling T lay out an agenda foreace that's actually achievability. It is high stakes stuff. Soy tuned. Beat me to it. Was going to say that. Stay tuned. To that flooding emergency.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Top North Korea official travels to US",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/top-north-korea-official-travels-us-55527646"
}