{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 19:43:58+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "AP-NORC Poll: Just 24 percent say US heading right direction",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fap-poll-24-percent-us-heading-direction-50331005.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_6fccfb5e15164abe8b1e155d54f03965_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Just 24 percent of Americans believe the country is heading in the right direction after a tumultuous stretch for President Donald Trump that included the threat of war with North Korea, stormy complaints about hurricane relief and Trump's equivocating about white supremacists. That's a 10-point drop since June, according to a poll from The Associated Press-NORC Center for Public Affairs Research.\nThe decline in optimism about the nation's trajectory is particularly pronounced among Republicans. In June, 60 percent of Republicans said the country was headed in the right direction; now it's just 44 percent.\nThe broader picture for the president is grim, too. Nearly 70 percent of Americans say Trump isn't level-headed, and majorities say he's not honest or a strong leader. More than 60 percent disapprove of how he is handling race relations, foreign policy and immigration, among other issues.\nOverall, 67 percent of Americans disapprove of the job Trump is doing in office, including about one-third of Republicans.\nTracy Huelsman, a 40-year-old from Louisville, Kentucky, is among them. A self-described moderate Republican, Huelsman said she's particularly concerned about the \"divisiveness\" she feels the president promotes on social media.\n\"It's scary in 2017 that we are in what seems like a worse place in terms of division,\" said Huelsman, who did not vote for Trump in last year's election.\nThe assessments come after a turbulent summer for Trump that included a major White House shake-up, bringing the departure of his chief of staff, top strategist and press secretary. While the installment of retired Marine Gen. John Kelly as chief of staff has ushered in more day-to-day order in the West Wing, the president has still stirred up numerous controversies, including when he blamed \"both sides\" for the clashes between white supremacists and counter-protesters in Charlottesville, Virginia.\nTrump has also raised the specter of a military conflict with North Korea over its nuclear provocations. He's derided North Korea's leader, Kim Jong Un, as \"rocket man,\" including during a speech at the United Nations, and has downplayed the prospects that diplomatic negotiations with Kim could yield results.\nDespite his electoral success, Trump struggled as both a candidate and now as president to broaden his base of support beyond his ardent supporters. The loyalty of his core backers has been enough to keep Republican lawmakers largely in line, but party operatives are closely watching Trump's support among GOP and independent voters ahead of next year's midterm elections, when the balance of power in Congress will be at stake.\nTo be sure, lawmakers have their own problems to worry about. Americans have even less esteem for Congress than Trump, with just 18 percent saying they approve of the job being done by the House and the Senate.\nRepublicans took another hit last month when they failed — for a second time this year — to pass an overhaul of the nation's health care law. GOP leaders tried to rush votes on the complicated legislation, leaving many voters unsure of what was in the package.\n\"They never seemed to present a bill to people that you could actually look at the details of and the pluses and minuses of it,\" said Dennis Cronin, a 67-year-old independent from Wenham, Massachusetts.\nThe GOP failure on health care has irritated Trump, who promised voters that repealing \"Obamacare\" would be easy. Americans aren't happy with his progress on health care either; 68 percent disapprove of his handling of the issue.\nOf all the issues surveyed by the AP-NORC poll, the president performs slightly better on the economy. But even there, 56 percent disapprove of the job he's doing and just 42 percent say they approve.\nOn Friday, the Labor Department announced that the U.S. shed 33,000 jobs in September because of Hurricanes Harvey and Irma, which closed thousands of businesses in Texas and Florida and forced widespread evacuations. It marked the first monthly hiring drop in nearly seven years.\nNinety-two percent of Democrats and 69 percent of independents say Trump understands the problems of people like them not very or not at all well. Even among Republicans, only 42 percent say he understands them very well, while 32 percent say he does moderately well.\nThe AP-NORC poll of 1,150 adults was conducted Sept. 28-Oct. 2 using a sample drawn from NORC's probability-based AmeriSpeak panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 4.1 percentage points.\nRespondents were first selected randomly using address-based sampling methods, and later interviewed online or by phone.\n———\nOnline:\nAP-NORC Center: http://www.apnorc.org/\n———\nFollow Julie Pace at http://twitter.com/jpaceDC and Emily Swanson at http://twitter.com/el—swan",
    "source_domain": "abcnews.go.com",
    "title": "AP-NORC Poll: Just 24 percent say US heading right direction",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/ap-poll-24-percent-us-heading-direction-50331005"
}