{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 07:08:12+00:00",
    "date_modify": null,
    "date_publish": "2018-02-04 00:00:00",
    "description": "Despite struggles, Cavs official says team 'not firing our head coach'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fstruggles-cavs-official-team-firing-head-coach%2Fstory%3Fid%3D52824947.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0203/dm_180203_ncb_bilas_on_trae_young/dm_180203_ncb_bilas_on_trae_young_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Despite losing 12 of its last 18 games -- including a dispirited 120-88 loss to visiting Houston on Saturday night -- Cleveland Cavaliers coach Tyronn Lue's job is safe, league sources told ESPN.\n\"We are not firing our head coach,\" one Cavaliers official told ESPN late Saturday night.\nThe Cavaliers are planning to continue pursuing deals to improve the floundering team between now and Thursday's NBA trade deadline, league sources said.\nThe Cavaliers, including LeBron James, were listless in the loss to the Rockets on national television Saturday night. Cleveland has had a series of blowout losses to drop to 30-21 -- a half-game ahead of Washington in third place in the Eastern Conference and only 1.5 games ahead of Indiana.\nLue has expressed frustration with the team, describing the Cavaliers to ESPN's Lisa Salters at halftime of Saturday's loss as \"soft, weak, no physicality, no toughness, no grit.\"\nCleveland has lost All-Star forward Kevin Love for two months with a fractured left hand, is failing to defend and is fighting internal disconnects as it tries to restore itself to Eastern Conference championship contention.\nLue was promoted to head coach halfway through the 2015-16 NBA season and led the Cavaliers to an NBA Finals victory over Golden State. The Cavaliers lost in the Finals to the Warriors last season.\nLue is 29-10 (.744) in his two trips to the NBA playoffs as Cavaliers coach.",
    "source_domain": "abcnews.go.com",
    "title": "Despite struggles, Cavs official says team 'not firing our head coach'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/struggles-cavs-official-team-firing-head-coach/story?id=52824947"
}