{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 16:50:13+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Feurope-suffer-collateral-damage-us-china-trade-war-56365081.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_0541c4b2ef38422e8ff6bbf2ecb10130_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nEuropean businesses are unsettled as they watch the U.S. and China collide over trade. And for good reason: the nascent global trade war could represent the biggest single threat to the economic upswing that has helped the region get past its financial crisis.\nIn theory, some European companies could benefit, jumping into market niches if Chinese businesses are kept out of the U.S. market. But that would only be a few companies or sectors.\nWhen your entire economy is heavily dependent on trade, an overall slowdown in global commerce caused by tit-for-tat import taxes provokes fear and undermines confidence.\nAnd that's just what's happening in Europe. By one measure, business confidence has fallen in six of the past seven months in Germany, where exports are almost half of annual economic output.\n\"It's worth all our efforts to defuse this conflict, so it doesn't become a war,\" German Chancellor Angela Merkel said Wednesday.\nThe U.S. is due to put tariffs on $34 billion worth of Chinese goods on Friday. The Chinese will respond with tariffs on an equivalent value of U.S. products such as soybeans, seafood and crude oil.\nAmid all this, Europe has its own trade dispute with the U.S. After the U.S. put tariffs on steel and aluminum from many allies, including the European Union, the 28-country bloc responded with import taxes on some $3.25 billion of U.S. goods. The Trump administration is also studying the option of putting tariffs on cars, which would significantly escalate the confrontation.\nThe head of the EU's executive, Jean-Claude Juncker, will head to Washington in late July to try to personally persuade Trump against further measures targeting Europe.\nThe disputes over trade threaten to spoil the good times for Europe's economy.\nGrowth last year was the strongest in a decade, since before the global financial crisis. While that has eased in recent quarters, the economy is still strong enough to create jobs. The number of unemployed fell by 125,000 in May, leaving unemployment in the 19 countries that use the euro at 8.4 percent, the lowest since 2008 and down from a high of 12.1 percent in 2013.\n\"Trade tensions stoked by U.S. President Donald Trump are clouding the economic outlook in Europe,\" wrote analysts at Berenberg bank in London. They rated the trade risk ahead of troubles from Italy's heavy debt load or faster than expected interest rate increases from the U.S. Federal Reserve.\nMany European companies would suffer because they both produce and sell goods in the U.S. and China, the world's biggest economies.\nFor example, tariffs that China is expected to impose Friday on U.S.-made autos would hit German carmakers Daimler and BMW since they both make vehicles in the United States and export them to China.\nDaimler has already lowered its outlook for profits, citing higher than expected costs from the new tariffs. BMW warned in a letter to Commerce Secretary Wilbur Ross on Friday that tariffs would make it harder for it to sell in China the vehicles it builds at its factory in Spartanburg, South Carolina, \"potentially leading to a strongly reduced export volumes and negative effects on investment and employment in the United States.\"\nLast year, BMW exported 272,000 vehicles from the Spartanburg plant, more than half its total production. Of those, 81,000 — worth $2.37 billion — went to China. BMW says its exports reduced the U.S. trade deficit by around $1 billion.\nBy themselves, the tariffs that take effect Friday won't immediately have a dramatic impact on global trade. The fear is that retaliation will spiral, hitting the total amount of global commerce.\nEven if the overall effect is to harm growth, there could be benefits for some European companies and sectors. Economists Alicia Garcia Herrero and Jianwei Xu at the French bank Natixis say that European makers of cars, aircraft, chemicals, computer chips and factory machinery could in theory snare market share by substituting for Chinese or American products in the two markets. But that's only if Europe's own trade dispute with the U.S. does not escalate — a big if.\nEurope is waiting to see whether the Trump administration will go ahead separately with tariffs on auto imports. European companies like BMW, Daimler's Mercedes-Benz, Volkswagen's Porsche and Audi divisions, and Fiat Chrysler send $46.6 billion worth of vehicles every year to the U.S. Some 13.3 million people, or 6.1 percent of the employed population of the EU, work in the automotive sector, according to the European Automobile Manufacturers Association.\n\"Europe cannot win anything\" on an overall basis \"for one obvious reason: we are net exporters,\" said Garcia Herrero, chief economist for Asia Pacific at Natixis and a senior fellow at European research institute Bruegel. \"But we should not understate the view that some sectors could get something out of a U.S.-China trade war.\"\nAmid the brewing conflict, China has sought to get Europe on its side, putting on a diplomatic charm offensive during visits by Merkel and French Prime Minister Edouard Philippe. The EU and China agreed last month to deepen commercial ties and support trade rules. But the EU remains a close, longtime ally of the U.S. on a range of issues, despite the current tensions with the Trump administration.\nOne negative outcome for Europe, Herrero said, would be if Trump can push the Chinese into a trade agreement aimed at reducing the U.S. trade deficit. The additional U.S. goods to China could come at the expense of European competitors.\n\"If China concedes to the U.S. proposed agreement, the whole situation faced by the EU would be much tougher,\" she and Xu wrote in a research note. \"For China to massively reduce its trade surplus with the U.S., it has to in some way substitute its imports away from the EU to the U.S., which would have a significant negative impact on the EU producers.\"\n———\nComplete coverage: https://apnews.com/tag/Globaltrade",
    "source_domain": "abcnews.go.com",
    "title": "Europe could suffer collateral damage in US-China trade war",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/europe-suffer-collateral-damage-us-china-trade-war-56365081"
}