{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:02:18+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "US stocks swoon, sending Dow down more than 650 points",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ftech-companies-lead-stocks-sharply-lower-early-trading-52794624.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_3672f08274ac4845af2969ce71698a85_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. stocks slumped Friday, pulling down the Dow Jones industrial average by more than 650 points and handing the market its worst week in two years.\nTechnology, banks and energy stocks accounted for much of the broad slide. Several major companies, including Exxon Mobil and Google's parent company, Alphabet, sank after reporting weak earnings.\nFears of rising inflation sent bond yields higher and contributed to the stock market swoon after the government reported that wages grew last month at the fastest pace in eight years.\nThe sharp drop follows a long period of unprecedented calm in the market. Stocks haven't had a pullback of 10 percent or more in two years, and hit their latest record highs just one week ago.\n\"We've enjoyed low interest rates for so long, we're having to deal with a little bit higher rates now, so the market is trying to figure out what that could mean for inflation,\" said Darrell Cronk, head of the Wells Fargo Investment Institute.\nThe increase in bond yields hurts stocks in two ways: it makes it more expensive for companies to borrow money, and it also makes bonds more appealing to investors than riskier assets such as stocks.\nThe Standard & Poor's 500 index fell 59.85 points, or 2.1 percent, to 2,762.13. That's the biggest loss for the benchmark index since September 2016. The S&P 500 has lost 3.9 percent since hitting a record high a week ago.\nThe Dow Jones industrial average lost 665.75 points, or 2.4 percent, to 25,520.96. The Nasdaq slid 144.92 points, or 2 percent, to 7,240.95. The Russell 2000 index of smaller-company stocks gave up 32.59 points, or 2.1 percent, to 1,547.27.\nWhile interest rates are still low by historical standards, meaning borrowing is still relatively cheap for businesses and people, they've been rising more swiftly, and that's what has markets on edge.\n\"The pace of rate increases is more important than the level,\" said Nate Thooft, senior portfolio manager at Manulife Asset Management.\nThe increase in rates has been driven by the prospect of stronger economic growth, and higher inflation, in the U.S. and abroad.\nBond prices declined again Friday, pushing yields higher. The yield on the 10-year Treasury note, a benchmark for interest rates on many kinds of loans, including mortgages, climbed to 2.83 percent, the highest level in roughly four years. The rate was at 2.41 percent four weeks ago and 2.66 percent on Monday.\n\"Once we started going north of 2.5 percent, and you put that together with an overbought market, it had the ingredients of a sell-off, especially since January was so strong,\" said Jeff Zipper, regional investment strategist at U.S. Bank Private Wealth Management.\nThe S&P 500, which many index funds track, soared 5.6 percent in January, its biggest monthly gain since March 2016.\nThe expectation among investors has long been for a gradual rise in interest rates, as the Federal Reserve slowly pulls back from the stimulus that it implemented for the economy amid the Great Recession. But if rates rise more quickly than expected, it could upset markets.\nThe key concern is that the Fed will respond to higher inflation by raising its key interest rate more quickly than expected. The government's latest job and wage data stoked those concerns Friday.\nU.S. employers added a robust 200,000 jobs in January, slightly above market expectations for an 185,000 increase. Meanwhile wages rose sharply, suggesting employers are competing more fiercely for workers. The figures point to an economy on strong footing even in its ninth year of expansion, fueled by global economic growth and healthy consumer spending at home.\nThat's good news for Main Street USA, but not for Wall Street. Investors fear the pickup in hourly wages, along with a recent uptick in inflation, may make it more likely that the Fed will raise short-term interest rates more quickly in the coming months. Some economists were predicting Friday that the central bank will raise its benchmark rate four times this year, rather than the three times most previously expected.\n\"With financial conditions continuing to ease and core price inflation also starting to pick up, we expect this will persuade the Fed to hike rates four times this year,\" Andrew Hunter, an economist with Capital Economics, wrote in a published note Friday.\nThe market slide may have been overdue, particularly after the strong start for stocks this year where the S&P 500 had its best January in two decades.\nThe global economy is still strong, corporate profits and sales have been better than expected this reporting season and buyers for stocks still remain, all reasons to be optimistic about stocks, said Nate Thooft, senior portfolio manager at Manulife Asset Management.\n\"It's appealing, these 2 to 3 percent pullbacks,\" said Thooft, who had been trimming some of his stock holdings after the market's big January gains. \"We look at this and say, 'Maybe it's your first day to buy a little bit.'\"",
    "source_domain": "abcnews.go.com",
    "title": "US stocks swoon, sending Dow down more than 650 points",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/tech-companies-lead-stocks-sharply-lower-early-trading-52794624"
}