{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:21:09+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The Latest: Opponents queue to submit petitions on vote",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-eu-urges-turkey-probe-referendum-vote-46857835.json",
    "image_url": "http://abcnews.go.com/International/wireStory/latest-eu-urges-turkey-probe-referendum-vote-46857835",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on Turkey's referendum on presidential powers (all times local):\n3:05 p.m.\nHundreds of people are queuing in front of Turkey's election board to submit petitions requesting that the electoral authority reverse a controversial decision during Sunday's referendum to accept ballots without official stamps.\nIn their petitions Tuesday, the residents of Ankara said the decision and other reported irregularities were in open violation of the law.\nSimilar queues are also reported in front of an election board office in Istanbul.\nThe queues formed as the main opposition party was scheduled to formally request that the electoral authority annul the referendum over the ballots lacking the official stamp.\nMonitors from the Organization for Security and Cooperation in Europe said the decision undermined important election safeguards.\n———\n3 p.m.\nThe head of Germany's main industrial group says the referendum in Turkey could hurt economic ties with European countries.\nDieter Kempf, president of the BDI lobby group, says the result of the vote \"is worrying\" and suggests Turkey is moving further away from European values.\nGermany is Turkey's most important trading partner, with a total volume of 37 billion euros ($39 billion), and one of its largest sources of foreign investment.\nKempf said Tuesday that Turkey \"needs a strong business partner in Europe that supports the further economic development of the country.\"\nHe urged Turkish President Recep Tayyip Erdogan \"to ensure that confidence among European partners doesn't erode further, in the economic interest of his country.\"\n———\n2:55 p.m.\nTurkey's main opposition party has slammed the country's electoral board, accusing it of bias and favoring the ruling party.\nKemal Kilicdaroglu, the leader of the Republican People's Party, or CHP, made the comments during a speech to his lawmakers Tuesday, challenging the outcome of the referendum on constitutional amendments.\n\"It is clear that the High Electoral Board is not receiving its power from the people, the law or the constitution but rather from a specific center, a specific political authority,\" he said. He accused the board of \"changing the rules midgame.\"\nOpposition parties are filing their objections to the electoral board Tuesday for the decision to count as valid ballots that did not bear an official stamp and other alleged irregularities.\nCHP vice chairman Erdal Aksunger said the party expects the board \"to eliminate fraud and cancel the referendum.\"\n———\n2 p.m.\nThe European Union says that if Turkey moves to reinstate the death penalty it would dash any hope that it could join the bloc.\nEU Commission spokesman Margaritis Schinas said on Tuesday that if Turkish President Recep Tayyip Erdogan moved \"from rhetoric to action on the issue of the death penalty (it) would be clear signal that Turkey does not want to be a member of the European family.\"\nHe said that the death penalty is more than a red line. \"This is the reddest of all red lines.\"\nOn Monday, Erdogan renewed suggestions that Turkey could hold referendums on its bid to join the European Union and on reinstating the death penalty.\n———\n1:30 p.m.\nThe European Union is calling on the Turkish authorities to launch \"transparent investigations\" into \"alleged irregularities\" during last weekend's referendum on increased powers for the country's presidency.\nInternational election observers and opposition parties have reported numerous voting irregularities during the vote which President Recep Tayyip Erdogan won by a narrow margin.\nEU Commission spokesman Margaritis Schinas said the EU was encouraging \"Turkey to move closer to the European Union again, and not to move even further and faster away from us.\"\nTurkey's prime minister on Tuesday called on the opposition to respect the result of a referendum that will give sweeping new powers to the office of the president.\n———\n12 p.m.\nTurkey's prime minister has called on the opposition to respect the result of a referendum that will expand the powers of the office of the president.\nIn an address to legislators from his ruling party on Tuesday, Binali Yildirim said the people had voted to switch from a parliamentary to a presidential system, adding: the \"opposition should not speak after the people have spoken.\"\nAn unofficial tally carried by the country's state-run news agency gave President Recep Tayyip Erdogan's \"yes\" camp a narrow win.\nOpposition parties called for the vote to be annulled because of a series of irregularities, particularly an electoral board decision to accept ballots that didn't bear official stamps, as required by Turkish law.\nInternational monitors said the move undermined safeguards against fraud.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Opponents queue to submit petitions on vote",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-eu-urges-turkey-probe-referendum-vote-46857835"
}