{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 20:45:49+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "The Latest: Syria denies US allegations on chemical weapons",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-turkey-expand-operation-syrian-kurds-52815940.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_9ec60a55d7d54145bebbe4379dc704c9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the situation in Syria (all times local):\n9:15 p.m.\nSyria's Foreign Ministry has dismissed as \"null and void\" U.S. accusations that President Bashar Assad's government is producing and using \"new kinds of weapons\" to deliver deadly chemicals despite committing to abolish its program in 2013.\nThe ministry said in a statement on Saturday that Syria confirms the American statements are \"nothing more than lies\" based on the accounts of what the Trump administration called its partners on ground.\nSyria also says that reports by Western-backed media outlets about Damascus using chemical weapons \"is a new version of U.S. and Western desperate intentions to create\" an excuses to attack Syria.\nPresident Donald Trump has not ruled out additional military action to deter attacks or punish Assad, administration officials said earlier this week, although they did not suggest any action was imminent.\n———\n8:40 p.m.\nTurkey says eight of its soldiers were killed near the Syrian Kurdish enclave of Afrin in what has been the deadliest day so far since Ankara's operation there started.\nIn a statement late on Saturday, the Turkish military said five soldiers were killed after their tank in Syria came under attack near Afrin. It says the soldiers could not be saved despite all attempts.\nEarlier in the day, three Turkish soldiers were reported killed in the offensive. One was killed in the area of the tank attack, another in northern Syria and the third on the Turkish side of the border in what Ankara said was an attack by Syrian Kurdish militiamen.\nThe total death toll for Turkish troops since the operation started on Jan. 20 now stands at 13.\nThe statement says a Syrian Kurdish militia and the Islamic State group carried out the attack, without providing details.\nTurkey launched the incursion into Afrin to rout the U.S.-backed Syrian Kurdish militia, which it considers to be a terrorist organization and an extension of Kurdish insurgents fighting within Turkey.\n———\n7:35 p.m.\nThe Russian Defense Ministry has confirmed that a Russian Su-25 warplane crashed in Syria and that the pilot was killed in fighting on the ground.\nThe report on the ministry's Zvezda TV says preliminary information indicates the plane was shot down in Idlib province on Saturday by a portable ground-to-air missile.\nThe report says the pilot ejected before the crash, but then was killed in fighting with \"terrorists.\" It says the area is under the control of al-Qaida's branch in Syria.\n———\n7:30 p.m.\nA leading international rights group has accused Turkish border guards of shooting at Syrian refugees trying to cross into Turkey and turning back others after they crossed into Turkey.\nHuman Rights Watch also says in a report published on Saturday that it documented such cases from May until December last year. HRW also says Turkish guards shot at refugees while they were still in Syria, killing 10 people, including a child.\nHRW also points to accounts of abuse by detained asylum seekers, including their forced return to Syria and withholding medical care.\nTurkey's presidential spokesman says the allegations will be investigated. Ibrahim Kalin said it was \"unlikely\" Turkish soldiers would shoot at people and pointed to Turkey's open-door policy.\nTurkey is hosting nearly 3.5 million Syrians who have fled the ongoing civil war.\n———\n6:20 p.m.\nA Syrian monitoring group and a Syrian militant say a Russian pilot who ejected from his fighter jet after it was shot down in northwestern Syria was killed after landing alive on the ground.\nThe Britain-based Syrian Observatory for Human Rights said the Russian pilot is dead but had no immediate further details.\nA Syrian militant in the area told The Associated Press that the Russian pilot was shot and killed when he resisted capture by opening fire from his pistol on the militants who tried to capture him alive.\nMoscow has not confirmed the downing of its plane or the killing of a pilot.\nThe militant refused to be identified by his real name because was not authorized to speak to the media.\nA video circulating on social media shows a dead man with a bloodied face as bearded gunmen stood around him. One of them shouts: \"He is Russian.\"\nThe authenticity of the video could not be independently confirmed but it corresponds to events reported by the AP.\n———\n5:45 p.m.\nThe Turkish military says two of its soldiers have been killed in Syria and a third was killed on the Turkish side of the border in an attack by Syrian Kurdish militiamen.\nThe military says Saturday's deaths were related to Turkey's operation against the Syrian Kurdish-held enclave of Afrin, codenamed Olive Branch. One of the soldiers was killed when a Turkish tank was hit in Afrin.\nA total of eight Turkish soldiers and at least 24 allied Syrian opposition fighters have died so far in Ankara's offensive, which started on Jan. 20.\nThe Turkish operation aims to clear Afrin of the U.S.-backed Syrian Kurdish militia, known as the People's Protection Units or YPG, which Turkey considers to be a terrorist group and an extension of the Kurdish insurgency within its borders.\nAnkara also says it is fighting the Islamic State group in the area.\n———\n4:50 p.m.\nSyrian opposition activists say rebels have shot down a warplane in the country's northwest where government forces and their allies are advancing under the cover of intense airstrikes.\nThe Britain-based Syrian Observatory for Human Rights says the warplane was downed on Saturday afternoon near the rebel-held town of Sarqeb, which Syrian troops have been trying to reach under the cover of Russian airstrikes.\nThe Observatory's chief Rami Abdurrahman says it's possible the warplane could be Russian. He added that the pilot ejected and landed alive on the ground.\nThe opposition's Aleppo Media Center says it was a Russian-made Su-25 but did not say whether it was Russian. There was no immediate word from Moscow.\n———\n4:30 p.m.\nTurkish presidential spokesman says Turkey will not tolerate the presence of a Syrian Kurdish militia \"anywhere\" along its southern border, hinting that Ankara might expand its military operation underway in the Syrian enclave of Afrin eastward.\nThe spokesman, Ibrahim Kalin, said on Saturday that Turkey's first demand is to see the Syrian Kurdish militia — the People's Protection Units or YPG — move east of the Euphrates River and leave the town of Manbij, where American troops backing the Syrian Kurdish fighters are stationed.\nTurkey launched an incursion into Syria on Jan. 20 and is currently fighting the YPG in the northwestern enclave of Afrin. It considers the YPG a \"terrorist group\" and an extension of Kurdish rebels inside Turkey.\nKalin called on the United States to \"disengage\" from the YPG and said Turkey will continue communications with \"our American allies to avoid any confrontation.\"\nTurkey shares a 911-kilometer border with Syria. The YPG controls much of the territory along the border and an uninterrupted strip from Manbij to the Iraqi border.\n———\n2:20 p.m.\nA Syrian monitoring group and the media arm of al-Qaida-linked militants are reporting intense airstrikes on a rebel-held stronghold in Syria's northwest.\nThe Britain-based Syrian Observatory for Human Rights reported more than 35 airstrikes on Saraqeb since late Friday, adding that many of its residents are fleeing.\nThe Ibaa News Agency of the al-Qaida-linked Levant Liberation Committee, said Russian and Syrian warplanes and helicopter gunships have been pounding Saraqeb and Tel Mardeekh village in Idlib province since the early hours of Saturday.\nSyrian government forces and their allies pushed into Idlib, an opposition stronghold, inching closer to a key highway that connects Syria's two largest cities, Damascus and Aleppo.\nThe U.N. says more than 270,000 have been displaced in Idlib because of the government onslaught since Dec. 15.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Syria denies US allegations on chemical weapons",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-turkey-expand-operation-syrian-kurds-52815940"
}