{
    "authors": [
        "Abc News",
        "More Erin"
    ],
    "date_download": "2018-05-30 19:55:56+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "\"If ever faced with an emergency situation, we want to help you get the help you need,\" CEO Dana Khosrowshahi wrote in a blog post at the time.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fuber-rolls-panic-button%2Fstory%3Fid%3D55532051.json",
    "image_url": "https://s.abcnews.com/images/US/uber-app-phone-gty-jc-180411_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Uber's new panic button has hit phones nationwide.\nInterested in Uber? Add Uber as an interest to stay up to date on the latest Uber news, video, and analysis from ABC News. Add Interest\nAnnounced in April in the wake of a spate of alleged sexual assaults, the panic button allows riders to dial 911 directly from the Uber home screen.\n\"While no one should ever have to call 911 when using Uber, no form of transportation is 100 percent free of incidents,\" CEO Dana Khosrowshahi wrote in a blog post at the time. \"If ever faced with an emergency situation, we want to help you get the help you need.\"\nIn most cities, the app will display the rider's location, which updates in real time, so they can relay their location to 911 operators.\nUBER\nIn a handful of cities participating in a pilot program — Denver, Charleston, Chattanooga, Naples, Tri-Cities, Louisville, and, in the next few days, Nashville — the app will automatically transmit location information and vehicle details, including color, make, model, year, and licence plate number, to emergency dispatchers.\n\"Every second counts in an emergency,\" Sachin Kansal, Uber's Director of Safety Products, said in a statement to ABC. \"We want to make sure our users get help quickly with accurate information if faced with an emergency situation.\"",
    "source_domain": "abcnews.go.com",
    "title": "Uber rolls out panic button",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/uber-rolls-panic-button/story?id=55532051"
}