{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:23:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Sitting LeBron makes perfect sense",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsitting-lebron-makes-perfect-sense%2Fstory%3Fid%3D45498361.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r175501_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "IT IS MID-FEBRUARY and LeBron James, a man who has labored through six straight trips to the NBA Finals, is leading the league in minutes per game.\nA breather is clearly in order -- and was on order on Feb. 8, when coach Tyronn Lue had announced that James, Kyrie Irving and Kevin Love were \"probably\" going to take the night off on the second game of a back-to-back at? Oklahoma City. But then, after a four-hour overnight flight from Indiana ahead of the nationally televised game, the Cleveland Cavaliers had a sudden change of plans. Minutes before tipoff, Lue announced the trio would give it a go.\nThe coach offered a rationale that was less than scientific: \"All three guys say they feel pretty good, and we got a good thing going, so why not keep it going.\"\nIt turned out the Cavs couldn't get anything going. James shot 8-for-19 in the nine-point loss to the Thunder and missed two dunks, something so uncharacteristic, LeBron hadn't done it for almost eight years. Instead of getting the night off, James registered a whopping 41 minutes, a total that even Russell Westbrook had reached just three times this entire season; James had done it six times in the previous month alone.?Love hardly fared any better, going 5-12 from the field with no three-pointers while playing in his third game in four nights and coming off a back injury -- a workload that would seemingly come to haunt him less than a week later.\nIndeed, \"DNP-Rest\" is basically a new thing, and there's no getting around the fact that a lot of people find it offensive. Who wouldn't love to get out of work to ... rest? If Michael Jordan, Larry Bird or Magic Johnson ever did it, they at least had the decency to call it something that sounded like an injury.\nBut make no mistake: for James (and the Cavs), rest should be the top priority.\nIN FORMULA ONE, no one gets mad; of course the car needs pit stops for fuel and tires. NFL fans know that one game a week is sufficient; what kind of injury fests would we get if you asked them to play four times a week?\nBasketball is also played by humans with limits. But in this sport, the news that those humans need days off, like everyone, chafes against the tradition of an 82-game season -- even though that schedule eventually devours, through injury, virtually every single star the game has ever known.\nWe're learning that those stars play far better and get injured far less if they rest more. As a Utah School of Medicine study found, back-to-back road games -- the circumstance that James has been in twice this season -- yields 3.5 times more in-game injuries than those played at home. Once you know that, you have a new set of choices. James wants to be in top shape four months from now in the NBA Finals; lingering near the top of minutes categories in February is no favor to the Cavs' title chances.\nConsider a recent Cavs' road trip: Thursday, about 500 miles of flying to Brooklyn; Friday, play the Nets; Saturday, fly 2,500 miles to Phoenix; Sunday, play the Suns; Monday, 650 miles to Salt Lake City; Tuesday, play the Jazz and -- feeling the fatigue -- lose.\nAfter 37 minutes of action in the oxygen-depleted Salt Lake City air, icing his body to control inflammation and with hands-on treatment from the team's pit crew, LeBron James boarded the team flight only to learn the flight might not take off at all. There was a winter weather-based state of emergency in Oregon, and the Portland airport had been shut down earlier in the night. One option? Landing the plane in Seattle and making the three-hour drive south. And NBA rules prohibited going back to the hotel and trying again to fly tomorrow.\nThe clock read 3:30 a.m. ET when LeBron James finally felt the plane's thrust for takeoff.\nLAST SEASON, JAMES' longtime trainer and Cavs staffer Mike Mancias supplied Cavs players with a biometric tracking device called a WHOOP, and many began wearing them. How much sleep were they actually getting? How quickly did they fall asleep? How did LeBron's heart rate change when he was flying all over the country and losing sleep? What about time zones? The idea is that devices like the WHOOP will, in time, come to function like the sensors that tell Formula One racers when it's time for a pit stop.\n\"These athletes are a lot more cognizant now of, 'This is what I need to do to perform at a high level,'\" Mancias says. In other words, as the Cavs sat on the Salt Lake City tarmac, they only had to glance at their phone screens to understand the impact of their sleepless night.\nThe big lesson of the Cavs wearing the devices: Every hour of sleep proved crucial for their body's ability to recover and allow heart-rate levels to regulate the next day. That's not rocket science, but it's another variable to measure and know in real time.\nMancias said one Cavs player he won't name has learned to limit himself to one glass of wine at the team dinner -- because now his WHOOP shows him that every additional pour of vino destroys his sleep.\n\"It's two-fold,\" Mancias said. \"One is, alcohol can wreck the system. And two, if I'm having just one glass, I'm going to sleep at an earlier time. He said, 'OK, I can do this.'\"\nIt's worth remembering that these are professional competitors. Naturally, the numbers on the device began to shape their behavior, and it became a competition.\n\"You'll have somebody competing against themselves,\" Mancias said. \"As soon as dinner's over, some players say, 'Boom, I gotta go. You guys can hang out and talk shop all you want, but we're not solving the world's problems in one night. I'm going to bed.'\"\nWE ALL ACCEPT that when a car is out of gas, it can't race. Period. But with humans, the limits are fuzzier. Imagine if, when your Formula One car ran out of gas, you had the option to keep racing, but in doing so, instead of burning gas, you'd burn ... some other, unknowable, potentially crucial part of the car. Goodbye, spark plug. Say goodnight, gaskets. Lap after lap, things just start breaking down, sometimes in ways you only learn about years later.\nNBA players almost all get hurt, eventually. NBA players who play the heaviest minutes get hurt even more, and not just in ways that are immediately obvious.\nMancias said a lot of players are worried about heart health, knowing that a tremendous number of retired players have had fatal heart issues. Fourteen-year vet Sean Rooks, 46, died of a heart attack during the NBA Finals last season. Longtime NBA forward Anthony Mason died of a massive heart attack on Feb. 28, 2015, at the age of 48. In the 2015 calendar year, NBA veterans Moses Malone, Darryl Dawkins and Jack Haley all died at age 60 or younger due to heart-related ailments.\n\"That's No. 1 right there,\" Mancias said. \"We have to worry about these guys' health over the long term. ... Right now, we're seeing some stuff with retired players and sudden cardiac arrest. We want to see, what is the heart doing? What are the strains?\"\nThe NBA, as part of an agreement with the National Basketball Players Association in the new collective bargaining agreement, does not allow players to wear tracking devices in games, but, per the ratified document, the two parties \"will continue to discuss in good faith the use of wearables in games.\" James and the union's executive committee have agreed to work with the NBA to staff a wearables committee to work out key factors, such as who would have access to the sensitive health information that such devices would collect.\nPlayers and coaches know that for one player, 30 minutes of playing time takes a bigger toll than for another player: \"[Minutes] is one thing, but how hard are you playing? What are his heart rate numbers throughout that?\" Mancias said. \"And it could be different for a point guard to a center. With those numbers, we'd know what to do the next day, as far as recovery-wise and as far as workouts, treatment and therapy.\"\nIn the meantime, the key decision every top player faces every game is: What will the cost be -- in June, in retirement -- of playing in this depleted state? Losses, for one thing. Before the season started, Stanford researcher Cheri Mah worked with ESPN to identify \"Schedule Alert\" games that teams were likely to lose because of travel fatigue. (So far, the tired teams have lost 11 of 13 games, while going 4-9 against the spread.)\nData showing the value of rest to peak performance, injury prevention and long-term health is now undeniable. And players, in turn, are taking games off at historic levels. The frequency of DNP-Rests was at an all-time high last season, and it is on pace to almost double again this season. James himself has taken three games off to rest before this week -- each coming on the second night of a back-to-back on the road, where injury risk is shown to be higher. Big men such as DeMarcus Cousins, Blake Griffin and Marc Gasol are sitting out games, as are older champions, including Tony Parker, Dwyane Wade and Andrew Bogut. And increasingly -- and in keeping with the science -- so are young players. When 23-year-old Anthony Davis and 20-year-old D'Angelo Russell are taking DNP-Rests, the league has clearly gotten the memo.\nBut has LeBron?\nTHE CAVS WERE able to land in Portland, despite close to a foot of snow on the ground. Their heads hit pillows at about 4 a.m. local time (7 a.m. ET back in Cleveland). Given what we know about the impact of short sleep and long travel on the human body, this would have been a natural game for James to sit out.\nComplicating matters, though, was the fact that this was a nationally televised game on ESPN and that the game was taking place in Nike's backyard in Portland. If that weren't enough, Portland fans, who had waited seven months to see James in person, wouldn't get another opportunity to see the Cavs. This wasn't just any normal game. This was business.\nJames played -- and delivered one of his worst games of the season, tallying as many turnovers as made field goals (five). The Cavs would ultimately lose by 16 in what Lue called \"a scheduled loss\" on the calendar.\nToughing it out on the back-to-back might have had other costs, as well. Love, who missed two games in late December with left knee soreness, left the game in the first quarter with an apparent left leg injury and returned only to shoot 5-of-15 on the day.\nThere was no time to sulk. The champs had another flight to catch to Sacramento, California, where James played again, this time in a win, before heading off to the San Francisco Bay Area to sleepwalk through a famously bad loss to the Warriors. The Warriors pounced to a 7-0 lead and never let up, beating the Cavs by a resounding 35 points, while Love limped off the floor in the second quarter with a back injury.\nThe game was on national television. Although there were rumors some key Cavs might sit, they ended up playing in the name of having the team at \"full strength,\" and though the best players were on the court, exhaustion made a mockery of that idea. James shot a season-low 33 percent from the floor and registered six turnovers. Love would go on miss three games in the next three weeks due to back problems.\nFast forward to mid-February, when Love's body finally waved the white flag. After playing three games in four nights in three different cities, Love will miss six weeks to undergo a scope in his left knee -- the same leg that forced him to the locker room a month ago in the Portland back-to-back.\nThe road won't get easier for James, and he might feel more pressure to gut it out than he has all season. The Cavs are two games above .500 since Jan. 3, sporting a record that would be put them fourth in the West. And they're no lock to win the East. Over the past month, LeBron has averaged 39.1 minutes per game. Do that for 82 games and you're playing 3,200 minutes in a league in which it has been more than a decade since anyone has won a title after playing more than 3,000 minutes.\nTo be clear, it's hard to find someone who has personally invested more hours and dollars in their own well-being than James, who purchased and installed a cryotherapy chamber in his own home in 2015.\nWinning a title takes hard work. But a lot of that work comes in April, May and June. James might be the King, but it doesn't make sense to be redlining months before the June finish line.\nJust ask last season's Warriors.",
    "source_domain": "abcnews.go.com",
    "title": "Sitting LeBron makes perfect sense",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/sitting-lebron-makes-perfect-sense/story?id=45498361"
}