{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 08:50:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Recent developments surrounding the South China Sea",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frecent-developments-surrounding-south-china-sea-49200962.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_04540eb0e3724b2b8c4de0d9c4bfcae9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A look at recent developments in the South China Sea, where China is pitted against smaller neighbors in multiple disputes over islands, coral reefs and lagoons in waters crucial for global commerce and rich in fish and potential oil and gas reserves:\n———\nEDITOR'S NOTE: This is a weekly look at the latest developments in the South China Sea, the location of several territorial conflicts that have raised tensions in the region.\n———\nTAIWAN REPORTS MORE CHINESE MILITARY FLIGHTS TO SOUTH AND EAST OF ISLAND\nTaiwan says it has tracked more Chinese military aircraft flying apparent training missions to the south and east of the island.\nThe defense ministry said a pair of Chinese Y-8 surveillance aircraft flew through the Bashi Strait between Taiwan and the Philippines then out into the Pacific in a northeasterly direction on Sunday. It said the pair were joined at one point by two Chinese Su-30 fighter jets as they flew through the Miyako Strait north of the island.\nThat marked the third time this month that Chinese military planes were seen in the vicinity of Taiwanese air space, according to the official Central News Agency. Previous flights on Aug. 5 and Aug. 8 included Y-8s and other aircraft.\nChina claims Taiwan as its own territory to be brought under its control by force if necessary, and the two share an overlapping claim to most of the South China Sea. However, Taiwan occupies just the largely uncontested Pratas islands and just one island in the hotly disputed Spratly chain, unlike Beijing, which has aggressively pursued its claims, including building seven man-made islands atop coral reefs and adding airstrips and other infrastructure of military usefulness.\nChina has also taken a tougher stance toward Taiwan since last year's election of independence-leaning President Tsai Ing-wen, who has refused to endorse Beijing's contention that Taiwan is part of the Chinese nation. The tougher stance has so far been limited largely to diplomatic and economic measures, although Chinese commentators frequently speculate on the potential need for military steps to bring additional pressure on Tsai.\nTaiwan's defense ministry said the Chinese planes remained outside the island's air defense identification zone, and said the citizens had nothing to worry about. Taiwan has as recently as last month scrambled fighters to respond to the presence of China's planes but the ministry gave no indication it did so this time.\n———\nTHINK TANK SAYS CHINESE RECLAMATION WORK CONTINUING DESPITE CLAIMS THAT CONSTURCTION ENDED TWO YEARS AGO\nA leading U.S. think tank released a new report documenting what it said was continuing reclamation work on Chinese-controlled islands in the area, despite a recent claim by China's foreign minister that such work stopped two years ago.\nForeign Minister Wang Yi said Aug. 7 that China had \"stopped or already completed land reclamation\" on its holdings in the South China Sea two years ago. China has built seven new islands in the Spratly chain by piling sand and cement atop coral reefs.\nHowever, the Washington-based Center for Strategic and International Studies said China was continuing to reclaim land in the Paracel Islands north of the Spratlys.\nWang's claim \"is false\" and China's reclamation work \"did not end in mid-2015 with the completion of its artificial islands in the Spratlys,\" said the report.\nThe Paracels play \"a key role in China's goal of establishing surveillance and power projection capabilities throughout the South China Sea,\" the report said. \"To this end, Beijing has undertaken substantial upgrades of its military infrastructure in the Paracels.\"\nChina occupies 20 outposts in the chain and improvements include the addition of harbors, helipads, an airstrip, hangars and a surface-to-air missile battery, the report said.\n———\nCHINA EXPRESSES DISSATISFACTION WITH US OVER LATEST FREEDOM OF NAVIGATION OPERATION NEAR MICHIEF REEF\nChina expressed its \"strong dissatisfaction\" with the U.S. over the Navy's latest freedom of navigation operation in which a warship sailed past one of China's man-made islands.\nIn a statement late Thursday, Chinese Foreign Ministry spokesman Geng Shuang called the U.S. Navy's action a \"provocation\" that \"severely undermines China's sovereignty and security, and severely endangers the safety of frontline personnel of both sides.\"\nChina routinely protests such operations, which President Donald Trump's administration has continued partly to reassure allies locked in territorial disputes with Beijing.\nThe U.S. move will \"compel China to take measures to further raise its capacity to defend national territory,\" Geng said, adding that the Chinese navy \"identified the U.S. warship, warned and expelled it.\"\nA U.S. Navy official told The Associated Press that the destroyer USS John S. McCain sailed past Mischief Reef on Thursday but gave no details.\n———\nTILLERSON VISITS MALAYSIA, THAILAND IN BID TO SHORE UP TIES WITH KEY US SECURITY PARTNERS\nU.S. Secretary of State Rex Tillerson visited Thailand and Malaysia last week, in an effort to shore up relations with two of America's Southeast Asian allies and urge them to maintain pressure on North Korea. Malaysia exercises claims in the South China Sea, while Thailand lies outside the dispute.\nBoth have been cultivating closer ties to key trading partner Beijing, raising consternation in Washington, which had angered the country's rulers by raising concerns over human rights, attacks on political rivals and corruption.\nTillerson flew to Bangkok from the Philippines, where he had met with his counterparts from the 10-member Association of Southeast Asian Nations at an annual regional gathering that focused heavily on North Korea's push to advance its nuclear weapons and missile programs.\nDeputy Prime Minister Zahid Hamidi said in a statement they held talks Wednesday, centered on security issues including terrorism and human trafficking as well as bilateral and international issues. Tillerson had met Prime Minister Najib Razak after arriving late Tuesday from Bangkok.\nDuring a visit by Najib to Beijing last year, China and Malaysia said their navies will cooperate more in the South China Sea.",
    "source_domain": "abcnews.go.com",
    "title": "Recent developments surrounding the South China Sea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/recent-developments-surrounding-south-china-sea-49200962"
}