{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 07:04:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Today in History",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-44506797.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-44506797",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Monday, Jan. 2, the second day of 2017. There are 363 days left in the year.\nToday's Highlight in History:\nOn Jan. 2, 1942, the Philippine capital of Manila was captured by Japanese forces during World War II.\nOn this date:\nIn 1788, Georgia became the fourth state to ratify the U.S. Constitution.\nIn 1792, the first classes began at Georgetown University in Washington, D.C.\nIn 1893, the U.S. Postal Service issued its first commemorative stamp to honor the World's Columbian Expedition and the quadricentennial of Christopher Columbus' voyage.\nIn 1900, U.S. Secretary of State John Hay announced the \"Open Door Policy\" to facilitate trade with China.\nIn 1921, religious services were broadcast on radio for the first time as KDKA in Pittsburgh aired the regular Sunday service of the city's Calvary Episcopal Church.\nIn 1935, Bruno Hauptmann went on trial in Flemington, New Jersey, on charges of kidnapping and murdering the 20-month-old son of Charles and Anne Lindbergh. (Hauptmann was found guilty, and executed.)\nIn 1955, the president of Panama, Jose Antonio Remon Cantera, was assassinated at a racetrack.\nIn 1967, Republican Ronald Reagan took the oath of office as the new governor of California in a ceremony that took place in Sacramento shortly just after midnight.\nIn 1974, President Richard Nixon signed legislation requiring states to limit highway speeds to 55 miles an hour as a way of conserving gasoline in the face of an OPEC oil embargo. (The 55 mph limit was effectively phased out in 1987; federal speed limits were abolished in 1995.) \"Singing cowboy\" star Tex Ritter died in Nashville at age 68.\nIn 1981, police in Sheffield, England, arrested Peter Sutcliffe, who confessed to being the \"Yorkshire Ripper,\" the serial killer of 13 women.\nIn 1991, Sharon Pratt was sworn in as mayor of Washington, D.C., becoming the first black woman to head a city of Washington's size and prominence.\nIn 2006, a methane gas explosion at the Sago (SAY'-goh) Mine in West Virginia claimed the lives of 12 miners, but one miner, Randal McCloy, Jr., was eventually rescued. The roof of a skating rink collapsed in the German town of Bad Reichenhall (bahd RYK'-ehn-hahl), killing 15 people.\nTen years ago: The state funeral for former President Gerald R. Ford began with an elaborate service at Washington National Cathedral, then moved to Grand Rapids, Michigan. New York City commuter Wesley Autrey Sr. saved Cameron Hollopeter, a 19-year-old film student who'd fallen onto subway tracks, by leaping down and pulling the teen and himself into the trough between the tracks as a train passed over them. Talk show host Oprah Winfrey opened a school for disadvantaged girls in South Africa. (The school later became embroiled in allegations of abuse; Winfrey apologized and promised an overhaul.) No. 5 Louisville beat No. 15 Wake Forest 24-13 in the Orange Bowl. Former Jerusalem Mayor Teddy Kollek died at age 95.\nFive years ago: Gordon Hirabayashi, a Japanese-American sociologist who spent 90 days in jail for refusing to be interned during World War II, died in Edmonton, Alberta, Canada at age 93. (Hirabayashi's conviction was overturned in 1987 by a U.S. court which concluded that the U.S. government's internment policies had been based on political expediency, and not on any risk to national security.) The 2012 Tournament of Roses brought its flowery floats to a worldwide audience under clear blue skies in Pasadena, California, and in its wake was followed by hundreds of anti-Wall Street protesters. No. 3 Oklahoma State beat No. 4 Stanford 41-38 in overtime in the Fiesta Bowl. No. 6 Oregon beat No. 9 Wisconsin 45-38 in the Rose Bowl.\nOne year ago: A heavily armed group led by Ammon and Ryan Bundy seized the Malheur National Wildlife Refuge in Oregon, beginning a 41-day standoff to protest the imprisonment of two ranchers convicted of setting fires on public land and demand the federal government turn over public lands to local control. Vermont Sen. Bernie Sanders' campaign said it had raised more than $33 million during the previous three months in his bid to win the Democratic nomination, just short of the amount brought in by rival Hillary Clinton during the same period. The mayor of Temixco, Mexico, Gisela Mota, was assassinated a day after being sworn into office; two suspects were killed in a clash with police and three others arrested. Saudi Arabia executed 47 prisoners, including a prominent Shiite cleric; Shiite leaders in Iran and elsewhere across the Middle East swiftly condemned Riyadh and warned of a sectarian backlash.\nToday's Birthdays: Country musician Harold Bradley is 91. Former House Speaker Dennis Hastert is 75. TV host Jack Hanna is 70. Actress Wendy Phillips is 65. Actress Cynthia Sikes is 63. Actress Gabrielle Carteris is 56. Movie director Todd Haynes is 56. Retired MLB All-Star pitcher David Cone is 54. Actress Tia Carrere is 50. Actor Cuba Gooding Jr. is 49. Model Christy Turlington is 48. Actor Taye Diggs is 46. Actress Renee Elise Goldsberry (Stage: \"Hamilton\") is 46. Rock musician Scott Underwood is 46. Rock singer Doug Robb (Hoobastank) is 42. Actor Dax Shepard is 42. Actress Paz Vega is 41. Country musician Chris Hartman is 39. Ballroom dancer Karina Smirnoff (TV: \"Dancing with the Stars\") is 39. Rock musician Jerry DePizzo Jr. (O.A.R.) is 38. Rhythm-and-blues singer Kelton Kessee (IMX) is 36. Pop singer-musician Ryan Merchant (Capital Cities) is 36. Actress Kate Bosworth is 34. Actor Peter Gadiot is 32. Jazz singer-musician Trombone Shorty is 31. Rhythm-and-blues singer/rapper Bryson Tiller is 24.\nThought for Today: \"A clash of doctrines is not a disaster — it is an opportunity.\" — Alfred North Whitehead, English philosopher and mathematician (1861-1947).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-44506797"
}