{
    "authors": [
        "Abc News",
        "Andrew Fies",
        "Alex Perez",
        "More Julia",
        "More Alex"
    ],
    "date_download": "2017-02-15 02:14:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Toddler killed in drive-by shooting on Chicago's West Side: Police",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Ftoddler-killed-drive-shooting-chicagos-west-side-police%2Fstory%3Fid%3D45495809.json",
    "image_url": "http://a.abcnews.com/images/US/gty-chi-police-hb-170214_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A toddler was killed on Chicago's gang-plagued West Side Tuesday after he was shot in the head, police said.\nThe 2-year-old boy was killed along with a 26-year-old man, who was the target of the shooting, a spokesperson for the Chicago Police Department told ABC News. The man was also shot in the head.\nThe two were pronounced dead at area hospitals.\nA 20-year-old woman was also hospitalized after she was shot in the stomach. She is currently in fair condition.\nAll three victims were shot in a moving car in an alley, said police, who confirmed to ABC News that the shooting was gang-related.\nInvestigators have \"very optimistic leads\" in the case, police said, adding that detectives are currently analyzing surveillance video from the area.\nThey are also reviewing a nearly 30-minute Facebook live video that has surfaced and may have captured some of the incident as it unfolded. Police have not confirmed the authenticity of the video and whether it was filmed live in the car where the three were shot.\nWLS\nWLS\nNo arrests have been made.\nCPD has very good leads in the investigation. Detectives are reviewing surveillance video. Tragically, the young boy succombed to injuries — Anthony Guglielmi (@AJGuglielmi) February 14, 2017\nThe shooting comes just days after two girls, ages 11 and 12, were both shot in the head in separate unrelated shootings that took place within 25 minutes of each other over the weekend in Chicago.\nBoth girls were rushed to hospitals in critical condition after they were shot Saturday night.\nOn Monday, Patsy Holmes, the grandmother of Takiya Holmes, told ABC News that the 11-year-old was still \"fighting for her life.\"\nThe condition of the 12-year-old victim is unclear.\nRecent gun violence in Chicago has garnered national attention, with 2016 ending with a record number of shootings and the most homicides in two decades, according to police.\nLast year, there were 3,550 shooting incidents and 762 murders, a total that averages to more than two murders and nearly 10 shootings every day in 2016.\nOn the first day of January alone, 28 people were shot in Chicago, according to data from the Chicago Police Department.",
    "source_domain": "abcnews.go.com",
    "title": "Toddler killed in drive-by shooting on Chicago's West Side: Police",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/toddler-killed-drive-shooting-chicagos-west-side-police/story?id=45495809"
}