{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 20:52:59+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Frenewable-energy-push-sunny-arizona-draws-political-fight-56367353.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_c73ab495523647ec85448664dff73268_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Arizona's largest utility is fiercely opposing a push to mandate increased use of renewable energy in the sun-drenched state, setting up a political fight over a measure funded by a California billionaire.\nClean Energy for a Healthy Arizona aims to ask voters whether they want the state Constitution to require half of Arizona's electricity come from renewable sources like wind and solar by 2030. The group plans to file more than 225,000 signatures Thursday get the question on the November ballot.\nBillionaire philanthropist Tom Steyer is financing the initiative through his NextGen Climate Action group, which supported similar efforts in Nevada and Michigan. But only the Arizona measure spawned a political battle, with the Republican-controlled Legislature passing a rule to help insulate utilities and the parent company of the state's largest electricity provider bankrolling opposition messaging.\nSteyer, known for climate advocacy as well as his push to impeach President Donald Trump, says he's backing the proposal because of the benefits it will bring to Arizona.\n\"It actually will lead to lower costs and save a lot of money for consumers,\" Steyer said. \"It leads to clean air and a lot better health outcomes for Arizonans, and it should create literally tens of thousands of jobs in the state of Arizona. So it's hard to understand why these people are fighting it.\"\nSupporters of the initiative say Arizona hasn't taken advantage of its role as the sunniest state in the nation to develop more solar energy, saying it derives just 6 percent of its energy from solar.\nArizona Public Service Co. says the proposed constitutional amendment will cause customers' utility rates to skyrocket and harm reliability.\nIts parent company, Pinnacle West Capital Corp., funneled $1.18 million to Arizonans for Affordable Energy to oppose the initiative in the first three months of the year. Multiple chambers of commerce, Tucson Electric Power and Chicanos Por La Causa also oppose it.\n\"Everyone supports renewable energy,\" said Matthew Benson, spokesman for the utility-funded opposition initiative. \"The question is whether we are going to have an Arizona plan that is created and implemented by Arizona leaders and officials, or whether we're going to have a plan crammed down our throats by a political activist from California.\"\nCampaign finance records show Steyer's group gave $750,000 in cash and more than $200,000 in goods and services to the renewable energy campaign.\nOpponents have used the #StopSteyer hashtag in the run-up to Thursday's deadline for petition signatures. Legislative Republicans also cast him as an \"out-of-state billionaire\" when they passed a law that limits the cost of not complying with renewable energy mandates.\nSteyer disagrees that he's dictating policy. The National Resources Defense Council, Mi Familia Vota, and various in-state health and climate groups have endorsed the initiative as a way to bring more renewable energy to Arizona.\n\"When concentrated corporate interests put themselves and their bottom line ahead of the people, I don't like that,\" Steyer said. \"And that's what I suspect is happening here. And I think the people of Arizona should be asked what they think, and that's what we're trying to enable.\"\nArizona is one of three states where the billionaire's NextGen Climate Action group pushed ballot initiatives for higher renewable energy standards. Nevada's measure hasn't drawn the same uproar, and the effort in Michigan ended after two utilities decided to increase investments in renewable energy.\nBenson says Arizona is different partly because of the numbers — the Michigan initiative had a 30 percent renewable mandate compared with 50 percent in Arizona. The Arizona Corporation Commission already requires electric utilities to generate 15 percent of their energy from renewable sources by 2025.\nAPS also warned that the initiative's higher renewable standard would force its nuclear power plant to close. Nuclear wouldn't count toward the 50 percent mandate, and APS says its Palo Verde Nuclear Generating Station is the largest electricity producer in the U.S.\nJeff Burke, APS director of resources planning, says customers would see 6 to 14 percent increases on their bills if the company is forced to ratchet up renewable use ahead of schedule.\n\"We continue to add renewables to our system, but they have to make sense,\" Burke said. \"It's not really about a target, it's about what makes sense for our customers' usage and what makes rates affordable and what keeps our system reliable.\"\nThirty-two states with renewable standards didn't have, on average, a correlated rate increase, according to Wesley Hersche, an associate director of research with Arizona State University's Global Security Initiative.\n\"These issues involve a complex interaction of factors, and we should be careful not to oversimplify things,\" Hersche wrote in April. \"But renewable energy technologies such as solar, wind, and battery storage have become so cheap recently that this finding is not all that surprising.\"",
    "source_domain": "abcnews.go.com",
    "title": "Renewable energy push in sunny Arizona draws political fight",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Technology/wireStory/renewable-energy-push-sunny-arizona-draws-political-fight-56367353"
}