{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:42:58+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fmarkets-now-solid-earnings-send-us-stocks-higher-54689730.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_1e7a5f26d19040cf91fb6d546622aeee_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The latest on developments in financial markets (all times local):\n11:45 a.m.\nMajor U.S. stock indexes gave up an early gain and were mostly lower in midday trading, but smaller companies rose.\nTravelers, mining company Freeport-McMoRan and plumbing supplies maker Masco all fell Tuesday after reporting results that were weaker than analysts were expecting.\nThe yield on the 10-year Treasury, a benchmark for interest rates on many kinds of loans including mortgages, hit 3 percent for the first time since January 2014, reflecting higher expectations for inflation and economic growth.\nSome companies rose after reporting solid results. Verizon, Harley-Davidson and Fifth Third Bancorp all rose.\nThe S&P 500 index fell 5 points, or 0.2 percent, to 2,664.\nThe Dow Jones industrial average lost 124 points, or 0.5 percent, to 24,313. The Nasdaq gave up 45 points, or 0.6 percent, to 7,083.\n———\n9:50 a.m.\nThe yield on the 10-year Treasury note, a benchmark for many kinds of interest rates including mortgages, hit 3 percent for the first time since January 2014.\nThe rising yield reflects higher expectations for inflation and economic growth.\nStocks moved broadly higher in early trading Tuesday as a handful of solid company earnings reports put investors in a buying mood.\nVerizon, Harley-Davidson and Fifth Third Bancorp all rose.\nThe S&P 500 index rose 3 points, or 0.2 percent, to 2,674.\nThe Dow Jones industrial average climbed 47 points, or 0.2 percent, to 24,523. The Nasdaq increased 11 points, or 0.2 percent, to 7,139.\nBond prices fell. The yield on the 10-year Treasury went as high as 3 percent in early trading before slipping back to 2.99 percent.\n———\n9:35 a.m.\nStocks are opening broadly higher on Wall Street as a handful of solid company earnings reports put investors in a buying mood.\nVerizon, Harley-Davidson and Fifth Third Bancorp all rose sharply in early trading Tuesday after reporting results that came in ahead of analysts' forecasts.\nGoogle parent Alphabet also reported surging earnings, but its stock fell 2.2 percent as the company said spending rose sharply.\nDrugmaker Shire rose 3.3 percent after saying it had received another takeover offer from Japanese rival Takeda.\nThe S&P 500 index rose 9 points, or 0.4 percent, to 2,680.\nThe Dow Jones industrial average climbed 71 points, or 0.3 percent, to 24,523. The Nasdaq increased 34 points, or 0.5 percent, to 7,162.\nBond prices fell. The yield on the 10-year Treasury rose to 2.99 percent.",
    "source_domain": "abcnews.go.com",
    "title": "Markets Right Now: Stocks lower after an early gain fades",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/markets-now-solid-earnings-send-us-stocks-higher-54689730"
}