{
    "authors": [
        "Abc News",
        "More Genevieve"
    ],
    "date_download": "2018-05-30 19:55:50+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Summer homework. It's the worst part of summer for most parents and kids no doubt, but it's become the norm.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fteachers-summer-packet-things-kids-learn-worksheet%2Fstory%3Fid%3D55532668.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/summer-kids-1-gty-er-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Summer homework. It's the worst part of summer for most parents and kids no doubt, but it's become the norm.\nUsually called the \"summer packet,\" it typically consists of several worksheets for kids to complete with the goal of staying on top of academics during the break.\nBut what about all the lessons that can't be learned from a worksheet?\nThat's the idea behind one Pensacola, Florida teacher's summer packet. It's actually not a packet at all, and while Betsy Eggart, a first-grade teacher at R.C. Lipscomb Elementary School has now turned it into a downloadable one-sheeter any teacher can use, it actually began as a simple Facebook post. That post has now been shared more than 150,000 times. It reads in part:\n\"A parent asked me the other day, 'Are you sending home a packet of work for the summer?' I paused and felt half-guilty as I replied, 'No...'\"\nEggart told \"Good Morning America\" the parent seemed \"relieved.\"\nThe post continues: \"You see, there are these packets you can create to send home so that parents can work with their child reviewing skills learned and preparing for what is up ahead.\nThis is so great, in theory. And maybe one day I’ll put one together. Although, the more I thought, the more I decided that this summer packet should be less addition practice and sight words and more...LIFE.\nSo take it or leave it...here’s my 'Summer Packet.'\n-Teach your child to tie their shoes. Find a fun trick! Watch a video! Give an incentive! Be persistent! Just make sure your child isn’t the one dragging their laces through the bathroom and cafeteria then asking the teacher to tie it.\n-Choose a few family members and friends to write a letter to this summer. Ask your child to write in full sentences, ask questions and give details. Writing with a purpose makes it relevant and real for your child. Maybe someone will write them back! Include an envelope with return address and stamp to encourage that!\n-Sit at the table and eat together. Really watch your child. Is he sitting on his knees, mouth wide open, food everywhere? This is how he looks in the cafeteria. Work on that.\"\n\"For the working parent or the stay at home parent, summer is a time to slow down,\" Eggart said. \"It's less time going and doing and more time just being. No homework, less extra curricular activities and no tardy bells. Just because our adult lives seem to go at warp speed, it doesn't mean our children need to go that fast as well.\"\nShe said the response to her original post has been \"overwhelming.\"\n\"I have heard from teachers and principals all over the country and even overseas thanking me for putting into words what they've thought for a long time. I have honestly cried to read so many telling me, 'We'll be working on your list this summer.'\nEggart, herself a mother of two kids ages 8 years and 18 months, will be taking it easy this summer and she hopes her post will inspire others to do the same.\n\"I just wanted to remind my parents to slow down, look at their children and live some life together this summer,\" she said. \"I can't put life on a worksheet.\"",
    "source_domain": "abcnews.go.com",
    "title": "Teacher's 'summer packet' is all things kids can't learn on a worksheet",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Family/teachers-summer-packet-things-kids-learn-worksheet/story?id=55532668"
}