{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:19:49+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Severe storms were hitting parts of Colorado as they moved eastward.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Feast-coast-braces-4th-noreaster-weeks-53860789.json",
    "image_url": "https://s.abcnews.com/images/WNT/180319_wn_marciano_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for East Coast braces for possible 4th nor'easter in 3 weeks\nWe're going to turn next here to that severe weather threat at this hour. A tornado watch. Authorities are calling it a particularly dangerous situation going into the night. Dark clouds ahead of a snowstorm that moved out of Colorado, into the plains. And look at this. Damaging hail in Alabama. As I mentioned, now the fourth nor'easter in just three weeks. And perfectly timed for the first day of spring. Kind of torture. Senior meteorologist rob Marciano back with us again tonight, tracking it all. Reporter: Hey, David. We'll start with the southern part of this. You mentioned the pds watch. Not uncommon to get large tornadoes this time of year. A tornado confirmed on the ground in southwest Alabama. Then, eventually to coastal Carolinas and Georgia and tomorrow in through parts of Florida. Hopefully weakening by then. Northern part of this system, winter storm watches all the way up through Boston. Completion for now, but it will spin that moisture into the cold air. Heavy, wet snow. At this point, we're thinking five to ten inches of wet snow along the I-95 corridor, in some of the cities. Some uncertainty in that, David, but we're confident it's going to be the fourth nor'easter. Rob, thank you. We're going to move on tonight, and to new undercover\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "East Coast braces for possible 4th nor'easter in 3 weeks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/east-coast-braces-4th-noreaster-weeks-53860789"
}