{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:49:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Column: Thomas wins major at an early age, eliminates burden",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fcolumn-thomas-wins-major-early-age-eliminates-burden-49215681.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_f23656606c52461998548ec74f807196_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Justin Thomas is a major champion. When he became one is more meaningful than where.\nIf he had to pick a major to win first, the PGA Championship would have been the most appropriate because of his family heritage. The first person he hugged was his father. The first person he called was his grandfather. Both are longtime club professionals. Mike Thomas, his father, served on the PGA of America board.\n\"For this to be my first one and have my dad here, and I know Grandpa was watching at home. I was able to talk to him, and that was pretty cool,\" Thomas said after his two-shot victory at Quail Hollow.\nThe message from Paul Thomas: \"This is the first of many.\"\nThe first one can be the hardest.\nJordan Spieth brought that up last month before he won his third at the British Open. He won his first one at the 2015 Masters when he was 21 without breaking too much of a sweat, at least on the outside. He never let anyone closer than three shots after the opening round, a feat accomplished only one other time in Masters history.\nBut he was keenly aware of the significance.\n\"I can win this major here and it would be a huge monkey off the back,\" Spieth recalled thinking. \"Because the longer you go without one, it's making each one harder.\"\nPlayers in their 20s won three of the majors this year.\nBrooks Koepka won the U.S. Open in his 15th major as a pro. Thomas was playing in his 10th major as a pro when he won the PGA Championship. The 2015 Masters was Spieth's seventh start in the majors.\nThe other major champion was Sergio Garcia.\nGarcia was a 19-year-old rookie when he nearly chased down Tiger Woods at Medinah in the 1999 PGA Championship with a spirit so relentless that Woods had to make an 8-foot par putt on the 17th hole to stay in the lead and win by one. The question that day was not when Garcia would win a major, but how many.\nTwo years later, he started the final round two shots behind at the British Open. He played in the final group in the U.S. Open a year after that, the British Open in 2006 (both times with Woods), and he had a three-shot lead at Carnoustie in 2007.\nThe Spaniard had speckles of gray in his stubble when he slipped on the green jacket in April, finally, at age 37.\n\"I did think about, 'Am I ever going to win one?'\" he said when he won the Masters. \"I've had so many good chances and either I lost them or someone has done something extraordinary to beat me.\"\nOver the last 20 years, winning a major weighed most heavily on Phil Mickelson. He finally won the 2004 Masters when he was 34, and he now has five majors. In his eighth start in a major, he squandered one of his best chances in the 1995 U.S. Open at Shinnecock Hills. Mickelson played the par-5 16th hole in 6 over for the week and wound up four shots behind. It would have been hard to believe then that it would take Lefty nine more years.\nIt's harder than ever to win on the PGA Tour, and the majors are no different. The talent pool is getting deeper and younger. Three times over the last four years, players in their 20s have won three out of four majors.\nHideki Matsuyama, the 25-year-old Japanese star, was runner-up at the U.S. Open (but never in serious contention at Erin Hills), and he had a one-shot lead walking off the 10th green Sunday at Quail Hollow. Is his time coming? He could be like Spieth (who was runner-up in the Masters before he won). He could be like Garcia.\n\"All I can do is try harder next time,\" Matsuyama said.\nAnd then there's Rickie Fowler, who at 28 would ordinarily be considered too young for the label of \"best without a major.\"\nThen again, the phrase \"too young\" is getting old.\nFowler had his seventh top-5 finish in a major at Quail Hollow and now has played 30 majors since turning pro. The high finishes would figure to serve him well. Fowler waited behind to celebrate with Thomas, as he has graciously done for others, and he posed with Thomas and the Wanamaker Trophy.\nThomas spoke honestly of the jealousy he felt when Spieth quickly compiled three legs of the career Grand Slam (Spieth is 3 months younger than Thomas). But he thinks that's true for just about anyone toward the winner of any major, and he's probably right. If they're not, they should be.\n\"It's just nice to have one,\" Thomas said.\nIn a strange way, Thomas felt calm realizing there were so many good players who have only one major, and it took them awhile to do it. He wouldn't be the first player to wait on that first major. It's a nice feeling knowing that he's not the next.\n\"To win a major at 24,\" he said, \"is pretty cool saying it.\"",
    "source_domain": "abcnews.go.com",
    "title": "Column: Thomas wins major at an early age, eliminates burden",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/column-thomas-wins-major-early-age-eliminates-burden-49215681"
}