{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:13:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Currently suspended, Brock Lesnar tells UFC he's retiring from fighting",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsuspended-brock-lesnar-tells-ufc-retiring-fighting%2Fstory%3Fid%3D45498383.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0214/dm_170214_mma_okamoto_mayweather_mcgregor/dm_170214_mma_okamoto_mayweather_mcgregor_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Former UFC heavyweight champion Brock Lesnar, who is currently suspended from competition, has informed the promotion his professional fighting career is over.\nUFC officials confirmed the news to ESPN.com on Tuesday, following an initial report by MMAFighting.com.\nThe United States Anti-Doping Agency (USADA) also confirmed it was aware of Lesnar's retirement. Due to the retirement, Lesnar is no longer included in USADA's testing pool, under the UFC's anti-doping program.\nLast month, Lesnar, 39, was handed a one-year suspension from USADA due to a pair of failed drug tests in 2016. The Nevada State Athletic Commission also suspended Lesnar for one year. The suspensions do not affect his professional wrestling career in WWE.\nLesnar would have been eligible to return to active competition in July, but his USADA suspension freezes with this announcement. Should Lesnar (5-3) opt to resume his UFC career at any point, he would be required to fulfill the remaining five months of that suspension.\nLesnar has not commented publicly on his retirement.\nA former NCAA Division I national champion wrestler, Lesnar came out of a nearly five-year retirement to face Mark Hunt at UFC 200 last July in Las Vegas. Lesnar won the fight via unanimous decision, but it was later changed to a no-contest after the positive tests were revealed.\nLesnar tested positive for the anti-estrogenic substance clomiphene. He denied knowingly taking the banned substance.",
    "source_domain": "abcnews.go.com",
    "title": "Currently suspended, Brock Lesnar tells UFC he's retiring from fighting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/suspended-brock-lesnar-tells-ufc-retiring-fighting/story?id=45498383"
}