{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2018-05-30 19:56:00+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A woman has honored the request of her sixth-grade teacher, who, 21 years ago, asked that she be invited to her Harvard graduation someday.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FLiving%2Fwoman-honors-6th-grade-teachers-attend-harvard-graduation%2Fstory%3Fid%3D55537771.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/graduation-1-ht-er-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A woman has honored the request of her former sixth-grade teacher, who, 21 years ago, asked that she be invited to her Harvard graduation someday.\nChristin Gilmer, 33, had Ms. Judith Toensing present while she accepted her doctorate degree from the ivy league university. The ceremony took place last week, although Toensing requested an invitation back in 1997.\n\"It has been a joy to have you in class,\" Toensing wrote on Gilmer's report card that year. \"Keep up the good work! Invite me to your Harvard graduation!\"\nCourtesy Christin Gilmer\nGilmer told ABC News that she kept that report card from Ms. Toensing -- her beloved educator from her years at O.C. Johnson Elementary School in Yuma, Arizona.\nIn April, Gilmer announced on Facebook that she'd be graduating with a doctorate in public health from Harvard T.H. Chan School of Public Health. In it, she tagged the teachers who inspired her.\nGilmer said that Harvard soon reached out to Toensing and invited her to the graduation, all expenses paid.\n\"She was really excited and elated,\" said Gilmer, a global health professional who's been working in HIV and human rights for 15 years. \"I didn't think she'd actually come. I assumed the invitation would be it. I was letting her know how important she was to me, that she passed the torch.\"\nCourtesy Christin Gilmer\n\"Invite me to your Harvard graduation.\" In 1997, the sixth-grade teacher of Christin Gilmer, DrPH '18, left this note on her report card. Today, that teacher, Judith Toensing, was at the Harvard Chan School to watch Gilmer graduate. #HarvardChan18 #Harvard18 pic.twitter.com/H49XNviM0u — HarvardPublicHealth (@HarvardChanSPH) May 23, 2018\nIn her Facebook post, Gilmer thanked her family, teachers, nurses, principals, guidance counselors and more for helping her to schieve her goals.\nTo Toensing, she wrote the following:\n\"Of these many amazing heroes, I met one of these teachers in the sixth grade, Ms. Judy Toensing, who taught me about current events, global health, and human rights. She was the first person who passionately conveyed the plight of people living with HIV/AIDS to me and started me on this journey.\"\nGilmer continued, \"In a picture I still carry around, she told me on the last day of school that year that she would see me at my Harvard graduation, and now I can finally invite her (21 years later) and try to show her how grateful I am to her and all of my teachers from pre-K - college.\"\nCourtesy Christin Gilmer\nToensing attended Gilmer's graduation on May 23 and 24. Afterward, she attended a celebratory dinner with Gilmer's family at an Italian restaurant.\n\"It was a really humbling, touching and humility-inducing experience,\" Gilmer said. \"It meant a lot to have someone there who held my hand in the early stages.\"\nToensing wrote on Facebook, that she \"couldn't be more proud\" of Gilmer.\n\"Congratulations Dr. Christin,\" Toensing commented. \"I knew you when you were Dorothy with the red shoes and now you truly made it to OZ! ... Love you and thank you for letting me be a small part of your journey.\"",
    "source_domain": "abcnews.go.com",
    "title": "Woman honors 6th-grade teacher's wish to attend her Harvard graduation, as written on 1997 report card",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Living/woman-honors-6th-grade-teachers-attend-harvard-graduation/story?id=55537771"
}