{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:41:49+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Trump effect on French election: Anything is possible",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ftrump-effect-french-election-46844479.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_b6fd3200c49848ab9a2d0bcce5044936_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The impossible is now possible, French far right presidential candidate Marine Le Pen said in celebration the morning after Donald Trump won the U.S. presidency. But the Trump effect may not bring Le Pen the boost she had once expected.\nThat's in part because Trump has not turned out to be the soul mate Le Pen was counting on. Trump bombed Syria and abandoned support for President Bashar Assad, whom Le Pen backs. He alienated Russia even as Le Pen consolidated her alliance with Vladimir Putin. And Trump's administration has been fraught with internal troubles.\nFrench voters have learned at least one thing from Trump's surprising victory and Britain's surprising vote to leave the European Union: They need to be ready for a surprise.\nWith only six days left before Sunday's first-round vote, polls show the four leading French candidates are so close in popularity that there's no clear front-runner. The top two candidates advance to a May 7 runoff.\nLe Pen, campaigning against immigration and Europe's open borders, has a good chance of reaching the runoff but little chance of winning it — at least according to pollsters, who have suffered their own Trump effect after failing to predict his presidency.\nPopulists elsewhere in Europe have had mixed success in elections since November. Dutch voters rejected firebrand Geert Wilders, favoring the status quo. Bulgarians chose nationalists, and Italians voted against the establishment, while Austrian voters rejected a far right presidential contender.\nIn France, Trump's victory has given new focus to Le Pen's rivals.\nIndependent centrist Emmanuel Macron is framing himself as a bulwark against the nationalism and protectionism of Trump's America and Putin's Russia. He wants to reform the EU from within, he said last week, because \"many foreign leaders openly want a weakening of Europe: Donald Trump, Vladimir Putin, as well as the main authoritarian leaders of the Middle East.\"\nOther candidates are warning that Le Pen's dreams of leaving the EU and the euro would wipe out voters' savings and devastate the economy. French media pressured Le Pen last week for questioning whether the French state was really responsible for deporting tens of thousands of Jews to death in World War II during the Nazi occupation.\nLe Pen enjoyed a boost from the Trump phenomenon — the rise of anti-establishment sentiment, especially from working classes who lost out from the globalization that transformed the world over the past generation. Le Pen has courted that electorate for years and saw Trump's election as vindication of that strategy.\nHours after Trump was elected, Le Pen said, \"What happened tonight is not the end of the world, it's the end of a (certain) world.\" She called his victory and the Brexit vote \"democratic choices that bury the ancient order and are as many stones to build the world of tomorrow.\"\nShe also plays to security fears after a string of deadly Islamic extremist attacks on France.\nBut the Trump presidency has shown that implementing populist promises isn't as easy as it seems. And Trump's own reversals have frustrated Le Pen.\n\"We have seen that Trump's latest positions are so contrary to what Marine Le Pen had hoped,\" said Thierry de Montbrial, president of the French Institute of International Relations. Nationalist candidates \"no longer recognize themselves\" in Trump anymore.\nLe Pen distanced herself from Trump after the U.S. missile strikes on Syria earlier this month, angry that he is trying to be \"the world's policeman.\"\nTrump's reversal on NATO — which he once called obsolete — also frustrates Le Pen. She wants to pull France out of its command structure and sees the alliance as an unnecessary threat to Russia now that the Soviet Union is defunct.\n\"If there is a Trump effect on the campaign, it is that in many minds, it's assumed that anything is possible,\" said Emmanuel Riviere, director of Kantar Public's polling in France. \"It's not unreasonable to have a victory of a candidate who is improbably excessive, and unexpected.\"\nLe Pen's electorate is not an exact mirror of Trump's, though they both attract support from \"white people whose social standing has fallen,\" Riviere said.\nShe doesn't have a powerful party machine like that of Trump's Republicans, and has less support from older generations who supported Trump. But Le Pen enjoys more support from youth.\nRiviere said any lingering Trump effect on the French campaign could also favor other candidates, such as far-left Jean-Luc Melenchon, who rails against free trade. Or conservative Francois Fillon, who has adopted Trump-style criticism of the media and a justice system he said is conspiring against him.\n\"We are in a very unprecedented moment in French politics,\" Riviere said. \"This presidential term will be something we have never seen before.\"",
    "source_domain": "abcnews.go.com",
    "title": "Trump effect on French election: Anything is possible",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/trump-effect-french-election-46844479"
}