{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:33:44+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Police and emergency personnel responded to the Port Authority Bus Terminal in New York to investigate reports of an \"explosion.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fpipe-bomb-explodes-nyc-sources-51715263.json",
    "image_url": "http://a.abcnews.com/images/GMA/171211_gma_benitez_explosion2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Possible pipe bomb explodes in NYC: Sources\nWe want to get right to that breaking news. There has been an explosion at the port authority bus terminal here in New York City. That's a live look right now at the emergency vehicles on the scene right now. Police say thisas a pipe bomb also a suspect is in custody right now. Want to go right to ABC's gio Benitez on the scene. Gio. Reporter: Police sources are describing it as a possible pipe bomb as you said detonated in a passageway below ground at port authority. As you can understand how concerning it is port authority is the major bus terminal in new York City but it's also where you find a lot of subway systems underground. So many underground. This is the area that people come to when they're commuting all across New York, all across New Jersey. They come to port authority. As you can imagine, so many people are here. Police right now are trying to divert crowds from getting near port authority. Trying to contain this. Right now they say one person is in custody. Only a few injuries but police do have video, they say, and are confident that this is contained right now, George. This is such a major hub, the largest bus terminal in the United States, busiest by volume. It's going to tie up traffic here in the new york/new Jersey area for days and, of course, gio, this area always on such high alert. Reporter: Always on such high alert because we're so close to times square, George. You know that. We're just blocks away from times square and when you look at port authority. I'm looking at it right now. It's just this massive structure that just goes on for blocks and blocks so right now we have ambulances on the scene. So many ambulances, so many officers that just immediately dispatched here. Clearly trying to get a hold -- a handle of this situation. But you're seeing all these people sort of confused that are here trying to catch whatever train or bus they need to to get over to as they commute to work. Okay, gio, thanks very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Possible pipe bomb explodes in NYC: Sources",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/pipe-bomb-explodes-nyc-sources-51715263"
}