{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:36:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Finmate-prison-officers-complicit-cellphone-problem-54703683.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_e29ae3c95abc4386a770cf8881f350ec_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "South Carolina prison officials have for years blamed cellphones for contributing to inmate violence. After a bloody riot left seven inmates dead at a maximum-security prison last week, they again find themselves asking federal officials to grant waivers and change laws to let them block the signals of these contraband devices.\nGov. Henry McMaster issued an executive order Monday easing hiring rules for new corrections officers. McMaster said a shortage of officers was allowing contraband to flow freely into the state's prisons, provoking often deadly inmate battles.\nBut some who have spent time in and around the prisons say it is not a lack of corrections officers — but the inaction and collusion of those already on the job — that has led to the abundance of contraband. Because cellphones are so plentiful, these people argue, they are rarely the cause of violence between inmates.\n\"From the moment I got to Lee, access to a cell(phone) was a non-issue,\" said an inmate at Lee Correctional Institution who has been using a mobile phone to correspond with The Associated Press for months via social media. \"You see the guys out in the common areas ... with their phones, and nobody bothers (them). The drugs and cellphones are so plentiful that almost NO fights or stabbings are about that — at all.\"\nThe inmate has been communicating with the AP on condition of anonymity for fear of reprisal from other inmates and punishment from authorities. The Lee Correctional Institution was the site of last week's deadly riots .\nElizabeth Franklin-Best, a criminal defense attorney who has represented many inmates housed in South Carolina's prison system, confirmed the prisoner's account.\n\"They all have them,\" she said, referring to inmates and cellphones. She said whenever she asks clients how they get them, \"the answer is the same: It's corrections officers bringing them in.\"\nFranklin-Best said her clients have told her that in one instance, the phones were hidden in frozen containers of soup, while in another, a prison chaplain tucked contraband inside his piano.\nSome officers have been charged in recent months with furnishing contraband to inmates.\n\"I'm not saying that there aren't correctional officers who do it, or that there aren't correctional officers who will turn a blind eye to it once it's inside, but I think that it's a small percentage,\" said Ryan Alphin, executive director of the South Carolina Law Enforcement Officers' Association.\nSouth Carolina's Department of Corrections has long banned inmates from possessing cellphones, saying they pose a top security threat because they can help inmates commit crimes, such as coordinating drug distribution or plotting violent uprisings.\nCellphones are among the hottest items on a hopping black market in prison, fetching up to $1,000 apiece, the inmate said. Phones command high prices because, in addition to possibly facilitating crimes, they allow inmates to keep in touch with family, friends and each other, all without supervision by prison officials who otherwise monitor outgoing communications, according to agency officials.\nInmates are hungry for a black market where they can buy and sell contraband because few have the money to pay for any privileges or items available inside the prison, said state Rep. Justin Bamberg, an attorney who has represented families of inmates killed in prison incidents. Prison jobs that allow inmates to earn a few dollars are scarce.\n\"The cost to an inmate to make a call from a contraband cellphone is less than it is to make a call from the prison phone,\" Bamberg said. \"They either have to have somebody putting money on their books for them, which a lot aren't able to do, or they have to do what they have to do on the inside to make a little money.\"\nIn recent years, Corrections officials have taken several steps to stop phones from flowing in: Visitors go through entry screening; netting has been installed to catch items thrown over fences; and authorities have lobbied legislators to ban drones that could deliver contraband. They also have hired sheriff's departments and South Carolina State Guardsmen to patrol outside prisons.\nA person familiar with the operations of the Corrections Department has told AP that delivery trucks — which are supposed to be inspected while entering prison grounds — often ferry cellphones and other contraband.\n\"These trucks are usually 18-wheelers full of products and boxes, impossible for even the best corrections officer to search and locate all the hidden spots, not to mention all the boxes,\" said the person, who spoke on condition of anonymity because they were not authorized to speak publicly about the issue. Once the trucks are inside, inmates unload them, remove the hidden contraband and store it in the prison, with \"almost no oversight,\" the person said.\nIn the canteen where inmates purchase snacks and toiletries, \"the inmate and only the inmate is in charge of all inventory and has keys to where the product is located,\" the person said.\nThe inmate who has been corresponding with the AP said it would be very difficult to find and dispose of all the cellphones now inside prisons.\n\"There are unused phones in walls, ceilings, buried outside, stashed in food, EVERYWHERE,\" the prisoner said.\n———\nKinnard can be reached at http://twitter.com/MegKinnardAP. Read more of her work at https://apnews.com/search/meg%20kinnard.",
    "source_domain": "abcnews.go.com",
    "title": "Inmate: Prison officers complicit in cellphone problem",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/inmate-prison-officers-complicit-cellphone-problem-54703683"
}