{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:48:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "As the competition heats up, the latest couple booted from \"Dancing With the Stars\" dishes on their time in the ballroom live on \"GMA.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Ferika-jayne-discusses-booted-off-dancing-46853650.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_dwts_0841_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Erika Jayne discusses being booted off 'Dancing'\nstars'\" Erika Jayne and gleb. The real housewife and her partner going out on a high note with a beautiful Disney inspired viennese waltz before flying across the country to join us. Not easy to do and thank you. Thank you. You ended on a high note. How did it feel when the dance ended? Go. It felt great. Yeah, we did end on a high note. It was beautiful, it was emotional. I felt good about it. We worked hard. I'm proud of us. You have dancing experience. Yes. Because of your incredible performing that you do. How did this compare? Was \"Dancing with the stars\" harder than you imagined it would be? Partnering is harder than you know you could imagine. I mean I knew it was going to be tough. I knew it would be a challenge. I always said that but it was really difficult to come into his space and learn and really be his student. Letting me be the boss. If you watch \"Real housewives of Beverly hills,\" you know that's not easy. It was tough but I'm so appreciative and had a great time. Gleb, let me rank you is there a future choreographing Erika's next music video? I think so. Maybe. I see a unicorn and lamborghini in the video. He did a great job and created, director, choreographer. Did a beautiful job. I want to ask you, Erika, knowing all of the other housewives who do you think would do the best on \"Dancing with the stars\"? Probably Kyle. Kyle. Kyle would be good. Who would be the toughest judge? On \"Dancing with the stars\"? Yes. Every one of them. You know, every one of them but, you know I hope Kenyon Moore gets on the show next. She'd be great. Kenya. You're next, babe. You have your platform right here. That's interesting. So, tell me a little about the experience. What was it like? Is it harder than being a housewife being on \"Dancing with the stars.\" It's two completely different things. First everyone on \"Dancing with the stars\" is very nice and very warm and very sweet although you and I had it out a couple of types but nothing like my other job, but, yes, nothing -- I had a great time. Were you ready to go? No. I wasn't. I felt like we were opening up. I felt like we were growing so I wasn't ready to go, no. I bet you weren't ready to go either because there was a promise of a lamborghini if you went to the end. Would you have come through on that. Of course, I would have. I knew you would have. I'm not going to say going -- come on. We have changed the deal at the end. If we make it to the final, you know, she was like we don't have to win it. If we make it to the final. Let me tell you something we'll make your dream come true. Do we have a special -- do we have -- You didn't make it to the final but Erika is a woman of her word and wanted to make sure it came through. That is adorable. America wants to thank you. Yay. Can you bring out the other present? One more present.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Erika Jayne discusses being booted off 'Dancing'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/erika-jayne-discusses-booted-off-dancing-46853650"
}