{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 07:32:04+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Eagles super fan Barry Vagnoni has the ultimate 2,000 square foot man cave at his home in Reading, Pennsylvania.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Frambunctious-devoted-meet-philadelphia-eagles-fans-52810084.json",
    "image_url": "http://a.abcnews.com/images/Nightline/180203_ntl_super_fan_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for From the rambunctious to the devoted: Meet some of Philadelphia Eagles' fans\nGridiron battle. Last month during eagles versus vikings game they are seen as the tough ones. Rough around the edges and ready to tackle at any given time. Though not these folks, I'm talking about these guys. These fans are the most passionate fans in sports. Those infamous Philadelphia Philadelphia eagles fans that demonstrate not all of the action is on the field. Hours before the 52nd super bowl the city of brotherly love finds itself once again battling its famous nickname. We get dirty, we are not afraid of it either. They have such a true passion waiting for that time to twin all. Hopefully then they'll chill out a little bit. When it comes to football eagles fans are the good, the bad and the ugly. It's the same everybody is, brutally honest. If you wonder what a victory looks like, two weeks ago we got ate taste. Philly police prepared greasing down poles before the game, it didn't work. The iconic philly art museum steps once again the back drop. You heard about the man arrested for punching a police horse, well it happened twice. But some eagles fans aren't all so out there. Welcome to bury the hatchet eagles themed bat cave. Fly eagles fly ??? on the road to victory ??? eagles! ??? He calls this addition to his house the locker room decking it out with 16 flat screen TVs even in the bathroom. Never miss any of the action. There's neon everywhere. Bar stools. Autographed items all an eagles fan could ever want. I'm been a Philadelphia eagles fan since 1964. Oh, my word I'm old. Got the money from what he was saving for retirement home and his wife couldn't argue. She said you've worked hard all your life if that's what you want to do that's what you should do. That's what I did. The fans would gather here bleed green. In my mind Philadelphia eagles fans are the best fans in all of sports. This season after losing key players to issues including quarterback Carson Wentz will take the field with back up quarterback Nick Foles and the odds are stacked against them. Fittingly players and fans alike have been sporting these masks in their eagles under dog. Eagles haven't won a championship since Dwight Eisenhower was president. They have great fans and great support. I know when we played in Jacksonville in the super bowl that stadium was practically all eagles fans I expect that again this time. Sure they had actual super heroes like Batman and captain America, Chris Evans, but the eagles had rocky himself. If you haven't guessed it by new I am a die-hard fan. For me rocky is like a real human being we have a statue and everything. It fits our team. Bradley cooper played a rowdy eagles fan in \"Silver lining play book\" and he's one in real-life too. Even WWE star John sec E Na shows his respect and he's a patriots fan but maybe that's so he doesn'tened up on the receiving end of this. The eagles faithful have a rep as one of the mt feared fan bases in sports. Here throwing ice balls at the cowboys, injuring a coach and an official. Can't tell you what a joy it is to come to Philadelphia and dodge not snow balls but ice balls. Fans were so rambunctious there was even a jail and I judge. Fair but tough judge. Under the old stadium just in case. Even Santa has been on the receiving end getting boos as well as snow balls. A 1968 incident so infamous that es prks N 30 for 30 spoofed it. These snow balls came cast Kade cascading down. Throwing snow balls at Santa let's move on. Former quarterback won't stand for slandering these fans. There's always few knuckle heads at every stadium but I can say the Philadelphia fans are the most passionate fans in the national football league. Always couple knuckle heads looking for publicity but 99% of the fans are absolutely N sloou outstanding. I'm excited to watch the super bowl. As is this man who is having more than a hundred friends and family for the big game. The eagles on one side and enemy on the other side. He claims he will be happy whether the eagles win or lose but he would still gladly accept the biggest win. Talk to me Sunday, if you need any photography work from the sky strap a camera on me, I sky because I'll be 20 feet off the ground. For \"Nightline.\" Let's go! Up next, the funny fumble on\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "From the rambunctious to the devoted: Meet some of Philadelphia Eagles' fans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/rambunctious-devoted-meet-philadelphia-eagles-fans-52810084"
}