{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 18:41:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Swedish think tank: South Korea's arms sales record high",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fswedish-tank-south-koreas-arms-sales-record-high-51719725.json",
    "image_url": "http://abcnews.go.com/International/wireStory/swedish-tank-south-koreas-arms-sales-record-high-51719725",
    "language": "en",
    "localpath": null,
    "maintext": "South Korea's arms sales hit record levels last year, pushed by the continuous military threat from North Korea, complicated relations with China and a government decision to increase domestic arms production, a Swedish think tank said Monday.\nThe Stockholm International Peace Research Institute, or SIPRI, reported that arms sales by South Korean companies included in its latest study of the world's 100 largest arms producers stood at $8.4 billion in 2016, up 21 percent from the previous year. The figure covers only those South Korean companies ranked in the study, not the country's entire defense industry.\nSIPRI researcher Aude Fleurant said Seoul has been developing its own arms production since the 1970s to reduce dependency on foreign suppliers because of \"threat perception in the region,\" and the results are now being seen.\nShe said South Korean weapons producers have seen a steady sales increase over the past few years, supported also by the Asian country's economic growth.\n\"The South Korean ministry of defense now procures its weapons from domestic producers, instead of importing them from foreign suppliers,\" noted Fleurant, director for SIPRI's arms and military expenditure program.\nSIPRI's report, published Monday, said the world's 100 biggest armaments groups sold weapons and weapons systems worth $375 billion in 2016, up 2 percent from 2015.\nThe vast bulk of these companies derive from the United States, Russia and Western Europe. SIPRI counts China as a top arms manufacturer, too, but it's excluded in the statistics as no reliable data is available.",
    "source_domain": "abcnews.go.com",
    "title": "Swedish think tank: South Korea's arms sales record high",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/swedish-tank-south-koreas-arms-sales-record-high-51719725"
}