{
    "authors": [
        "Abc News",
        "Michael Rothman",
        "More Clayton",
        "More Michael"
    ],
    "date_download": "2017-08-14 23:47:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The jury ruled against David Mueller in his own lawsuit.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fjury-finds-dj-groped-taylor-swift%2Fstory%3Fid%3D49206323.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/taylor-swift-gty-jc-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A jury found Monday that a preponderance of evidence showed that former DJ David Mueller groped Taylor Swift.\nThe Denver jury, comprised of six women and two men, also found that the singer's mother, Andrea Swift, and her radio manager, Frank Bell, did not intentionally interfere with Mueller's contract and were not responsible for his firing.\nThe jury voted to award Swift the $1 she filed for.\n\"I want to thank Judge William J. Martinez and the jury for their careful consideration, my attorneys Doug Baldridge, Danielle Foley, Jay Schaudies and Katie Wright for fighting for me and anyone who feels silenced by a sexual assault, and especially anyone who offered their support throughout this four-year ordeal and two-year long trial process,\" Swift said in a statement obtained by ABC News. \"I acknowledge the privilege that I benefit from in life, in society and in my ability to shoulder the enormous cost of defending myself in a trial like this. My hope is to help those whose voices should also be heard. Therefore, I will be making donations in the near future to multiple organizations that help sexual assault victims defend themselves.\"\nThe verdict came about four hours after lawyers for both Swift and Mueller made their closing arguments. Last Friday U.S. District Judge William Martinez threw out the former radio host's suit against Taylor Swift, saying there was not enough evidence to prove she got him fired from his Denver radio station. However, Mueller's claim against Swift's mother and her radio manager, Bell, was allowed to proceed, the judge said.\nMueller accused Andrea Swift and Bell of getting him fired.\nDuring her testimony, Andrea Swift, like her daughter, said she did not intentionally call the radio station looking to get Mueller fired, just that “he committed a sexual assault on my daughter” and “I wanted them [his employers at KYGO] to make their own conclusion.\"\nBell, a longtime family friend of the Swifts who serves as an intermediary between the singer and radio stations, said he merely asked the station to look into things.\n\"All I asked him to do is investigate and take action,\" he said.\nMueller had accused Taylor Swift of \"intentional interference with contractual obligations.\" The former DJ first sued Swift in 2015, claiming that she falsely accused him of grabbing her backside at a 2013 meet-and-greet, causing him to lose his job. Taylor Swift then filed a countersuit for assault and battery, claiming that Mueller \"took his hand and put it up my dress,\" according to court documents obtained by ABC News.\nLast week, Mueller, Taylor Swift, Andrea Swift, Bell and Mueller's ex Shannon Melcher, who was present at the time of the alleged incident, all testified in court.\nWhile Mueller and Melcher both testified that the former radio deejay didn't grab or intend to grab the pop singer on her backside, Taylor Swift herself was adamant when she told the jury that Mueller reached up under her skirt and \"latched on to my bare ass cheek.\"\nShe added: \"He was busy grabbing my ass underneath my skirt.\"\nMueller said in depositions that his damages amounted to about $3 million.",
    "source_domain": "abcnews.go.com",
    "title": "Jury finds ex-DJ groped Taylor Swift",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/jury-finds-dj-groped-taylor-swift/story?id=49206323"
}