{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 01:48:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Serious questions being raised about safety, why the fire spread so rapidly and if the fire alarms were working.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Flondon-high-rise-apartment-building-deadly-towering-inferno-48046838.json",
    "image_url": "http://a.abcnews.com/images/WNT/170614_wn_longman3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for London high-rise apartment building becomes deadly towering inferno\nNext tonight, to that devastating high-rise fire in London. The death toll is continuing to climb tonight. Flames trapping more than 100 families inside. Many as they slept. And this question, were warning signs ignored? ABC's James Longman from London. Reporter: A 24-story building up in flames. Explosions, fire balls, and residents trapped inside. Let me out! Reporter: This resident streaming live on Facebook. Some seen dropping down makeshift ropes fastened from bed sheets, desperately attempting escape. This guys sending a rope! Reporter: Others resorting to this -- A lady from what she was saying, I'm about to throw my baby, please catch the baby. Reporter: The baby survived a nearly ten-story fall, caught by a bystander. There are serious questions being raised tonight about why the fire spread so rapidly and if the fire alarms were working properly. Police say there are 12 victims so far. Residents are complaining that their prior warnings about the building's safety were ignored. Tonight, fire crews are scouring the building, but at this point it will be to look for bodies. Authorities saying it is very unlikely anyone still missing will have survived. David. James Longman from London, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "London high-rise apartment building becomes deadly towering inferno",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/london-high-rise-apartment-building-deadly-towering-inferno-48046838"
}