{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:47:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Goldman Sachs' profits miss forecasts as trading struggled",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fgoldman-sachs-profits-miss-forecasts-trading-struggled-46859874.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_44ee5b4f90084ecdaa5ed7aa4c1176fb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Goldman Sachs had a rare miss in its first quarter results, the bank said Tuesday, as its typically best-in-class trading desks did not perform as well as its competitors. The bank's stock to fall in pre-market trading.\nThe New York-based investment bank earned $2.16 billion compared with $1.2 billion in the same period a year earlier. On a per-share basis, Goldman Sachs earned $5.15 a share versus $2.68 a share in the same period a year earlier. But Goldman's results were well below the $5.31 a share expected by analysts, according to FactSet.\nIn a statement, Goldman Sachs Chairman and CEO Lloyd Blankfein called the quarter \"mixed\" and that client activity was \"challenged.\"\nUnlike its competitors, Goldman's trading desks struggled in the first quarter. The bank's trading division had net revenue of $3.36 billion in the first quarter, down 2 percent from a year earlier and down 7 percent from the fourth quarter. Trading revenues in bonds, currencies and commodities was effectively flat in quarter while trading revenues for stocks were down 6 percent from a year earlier.\nThe hit to Goldman's trading in the first quarter is a rare misstep for a bank known to have some of the best traders on Wall Street. JPMorgan Chase, Citigroup and Bank of America's trading divisions all reported increases in trading last quarter.\nGoldman's investment banking business grew profits in the quarter, but its growth was not all the different from its competition. Investment banking net revenue was $1.7 billion in the quarter, up 16 percent from a year earlier. Underwriting revenue rose 37 percent from a year earlier.\nFirm wide, the bank's had net revenue of $8.03 billion compared with $6.34 billion in the same period a year earlier. That also missed analysts' expectations of $8.37 billion.\nShares of Goldman Sachs sank 3 percent in pre-market trading to $219.99.",
    "source_domain": "abcnews.go.com",
    "title": "Goldman Sachs' profits miss forecasts as trading struggled",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/goldman-sachs-profits-miss-forecasts-trading-struggled-46859874"
}