{
    "authors": [
        "Abc News",
        "More Ben"
    ],
    "date_download": "2017-08-14 13:20:46+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Thousands of Haitians with uncertain immigration status have fled the United States in recent weeks, walking across the New York border into Quebec seeking a safe haven.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fhaitians-chasing-false-promises-flee-united-states-canada%2Fstory%3Fid%3D49178287.json",
    "image_url": "http://a.abcnews.com/images/International/us-immigration-canada-1-rt-jt-170812_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Thousands of Haitians with uncertain immigration status have fled the United States in recent weeks, walking across the New York border into Quebec seeking a safe haven in Canada, according to the United Nations' refugee agency and Canadian immigration lawyers.\nAn influx of asylum seekers has put a strain on Canadian authorities, which has led them to build tents on the border, shift resources and set up new shelter space. The influx has in part been from Haitians living in the U.S. who say they fear the Trump administration will soon end their protected status in the country, sending them back to Haiti.\nThe U.S. Department of Homeland Security has suggested that a program that allows Haitians to reside in the United States -- set up after an earthquake devastated their country in 2010 -- may end in January. Many Haitians crossing into Canada are saying they fear their protected status in the U.S. would soon end, according to the UN and immigration attorneys.\nInaccurate information spread through word of mouth and via social media has left many Haitians in the U.S. with the impression that Canada would be more willing to accept them as refugees, according to the UN, lawyers, and a community organization for Haitians in Canada. But Canada offers fewer protections than they would get south of the border. In the U.S., many Haitians have temporary protected status (TPS), meaning they can remain in the country without being deported; a similar program ended in Canada in 2014.\n“When they come to the border, the way they are being received is welcome, it’s warm,” Chantal Ismé, the vice president of the board of directors of La Maison d’Haïti, a Haitian community and cultural center in Montreal, told ABC News. “But it’s a way of functioning. It’s not pushing aside the laws. And Canada will apply the law.”\nSummer rush\nDuring the first six months of this year, Canadian authorities apprehended 4,345 asylum seekers crossing the border illegally -- over three quarters of whom were picked up in Quebec, according to government figures. The Canada Border Services Agency would not say how many were from Haiti, although it did say Haitian was the most common nationality in that time period.\nIn the winter months following the 2016 U.S. presidential election, Canada saw a spike in illegal crossings as those concerned about Donald Trump enacting tough immigration policy sought asylum there. \"To those fleeing persecution, terror & war, Canadians will welcome you, regardless of your faith,\" Canadian Prime Minister Justin Trudeau tweeted soon after Trump's presidential inauguration in January.\nChristinne Muschi/Reuters\nIn the spring months there was a dropoff, but the flow picked up again as temperatures rose and school let out. Numbers have especially fluctuated just north of Champlain, New York, near the official entry point at Saint-Bernard-de-Lacolle, Quebec, Nicholas Dorion, a spokesman for the Canada Border Services Agency, told ABC News.\nAt the end of June, around 50 migrants were crossing each day, and in the last few weeks, the daily average jumped to 150-200 -- around 70 percent of whom were Haitian, and many of whom had been in the U.S. for years, according to Jean-Nicolas Beuze, the Office of the United Nations High Commissioner for Refugees' representative in Canada.\nStéphane Handfield, an immigration lawyer in Montreal whose firm represents over 100 Haitians who have recently crossed the border, told ABC News the daily rate was even higher. The Canadian government has yet to release figures for July or August, but Canada's Immigration and Refugee Board said Friday that thousands were believed to have crossed into Quebec \"in the last month.”\n“We have seen a shift of much more Haitians coming to Canada,” Beuze told ABC News.\nMany of those fleeing the U.S. take taxis to one rural New York road that ends at the Canadian border, then walk a few yards across vegetation -- in an instant, leaving behind their lives in the U.S. -- and are, as they expect, promptly detained and processed by Canadian authorities. This is the first step in their asylum-claim process. One day last week, a young girl wearing a Hello Kitty backpack over her puffy winter coat was met by an officer after the quick walk -- just one of many children who have come along for the journey.\nAs shelters overflowed this month, 900 cots were rolled out in Montreal's Olympic stadium for asylum-seekers; 90 percent of the 800 people there last week were Haitian, Cédric Essiminy, a spokesman for the stadium, told ABC News. Nearly 100 Canadian soldiers were deployed to the Quebec border on Wednesday to set up a temporary camp for around 500 people, the Canadian Armed Forces said.\nFalse promises\nHaitians walking across often have wrong impressions about the likelihood they could stay in Canada in the long term, according to Canadians helping them.\nAround 60,000 Haitians in the U.S. have been protected from deportation through TPS, which was initiated following the 2010 earthquake that devastated their country. In May, then-U.S. Secretary of Homeland Security John Kelly extended the program through January, but he suggested he might end it then.\n“I believe there are indications that Haiti -- if its recovery from the 2010 earthquake continues at pace -- may not warrant further TPS extension past January 2018,” said Kelly, now the White House chief of staff.\nWhile false information has spread over social media and in Haitian diaspora media that Canada would welcome them with open arms, in fact, Canada’s post-earthquake protected status program for Haitians ran out in 2014.\nHaitians are afforded no special protections in the country, and refugee claims are examined under the same criteria used in the U.S. In 2016, 51.2 percent of Haitians’ claims that were processed were accepted in Canada, according to Canada’s Immigration and Refugee Board, just a few points higher than the United States’ acceptance rate, according to the UNHCR.\n“It’s true that Canada is welcoming, but in order to stay in Canada as a refugee, you need to have a valid claim, and I’m not sure all of those people crossing the border have valid claims,” Jean-Sébastien Boudreault, president of the Quebec Immigration Lawyers Association, told ABC News.\nFarah Larrieux, a Haitian TV personality in Miramar, Florida, said panic is pushing the spread of erroneous rumors, like a WhatsApp message she received in June saying Canada would cover Haitians’ immigration costs.\n“There’s a lot of information circulating within the different Haitian communities, in New York, in New Jersey, in south Florida, where they inform people that the Canadian government is waiting to welcome people,” Larrieux, who herself holds temporary protected status in the U.S., told ABC News.\nThe fear is leading people who are safe in the U.S. for now to put themselves at greater risk.\n\"Some of them, they didn’t know that if they get refused, Canada will send them back to Haiti,\" Handfield, the immigration lawyer, said. \"I’m pretty sure that a lot of them will get refused as refugees in Canada.”\n‘Nobody has a crystal ball’\nHaitians aren’t the only ones crossing into Canada -- although they were the most common nationality during the first six months of this year, according to the Canada Border Services Agency. Sudanese, Turkish, Eritrean, and American asylum-seekers were also common, the agency said.\nQuebec serves as a particular draw to Haitian asylum seekers because of a shared language -- French -- and as the home to 90 percent of the 150,000 Haitians living in Canada, according to Ismé, of La Maison d’Haïti. Most live in the Montreal area, where the community has helped the newcomers find housing, furniture, and healthcare, and is pushing for access to schooling, she told ABC News.\nBeuze, the UNHCR representative, said that the numbers so far are “completely manageable” but that it was difficult to predict whether the flood will continue.\n“Nobody has a crystal ball,” he said. “It’s a very individual decision at the end of the day, to decide to leave everything behind and come to Canada. And it’s not a light one.”",
    "source_domain": "abcnews.go.com",
    "title": "Haitians chasing false promises flee from United States to Canada",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/haitians-chasing-false-promises-flee-united-states-canada/story?id=49178287"
}