{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 23:56:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "A baby reportedly survived a nearly 10-story fall as its mother tried to save it from an inferno at Grenfell Tower in London.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fbaby-survives-10-story-fall-residents-flee-deadly%2Fstory%3Fid%3D48045123.json",
    "image_url": "http://abcnews.go.com/International/baby-survives-10-story-fall-residents-flee-deadly/story?id=48045123",
    "language": "en",
    "localpath": null,
    "maintext": "A baby reportedly survived a nearly 10-story fall as residents scrambled to escape a massive blaze early Wednesday morning at a residential high-rise building in West London.\n\"A lady from what she was saying: 'I'm about to throw my baby. Please, catch the baby,'\" one witness said.\nOn Wednesday, a fire engulfed the 24-story Grenfell Tower. More than 70 people were injured and 12 were killed, according to authorities.\nMassive fire engulfs London high-rise, leaves at least 12 dead\nThe infant was reportedly caught by a bystander. Witnesses said they could see people screaming from windows: \"Help! Help!\"\nOthers said they saw mothers tossing their children from windows and people simply jumping. Images and videos showed residents dropping makeshift ropes made from bed sheets from windows in an attempt to escape.\nAuthorities said they are monitoring the stability of the charred structure, but that firefighters have managed to search \"most\" of the building for remaining people. The Metropolitan Police Service confirmed the rising death toll at a news conference Wednesday.\n\"I do anticipate that the number of fatalities will sadly increase beyond those 12,\" Police Commander Stuart Cundy said.",
    "source_domain": "abcnews.go.com",
    "title": "Baby survives nearly 10-story fall as residents flee deadly London high-rise fire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/baby-survives-10-story-fall-residents-flee-deadly/story?id=48045123"
}