{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:27:51+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Spice Girls reunite to 'explore some incredible new opportunities together'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fspice-girls-reunite-explore-incredible-opportunities%2Fstory%3Fid%3D52805715.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/spice-girls-01-as-gty-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hey, Spice Girls fans -- \"Wannabe\" really happy?\nThen take a look at the first photo of all five Spices, together in the same room for the first time since 2012.\nTeam member Mel B captioned the pic, \"These amazing women have helped me become who I am,so to all the girls out there remember “friendship never ever ends”!!!! Boom #spicegirls #coloursoftheword #wantwereallyreallywant #mumsworkinghard #blastoff.\"\n\"We have enjoyed a wonderful afternoon catching-up and reminiscing about the amazing times we have spent together,\" a statement issued by the former band-mates says. \"We are always overwhelmed at how much interest there is across the whole world for The Spice Girls. The time now feels right to explore some incredible new opportunities together.\"\nThe statement adds, \"We all agree that there are many exciting possibilities that will once again embrace the original essence of The Spice Girls, while reinforcing our message of female empowerment for future generations.\"\nThe British paper The Sun reports that all five members met up at Geri \"Ginger Spice\" Halliwell's home, along with their former manager, Simon Fuller, who went on to create \"American Idol.\"\nVictoria \"Posh Spice\" Beckham also captioned the photo of the women with Fuller, \"Love u all so much!!! X Such a great day!! Thank u Simon!\" The snap of the five women together was captioned, \"Love my girls!!! So many kisses!!! X Exciting x #friendshipneverends #girlpower.\"",
    "source_domain": "abcnews.go.com",
    "title": "Spice Girls reunite to 'explore some incredible new opportunities together'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/spice-girls-reunite-explore-incredible-opportunities/story?id=52805715"
}