{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 15:23:05+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "ABC news senior meteorologist Rob Marciano gets training in one of his favorite winter Olympic sports.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fyear-girl-teaches-rob-marciano-ski-jump-52814776.json",
    "image_url": "http://a.abcnews.com/images/GMA/180203_gma_marciano2_745_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 9-year-old girl teaches Rob Marciano ski jump\nThe olympics now less than a week away and one of my favorite events to watch is ski jumping. Watching those athletes fly through the air and make it look so easy. Recently I got a chance to get airborne myself sort of thankfully I had the help of a future olympian. Welcome to steamboat spring, Colorado, with the most olympians in North America. This is where they all come to train. The reason we have so many different ski jumps it's a progression. I don't know how many we'll progress today. What's the first step, give it to me. I'll need reinforcements. We'll have fun but I'm going to bring in one of my big guns. This is Eva. Hi. I saw you go off those big jumps. You're not going to make me go off a big jump, are you? No. My life is in your hands. Are you ready. Yes, ankles cocked and knees straight so you can kind of feel a little bit of tension. Okay. I'm tense. Don't worry about that. That is good. I impressed a 9-year-old. Thank you. What are we saying to ourselves. I can do this. I can do this. All right. I can't but I'm going to try. I can do this, right coached to? You can do this. This is a jump we use for 6 or 7-year-olds. Aaagh! Oil not supposed to flap my arms like that. Whoo-hoo! Yeah! So much fun. How do you think I did? Good. You did really good. Do you think I'm ready for the olympics? No, no, no. She is so cute. She's been jumping since she was 4 years old. Look for Eva to be in the 2026 olympics. I have no doubt she's going to make it. I am not going to make it. Yes, I didn't get up that high but still frightening. Didn't catch a lot of air, bro. Look, dude, I have been skiing for a long time and I was only on the bunny hill. I was impressed. I thought it was really good. We couldn't do it. You had great form by the way. Thank you, Paula and I didn't crash. Todd Wilson who is the coach shortly after the shoot he got a call saying that four of his students made the olympic team. 15 olympians alone from steamboat, good luck That's amazing. Yeah. The same coach that told you you were jumping on a hill that was for 6 and 7-year-olds. He also told me it's as safe as playing tennis or soccer which I didn't get hurt so I guess it's that way, anyway, good luck to everybody competing. Fun assignment. Braver than all of us. Or more stupid. No, brave but kind of a little the other thing too.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "9-year-old girl teaches Rob Marciano ski jump",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/year-girl-teaches-rob-marciano-ski-jump-52814776"
}