{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:49:47+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "A Look at the Major Attacks in Turkey Over the Past Year",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmajor-attacks-turkey-past-year-44511140.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_3daba2852d824b7a90d4d09f7f13a199_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A deadly New Year's assault on an Istanbul nightclub follows a long string of attacks in Turkey over the past year. A look at the most significant attacks:\n— Jan. 12, 2016, Istanbul: Suicide bomber kills 12 German tourists in historic district. Authorities say attacker was linked the Islamic State group.\n— Feb. 17, Ankara: A suicide car bomb apparently targeting military personnel kills 29 people in an attack claimed by TAK, an offshoot of the Kurdistan Workers' Party.\n—March 13, Ankara: Kurdish woman blows herself up in a car at a busy transport hub, killing 37 people in an attack claimed by TAK, also known as the Kurdish Freedom Falcons.\n— March 19, Istanbul: Turkish suicide bomber kills five people in the city's main pedestrian shopping street, Istiklal. Turkish officials say bomber was linked to IS.\n— March 31, Diyarbakir: Car bomb kills seven police officers and wounds 27 people, including 13 police.\n— April 12, Gaziantep: Syrian journalist dies from gunshot wounds from attack claimed by IS.\n— April 27, Bursa: Female suicide bomber wounds 13 in a historic district of Turkey's fourth largest city.\n— May 1, Gaziantep: Car bomb at the entrance of a police station kills two officers, 22 other people wounded.\n—May 10, Diyarbakir: Car bomb strikes police vehicle carrying officers escorting seven detained Kurdish militants, killing three people and wounding 45 others.\n— May 12, Istanbul: Car bomb targeting a military garrison explodes during rush hour, wounding eight people.\n— June 7, Istanbul: Car bomb hits a riot police bus during the morning rush hour, killing 11 people and wounding 36. A Kurdish militant group claims responsibility.\n— June 8, Midyat: Kurdish suicide car bomber kills five people and wounds 51, including 23 civilians, outside a police headquarters near Turkey-Syria border.\n— June 17, Istanbul: Car bomb explodes as a police vehicle passes by, killing 11 people.\n— June 28, Istanbul's Ataturk Airport: Three suicide bombers armed with assault rifles storm airport, killing 44 people and wounding nearly 150.\n— July 15: About 270 people die in military coup attempt.\n— Aug. 17, Van: Car bombing at a police station kills a police officer and two civilians; 53 civilians and 20 police officers wounded.\n— Aug. 18, Elazig: Car bomb at police headquarters kills at least five people and wounds more than 140.\n— Aug. 20, Gaziantep: Suicide bomber — possibly as young as 12 — kills at least 51 people at an outdoor Kurdish wedding party. IS suspected of directing attack.\n— Aug. 26, Cizre: Kurdish suicide bomber rams an explosives-laden truck into a police checkpoint, killing at least 11 officers and wounding 78 other people.\n— Sept, 12. Van: Car bomb wounds 50 people outside ruling party's municipal headquarters.\n— Oct. 6, Istanbul: Motorcycle bomb explodes near a police station, wounding at least 10 people.\n— Oct. 8, Ankara: Two suicide bombers blow themselves up after refusing to surrender to police. No one else was hurt.\n— Oct. 9, Hakkari province: Kurdish militants detonate car bomb outside a military checkpoint in the southeast, killing 10 soldiers and eight civilians.\n— Oct. 10, Dicle: A top local official of the ruling Justice and Development Party is killed when attackers open fire at a gas station he owned.\n— Nov. 4, Diyarbakir: Car bomb near a riot-police bus kills at least 11 people, including two police officers. A Kurdish militant group and IS both claim responsibility.\n— Nov. 24, Adana: Car bomb targeting a government building kills at least two people and wounds 33 others.\n— Dec. 10, Istanbul: A double bomb attack outside soccer stadium kills 44 people and wounds 149.\n—Dec. 17, Kayseri province: Suicide car bomber targeting a public bus transporting off-duty soldiers kills 13 troops and wounds 56 other people.\n—Dec. 19, Ankara: A Turkish riot policeman assassinates Russian Ambassador Andrei Karlov at a photo exhibition.\n—Jan. 1, 2017, Istanbul. An assailant opens fire at a crowded nightclub during New Year's celebrations. Istanbul's governor says the attack killed at least 39 people and wounded 69 others.",
    "source_domain": "abcnews.go.com",
    "title": "A Look at the Major Attacks in Turkey Over the Past Year",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/major-attacks-turkey-past-year-44511140"
}