{
    "authors": [
        "Abc News",
        "More Bill"
    ],
    "date_download": "2018-04-25 00:05:49+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Tennessee lawmakers honored James Shaw Jr. Tuesday for his bravery.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fwaffle-house-shooting-hero-honored-tennessee-lawmakers-emotional%2Fstory%3Fid%3D54690862.json",
    "image_url": "https://s.abcnews.com/images/US/james-shaw-waffle-house-hero-wkrn-jc-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In an emotional ceremony Tuesday at the Tennessee Capitol, lawmakers gave James Shaw Jr., the man who stopped the deadly attack a Waffle House in a Nashville suburb, a standing ovation for his bravery.\n\"You were confronted with the most unspeakable evil imaginable and you acted with the utmost honor, heroism, imaginable,\" state Rep. Jason Powell told Shaw. \"And I want to say, James Shaw Jr., you are my hero and you are Tennessee's hero.\"\nWKRN\nShaw, dressed in a suit and tie, was honored along with his best friend, Brandon McMurry, who was also at the Waffle House early Sunday when a gunman opened fire with an AR-15 assault rifle, killing four people and leaving four others injured, two critically.\nShaw, a 29-year-old AT&T worker and father of a 4-year-old girl, told \"Good Morning America\" on Monday that he hid behind a door in the restaurant and when the suspected gunman, Travis Reinking, went to reload his weapon, he sprang into action. He grabbed the barrel of the gun and wrested it away from the suspect, throwing it over a counter and forcing the man outside.\nAuthorities say Shaw's courageous actions saved numerous lives, but he has refused to call himself a hero, saying he only took on the gunman to save his own life.\nShawn Poynter/The New York Times via Redux\n\"I never thought I would be in a room with all the eyes on me but, you know, I am very grateful to be here,\" Shaw told the lawmakers today. \"All I can say is ... this was a true test of a man. I do, once again, apologize to the people that lost loved ones, friends or family.\"\nHe said he went to Vanderbilt University Medical Center to visit some of the victims who were wounded.\n\"They all remember me,\" he said. \"But I want you all to know, and I'll say this again, I am a genuine person: I didn't actually do it to save lives. I did it to save my life. In saving my life, I saved other lives. So that's probably the greatest things you could do.\"\nLacy Atkins/The Tennessean via USA Today Network\nMcMurry, who also addressed the politicians, praised Shaw as not only his best friend but \"a great man.\"\nHe said that during the shooting rampage, he tried to get Shaw to hide in a bathroom with other patrons of the restaurant, knowing that from where they were in a hallway leading to the restrooms that there was no other way out of the establishment except the front door.\n\"But he sometimes doesn't listen to me, and this is by far the best time that you didn't listen to me and I appreciate that,\" McMurry told Shaw.\nMark Humphrey/AP\nMeanwhile, an online GoFundMe page set up to honor Shaw has raised more than $86,000 for him as more than 2,500 people donated.\n\"I normally don't get involved directly in these matters, but James' grace has inspired me to start this page and give him the support I feel he deserves,\" wrote Yashar Ali of New York, who established the fund-raising campaign on Monday.\n\"According to news reports, James has a 4-year-old daughter. Perhaps this money can be used for her college fund or some other education-related expense,\" Ali wrote. \"But I'd be just as happy if James used some of this money to take his family on a nice vacation.\"",
    "source_domain": "abcnews.go.com",
    "title": "Waffle House shooting hero honored by Tennessee lawmakers in emotional ceremony",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/waffle-house-shooting-hero-honored-tennessee-lawmakers-emotional/story?id=54690862"
}