{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:32:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Driver purposely steers into French pizzeria, killing girl",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpolice-girl-killed-car-plows-french-pizzeria-49214008.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_9850b69846294fdda62e04c358d28e2c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A man who may have been trying to kill himself rammed his car into a pizzeria east of Paris on Monday, killing a 13-year-old girl and injuring her younger brother and at least 11 others, authorities said.\nThe driver was immediately arrested. Police said the man's actions in the town of Sept-Sorts were deliberate, but not thought to be terrorism-related.\nThe 13-year-old girl and her brother were among the restaurant patrons eating on the outdoor terrace of Pizzeria Cesena when a man in a BMW accelerated toward them, an official with the national gendarme service told The Associated Press.\nThe girl died immediately, while the boy's injuries are considered life-threatening, the official said. At least three others were hospitalized in serious condition, and eight more sustained light injuries, said the official, who was not authorized to be publicly named.\nThe incident reignited fears in France after a string of attacks in which a vehicle was the weapon of choice. An Algerian man drove his car into a group of French soldiers last week, and an Islamic extremist truck attack in the French city of Nice left 86 people dead a little more than a year ago.\nThe man arrested in Monday's attack is thought to have tried to kill himself last week, French Interior Ministry Pierre-Henry Brandet said on BFM television. Brandet said the man, born in 1985, was not known to intelligence or police. He did not identify him.\nTwo police officials said the incident is considered over and authorities are not searching for accomplices, but to find out what motivated the driver.\nA judicial official said Monday night that the Paris prosecutor's office, which oversees French terrorism investigations, was not involved in the case because there was no proof of terrorism at this stage. A security official echoed that there was no evidence of a political or Islamic extremist motive.\nThe targeted pizzeria is in a shopping zone in the town of Sept-Sorts about 65 kilometers (40 miles) east of Paris near Champagne country. Police cordoned off a large perimeter of the area.\n———\nAssociated Press writer Angela Charlton reported this story from Paris and AP videographer Olgeg Cetinic reported in Sept-Sorts.",
    "source_domain": "abcnews.go.com",
    "title": "Driver purposely steers into French pizzeria, killing girl",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/police-girl-killed-car-plows-french-pizzeria-49214008"
}