{
    "authors": [
        "Abc News",
        "More Cheyenne"
    ],
    "date_download": "2018-05-30 23:33:50+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The president did not repudiate Roseanne Barr for the racist remarks about former Obama adviser Valerie Jarrett.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-weighs-racist-roseanne-barr-tweet-apology-disney%2Fstory%3Fid%3D55535251.json",
    "image_url": "https://s.abcnews.com/images/Politics/roseanne-barr-view-gty-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The White House responded to the outrage over Roseanne Barr's racist tweet Wednesday by saying that \"no one is defending what she said\" but at the same time attacking \"hypocrisy in the media,\" citing \"the most horrible things\" said \"about this president and nobody addresses it.\"\nInterested in Roseanne? Add Roseanne as an interest to stay up to date on the latest Roseanne news, video, and analysis from ABC News. Add Interest\nReading from a prepared statement at a White House briefing, press secretary Sarah Sanders asked, as the president did in a tweet earlier in the day, why Disney Chairman and CEO Bob Iger had called former Obama adviser Valerie Jarrett to apologize for Barr's tweet and hadn't called him to do the same for comments made about him on Disney-owned ABC's \"The View\" and another Disney network, ESPN.\n\"Where was Bob Iger's apology to the White House staff for Jamele Hill calling the President, and anyone associated with him, a white supremacist? To Christians around the world for Joy Behar calling Christianity a mental illness? Where was the apology for Kathy Griffin going on a profane rant against the President on The View after a photo showed her holding President Trump’s decapitated head? And where was the apology from Bog Iger for ESPN hiring Keith Olbermann after his numerous expletive-laced tweets attacking the President as a Nazi and even expanding Olbermann’s role after that attack against the President’s family.\"\n\"This is a double-standard that the President is speaking about, nobody is defending her comments, they’re inappropriate but that’s what the point that he was making,\" Sanders said.\nNeither Iger nor Disney immediately responded to requests from ABC News for comment.\nGriffin, who was fired from CNN's New Year's Eve program, apologized for her actions but later took back her apology on \"The View.\" She reportedly used an expletive referring to Trump and said, “This president is different and I have been through the mill and so now I’m back on the road.\"\nBehar apologized for referring to comments made about Pence by former Trump White House aide Omorasa Maginault Newman on the CBS program \"Celebrity Big Brother\" warning against Pence ever becoming president. “He’s extreme,” Newman said. “I’m Christian, I love Jesus, but he thinks Jesus tells him to say things.”\n“It’s one thing to talk to Jesus,\" Behar said. \"It’s another thing when Jesus talks to you. That’s called mental illness, if I’m not correct, hearing voices,\" Behar reportedly said on \"The View.\"\nIger was later quoted as saying Behar's comment was \"wrong\" and that her apology was appropriate.\nAfter Hill tweeted comments about Trump, the network put out a statement saying they “do not represent the position of ESPN. We have addressed this with Jemele and she recognizes her actions were inappropriate.”\nLater, as reported in Vanity Fair in October, Iger explained that the decision not to fire Hill was made with context in mind, referring to Trump's comments last August about the white nationalist and counter-protests in Charlottesville that there were \"some very fine people on both sides.\"\n“There are a lot of people out there who were outraged,” Iger said. The promise that was given to them in the Constitution, that they fought for in the Civil War and civil rights movement, he said, is “the opposite” of what Americans have seen in the last few months, Vanity Fair quoted him as saying.\n“It’s hard for me to understand what it feels like to experience racism,” he added in the interview. “I felt we needed to take into account what other people ESPN were feeling at this time and that resulted in us not taking action.\"\nESPN has taken conservative fire for recently rehiring Olbermann who has blasted Trump as a \"Nazi\" in tweets.\nSanders comments Wednesday came after she was asked whether the president has spoken to Barr and why he chose to address the ABC apology instead of the underlying issue of concerns about the racist comment she tweeted out. Sanders did not say whether the president specifically condemned Barr's tweet.\nEarlier Wednesday, the day after ABC canceled the hit reboot of “Roseanne,\" Trump — a fan of the show — weighed in on Twitter and didn’t repudiate the racist remarks Barr made but instead called for an apology from Iger.\nBob Iger of ABC called Valerie Jarrett to let her know that “ABC does not tolerate comments like those” made by Roseanne Barr. Gee, he never called President Donald J. Trump to apologize for the HORRIBLE statements made and said about me on ABC. Maybe I just didn’t get the call? — Donald J. Trump (@realDonaldTrump) May 30, 2018\nThe apology from Iger Trump referred to came Tuesday, before ABC publicly announced the show was canceled in a statement from Channing Dungey, president of ABC Entertainment. \"Roseanne's Twitter statement is abhorrent, repugnant and inconsistent with our values, and we have decided to cancel her show,\" she said in the statement. Iger later added his own comment to the statement on Twitter. \"There was only one thing to do here, and that was the right thing,\" Iger tweeted. ABC Television Group and ABC News are both owned by Disney, though the entertainment company is separate from the news division.\nAt an MSNBC town hall on racism Tuesday night, Jarrett thanked Iger for calling her. \"I want to mention Bob Iger, who is the CEO of Disney called me before the announcement, he apologized, he said he had zero tolerance for that sort of racist, bigoted comment and he wanted me to know before he made it public that he was cancelling his show and so I appreciate that they did that so swiftly,\" she said, adding that she thought it was the right move.\nBarr's post early Tuesday morning, which has since been deleted, said that Jarrett, who is African-American, looked like \"muslim brotherhood & planet of the apes had a baby ...\" She has since apologized.\nThere is a long history in the U.S., dating back to the days of slavery, of African Americans being depicted and referred to as apes or monkeys as a way to dehumanize and justify discrimination.\nTwitter\nWednesday's tweet was the first comment on the firestorm from the president, though he called the show and its success “great” when it aired back in March. Trump didn't mention the controversy at a rally in Nashville on Tuesday night.\nIn Ohio in March, he told the crowd he called Barr after the show aired to congratulate her.\nAndrew Harnik/AP\n“Even look at Roseanne. I called her yesterday. Look at her ratings, look at her ratings,” the president said, adding that the show was doing well because it resonated with his base. “And it was about us. They haven't figured it out, the fake news hasn't quite figured it out yet,” he said.\nOn “Good Morning America” earlier that day, Barr called the call “exciting” and said she’s known the president for a long time.\n\"I've known him for many years and he's done a lot of nice things for me over the years, and so it was just a friendly conversation about working and television and ratings,\" Barr told “Good Morning America” anchor George Stephanopoulos over the phone.\nShe also reflected on a need for more “civilized” conversation in the country.\n\"That's what we need to do as a country is figure out what we don't like, talk to each other and discuss how we're going to get it changed or fixed,\" Barr said. \"I really hope that it opens up civil conversation between people instead of just of mud-slinging. I really do because I think we need to be more civilized in that,\" she said.",
    "source_domain": "abcnews.go.com",
    "title": "Trump weighs in on racist Roseanne Barr tweet asking for his own apology from Disney CEO",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/trump-weighs-racist-roseanne-barr-tweet-apology-disney/story?id=55535251"
}