{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:15:14+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Carolina's Equipment Man Savors Chance to Skate in a Game",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fcarolinas-equipment-man-savors-chance-skate-game-44515034.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/carolinas-equipment-man-savors-chance-skate-game-44515034",
    "language": "en",
    "localpath": null,
    "maintext": "Jorge Alves usually sharpens the Carolina Hurricanes' skates. Lately, the team's equipment manager has been lacing up his own.\nIt's been a wild past few days for Alves. The 37-year-old former Marine, ex-minor leaguer and veteran of the team's equipment staff suddenly found himself in uniform for an NHL game — and even, for 7.6 unforgettable seconds, on the ice — as the Hurricanes' emergency goalie while regular backup Eddie Lack was too sick to play.\nAnd when the Hurricanes returned to practice Monday, he was back on the ice again — he regularly suits up during morning skates when one of the goalies on the roster is unavailable — and trying to get comfortable with the attention his unusual story has generated.\n\"This is the brightest stage in our sport, and it's just, to have the honor to do this, everybody dreams about it,\" Alves said. \"Just working out and running and stuff, I'm always thinking about it — what if it ever happened? What would I do? How would I react? And then, when it actually did happen, I kind of went blank. You can't prepare for that. It was unexpected and it was just quite a memory.\"\nIt's not like Alves doesn't know his way around a rink: After serving four years in the Marines, he played club hockey at North Carolina State from 2002-04 and skated in the ECHL and the low-level Southern Professional Hockey League. He first worked with Carolina's equipment staff during the 2003-04 season and became a full-time equipment manager in 2012-13.\nThe Hurricanes found themselves in a pinch when Lack fell ill before Saturday night's game at Tampa Bay. Roughly two hours before the puck drop, they announced the signing of Alves to a professional tryout contract and issued him jersey No. 40. His mask — which he painted himself, based on drawings by a local illustrator — features caricatures of the team's other equipment men.\n\"I think we were literally watching that guy's dream come true right before our eyes,\" starter Cam Ward said. \"Seeing how emotional he got before that game made everybody emotional. And I said to him right before the game, 'They don't ask how or why, but you made it to the NHL.'\"\nWard bucked the tradition of having the starting goalie lead the team onto the ice for pregame warmups, letting Alves have the spotlight for himself. And with 7.6 seconds left and the outcome all but decided — the Lightning led 3-1 — coach Bill Peters sent Alves onto the ice to replace Ward. He didn't have to face a shot but was handed the puck by teammate Jeff Skinner.\n\"Every time I see it, I kind of get choked up,\" Alves said. \"Seven-point-six seconds is going to be near and dear to me.\"\nA repeat doesn't seem likely Tuesday night when New Jersey visits: Peters says if Lack is too sick to skate against the Devils, the team will recall someone from its AHL affiliate in Charlotte.\nThat seems fine with Alves, who joked with alternate captain Jordan Staal that the Hurricanes' shooters weren't about to take it easy on him during his first practice since his big debut.\n\"I told Jordan, 'It was only 7.6 seconds, guys,'\" Alves said. \"I'm not an NHLer.\"",
    "source_domain": "abcnews.go.com",
    "title": "Carolina's Equipment Man Savors Chance to Skate in a Game",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/carolinas-equipment-man-savors-chance-skate-game-44515034"
}