{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 14:26:13+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fminnesota-judge-rule-enbridge-energys-line-project-54663066.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_7e82d5c742b442ad90d1dc4684f884ae_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Minnesota regulators should approve Enbridge Energy's proposal for replacing its aging Line 3 crude oil pipeline only if it follows the existing route rather than company's preferred route, an administrative law judge recommended Monday.\nThe proposal has drawn strong opposition because Enbridge's preferred route would carry Canadian tar sands crude from Alberta across environmentally sensitive areas in the Mississippi River headwaters region where American Indians harvest wild rice and hold treaty rights.\nAdministrative Law Judge Ann O'Reilly's recommendation that the Public Utilities Commission should order that the replacement follow the existing route sets up further disputes, however, because the existing line crosses two Ojibwe reservations where tribal governments have made it clear that they won't consent and want the old line removed altogether.\nO'Reilly wrote that Enbridge has established that the project is needed, but that the negative consequences to Minnesota of the company's more southerly preferred route outweigh the benefits. The cost-benefit analysis shifts in favor of approving the project if Enbridge builds the pipeline in Line 3's existing trench, she said.\nThe judge noted that Enbridge's easements with the federal government that allow the company to run six pipelines through the two reservations, including Line 3, expire in 2029, and the commission can't require the tribes to consent to replacing Line 3 within their reservations. But she said commission approval of in-trench replacement would likely encourage Enbridge and the tribes to \"accelerate discussions that must inevitably occur prior to 2029\" anyway.\nThe commission is expected to make its final decision in June.?O'Reilly's recommendations aren't binding on the commission, but they're the product of an extensive public hearing and comment process and voluminous filings, so they'll be hard for the commissioners to disregard. Commission Chair Nancy Lange acknowledged at a hearing last month that whatever the commission decides, the dispute is likely to end up in court.\nEnbridge said the project is necessary to ensure the reliable delivery of crude to Midwestern refineries.?\n\"Enbridge is pleased that the Administrative Law Judge has listened to the extensive evidence that there's need for this safety-driven maintenance project,\" the company said in a statement. \"We will be taking time to review in more detail the recommendation that we use the existing right-of-way, and will have additional comments to follow.\"\nEnvironmental and tribal groups — including the Sierra Club, Greenpeace USA and Honor the Earth — said there's no good reason to allow Enbridge to build the project, regardless of what route it takes.\nIf the project is approved, some opponents have threatened a repeat of the protests in North Dakota near the Standing Rock reservation that delayed work for months on the Dakota Access pipeline, in which Enbridge owns a stake. Similar concerns over the role of tar sands oil in climate change, and indigenous rights, have fueled opposition to Kinder Morgan's proposal to expand its Trans Mountain pipeline from Alberta to an export terminal in British Columbia.\nCalgary, Alberta-based Enbridge says the existing line, which was built in the 1960s, is subject to corrosion and cracking and can run at only half its original capacity because of its accelerating maintenance needs. The Jobs for Minnesotans coalition of business, labor and community leaders backs the project, saying it will create 8,600 well-paying jobs with a total economic impact on the state of $2 billion.\nLine 3 carries crude oil 1,097 miles (1,765 kilometers) from Hardisty, Alberta, through North Dakota and Minnesota to Enbridge's terminal in Superior, Wisconsin. Enbridge says the replacement would restore its original capacity of 760,000 barrels per day. Enbridge wants to shift much of the last half of the current 282-mile (454 kilometer) route in Minnesota into a more southerly, 337-mile (542 kilometer) corridor to Superior. Enbridge estimates the overall cost at $7.5 billion, including $2.6 billion for the Minnesota segment.\nEnbridge has already begun work in Canada and Wisconsin. Construction sites near Superior have been the scene of protests and several arrests.\n\"We urge the PUC to listen to the voices of thousands of Minnesotans who have marched, submitted public comment, and testified against Line 3 and reject this dangerous pipeline once and for all,\" Margaret Levin, director of the Sierra Club's Minnesota chapter, said in a statement.\nTara Houska, national campaigns director of Honor the Earth, said the tribes have made it \"crystal clear\" that a new line is not acceptable to them.\n\"Tar sands pipelines carry too much environmental and economic risk to move forward, especially since all these pipelines cross Indigenous lands,\" Rachel Rye Butler, tar sands campaigner for Greenpeace USA, said in a statement.",
    "source_domain": "abcnews.go.com",
    "title": "Judge: Enbridge Line 3 project should follow existing route",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/minnesota-judge-rule-enbridge-energys-line-project-54663066"
}