{
    "authors": [
        "Abc News",
        "More Alexander"
    ],
    "date_download": "2018-05-30 15:59:18+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A top Republican briefed by the FBI debunked 'Spygate' claims made by the president and his lawyer Rudy Giuliani,",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftop-republicans-dismiss-president-trumps-spygate-claims%2Fstory%3Fid%3D55529987.json",
    "image_url": "https://s.abcnews.com/images/Politics/andrew-napolitano-trey-gowdy-gty-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two top Republican allies of President Donald Trump have thrown cold water on his claims that the Obama administration used a spy to infiltrate his 2016 presidential campaign, an unsubstantiated theory he and some conservative allies have dubbed \"Spygate.\"\nInterested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\nIn an appearance on Fox News Tuesday evening, Rep. Trey Gowdy, who attended a classified briefing last week on Capitol Hill with top members of the Department of Justice and the FBI, said that the president should rest assured that the FBI was not \"spying\" on members of his campaign.\n\"I am even more convinced that the FBI did exactly what my fellow citizens would want them to do when they got the information they got,\" Gowdy said.\nAnother staunch advocate of President Trump on cable TV, Judge Andrew Napolitano, also appeared on Fox and expressed agreement with Gowdy’s assessment that the president and Rudy are not accurate in saying that a spy infiltrated the Trump campaign.\n\"The allegations by Mayor Giuliani over the weekend, which would lead to us believe that the Trump people think that the FBI had an undercover agent who inveigled his way into the campaign and was there as a spy on the campaign seem to be baseless,\" Napolitano said. \"There is no evidence for that whatsoever.\"\nFurther expanding on his comments in a follow-up interview on Wednesday morning, Gowdy said on CBS \"This Morning\" that Trump's lawyers \"have an obligation to go share with him\" what lawmakers learned in the meeting to help tamp down his continued promotion of \"Spygate\".\nWhite House chief of staff John Kelly and President Trump's White House lawyer handling the Russia investigation helped broker last week's meetings with lawmakers regarding the classified information on an alleged informant who made contact with members of the Trump campaign. But the president as recently as Tuesday evening doubled down on the false claim that a spy found its way in the ranks of his campaign.\n\"How do you like the fact they had people infiltrating our campaign?\" Trump asked a crowd at a campaign rally in Tennessee. \"Can you imagine?\"\nBut Gowdy Wednesday said that based on the information he was provided the true target of the FBI's investigative efforts was Russia's efforts to meddle in the 2016 election.\n\"I think the FBI, if they were at the table, would tell you Russia is the target and Russia's intentions toward our country were the target,\" Gowdy said. \"The fact that two people were loosely connected with the Trump campaign may have been involved doesn't diminish fact that Russia was the target and not the campaign.\"\nFollowing Gowdy's sit-down, President Trump reacted by tweeting a quote from Gowdy reacting to a New York Times report overnight about Trump's reportedly requesting in 2017 that Sessions withdraw his recusal from overseeing the Russia investigation.\nGowdy in the interview pushed back on the idea that such a request would amount to obstruction of justice and noted it was not abnormal for the president to express frustration with Sessions, saying if he knew Sessions would make such a decision he may have picked someone other than Sessions for the nation's top law enforcement position.\nRep.Trey Gowdy, “I don’t think so, I think what the President is doing is expressing frustration that Attorney General Sessions should have shared these reasons for recusal before he took the job, not afterward. If I were the President and I picked someone to be the country’s.... — Donald J. Trump (@realDonaldTrump) May 30, 2018\n....chief law enforcement officer, and they told me later, ‘oh by the way I’m not going to be able to participate in the most important case in the office, I would be frustrated too...and that’s how I read that - Senator Sessions, why didn’t you tell me before I picked you..... — Donald J. Trump (@realDonaldTrump) May 30, 2018\n....There are lots of really good lawyers in the country, he could have picked somebody else!” And I wish I did! — Donald J. Trump (@realDonaldTrump) May 30, 2018\n\"And I wish I did!\" Trump said.\nTrump did not, however, respond to Gowdy's comments in the interview disputing his claims regarding 'Spygate.'",
    "source_domain": "abcnews.go.com",
    "title": "Top Republicans dismiss President Trump's 'Spygate' claims",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/top-republicans-dismiss-president-trumps-spygate-claims/story?id=55529987"
}