{
    "authors": [
        "Abc News",
        "More Mike"
    ],
    "date_download": "2018-02-03 21:41:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "After GOP memo's release, FBI chief tells workforce, 'Talk is cheap'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fgop-memos-release-fbi-chief-tells-workforce-talk%2Fstory%3Fid%3D52808153.json",
    "image_url": "http://a.abcnews.com/images/Politics/fbi-ap-er-170801_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Only hours after Republicans on the House Intelligence Committee released a previously-classified memo alleging “abuses” in the FBI’s use of government surveillance, FBI Director Chris Wray sent an internal video to employees of his agency, telling them that, “Talk is cheap,” and, “The work you do is what will endure.\nInterested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\n\"I wanted to take a moment to reach out in person, given all that's been going on as of late,” Wray said in the video message, described to ABC News by one FBI official.\" “You've all been through a lot in the past nine months, and I know it's often been unsettling, to say the least. And the past few days haven't done much to calm those waters.”\nWray continued: “Let me clear: I stand fully committed to our mission. I stand by our shared determination to do our work, independently and by the book. I stand with you, and while there's no shortage of opinions about us right now, nobody has the same vantage point on the FBI that I do.”\nEarlier on Friday, the chairman of the House Intelligence Committee, Rep.Devin Nunes, R-Calif., released a memo drafted by his own staff, accusing the FBI of inappropriately placing former Donald Trump adviser Carter Page under government surveillance.\nThe FBI conducted that surveillance based on what the memo called a “minimally corroborated” dossier alleging ties between President Donald Trump, his aides, and Russian operatives.\nThe secretive court that oversees such monitoring, the Foreign Intelligence Surveillance Court, first approved an application for the FBI to monitor Page’s communications in October 2016 – before Trump was elected president.\nThe Justice Department continued the surveillance after Trump was elected, according to the memo.\nThe dossier was written by former British spy Christopher Steele, whose work was funded with money from the Democratic National Committee. Steele wanted to block Trump from becoming president, the memo alleged.\n“While the [surveillance] application relied on Steele’s past record of credible reporting on other unrelated matters, it ignored or concealed his anti-Trump financial and ideological motivations,” the memo said.\n“Our findings … raise concerns with the legitimacy and legality of certain DOJ and FBI interactions with the” surveillance court, and “represent a troubling breakdown of legal processes established to protect the American people from abuses,” the memo read.\nOn Wednesday, after Wray reviewed the memo, the FBI issued a statement saying it has “grave concerns about material omissions of fact that fundamentally impact the memo’s accuracy.”\nPage first came onto the FBI radar several years ago, well before Trump announced his latest candidacy, because suspected Russian spies in New York City were overheard saying they wanted to recruit Page as an intelligence asset.\nThe suspected spies were later charged, but no charges were brought against Page.\nIn his video to FBI employees Friday, Wray said he is “continually inspired by what you do on a daily basis to keep people safe.”\n“In the end, actions speak louder than words. That sounds simple, but there's real strength in remembering that,” Wray said. “The American people read the papers and they hear lots of talk on cable TV and social media. But they see and experience the actual work you do, keeping communities safe and our nation secure, often dealing with sensitive matters and making decisions under difficult circumstances. And that work will always matter more.”",
    "source_domain": "abcnews.go.com",
    "title": "After GOP memo's release, FBI chief tells workforce, 'Talk is cheap'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/gop-memos-release-fbi-chief-tells-workforce-talk/story?id=52808153"
}