{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:45:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Stanton joins Judge as Yankees' Towers of Power",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fofficial-nl-mvp-stanton-now-slugging-yankees-51719671.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_e4f7542577ae4adb8f01ceddd2c2e32b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Giancarlo Stanton eased his 6-foot-6 frame into a pinstriped No. 27 jersey, ready to join 6-foot-7 Aaron Judge as the Towers of Power on the resurgent New York Yankees.\n\"They're winners,\" Stanton said after his trade from the Miami Marlins to New York was finalized Monday. \"They're young, and they're in a good position to win for a long time, and I lost for a long time. So I want to change that dynamic and be a winner.\"\nNew York sent second baseman Starlin Castro and a pair of minor leaguers to the Marlins for the NL MVP, also giving up right-hander Jorge Guzman and infielder Jose Devers. The Yankees became just the fourth team in big league history with the reigning home run champions in each league, joining Hank Greenberg and Ralph Kiner of the 1947 Pirates, Joe DiMaggio and Johnny Mize of the 1949 Yankees, and Mike Schmidt and Dick Allen of the 1975 Phillies.\nStanton joined a team that reached Game 7 of the AL Championship Series against Houston led by Judge and fellow young sluggers Gary Sanchez and Greg Bird. The Yankees expect top infield prospect Gleyber Torres to join the big league team next season.\n\"New York's a marquee town, and I think it's important to have some marquee players,\" Yankees owner Hal Steinbrenner said. \"But more important than that, I think it's important to have veteran players that could be mentors for the young kids.\"\nStanton, a 28-year-old who like Judge plays right field, is owed $295 million over the final decade of his record $325 million, 13-year contract. The payroll-slashing Marlins, with new CEO and former Yankees star Derek Jeter presiding over the team's fourth roster purge in two decades, will send $30 million to the Yankees if Stanton doesn't exercise his right to opt out of the deal after the 2020 season: $5 million each on July 1 and Oct. 1 in 2026, 2027 and 2028. Under a change in baseball's new labor contract, that money will be prorated for the luxury tax and Stanton will count as $22 million annually.\n\"It's a win-win for both sides,\" Marlins president of baseball operations Michael Hill said. \"Opportunity for him to start fresh, and an opportunity for us to gain needed flexibility.\"\nStanton led the majors with 59 home runs and 132 RBIs last season, and Judge was second in the majors with 52 homers. The daunting duo figures to create must-see BP, and new Yankees manager Aaron Boone isn't sure yet who will play right or left, figuring they also will see time at designated hitter.\n\"A 10-year commitment to any player, any position, should be a concern for the owner, without a doubt,\" Steinbrenner maintained, \"but having say that, he's 28 and in great shape, and I think there's going to be many, many years.\"\nStanton's contract includes a no-trade provision, and last week he turned down prospective deals to St. Louis and San Francisco. He told the Marlins he was willing to accept trades only to the Yankees, his hometown Los Angeles Dodgers, the Astros and Chicago Cubs.\n\"I would have been putting it over the hump rather than jumping into a team already prepared to be there,\" he said.\nHe wore a light blue suit, white-and-blue herringbone-pattern dress shirt and black monk shoes, ready to talk business and baseball. Having grown up in Southern California, going to the Giants was a challenging concept.\n\"I wouldn't base a decision off that, but also I wouldn't want to go to a team that they disliked the most — and wasn't sure if they were going to beat that team, either,\" Stanton said.\nNew York hasn't had a losing record since 1992. The Marlins haven't had a winning season since Stanton made his big league debut in 2010.\n\"He spends his Octobers in Europe,\" said Stanton's agent, Joel Wolfe. \"It was killing him.\"\nYankees general manager Brian Cashman spoke briefly with Hill about Stanton at last month's GM meetings but didn't move forward, wanting to save DH at-bats in case New York added Shohei Ohtani. But the Japanese pitcher/outfielder eliminated all East Coast teams in early December and talks with the Hill resumed.\n\"I felt maybe Wednesday of last week I thought it was not going to happen,\" Cashman said. \"And then he re-engaged me Thursday.\"\nBy Thursday night, a tentative agreement was in place. Stanton said he would approve, but Wolfe told him to sleep on it.\n\"I told him I'm sleeping in, so if there's some deadline just go ahead and say yeah,\" Stanton said with a smile.\nBoone began mulling lineups as soon as Cashman told him Thursday the trade was possible. Boone must decide whether to bat Judge, Stanton and Sanchez — all right-handed hitters — in a row, or mix in lefties Didi Gregorius or Greg Bird, or switch-hitting Aaron Hicks.\n\"Do we feel like we want one of those lefties breaking those three guys up? It's something that is a possibility,\" Boone said.\nSteinbrenner has vowed to reduce payroll from this year's roughly $209 million to below next year's $197 million threshold, which would reset the team's base luxury tax rate from 50 percent to 20 percent in 2019.\nUnder baseball's previous labor contract, the money the Marlins pay the Yankees would be included \"in the contract year in which the cash consideration is paid.\" However, under the new deal Article XXIII (C) (2) (b) (ii) was changed to have it count \"on a pro-rata basis over the remaining guaranteed years.\"\nNew York has committed $123.7 million to seven signed players, has eight eligible for arbitration projected to earn about $30 million, figures to need $10 million for the rest of its 40-man roster and is assigned about $14 million for benefits, as all teams are. The Yankees are charged $5.5 million for cash to Houston in last offseason's trade that sent catcher Brian McCann to the Astros. With the Stanton credit, that leaves them at about $180 million.\nCashman said the Yankees have room to re-sign free agent left-hander CC Sabathia.\n\"We have payroll space because we have more work to do,\" he said. \"This situation fits because we still have room to accomplish all of our stated goals.\"\nNOTES: Boone said Josh Bard will be bench coach, Phil Nevin will be third base coach and replace Rob Thomson as spring training organizer and Reggie Willits will be first base coach.\n———\nAP Baseball Writer Ben Walker contributed to this report.\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "Stanton joins Judge as Yankees' Towers of Power",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/official-nl-mvp-stanton-now-slugging-yankees-51719671"
}