{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 08:22:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Swimming robot to probe damage at Japan nuclear plant",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fswimming-robot-probe-damage-japan-nuclear-plant-48050128.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_3aab1f1a1b874e8ca7cdd0f64e011010_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Japanese industrial group has unveiled a swimming robot designed be used underwater to probe damage from meltdowns at the Fukushima Dai-Ichi nuclear plant after the March 2011 earthquake and tsunami.\nRemote controlled robots are key to the decades-long decommissioning process, but super-high radiation and structural damage hampered earlier attempts to probe damage to the reactors from meltdowns following a massive earthquake and tsunami in March 2011.\nThe developers said Thursday they plan to send the probe into the primary containment vessel of Unit 3 at Fukushima this summer to study the extent of damage and locate parts of melted fuel that is thought to have fallen to the bottom of the chamber and been submerged by highly radioactive water.\nThe robot, about the size of a loaf of bread and mounted with lights, maneuvers with tail propellers and collects data using two cameras and a dosimeter.\nJapan hopes to locate and start removing the fuel after Tokyo's 2020 Olympics.\nThe biggest challenge is removing hundreds of tons of melted nuclear fuel and debris from the plant's three wrecked reactors.\nEarlier, snake and scorpion-shaped robots became stuck inside two reactors. The scorpion robot's crawling function failed and it was left inside the plant's Unit 2 containment vessel. The other, designed for cleaning debris for the \"scorpion\" probe, was called back after two hours when two of its cameras stopped working after its total radiation exposure reached 1,000 Sievert — a level that would kill a human within seconds. The plan had been to use the robot for 10 hours at an exposure level of 100 Sievert per hour.\nThe swimming robot shown to reporters at a Toshiba Corp. test facility near Tokyo was co-developed by the debt-strapped Japanese nuclear and electronics company and the government's International Research Institute for Nuclear Decommissioning.\nScientists need to know the melted nuclear fuel's exact location and understand structural damage in each of the three wrecked reactors to work out the optimum, safest way to remove the fuel.\n\"The fuel debris will be a challenge,\" said Dale Klein, a former U.S. Nuclear Regulatory Commission chief, who now serves as an outside adviser to the Tokyo Electric Power Co., the plant's operator. He said it could take six months to a year to obtain necessary data and decide on how to remove the fuel.\n\"They will have to identify where it is, then they will have to develop capability to remove it. No one in the world has ever had to remove material like this before. So this is something new and it would have to be done carefully and accurately,\" Klein said.\nJapanese officials say they want to determine preliminary removal methods this summer and start work in 2021. The decommissioning technology developers IRID and its partners have also designed some basic robots, including a \"muscle\" arm robot made by Hitachi-GE Nuclear Energy, and a different arm robot made by Mitsubishi Heavy Industries that are designed to approach the debris from the side of the reactors.\nTEPCO is struggling with the plant's decommissioning, and the cost for decommissioning Fukushima Dai-Ichi is now estimated at 8 trillion yen ($70 billion), four times an earlier estimate. Part of that cost will be included in Japanese utility bills.\nThe 2011 meltdown forced tens of thousands of nearby residents to evacuate their homes. Many are still unable to return home due to high radiation levels.\n———\nFollow Mari Yamaguchi on Twitter at https://www.twitter.com/mariyamaguchi\nFind her work also on APNews at https://www.apnews.com/search/mari%20yamaguchi",
    "source_domain": "abcnews.go.com",
    "title": "Swimming robot to probe damage at Japan nuclear plant",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/swimming-robot-probe-damage-japan-nuclear-plant-48050128"
}