{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 17:23:52+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Branden Albert skips start of Jags' voluntary conditioning program",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fbranden-albert-skips-start-jags-voluntary-conditioning-program%2Fstory%3Fid%3D46844711.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0417/dm_170417_ncf_tomherman_interview/dm_170417_ncf_tomherman_interview_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "JACKSONVILLE, Fla. -- Jacksonville Jaguars left tackle Branden Albert, whom the team acquired in a trade in March, did not report for Monday's start of the voluntary offseason conditioning program, a league source confirmed to ESPN.\nThe NFL Network reported that Albert is holding out for a new contract.\nAlbert has two years remaining on the five-year contract he signed with the Miami Dolphins in 2014. That contract included $26 million guaranteed, all of which was paid in 2014-16. Albert is due a base salary of $8.875 million in 2017 and $9.575 million in 2018.\nThe Jaguars sent their 2018 seventh-round pick to Miami for Albert, 32, who hasn't played a full season since 2011 when he was with Kansas City. Albert, who signed as a free agent with Miami in 2014, has missed 20 games over the past five seasons, including four last season.\nPlayers are not required to attend the offseason conditioning program or organized team activities. The first two weeks are limited to strength and conditioning activities, and only strength and conditioning coaches are allowed on the field. Players are only allowed to be on the field for 90 minutes and can only be at the facility for a maximum of four hours each day.",
    "source_domain": "abcnews.go.com",
    "title": "Branden Albert skips start of Jags' voluntary conditioning program",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/branden-albert-skips-start-jags-voluntary-conditioning-program/story?id=46844711"
}