{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 06:13:35+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Protesters march in Richmond calling for removal of Confederate statues",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmonuments-protesters-march-richmond-charlottesville-violence%2Fstory%3Fid%3D49199649.json",
    "image_url": "http://abcnews.go.com/US/monuments-protesters-march-richmond-charlottesville-violence/story?id=49199649",
    "language": "en",
    "localpath": null,
    "maintext": "Hundreds of protesters took to the streets in Richmond, Virginia on Sunday night chanting anti-Confederate slogans one day after a woman was killed during a protest in nearby Charlottesville.\nABC affiliate WRIC reported the protest took place on the Virginia Commonwealth University campus, where marchers stopped at a statue of Robert E. Lee and chanted \"take down the monuments.\" One protester was arrested, according to Richmond police.\nDuring the protest, a person also climbed a statue of J.E.B. Stuart and waved an anti-fascist flag, ABC8 reported.\nDemonstrators continuing westbound toward Harrison. WB lanes blocked. #RVA pic.twitter.com/v098f4LUWd — Richmond Police (@RichmondPolice) August 14, 2017\nThe demonstrations came one day after a driver plowed into a group of anti-fascist protesters in Charlottesville, Virginia -- about an hour west of Richmond. Heather Heyer, 32, was killed and 19 others were injured in the ramming attack.\nPolice arrested James Alex Fields, 20, and charged him with second-degree murder in the incident.\nThe anti-fascist protesters had gathered on Saturday to counteract a white nationalist rally called \"Unite the Right,\" attended by former Ku Klux Klan grand wizard David Duke and self-proclaimed \"alt-right\" leader Richard Spencer.",
    "source_domain": "abcnews.go.com",
    "title": "'Take down the monuments’: Protesters march in Richmond after Charlottesville violence",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/monuments-protesters-march-richmond-charlottesville-violence/story?id=49199649"
}