{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:13:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Daily fantasy golf: Genesis Open expert picks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fdaily-fantasy-golf-genesis-open-expert-picks%2Fstory%3Fid%3D45498892.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r177183_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Following? Jordan Spieth's?victory at the AT&T Pebble Beach Pro-Am, his ninth PGA Tour title, the field moves on to the Genesis Open.\nOur experts have put together the players they believe have the skills to succeed and provide big fantasy point totals. This week's panel is comprised of Bob Harig, Jonathan Coachman and Michael Collins, as well as FantasyGolfInsider's Taras Pitra, Jeff Bergerson, Zach Turcotte and Jason Rouslin.\nNote: Golfer salaries listed are for DraftKings.\nBob Harig:? Hideki Matsuyama?($11,500)\nThe Japanese star is poised to take over as the No. 1 golfer in the world with a victory and the right circumstances. Should everything fall into place, he would become the first player from his country to claim that top ranking. He has been the hottest player, dating back to last year, and Riviera is another venue that suits him. He tied for fourth in this tournament two years ago.\nJonathan Coachman:?Jordan Spieth ($12,600)\nI normally hate to pick back-to-back winners, but what I've seen in Spieth is very Tiger-esque. By turning down guaranteed money overseas, he is telling the world that he's serious about being dominant like he was in 2015. His game appears to be very easy right now, and that's scary for everyone else. Spieth is finishing a run of three straight weeks of PGA Tour events and I think he wants to put the hammer down with everybody important in attendance.\nMichael Collins: Dustin Johnson ($11,400)\nEven though DJ has never won this event, he's definitely due. Since 2010, he's missed the cut twice ('11 and '13) but since then, he hasn't finished outside the top four! Now he's coming off a solo third-place finish last week at Pebble Beach, so you know his game is on point. Don't be surprised if he gets his first victory at this event this week.\nTaras Pitra: Marc Leishman ($7,600)\nLeishman is a perfect 5-for-5 in cuts made this year with all finishes inside the top 25. That screams \"cash game play\" to me, especially when you add in his tournament history (five of seven cuts made, three top-20s). His birdie and scoring averages have gotten significantly better from how he ended 2016, and we're seeing the result of that in his play thus far. If he can get the ballstriking dialed in this week, he could be in for a nice payday.\nJeff Bergerson: J.B. Holmes ($7,100)\nAs long as DraftKings is going to offer bargain basement pricing for some of the absolute best players in the world, I am going to buy. Holmes has not been lighting the world on fire thus far this year, but his worst finish since last summer is T35. In his past nine appearances at Riviera, he has missed only one cut and has six top-15 finishes. Basically, if he makes the cut, he will outproduce his price. I'm willing to bank on that happening.\nZach Turcotte: Adam Hadwin ($6,600)\nSometimes, it's easiest to just not overthink things when it comes to how DraftKings prices golfers each week. I wrote about Hadwin last week and he produced value yet again. This week, his price is even lower for an event where he has posted consecutive top-25 finishes. Hadwin has yet to miss a cut in four starts this year and, if he stretches that streak to five, he will easily deliver value for his near-minimum salary.\nJason Rouslin: Thomas Pieters ($6,700)\nPieters, here this week on a sponsor's exemption, won the 2012 NCAA men's national championship with rounds of 68, 69, 71. He comes off a 23rd-place finish at the Omega Dubai Desert Classic, and is making his first start in the States this week. Given his recent form, past successes and, most of all, his price, I love the value here this week.",
    "source_domain": "abcnews.go.com",
    "title": "Daily fantasy golf: Genesis Open expert picks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/daily-fantasy-golf-genesis-open-expert-picks/story?id=45498892"
}