{
    "authors": [
        "Abc News",
        "Joshua Hoyos"
    ],
    "date_download": "2017-04-18 02:28:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Trump congratulates Turkey's Erdogan after contested referendum",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Ftrump-congratulates-turkeys-erdogan-contested-referendum%2Fstory%3Fid%3D46849649.json",
    "image_url": "http://a.abcnews.com/images/International/Ap-Turkey-Referendum-Erdogan-02-RC-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump called Turkish President Recep Tayyip Erdogan to congratulate him on his controversial referendum victory, the Turkish Presidential Palace confirmed to ABC News on Monday.\nIn a readout of the call released Monday evening, the White House confirmed that the call took place and that Trump had congratulated his Turkish counterpart.\nThe Turkish referendum is due to eliminate the prime minister's office and give the country's president sweeping powers and nearly complete control of the government -- authority not originally granted under the country's constitution. The main opposition party has urged the Turkey's electoral board to cancel the results citing substantial voting irregularities.\nErdogan and proponents of the move claim the consolidation will cut down on governmental instability and streamline operations.\nAt the White House Monday, Press Secretary Sean Spicer said that the administration intended to \"wait and let [the international commission reviewing the vote] do their job,\" when asked if Trump was \"concerned\" about the results.\nSpicer deflected follow-up questions about Erdogan's accumulation of power, saying that the people of Turkey \"have a right to have elections and their people participated in that.\"\nThe Associated Press reported that the Turkey's National Security Council recommended an extension to the ongoing state of emergency \"to ensure the continuity of precautions to protect the principle of the state of law and the rights and freedoms of our citizens.\"\nThe state of emergency, which was initiated after last year's failed coup attempt against Erdogan, was to expire April 19.",
    "source_domain": "abcnews.go.com",
    "title": "Trump congratulates Turkey's Erdogan after contested referendum",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/trump-congratulates-turkeys-erdogan-contested-referendum/story?id=46849649"
}