{
    "authors": [
        "Abc News",
        "More Jordyn"
    ],
    "date_download": "2017-08-14 13:44:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Trump to return to Trump Tower for 1st time as president",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-return-trump-tower-1st-time-president%2Fstory%3Fid%3D49204543.json",
    "image_url": "http://a.abcnews.com/images/Politics/GTY-trump-tower-01-as-170718_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Trump is set to spend his first night at his Manhattan penthouse since becoming president.\nTrump is making his return visit Monday night in the midst of what his administration has called a \"working vacation\" away from the White House, which is undergoing renovations. The president has been staying at his New Jersey home for over a week.\nWhile this may be the president's first visit back to his Fifth Avenue skyscraper, it is hardly the first time he has retreated from 1600 Pennsylvania Ave to one of his Trump properties. The president has already made a dozen trips to his Mar-a-Lago estate in Florida and his home in New Jersey since assuming the presidency.\nTrump has previously referenced the costs associated with presidential protection as one of the reasons he has opted to return to his New Jersey estate rather than Trump Tower.\nRather than causing a big disruption in N.Y.C., I will be working out of my home in Bedminster, N.J. this weekend. Also saves country money! — Donald J. Trump (@realDonaldTrump) May 5, 2017\nThe New York Police Department said in February that it costs up to $308,000 a day to protect Trump Tower when the president is in town.\nPrior to becoming president, Trump repeatedly criticized his predecessor, Barack Obama, for taxpayer-related expenses for his vacations.",
    "source_domain": "abcnews.go.com",
    "title": "Trump to return to Trump Tower for 1st time as president",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-return-trump-tower-1st-time-president/story?id=49204543"
}