{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 05:04:03+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpuerto-rico-grid-teetering-38-billion-repair-job-55551772.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_6d24749704b44178b0bddcbc32646bb0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After months of darkness and stifling heat, Noe Pagan was overjoyed when power-line workers arrived to restore electricity to his home deep in the lush green mountains of western Puerto Rico. But to his dismay, instead of raising a power pole toppled by Hurricane Maria, the federal contractors bolted the new 220-volt line to the narrow trunk of a breadfruit tree — a safety code violation virtually guaranteed to leave Pagan and his neighbors blacked out in a future hurricane.\n\"I asked the contractors if they were going to connect the cable to the post and they just didn't answer,\" said Pagan, a 23-year-old garage worker.\nAfter an eight-month, $3.8 billion federal effort to try to end the longest blackout in United States history, officials say Puerto Rico's public electrical authority, the nation's largest, is almost certain to collapse again when the next hurricane hits this island of 3.3 million people.\n\"It's a highly fragile and vulnerable system that really could suffer worse damage than it suffered with Maria in the face of another natural catastrophe,\" Puerto Rican Gov. Ricardo Rossello said.\nAnother weather disaster is increasingly likely as warmer seas turbocharge the strongest hurricanes into even more powerful and wetter storms. Federal forecasters say there's a 75 percent likelihood that the 2018 Atlantic hurricane season, which begins Friday, will produce between five and nine hurricanes. And there's a 70 percent chance that as many as four of those could be major Category 3, 4, or 5 hurricanes, with winds of 111 mph (179 kph) or higher.\n\"It's inevitable that Puerto Rico will get hit again,\" said Assistant Secretary Bruce Walker, head of the U.S. Department of Energy's Office of Electricity, which is planning the long-term redesign of the grid run by the Puerto Rico Electric Power Authority.\nDespite the billions plowed into the grid since Maria hit on Sept. 20, 2017, Puerto Rican officials warn that it could take far less than a Category 4 storm like Maria to cause a blackout like the one that persists today, with some 11,820 homes and businesses still without power.\n\"The grid is there, but the grid isn't there. It's teetering,\" said Hector Pesquera, Puerto Rico's commissioner of public safety. \"Even if it's a (Category) 1, it is in such a state that I think we're going to lose power. I don't know for how long.\"\nFederal officials and Puerto Rican leaders blame decades of mismanagement that left the island's power authority more than $9 billion in debt after declaring bankruptcy last year. Expensive projects were launched then cancelled. Politicians approved cheap power for well-connected corporations. By the time Maria hit, wooden power poles were rotted, transmission towers had rusted through and overgrown trees menaced thousands of miles of power lines.\nIn many places across Puerto Rico, federal emergency funds allocated in the aftermath of the disaster made up for years of neglected maintenance, replacing decaying infrastructure with tens of thousands of new poles and hundreds of miles of power lines rushed from the U.S. mainland at a steep premium.\nBut in other areas, crews without adequate supplies patched together damaged poles and power lines in a desperate push to restore power. In the western highlands, power cables were spliced together and woven haphazardly through trees in blatant violation of basic safety codes. In Pagan's town of Cain Alto and at least one other location, trees were used as makeshift power poles in the absence of proper equipment.\n\"We patched things up. We worked with the little material that was available and we recycled material. We took the 1,000 feet of wire that was on the ground and we strung it up in another area,\" one power authority worker said, speaking on condition of anonymity for fear of retaliation from management. \"We took the post that had fallen over or broken and we put it up somewhere else. A lot of the work is defective.\"\nFredyson Martinez, vice president of the power authority workers' union, said he estimates that roughly 10 percent to 15 percent of the repair work done over the last eight months did not meet basic quality standards.\n\"The logistics were terrible. I give it an F,\" he said. \"Things need to be fixed.\"\nFederal and Puerto Rican officials are preparing for another catastrophe that cuts power for weeks or month. The Federal Emergency Management Agency is leaving some 600 generators installed in key sites such as hospitals and water pumping stations, more than six times the number before Maria. FEMA has stockpiled 5.4 million liters of water and more than 80,000 tarps, and is distributing them and other emergency supplies to towns across the island so they will be in place for the next disaster.\nStill, few people believe the island is truly ready.\n\"If a hurricane comes tomorrow it will leave the island completely without power again,\" said Juan Rosario, a community activist and former member of the power authority's board of directors.\nUp to 4,645 more deaths than usual occurred in Puerto Rico in the three months after Maria, contends a new study published this week by the New England Journal of Medicine, an estimate that far exceeds the official government death toll of 64.\nOfficials now are warning Puerto Ricans to stockpile enough emergency supplies to survive as long as 10 days without help. Tens of thousands of homes still don't have roofs. FEMA distributed 59,000 enormous plastic sheets to homeowners who lost their roofs in Irma or Maria. More than 100,000 more received smaller tarps to protect specific rooms or belongings. Only 21,000 households have received federal aid to carry out permanent repairs.\nJuana Sostre Vasquez's wooden house in the central highlands was ripped off its foundation by Maria. With the help of a son-in-law, the 69-year-old rebuilt, using cinderblocks and cement bought with $14,000 in FEMA reconstruction aid. Her roof is metal sheeting nailed onto wooden two-by-fours because she couldn't afford to build stronger. She says she's hopeful the next hurricane won't send that sheeting flying.\n\"The money didn't let us do the roof,\" she said. \"I'm doing it little by little as I save a couple of dollars.\"\nMike Byrne, the head of FEMA's Caribbean office, says he expects the federal government will eventually have spent a total of $17.5 billion in emergency funds on fixing the hurricane damage and making Puerto Rico's grid more resilient to future storms.\nThe U.S. Army Corps of Engineers ended its power restoration work in May, so future funding is expected to pass through Puerto Rico's bankrupt power company. After receiving $945 million in federal funds for repairs to the island's electric grid, Oklahoma-based Mammoth Energy Services announced Monday that the power authority had awarded its subsidiary, Cobra Energy, another $900 million to finish the job and begin fortifying the grid against future storms.\nLast week, Cobra's crews were working to rebuild one of a pair of 230-kilo-volt transmission lines climbing from Puerto Rico's main power plants on its southern coast across high mountains to the main users of energy in the capital, San Juan, and other industrial sites and population centers in the north. Because of a decision years ago to stretch the island's main transmission lines through a narrow path across the rugged mountains, one of the transmission lines must be turned off so its powerful current doesn't energize equipment and workers laboring a few feet away.\nCobra transmission director Alan Edwards had more than 50 linemen working on the repair, at nearly $4,000 per worker per day in federal funds from the Puerto Rico power authority, when he got the call to stop. A flaw was causing a transmission line to overheat dangerously elsewhere in the system, so the line alongside where Edwards' men were working would have to be returned to service, forcing the crews to stop for at least the rest of the day.\n\"Maybe we're back at it tomorrow, I don't know. May be next week before we can get back out there,\" Edwards said.\nThe already staggering reconstruction costs will rise by billions more if another hurricane hits. And many billions worth of those federally funded improvements could eventually pass into private hands: Puerto Rico's Senate could approve the sale of much of the island's power grid to a private power company or companies as early as this week.\nThe potential sale won't affect the federal government's decision to spend billions of dollars on repairing and improving the grid, said Byrne, the head of FEMA's operations in the Caribbean.\n\"I can't wait, because these are U.S. citizens that are at risk. U.S. citizens deserve every ounce of effort that I can bring to this, and that's what they're going to get,\" Byrne said.\n————\nMichael Weissenstein on Twitter: https://twitter.com/mweissenstein",
    "source_domain": "abcnews.go.com",
    "title": "Puerto Rico grid 'teetering' despite $3.8 billion repair job",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/puerto-rico-grid-teetering-38-billion-repair-job-55551772"
}