{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 07:48:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Vietnamese villagers free some police held over land dispute",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fvietnamese-villagers-free-police-held-land-dispute-46855613.json",
    "image_url": "http://abcnews.go.com/International/wireStory/vietnamese-villagers-free-police-held-land-dispute-46855613",
    "language": "en",
    "localpath": null,
    "maintext": "Villagers have freed 15 riot police they were holding over a land dispute in the suburban district of Vietnam's capital and authorities were trying to persuade the villagers to free the 20 remaining police and local officials, state media said Tuesday.\nThe standoff began Saturday when police clashed with villagers who allege their land was illegally taken for sale by a military-run telecoms firm. Some villagers who were arrested have been released. The state-run online newspaper Vnexpress reported Tuesday that three of those being held had managed to escape.\nThe newspaper quoted Maj. Gen. Bach Thanh Dinh, deputy Hanoi police chief, as saying the release of the villagers was not a compromise with the instigators of the standoff who illegally held police and officials.\n\"We will handle everything in accordance with the law,\" he said \"Those who intentionally instigated, illegally detained people will be dealt with seriously.\"\nOn Monday, Hanoi Mayor Nguyen Duc Chung talked via telephone with the villagers' representatives and pledged to have direct talks with them the next day, according to lawyer Tran Vu Hai who helped to arrange the talk. The lawyer posted the pledge on his Facebook page but said Tuesday that Chung disputed it, indicating the talks would not go ahead.\n\"It's his right,\" the lawyer said.\nState-run Tuoi Tre newspaper cited the Hanoi Communist Party Organization's propaganda department as saying the land had been reserved to build a military airfield since 1980 and was recently given to military-run telecommunications company Viettel, the country's largest mobile phone operator.\nViettel is to build a large project which is of \"special significance on defense and security of the military and the country,\" it said.\nThe paper said some villagers had illegally occupied some of the land given to Viettel to do their farming.\nLand disputes are common in Vietnam, where residents often claim that their land was taken for infrastructure or other industrial or residential projects and they not properly compensated.",
    "source_domain": "abcnews.go.com",
    "title": "Vietnamese villagers free some police held over land dispute",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/vietnamese-villagers-free-police-held-land-dispute-46855613"
}