{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:15:00+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "York: 49ers Need Culture Change After Firing Coach, GM",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fyork-49ers-culture-change-firing-coach-gm-44515202.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/york-49ers-culture-change-firing-coach-gm-44515202",
    "language": "en",
    "localpath": null,
    "maintext": "Two years after asking to be held accountable if his San Francisco 49ers fall short of winning the Super Bowl, team CEO Jed York was back on stage having fired two more coaches, a general manager, and seen his team post a 7-25 record.\nYork apologized Monday for a 2-14 record this season that he called embarrassing, and repeatedly said the organization needed a \"clean slate\" in order to re-establish a \"championship culture.\"\nBut one thing that won't change after the firing of coach Chip Kelly and general manager Trent Baalke on Sunday: York will be the person leading the search for new leadership team after getting rid of Jim Harbaugh in 2014 and then firing Jim Tomsula and Kelly after one-year runs as coaches.\n\"I own this football team,\" York said. \"You don't dismiss owners. I'm sorry that that's the facts and that's the case, but that's the facts.\"\nYork said he wanted to look forward rather than backward at the decision to get rid of Harbaugh, even though no other coach has had success for the team in the past 15 years. Harbaugh led the Niners to NFC title games in his first three years from 2011-13, including a Super Bowl loss to Baltimore following the 2012 season. He was let go after an 8-8 season in 2014 as part of a power struggle.\nIt was at the news conference announcing Harbaugh's dismissal that York said the 49ers hang only Super Bowl banners, not NFC championship banners, and he should be accountable if they fall short.\nBut York then used the success under Harbaugh as evidence of his ability to make the right decisions to get the Niners back on the winning track.\n\"I've done it before. We've put together a team that has had three NFC championship runs,\" he said. \"That was in the past. I can't live on the past. I need to make sure that anything I do is backed up by the results on the field.\"\nThe Niners replaced Harbaugh with longtime assistant Tomsula, who was not up to the task as head coach and went 5-11 before being fired after his only season.\nYork then stuck with Baalke despite the rough season, and the team hired Kelly as coach after he had been fired late in his third season with Philadelphia. Things only got worse with a depleted roster hurt by years of bad drafting and the lack of impact free agents.\nYork said he had hoped that Baalke's defensive background combined with Kelly's offensive experience would help build a cohesive roster that could compete in the NFC West. But the communication and collaboration wasn't there, leading to the poor record.\n\"The marriage didn't work,\" he said. \"I should have probably seen it. It's easy to play revisionist history, but we are where we are. That's why we're cleaning the slate and we're re-establishing that culture.\"\nSan Francisco (2-14) matched the worst record in franchise history, lost 13 straight games between wins in Week 1 and the second-to-last game against the lowly Los Angeles Rams, and set records for most points, yards and yards rushing allowed in team history.\nThat season prompted the latest change. The Niners became the first team in nearly four decades to follow coaches in successive seasons after only one-year tenures.\nThe only other time that happened since the 1970 merger came when San Francisco fired Monte Clark after the 1976 season and Ken Meyer the following year. The Niners then fired Pete McCulley midway through the 1978 season and interim coach Fred O'Connor after the year before hiring Bill Walsh to start a dynasty.\nYork will now need to entice potential general managers and coaches to come aboard despite the lack of patience and stability evident the past few seasons.\n\"We're going to have the opportunity with a lot of draft picks, we're going to have the opportunity with a lot of salary cap room,\" he said. \"There are some pieces here. I don't think there are enough pieces here, but there are some pieces we can build with. But it has to be a partnership, it's got to be a collaboration between me, the head coach and the general manager so we can get this thing right.\"\n———\nFor more NFL coverage: www.pro32.ap.org and http://twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "York: 49ers Need Culture Change After Firing Coach, GM",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/york-49ers-culture-change-firing-coach-gm-44515202"
}