{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2017-08-14 19:46:55+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The company has also removed listings off its site.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Famazon-issues-refunds-customers-bought-counterfeit-solar-eclipse%2Fstory%3Fid%3D49206091.json",
    "image_url": "http://a.abcnews.com/images/US/solar-glasses-returned-ap-ml-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With millions purchasing protective eyewear ahead of the Aug. 21 solar eclipse, Amazon is working to remove potentially counterfeit glasses from its marketplace and issue refunds to those who have already bought them online.\nA company spokesperson told ABC News in a statement overnight that it asked third-party sellers offering solar eclipse glasses to provide documentation to verify that their \"products were compliant with relevant safety standards.\"\n\"The offers from sellers who provided this safety documentation remain available to customers,\" the spokesperson said.\nAmerican Paper Optics\nSellers who did not provide documentation for their listings have been removed from the site. Amazon did not name any of those listings or specific brands in its statement.\nAmazon confirmed that it issued refunds to some customers who purchased glasses that may not meet industry standards.\nLast week, Fred Espenak, retired NASA astrophysicist and photographer, told ABC News that he has heard rumors of counterfeit glasses being sold online.\nEspenak, NASA and the American Astronomical Society (AAS) suggest that consumers purchase off the AAS's approved list of companies that manufacture and/or sell eclipse glasses and handheld solar viewers, which have been verified by an accredited testing laboratory to meet the ISO 12312-2 international safety standard.\n\"They've been put through a testing procedure to demonstrate that they're dark enough to prevent visible as well as ultraviolet and infrared light from passing through it,\" Espenak said.\nElaine Thompson/AP\nSome companies are placing an ISO label on their counterfeit glasses, which is why following the list of manufacturers is a surefire way to know you're being safe, according to the AAS.\nHere is a growing list from the AAS of approved companies that manufacture and/or sell glasses through vendors and retailers.\nAmerican Paper Optics (Eclipser) / EclipseGlasses.com / 3dglassesonline.com\nAPM Telescopes (Sunfilter Glasses)\nBaader Planetarium (AstroSolar Silver/Gold Film)\nCelestron (EclipSmart Glasses & Viewers)\nDaylight Sky (plastic glasses only)\nDayStar (Solar Glasses)\nExplore Scientific (Solar Eclipse Sun Catcher Glasses)\nHalo Solar Eclipse Spectacles\nLunt Solar Systems (SUNsafe SUNglasses)\nMeade Instruments (EclipseView Glasses & Viewers)\nRainbow Symphony (Eclipse Shades)\nSeymour Solar (Helios Glasses)\nThousand Oaks Optical (Silver-Black Polymer & SolarLite)\nTSE 17 (Solar Filter Foil)\nwww.solunaglasses.com\nThe AAS says on its website that just because they do not list a supplier, that does not indicate that \"their products are unsafe,\" but rather that the AAS does not yet have the knowledge of that particular seller or that they have not verified the brand is safe.\nThe consequence of wearing glasses that aren't specially made to deal with the visible light from a solar eclipse and invisible radiation could be \"serious eye injury, perhaps even blindness,\" according to the AAS, which also noted that special-purpose solar filters are many thousands of times darker than ordinary sunglasses.\nRead more on how to avoid buying counterfeit glasses ahead of the Aug. 21 solar eclipse here.",
    "source_domain": "abcnews.go.com",
    "title": "Amazon issues refunds to customers who bought counterfeit solar eclipse glasses",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/amazon-issues-refunds-customers-bought-counterfeit-solar-eclipse/story?id=49206091"
}