{
    "authors": [
        "Abc News",
        "More Meridith"
    ],
    "date_download": "2017-12-12 01:15:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Almost 70,000 people will receive letters warning them CHIP in Virginia may end.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvirginia-warning-families-pregnant-women-states-chip-program%2Fstory%3Fid%3D51727715.json",
    "image_url": "http://a.abcnews.com/images/Politics/pediatrician-gty-er-170929_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Virginia is now the latest state to start informing families enrolled in the Children’s Health Insurance Program (CHIP) that their coverage will be terminated unless Congress reauthorizes the popular health insurance program soon.\nOn Tuesday, the Virginia Department of Medical Assistance Services will be sending out a letter to 1,114 pregnant women and parents of the 68,495 Virginia children currently enrolled in FAMIS, the name for the state’s children’s insurance program.\n“After delaying these notifications to give Congress as much time to act as possible, Virginia has a responsibility to these families to inform them of the possibility that their coverage could lapse so they can be as prepared as possible to explore alternatives,” said Virginia Gov. Terry McAuliffe in a statement.\nThe letter states Virginia’s CHIP program will end on Jan. 31, 2018, unless Congress acts.\n“For 20 years CHIP has had the strong support of Congress and has been renewed many times. We are hopeful that Congress will once again provide the funding to continue this program,” reads the letter. “However, because Congress has not acted yet, we need to let you know that there is a chance the FAMIS programs may have to shut down.”\nThe fear and pain that comes with these letters for parents across Virginia is heartbreaking—and frankly it makes me angry, because all of this was preventable. There is a bipartisan CHIP reauthorization that would pass if @SenateMajLdr would just bring it up for a vote. https://t.co/Yu9pPUBtgh — Tim Kaine (@timkaine) December 11, 2017\nSolStock/Getty Images\nColorado was the first state to send a letter out to CHIP-enrolled families encouraging them to start making contingency plans for their health insurance.\nAccording to an analysis by the Kaiser Family Foundation, 11 states -- California, Oregon, Idaho, Nevada, Utah, Arizona, Ohio, Mississippi, Pennsylvania, Connecticut and Hawaii -- anticipate running out of funding by the end of the year. Another 21 states, including Virginia, expect their funding to run out soon after the new year.\nThe two-week continuing resolution passed on Thursday allows for the temporary redistribution of funds by Centers for Medicare and Medicaid Services to states experiencing CHIP funding shortfalls. Seventeen states have received redistribution payments from October to December, totaling $1,161,888,184 per CMS.\n“This continues to be a top priority for Chairman [Orrin] Hatch,” a Senate Finance Committee spokesperson told ABC News of CHIP reauthorization. “The Senate Finance Committee reported out a bipartisan bill that would extend funding for five years and provide certainty for families and states. The chairman is continuing to make progress in his discussions on how best to address this issue on the Senate floor and remains confident this will be resolved before the year’s end.”\nBut many states are concerned they’re running out of time for families to figure out their finances and alternative health insurance plans.\n“You keep hearing from Congress, sure they’ll reauthorize it, of course they’ll do it. But on the other hand, they don’t seem to be taking seriously the consequences of the delay,” Linda Nablo, deputy director of Virginia’s Department of Medical Assistance Services, told ABC News. “Causing the least amount of anxiety and chaos for families actually take a lot of work, and states can’t continue to live on the promise, ‘We’ll get around to it.’”",
    "source_domain": "abcnews.go.com",
    "title": "Virginia warning families, pregnant women state's CHIP program may 'shut down'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/virginia-warning-families-pregnant-women-states-chip-program/story?id=51727715"
}