{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:17:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "\"The View\" co-hosts weigh the strengths and weaknesses of the president's foreign policy.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fpresident-trump-handling-foreign-policy-46846186.json",
    "image_url": "http://a.abcnews.com/images/Politics/170417_view_trump_foreign_policy00_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for How well is President Trump handling foreign policy?\nThe US has been playing a lot of what games as well drop another mom all bonds so we're gonna see what we can do not to bomb ten to ask. Yeah. Guys meet me in my Kansas and South Korea right now was some tough words but North Korea after their failed nuclear missile tests take a look. Just in the past two weeks the world witnessed the strength and resolve of our new president. We will defeat any attack. And we will meet any use of conventional or nuclear weapons with an overwhelming. An effective response. The air of strategic patience. Is over. And it here and get on Larry yeah yeah. Yeah I'm glad it's strategic but at what happened to diplomacy. And he well you know what we're unhappy past and try to spot. Don't we have always used and then we haven't had any issue is full we haven't had any issues like also had. North Korea building up. Missiles long range missiles that could potentially sooner going to be able to attach a nuclear warhead to that. We've tried diplomacy with numerous consciously tried it with a Ron. We've tried it yet we want to telling them you can't have new weapons and we don't really happy we'll learn I'm white and guess what they hide their weapons promise all the time diplomacy is great. It's fantastic when you're not dealing with tyrants and when you're not dealing with people who seek to undermine so and I outlined of the nuclear hot I think the alternative is to be taught this to say look if you're going to showcase him for raid. The day before Mike Pence goes to South Korea are allied and you're gonna showcase massive. Weapons thank you you hope and intend you do know that and I'm not that there at the week that happens every week yeah but now I guess that's my idea it nice and happy we're gonna go yeah. The idea that we go in tweak your nose. When we're in the middle of to wore us. We're trying to figure out what to do with the Sox because quite frankly you know everybody's all happy about the fact that we bombed Al-Shabaab. So and and this nobody says yeah I I think I'm changing my mind on next who has yet for the new yet. I'm saying is ma'am I'm not saying I now. I says I know I've changed my mind not how I feel about that and really what does that do for all the people who have been trying to tell you why they believe in their content have you changed your mind on that that's the stuff I want it now you know without any direct heat and being caught in refugees and just what the real world office because to weaken people's novels. Your kids aren't don't want outward. Then he's not sending to be fair he's not my support I don't support boots on the ground I don't support democracy building and nation building of these countries. But I think when you talk and I you to not Afghanistan in this bomb. Look we we there's an there are racist terrorist havens which you have our president taking out underground tunnels crisis is where you had. American an Afghani forces coming together and saying we can't break through this area to work together. Because of ice is and you can taking that out I don't expect long term plan what is the strategy you can't just drop bombs and have no real plant that is not how the world is run and that is not how our country should be I don't know what the wrong time. And over the long term plan is I don't numbers and you cannot you know it's. Estimate when it during the missile big Cuban missile crisis which I was in a live and you know I thought I was out some other. Chicago I was petrified that went about how old being blown up and a nuclear holocaust. I can't and they was president. And he did not agree with the generals. And so he entered the C interfered between Russia and they generals and he made a deal with trees chopped. Now what we have now is Donald Trump who doesn't know I he knows I know was much about Korea as he dies that's really scary. And and I think that he is leaving it all up to the military he doesn't have any civilians involved in the negotiations. In this that I didn't just Ed Jarrett cushion to deal with -- until I mean. Yeah in this instance. I actually find a little comfort in the fact why not making those decisions because he's already not exactly can't change it. The fact that make master and madness are eating this charge I do trust they are extreme and little Sarah do not want the job is of the military tented going to Warren's. That's available opportunity apparently okay whatever it is that's there and focus that's there might have hit he is we in the general yes right Allen and I don't and it sitting there I do prefer the people with the experience so here's the question. But you want when mom you wanna civility I would love. One we have when we do these things out and we build the sub not how many tours of duty have our active military had. A lot OK yeah so now. How do we. Even think about getting involved. In yet another thing. At some point they're going to have to get some new phones to go fight these new things what do you think they're gonna come from this part they don't even need people fair courteous and every one everyone says you know with the issue is for an -- what else do you do because if diplomacy on paper which they've tried they tried sanctions they've tried everything with these countries. I support trying to happen it's failed with a lot of blood clots and can you don't really funny car has not to and trying to trying to annex this I'm not saying that he's probably they have and thinks eighth in this and they haven't won so let's Korea again come rehab. Has always don't know what they're doing the the fact that we say don't do it whenever you know Joplin and threatening them is not the way to go out. And have ceased to when you're going to if you're going to do this you need to have a group of people who actually did acts. What needs to be done and and and and doing business and given a few things and when he you know he's also when Ben what China. But yeah but they have a statement that he had in an ex state well they have 990% of North Korea's trade comes from China so. When you think about it China does happen wheels the big stick there and which trop obviously missed calculated tactic doesn't. He ran on his he ran his campaign talking badly about Imus. But there's the deadliest weekends my buddies in saying there's a difference between campaigning and then when he got no hope for me was that when he got there he was gonna listens as generals he was gonna have access to national security information he did not before. And they Atlantans who make better decisions he may be looking at the policy at the laugh at you very scary this hasn't worked. I'm bargain price Korea policy gained. Korea. Has vigilance come over where male object then that they haven't come home we are. But I think he acts well they act finale they well be able to went so what everyone else the Russians can come open every company that hasn't Google this and we're never we would never want to be the only ones that had been scheduled to politics. Amtrak and once we exhibited the ability to do it everybody wanted so the idea out was at one point to get everybody to drop their stuff. Now everybody's real army. They're gonna get this up because watch was sent out yeah. Let me wanna come we we will gain the biggest but you know every way but there's a difference between the United States having that stuff the united sees doesn't seek or aim to destroy other countries when you have the winner of countries apes we see Clinton and I dropped it as a matter of fact yeah we want to leave enact the package I'm not worried about a united trinity having used a nuclear war can I ask you realize. I what I'm saying to his today at the United States has access to those weapons. I fully expect the United States to use those weapons to help other people not to harm other people unless the army eye holes plus lets anybody exactly what that's what China said nobody wins you win don't nobody wins you'll have to do something tonight that you know the people are starving their but he seems to be eating all the food. That's what I know about Scott every idea that stock thing. When you talk about a plan. Dead you know their economic sacks sanctions there's Covert action yeah there's diplomatic negotiations and then ultimately. War but things do like our country is jumping. The melons and delaying action we'd compiling all of that for years President Obama put it through Susan Rice talked about the strategic patience we did it didn't work. I saw what you say an. Animal and closer to putting a nuclear warhead on the vegetables long range Nestle since that doesn't mean that honesty is this a failure to be preventing them from doing that now do you see now are now now now now.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "How well is President Trump handling foreign policy?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/president-trump-handling-foreign-policy-46846186"
}