{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:18:54+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Pence visits Japan, turning focus to trade with key ally",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpence-visits-japan-turning-focus-trade-key-ally-46855409.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_e53944da6adf4d4783bd1f671f502ccd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. Vice President Mike Pence and Japanese leaders began talks Tuesday expected to focus largely on trade with America's anchor ally in the region, though tensions with North Korea loomed large.\nPence reassured Prime Minister Shinzo Abe that the U.S. considers its alliance with Japan to be a cornerstone of security in the region.\n\"We appreciate the challenging times in which the people of Japan live with increasing provocations from across the Sea of Japan,\" Pence said.\n\"We are with you 100 percent,\" he said, adding that the U.S. \"always seeks peace.\"\nPence reiterated that after years of North Korea testing the U.S. and its neighbors in East Asia with its nuclear ambitions, the U.S. \"era of strategic patience is over.\"\nAbe said Japan likewise hopes for peaceful dialogue with Pyongyang, \"but at the same time, dialogue for the sake of dialogue is valueless.\" Pressure on North Korea is crucial, he said.\nPence is on a 10-day Asia trip that will also take him to Indonesia and Australia.\nConcluding a visit to South Korea that was mostly focused on the North Korea problem, Pence told business leaders in Seoul earlier Tuesday that the administration is taking a fresh look at trade agreements as part of its \"America First\" policy.\n\"We're reviewing all of our trade agreements across the world to ensure that they benefit our economy as much as they benefit our trading partners,\" Pence told the American Chamber of Commerce in Korea.\nWhite House officials said the economic meetings in Tokyo, with Deputy Prime Minister Taro Aso and other officials, will help forge a framework for a new U.S.-Japan economic dialogue launched by President Donald Trump and Abe during the Japanese leader's visit to the U.S. in February.\nPence's two main goals are to spur increased U.S. access to Japanese markets and strengthen Japanese foreign investment, they said.\nWhile Japan's trade surplus with the U.S. is much smaller than China's, Trump has decried the imbalance, especially in auto exports.\nBoth sides said they do not expect the talks in Tokyo this week to delve into sector-by-sector talks on trade. With no U.S. Trade Representative yet in office and other key negotiator positions still unfilled, such nitty-gritty discussions will have to come later.\nBut the meetings could indicate how forcefully the U.S. will pressure Japan to further open its farm and automotive sectors.\nPence's advisers said the vice president would make the case to Abe and Aso that the U.S. rejection of the Trans-Pacific Partnership, or TPP, under Trump does not signal a U.S. withdrawal from trade and economic development in the region.\nThe loss of U.S. participation in the TPP was a blow to Japan following strenuous negotiations, especially over opening access wider to its long-protected farm sector.\nChief Cabinet Secretary Yoshihide Suga told reporters over the weekend that Japan might push ahead with a revised, 11-nation version of the TPP despite the U.S. rejection of the trade accord.\nFor now, both sides seem keen to downplay potential for conflict.\n\"My understanding is that our talks are premised not on friction but on cooperation,\" Aso told reporters before Pence's arrival.\nU.S. Commerce Secretary Wilbur Ross, who met with Japan's trade minister, Hiroshige Seko earlier Tuesday, said he hopes to soon begin talks on a free trade agreement with Japan.\nAs Indiana governor, Pence saw firsthand the impact of Japanese automakers Toyota, Honda and Subaru, whose factories employ thousands of people in his home state.\n———\nAssociated Press writer Mari Yamaguchi in Tokyo contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Pence visits Japan, turning focus to trade with key ally",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/pence-visits-japan-turning-focus-trade-key-ally-46855409"
}