{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:48:16+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Civil trial ordered of Texas prisons, leaders in heat death",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcivil-trial-ordered-texas-prisons-leaders-heat-death-45501098.json",
    "image_url": "http://abcnews.go.com/US/wireStory/civil-trial-ordered-texas-prisons-leaders-heat-death-45501098",
    "language": "en",
    "localpath": null,
    "maintext": "A federal judge has ordered a civil trial of the Texas prison system and its leadership in a civil rights lawsuit arising from the heat-related death of an inmate, saying state prison officials refused to provide air conditioning that could have also kept 21 other inmates alive.\nLarry Gene McCollum, a 58-year-old Waco-area taxi driver, was among 22 inmates who have died front the heat in Texas prisons since 1998, including 10 during a 2011 heat wave alone, U.S. District Judge Keith Ellison of Houston wrote.\nMcCollum was serving a one-year sentence in the Hutchins State Jail near Dallas for writing a bad check when he died of a heat stroke on July 22, 2011, just seven days after he arrived at the jail.\nIn an 83-page opinion filed Tuesday, Ellison, who visited state prisons during the peak of the summer heat, wrote that prison logs showed that the day before McCollum's death, the outside air temperature was above 90 degrees for at least nine hours and above 100 degrees for at least six hours, peaking at 107 degrees and staying at 106 degrees at 6:30 p.m., when the last recording of the day was taken. Humidity never fell below 40 percent that day.\nAlthough the log represents that the heat index at 3:30 p.m. was 116 degrees, a chart provided by the University of Texas Medical Branch at Galveston and used by the Texas Department of Criminal Justice computes the heat index was about 150 degrees.\nThe jail utilizes air handlers for ventilation, which circulate outside air through the facility without changing its temperature, Ellison wrote.\n\"Larry McCollum's tragic death was not simply bad luck, but an entirely preventable consequence of inadequate policies. These policies contributed to the deaths of 11 men before McCollum and 10 men after him,\" Ellison wrote.\nThe TDCJ will appeal the ruling to the 5th U.S. Circuit Court of Appeal, said spokesman Jason Clark.\n\"The safety, security, health and overall well-being of offenders is of paramount importance to the TDCJ,\" Clark wrote in a statement.\nThe attorney for McCollum's family, Jeff Edwards of Austin, said he and his clients are gratified that the facts will finally be heard by a jury and receive a full hearing. Of the 109 prisons in the Texas system, 30 are fully air-conditioned.\nState law required all county jails to be air conditioned. Many inmates have trouble acclimating themselves to a prison in the middle of summer where air-conditioning is unavailable, Edwards said.\n\"All this is going to say is 'Let's look at the facts.' We believe they will speak for themselves\" when presented to a jury, he said.\nThe ruling was sealed Friday and unsealed Tuesday.",
    "source_domain": "abcnews.go.com",
    "title": "Civil trial ordered of Texas prisons, leaders in heat death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/civil-trial-ordered-texas-prisons-leaders-heat-death-45501098"
}