{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 03:56:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Bozak's OT goal gives Maple Leafs series lead over Capitals",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fbozaks-ot-goal-maple-leafs-series-lead-capitals-46853324.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_58bb684e232f428abf29ef04a9741c75_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tyler Bozak scored 1:37 into overtime to cap Toronto's comeback from two goals down in the second period, and the Maple Leafs beat the Washington Capitals 4-3 Monday night to take a 2-1 lead in the first-round series.\nAuston Matthews and Nazem Kadri each had a goal and an assist, and William Nylander also scored for Toronto. Frederik Andersen made 23 saves.\nToronto trailed 2-0 in the first period, and then 3-1 early in the second before Kadri and Nylander scored 4:07 apart late to tie the score in the final minute of the period.\nAlex Ovechkin, Nicklas Backstrom and Evgeny Kuznetsov all scored for the Presidents' Trophy-winning Capitals. Braden Holtby stopped 24 shots.\nAll three games so far have been decided in overtime.\nGame 4 is Wednesday night.\nThe Maple Leafs were hosting their first playoff game in almost four years and coming off an exciting double-overtime win in Game 2. However, the Capitals got the early jump as they scored twice in the first five minutes with both goals coming from their vaunted top line of Ovechkin, Backstrom and T.J. Oshie.\nNate Schmidt, who was filling in for an injured Karl Alzner, got the first one started by rushing into the Toronto zone with speed before finding Backstrom crashing the net across the ice. The Swede beat Leafs defenseman Nikita Zaitsev there and stuffed in a shot short-side.\nZaitsev was playing his first game of the series and first in the NHL playoffs after sitting out the opening two games with a suspected concussion.\nHe came up short again on the Capitals' second goal, giving just a little too much room to Ovechkin, whose slap shot beat Andersen high from the left faceoff circle.\nIt was the second goal on two shots to beat Andersen, who had outplayed reigning Vezina trophy winner Braden Holtby in the first two games.\nWashington looked crisp and confident early, cycling pucks with authority in the Toronto end. But they generated few shots or scoring chances beyond the goals and the Leafs pushed back with Matthews' first of the series.\nThe 19-year-old, held without a point in Games 1 and 2, sped through the neutral zone with speed and fired a shot that ricocheted off John Carlson, Schmidt's face and Matthews' body before finally hitting Holtby. He stopped the initial shot, but Matthews hung with it and batted the rebound out of the air to cut the deficit to 2-1.\nWashington had a chance to put the Leafs away after Kuznetsov upped the lead back to two with his first of the playoffs 5:39 into the second period, but Toronto's penalty-kill managed to fend off a full 2-minute 5-on-3 Capitals power play. The unit stood tall again a short while later when the club was called for too many men.\nGaining some steam from that bit of special teams superiority, the Leafs pulled back within one when Kadri fired through traffic from the point to beat Holtby with 4:47 left in the middle period.\nThen it was the rookie line of Matthews, Nylander and Zach Hyman striking again — their speed and skill proving troublesome all night long for the Capitals. Hyman drew two defenders as he chased down a dump into the offensive zone and, with a little extra room, Matthews pulled the puck out and fed Nylander in front. The 20-year-old, one of three Leafs rookies with 60-plus points in the regular season, was stopped on his first attempt, but followed up to even the score at 3-3 with 40 seconds left in the period.\nToronto held Washington without a shot for the first 13-plus minutes of a dominant third, but failed to score with a pair of power plays. The Capitals finished the period with only three shots at Andersen, nearly scoring when Kuznetsov's shot hit the crossbar.\nHyman drew the power play late in regulation on the goal that Bozak scored in overtime to win it.",
    "source_domain": "abcnews.go.com",
    "title": "Bozak's OT goal gives Maple Leafs series lead over Capitals",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/bozaks-ot-goal-maple-leafs-series-lead-capitals-46853324"
}