{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 06:13:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Matt Hughes' progress 'nothing short of a miracle,' friend says",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmatt-hughes-progress-short-miracle-friend%2Fstory%3Fid%3D49199888.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0813/dm_170813_MLB_Coley_Harvey_on_Harpers_injury/dm_170813_MLB_Coley_Harvey_on_Harpers_injury_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A friend of Matt Hughes' provided a positive update on the former UFC welterweight champion, calling his recovery from a June collision \"nothing short of a miracle.\"\n\"Less than two months ago I didn't know if my best friend was going to make it, and tonight we made a jail break for sushi (in disguise. Ha),\" Tony Zucca wrote in a social media post Sunday that accompanied a photo of the two friends on a sidewalk. \"Talk about a rollercoaster of emotions!\"\nHughes was airlifted to a medical facility in mid-June after the truck he was driving collided with a train about 12 miles north of Hughes' home in Hillsboro, Illinois.?\nAccording to Illinois State Police, Hughes, 43, drove a pickup truck across a railroad grade crossing \"directly in front of a train, and the train struck the passenger side of the truck.\" Although Hughes didn't suffer any broken bones or internal injuries in the crash, he remained in a coma until last month.\nZucca wrote that Hughes \"is working so hard and fights through the frustration\" and called his friend \"an inspiration.\"\nHughes (45-9) held the UFC welterweight championship at various points between 2001 and 2006. He is recognized as one of the greatest 170-pound fighters of all time. Hughes, who has not fought since 2011 and announced his retirement in 2013, publicly said he was considering a comeback fight earlier this year.\nAccording to Zucca, Hughes told him on Sunday that he has \"one more round\" left in him.\n\"He laughed ... but definitely wasn't joking!\" Zucca added.?\nInformation from ESPN's Brett Okamoto was used in this report.?",
    "source_domain": "abcnews.go.com",
    "title": "Matt Hughes' progress 'nothing short of a miracle,' friend says",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/matt-hughes-progress-short-miracle-friend/story?id=49199888"
}