{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 23:56:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Browns top pick Myles Garrett injures foot during practice",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fbrowns-top-pick-myles-garrett-injures-foot-practice%2Fstory%3Fid%3D48045227.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_ss_20170614_175143059_815273_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "BEREA, Ohio -- Defensive end Myles Garrett, the draft's first overall pick, went to the ground in pain after a pass rush during team drills in the Cleveland Browns' minicamp practice on Wednesday.\nCoach Hue Jackson spoke to the media immediately after practice and could not assess if the injury was serious.\n\"That's part of the game,\" Jackson said. \"Obviously I don't want to get any of our players nicked, hurt, any of that. But hopefully things will be fine. We don't want to lose any player, especially not one of our really good players.\n\"But hopefully things will be OK, and I think they will be. I don't know that for sure but we'll find out as I go inside.\"\nGarrett was working with the backup defense during a two-minute drill. He got off the line quickly and beat the right tackle as he rushed quarterback Brock Osweiler. The play was whistled for a sack, but Garrett landed on his left foot after he had extended toward Osweiler.\nHe immediately went to the ground, kneeling with his head on the ground. Trainers checked him and he limped to the sidelines, where he again had his left foot checked without his shoe.\nHe did not leave the sidelines, something Jackson said he took as a \"good sign.\" When the siren sounded for a lightning warning, Garrett limped into the field house with teammates.\n\"I'll know more once we get inside, but I think it's his foot,\" Jackson said. \"So we'll see. I don't know how it happened. Those things happen. Hopefully everything's OK.\"\nGarrett had missed some practice time in offseason work for an undisclosed issue that was not believed to be serious. Jackson would not and could not say if the problem in minicamp was the same one that had been bothering him.\n\"Glad it's toward the end (of offseason work),\" Jackson said. \"He did some good things today and we'll see where we are.\"",
    "source_domain": "abcnews.go.com",
    "title": "Browns top pick Myles Garrett injures foot during practice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/browns-top-pick-myles-garrett-injures-foot-practice/story?id=48045227"
}