{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:58:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "A brain aneurysm is a silent, dangerous ticking time bomb.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2Fcolumn-knowing-health-indicators-brain-aneurysm-save-life%2Fstory%3Fid%3D54699411.json",
    "image_url": "http://abcnews.go.com/Health/column-knowing-health-indicators-brain-aneurysm-save-life/story?id=54699411",
    "language": "en",
    "localpath": null,
    "maintext": "The dangers faced by the silent ticking time bomb that is a brain aneurysm rupture are once again in the headlines. This time it has affected the Chicago White Sox's Danny Farquhar, too.\nIn March 2015, Lisa Colagrossi an Emmy Award-winning veteran anchor and reporter at ABC-owned station WABC-TV in New York died unexpectedly while on assignment from an undiagnosed brain aneurysm.\nWhen we hear that someone suffered an aneurysm, it's in the context of learning about the event. People often hear that the person is in a critical state, and they can only hope that the person pulls through without any life-altering disabilities.\nThe current statistics are frightening to say the least\nOf the over 40,000 ruptures that occur each year, 30-50 percent result in death. Up to 30 percent will have some form of disability. One-third may be able to resume their previous level of function and can fully recover.\nIt is estimated that 3 to 5 percent of the United States population harbor aneurysms.\nKnowing the signs, symptoms along with the risk factors for a brain aneurysm is the first step in early detection and treatment\nThe signs and symptoms can include:\nThe most unique characteristic is the sudden onset of a severe headache or what some doctors describe as “the worst headache of your life.”\nSudden sensitivity to light.\nSudden stiffness of neck.\nSudden sharp pain behind or above one eye.\nSudden blurred or double vision.\nSudden numbness and tingling in facial area.\nSudden loss of consciousness.\nSudden confusion or change of mental status.\nSeizure.\nPerceived \"gun shot\" noise or extremely loud \"BOOM.\"\nDrooping eyelid, nausea and vomiting.\nIf you are experiencing one or several of the indicators above, seek immediate medical attention.\nSome of the risk factors often associated with a brain aneurysm are as follows:\nA family history of someone who suffered a brain aneurysm, particularly a first-degree relative, such as a parent, brother or sister.\nInherited connective tissue disorders, such as Ehlers-Danlos syndrome, that weakens blood vessels.\nPolycystic kidney disease, an inherited disorder that results in fluid-filled sacs in the kidneys and usually increases blood pressure.\nA history of smoking and hypertension.\nIn relation to the family history risk factor, there's currently available a screening test for this called an MRA screening or magnetic resonance angiogram. This is a type of MRI that looks specifically at the body's blood vessels.\nUnfortunately, this test is not covered by most insurance companies.\n\"We at the Lisa Foundation are working with health care providers, hospitals and insurance providers in getting adequate screening for populations at risk for brain aneurysms,\" said Todd Crawford, executive director and founder of the Lisa Colagrossi Foundation.\nOne of the reasons we don’t hear much about this affliction is that it's not on people’s radar and it's often overshadowed by heart disease, ischemic stroke, or breast cancer.\nBrain aneurysms are basically weak or thin parts of the blood vessel wall that eventually balloons outward and can be prone to rupture. Often, patients who are about to experience an aneurysm rupture may present with no clear symptoms. For those who rupture the prognosis is often grim. The increased need for ongoing education of this neurological disorder is critical.\nIt's our profound hope that we will be instrumental in increasing the chances for survival and reducing the often catastrophic disabilities brought on by an aneurysm.\nThe Lisa Foundation in its three-year existence is credited directly with saving many lives here in the United States and abroad through our outreach and education.\nThe Lisa Colagrossi Foundation, an ABC News partner, authored this column. Lisa Colagrossi was a WABC reporter in New York who died after suffering from an undiagnosed brain aneurysm at the age of 49 in March 2015.",
    "source_domain": "abcnews.go.com",
    "title": "COLUMN: Knowing the health indicators of a brain aneurysm can save your life",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/column-knowing-health-indicators-brain-aneurysm-save-life/story?id=54699411"
}