{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:49:50+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Hall of Famer Jerry Rice takes part in 49ers practice",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fhall-famer-jerry-rice-takes-part-49ers-practice-49215023.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_3fa1230e02ff449db17763a1e4500106_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The San Francisco 49ers made a big-time acquisition at wide receiver — at least for one practice.\nHall of Famer Jerry Rice put on the cleats and took part in practice with the 49ers on Monday, running patterns and doing stretches in individual drills, dishing out tips to young receivers and even shadowing the wideouts during team drills.\n\"Oh man, that was pretty exciting,\" undrafted rookie Kendrick Bourne said. \"Kind of had me kind of nervous but definitely very excited. Being out here practicing with him and seeing how much older he is and he can still move well. It was good learning. I learned a lot from him.\"\nRice has plenty of knowledge from a 20-year career that featured NFL records with 1,549 catches, 22,895 yards receiving, 208 total touchdowns and three Super Bowl titles.\nHe even showed he still has some moves at age 54, nearly 13 years removed from his final game, with the way he ran patterns during individual drills.\n\"It's definitely inspiring,\" Bourne said. \"It just tells you how hard you can go and you can push your body to limits that you didn't know you could go.\"\nThe 49ers are making a more concerted effort this season to highlight their rich history and bring former players back into the fold under new general manager John Lynch and coach Kyle Shanahan, whose father Mike was offensive coordinator when Steve Young and Rice helped the team win the Super Bowl following the 1994 season.\nThe team added a Ring of Honor to the stadium this season to honor the 27 people in the 49ers Hall of Fame and has made an effort to bring back players like Young and Rice to the facility.\nThe two addressed the team before practice about establishing the proper culture to be a winning team, a message that resonated because of their accomplishments as players.\n\"When you're talking about the culture to have those guys here who won the Super Bowl and knew what it took,\" safety Eric Reid said. \"It's the vibe. It's all about the vibe. When you walk in the building and see those faces that's greatness right there and you ask them how they did it and they can give you little nuggets that maybe you hadn't thought of before.\"\nBourne was especially eager to pick Rice's brain about how he thrived for so long in the NFL as a receiver from a low-profile college who lacked game-breaking speed.\nWhile Rice was a first-round pick despite a slower combine time in the 40-yard dash after a career at Mississippi Valley State, Bourne went undrafted after catching 79 passes for 1,201 yards and seven TDs last year at Eastern Washington. A 4.68 time in the 40 hurt his cause but he asked Rice how to overcome that.\n\"He told me to just focus on route running,\" Bourne said. \"That's what it really comes down to in this league is separation, getting that little bit of separation.\"\nBourne had a strong debut in his first exhibition game with four catches for 88 yards and a 46-yard touchdown. He recovered from two early drops, thanks to some good advice from coaching intern Katie Sowers.\n\"I dropped my first NFL pass and that was a bummer,\" he said. \"I dropped my second NFL pass too and that was a bummer. Then Katie kind of got in my ear and was just like, 'Man you can really be good.' She compared me to some top players and told me to take the moment in. After that I don't know what got into me. I got into a rhythm and got going.\"\nSowers' tenure with the Niners was supposed to end after that game but she announced on her Facebook page that she is being kept for the whole season. The team has not made an official announcement.\n\"That's awesome,\" Bourne said. \"Congrats to her. I'm looking for a full-time job.\"\nNOTES: LB Aaron Lynch and DL Earl Mitchell left practice with injuries. ... S Jimmie Ward remained on the PUP list a day after testing out his injured hamstring. ... The Niners signed DL Leger Douzable and OL Andrew Gardner to one-year deals and waived S Chanceller James (knee) with an injury designation.\n———\nMore AP NFL: www.pro32.ap.org and www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Hall of Famer Jerry Rice takes part in 49ers practice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/hall-famer-jerry-rice-takes-part-49ers-practice-49215023"
}