{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 20:32:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Accuser of Seattle mayor wants to drop sex abuse lawsuit",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Faccuser-seattle-mayor-drop-lawsuit-48039321.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_cf759d3a742c478194d35ab7ca87b886_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A man who accused Seattle Mayor Ed Murray of sexually abusing him when he was a teenager has asked a court to dismiss the lawsuit he filed against the mayor.\n\"Delvonn Heckard is only delaying his lawsuit until the mayor is out of power,\" his lawyer, Lincoln Beauregard, said Wednesday on Twitter.\nIn a motion filed Tuesday, Beauregard said Heckard feels it would be wise to complete his extensive counseling and recovery before moving forward with the case.\nHe said in the motion that Heckard determined it would be better for the success of the case and the citizens of Seattle if it went forward after Murray was out of office next year.\nIn an email to The Associated Press Wednesday, the lawyer said, \"we look forward to winning.\"\nMurray, who has denied the allegation, dropped his re-election bid because of the lawsuit that claimed he paid Heckard for sex in the 1980s.\nA spokesman for Murray didn't immediately respond to a request Wednesday for comment.\nMurray has said it was better for the city if he didn't run for a second term.\nHis lawyers, Malaika Eaton and Robert Sulkin, filed a motion on May 24 saying the lawsuit should be dismissed.\nThey argued that Heckard had failed to state a legitimate claim and that his sex-abuse claims are barred by Washington's statute of limitations. They also said Murray should be reimbursed for legal costs.\nHeckard's lawsuit, filed in April, claims Murray paid Heckard, now a 46-year-old suburban Seattle man, for sex three decades ago.\nTwo other men claimed in interviews with The Seattle Times that Murray abused them in the 1980s when they lived in an Oregon center for troubled children. They were not part of the Heckard lawsuit.\nThe suit was filed as Murray became a high-profile critic of President Donald Trump. At the time, Murray spokesman Jeff Reading said the case was politically motivated and timed to derail the mayor's re-election bid.\nBeauregard's motion claims Murray's lawyers and his former campaign team \"have successfully tainted the jury pool with false information about the accusers.\" A judge previously rejected Beauregard's request to move the trial out of the city.\nThe Associated Press does not typically identify people who say they are a victim of sex abuse, but Heckard has said he wanted his name made public.",
    "source_domain": "abcnews.go.com",
    "title": "Accuser of Seattle mayor wants to drop sex abuse lawsuit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/accuser-seattle-mayor-drop-lawsuit-48039321"
}