{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:03+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Booker joined \"The View\" to discuss bridging the political divide in America today.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Fsen-cory-booker-bringing-america-running-2020-53853398.json",
    "image_url": "https://s.abcnews.com/images/theview/180319_view_booker2020_1137_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Sen. Cory Booker on bringing America together, running in 2020\nAnd we are back with senator %-pcory bookerwho had something to say. Just a point, we all got to this country in different ways but we're all in the same boat now. And to try to think we're going to demonize each other so bad, we need each other. There's an old saying, if you want to go fast, go alone. If you want to go far, go together. If this country is going to go far, we have to find ways to create common ground and stand together. That message that you're saying is refreshing for me, but then you have Hillary Clinton last week in India saying that she won areas that were, quote, forward thinking. Trump won places that were backward thinking on issues like race and racism. I'm from one of those states she's talking about and I just want to know from you, going forward in 2020 do you think this is an appropriate way for Democrats to speak about Republicans? We in this country -- first of all, the election is over and past and I know that Donald Trump and everyone is talking about Obama and secretary Clinton. The reality is we have to in this coming '18 election -- forget 2020 -- focus on right now. We have to begin to see each other for the truth of who we are. This idea of tolerance that we're going to stomach each other, that's a sin of state. Patriotism is love the country. Love says I see your worth, your value. I understand that my definition of worth is the same as yours. While Donald Trump seems to be intent on separating, dividing, demeaning, degrading, I want Republicans and Democrats to start a new national narrative about how we need each other. Not to pushback on you but Hillary makes me feel that way as well. Do you think this messaging is hurting our party right now? Again, secretary Clinton lost the electoral vote. She's not the president of the United States. My focus is on the future and we right now are in a state of crises. We cannot do the things we all agree upon in this country right now, whether it's dreamers or comprehensive background checks. We need to get back to a country that understands that we're not each other's enemies and if we see each other that way we're not going to be able to rise to our greatest aspirations. That's the kind of thing we need right now, to go from a divisive rhetoric to a rhetoric that says we may disagree on a lot of things but let's find a common ground. Let's get to the point though, before we go. Are you a contender in 2020 for president? I am a contender for the 2018 midterms where I'm going to be fighting for every Democrat -- That's a nonanswer. This is the most important mid-term election of our lifetime. I know. I'm focusing energy. For folks looking beyond that.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Sen. Cory Booker on bringing America together, running in 2020",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/sen-cory-booker-bringing-america-running-2020-53853398"
}