{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:11:44+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fconsumer-confidence-rebounds-april-54690842.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_995585ae444f4c218e9d50e240650ec7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "American consumers were feeling more confident in April, rebounding to a level close to the 18-year high it had reached two months ago.\nThe Conference Board said Tuesday that its confidence index rose to 128.7 in April, up from a March level of 127.0. The March level was just below the 130.0 hit in February, which had been the highest since November 2000.\nThe business research group's index measures consumers' assessment of current conditions and their outlook for the next six months. Conference Board economist Lynn Franco said the strength in the confidence survey suggest that the economy will continue to expand at a solid pace in the months ahead.\nConsumers' assessment of current economic conditions improved somewhat, with consumers rating both business and labor market conditions favorably.\nAnalysts said the strength in confidence reflects a strong labor market with unemployment at a 17-year low, as well as the impact of the $1.5 trillion in tax cuts approved in December, which began showing up in workers' paychecks earlier this year.\nAnalysts said that confidence was also helped by less stock market volatility in recent weeks and a lessening of worries about a full-blown trade war erupting in response to the Trump administration's tougher policies.\nBut some analysts said the high confidence levels may be over-stating the potential for consumer spending growth in coming months.\n\"The sluggishness of real income growth, even after the tax cuts, means that spending cannot rise as fast as the surveys appear to imply,\" said Ian Shepherdson, chief economist at Pantheon Economics.",
    "source_domain": "abcnews.go.com",
    "title": "US consumer confidence rebounds in April",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/consumer-confidence-rebounds-april-54690842"
}