{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:17+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "New video shows that the 12 boys and their soccer coach stuck deep inside a cave in Thailand are healthy and still in high spirits after 10 days in darkness.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Fmedics-supplies-reach-boys-stuck-thai-cave-escape-56359924.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_longman_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Medics, supplies reach boys stuck in Thai cave as rescue planning intensifies\nNow to theew images coming in T 12 boys and their soccer coach strd in that cave in Thailand the boys seem to be D well on this new video. Bue are so ny questions log right now about the gh-stakes harrowing job of getting em out of there. S James Longman is on the scene for U once again and, James, now they're show these boys how T usekba gear. Rter: That's right. To be led out thrts suerged in wat but it's still not I they're strong enoh to do th this morning, new video showing those 12 boys and their coach trapped deep within a cav in Thailand in high spirits. After ten days in total darknes now smiles andestures of thanks speakin up one by one saying they're heahy. Theroup seen wrapped in myr blanket,e sleeping others receing medical attention. Apart from minor injury, mostly cutsnd scrapes all in good health. This guy even giving T victory sign aft sitting for vigil and one family friend telling mebout th powerfuloment henew they were safe. A S moment for of Thailand and seen the dad and huge brace, this big H and we've been waiting R. What is he like? He is a special kid. I don't J say that but H a very specialkid. Reporter: It is a hot day today. Rescuers will B hoping this kind ofther lasts because thin comes it's going be harder to get those boys out. Offis say the boys are already practice using scuba masks I preparation for a potential water rescue according to divers swimming out would be incredibly difficult. Dive and come up and back to rock climbing really ovuge hills a then the DI starts. Reporter: The area where they are tra is a half mile underground and a littlver a LE from the cave's entran they had to navigate a maze barely wide enough T equipment to squeeze through. The entire trekaking six hours. His current, the visibity N be zero at mes. Reporter: The one thing wing in their favor the water current right now is fng towards the entrance of the cavemaking a possible swim to safety easy the boys to navigate. And Thai authories areng to lay a phone line INT that cave so thatse boys can speak with their parents. It was badly damaged in wet wanted wet rain and WER yesterday but hoping ill be able to tame today. Dan, Paula. Trying again. What a relief thatill be, the communication between the parents and cren when it happens. James Longman, thank. A lot T talk about so let's\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Medics, supplies reach boys stuck in Thai cave as rescue planning intensifies",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/medics-supplies-reach-boys-stuck-thai-cave-escape-56359924"
}