{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 18:48:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "University of Wisconsin approves protest punishment policy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Funiversity-wisconsin-approves-protest-punishment-policy-50330415.json",
    "image_url": "http://abcnews.go.com/US/wireStory/university-wisconsin-approves-protest-punishment-policy-50330415",
    "language": "en",
    "localpath": null,
    "maintext": "University of Wisconsin System leaders approved a policy Friday that calls for suspending and expelling students who disrupt campus speeches and presentations, saying students need to listen to all sides of issues and arguments.\nThe Board of Regents adopted the language on a voice vote during a meeting at the University of Wisconsin-Sout in Menomonie. The policy states that students found to have twice engaged in violence or other disorderly conduct that disrupts others' free speech would be suspended.\nStudents found to have disrupted others' free expression three times would be expelled.\n\"Perhaps the most important thing we can do as a university is to teach students how to engage and listen to those with whom they differ,\" system President Ray Cross told the regents. \"If we don't show students how to do this, who will? Without civil discourse and a willingness to listen and engage with different voices, all we are doing is reinforcing our existing values.\"\nThe policy comes amid complaints from conservatives across the country that right-leaning speakers aren't afforded the same level of respect on campuses as liberal presenters. Students at the University of Wisconsin-Madison in 2016 shouted down and traded obscene gestures with ex-Breitbart editor and conservative columnist Ben Shapiro.\nThe University of California-Berkeley cancelled an appearance by right-wing firebrand Milo Yiannopoulus in September. Four protests have turned violent on that campus and in the nearby city in recent months.\nThe new Wisconsin policy mirrors Republican legislation the state Assembly passed in June, though the Senate has yet to act on the bill.\nRegents President John Robert Behling told the board before Friday's vote that adopting the policy ahead of the legislation shows \"a responsiveness to what's going on in the Capitol, which helps build relationships.\"\nRepublican Gov. Scott Walker appointed all but two of the board's 18 members. State public schools Superintendent Tony Evers and Wisconsin Technical College System Board Vice-President Mark Tyler are automatically regents by virtue of their offices.\nEvers, a Democrat running against Walker in next year's gubernatorial election, cast the only dissenting vote. He accused the regents of sacrificing free speech to curry favor with Republican lawmakers.\n\"This policy will chill and suppress free speech on this campus and all campuses,\" Evers said.\nOther Democratic opponents charge that the policy doesn't clearly define what type of conduct is considered disruptive.\n\"Who's going to show up to a protest if they think they could be potentially expelled?\" Democratic state Rep. Chris Taylor, whose district includes the flagship Madison campus, said during a Thursday news conference on the policy.\nA senior at the university, Savion Castro, accused the regents of \"capitulating to a band of right-wing extremists.\"\n\"The First Amendment is supposed to be messy and contentious and allow contentious debate,\" Castro said during the news conference. \"The whole point of protest is to disrupt the status quo and make people uncomfortable.\"\nRegent Regina Millner defended the resolution at the meeting, saying it's designed to promote listening.\n\"I don't consider drowning out another speaker as freedom of speech,\" Millner said. \"That doesn't qualify.\"\nThe policy won't take effect until the system writes administrative rules implementing it and Walker and lawmakers sign off on them. That process that could take months.\n———\nFollow Todd Richmond on Twitter at https://twitter.com/trichmond1",
    "source_domain": "abcnews.go.com",
    "title": "University of Wisconsin approves protest punishment policy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/university-wisconsin-approves-protest-punishment-policy-50330415"
}