{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 21:57:43+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Egypt says 4,400-year-old tomb discovered outside Cairo",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fegypt-4400-year-tomb-discovered-cairo-52814551.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_7c37e34bc7634348a63dda332c0dfe13_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Archaeologists in Egypt have discovered a 4,400-year-old tomb near the country's famed pyramids at the Giza plateau just outside Cairo, the Antiquities Ministry said Saturday, the latest discovery that authorities hope will help revive the country's staggering tourism sector.\nThe tomb was found in a wider area of Giza's western necropolis, which is known to be home to tombs from the Old Kingdom.\nIt likely belonged to a woman known as Hetpet, who archaeologists believe was close to ancient Egyptian royals of the 5th Dynasty.\nThe tomb, unveiled to the media on Saturday, is made of mud brick and includes wall paintings in good condition depicting Hetpet observing different hunting and fishing scenes.\nOther scenes also depict a monkey — in pharaonic times, monkeys were commonly kept as domestic animals — picking fruit. Similar scenes have been found in other tombs belonging to the later 12th dynasty, according to the ministry's statement. Another scene shows a monkey dancing before an orchestra.\nAccording to the ministry, the archaeological mission behind the discovery started excavation work last October. Archaeologists have been making discoveries near the site since the 19th century, and Mostafa al-Waziri, who led the mission, believes there is still more to be found.\n\"This is a very promising area. We expect to find more,\" Al-Waziri told reporters at the site. \"We have removed between 250-300 cubic meters of layers of earth to find the tomb.\"\n\"What we see above the earth's surface in Egypt doesn't exceed 40 percent of what the core holds,\" he added.\nAl-Waziri believes Hetpet had another tomb in Giza's western necropolis and said that excavation work is underway to find that one too.\nHetpet is a previously known figure in Egyptian antiquity though her mummy has not been discovered yet. Fragments of artefacts belonging to Hetpet were found in the same area back in 1909, and were moved to a museum in Berlin at the time, Antiquities Minister Khaled al-Anani said Saturday, speaking at the site to reporters and Western diplomats.\nDespite all the discoveries already made about ancient Egypt, experts say they hope to find much more — in part thanks to modern technology — treasures still buried under the vast desert.\nThe area of the latest discovery is close to a new museum under construction that will house some of Egypt's most unique and precious artifacts, including many belonging to the famed boy King Tutankhamun.\nThe first phase of Grand Egyptian museum is expected to be opened later this year while the grand opening is planned for 2022.\nIn January, Egypt placed the ancient statue of one of its most famous pharaohs, Ramses II at the museum's atrium, which will include 43 massive statues.\nThroughout 2017, the Antiquities Ministry made a string of discoveries across Egypt — including some in the southern city Luxor known for its spectacular temples and tombs spanning different dynasties of ancient Egyptian history.\nEgypt hopes the inauguration of the new museum, along with the recent discoveries, will draw back visitors to the country where tourism has been hit hard by extremist attacks and political turmoil following the 2011 popular uprising that toppled longtime autocrat Hosni Mubarak and the authorities' struggles to rein in an insurgency by Islamic militants.\nThe government has tightened security around archaeological and touristic sites and spent millions of dollars to upgrade airport security especially following the 2015 downing of a Russian airliner over the restive Sinai Peninsula by the Islamic State group, killing 224 people on board.\nThe bombing dealt Egypt's vital tourism sector a hard blow after Russia suspended flights to and from Egypt.\nIn December, Cairo and Moscow signed a security protocol and announced plans to resume Russian flights to the Egyptian capital, due to start this month.",
    "source_domain": "abcnews.go.com",
    "title": "Egypt says 4,400-year-old tomb discovered outside Cairo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/egypt-4400-year-tomb-discovered-cairo-52814551"
}