{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 20:16:03+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Vintage typewriters gain fans amid 'digital burnout'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Fschool-typewriters-attract-generation-fans-48024821.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/WireAP_b9b40ba8e81148f0ac8484531e062081_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Typewriter enthusiasts gather at an Albuquerque restaurant to experiment with vintage Smith Coronas. Fans in Boston kneel in a city square and type stories about their lives during a pro-immigration demonstration. A documentary on typewriters featuring Tom Hanks and musician John Mayer is set for release this summer.\nIn the age of smartphones, social media and hacking fears, vintage typewriters that once gathered dust in attics and basements are attracting a new generation of fans across the U.S.\nFrom public \"type-ins\" at bars to street poets selling personalized, typewritten poems on the spot, typewriters have emerged as popular items with aficionados hunting for them in thrift stores, online auction sites and antique shops. Some buy antique Underwoods to add to a growing collection. Others search for a midcentury Royal Quiet De Luxe — like a model author Ernest Hemingway used — to work on that simmering novel.\nThe rescued machines often need servicing, leading fans to seek out the few remaining typewriter repair shops.\n\"I haven't seen business like this in years,\" said John Lewis, a typewriter repairman who has operated out of his Albuquerque shop for four decades. \"There's definitely a new interest, and it's keeping me very busy.\"\nRenewed interest began around 10 years ago when small pockets of typewriter enthusiasts came together online, said Richard Polt, a Xavier University philosophy professor and author of \"The Typewriter Revolution: A Typist's Companion for the 21st Century.\" Since then, the fan base has grown dramatically, and various public events have been organized around the typewriter.\n\"It's beyond the phase where this is just a fad,\" Polt said.\nIt's almost impossible to gauge recent typewriter sales. Almost all of the original manufacturers are out of business or have been bought out and become different companies. Moonachie, New Jersey-based Swintec appears to be one of the last typewriter makers, selling translucent electronic machines largely to jails and prisons.\nBut operators of thrift stores and estate sales say typewriters are some of the quickest items to go.\n\"That's part of the fun: the hunt,\" said Joe Van Cleave, an Albuquerque resident who owns more than a dozen typewriters and runs a popular YouTube channel on restoring the machines. \"Sometimes, like a little luck, you might find something from the 1920s in great condition.\"\nDoug Nichol, director of the upcoming documentary \"California Typewriter,\" said the interest stems from \"digital burnout\" and people wanting a connection to the past. That interest seems to transcend age, he said.\n\"Kids who grew up knowing only mobile phones and the computer are excited to see a letter typed with your own hand,\" Nichol said. \"It's a one-on-one interaction that doesn't get interrupted by Twitter alerts.\"\nIn his film, set for release in August, Nichol interviews Hanks, who said he uses a typewriter almost every day to send memos and letters.\n\"I hate getting email thank-yous from folks,\" Hanks says in the film. \"Now, if they take 70 seconds to type me out something on a piece of paper and send to me, well, I'll keep that forever. I'll just delete that email.\"\nHanks owns about 270 typewriters but often gives them to people who show an interest.\nOne way the typewriter craze is growing is through organized \"type-ins\" — meet-ups in public places where typewriter fans try different vintage machines. Such events have been held in Phoenix, Philadelphia, Seattle, Los Angeles and Cincinnati.\nDuring a recent type-in at Albuquerque soul food restaurant Nexus Brewery, around three dozen fans took turns clicking the keys of an Italian-made 1964 Olivetti Lettera 32 and a 1947 Royal KMM, among others.\nRich Boucher spent most of his time on a 1960s-era Hermes 3000 crafting poetry.\n\"I haven't used a typewriter in forever,\" he said. \"This is a real refreshing way to spend a summer afternoon.\"\nAfter finishing his work, Boucher grabbed his phone and sent a Facebook status update about the experience. He then started looking online for a Hermes 3000.\n\"That's the typewriter I want,\" he said. \"I'm going to find one.\"\n———\nFollow Russell Contreras on Twitter at http://twitter.com/russcontreras",
    "source_domain": "abcnews.go.com",
    "title": "Vintage typewriters gain fans amid 'digital burnout'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/school-typewriters-attract-generation-fans-48024821"
}