{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:57:44+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Calls for change grow amid capitol sexual misconduct claims",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcalls-change-grow-amid-capitol-sexual-misconduct-claims-52806886.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_36c2af4a91cc4c109e671475be15442c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An Arizona lawmaker who repeatedly harassed women has become the first since the swell of the #MeToo movement to get kicked out of office by colleagues but likely will not be the last to face repercussions amid intensifying scrutiny of sexual misconduct in state legislatures.\nThe heightened focus on harassment and misconduct has led to growing calls for change in a year that already has seen an unusually large number of women expressing interest in running for office.\n\"This conduct perpetuates the good-old-boys culture all too familiar to women in workplaces across the nation,\" said Ohio state Rep. Teresa Fedor, one of several female Democratic lawmakers who called this week for the resignation of Republican Rep. Bill Seitz because of offense remarks. \"Women and men deserve better, not more of the same tired excuses. It's time for a change.\"\nWith his expulsion on Thursday, Arizona Rep. Don Shooter became the 15th state lawmaker to leave office since the start of 2017 (the others resigned) after being accused of sexual misconduct. About 20 others have faced lesser consequences, ranging from forced apologies to suspensions to the loss of powerful leadership posts, according to a state-by-state review by The Associated Press.\nSexual harassment investigations are ongoing against other state lawmakers, including in California, Hawaii, Kentucky and Oregon. On Friday, the Democratic leaders of the California Assembly and Senate released records that show four current lawmakers have faced such complaints since 2006, although none was formally disciplined. They include a 2017 allegation against a female lawmaker, Democratic Assemblywoman Autumn Burke, who later took responsibility for engaging in sexually charged banter.\nThe issue is already beginning to resonate in election campaigns. Women have stepped forward as candidates in five of the eight upcoming elections across the nation to replace lawmakers who resigned amid sexual misconduct allegations.\nIn California, a former legislative staffer who says she was aware that a co-worker was being sexually harassed is now running for the lawmaker's seat. The alleged incident happened years ago when former Assemblyman Raul Bocanegra was serving as chief of staff for another lawmaker. Bocanegra resigned in November amid multiple allegations.\nYolie Anguiano said she decided to run for Bocanegra's seat in Los Angeles' San Fernando Valley after the allegations surfaced and that she regrets not speaking up at the time about what she knew. Anguiano said she was fearful of retaliation and believes electing more women is critical to addressing issues such as health care and education.\n\"I want to have that seat at the table to bring up these policy issues but also to hold those folks who are hurting other people, whether they are men and women, to hold them accountable,\" she said.\nIn Oklahoma, Amber Jensen, a Democrat who represents a rural part of the state, is running to replace former state Sen. Bryce Marlatt, who resigned in September after being charged with sexual battery stemming from an incident with an Uber driver. Jenson said she attended last year's women's march in Oklahoma City and was inspired to see so many women stepping forward.\n\"I feel like a woman's voice is missing from the very conversations that affect all women,\" Jensen said. \"I am tired of men making decisions for women.\"\nIn what could be a historic election, many women have said they plan to run for office this year for the first time at all levels of government, from statehouses to Congress. That is driven largely by Democratic frustration over the election of President Donald Trump, but the #MeToo movement also is playing a role.\nExperts say lawmaker resignations and retirements can provide an opportunity for women, because it's easier for a political newcomer to be competitive in an open seat rather than challenging an incumbent with name recognition and a stockpile of campaign cash.\n\"When the issue is sexual harassment and men behaving very badly, it also opens up a window for a woman candidate,\" said Debbie Walsh, who leads the Center for American Women and Politics at Rutgers University. \"Whether it's true or not, women are perceived to be more ethical and honest and far less likely to behave in the manner that these lawmakers did.\"\nSome men also are citing accusations of sexual misconduct against male lawmakers as part of their impetus for mounting electoral challenges this year.\nBrian Kent Strow, an economics professor at Western Kentucky University, said he was frustrated when negotiations to fix the state's multi-billion public pension debt fell apart last fall following reports that four Republican lawmakers had secretly signed a sexual harassment settlement. One of those lawmakers was Rep. Michael Meredith, Strow's representative and someone he had voted for in the past.\nWhen the daughter of one of Meredith's Republican colleagues subsequently accused the lawmaker of sending her inappropriate Facebook messages, Strow decided to challenge Meredith in the Republican primary.\n\"That made me upset, that the real business of the state would get sidetracked because people were misbehaving personally,\" said Strow, adding: \"I had basically had enough.\"\nMeredith declined to comment Friday about the accusations or his re-election bid.\n———\nAssociated Press writers Adam Beam in Frankfort, Kentucky, Bob Christie in Phoenix and Julie Carr Smyth in Columbus, Ohio, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Calls for change grow amid capitol sexual misconduct claims",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/calls-change-grow-amid-capitol-sexual-misconduct-claims-52806886"
}