{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 19:47:47+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Felectric-vehicle-startup-sf-motors-takes-indiana-plant-55539431.json",
    "image_url": "https://abcnews.go.com/International/wireStory/electric-vehicle-startup-sf-motors-takes-indiana-plant-55539431",
    "language": "en",
    "localpath": null,
    "maintext": "An electric vehicle startup announced Wednesday that it is retooling an Indiana factory and hopes to conduct trial runs for two new lines of vehicles by the end of the year.\nState officials say SF Motors, a Silicon Valley-based subsidiary of China's Chongqing Sokon Industry Group, plans to hire back some workers who were laid off when AM General halted operations at its Mishawaka plant last year.\nThe company says it will spend $160 million to buy, renovate and retool the factory, which will serve as the company's main U.S. manufacturing plant. It plans to employ up to 467 workers.\nTo secure the deal, the state of Indiana is offering the company $3.8 million in tax credits and up to $500,000 for worker training. The state is also offering an additional $653,000 in tax credits through a program that encourages companies to take over existing out-of-operation facilities.\nSaint Joseph County, where the factory is located, is also considering an economic incentives package for the company.\nRepublican Gov. Eric Holcomb joined company officials for the announcement on Wednesday.\n\"With a world of options, we're thrilled SF Motors chose to expand in Indiana. We look forward to witnessing their continued success in Indiana as they develop 21st-century solutions with the help of our talented Hoosier workforce,\" Holcomb said in a statement.\nThe South Bend Tribune previously reported that the plant made Mercedes-Benz R-Class vehicles for Chinese buyers and the Hummer H2.\nIn March, SF Motors officials showed off two crossover SUVs vehicles, the SF5 and SF7, at its Santa Clara, California, headquarters. Both vehicles are slated for production at the Indiana factory.\nThe plant will handle full production of the vehicles, from body welding to battery production and final assembly.",
    "source_domain": "abcnews.go.com",
    "title": "Electric vehicle startup SF Motors takes over Indiana plant",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/electric-vehicle-startup-sf-motors-takes-indiana-plant-55539431"
}