{
    "authors": [
        "Abc News",
        "More Catherine"
    ],
    "date_download": "2018-07-04 09:47:14+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "A separate competition, Miss America, is ending its swimsuit competition.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fmiss-usa-defends-swimsuit-competition-calling-empowering%2Fstory%3Fid%3D56352460.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/miss-usa-win-gty-hb-180703_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Shortly after Miss America made headlines with a bombshell announcement that it's scrapping its swimsuit competition, the newly crowned winner of the separate Miss USA pageant spoke out about the inclusion of swimsuit competitions, calling them \"empowering.\"\n\"It's just exciting and it's empowering to be able to confidently stand on that stage and just have fun in the swimsuit,\" the reining Miss USA Sarah Rose Summers told ABC News' Linsey Davis.\n\"It takes confidence unlike anything else -- true confidence -- not just on the outside that you're exuding to the judges and the audience and the millions of people watching at home, but inner confidence,\" Summers said.\nSummers, 23, is the first woman from Nebraska to win the Miss USA title since the pageant began in 1952.\nMatt Sullivan/Getty Images\nHer comments come on the heels of last month's announcement that Miss America, which is not associated with the Miss USA pageant, would eliminate the swimsuit competition after including it for nearly a century.\n\"We are no longer a pageant,\" Gretchen Carlson, the chair of the Board of Trustees of the Miss America Organization, said on \"GMA\" in June. \"We are a competition.\"\nFOX via Getty Images\nWhile Summers acknowledged that she doesn't know what the future holds, she believes there is still a place for the swimsuit competition in pageantry.\nIn the Miss USA pageant, the swimsuit portion \"has been the longest standing phase of competition\" and the \"tradition is huge,\" she added.\nFOX via Getty Images\nSummers, who formerly worked as a fitness instructor, also acknowledged the criticism that she only likes the swimsuit portion of the competition because she has good genetics and the physique of a full-time Pilates teacher.\n\"I have worked my booty off to be where I am,\" she said. \"It's not just handed to me on a silver platter -- I don't have amazing metabolism.\"\nAndy Kropa/Invision via AP\nFor all the young girls that are tuning in to the competition, Summers said she would tell them \"don't fall to self-comparison to others\" and instead \"just empower each other.\"\n\"Be each others' best cheerleaders, rather than critics, because that's what is going to bring ultimate happiness to yourself,\" she added.\nSummers added that she believes that \"in this Me Too movement time that we're in,\" women \"should be empowering all other women’s decisions no matter what that is.\"\n\"I choose, all of us choose to compete in pageantry ... no one’s making us do that,\" she said. \"I know that I’m getting up there and I’m standing on a stage in a swimsuit, and I get to rock all my hard work on that stage.\"",
    "source_domain": "abcnews.go.com",
    "title": "Miss USA defends swimsuit competition, calling it 'empowering'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/miss-usa-defends-swimsuit-competition-calling-empowering/story?id=56352460"
}