{
    "authors": [
        "Abc News",
        "Kaelyn Forde",
        "More Phoebe",
        "More Kaelyn"
    ],
    "date_download": "2018-07-04 17:32:55+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "\"Below the Surface\" cost 6 million Euros.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Fstone-axes-cellphones-project-examines-amsterdams-history-junk%2Fstory%3Fid%3D56339929.json",
    "image_url": "https://s.abcnews.com/images/International/riverbed-1-ht-er-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In Amsterdam, one society's trash is truly another's treasure. While excavating two parts of the Amstel riverbed to build a new subway line, city archeologists discovered a trove of 700,000 everyday objects people had discarded over the centuries, from stone axes to cellphones. Now, these pieces of \"junk\" have become intriguing clues to what life was like over the centuries.\nThe Amstel is a slow-streaming, natural river that dates back 3,000 years, and people have used it to dump waste over the centuries, Jerzy Gawronski, the Amsterdam archaeologist responsible for the project, told ABC News. The large number and huge variety of these every day \"waste\" objects make them a rich and rare source of urban history. Some of the objects archeologists found date back before the city was even built in the 1300s when the area was inhabited by small, temporary communities along the river.\nThese archeological finds were the result of a planned project called \"Below the Surface,\" part of the 15-year process to construct a nearly 5-mile-long subway line under the Amstel riverbed. Archeologists sifted the mud and silt in the riverbed 12 meters (nearly 40 feet) below the top strata at two of the construction sites where new subway stations were eventually built.\nHarold Strak\nThe oldest objects found during the digs were stone axes dating back to Neolithic times. Moving through the ages, as the settled urban community grew into a bustling city and a center for trade and shipping, the riverbed piled up with a vast variety of everyday objects like pots, coins, combs, thimbles, utensils, locks, keys, dolls, shells, nails, tobacco pipes, weapons, and games.\nA piece of someone's dentures, cameras, cellphones and personal documents are among the more modern finds. Many of the objects, likely dropped from boats on the water, are intact, perfectly preserved over the years, while others like pots, bottles, and animal bones were often broken and scattered in pieces.\nGawronski said what makes the whole collection so intriguing and exciting is seeing everything together.\n\"Each object has its story,\" Gawronski said. \"Together they tell a story, and that is the story of the city.\"\nHarold Strak\nWhen the Rokin subway station opens later this month, passengers will be able to see a selection of 10,000 of the objects excavated from that very site as they descend on the escalators. The new North/South rapid transit line and its eight stations will open to the public on July 22.\nBut people interested in the city's many pieces of history don't have to ride the subway to appreciate them.\nThe project's high-speed website features an interactive database where viewers all over the world can quickly move through superb photographs of about 30,000 of the objects as well as their corresponding data.\nAnyone is free to roam and search the database to carry out their own research or just look. As an added, fun feature, the site even allows people to select and compose their very own mini archeological collection of random objects.\nLaunched less than a month ago, the site is already attracting an average of 40,000 to 60,000 visitors per day, with a social media reach of about 13 million so far as interest grows around the globe, according to its creators.\n\"Everyone is so enthusiastic because they all recognize the novelty; the way we have presented archeology as an open source, available for all,\" Gawronski said. \"We are showing things in a democratic way without any national message. Everyone is able to see what kind of city Amsterdam was.\"\nAlong with the open online resource, the archeological project also includes a book-catalog called \"Stuff,\" which contains 13,000 photos of categorized objects.\n\"Stuff\" has already been distributed to all the city's schools to be used as a teaching tool, the project's creators say.\nAll in all, the \"Below the Surface\" project cost 6 million Euros.",
    "source_domain": "abcnews.go.com",
    "title": "From stone axes to cellphones, new project examines Amsterdam's history through 'junk'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/stone-axes-cellphones-project-examines-amsterdams-history-junk/story?id=56339929"
}