{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 20:51:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Ukraine’s government has denied a report that one of the country’s state-owned factories may have supplied the rocket engines North Korea is using to create an ICBM.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fukraine-denies-north-korean-missile-components-state-owned%2Fstory%3Fid%3D49206153.json",
    "image_url": "http://a.abcnews.com/images/International/NorthKorea01-Missile-ap-jrl-170807_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ukraine’s government has denied a report that one of its state-owned factories may have supplied the rocket engines North Korea is using in its quest to create a missile capable of hitting the continental United States.\nThe successful test launches North Korea has carried out in recent months that have prompted fiery rhetoric from President Donald Trump have also surprised experts. The country has been making rapid progress in developing an intercontinental ballistic missile (ICBM). Now, a new analysis by an American missile expert, first reported by The New York Times on Monday, says it has identified the engines that are powering these recent missile tests as a type produced by a factory in the Ukrainian city of Dnipro.\nMichael Elleman, a senior fellow for missile defense at the International Institute for Strategic Studies, told The New York Times he believed that the engines had likely been acquired illegally from workers from Yuzhmash, a Ukrainian factory that has been suffering severe financial difficulties recently. Elleman said he did not believe Yuzhmash's executives or the Ukrainian government were involved in the deal, but that Ukraine was the most likely source of engines. Elleman told the Times he feared that Yuzhmash technicians might be aiding the North Koreans.\n“It’s likely that these engines came from Ukraine —- probably illicitly,” Elleman told the Times. “The big question is how many they have and whether the Ukrainians are helping them now. I’m very worried.”\nThe head of Ukraine’s National Security and Defense Council, Oleg Turchynov, flatly rejected Elleman's report in a statement. Turchynov said the claims were unfounded and suggested Russian intelligence officials were behind the allegations.\n\"This information is not based on any grounds, provocative by its content, and most likely provoked by Russian secret services to cover their own crimes,” Turchynov said. “Ukraine has always adhered to all its international commitments, therefore, Ukrainian defense and aerospace complex did not supply weapons and military technology to North Korea.”\nA spokesperson for the factory, Yuzhmash, also denied the report, telling ABC News it was \"false information.\"\nElleman’s analysis, published in full on the International Institute for Strategic Studies' website, sought to answer a question that has puzzled experts. Many analysts have wondered how North Korea could have so rapidly produced an intercontinental ballistic missile capable of reaching the U.S. mainland, given that even a year ago its efforts had appeared mired in technical failures.\nOn May 14, North Korea test launched a new intermediate missile capable of striking Guam. Two months later, on July 4, it launched a more powerful missile that the U.S. military estimates reached an altitude of more than 1,700 miles, making it officially an intercontinental ballistic missile. That launch was met with strong international condemnation and provoked an intense war of words between Trump and North Korea's leader, Kim Jong Un.\nThe successful launches abruptly ended a long string of failures during which North Korean rockets often blew up shortly after ignition. North Korea's efforts to build an ICBM seemed to stall until September last year, after which the country moved swiftly from a ground-launch test through to a full successful ICBM launch. Such progress through design stages normally take years, experts have said.\nIn his analysis, Elleman suggested that North Korea’s rapid progress was due to the fact that it had imported a new foreign-made engine, adapted with foreign expertise. Based on analyzing video of the launches, Elleman said he had narrowed down the recent missiles’ engine type. Elleman said it appeared to be a modified version of a Russian-designed liquid fuel engine, called an RD-250, that was originally mass produced for use in the Soviet Union’s nuclear arsenal.\nDuring the Soviet Union and up until 2006, Elleman wrote, the engines were produced by Yuzhmash in conjunction with a Russian company, Energomash. But in recent years, Yuzhmash has suffered severe financial problems, recently exacerbated by the economic crisis in Ukraine following the 2014 revolution there and the country's conflict with Russia.\nElleman noted that hundreds of the rocket engines may be stored in Russia in Energomash warehouses as well, but suggested that Yuzhmash’s financial troubles mean that it was the prime suspect as the supplier to North Korea. He wrote he believed criminal networks operating in Ukraine may have collaborated with workers from the plant to acquire some of the spare engines.\nYuzhmash rejected that information in a statement on its website, writing that the claims in The New York Times article \"do not correspond to reality\" and are “based on an incompetent 'expert' opinion.”\nThe company said that it had not produced any military-use missile technology since Ukraine’s independence in 1991 and that it complied with an international treaty intended to prevent the spread of ballistic missile technology for armed purposes.\nReached by phone later on Monday, Elleman reiterated that he did not believe either the Ukrainian government or Yuzhmash executives had been involved in supplying the engines but stood by his claim that Ukraine remained the most likely source.\n“I think it’s more likely it came from Ukraine, but I can’t be certain,” he said. \"We don't have proof that it came from Yuzhmash or any other specific firm.\"\nElleman added that both Yuzhmash and Energomash were the most likely sources. It would not be the first time North Korea has sought Ukrainian rocket technology. In 2012, Ukraine jailed two North Koreans on espionage charges for attempting to acquire classified technology relating to rocket engines from a Yuzhmash researcher, Yonhap News Agency reported at the time.\nElleman said one of his primary reasons for looking to Yuzhmash was the nature of the modification made by the North Koreans, condensing the engine to a single chamber instead of the usual two. Elleman said two sources had seen an engine with such a modification on display at Dnipro National University, which is closely connected with Yuzhmash.\n“It doesn’t mean that Yuzhnoi actually did it,” Elleman said using part of the company's name. But, he said, \"that's what leads me to think it's the most likely source.\"\nYuri A. Mitikov, head of the university's engine design department who has worked with Yuzhmash, told ABC News that it was impossible that the factory had supplied the engine.\n“Yuzhmash is a forgotten factory,” Mitikov said of the company's rocket engineering section. “It simply isn’t working.”\nMitikov said that for the past five years, the rocket construction department has only been working one day a week and that most of the rocket engines had been stored in Russia.\nHe argued U.S. arms control specialists had helped dismantled much of the factories' equipment used for military-use missile construction when Ukraine handed over its nuclear arsenal after 1991.\nAs for the modified RD-250 engine at the university, Mitikov said there was indeed one in a department lab, but that it was a mock-up for students.\n“There’s nothing inside,” he said.\nYuzhmash is currently contracted to produce 12 ‘Zenit’-class rockets for the Russian-owned commercial space company, S7 Sea Launch, according to a statement in June announcing the project.\nBut otherwise, Yuzhmash largely produces trolleybuses and tractors now.\nElleman said the key point he had been trying to make was that North Korea had not produced the engine that it was using and that it must have been smuggled into the country from Russia or Ukraine.\nHe praised Ukraine's government for its previous work on arms control and said he believed they needed to investigate whether the engine could have come from its territory.\n“The Ukrainian government should investigate, and if they exonerate themselves, then great,\" he said. \"But there is definitely a source somewhere.”",
    "source_domain": "abcnews.go.com",
    "title": "Ukraine denies North Korean missile components came from state-owned factory",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/ukraine-denies-north-korean-missile-components-state-owned/story?id=49206153"
}