{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 04:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "States pursuing plans to help workers save for retirement",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fstates-pursuing-plans-workers-save-retirement-45488571.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/states-pursuing-plans-workers-save-retirement-45488571",
    "language": "en",
    "localpath": null,
    "maintext": "States are moving forward with new initiatives to help workers save for retirement, even as the Republican-led Congress tries to block rules making it easier for them to do so.\nStudies show a sharp divide in retirement savings between those who have employer-sponsored plans and those who do not. The state programs are designed to fill in the gap.\nDozens of small business owners recently gathered in Schaumburg, Illinois, to learn about the new state-sponsored retirement savings initiative, \"Secure Choice IRA.\" Officials said it could help about 1.2 million workers who don't have access to an employer-sponsored retirement plan.\n\"It's clear there's a retirement crisis,\" Illinois Treasurer Michael W. Frerichs told the small business owners. \"This is a problem not only for the families but for all of us.\"\nSeven states — California, Connecticut, New Jersey, Maryland, Oregon and Washington, in addition to Illinois — are in various stages of implementing state-sponsored retirement savings plans.\nCalifornia's plan will automatically enroll about 6.8 million employees. Employees can opt out of the plan and employers are not required to match contributions. Payroll deductions are expected to start in 2018.\nThe plans with automatic payroll deduction are IRAs and are tax-deductible, which means employees get a tax incentive because they don't pay federal taxes on the money saved for retirement until they're withdrawn.\nThe states programs were helped along by Labor Department rules governing automatic-enrollment and payroll deductions.\nBut Congress is moving to block those rules. A House vote is scheduled Wednesday.\n\"Our nation faces difficult retirement challenges, but more government isn't the solution,\" Rep. Tim Walberg, R-Mich., the chairman of the House subcommittee on Health, Employment, Labor and Pension, said in a statement. \"A better way is to reduce costly red tape and make it easier for small businesses to band together to offer retirement plans for their employees.\"\nWalberg said there were concerns that these new retirement plans discouraged small businesses from offering private-sector plans and had inadequate safeguards.\nA spokesman for Labor Secretary-nominee Andrew Puzder said it would be \"premature\" for the fast-food executive to comment on this issue before being confirmed.\nAt least 30 states have considered proposals to study or establish state-sponsored retirement savings plans over the past five years, according to the Center for Retirement Initiatives at Georgetown University.\nThe Labor Department estimates that as many as 70 million workers could benefit.\nThat includes workers like, Otto Deurloo-Willard, 31, a store manager at the Cork & Bottle Shoppe, a liquor store in Oregon. He earns $12.50 an hour, slightly higher than Oregon's minimum wage. He doesn't have a retirement plan at work and said he didn't think about saving until he got engaged.\n\"I'm at a different point of my life. I'm getting married, and we are planning for a life together,\" Deurloo-Willard said.\nAmericans without work-sponsored savings plans are less likely to save for retirement. Research from the nonpartisan research organization Employee Benefit Research Institute shows that 62 percent of employees with an employer-sponsored savings plan had more than $25,000 in savings and 22 percent of those workers saved $100,000. By contrast, about 94 percent of workers without access to those plans had less than $25,000, according to the 2014 study.\nThose at the lower end of the income distribution are hit particularly hard, with many relying solely on Social Security when they retire, according to the Center for Retirement Research at Boston College.\n\"States win when more people are prepared for retirement and financially ready to be self-sufficient, which reduces the need for state spending on elder-support programs,\" said Gerri Madrid-Davis, AARP Director of State Advocacy and Strategies.\nDemocratic state Sen. Daniel Biss, who introduced Illinois' program, has called it the \"most efficient and least intrusive way\" to help people save for retirement while putting little burden on the state's employers.\nBut Mark Grant, Illinois director of the National Federation of Independent Business, says it adds to a long list of mandates small businesses have to fulfill.\n\"If a business can afford to do this kind of thing, they would do it for their employees,\" Grant said.\nThe plan, passed in 2015, limits participation to small businesses that have been open for more than two years and have at least 25 employees. The state hopes to fully implement it by 2018.\nJennifer Piacenza, operations manager for Palatine Welding Company, said she's excited about Secure Choice but worries that the 35 employees at her family business won't take advantage of it.\n\"We offered a retirement program to our employees and people didn't participate,\" Piacenza said. \"We couldn't maintain it.\"\nFor his part, Deurloo-Willard says automatic retirement deductions from his paycheck are exactly want he needs.\n\"I've never made enough to save but what I like about this (the savings plan) is that it takes the responsibility of savings out of my hands,\" Deurloo-Willard said. \"I don't have to think about it. It's deducted from my check.\"\n———\nEDITOR'S NOTE — Maria Ines Zamudio is studying aging and workforce issues as part of a 10-month fellowship at The Associated Press-NORC Center for Public Affairs Research, which joins NORC's independent research and AP journalism. The fellowship is funded by the Alfred P. Sloan Foundation.",
    "source_domain": "abcnews.go.com",
    "title": "States pursuing plans to help workers save for retirement",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/states-pursuing-plans-workers-save-retirement-45488571"
}