{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:21:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "'Out for blood': Man arrested in plan to bomb Oklahoma bank",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ffbi-arrests-man-plot-detonate-bomb-oklahoma-bank-49208876.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_c065912de2f544eeb56d2f1029e6a392_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A 23-year-old man who was \"out for blood\" when attempted to detonate what he believed was an explosives-laden van outside an Oklahoma bank in a plot similar to the deadly 1995 bombing of the Oklahoma City federal building is expected to be formally charged Monday, authorities said.\nFederal officials said Jerry Drake Varnell of Sayre, Oklahoma, was arrested early Saturday in connection with a plot to detonate a vehicle bomb in an alley adjacent to BancFirst in downtown Oklahoma City. Varnell was scheduled to appear in federal court later Monday on a charge of attempting to use explosives to destroy a building in interstate commerce. Court records do not indicate whether Varnell is represented by an attorney.\nA federal complaint filed on Sunday says a confidential informant told the FBI in December that Varnell wanted to blow up a building and \"that Varnell was upset with the government and was seeking retaliation.\"\nOfficials said Varnell initially wanted to blow up the Federal Reserve Building in Washington, D.C., with a device similar to one used in the 1995 Oklahoma City bombing that destroyed the Alfred P. Murrah Federal Building, killing 168 people and injuring hundreds more.\nIn a series of text messages with the FBI's informant, Varnell \"claimed to have a bunker for when the world (or United States) collapsed\" and indicated he was trying to build a team, the complaint states.\n\"I'm out for blood,\" the complaint quotes Varnell's texts. \"When militias start getting formed I'm going after government officials when I have a team.\"\nBut an undercover FBI agent posed as someone who could help Varnell build a bomb and the device used was actually inert, authorities said. Varnell's actions were monitored closely for months as the plot developed.\n\"There was never a concern that our community's safety or security was at risk during this investigation,\" said Kathryn Peterson, special agent in charge of the FBI in Oklahoma.\nThe undercover agent met face-to-face with him on June 1 to discuss obtaining materials for an ammonium nitrate and fuel oil bomb similar to the one used in the Oklahoma City bombing, the complaint states.\nVarnell indicated at the meeting that he had previously made homemade explosives and that he \"was of the same mind with people who wanted to use explosives and make a statement,\" the complaint says.\n\"Something needs to be done,\" Varnell said, but killing a lot of people was not a good idea, according to the complaint. During text conversations in July, Varnell stated he wanted to conduct the attack after closing hours to prevent casualties but conceded that some bank workers or custodians who were inside the building could be killed or injured in the blast, it says.\nThe complaint says Varnell helped assemble the device and load it into what he believed was a stolen van. Shortly after midnight on Saturday, Varnell drove the van by himself from a storage unit in El Reno, about 30 miles (48 kilometers) from the bank in Oklahoma City, and dialed a number on a cell telephone that he believed would trigger the explosion. The FBI and members of a Joint Terrorism Task Force arrested Varnell shortly before 1 a.m.\nThe complaint also states that Varnell prepared a statement to be posted on Facebook after the explosion which reads in part that the attack was \"retaliation against the freedoms that have been taken away from the American people\" and \"an act done to show the government what the people think of its actions.\"\nIf convicted, Varnell faces between five and 20 years in prison.\n———\nSign up for the AP's weekly newsletter showcasing our best reporting from the Midwest and Texas: http://apne.ws/2u1RMfv .",
    "source_domain": "abcnews.go.com",
    "title": "'Out for blood': Man arrested in plan to bomb Oklahoma bank",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/fbi-arrests-man-plot-detonate-bomb-oklahoma-bank-49208876"
}