{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 00:26:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Lawsuit challenges Kentucky's medical marijuana ban",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Flawsuit-challenges-kentuckys-medical-marijuana-ban-48044761.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/lawsuit-challenges-kentuckys-medical-marijuana-ban-48044761",
    "language": "en",
    "localpath": null,
    "maintext": "Kentucky's criminal ban against medical marijuana was challenged Wednesday in a lawsuit touting cannabis as a viable alternative to ease addiction woes from opioid painkillers.\nThe plaintiffs have used medical marijuana to ease health problems, the suit said. The three plaintiffs include Dan Seum Jr., the son of a longtime Republican state senator.\nAnother plaintiff, Amy Stalker, was prescribed medical marijuana while living in Colorado and Washington state to help treat symptoms from irritable bowel syndrome and bipolar disorder. She has struggled to maintain her health since moving back to Kentucky to be with her ailing mother.\n\"She comes back to her home state and she's treated as a criminal for this same conduct,\" said plaintiffs' attorney Daniel Canon. \"That's absurd, it's irrational and it's unconstitutional.\"\nStalker, meeting with reporters, said: \"I just want to be able to talk to my doctors the same way I'm able to talk to doctors in other states, and have my medical needs heard.\"\nThe suit, filed in Franklin County Circuit Court in Frankfort, claims the medical marijuana ban violates state constitutional privacy protections. The government also cannot arbitrarily restrict the liberty of patients to use medicines that work, said another plaintiffs' attorney, Candace Curtis.\n\"Cannabis helps sick people,\" Curtis said. \"It is safe, it is not addictive and it works.\"\nMore than half the country allows patients suffering from chronic pain and other ailments to use medical marijuana as an alternative to \"often dangerous and addictive\" prescription drugs, the suit said. The suit also delved into Kentucky's struggles with opioid addiction.\nKentucky had the nation's third-highest death rate from opioid overdoses in 2015, it said. Hospital admissions from opioid abuse have dropped in states allowing medicinal cannabis, it said.\n\"Medical cannabis keeps people off of opioids,\" Canon said.\nDefendants are Republican Gov. Matt Bevin and Democratic Attorney General Andy Beshear. Their offices didn't offer immediate comments other than to say they would review the suit.\nMedical marijuana advocates have pushed for Kentucky to lift the ban, but those bills have been rejected by state lawmakers. The General Assembly did enact a measure in 2014 allowing limited prescription of cannabidiol — which can come from marijuana plants — to treat patients.\nIn a radio program earlier this year, Bevin acknowledged the \"value\" of medical marijuana. He said any push for its legalization would have to go through the legislature, and cautioned he would have to see the details of such a plan before passing judgment.\n\"I am not opposed to the idea of medical marijuana,\" the governor said then. \"If prescribed like other drugs, if administered in the same way that we would other pharmaceutical drugs, I think it would be appropriate in many respects.\"\nSeum became addicted to narcotics after taking OxyContin for chronic back pain, the suit said. He began using medical marijuana to deal with OxyContin withdrawal and to manage pain.\n\"I live in pain daily,\" Seum, the son of state Sen. Dan Seum, told reporters. \"Cannabis helps me deal with it.\"\nOnce he started using cannabis, no pain management doctors would treat him, the suit said.\n\"Mr. Seum is left with an impossible choice: Should he stop using cannabis and experience excruciating pain in order to explore the chance that another pain management option might be more effective?\" the suit said. \"Or should he continue using cannabis, preventing him from receiving medical care from Kentucky doctors for the rest of his life?\"\nThe other plaintiff is Danny Belcher. The Bath County man and Vietnam veteran has used medical marijuana to manage symptoms from post-traumatic stress disorder and spinal problems.\nUnder Kentucky law, the cultivation or possession of marijuana can result in jail time. Punishments are greater when caught with more than eight ounces.\nTwenty-nine states and the District of Columbia have authorized medical use of marijuana.",
    "source_domain": "abcnews.go.com",
    "title": "Lawsuit challenges Kentucky's medical marijuana ban",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/lawsuit-challenges-kentuckys-medical-marijuana-ban-48044761"
}