{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:24:49+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Las Vegas sportsbooks already taking big bets on Floyd Mayweather-Conor McGregor bout",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Flas-vegas-sportsbooks-taking-big-bets-floyd-mayweather%2Fstory%3Fid%3D48039287.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170501_box_mma_floyd_conor_in_own_words_sceu_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For a fight that may never take place, the potential blockbuster bout between Floyd Mayweather and Conor McGregor has already attracted thousands of dollars in bets at Las Vegas sportsbooks.\nIn mid-February, when hype about the fight intensified, the Westgate SuperBook made Mayweather a giant -2,500 favorite, with McGregor paying back 1,100.\nForty of the first 42 bets placed on the fight at the SuperBook were on McGregor, the largest a $1,500 wager at 800. Mayweather is now listed at -900, with McGregor 700.\nThe SuperBook has already taken more than $10,000 on the fight, which is by no means official. The book stipulates that the fight must be a boxing match and must take place by May 13, 2018, or all bets will be refunded.\n\"Most fights that are not official don't garner much handle until officially becoming announced,\" SuperBook assistant manager Jeff Sherman told ESPN in an email. \"I'm not surprised by the McGregor support, just that it has come without an official fight announcement.\"\nPromoter Oscar De La Hoya said Wednesday that he doubts the fight will happen.\n\"Will we see that fight? I strongly feel we won't,\" De La Hoya told CBS Sports.\nHowever, UFC president Dana White, during an April 9 appearance on \"Conan,\" said he thought the fight would happen.\nIt's not unusual for the betting public, which prefers to bet a little with a chance to win a lot, to gravitate toward a high-return underdog.\n\"We haven't taken a bet on the favorite,\" said longtime Las Vegas oddsmaker Jimmy Vaccaro of the South Point, one the few sportsbooks to have odds up on the fight. \"I'm rooting for it to happen. It's an event, and I think it will happen.\"\nStation Casinos opened betting on the fight on Monday, with Mayweather -1,300 and McGregor 800. Limits are currently $10,000.",
    "source_domain": "abcnews.go.com",
    "title": "Las Vegas sportsbooks already taking big bets on Floyd Mayweather-Conor McGregor bout",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/las-vegas-sportsbooks-taking-big-bets-floyd-mayweather/story?id=48039287"
}