{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 03:08:45+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Confederate statue toppled at NC rally as protesters descend on Trump Tower",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fconfederate-statue-toppled-north-carolina-rally%2Fstory%3Fid%3D49218570.json",
    "image_url": "http://a.abcnews.com/images/US/Confederate_Monument_Protest-AP-hb-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Activists and protesters who attended a rally Monday night to coax officials to remove a Confederate statue that's been moored in front of Durham, North Carolina's old courthouse since 1924 decided to do it themselves.\nThe toppled statue depicts a Confederate soldier wielding a muzzle rifle and lugging a canteen and bedroll. It is dedicated \"in memory of the boys who wore gray.\"\nAs Monday evening's demonstration went on, protesters surrounded the base of the erected soldier.\nVideo circulating online showcased the swelling protesters, many in chorus shouting: \"We, we are the revolution!\" followed by \"You can't stop the revolution.\"\nSome demonstrators held up handwritten, charged screeds on cardboard that read \"Stop Calling the Cops\" and \"Fight your Local Nazis,\" and one bluntly: \"F--- yo statue” as they closed in on the the cast metallic Confederate monument.\nSome protesters rested a ladder and looped a rope around the statue before yanking the soldier from its concrete perch.\nWhile dragged it to the ground, the angry demonstrators began stomping on the statue repeatedly, as seen on video footage captured by a reporter with ABC affiliate WTVD.\nThe Durham Police Department released a statement late Monday night regarding the incident.\n\"The Durham Police Department (DPD) is aware that a Confederate monument was toppled at the old Durham County courthouse. Because this incident occurred on county property, where county law enforcement officials were staffed, no arrests were made by DPD officers,\" the statement reads.\nGov. Roy Cooper quickly came out against the statue takedown on Monday night, tweeting: \"The racism and deadly violence in Charlottesville is unacceptable but there is a better way to remove these monuments #durham - RC\"\nThe racism and deadly violence in Charlottesville is unacceptable but there is a better way to remove these monuments #durham - RC — Governor Roy Cooper (@NC_Governor) August 15, 2017\nThe desecration of the Confederate soldier comes two days after a gathering of white nationalists in Charlottesville, Virginia turned into a melee that culminated in 20-year-old James Alex Fields allegedly plowing his car into a crowd of counter-protesters, killing one and injuring at least 19.\nProtests in New York\nSpencer Platt/Getty Images\nAmr Alfiky/Reuters\nIn New York Monday night, around 1,000 protesters descended on Trump Tower in midtown Manhattan to make a statement on the night the president arrived back in his hometown for a short stint. Some of the protesters formed a human wall, and others shouted messages like \"No hate\" or \"Impeach.\"\nNotably, an inflatable caricature of a Trump in the form of a rat was plotted nearby at The Plaza hotel.\nTrump came under fire over the weekend over his statement regarding the violence in Charlottesville. In remarks on the rally and subsequent clashes from his golf club in New Jersey on Saturday, he condemned the \"egregious display of hatred, bigotry and violence on many sides.\" Two days later, he condemned hate groups, including white supremacists, in remarks from the White House.\nThe president’s return to his New York penthouse comes during his \"working vacation,\" where he's been staying at his club in Bedminster, New Jersey. It's the first time the president has returned to Trump Tower since his inauguration.",
    "source_domain": "abcnews.go.com",
    "title": "Confederate statue toppled at North Carolina rally",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/confederate-statue-toppled-north-carolina-rally/story?id=49218570"
}