{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:04:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Officials: CIA chief meets Palestinian leader in West Bank",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fstate-solution-optional-palestinians-puzzled-us-view-45503722.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_fba1b4a47bee40e689eebb7c3555a5f9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Palestinian President Mahmoud Abbas met secretly with the CIA chief in the West Bank, Palestinian officials said Wednesday, as they expressed concern over the Trump administration's suggestion that a two-state solution to the conflict with Israel is optional.\nMike Pompeo and Abbas held talks Tuesday at the Palestinian government compound in the city of Ramallah, the first high-level contacts between the Palestinian leader and administration officials, said two senior officials who spoke on condition of anonymity because they were not authorized to speak to reporters about the meeting.\nThe White House and the CIA declined comment.\nOne of the Palestinian officials said Abbas briefed Pompeo on Palestinian positions ahead of Wednesday's White House talks between President Donald Trump and Israeli Prime Minister Benjamin Netanyahu.\nThe Palestinian leadership had previously expressed concern it would be sidelined by an administration seen as being closely aligned with Israel.\nThe Palestinians were given a new cause for concern when a White House official told reporters in Washington that the two-state solution — a cornerstone of American diplomacy for more than two decades — was not the only option for resolving the conflict.\nThe official said Tuesday that Trump is eager to begin facilitating a peace deal between the two sides and hopes to bring them together soon.\nBut the official, who was not authorized to speak publicly on the meeting beforehand, said it will be up to the Israelis and Palestinians to determine what peace will entail — and that peace, not a Palestinian state alongside Israel, is the goal.\nIt remains unclear if the comments signal a shift away from longstanding U.S. support for Palestinian statehood.\nThe Palestinians seek a state in the West Bank, Gaza Strip and east Jerusalem, areas captured by Israel in the 1967 Mideast War. The contours of a solution emerged in previous U.S.-led talks, including a border based on the 1967 lines that would include mutual land swaps to accommodate some of the larger Jewish settlements close to Israel. A final deal has remained elusive.\nSupport for a two-state solution was reaffirmed by representatives of dozens of countries, including the U.S., at an international conference in Paris last month, before Trump's inauguration.\nNetanyahu is under growing pressure from right-wing Cabinet ministers to abandon a two-state solution — an idea he publicly endorsed several years ago, albeit with reservations.\nCritics say that in any case, Israel's policy of settlement expansion on war-won land is making such a partition deal increasingly difficult.\nGilad Erdan, a Cabinet minister and member of Netanyahu's Likud Party, told Israel's Army Radio this week that \"all the Cabinet ministers oppose a Palestinian state, including Netanyahu.\"\nErdan added that Netanyahu should tread carefully in the meeting with Trump, saying \"we don't need to dictate a position to the president of the United States.\"\nFar-right Education Minister Naftali Bennett warned last week that \"the earth will shake\" if Trump and Netanyahu declare a commitment to a Palestinian state.\nPalestinian officials warned that the only other acceptable, but unlikely option would be a single state for Israelis and Palestinians, an idea opposed by a majority of Israelis and Palestinians.\n\"We believe undermining the two-state solution is not a joke, it is a disaster and tragedy for Palestinians and the Israelis and the whole region,\" said Saeb Erekat, the chief Palestinian negotiator.\nIt was not clear if the Trump White House had intended to declare a major policy shift during the hastily arranged briefing Tuesday night.\nState Department officials expressed surprise at the comments and said they were not aware of any policy shift on the desirability of a two-state solution.\nNetanyahu and Trump are to meet at the White House. They will hold a joint news conference before convening for meetings and a working lunch. The Israeli leader will then head to Capitol Hill for meetings with lawmakers on both sides of the aisle, including Senate Majority Leader Mitch McConnell, House Speaker Paul Ryan and Senate Minority Leader Chuck Schumer.\nTrump and Netanyahu are likely to discuss peace efforts, expanded Israeli settlements and Iran — as well as Trump's campaign pledge to move the U.S. Embassy in Israel from Tel Aviv to Jerusalem.\nThe embassy move would signal U.S. recognition of Jerusalem as Israel's capital, a move that would infuriate the Palestinians, who claim the eastern sector of the city as the capital of their future state.\n———\nAssociated Press writers Mohammed Daraghmeh in Ramallah, West Bank, Daniel Estrin in Jerusalem, and Vivian Salama and Deb Riechmann in Washington contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Officials: CIA chief meets Palestinian leader in West Bank",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/state-solution-optional-palestinians-puzzled-us-view-45503722"
}