{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:29:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Grammys switching to online voting, changes top album rule",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fgrammys-switching-online-voting-top-album-rule-48029443.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/ap-grammys-er-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Grammys Awards are transitioning to online voting and have updated rules for its top category, album of the year.\nThe Recording Academy announced new changes Wednesday, including its official switch to online voting for its 13,000 members. Voting for the 2018 Grammy Awards will take place in the fall and will include songs and albums released between Oct. 1, 2016, and Sept. 30, 2017.\nBill Freimuth, the academy's senior vice president of awards, said the academy expects to attract younger voters and touring musicians who are away from home during voting season.\n\"It is something that has been long-desired, long-talked about and long-investigated,\" he said of online voting, which comes a year after the Latin Grammys made the switch.\nFreimuth said there were concerns about security issues, but added they have \"done everything we can to make sure the integrity of the system will be preserved.\"\nAnother major change is the addition of songwriters to the nominees for album of the year, which was previously reserved for artists, producers and engineers. However, all participants in the album, including featured artists, songwriters, producers and engineers, must now be credited with at least 33 percent or more playing time on the album to be eligible for nomination. Prior to the new rule, all participants on an album would earn a nomination for album of the year even if they worked on one song.\nThe album of the year rule change would mainly affect pop, rap and contemporary R&B albums where producers typically vary throughout the project, as opposed to country and rock albums, where fewer producers are present.\nBeyonce's \"Lemonade,\" Drake's \"Views\" and Justin Bieber's \"Purpose\" — all nominees this year for album of the year — each had at least 20 producers credited. Adele's \"25,\" which won the top prize in February, had 11 producers. The fifth nominee was country singer Sturgill Simpson, who produced his album by himself.\n\"Does participation on a single track on a 12- or 15-track album really signify that they really worked on the album? When it was put that way most people were saying, 'No, not really,'\" Freimuth said.\nIf the new rule had been implemented at this year's show, Bruno Mars and Ryan Tedder wouldn't have earned Grammys for their production work on Adele's album, for example. Freimuth added that songwriters and producers who work on a big hit on an album could earn a nomination for record or song of the year for their song.\nThe new changes were approved last month by the Recording Academy's board of trustees. Other changes include nomination review committees added to the rap, contemporary instrumental and New Age genres. The committees serve as an additional layer of checks and balances, and for rap, could prevent wins like Macklemore & Ryan Lewis in 2014 over Kendrick Lamar, which were highly criticized. It could also allow rising acts to earn nominations over veteran performers like Eminem and Kanye West, who consistently earn nominations.\n\"We form these committees only when we hear from ... those genre communities (when) they feel like something's wrong, or that our nominations could be better,\" said Freimuth. \"For rap, what they were finding was that 'legacy' artists, almost no matter what they released, they would get a nomination because of their name recognition and fan base.\"\nThe rock, R&B and country genres are other genres that have nomination review committees.\nThe Grammy Awards have 83 categories. Nominees will be announced Nov. 28, and the 60th awards show will take place at Madison Square Garden in New York on Jan. 28, 2018.\n————\nOnline:\nhttps://www.grammy.com/",
    "source_domain": "abcnews.go.com",
    "title": "Grammys switching to online voting, changes top album rule",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/grammys-switching-online-voting-top-album-rule-48029443"
}