{
    "authors": [
        "Abc News",
        "Morgan Winsor",
        "More Morgan"
    ],
    "date_download": "2017-10-06 16:42:58+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Dozens of girls and young women in countries around the globe are proving you don’t need superpowers to fight for justice, equality and peace.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fgirls-girl-led-activists-changing-world%2Fstory%3Fid%3D50186933.json",
    "image_url": "http://a.abcnews.com/images/International/balinese-children-plastic-bags1-ht-mem-171003_1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dozens of girls and young women in countries around the globe are proving you don’t need superpowers to fight for justice, equality and peace.\nAfter traveling to 13 countries to visit 15 girl-led nonprofits, photojournalist Paola Gianturco has collected their stories in a new book, \"Wonder Girls: Changing Our World.\" The project features the stories of 90 young female activists transforming the world around them using their intelligence, determination, creativity, and dreams.\nBetween 2013 and 2016, Gianturco spent one week with each nonprofit while her 11-year-old co-author and granddaughter, Alex Sangster, interviewed them via FaceTime. Gianturco said she was \"dazzled\" by what she saw.\n\"Throughout my research, I felt as if I were watching Trojan horses. Most people don’t expect young girls to speak truth to power or to be strategic and effective. Their age works to their advantage; their creative approaches, stamina, and resilience catch people off guard and win them,\" Gianturco wrote in the book. \"Some people perceive them as 'the future.' But right now, they are enhancing education, health, equality and the environment — and stopping child marriage, domestic violence, trafficking, and war.\"\nMoreover, she said 100 percent of the author royalties from \"Wonder Girls\" go to the Global Fund for Women, which supports girl-led groups around the world.\nHere's a glimpse at some of the stories the girls shared with the book's authors.\nIndonesia\nTwo sisters from Bali are campaigning to get their island home to eliminate plastic bags.\nGrowing up in an area where plastic waste lines roadsides and engulfs beaches, Melati and Isabel Wijsen were aware of the negative impact of plastic. At the age of 12 and 10, respectively, the sisters were inspired to take action after learning about world leaders and activists in school, including Nelson Mandela and Martin Luther King Jr.\n\"I said to Isabel, 'Don't we want to be like them? Don't we want to do something to make the world better?'\" Melati Wijsen said. \"We sat here on this bench and made a list of problems in Bali ... For us, garbage was the biggest thing.\"\nPaola Gianturco\nPlastic waste in the Southeast Asian nation, which lies at the heart of the Coral Triangle, accounts for 10 percent of marine plastic pollution, according to findings in a 2015 study led by Jenna Jambeck, an environmental engineer at the University of Georgia.\nBali's residents and visitors alone dump 5,000 tons of solid garbage every day, of which up to 30 percent is plastic, according to the ROLE (Rivers, Oceans, Lands Ecology) Foundation, a nonprofit based in Nusa Dua, Bali.\nMelati and Isabel Wijsen decided to focus their efforts on eliminating the use of plastic bags in Bali. In 2013, the sisters started a nonprofit organization called Bye Bye Plastic Bags.\n\"Everybody uses plastic bags. People toss them from cars, put them in bins, and where do they go? Into rice fields, rivers, the ocean,\" Melati Wijsen said.\nThe sisters collected thousands of signatures in their bid to get the local government to support the initiative. But nearly two years passed and they were still unable to meet with Bali's governor, Mangku Pastika.\n\"We thought, 'This is it.' So we sent a letter saying that we were going on a hunger strike,\" Isabel Wijsen said, noting that they performed the strike only from sunrise to sunset, avoided doing too much activity and drank coconut water throughout the day.\nPaola Gianturco\nTwenty-four hours later, the girls received a phone call from the governor's office to set up a meeting in which he signed a memorandum of understanding to help Bali become free of plastic bags by January 2018.\n\"Today, we work with the government to make sure that they are keeping their promise,\" Isabel Wijsen said.\nNow, Melati and Isabel Wijsen have recruited a volunteer team of about 30 students from schools across Bali. They organize clean-ups of villages and beaches, ask shops to stop using plastic bags and encourage locals to use reusable ones. Alternatives include bags made from cotton or recycled newspaper, or even banana leaves.\nThe youth-driven initiative has taken the sisters around the world, to London to deliver a TED talk in 2015 and to New York to address the United Nations for World Oceans Day 2017 in June. The girls said they have even expanded the Bye Bye Plastic Bags team to Indonesia's capital city, Jakarta, and other countries around the globe, including Australia, Singapore, the Philippines, Myanmar, China, Mexico and the United States.\n\"We have a lot of kids spreading the word now,\" Melati Wijsen said. \"It's really cool.\"\nGrowing up in rural Malawi, Joyce Mkandawire and Faith Phiri know all too well the hurdles girls and young women face in pursuing an education. The southeastern African nation has one of the highest rates of child marriage in the world, with approximately one in every two girls are married by the age of 18, according to a 2016 report by the United Nations children's fund (UNICEF).\nA survey by Human Rights Watch, published in 2014, links the high prevalence of early marriages in Malawi to poverty, teenage pregnancy and lack of adequate education.\nSocietal pressures, customs, and sexual violence force girls to abandon their education, get married and have children. In some rural areas, the traditional practice \"kupimbira\" is used, in which poor families marry off their young daughters to settle debts or for financial gain, according to the Human Rights Watch survey.\nPhiri said it's even common for teachers in primary schools to abuse girl students. One in every five girls in Malawi are sexually abused by the time they turn 18, according to a 2015 study by UNICEF.\n\"Growing up in Kasungu, lots of girls were dropping out of school. There were pressures on me to drop out, and rape attempts at home and at school. But I survived,\" Phiri said. \"From that moment, I thought a lot about girls going through the same challenges, girls who had been abused and discouraged.\"\nPaola Gianturco\nMkandawire excelled in school and was accepted to a university, where she studied community development. She did housework in her aunt's house in return for the privilege of attending school. But Mkandawire got pregnant when she was 18 and could no longer do the work, forcing her to postpone the education she cared about so passionately.\n\"To me education was everything,\" Mkandawire said. \"I knew there was nothing I could do if I was not educated.\"\nMkandawire and Phiri met while working at a local non-governmental organization that was interviewing young girls for a UNICEF research project. Together, they heard stories about interrupted educations from teen pregnancies and child marriage that mirrored their own experiences. So they decided to do something about it.\nIn 2008, Mkandawire and Phiri launched a girl-led organization called the Girls Empowerment Network (GENET) that they hoped would empower girls to fight for their right to education and against practices that make education an almost-impossible dream.\nPaola Gianturco\nGENET members engage in discussions with village chiefs, traditional authorities, girls, parents, and grandparents. They work with civil society groups to organize marches, walks, radio programs and awareness campaigns. They even rescue girls from early marriages, making them GENET ambassadors and role models, like Alinafe, who had a baby and got married when she was 15.\nAlinafe, whose last name was withheld for privacy reasons, lives in the rural village of Chitera in southern Malawi's Chiradzulu district. She dropped out of school to live with her husband and care for their child. But the couple struggled to put food on the table.\n\"We had no food a lot of times because my husband was not working,\" Alinafe said.\nAlinafe was encouraged to join GENET's group in Chitera, which convinced her to move out of her marriage and return home so she could go back to school. She now lives with her mother, who takes care of her baby, Monica, when she's in class.\nAlinafe has never seen Malawi's capital city but she hopes to be an accountant there one day.\n\"I have big dreams for Monica. I want her to have all the resources she needs to go to school,\" she said. \"Every day, I work hard so she will not face what I faced.\"\nGENET won support from Malawian politician Patricia Kaliati, who fought hard as Minister of Gender, Children and Community Development to table a new marriage bill in parliament. The Marriage, Divorce and Family Relations bill passed unanimously in February 2015 and was signed into law that summer, raising the legal age of marriage in Malawi from 15 to 18 and imposing a 10-year prison sentence on men who marry girls younger than 18.\nEarlier this year, Malawi's parliament took another historic step and unanimously adopted an amendment aligning the constitution with the 2015 Marriage, Divorce and Family Relations Act. The move closed a loophole in the constitution that allowed girls as young as 15 to still marry with \"parental consent,\" according to Human Rights Watch.\nBut overcoming deeply rooted cultural beliefs and traditions, especially in remote, rural areas, remains a challenge. GENET continues to educate the public and the judiciary about the bill, hoping to get it translated into the indigenous language, Chichewa.\nUnited States\nAs an actress in her early 20s, Diane Luby Lane began performing classic poems throughout the city. She later connected with James Kass while in San Francisco, who is widely credited with helping launch the youth spoken-word movement.\n\"I saw young people doing spoken-word for the first time. Blew my mind,\" Lane said.\nShe realized the power spoken-word, also known as slam poetry, could have on teen literacy and social consciousness in a country where 14 percent of adults are considered illiterate, according to the 2003 National Assessment of Adult Literacy released by the National Center for Education Statistics.\nMoreover, California's fourth-graders ranked third from the bottom in a 2015 national reading test conducted by the National Center for Education Statistics.\nPaola Gianturco\nSo in 2006, Lane started a Los Angeles-based nonprofit organization called Get Lit aimed at using spoken-word poetry to increase literacy and stem dropout rates among teens growing up in impoverished neighborhoods. But getting local schools on board with her lesson plan was a challenge at first.\n\"The Walt Whitman Continuation School is right by my house. After many schools hung up on me, I called them. A woman said, 'Oh it would be such an honor to work with you; our kids feel like they know you already.' She thought I was the actress Diane Lane. I hung up and cried,\" Lane said. \"But I showed up and taught that class. It was a major success.\"\nWhat began as a one-woman show performed by Lane soon spiraled into lesson plans she taught in a handful of classrooms. Lane has since crafted a curriculum that meets Common Core standards and is currently taught by English and drama teachers in over 100 public high schools in California, reaching tens of thousands of youth each year.\nGet Lit participants learn classic poetry, choose a poem that resonates with them and then pen their own three-minute spoken-word responses, which they perform in tandem. According to the organization's website, 97 percent of teachers see a significant increase in attendance, engagement, and grades among their students after participation in Get Lit's \"core program.\"\nStudents can audition to join the \"Get Lit Players,\" an award-winning classic poetry troupe for teens ages 13 to 19, who perform annually for thousands of their peers. Nearly 100 percent of all Get Lit Players go on to college and almost 75 percent receive scholarships.\nPaola Gianturco\nOne of those poets is Rhiannon McGavin, who first got involved with Get Lit as a freshman in high school. In 2014, McGavin along with two other girl members of Get Lit recited their powerful slam poem \"Somewhere in America\" on \"The Queen Latifah Show.\" The teens addressed topics like race, discrimination, gun violence and sexual assault.\n\"Gladys Knight and Gloria Steinem were on the same show. That really hammered home the work that we are doing, not just with poetry but within our own communities and neighborhoods,\" McGavin said. \"It demonstrated to us the collective power of activism and feminism.\"\nMcGavin was later named the 2016-2017 Youth Poet Laureate of Los Angeles. She published a poetry book, \"Branches,\" in June.\n\"To be so young and to have so many opportunities, and to know that these opportunities are coming both because you work hard and because people love you and want to see you succeed is wondrous,\" McGavin said.",
    "source_domain": "abcnews.go.com",
    "title": "'Wonder Girls': How girl-led activists are changing the world",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/girls-girl-led-activists-changing-world/story?id=50186933"
}