{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-05-30 20:36:47+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The White House press briefing had an unexpected moment today.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fsarah-sanders-chokes-boy-questions-school-shootings-white%2Fstory%3Fid%3D55539013.json",
    "image_url": "https://s.abcnews.com/images/Politics/kid-reporter-wh-press-briefing-01-abc-jef-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sarah Sanders is known for her ability to face tough questions from the White House press corps, but when a student journalist questioned her at today's briefing about gun safety, she became visibly emotional.\nInterested in Gun Control? Add Gun Control as an interest to stay up to date on the latest Gun Control news, video, and analysis from ABC News. Add Interest\n\"We recently had a lockdown drill,\" the boy said from the back of the briefing room. \"One thing that affects my and other students' mental health is the worry about the fact that we or our friends could get shot at school.\n\"Specifically can you tell me what the administration has done and will do about these senseless tragedies?\" he asked.\nABC News\nSanders, who has three young children, started to reply, but choked up during her response.\n\"I think that as a kid and certainly as a parent, there is nothing that could be more terrifying for a kid to go to school and not feel safe so I'm sorry that you feel that way,\" Sanders said.\n\"This administration takes it seriously and the school safety commission that the president convened is meeting this week again -- an official meeting -- to discuss the best ways forward and how we can do every single thing within our power to protect kids in our schools and to make them feel safe and to make their parents feel good about dropping them off,\" she said.\nABC News\nThe young visitor was Benje Choucroun, a 13 year old who was at the White House on behalf of Time For Kids, the publication tweeted.\nThe briefing comes in the wake of a string of school shootings, including in Santa Fe, Texas and Parkland, Florida.\nABC News' Jordyn Phelps contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Sarah Sanders chokes up when boy questions her about school shootings at White House briefing",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/sarah-sanders-chokes-boy-questions-school-shootings-white/story?id=55539013"
}