{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 23:45:42+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Zinke, House GOP escalate feud with Patagonia over monuments",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fzinke-house-gop-face-criticism-patagonia-attacks-51724401.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/zinke-house-gop-face-criticism-patagonia-attacks-51724401",
    "language": "en",
    "localpath": null,
    "maintext": "Interior Secretary Ryan Zinke and House Republicans have escalated their feud with Patagonia after the outdoor retailer told Americans that President Donald Trump \"stole your land\" in his move to shrink two sprawling Utah national monuments.\nThe dispute pitting the GOP against a private company raised questions about use of taxpayer resources for political criticism and whether Republicans are trying to stop Patagonia sales weeks before the Christmas holiday.\nOn the day of Trump's announcement about the monuments, the California-based retailer replaced its usual home page last week with a black screen and stark message: \"The President Stole Your Land.\" Patagonia filed suit to block the planned reduction to Utah's Bears Ears National Monument.\nIn a tweet, the House Natural Resources Committee said Patagonia is \"lying\" and making the allegation about Trump's plan \"to sell more products to wealthy elitist urban dwellers from New York to San Francisco.\"\nThe Republican-led committee also sent out a widely distributed email with the subject line, \"Patagonia: don't buy it.\"\nA committee spokesman said Monday the email was not urging a boycott of Patagonia, but rather was telling consumers, \"Don't buy the lies\" about Trump's plan.\n\"We're just telling Patagonia: stop selling a false narrative,\" said Parish Braden, a spokesman for the committee.\nPatagonia's lawsuit, filed in conjunction with a rock climbing advocacy group and other organizations, is among a flurry of lawsuits that have been filed over Trump's move to reduce the size of Bears Ears by nearly 85 percent and cut in half the land protected in Utah's Grand Staircase-Escalante National Monument.\nThe company said it spent years supporting groups creating other national monuments and directly lobbied for protections at Bears Ears.\nZinke accused Patagonia of lying about Trump's actions and retweeted the committee post on his official account.\nIn response, former government ethics chief Walter Shaub launched a tweet storm, saying Zinke \"misused his official position by re-tweeting this wildly inappropriate tweet.\"\nShaub, who resigned in July as head of the Office of Government Ethics after repeated battles with the Trump administration, called Zinke \"the poster child for this lawless administration's misuse of governmental authority & resources.\"\nZinke's \"thuggish interference with a business is outside the scope of his duties, raising a question as to whether a sovereign immunity defense might fail\" if Patagonia sues him for libel or slander, Shaub said.\nThe committee may have violated House rules against advertising for or against a private individual, firm or corporation, Shaub said.\n\"The federal govt officially and publicly calling a company a liar for political reasons is a bizarre and dangerous departure from civic norms. It's also decidedly anti-free market,\" he tweeted.\nRep. Ruben Gallego, an Arizona Democrat who serves on the committee, said Republicans were spending taxpayer money to attack a private company that criticized Trump.\n\"Allowing them to get away with it is a dangerous precedent,\" Gallego said.\nCommittee Democrats, meanwhile, appeared to welcome the GOP feud with Patagonia, tweeting that it was resulting in \"greater awareness that our #publiclands are under attack.\"\nMore attacks from Zinke and other Republicans will only lead to more business for Patagonia, which equals \"an increased bottom line for a company that defends #MonumentsForAll,\" the Democrats said.\nThe confrontation could be paying off for Patagonia.\nTeresa Courage, a former Utah resident who now lives in New York, said on the company's Facebook page that she did all her Christmas shopping at Patagonia because of its politics.\n\"I love supporting a company that's going to go out on a limb and do that,\" she told The Associated Press. \"It speaks to me about its integrity. They're not just following the money.\"\n———\nAssociated Press writer Michelle Price in Salt Lake City contributed to this story.",
    "source_domain": "abcnews.go.com",
    "title": "Zinke, House GOP escalate feud with Patagonia over monuments",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/zinke-house-gop-face-criticism-patagonia-attacks-51724401"
}