{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 05:03:54+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fap-norc-poll-telemedicine-conducted-55552007.json",
    "image_url": "https://abcnews.go.com/Technology/wireStory/ap-norc-poll-telemedicine-conducted-55552007",
    "language": "en",
    "localpath": null,
    "maintext": "The Associated Press-NORC Center for Public Affairs Research poll on long-term care was conducted March 13-April 5 by NORC at the University of Chicago, with funding from the SCAN Foundation. It is based on online and telephone interviews of 1,845 adults, including 1,522 adults age 40 and over, who are members of NORC's nationally representative AmeriSpeak panel.\nThe AmeriSpeak panel includes respondents originally selected randomly from NORC's National Frame based on address-based sampling and recruited by mail, email, telephone and face-to-face interviews.\nNORC interviews participants over the phone if they don't have internet access. With a probability basis and coverage of people who can't access the internet, surveys using AmeriSpeak are nationally representative.\nInterviews with AmeriSpeak panelists were conducted in English and Spanish.\nAs is done routinely in surveys, results were weighted, or adjusted, to ensure that responses accurately reflect the population's makeup by factors such as age, sex, education, census region and race. In addition, the weighting took into account patterns of nonresponse among panel members selected for the survey.\nNo more than 1 time in 20 should chance variations in the sample cause the results to vary by more than plus or minus 3.3 percentage points from the answers that would be obtained if all adults in the U.S. were polled.\nThere are other sources of potential error in polls, including the wording and order of questions.\nThe questions and results are available at http://www.longtermcarepoll.org/.",
    "source_domain": "abcnews.go.com",
    "title": "How the AP-NORC poll on telemedicine was conducted",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Technology/wireStory/ap-norc-poll-telemedicine-conducted-55552007"
}