{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 08:46:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Gov't report: Health care deductibles higher under GOP bill",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fgovt-report-health-care-deductibles-higher-gop-bill-48050306.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_e433b98098ba46ef94819072522fe509_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump promised to make health care more affordable but a government report finds that out-of-pocket costs — deductibles and copayments — would average 61 percent higher under the House Republican bill.\nAnd even though the sticker price for premiums would be lower than under the Obama-era law, what consumers actually pay would edge up on average because government financial assistance would be curtailed.\nThe report from the Office of the Actuary, a nonpartisan economic unit at the Health and Human Services Department, was released earlier this week with little fanfare.\n\"It's fascinating,\" said Chris Sloan, a policy expert with the Avalere Health consulting firm. \"They actually think that on average people will be paying more even though the underlying premium is less.\"\nThe estimates are for the year 2026, and apply to people who buy their own health insurance policies. That group was a major focus of former President Barack Obama's Affordable Care Act. Individually-purchased coverage is also key to the GOP's American Health Care Act, which would roll back much of \"Obamacare.\"\nThe report tracks with findings by the Congressional Budget Office, which said millions more would be uninsured under the Republican legislation, in particular due to Medicaid cuts affecting low-income people. But at first blush the impact appears to be less dramatic. The budget office estimate of 23 million more uninsured in 2026 compares with 13 million projected by the experts at HHS.\nHowever, Sloan said much of the contrast appears due to a fairly technical issue: the two groups of experts make different assumptions about the number of people covered as a result of Obama's law.\nThe HHS report also finds that the Republican bill would shorten the life of the Medicare hospital trust fund by two years, partly because it repeals a tax on upper-income earners.\nIn a statement, the Trump administration said the new HHS estimate doesn't take into account other changes proposed by the president, including relief from burdensome regulations and additional health care legislation.\nWhile Trump celebrated passage of the House bill with a Rose Garden ceremony, lately he's told senators it's too \"mean,\" and he's urged lawmakers to spend more money on health care. Republican senators are trying to find a compromise that will let them advance their own version.\nThe HHS experts projected forward nearly a decade, estimating that sticker-price premiums would average $801 a month in 2026 if the Obama law stays in place.\nUnder the GOP bill, that gross monthly premium would drop to $695, or about 13 percent less.\nYet financial assistance would also be reduced under House bill, which provides government tax credits based on age, not income. After taking that and other changes into account, net premiums would average $380 under the GOP bill, a little bit more than the $360 a month consumers would pay under current law.\nThe GOP bill also would eliminate current subsidies that help reduce deductibles and copayments for people of modest incomes. And it would allow insurers to offer plans that cover fewer benefits, among other changes. Both those shifts lead to higher deductibles and copayments.\nWhen all that is factored in, the HHS estimate found that cost-sharing would average $380 a month, 61 percent more than the estimate of $236 under current law.\nIn a Washington Post interview shortly before taking office, Trump promised \"much lower deductibles.\"\n\"You can see promise of the lower premiums holding up,\" said Sloan. \"But there is nothing in this proposal that is going to lead to lower deductibles or lower cost-sharing. There is just nothing there.\"\nThe HHS report cautioned that averages don't tell the whole story. The impacts would vary widely by age, income, and where a consumer lives. And the cost-sharing average includes people who use their insurance a lot, and people who don't go to the doctor.\n———\nHHS Office of the Actuary report: https://tinyurl.com/ycc9cmvt",
    "source_domain": "abcnews.go.com",
    "title": "Gov't report: Health care deductibles higher under GOP bill",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/govt-report-health-care-deductibles-higher-gop-bill-48050306"
}