{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 10:29:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The owner of a gun range said Steve Stephens visited his business and was warned not to \"rapid fire\" his handgun.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fsuspect-facebook-killing-video-visited-gun-range-months-46857278.json",
    "image_url": "http://a.abcnews.com/images/US/170418_atm_facebook_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Suspect in Facebook killing video visited gun range months before deadly shooting More The owner of a gun range said Steve Stephens visited his business and was warned not to \"rapid fire\" his handgun. Coming up in the next {{countdown}} {{countdownlbl}} Coming up next: {{nextVideo.title}} {{nextVideo.description}} Skip to this video now Related More information on this video Enhanced full screen Explore related content Share your favorite moment HELP Related Extras Related Videos Video Transcript Transcript for Suspect in Facebook killing video visited gun range months before deadly shooting This transcript has been automatically generated and may not be 100% accurate. Now Playing: A big change to Facebook Live\nNow Playing: Suspect in Facebook killing video visited gun range months before deadly shooting\nNow Playing: US Supreme Court stops execution of Arkansas death row inmate\nNow Playing: A multi-state manhunt continues for the man who shot a senior citizen and posted the video live on Facebook\nNow Playing: New search warrants unsealed in the investigation into the death of Prince\nNow Playing: The 121st Boston Marathon included the first woman to officially run the race 50 years ago\nNow Playing: One dead after military chopper crashes in Maryland\nNow Playing: Houston couple complains they were booted from United flight\nNow Playing: Manhunt for Cleveland Facebook murder suspect expands to national search\nNow Playing: Colorado opens first drive-through marijuana shop\nNow Playing: Family of Cleveland Facebook murder victim 'beyond shocked'\nNow Playing: How state trooper, DNA helped catch Mass. jogger's alleged killer 8 months later\nNow Playing: Marine dad surprised with magical tea party photo shoot with 4-year-old daughter\nNow Playing: President Trump participates in 139th White House Easter Egg Roll\nNow Playing: Growing number of Americans are tolerant of marijuana use, poll finds\nNow Playing: Trump family hosts its 1st White House Easter Egg Roll\nNow Playing: Nebraska men get up close and personal with tornado\nNow Playing: Manhunt intensifies for Cleveland murder suspect as police vow to catch him\nNow Playing: Multi-state manhunt for Cleveland man suspected in killing in video uploaded to Facebook\nNow Playing: NBA playoffs get off to an emotional start with Celtics star's tribute to his late sister Now Playing: {{itm.title}}\n{\"id\":46857278,\"title\":\"Suspect in Facebook killing video visited gun range months before deadly shooting\",\"duration\":\"0:43\",\"description\":\"The owner of a gun range said Steve Stephens visited his business and was warned not to \\\"rapid fire\\\" his handgun. \",\"url\":\"/US/video/suspect-facebook-killing-video-visited-gun-range-months-46857278\",\"section\":\"US\",\"mediaType\":\"default\"}",
    "source_domain": "abcnews.go.com",
    "title": "Suspect in Facebook killing video visited gun range months before deadly shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/suspect-facebook-killing-video-visited-gun-range-months-46857278"
}