{
    "authors": [
        "Abc News",
        "More Jordyn"
    ],
    "date_download": "2018-05-30 15:59:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The first lady's conspicuous absence has become the source of some speculation, with the hashtag #whereismelania trending on Twitter.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Flady-melania-trump-medical-procedure%2Fstory%3Fid%3D55532056.json",
    "image_url": "https://s.abcnews.com/images/Politics/melania-trump-be-best-gty-thg-1805408_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "First Lady Melania Trump has not been seen in public since undergoing a medical procedure to treat what the White House has said was a \"benign kidney condition.\"\nInterested in Melania Trump? Add Melania Trump as an interest to stay up to date on the latest Melania Trump news, video, and analysis from ABC News. Add Interest\nWhile the first lady's conspicuous absence has become the source of some speculation, with the hashtag #whereismelania trending on Twitter, her communications director says the first lady is doing “really well” and is engaged on internal meetings.\n“She's doing really well,” communications director Stephanie Grisham tells ABC News in a statement. “She's been involved in several internal meetings with staff all last week, and that continues this week. We've been going over initiatives and other long-term planning for events such as the congressional picnic and 4th of July.”\nThe last time the first lady was seen in public was in the early morning hours of May 10, when she joined the president at Joint Base Andrews to greet the three Americans released from North Korea.\nSeveral days later, on May 14, the first lady underwent an embolization procedure involving her kidney at Walter Reed Medical Center. The public was informed of the procedure after its completion, which Grisham said was carried out successfully and without complication.\nThe first lady then returned home to the White House on May 19. During her stay at the hospital, the first lady tweeted her appreciation to the medical staff and offered thanks to the public for the well wishes she received.\nA sincere thank you to Walter Reed Medical Unit @WRBethesda & to all who have send good wishes & prayers! I am feeling great & look forward to getting back home @WhiteHouse soon. — Melania Trump (@FLOTUS) May 16, 2018\nThe first lady's office has not said when her next public event will be.\nDespite her focus on children's issues, she is not currently expected to attend a Sports and Fitness Day at the White House Wednesday that will seek to highlight the importance of youth sports participation.",
    "source_domain": "abcnews.go.com",
    "title": "First lady Melania Trump not seen since medical procedure",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/lady-melania-trump-medical-procedure/story?id=55532056"
}