{
    "authors": [
        "Abc News",
        "More Enjoli"
    ],
    "date_download": "2017-12-12 05:34:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Jayden Perez was given Giants game tickets and wanted to pay it forward.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fboy-collects-1000-toys-children-puerto-rico%2Fstory%3Fid%3D51722790.json",
    "image_url": "http://a.abcnews.com/images/US/jayden2-ht-mem-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This Christmas has been the season of giving, not getting, for an 8-year-old boy in New Jersey whose home has become a bit like Santa's workshop.\nOn Dec. 3, Jayden Perez, a third-grader in Woodland Park, New Jersey, held a toy drive at his home to collect toys for children in hurricane-ravaged Puerto Rico.\nHis mother, Ana Rosado, told ABC News today that in September, her boss had given Jayden, a New York Giants fan and football lover, one pretty epic gift: tickets to a Giants game. Rosado said it was a gift just because, not for Jayden's birthday or any special reason.\nOn video, she captured Jayden breaking down in tears of joy after being given the tickets.\nRosado said that also around that time, Hurricane Maria hit Puerto Rico. She and Jayden volunteered to help. The two collected donations and helped pack and ship them out. She said the two helped put together more than 40 boxes.\nAna Rosado\nAfter Thanksgiving, Rosado said Jayden came to her with his own, new idea: He'd been blessed with Giants tickets so he wanted to pay it forward to the children of Puerto Rico.\n\"He said, 'Mom, I'm concerned kids aren't going to get toys,'\" she said. \"That really touched me.\"\nJayden told her that he wanted to donate his Christmas gifts to the children but Rosado took it a step further: have a toy drive.\n4-Year-Old fighting brain cancer holds toy drive for friends still in hospital\nTeen cancer survivor delivers art kits to young patients in the hospital\nRosado posted the event on social media and word spread with help from local media outlets.\nShe said that so far, the drive had netted more than 1,000 toys but that there were more toys coming this week. Rosado said a man had even reached out to her from Pennsylvania, saying he had a trailer of toys that had been donated from his community.\nAna Rosado\n\"I'm so overwhelmed,\" Rosado said. \"I'm so proud of my son. ... I didn't expect so many toys.\"\nShe said that a shipping company was also helping them to get the toys to Puerto Rico. Initially, Rosado said, two of her friends had planned to fly to the island to help distribute the toys. But, she said today, she and Jayden would now be going Jan. 4 to celebrate Three Kings' Day.\nIt will be his first trip to the island, she said.\nRosado said they planned to bring some toys to an orphanage that had reached out to her for help and then they'd travel Jan. 5 and Jan. 6 to several small cities that had been hit hard by Maria.\nSo far, Jayden has more than 30 boxes of toys packed up and ready to be shipped.\n\"He has such a great heart,\" Rosado said. \"I know that my son is doing good out there.\"",
    "source_domain": "abcnews.go.com",
    "title": "Boy, 8, collects more than 1,000 toys for children of Puerto Rico",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/boy-collects-1000-toys-children-puerto-rico/story?id=51722790"
}