{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 08:02:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Boomer Sooner: Dalke looking for US Open success",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fboomer-sooner-dalke-us-open-success-48049900.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_c3c1ee205cf5428d9211076777d913d6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Brad Dalke's heart is right there, emblazoned in big red letters on the side of his golf bag. He carries it with him on his scorecard in his back pocket.\nBoomer Sooner, practically since the day he was born.\nFresh off his clinching win for Oklahoma in last month's NCAA final, Dalke is playing in his first U.S. Open this week at Erin Hills. He is using his bag and scorecard from his sophomore season with the Sooners, proudly displaying a connection to his beloved school that runs deep into his family tree.\n\"With my whole family, I was just growing up being a Sooner. I just always wanted to play for OU,\" Dalke said, \"and I'm just living a dream playing there.\"\nDalke's grandfather Ken Pryor played basketball and baseball for Oklahoma and made the winning shot against Texas in the national basketball semifinals in 1947. His mother, Kay, played on the Sooners' first intercollegiate women's golf team. His father, Bill, was a linebacker on Barry Switzer's first national championship team at the school in 1975.\nFor Brad Dalke, the youngest of seven siblings, there was never any doubt. At age 11, he started sending emails to Oklahoma golf coach Ryan Hybl about wanting to play for the Sooners. Hybl wasn't allowed to respond, but Dalke kept sending him emails.\nHybl eventually came out to watch Dalke play a few times. Dalke took an unofficial visit, Hybl offered him a spot and Dalke committed — when he was just 12 years old.\n\"You could just see, there's just certain kids that just have the 'it' factor,\" Hybl said Wednesday in a phone interview.\n\"He was already a big kid so I already knew kind of what his body was going to somewhat look like,\" Hybl continued. \"He had already kind of matured into his body as a 12-year-old. His game was big-time then, and of course, we were taking a chance, but he was, too.\"\nIt already has worked out quite well for everyone involved. Dalke's 2-and-1 win against Oregon's Sulman Raza on May 31 wrapped up Oklahoma's second NCAA golf championship.\n\"To be able to make that last putt, it's cool. It's a memory I'll always have,\" Dalke said.\nHe is hoping for more big putts this week in his second major. Dalke lost to Curtis Luck 6 and 4 in the U.S. Amateur final last summer, but the runner-up finish got him a spot in the Masters and U.S. Open.\nThe 19-year-old Dalke, who played Augusta National with his dad in 2014, missed the cut at the Masters, but he thinks the experience will help him at Erin Hills.\n\"This week, I kind of know what to expect, just off the course, you know, getting registered, getting practice rounds with some of the pros out here, stuff like that,\" he said. \"I'm a little more comfortable with that. But it's still the U.S. Open. It's still a huge tournament and I'm just excited to be out here, excited to compete with these guys and I think I can do well.\"\nDalke already has one major win against one of the top golfers in the world.\nDalke was at a prestigious junior tournament two years ago when a friend encouraged him to challenge Rory McIlroy to an arm-wrestling match. McIlroy, who was No. 1 at the time, was a special guest at a Nike event at Sage Valley in South Carolina.\nDalke was sure McIlroy would turn him down. But McIlroy accepted and Dalke won.\n\"He's a great guy,\" said Dalke, who talked to McIlroy about the arm-wrestling match at the Masters, and saw him again last weekend at Erin Hills. \"He's awesome. A lot of these guys out here are really good guys, and he is, he's one of them.\"\n———\nJay Cohen can be reached at http://www.twitter.com/jcohenap",
    "source_domain": "abcnews.go.com",
    "title": "Boomer Sooner: Dalke looking for US Open success",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/boomer-sooner-dalke-us-open-success-48049900"
}