{
    "authors": [
        "Abc News",
        "More Jeffrey"
    ],
    "date_download": "2018-04-24 21:03:18+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The reality TV star is pushing for stronger regulation of cosmetic products.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fkourtney-kardashian-arrives-capitol-hill-clean-cosmetics%2Fstory%3Fid%3D54691855.json",
    "image_url": "https://s.abcnews.com/images/Politics/kourtney-kardashian-congress-2-ap-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Reality TV star Kourtney Kardashian arrived on Capitol Hill in Washington, D.C., Tuesday morning to make a push for safer personal care products.\nKardashian is holding meetings with lawmakers, aides and reporters on Tuesday to express her support for legislation that would give the U.S. Food and Drug Administration the power to investigate and prevent the sales of dangerous cosmetics. The proposed legislation is expected to suggest that facilities be registered to the FDA and could be subject to suspension if they distribute such harmful personal care products.\nJ. Scott Applewhite/AP\nKardashian's interest in promoting safer, nontoxic cosmetics grew after the birth of her first child in 2009, she told Capitol Hill reporters Tuesday morning.\n\"It all kind of snowballed,\" she described. Research prompted by her mother's friends led her to the Environmental Working Group, whose representatives have accompanied Kardashian during much of her visit to Washington.\n\"It would be nice if we didn't have to guess as much,\" she said. \"If there were regulations to know that the products that we're using are safe.\"\nFollowing a morning press event with the Environmental Working Group, the \"Keeping Up With the Kardashians\" co-star was set to hold a closed briefing with Congressional aides at 4 p.m.\nLawmakers including Sen. Dianne Feinstein, D-Calif., Sen. Susan Collins, R-Maine, Rep. Frank Pallone, D-N.J. and Rep. Leonard Lance, R-N.J. banged the cosmetics safety drum during the last Congress, but the bills never reached a vote.\nA congressional aide told ABC News House and Senate bills are being worked on, but the timeline is unclear.",
    "source_domain": "abcnews.go.com",
    "title": "Kourtney Kardashian arrives on Capitol Hill to clean up cosmetics",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/kourtney-kardashian-arrives-capitol-hill-clean-cosmetics/story?id=54691855"
}