{
    "authors": [
        "Abc News",
        "More Lena"
    ],
    "date_download": "2018-04-24 18:01:58+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The first statue of a woman in London’s Parliament Square was unveiled today.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2F1st-statue-woman-londons-parliament-square-unveiled%2Fstory%3Fid%3D54691069.json",
    "image_url": "https://s.abcnews.com/images/International/millicent-fawcett-statue-11-gty-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The first statue of a woman in London’s Parliament Square was unveiled today.\nInterested in London? Add London as an interest to stay up to date on the latest London news, video, and analysis from ABC News. Add Interest\nMillicent Fawcett, a leading suffragist who played a key role in securing women older than 30 the right to vote in 1918, was commemorated outside the British Parliament, which is already home to 11 statues of men, including Mahatma Gandhi, Nelson Mandela and Winston Churchill.\nAdrian Dennis/AFP/Getty Images\nBritish Prime Minister Theresa May, who took part in the ceremony, tweeted before the unveiling that she would not be where she is today if not for Fawcett, a feminist and union leader who died in 1929.\n“I would not be here today as PM, no female MPs would have taken their seats in Parliament, none of us would have the rights and protections we now enjoy, were it not for Millicent Fawcett,” she wrote.\nBen Stansall/AFP/Getty Images\nOther female British MPs also tweeted in celebration of the new statue.\nCourage calls to courage everywhere. The unveiling of the first statue of a woman in Parliament Square - first statue by a woman in Parliament Square. A beautiful statue. An incredible woman. For all women. For everyone. #MillicentFawcett pic.twitter.com/HEOiaLc09P — Yvette Cooper (@YvetteCooperMP) 24. april 2018\nThe bronze version of the women’s rights campaigner holds a banner with the words “Courage calls to courage everywhere,” a line from one of her speeches.\nThe statue was created by Gillian Wearing, the first female artist to have a sculpture placed on Parliament Square.\nDan Kitwood/Getty Images\nLondon Mayor Sadiq Khan, who also participated in the event, called it “inspiring” to stand with women who have worked for gender equality.\n“I want London to be a beacon for women’s rights and equality,” he said.\nInspiring to stand with so many women who have worked tirelessly for gender equality. I want London to be a beacon for women’s rights and equality. #BehindEveryGreatCity#MillicentFawcett. pic.twitter.com/5GvOP9I5Lu — Sadiq Khan (@SadiqKhan) 24. april 2018\nIn 1897, Fawcett became the president of the National Union of Women's Suffrage Societies, a group of women’s suffrage societies in the U.K.\nShe remained the president of the group for more than 20 years.",
    "source_domain": "abcnews.go.com",
    "title": "1st statue of woman on London's Parliament Square unveiled",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/1st-statue-woman-londons-parliament-square-unveiled/story?id=54691069"
}