{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:02:11+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "US added strong 200K jobs in January; pay up most in 8 years",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-added-200k-jobs-january-pay-years-52791573.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_ac104bdc74f747bd83dbe430882195cc_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Jobs Report? Add Jobs Report as an interest to stay up to date on the latest Jobs Report news, video, and analysis from ABC News. Add Interest\nPay raises, the U.S. economy's Achilles' heel in its long recovery from the Great Recession, finally showed signs of accelerating last month — a trend that fanned inflation fears and sent bond yields rising and stocks sinking.\nWages grew in January from a year ago at the fastest pace in eight years, evidence that low unemployment is forcing some employers to pay more to keep or attract workers. The question is whether the gains will endure and spread throughout the economy.\nU.S. employers added a robust 200,000 jobs in January, and the unemployment rate stayed at a low 4.1 percent for the fourth straight month, the Labor Department said Friday. But investors saw the wage growth as cause for concern. Higher pay could help swell inflation and spur the Federal Reserve to quicken its pace of interest rate increases in coming months.\nThe 10-year Treasury note rose to 2.83 percent, from 2.79 percent before the jobs report was released. And the Dow Jones industrial average tumbled 666 points, or 2.5 percent, partly on the prospect of sharply higher rates and partly on poor earnings reports from Google's parent company Alphabet, Exxon Mobil and Chevron.\n\"Everyone has been rooting for wage growth, but be careful what you wish for,\" said Josh Wright, chief economist at recruiting software company iCIMS.\nStill, the jobs data point to an economy on solid footing, fueled by strong consumer spending and global growth. After nearly eight years of steady hiring, employers are increasingly competing for a narrower pool of workers. Raises stemming from Republican tax cuts and minimum wage increases in 18 states also likely boosted pay last month.\n\"Labor is becoming scarce, and employers have to work to find, retain and train employees,\" Diane Swonk, chief economist at Grant Thornton, said. \"This is new for many employers.\"\nMany economists credit the Fed's low-rate policies, including the measured pace of rate increases under Chair Janet Yellen, with stimulating enough growth to bolster hiring and wages. Yellen will be succeeded as Fed chair on Monday by Jerome Powell, a former investment banker and Fed governor.\nIn January, average hourly pay rose 9 cents to $26.74, up 2.9 percent from a year earlier — the biggest gain since the recession ended eight years ago.\nS.B. Cha, CEO of Kinestral, a company that makes high-tech windows that can be dimmed to reduce or block sunlight, said he has had to offer higher pay to attract new electrical and software engineers. Cha has ambitious plans to double his 130-person staff within two years.\nBut it's difficult to find enough workers in San Francisco, where the company is based, so he transferred its cloud computing operations to Salt Lake City. Yet now even Salt Lake City is becoming competitive. As a small company, Kinestral used to pay roughly 60 percent of what tech giants like Google paid. Now, Cha says, it has to pay closer to 80 percent and in some cases 90 percent.\n\"Every year, hiring gets tougher and tougher,\" Cha said.\nAverage hourly pay jumped 3.4 percent in the past year in transportation and warehousing, which has benefited from the explosive growth of e-commerce. That's partly been driven by the online giant Amazon, which went on a hiring rampage last year, expanding its workforce by a breathtaking 66 percent — 225,000 jobs. That's more than the entire manufacturing industry added last year.\nStill, factories enjoyed a good year and raised pay an average 3.3 percent. Leisure and hospitality firms, which include restaurants and hotels, increased pay 3.5 percent.\nRestaurant cooks received the largest salary increase in the past year among the 84 occupations the company tracks, according to pay data compiled by Glassdoor, a job listing website.\nWith Americans more confident and spending more, restaurants are adding jobs and lifting wages. The industry added 31,000 jobs last month.\n\"We are finally seeing signs of a 'feel good' economy emerging with consumers able to kick up their heels again,\" Swonk said.\nA measure of hourly wages that excludes managers rose 2.4 percent over the past year, more slowly than the broader figure. That suggests that managers and supervisors have received the biggest benefits.\nMichael Feroli, an economist at JPMorgan Chase, notes that very cold weather could have temporarily boosted pay last month. Frontline construction workers might have stayed home during the cold spell, cutting into their pay, while salaried supervisors would have been paid either way.\nBut most economists think wage gains will keep rising. Walmart said in January that it would raise its minimum wage to $11 an hour, from $10, starting this month.\nCathy Barrera, chief economist at ZipRecruiter, said the low unemployment rate is bestowing other benefits on workers. Employers are hiring more people on a permanent full-time basis.\nThe number of part-time workers who would prefer full-time jobs has fallen nearly 15 percent in the past year. And temporary hiring has been flat for two months.\nJennifer Fitzgerald, CEO of PolicyGenius, an online insurance marketplace, is so desperate for workers that her New York City-based company is buying advertising on the New York subway and on San Francisco commuter trains.\nThe ads are intended in part to raise awareness among potential recruits. PolicyGenius recruiters also look for companies that are moving out of New York, or who have laid off workers and scour LinkedIn for potential hires from those companies.\n\"These are the kinds of creative strategies you need,\" Fitzgerald said.",
    "source_domain": "abcnews.go.com",
    "title": "Big pay gains for US workers contribute to Wall St. sell-off",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-added-200k-jobs-january-pay-years-52791573"
}