{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 07:46:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "'Dancing with the Stars' recap: Normani Kordei brings the magic on Disney Night",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fdancing-stars-recap-normani-brings-magic-disney-night%2Fstory%3Fid%3D46855412.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/ABC-Erika-Jayne-Gleb-Savchenko-DWTS-ml-170228_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Disney Night kicked off week five of \"Dancing with the Stars\" in spectacular fashion Monday with appearances by cherished Disney characters Mickey and Minnie Mouse, Donald Duck and Pluto who joined the ensemble for a splashy opening number led by \"DWTS\" Season 19 champion Alfonso Ribeiro.\nThe men were dressed as princes and the ladies were dressed as princesses, with Simone Biles in costume as Moana and Normani Kordei in costume as Mulan, foreshadowing their routines later in the night.\nFifth Harmony stunner Kordei continued to heat up the dance floor with partner Valentin Chmerkovskiy in a paso doble to \"I'll Make a Man Out of You\" which featured a special live performance from the ageless teen heartthrob and \"DWTS\" Season 9 winner, Donny Osmond.\nThe judges were rhapsodic about the performance, with Bruno Tonioli calling Kordei an \"all-conquering paso princess!\" She earned the highest score of the night, 39 out of 40, with perfect tens all around but for judge Len Goodman, who gave her a nine.\nShockingly, it was announced earlier that Kordei was in jeopardy based on combined judges and last week's viewer scores, though following her exhilarating performance it was revealed she was safe.\nBonner Bolton impressed the judges with his tango to \"When Can I See You Again?\" from \"Wreck-It Ralph,\" but pulled the night's lowest score with a 29.\nStill, it was down to Nick \"The Bachelor\" Viall and Real Housewives of Beverly Hills star Erika Jayne, both in jeopardy and up for elimination at the end of the night. In spite of the fact that each turned in strong performances – notably the newly clean-shaven Viall, with his jazz turn to \"I've Got No Strings\" from Pinocchio – it was Erika Jayne who was sent home.\nJayne was gracious and smiled as she thanked everyone and said she had a wonderful time.\nNext week's show will feature the return of Maksim Chmerkovskiy and will feature team dances with a theme of Boy Bands vs. Girl Groups.\nMonday night's standout moment: While Kordei owned the night, Simone Biles turned in a bewitching contemporary dance with partner Sasha Farber as the character Moana. The Olympic champion was radiant and moved flawlessly, accompanied by a live performance of \"How Far I'll Go\" performed by the voice of the character, Auli‘i Cravalho.\nMonday night's high scorers: Normani Kordei and Val Chmerkovskiy – (in jeopardy/safe) 39\nSimone Biles and Sasha Farber – (Safe) 38\nNancy Kerrigan and Artem Chigvintsev – (Safe) 36\nJudges' Scores: Rashad Jennings and Emma Slater – (Safe) 32 out of 40\nNick Viall and Peta Murgatroyd – (in jeopardy) 34\nErika Jayne and Gleb Savchenko – (in jeopardy) 32 Voted Off\nHeather Morris and Alan Bersten, filling in for Maksim Chmerkovskiy – (Safe) 34\nBonner Bolton and Sharna Burgess – (Safe) 30\nNormani Kordei and Val Chmerkovskiy – (in jeopardy) 39\nDavid Ross and Lindsay Arnold – (Safe) 29\nNancy Kerrigan and Artem Chigvintsev – (Safe) 36\nSimone Biles and Sasha Farber – (Safe) 38\nDancing with the Stars returns next Monday on ABC.",
    "source_domain": "abcnews.go.com",
    "title": "'Dancing with the Stars' recap: Normani Kordei brings the magic on Disney Night",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/dancing-stars-recap-normani-brings-magic-disney-night/story?id=46855412"
}