{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:34:46+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "No joke: 'Trainwreck' filmmaker wants to be top banana",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fjoke-trainwreck-filmmaker-top-banana-51719071.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_364f3b4f1ae144769a5c8e60a0448156_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Did you hear the one about the hugely successful Hollywood producer who subjected himself to the uncertainties and meager pay of stand-up comedy?\nNo punchline follows for Judd Apatow, just the chance to reconnect with a youthful dream of excelling at one of entertainment's riskiest ventures: Revealing yourself to an audience and praying for laughs, not flop sweat. The result is \"Judd Apatow: The Return,\" a Netflix special debuting Tuesday in which Apatow seeks to prove his chops as a comedian.\n\"When I was a kid, stand-up was all I wanted to do. Everything else was a weird offshoot of my desire to do stand-up,\" he said. A growing demand for his comedy writing services got in the way, along with a frank self-evaluation.\n\"I thought there were people who seemed much better at it (stand-up) than me, and I didn't want to be in the middle of the pack,\" he said. \"I was able to write jokes for Roseanne, for Jim Carrey, and I noticed they performed them better than me.\"\nInstead, he joined his writing skills with directing and producing, racking up impressive credits on TV (\"The Larry Sanders Show,\" ''Freaks and Geeks\") and on the big screen with movies (\"The 40-Year-Old Virgin,\" ''Knocked Up\") that defined the turn-of-the century's ribald comedy zeitgeist. In middle age, he's gained the confidence and, of course, the clout to show what he can do onstage.\n\"I'm now older, I have stories to tell and more opinions. And it's fun to do when I don't need it to pay more rent,\" Apatow said. \"You don't get paid when you do stand-up.\"\nIn the special, the comfortably low-key Apatow cracks wise about marriage, fatherhood and mortality. The comic patter usually hits its targets — which include sexual misconduct, although the show was taped last summer before the Harvey Weinstein scandal and its immense fallout. It's Bill Cosby in the TV hot seat, but Apatow has already proven a vocal critic of the new crop of the accused.\nAnother, less-fraught theme: How technology is changing child-rearing so fast that parents are scrambling to figure out whether it's healthy for youngsters to spend much of their lives online. \"We're all in a wide-eyed panic because there's no information about whether this is helpful and potentially essential for the modern kid or making them unable to read a book,\" he said.\nHis daughters, Maude, who is 20 this month, and Iris, 15, were sanguine about giving Apatow some of the material that he's been honing in club appearances.\n\"They've come and seen me perform over the last two years, so they know all the jokes. ... Iris will always point out that I say the same thing every time. I then say, 'Taylor Swift sings the same songs every time. What do you think we do, write a new act every night?'\"\nHe offered to let his offspring preview the Netflix special and veto anything that made them uncomfortable. \"They both said, 'I don't need to see it,'\" he said, adding in a knowing dad voice: \"Which was not trust, but lack of interest.\"\nThe family provides more than fodder for jokes. Leslie Mann, his actress-wife, was a catalyst for how he approaches his work, including collaborations with bold female voices Lena Dunham (\"Girls\") and Amy Schumer (\"Trainwreck\").\n\"My wife is a very talented and strong woman who taught me early on that there's something unfair happening in our business,\" Apatow said. \"She read a stack of scripts and almost every one of them was about men, and all the female parts were getting guys from A to B.\"\nHis creative decisions are based on talent, not gender, said Apatow (who has made a point of condemning entertainment industry sexual misconduct).\n\"I rarely think about whether it's a man or a woman. I love people who have a great story to tell,\" he said.\nApatow is behind the scenes on a fictional series about the comedy world, star-creator Pete Holmes' \"Crashing,\" which returns for a new season on HBO in January. He's also got a documentary about musical duo Scott and Seth Avett coming next month on HBO, \"May It Last: A Portrait of the Avett Brothers.\"\nAs Apatow sees it, stand-up bolsters his other work.\n\"There's something very enjoyable about having an idea in the morning, trying it out that evening and having the direct conversation with the audience. It's really all I ever wanted to do, and I think it makes my writing for film and television better,\" he said.\n———\nLynn Elber can be reached at lelber@ap.org and on Twitter at http://twitter.com/lynnelber .",
    "source_domain": "abcnews.go.com",
    "title": "No joke: 'Trainwreck' filmmaker wants to be top banana",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/joke-trainwreck-filmmaker-top-banana-51719071"
}