{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 09:45:48+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "17 Still Missing After Indonesia Boat Fire Kills 23",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2F17-missing-indonesia-boat-fire-kills-23-44508400.json",
    "image_url": "http://abcnews.go.com/International/wireStory/17-missing-indonesia-boat-fire-kills-23-44508400",
    "language": "en",
    "localpath": null,
    "maintext": "A search resumed Monday for 17 people reported missing after a ferry fire off the coast of Indonesia's capital that left at least 23 dead, officials said.\nThe victims died Sunday when the vessel, Zahro Express, carrying more than 260 people from a port near Jakarta to Tidung, a resort island in the Kepulauan Seribu chain, caught fire, officials said. Most of the passengers were Indonesians celebrating the New Year holiday, according to local media reports.\nDito, an official from the Jakarta Search and Rescue Agency, said at least five ships and a number of speedboats and rubber boats were deployed in the search.\nOf the 224 passengers who were rescued, 32 were being treated at three hospitals, said Dito, who uses a single name.\nSeply Madreta, an official from the Jakarta Disaster Mitigation Agency, said the fire gutted about half the vessel, and that 23 bodies had been recovered.\nTwenty bodies that were found inside the vessel were burned beyond recognition and were transferred to a police hospital for identification, said Col. Umar Shahab of the Jakarta police health department.\nWitnesses told MetroTV that the fire broke out about 15 minutes after the ferry left the port of Muara Angke.\nThe cause of the fire was not immediately clear. Some passengers told local media that they first saw smoke coming from the ferry's engine.\nThe director for sea transportation, Tonny Budiono, said the initial suspicion was that the fire was \"most probably caused by a short circuit in the engine room.\"\nHe told a news conference the short circuit might have led to the fuel tank exploding.\nTV footage showed people in the water with the ferry in flames in the background. A woman in the water can be heard screaming \"Ya Allah! Ya Allah!\" or \"Oh God! Oh God!\"\nAnother woman told the TV station that she and other passengers were rescued by a small boat.\nDespite the high number of people who were rescued, the ferry's manifest showed that only 100 were registered as passengers, along with six crewmen, said Denny Wahyu Haryanto, head of the Jakarta Disaster Mitigation Agency. He said the vessel's captain was under police investigation over the incident.\nFerry accidents are common in Indonesia, the world's largest archipelagic nation, with more than 17,000 islands. Many accidents are blamed on lax regulation of boat services.",
    "source_domain": "abcnews.go.com",
    "title": "17 Still Missing After Indonesia Boat Fire Kills 23",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/17-missing-indonesia-boat-fire-kills-23-44508400"
}