{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 05:06:57+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fchina-factory-activity-rises-month-high-upbeat-sign-55551468.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_bc16ef900ea3406696e1d408e3f82a69_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chinese factory activity grew at its fastest rate in eight months on stronger demand, a survey showed Thursday, in a positive sign for the world's No. 2 economy despite trade tensions with the U.S.\nThe official purchasing managers' index rose to 51.9 in May from 51.4 the previous month. Readings above 50 indicate expansion, while lower numbers indicate contraction on the index's 100-point scale.\nProduction, new export orders and overall new orders all increased from the previous month, indicating an uptick in demand, the China Federation of Logistics & Purchasing's survey found.\n\"The pace of manufacturing expansion has accelerated and development momentum has been further strengthened,\" said Zhao Qinghe, senior statistician at the National Bureau of Statistics, which released the data on its website .\nThe latest figures show China's outsized export-manufacturing sector remains resilient despite continued tensions with the U.S. over the trading relationship between the world's two biggest economies.\nThe tensions had been ebbing until earlier this week, when President Donald Trump's administration renewed its threat to slap $50 billion worth of tariffs on Chinese goods and said it would also limit U.S. exports of high-tech goods to China. It's part of U.S. efforts to contain China's state-directed efforts to transform itself into a tech superpower.\nBut despite Washington's efforts, activity expanded in May, according to the survey's high-tech manufacturing sub-index, which rose in May to 54.8, up 1 point from the previous month.\nThe tariff threat came ahead of U.S. Commerce Department Secretary Wilbur Ross's visit to Beijing on Saturday for further negotiations on economic and trade issues.\nActivity in China's increasingly important services sector also expanded. The group's non-manufacturing PMI rose to 54.9 for the month from 54.8 previously.\nChina's services industry is playing a bigger role as communist leaders upgrade economic growth, shifting it from a worn-out model based on wasteful trade and investment to one focused on domestic spending.",
    "source_domain": "abcnews.go.com",
    "title": "China factory activity rises to 8-month high in upbeat sign",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/china-factory-activity-rises-month-high-upbeat-sign-55551468"
}