{
    "authors": [
        "Abc News",
        "More John"
    ],
    "date_download": "2018-03-20 09:04:15+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Over $100 million has been spent by both parties ahead of Tuesday's election.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ffamous-names-face-off-historically-expensive-illinois-gov%2Fstory%3Fid%3D53850164.json",
    "image_url": "https://s.abcnews.com/images/Politics/rauner-pritzker-nc-ap-mem-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In a high stakes and multi-million dollar gambit, a son of Robert F. Kennedy taking is on the heir to the Hyatt hotel fortune, and an incumbent governor is pouring millions of his own money into his effort to hold on to the top job in a blue state.\nWith over $160 million spent by both parties, the bitter and expensive Democratic and Republican primaries to move on to the general election in November have tested the boundaries of money and name recognition in the lead up to the 2018 midterm elections.\nAlex Wong/Getty Images\nIncumbent Gov. Bruce Rauner has taken heat from both the left and right during his tenure, and despite pouring over $50 million of his own money into his re-election bid is facing an energetic primary challenge from conservative State Rep. Jeanne Ives.\nRauner has been hindered by a budget crisis during his first term, and last week vetoed a bill passed by the Democratic-controlled state legislature that would have required all gun dealers in the state to obtain a license, a move critics say was a way to sure up support with his Republican base ahead of Tuesday.\nRich Hein/Sun Times via AP\nOn the Democratic side, frontrunner J.B. Pritzker, whose family owns the Hyatt hotel chain, has dominated the fundraising race, and loaned his campaign an additional $6.3 million last week, bringing his total investment in the race thus far close to $70 million, according to campaign finance records.\nIf the current rate of spending holds, Illinois could break the current record for the most expensive gubernatorial race in American history, a title currently held by California's 2010 gubernatorial election, which saw roughly $280 million spent.\n\"It’s entirely possible that that could happen here, it just depends on who wins tomorrow, who the candidates are, and how much they’re willing to put in,\" Sarah Brune, the executive director of the Illinois Campaign for Political Reform, a non-partisan group that tracks political spending in the state, told ABC News.\n\"All in sum, all of the candidates for governor have raised about $160 million so far,\" Brune said, an impressive total considering the general election campaign is not even underway.\nPritzker, whose competition for the Democratic nomination includes Christopher Kennedy, a son of Robert F. Kennedy, and State Sen. Daniel Biss, has been dogged by his connection to former Illinois Governor Rod Blagojevich, who was convicted and sentenced to 14 years in federal prison for violating corruption laws.\nIn an attempt to tie Pritzker to Blagojevich and weaken his political standing ahead of November, Rauner has run ads featuring a recording of the two men discussing who would fill the U.S. Senate seat once held by former President Barack Obama. Pritzker has denied any wrongdoing but last month called the calls “regrettable” when asked a news conference.\nScott Olson/Getty Images\nNational Democrats have already sensed Rauner’s vulnerability, and see the competitive primary he is locked in as an indication that his seat is theirs for the taking.\n“This is one of the best pickup opportunities for Democrats in the country. Voters are looking for change, and the Democratic nominee is going to deliver change from the disastrous Rauner years,” Jared Leopold, the Communications Director for the Democratic Governors Association (DGA) told ABC News.\nLast week the DGA rolled out two television ads, one focusing on Rauner’s record on jobs and the budget and the other painting Ives as “too conservative” for Illinois in what is being interpreted nationally as an attempt to boost Ives and energize the state’s more conservative voters against Rauner.\nRepublicans are confident that the rumors of Rauner’s political demise are overblown, and say the Democratic strategy of \"meddling\" in the Republican primary shows their lack of confidence in Pritzker as a winning candidate.\n\"Governor Rauner is in strong shape, he should win easily tomorrow night,\" Jon Thompson, the Communications Director for the Republican Governors Association (RGA) said, \"Now the Democrats are now waking up to the notion that J.B. Pritzker is unelectable in a general election.\"\nThompson said the DGA's attempts to boost Ives and hurt Rauner show that \"they don't have faith in their own candidate.\"",
    "source_domain": "abcnews.go.com",
    "title": "Famous names face off in historically expensive Illinois gov race",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/famous-names-face-off-historically-expensive-illinois-gov/story?id=53850164"
}