{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 22:18:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Is NRA move to regulate 'bump stocks' real or a ruse?",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fnra-move-regulate-bump-stocks-real-ruse-50334558.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_11cbeee3f246445bbcceeac5ef254183_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When the National Rifle Association urged the government to revisit whether \"bump stocks\" should be restricted, it immediately raised eyebrows. Why would the nation's leading gun-rights organization, not known for compromise, be willing to bend even just a bit when it wields perhaps more influence than ever?\nSome gun-industry experts say the NRA's move is little more than a ruse to stall any momentum for wider gun control until outrage over the Las Vegas attack subsides. It also carries little risk. For one, it's rare for the Bureau of Alcohol, Tobacco, Firearms and Explosives to reverse course without a change in the law. For another, \"bump stocks\" are not big moneymakers for the gun industry. And by seeking an administrative change, rather than a new law, the NRA allows its supporters in Congress to avoid going on the record with a vote.\n\"They're dismissed as silly gadgets that really inhibit the accuracy of a firearm. If these bump stocks were super popular among gun owners, we'd see a very different position from the NRA,\" said Adam Winkler, a professor at the University of California, Los Angeles, School of Law and author of \"Gunfight: The Battle over the Right to Bear Arms in America.\"\nThe NRA \"can throw a sacrificial lamb of 'bump stocks' because they know that gun owners don't use them or like them,\" he added.\nThe devices, originally intended to help people with disabilities, fit over the stock and pistol grip of a semi-automatic rifle and allow the weapon to fire continuously, some 400 to 800 rounds in a single minute, mimicking a fully automatic firearm. Bump stocks were found among the weapons used by Stephen Paddock as he rained bullets from a Las Vegas casino high-rise last Sunday. The gunfire killed 58 people at a concert below and wounded hundreds more.\nOn Thursday, the NRA issued a statement that urged the ATF to review whether the devices comply with federal law and said it \"believes that devices designed to allow semi-automatic rifles to function like fully automatic rifles should be subject to additional regulations.\"\nThe statement pointedly noted that it was under President Barack Obama's administration that the devices were authorized to be sold and again urged Congress to enact one of the gun lobby's top priorities: a national \"concealed-carry reciprocity\" law that would require all states to recognize other states' concealed carry permits.\nIn a matter of hours, NRA chief lobbyist Chris Cox put to rest any sense that the group was actively seeking a ban of bump stocks, telling Fox News' Tucker Carlson: \"What we've said is ATF needs to do their job. ATF needs to look and if there's technology that's come to the market that allow for a semi-automatic rifle to function as a fully automatic rifle, they need to be regulated differently. We didn't talk about banning anything.\"\nNotably, the nation's other leading gun lobbying groups, including Gun Owners of America, reiterated their opposition to restricting or banning the devices.\nThe few companies that sell bump stocks are known to include in their packaging a letter from the ATF from 2010, when the agency concluded that they were not restricted by either the Gun Control Act or the National Firearms Act.\nThe ATF provides guidance when a manufacturer asks the agency to evaluate a firearm or accessory to determine if its sale is restricted by either federal law. It is extremely rare for the ATF to reconsider its previous guidance unless federal law changes — so rare that experts could think of only one time when it has happened, and even then they weren't sure their memories were correct.\nThe agency, describing its process in general on Friday, indicated that Congress will be responsible for decisions about regulating or banning the devices.\nIt was not immediately clear whether President Donald Trump or Attorney General Jeff Sessions, who oversees the ATF, could order it to re-evaluate its judgment about devices.\nThe NRA is viewed as the most powerful and most inflexible group in the gun lobby. It pours millions of dollars into political campaigns and successfully blocks legislation that would either ban certain firearms or make them more difficult to purchase. The NRA has only gained influence following the election of Trump, who became the first president since Ronald Reagan to address the group's annual meeting.\nAfter some particularly deadly mass shootings, the NRA has worked to find some common ground with gun-control advocates.\nFollowing the 2007 Virginia Tech shooting in which a mentally ill student shot and killed 32 people and wounded 17, the NRA worked with gun-control advocates to fund a bill designed to improve record keeping so that people with mental illnesses were unable to purchase a firearm.\nIn the days following the Las Vegas attack, unusual alliances began to emerge between top Democratic and Republican members of Congress urging that bump stocks be banned. If the devices were restricted by an administrative ruling, it would spare NRA supporters in Congress from having to go on the record with a vote.\nJohn Feinblatt, president of Everytown for Gun Safety, cast the NRA's move as a \"wink and a nod.\"\n\"They're not making a concession. What they've really done is punted this to the very federal agency that said bump stocks were legal,\" Feinblatt said. \"This was just a wink and nod.\"",
    "source_domain": "abcnews.go.com",
    "title": "Is NRA move to regulate 'bump stocks' real or a ruse?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/nra-move-regulate-bump-stocks-real-ruse-50334558"
}