{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 08:45:40+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Afghan president slams Pakistan for harboring Taliban",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fafghan-president-slams-pakistan-harboring-taliban-52789027.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_3456567b8cc643be91ab946ef900e940_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Afghan president slammed Pakistan on Friday, blaming it for a wave of massive deadly attacks that have ravaged his nation recently and accusing Islamabad of harboring the Taliban.\nIn a televised speech to the nation, Ashraf Ghani insisted the \"center of Taliban terrorism is in Pakistan\" and demanded that authorities in the neighboring country \"show some concrete action to rid their territory of insurgents.\"\nGhani, flanked by Afghanistan's top Islamic clerics, also urged those among the Taliban who wanted to talk peace with the government to separate themselves from those who want only to fight.\nOn Wednesday, Afghan officials visited Pakistan with what they describe as evidence of Taliban attacks emanating from militant training centers in Pakistan. Afghanistan's Intelligence Chief Masoom Stanikzai and Interior Minister Wais Ahmed Barmak presented documentation and confessions from arrested insurgents claiming to have been trained in Islamic seminaries in Pakistan.\n\"The Afghan nation is waiting for clear action\" from Pakistan, said Ghani, adding that so far Afghanistan got only promises of cooperation from Islamabad. Pakistan's Foreign Secretary Tehmina Janjua along with senior military and security officials will travel to Kabul on Saturday with Islamabad's response, after reviewing the Afghan documents.\nKabul and Islamabad have repeatedly traded accusations that the other is harboring enemy insurgents.\nThe United States has also criticized Pakistan for providing sanctuaries for the Taliban, who are fighting U.S. troops in Afghanistan. President Donald Trump accused Pakistan of \"lies and deceit\" and demanded Pakistan evict Taliban insurgents, particularly the Haqqani network from Pakistani safe havens. The U.S. has suspended military assistance to Pakistan to back its demands.\nPakistan has denied providing sanctuaries to militants. On Friday, the Ministry of Foreign Affairs said it stands with Afghanistan \"in fighting the menace of terrorism.\"\nThe ministry's statement noted that Pakistan has erected 975 security posts along the porous border with Afghanistan, while Kabul set up only 218. It called for more border security from Kabul, saying insurgents in Afghanistan have carried out 417 attacks in Pakistan in 2017.\nMeanwhile, Ghani said he has ordered a wide-reaching review of Kabul's security following massive deadly attacks in recent weeks that have left killed nearly 200 and wounded hundreds more.\n\"The Kabul people are demanding that we make a serious review of our security arrangements,\" he said.\n———\nAssociated Press writer Munir Ahmed in Islamabad contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Afghan president slams Pakistan for harboring Taliban",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/afghan-president-slams-pakistan-harboring-taliban-52789027"
}