{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 01:36:07+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fnba-draft-player-declared-early-2018%2Fstory%3Fid%3D54706749.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0424/dm_180424_Yates_on_Julio_Jones1143/dm_180424_Yates_on_Julio_Jones1143_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The NBA released to teams the list of 236 players who have filed as early entry candidates for the 2018 NBA draft, including 181 players from colleges and 55 international players. This number is up significantly from last year, which had 182 players (137 colleges, 45 internationals), an increase of 30 percent from 2017.\nPlayers wishing to enter the 2018 NBA draft were required to submit a letter to the NBA to be received no later than Sunday, April 22 at 11:59 PM ET. Players who have applied for early entry have the right to withdraw their names from consideration for the draft by notifying the NBA of their decision in writing no later than 5 p.m. ET on Monday, June 11. Under NCAA rules, in order to retain college basketball eligibility, underclassmen that have entered the 2018 draft must withdraw by Wednesday, May 30.\nHere is the list of college players who have applied for early entry into the 2018 draft, which will be held Thursday, June 21:\nAnd here are the international players:\nAdditionally, the NBA sent teams a list of six players who are \"auto-eligible\" for the 2018 draft. These are international players (as defined in the CBA) that may have signed professional basketball contracts with teams in leagues other than the NBA prior to January 1, 2018. If this information is correct, these players would also be eligible for selection in the 2018 NBA draft. Because this information has not been verified, however, teams will have to do their own due diligence (as with any other draft selection).",
    "source_domain": "abcnews.go.com",
    "title": "NBA draft: Every player who has declared early for 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/nba-draft-player-declared-early-2018/story?id=54706749"
}