{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:47:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "The Latest: Governor sticks by plan to end Flint credits",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-state-orders-flint-hospital-fix-health-risks-45493157.json",
    "image_url": "http://abcnews.go.com/US/wireStory/latest-state-orders-flint-hospital-fix-health-risks-45493157",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on Flint's water crisis (all times local):\n6:10 p.m.\nMichigan Gov. Rick Snyder is sticking by a decision to end state-funded credits on customers' water bills in Flint.\nHe says he and Flint Mayor Karen Weaver had a \"constructive\" meeting Tuesday, but he reaffirmed that the credits will last through February because the water's lead level is no longer above a federal limit. Residents are still using filters.\nWeaver, who did not speak with reporters after the meeting at Snyder's office, had criticized eliminating the credits that apply retroactively to 2014 and after.\nSnyder says he and the mayor also spoke about replacing lead pipes and ways to bring jobs to the impoverished city.\n———\n6 p.m.\nA Flint hospital is firing back against the state of Michigan after officials ordered the hospital to immediately fix conditions they suspect post an ongoing public health threat of Legionella bacteria.\nMcLaren Flint said Monday the state provided \"absolutely no support\" during a deadly Legionnaires' disease outbreak in 2014 and 2015 in Genesee County.\nThe hospital says now that criminal charges have been filed against current and former state and city employees, the state is \"retroactively casting blame\" for cases it did nothing about for years.\nThe state Department of Health and Human Services issued the order Monday. It says there is reasonable belief that McLaren Flint's water system is a \"nuisance, is in an unsanitary condition, and is a possible source of illness.\"\n———\n3:35 p.m.\nMichigan is ordering a Flint hospital to immediately fix conditions the state suspects pose on ongoing public health threat of Legionella bacteria.\nThe state Department of Health and Human Services issued the order Monday. It says there is reasonable belief that McLaren Flint's water system is a \"nuisance, is in an unsanitary condition, and is a possible source of illness.\"\nThe state says 10 of the 12 Legionnaires' disease deaths that some outside experts have linked to Flint's water crisis are associated with the hospital, but it has failed to provide sufficient information verifying compliance with federal recommendations. The state also cites a 2014 analysis conducted for McLaren by a company that said it appeared Flint's water supply was not contributing to Legionella issues at the hospital.\nA hospital spokeswoman could not immediately be reached for comment.\n———\n9:45 a.m.\nThe mayor of Flint is meeting with Michigan's governor to discuss the state's decision to no longer fund residential water bill credits or help the beleaguered city pay for water from a Detroit-area system.\nFlint Mayor Karen Weaver is expected to meet with Gov. Rick Snyder in Lansing Tuesday afternoon.\nState officials announced Jan. 24 that the financial assistance will stop at the end of February because the level of lead in Flint's water no longer exceeds the federal limit.\nMichigan has partially covered customers' bills dating back to April 2014. Snyder's office estimates the state will have spent $41 million on that by the end of February.\nSnyder's spokeswoman Anne Heaton said Monday that the elimination of credits and other payments isn't a sign of Michigan abandoning Flint.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Governor sticks by plan to end Flint credits",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-state-orders-flint-hospital-fix-health-risks-45493157"
}