{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 09:19:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Disgruntled French steel workers turn to populist Le Pen",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fdisgruntled-french-steel-workers-turn-populist-le-pen-46856813.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_f003b90da16b4c20bfdeb792db6e2321_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two things now grow around the rusting carcasses of the last blast furnaces in this French steel town: weeds, and votes for populist Marine Le Pen.\nFor months, labor leader Walter Broccoli fought to keep the fires burning, fearing that failure could drive enraged workers toward Le Pen and her virulently nationalistic politics. He never imagined his own son would become part of the stampede.\nHe says they've not spoken in the three years since he discovered to his horror that David Broccoli registered as a candidate in municipal elections for Le Pen's anti-European Union, anti-immigration National Front.\n\"I said to myself, 'Impossible! What's happened to him?' I called him up. We argued. He told me, 'That's the way it is' and hung up on me,\" Walter Broccoli says. \"I've had nightmares where I saw him dressed in an SS uniform, all in black, with a cap. I took it very hard.\"\nYet the National Front is now an inescapable part of the landscape in France's industrial eastern rustbelt. Le Pen is projected to win millions of votes Sunday in the first round of France's two-stage presidential election, likely catapulting her to within one step of an electoral earthquake that would shake France and the EU to its core.\nFor some disgruntled working-class voters, a ballot for the anti-establishment Le Pen is a yell of protest — their nuclear option against the political mainstream.\nSteel worker Pascal Grimmer says she'll get his vote because he's \"angry with politicians, filled with rage,\" and \"she is the candidate who most scares the others.\"\nHe hopes an electro-shock-high score for Le Pen will jolt mainstream politicians \"to ask themselves, 'What do people want?'\"\n\"You reap what you sow,\" he says. \"Our politicians have treated the French people like idiots.\"\nLast time, Grimmer voted Francois Hollande, the Socialist whose presidency, now in its final weeks, lasted just one term.\nGrimmer was impressed when Hollande came stumping during the 2012 campaign for working-class votes at the ArcelorMittal steel plant where he works. Labor leaders were in the thick of their battle to save Hayange's furnaces. Hollande clambered onto the roof of a van with union leaders, took a microphone and promised a law to help save plants facing closure.\n\"I said to myself, 'Oh, I like this guy.' Naively, I believed him,\" Grimmer recalls.\nWorkers felt betrayed when the furnaces were extinguished in 2013. Hollande's Socialist government struck a deal with steel magnate Lakshmi Mittal that secured jobs elsewhere or retirement for the furnace workers. ArcelorMittal also promised to invest 180 million euros ($190 million at today's rates) in other sectors of the steel works that still produce high-grade metals for automakers and other clients.\nStill, the mothballing of the furnaces hit hard. Grimmer, Broccoli and other members of their Workers' Force labor union unveiled a plaque of protest in Hayange when the scorching fires which had melted ores into metal went cold.\n\"SELLOUT,\" the plaque read. \"Here lie the promises of change that F. HOLLANDE made to workers and their families.\"\nBroccoli says he warned Socialist officials that extinguishing the furnaces would be \"electoral suicide.\" Sure enough, the year after they were put out, Hayange voted in a National Front mayor.\n\"It really hurts me to see workers turning toward fascism, the extreme right,\" Broccoli says. \"They are so angry that they are prepared to vote National Front, to destroy everything.\"\nBroccoli's son, a computer technician, doesn't work in the steel industry. Still, the father assumes his son felt \"abandoned by the government\" after losing a job in the wake of the 2008 financial crisis.\n\"I feel as though he's been stolen from me,\" Walter Broccoli says.\nDavid Broccoli didn't respond to calls from The Associated Press. Herve Hoff, who stood with him as a National Front candidate in 2014, says David Broccoli felt betrayed by the left and \"adopted our ideas.\"\nIn Hayange, where the decaying furnaces dominate the skyline, the unemployment rate is 14 percent, according to the mayor — more than the already high national average of 10 percent. Still, National Front Mayor Fabien Engelmann smugly presents himself as an example of what his party can do with power.\n\"I didn't lie to my voters,\" he says. \"I offered them a coherent program: security, cleanliness, lower taxes, reduced debts, road building, work on schools — things a mayor can do.\"",
    "source_domain": "abcnews.go.com",
    "title": "Disgruntled French steel workers turn to populist Le Pen",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/disgruntled-french-steel-workers-turn-populist-le-pen-46856813"
}