{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:46:03+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "\"GMA\" teamed up with The Wirecutter to demo expert-recommended rain boots and umbrellas.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fwirecutters-top-picks-rain-gear-46853528.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_bankert_0823_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for The Wirecutter's top picks for rain gear\nA \"Gma\" exclusive now. We are squashing into spring with the best gear to keep you dry. The wirecutter is out for its top pick for rain boots and Adrienne Bankert is here to tell us how they fared in our extreme wet weather challenge which was a challenge. Extreme. It's beautiful outside here in New York City today, but a lot of families are getting into that spring cleaning mode and taking out their warm weather wardrobe but it's definitely not time to put away that umbrella or rain boots yet. Spring showers really aren't much fun without the right footwear. The wirecutter is out with its best picks for men's and women's rain boots and took testers 100 hours in rainy northern California and Colorado wearing them as they trek through the wood, shoreline and even driving with them on to check comfort. We set up our own demo trying to make our own puddle to see if any of these leaked. Exactly. To test for it writer Liz Thomas said they filled a kiddie pool and suffered the boots with paper towels letting them sit for 24 hours while our boots soak we move on to our extreme challenge, a water sport of sorts. To see whether the boots have enough traction. Do the moonwalk and worst case their Joe. The wirecutter soaked up a kitchen floor to see how they did in foot conditions. When you try to slide it'll stop you. Reporter: On me, the extra tough salmon sister legacy boot for $135. It's much more weighted. And on Liz the men's pick. Xtratuf at $135. The top budget pick, target Merone that malista performed better on slick surfaces than the hunter for $150. The wellies fared fairly well and named most stylstylish. We have the same results at the wirecutter test. None leaked. There is no purple stained paper towels in our boots. Okay, so I'm rocking the winters from wire cutters. The extra tough salmon legacy boots. Something practical and yet stylish it's going to last for a long, long time. The wirecutter does receive proceeds from retailers' products advertised on their website. Good to know that. I feel silly what I'm wearing right now. But you talked about umbrellas. Yes, you're actually winning the best overall winner for best umbrella. You can open that one up. This is the repel easy touch. Of course, we've seen a lot with those inside out umbrellas in that strong wind. Not happening here. I know it does happen sometimes. We do have this, as well. The totes auto stick umbrella. This is the best stick umbrella. All right. A lot of information there. Thank you very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "The Wirecutter's top picks for rain gear",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/wirecutters-top-picks-rain-gear-46853528"
}