{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:35:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Bitcoin futures soar amid frenzy over virtual currency",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fbitcoin-futures-soar-amid-frenzy-virtual-currency-51719862.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/bitcoin-futures-soar-amid-frenzy-virtual-currency-51719862",
    "language": "en",
    "localpath": null,
    "maintext": "Bitcoin's debut on a major U.S. exchange is a hit so far, with the price of the first-ever futures contract for the virtual currency rising 18 percent.\nThe futures contract that expires in January surged $2,730 to $18,190 Monday morning on the Chicago Board Options Exchange. Trading began Sunday, and the price rose as high as $18,850, according to data from the CBOE.\nThe CBOE futures don't involve actual bitcoin. They allow investors to make bets on the future direction of bitcoin.\nThe first session of futures trading fit right in with the frenzy surrounding bitcoin. Traffic to the CBOE website was so heavy right after the start of trading that the site experienced outages. The exchange also halted trading twice Sunday to stem volatility. The exchange operator has rules in place to stop trading after price swings of 10 percent.\nAnother large futures exchange, the Chicago Mercantile Exchange, will start trading its own futures on Dec. 18 but will use a composite of several bitcoin prices across a handful of exchanges.\nThe price of a bitcoin has soared since beginning the year below $1,000, hitting a peak of more than $16,858 Dec. 7 on the bitcoin exchange Coindesk. As of 10:15 a.m. CST, it was at $16,510 on Coindesk.\nFutures are a type of contract in which a buyer and a seller agree on a price for a particular item to be delivered on a certain date in the future, hence the name. Futures are available for nearly every type of security but are most famously used in commodities such as wheat, soy, gold, oil, cocoa and, as dramatized in the Eddie Murphy and Dan Aykroyd movie \"Trading Places,\" concentrated frozen orange juice.\nThe futures signal greater mainstream acceptance of bitcoin but also open up bitcoin to additional market forces. The futures will allow investors to bet that bitcoin's price will go down — a practice known as shorting — which had been very difficult to do.\nThere have been other attempts to bring bitcoin investing into the mainstream. Tyler and Cameron Winklevoss, twin brothers who own large amounts of bitcoin, tried to create an exchange-traded fund based on bitcoin, but federal regulators denied their application.\nHow much actual investor interest there will be in these bitcoin futures is still up in the air. Many larger Wall Street brokerages and clearinghouses, including Goldman Sachs and JPMorgan Chase, are either not allowing customers to trade bitcoin futures or only allowing select clients to do so. Other brokerages are putting restrictions on the amount of margin a trader can use in bitcoin futures, or putting limits on the amount that can be purchased.\nThe digital currency has had more than its fair share of critics on Wall Street. JPMorgan Chase CEO Jamie Dimon has called bitcoin \"a fraud.\" Thomas Peterffy, chairman of the broker-dealer Interactive Brokers Group, expressed deep concerns about the trading of bitcoin futures last month, saying \"there is no fundamental basis for valuation of Bitcoin and other cryptocurrencies, and they may assume any price from one day to the next.\"\nPeterffy noted that if bitcoin futures were trading at that time, under the CBOE's rules those futures likely would experience repeated trading halts because 10 percent or 20 percent moves in bitcoin prices have not been unusual in recent months.\nBitcoin is the world's most popular virtual currency. Such currencies are not tied to a bank or government and allow users to spend money anonymously. They are basically lines of computer code that are digitally signed each time they are traded.\nA debate is raging on the merits of such currencies. Some say they serve merely to facilitate money laundering and illicit, anonymous payments. Others say they can be helpful methods of payment, such as in crisis situations where national currencies have collapsed.\n———\nKelvin Chan in Hong Kong contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Bitcoin futures soar amid frenzy over virtual currency",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/bitcoin-futures-soar-amid-frenzy-virtual-currency-51719862"
}