{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 09:14:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "In or out? Trump aides to huddle on climate accord Tuesday",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Ftrump-aides-huddle-climate-accord-tuesday-46856383.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_856797862d444ae58e2b86f17fc699f7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump's top aides will huddle Tuesday to discuss whether or not the U.S. should remain part of the Paris Climate accord — a global effort to cut down on climate-warming carbon emissions.\nOfficials will be discussing their options, with the goal of providing a recommendation to the president about the path forward, according to an administration official who spoke on condition of anonymity, despite the president's criticism of the use of anonymous sources.\nThe non-binding international agreement was forged in Paris in December 2015 and allowed rich and poor countries to set their own goals to reduce carbon dioxide. It went into effect last November after it was ratified by countries, including the U.S. and China.\nTrump's top advisers are currently divided on the issue, with some, including Environmental Protection Agency head Scott Pruitt, eager for the U.S. to leave the deal.\n\"Paris is something that we need to really look at closely, because it's something we need to exit, in my opinion,\" Pruitt said in an interview with Fox News Channel's \"Fox & Friends\" last week. \"It's a bad deal for America. It was an America second, third or fourth kind of approach.\"\nTrump pledged during his campaign to pull out of the Paris accord, but has wavered on the issue since he won the presidency.\nHe told the editorial board of The New York Times in an interview last year that he was, \"looking at it very closely.... I have an open mind to it. We're going to look very carefully.\"\nUnder the agreement, the U.S. pledged to reduce its annual greenhouse gas emissions in 2025 by 26 to 28 percent below 2005 levels, which would be a reduction of about 1.6 billion tons of annual emissions. Besides continuing Obama's efforts to reduce U.S. heat-trapping gases, Trump has two general options.\nOne option is to pull the United States out of the non-binding agreement, which Obama enacted without U.S. Senate ratification. It typically takes countries four years to pull out of new international treaties, but because Obama enacted the accord as part of the 1992 Rio de Janeiro treaty, Trump could pull out of the older, broader treaty in one year.\nAnother option is to just do nothing. Trump could publicly badmouth the treaty, but not formally withdraw from it. If the U.S. stays part of the agreement, which 125 nations or groups of nations have already ratified, and fails to reach its goal, technically nothing happens. There is no climate court, no enforcement action.\nAnd because the agreement already went into force, nothing the United States can do — even pulling out — can nullify the accord. It is in effect.\nNonetheless, a withdrawal or public announcement that the U.S. is abandoning its efforts to fight man-made climate change could spark repercussions individually from other nations, said Nigel Purvis, who was the top U.S. State Department environmental diplomat when George W. Bush pulled out of the 1997 Kyoto climate treaty.\n\"Any sign that the administration would not be serious will provoke an international reaction that would undermine the administration's foreign policy,\" said Purvis, an international attorney who served in Democratic and Republican administrations. Other countries, he said, take climate change seriously and could retaliate in trade deals or tariffs or balk on negotiations over international security costs.\nTrump has already reversed some of former President Obama's efforts to scale back carbon emissions to try to halt climate change, including restrictions on coal plants and drilling.\nWhite House spokesman Sean Spicer has said the president will make up his mind on the Paris agreement before a summit of the Group of Seven leading industrial nations in Taormina, Italy in late May.\n———\nFollow Colvin and Borenstein on Twitter at https://twitter.com/colvinj and https://twitter.com/borenbears",
    "source_domain": "abcnews.go.com",
    "title": "In or out? Trump aides to huddle on climate accord Tuesday",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/trump-aides-huddle-climate-accord-tuesday-46856383"
}