{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 03:36:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Cowboys' Elliott looked the part as rookie, wants an encore",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fcowboys-elliott-looked-part-rookie-encore-48046634%3Fyptr%3Dyahoo%3Fsrc%3Drss.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_35ddff90ee034fe0bf65ecc30565bce8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ezekiel Elliott plopped a cowboy hat on his head and flashed a wide smile that made him look like someone closing in on a few weeks of vacation.\n\"Feel like a real cowboy,\" the star Dallas running back said after the second-to-last offseason practice Wednesday. \"Do I look the part?\"\nHard to say with the beard, but he looked the part in what mattered last year: NFL rushing champion as a rookie fourth overall draft pick. Now the question is the encore, and the offseason handling of a known commodity at a position predisposed to short careers.\n\"We don't really talk about taking it easy,\" offensive coordinator Scott Linehan said. \"I think we're pushing forward with him. We've got to still manage that for him. But certainly we'll want to amp it up this year as far as his ability to affect the game in the run game and the pass game.\"\nElliott missed the first week of offseason practices after hitting his head as a passenger in a car accident, the second straight year he was involved in a car wreck during the offseason program.\nStill not cleared by the NFL despite authorities dropping a domestic case in Ohio last year, Elliott made headlines again in March when he pulled down a woman's shirt during a St. Patrick's Day parade. As a result, questions about his off-field activities persist.\nRunning backs coach Gary Brown says he sees a more disciplined Elliott, and the former Ohio State star acknowledged easing up on his nightlife in recent weeks as the team's offseason program accelerated.\n\"You learn from your mistakes,\" Elliott said. \"And if you don't, it could be brutal. Just part of life.\"\nWhen Elliott reports to training camp after a five-week break, he'll be preparing for what figures to be a similar workload after he led the NFL with 322 carries for his league-best 1,631 yards.\nBecause Elliott is a good blocker and pass-catcher, the Cowboys really don't have a reason to take their All-Pro off the field, except they know they must.\nAnd that's why the question comes up even though Elliott turns just 22 the day the team is scheduled to arrive in California.\n\"You have to learn how much your body can take,\" said Elliott, the fifth rookie to lead the NFL in rushing since the 1970 merger.\n\"That's really important, so developing a routine, week in, week out, that will keep you fresh, that will keep you from having those nagging injuries.\"\nQuarterback Dak Prescott was the fellow rookie sensation who helped the Cowboys to a 13-3 record and top seed in the NFC before losing to Green Bay in a divisional playoff. The NFL Offensive Rookie of the Year faces the same encore question.\n\"We're going to get better together,\" said Prescott, who set rookie records in passer rating (104.9) and completion rate (67.8 percent). \"He's kind of my partner in crime. If I need something, he's going to make sure on the field and off the field it happens.\"\nElliott had a 60-yard score and an 83-yard touchdown on a screen pass as a rookie, but breakaway runs top his list of ways to improve in his second season. Brown said drills where Elliott tries to elude defensive backs are one way to work on what they call second-level running.\n\"You try to come up with different creative ways to keep him motivated, other than the way he is motivated already by just being better,\" Brown said. \"But you've still got to give him more. You don't want it to get stale.\"\nElliott is listening.\n\"You can say I've proven myself, but I've got to keep doing that,\" he said. \"So it's all just kinda learning this offense inside out and kind of learning more beyond what I do.\"\n———\nMore AP NFL: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Cowboys' Elliott looked the part as rookie, wants an encore",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/cowboys-elliott-looked-part-rookie-encore-48046634?yptr=yahoo?src=rss"
}