{
    "authors": [
        "Abc News",
        "More Morgan"
    ],
    "date_download": "2017-02-15 13:28:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Sen. Lindsey Graham called for a broader bipartisan investigation if reports are proven true about communications between Donald Trump's campaign and Russians.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fcontact-trump-campaign-russian-intel-officials-game-changer%2Fstory%3Fid%3D45505386.json",
    "image_url": "http://a.abcnews.com/images/Politics/NC-trump-ml-170215_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sen. Lindsey Graham today called for a broader bipartisan investigation if it’s true that Donald Trump's campaign communicated with Russians in the year leading up to the 2016 presidential election.\n\"If there's contacts between the Trump campaign and Russian intelligence officials outside the norm, that’s not only big league bad; that’s a game changer,\" Graham, R-S.C., said in an interview on ABC News' \"Good Morning America.\"\n\"If it is true, it is very, very disturbing to me.”\nSources familiar with the matter confirmed to ABC News Tuesday that U.S. authorities were probing communications between associates of Trump and suspected Russian intelligence officials before the presidential election.\nThe New York Times first reported the alleged “repeated contacts” between Trump's associates and Russians in the lead-up to the election. U.S. officials speaking with the newspaper noted, however, that there was no evidence of cooperation between the campaign and the Russians to attempt to “influence the election.”\nABC News' Adam Kelsey contributed to this report.\nThis is a breaking news story. Please check back for updates.",
    "source_domain": "abcnews.go.com",
    "title": "Contact between Trump campaign and Russian intel officials would be 'game changer,' Sen. Lindsey Graham says",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/contact-trump-campaign-russian-intel-officials-game-changer/story?id=45505386"
}