{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:17:16+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fwomen-run-senate-hurdles-remain-55522610.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_e5564ce821664dc2acca93b5a2a9d7cb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Midterm Elections? Add Midterm Elections as an interest to stay up to date on the latest Midterm Elections news, video, and analysis from ABC News. Add Interest\nA record number of women are on track to run for the U.S. Senate, though it will be a challenge to capture those seats and help make the chamber more diverse.\nMany face uphill campaigns and two Democratic incumbents in particular among the 23 women in the Senate are seen as politically vulnerable in the November election.\nIn Wisconsin, Democratic Sen. Tammy Baldwin and Republican state Sen. Leah Vukmir were expected to file for the race on Wednesday. If so, 42 Republican and Democratic women — the most ever — would have qualified to 19 Senate seats. That's according to an Associated Press analysis of data collected by the Center for American Women and Politics at Rutgers University and candidate qualifying information released by states.\nIn 2016, 40 women ran for the Senate.\n\"It's not going to be a huge gain,\" said Dianne Bystrom, director of the Carrie Chapman Catt Center for Women and Politics at Iowa State University. But, she said, the Senate \"is a body more open to incremental changes.\"\nFor more than two centuries, men have dominated the Senate, which has seated only 52 female members in its history. Adding women or even holding the line can mean maintaining pressure on the Senate to act on issues important to female voters, such as health care and family economic policies.\nA potent force behind the surge in female participation is the #MeToo movement, ignited by allegations of sexual misconduct by men in entertainment, politics, journalism and other sectors. There's also the criticism of President Donald Trump's policies and his alleged conduct toward women.\n\"All of these sparks are working in different ways, and one of the giant sparks has been the #MeToo movement,\" said former Democratic Sen. Barbara Boxer of California, among four women elected in 1992. That tripled their Senate ranks, due in part, she said, to a backlash by female voters against the confirmation of Clarence Thomas to the Supreme Court. He had been accused of sexual harassment.\nIn Arizona, odds are a woman will succeed retiring Republican Sen. Jeff Flake. Six women are running in the August primaries.\nRep. Kyrsten Sinema, D-Ariz., who filed her candidate petitions Tuesday, demurred when asked about the role that gender plays in her candidacy. \"For me, my public service has never been about my gender or really any other characteristic,\" Sinema told The Associated Press.\nIn a recent ad, Sinema credits her single mother for shepherding her family through tough times, echoing themes of family security, a priority for some female voters.\nIn Wisconsin, Baldwin could face Vukmir, who faces a competitive August primary.\nThe biggest hurdle for female candidates is the electoral map. Of the 13 Democratic women seeking re-election, four are in states that Trump won in 2016 and where he is expected to weigh in heavily.\nSeen as most vulnerable are first-term Sen. Heidi Heitkamp of North Dakota, which Trump carried by almost 36 percentage points in 2016, and second-term Sen. Claire McCaskill of Missouri, which Trump won by more than 18 percentage points.\nAt the same time, women stand a chance of picking up a seat in Nevada, where Democratic Rep. Jacky Rosen is challenging Republican Sen. Dean Heller.\nIn Tennessee, Republican Rep. Marsha Blackburn, a Trump devotee whom the president raised money for Tuesday night in Nashville, faces former Gov. Phil Bredesen, a Democrat, for the seat being vacated by the retiring GOP Sen. Bob Corker.\nLimited opportunities for women to make gains are nothing new. But the 1992 election helped usher in changes championed by female senators, including the Family and Medical Leave Act and the Violence Against Women Act.\nGiven the challenges to women hoping to increase their numbers in the Senate this year, the election can be as much about defending policy achievements, said Kelly Dittmar of the Center for American Women and Politics at Rutgers.\n\"It's not just about advancing. We need to hold the line,\" she said. \"We need to prevent a backslide on these policies.\"\nThe early cadre of women in the Senate began meeting for dinner at each other's homes. The social bonds defied political differences by including the then-lone Republican Sen. Nancy Kassebaum of Kansas, helping \"create a community\" that the Senate's women today are building upon, said former Sen. Carol Moseley Braun, an Illinois Democrat who in 1992 was the first African-American woman elected to the Senate.\nIn April, the Senate took an incremental but noteworthy step that reflects the changes, sometimes slow-moving, that women in the Senate have achieved.\nSenators voted unanimously to allow babies of members on the Senate floor. That change was inspired by Sen. Tammy Duckworth, D-Ill., who gave birth to a girl in April. The move, Duckworth said at the time, helps \"bring the Senate into the 21st Century.\"\nTo Braun, \"the march toward gender equity in the Senate is inexorable. It's a matter of attitude, and sends the message to young women they can do whatever they want or can.\"\n———\nBeaumont reported from Des Moines, Iowa. Associated Press writer Christina Almeida Cassidy in Atlanta contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Women seek to add to Senate numbers, but challenges await",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/women-run-senate-hurdles-remain-55522610"
}