{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:58:34+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Flatest-watchdog-va-nominee-jackson-unprofessional-54702819.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_993be146470644c490c3053a9efc59d6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on Ronny Jackson, President Donald Trump's pick to be secretary of Veterans Affairs (all times local):\n5:20 p.m.\nPresident Donald Trump's pick to be Veterans Affairs secretary is giving no indication he will withdraw amid allegations of inappropriate workplace behavior.\nRonny Jackson, Trump's White House doctor, says he was \"disappointed\" that Wednesday's confirmation hearing had been postponed.\nHe spoke to reporters before meeting Tuesday afternoon with Republican Sen. Jerry Moran, a member of the Senate Veterans Affairs Committee.\nIn video captured by MSNBC, Jackson says he looks forward to \"answering everybody's questions\" when the hearing is rescheduled. Jackson denies there were any watchdog reports detailing allegations against him.\nA watchdog report ordered in 2012 by Jackson and reviewed by The Associated Press found that he and a rival physician exhibited \"unprofessional behaviors\" as they engaged in a power struggle over the White House medical unit.\n——\n5:10 p.m.\nThe White House Medical Unit in 2012 — led by current Veterans Affairs nominee Ronny Jackson — was described by one staffer as the \"worst command ever.\"\nAn inspector general report from the time says most of the blame for the situation fell on Dr. Jeffrey Kuhlman, the physician to President Barack Obama.\nBut according to the report, Jackson admitted he had failed to shield the White House Medical Unit from the leadership drama between himself and the rival Navy Captain.\nJackson is quoted saying he was willing to do what was necessary to straighten out the command, even if it \"meant finding a new position in Navy Medicine.\"\nJackson was given Kuhlman's post, in addition to running the medical unit, in 2013.\n——\n4:30 p.m.\nA 2012 watchdog report ordered up by Veterans Affairs nominee Dr. Ronny Jackson found that both he and a rival physician exhibited \"unprofessional behaviors\" as they engaged in a power struggle over the White House medical unit.\nThe report suggested the White House consider replacing Jackson or Dr. Jeffrey Kuhlman —or both. Kuhlman was the physician to President Barack Obama at the time.\nThe six-page report was reviewed Tuesday by The Associated Press. The report by the Navy's Medical Inspector General found a lack of trust in the leadership and low morale among staff members.\nThe report says staff members described the working environment as \"being caught between parents going through a bitter divorce.\"\n——\n1:35 p.m.\nPresident Donald Trump says his nominee to lead Veterans Affairs, Dr. Ronny Jackson, will soon be \"making a decision\" about his future amid questions about the White House doctor and Navy rear admiral.\nTrump says in a joint news conference with French President Emmanuel Macron that he will \"stand behind\" his VA nominee but it's \"totally his decision\" on whether he should try to win confirmation in the Senate.\nJackson's nomination was put on hold indefinitely after allegations surfaced regarding inappropriate behavior on the job and over-prescribing prescription drugs.\nTrump is criticizing members of Congress who questioned Jackson's lack of experience. He called Jackson one of the finest people he's ever met.\n———\n10:55 a.m.\nThe leaders of a Senate panel say the confirmation hearing for Ronny Jackson, President Donald Trump's pick to be Veterans Affairs secretary, is being postponed indefinitely.\nSen. Johnny Isakson, the Republican chairman of the Senate Veterans Affairs Committee, and Sen. Jon Tester, the top Democrat, cite \"serious allegations\" recently made against Jackson.\nThey say it is their duty to \"thoroughly and carefully vet\" his nomination. His hearing had been set for Wednesday.\nThe two lawmakers sent a letter to Trump Tuesday requesting additional information about Jackson, who has served as a White House physician since 2006. It seeks any communication between the Pentagon and the White House regarding \"allegations or incidents\" involving him.\nTrump selected Jackson to head the VA last month after firing former Obama administration official David Shulkin.\n———\n10:15 a.m.\nA Senate committee says it has delayed Wednesday's confirmation hearing for Ronny Jackson, President Donald Trump's pick to be secretary of Veterans Affairs.\nSpokeswoman Amanda Maddox cites questions from lawmakers over allegations made about Jackson's past behavior.\nThe Senate Veterans Affairs Committee was scheduled to hold Jackson's hearing on Wednesday.\nTrump selected Jackson to head the VA last month after firing former Obama administration official David Shulkin following an ethics scandal and mounting rebellion within the agency. But Jackson has since faced numerous questions from Republican and Democratic lawmakers about whether he has the experience to manage the massive department of 360,000 employees serving 9 million veterans.\n———\n9:20 a.m.\nThe White House is standing behind Ronny Jackson, President Donald Trump's choice to be Veterans Affairs secretary amid growing questions about his qualifications.\nSpokesman Hogan Gidley is praising Jackson, who is Trump's White House doctor and a Navy rear admiral, for serving as a physician to three U.S. presidents, both Republican and Democrat. He says Jackson has a record of \"strong decisive leadership\" and is \"exactly what's needed at the VA.\"\nSenators have been discussing plans to delay Jackson's confirmation hearing, saying more time may be needed to review whether Jackson can manage a massive agency of 360,000 employees serving 9 million veterans.\nThe hearing is scheduled for Wednesday.\n———\n1:46 a.m.\nSenators are discussing plans to delay the confirmation hearing for President Donald Trump's pick to be Veteran Affairs secretary over growing questions about the nominee's ability to manage the government's second-largest department.\nThe hearing for Ronny Jackson, Trump's White House doctor, is scheduled for Wednesday.\nDemocratic Sen. Richard Blumenthal says some Republicans have told him that they think the hearing should be postponed, which he says deserves consideration.\nBlumenthal says he thinks there may well be a need for more time, in fairness to Jackson, so that he and the administration have an opportunity to answer these questions fully and fairly.\nBlumenthal declined to discuss why more time might be needed.\nWhite House and VA officials are also discussing a delay with key allies outside the administration.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: No sign Jackson will withdraw VA nomination",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/latest-watchdog-va-nominee-jackson-unprofessional-54702819"
}