{
    "authors": [
        "Abc News",
        "Mike Levine",
        "Adam Kelsey",
        "More Cecilia",
        "More Mike",
        "More Adam"
    ],
    "date_download": "2017-02-15 03:50:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "FBI interviewed Michael Flynn about his talks with Russian envoy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ffbi-interviewed-michael-flynn-talks-russian-ambassador%2Fstory%3Fid%3D45495076.json",
    "image_url": "http://a.abcnews.com/images/Politics/ap-flynn-2-er-170201_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In the days following the inauguration of President Donald Trump, the Federal Bureau of Investigation interviewed then-National Security Adviser Michael Flynn to discuss his conversations with the Russian ambassador to the U.S., according to multiple government officials.\nABC News has previously reported that Flynn’s communications with Russia, including with its ambassador, Sergey Kislyak, have been examined as part of a broad counterintelligence investigation into contacts between the Trump team and Russians. This is the first confirmation that the FBI spoke with Flynn directly.\nIt was not immediately clear what the FBI and Flynn discussed.\nLaw enforcement sources told ABC News that the inquiry has not found evidence of any criminal wrongdoing in the communications examined thus far, but that the probe remains under FBI and Department of Justice review.\nFlynn's interview with FBI came before then-acting Attorney General Sally Yates reached out to the White House on Jan. 26 to alert the administration that the National Security Adviser may have misled officials about the nature of his conversations with Kislyak.\nABC News has also learned that FBI Director James Comey had expressed concern about telling the White House, fearing it could impact the FBI probe, but he acquiesced after investigators were able to interview Flynn. Questions remain though about how forthcoming Flynn was in his interview with FBI.\nFlynn’s resignation Monday evening came in the wake of news reports about Yates’ contacting the White House more than two weeks before.\nHe resigned in a letter saying he “inadvertently briefed the vice president-elect and others with incomplete information regarding my phone calls with the Russian ambassador.”\nFlynn initially denied he talked specifically about sanctions with the ambassador. And Vice President Mike Pence publicly vouched for Flynn, saying in TV interviews that Flynn and the Russian envoy had not discussed sanctions.\nABC News confirmed last week that Flynn and Kislyak did talk after Trump's campaign victory about U.S. sanctions against Russia over its interference in the presidential election, which raised questions about whether Flynn's conversations may have violated federal law.\nAdministration sources said Flynn called Pence last week to apologize.\nDespite Flynn’s resignation, Republicans as well as Democrats called Tuesday for the investigation into his actions to continue.\nABC News’ Justin Fishel and Pierre Thomas contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "FBI interviewed Michael Flynn about his talks with Russian ambassador",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/fbi-interviewed-michael-flynn-talks-russian-ambassador/story?id=45495076"
}