{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:44:01+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Duke Coach Mike Krzyzewski Takes Leave to Have Back Surgery",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fduke-coach-mike-krzyzewski-takes-leave-back-surgery-44513535.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/duke-coach-mike-krzyzewski-takes-leave-back-surgery-44513535",
    "language": "en",
    "localpath": null,
    "maintext": "Hall of Fame Duke coach Mike Krzyzewski is stepping away from the team to have lower back surgery.\nThe school announced Monday that the procedure is scheduled for Friday, with an anticipated recovery time of four weeks.\nKrzyzewski will coach Wednesday night's game against Georgia Tech before handing off to associate head coach Jeff Capel for Saturday's home game against Boston College.\nKrzyzewski, 69, will have a fragment of a herniated disk removed at Duke University Hospital. The school says Krzyzewski tried several treatment options during the past month before deciding on surgery.\nKrzyzewski said in a statement that he consulted with the university's medical team and \"together, we have determined that surgery is the best course of action at this time.\" He says the Blue Devils will \"be in the capable hands\" of Capel and assistants Nate James and Jon Scheyer.\n\"As soon as the doctors clear me to do so, I look forward to returning and giving our team 100 (percent) of my energy and attention, which is certainly something that they deserve,\" he said.\nThe winningest men's coach in Division I history had four surgeries during the offseason to replace his left knee, repair his left ankle and fix a hernia. He squeezed those procedures into a busy summer in which he also led the U.S. Olympic team to the gold medal in Rio de Janeiro.\n\"To be sure, the entire Duke community is supportive and eager to get Mike back as soon as possible,\" Duke athletic director Kevin White said. \"His health is paramount, and he will get the best possible care in the world by the Duke medical team. With the proper recovery time, we look forward to Mike doing what he does best — leading and teaching — very soon.\"\nCapel — a former Duke guard who went 175-110 in nine years coaching at Virginia Commonwealth and Oklahoma — previously took over for Krzyzewski when he missed a trip to Georgia Tech last February because of dehydration and high blood pressure.\nThat victory in Atlanta marked the first time Krzyzewski did not travel with his team since the 1994-95 season, when he missed the final 19 games due to back surgery and exhaustion. Those Blue Devils went 4-15 during that span and became the last Duke team to miss the NCAA Tournament.\nMonday's announcement marks the latest twist in an already drama-filled season for a team voted No. 1 in the preseason on the strength of a lineup led by preseason AP All-American guard Grayson Allen and four immediate-impact freshmen.\nOn Saturday, the Blue Devils (12-2) were routed at Virginia Tech in the first game of Allen's indefinite suspension for tripping yet another opponent . And those freshmen — Harry Giles, Jayson Tatum, Marques Bolden and Frank Jackson — have played in the same game only three times because of various injuries.\nThe Blue Devils dropped three spots to No. 8 — their lowest ranking of the season — in the AP Top 25 released Monday .\n———\nThis story has been corrected to show that Krzyzewski, not Capel, will coach Wednesday night's game, which is against Georgia Tech, not Boston College.\n———\nMore AP college basketball: http://collegebasketball.ap.org and http://twitter.com/AP—Top25",
    "source_domain": "abcnews.go.com",
    "title": "Duke Coach Mike Krzyzewski Takes Leave to Have Back Surgery",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/duke-coach-mike-krzyzewski-takes-leave-back-surgery-44513535"
}