{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 01:52:38+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Faum-cult-members-face-execution-tokyo-subway-gas-53863162.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_30c06f7259f04324a65b29408a515446_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Japan? Add Japan as an interest to stay up to date on the latest Japan news, video, and analysis from ABC News. Add Interest\nThirteen Japanese cult members may be sent to the gallows any day now for a deadly 1995 gas attack on the Tokyo subway system and other crimes. But when is uncertain. Such is the secrecy that surrounds Japan's death penalty system.\nTuesday marks 23 years since members of the Aum Shinrikyo cult punctured plastic bags to release sarin nerve gas inside subway cars, sickening thousands and killing 13. Cult leader Shoko Asahara and a dozen followers have been sentenced to death for that and other crimes that killed 27 in all.\nThe relocation of seven of them to five detention centers outside of Tokyo last week has sparked speculation that executions could be imminent. In Japan, accomplices in a crime are customarily hanged on the same day. Ten of those on death row were convicted for the subway attack, a number beyond the Tokyo detention center's daily capacity.\nAs with all executions in Japan, when and where they will be killed isn't being released, even to family members and lawyers. The executions won't be announced until they have already happened.\nShizue Takahashi, the wife of a subway stationmaster who died in the gas attack, asked the Justice Ministry for a chance to meet the convicts and witness their executions. \"I want to follow through to the very end,\" Takahashi said at a recent news conference.\nHer wish is unlikely to be granted.\nEven prisoners sent to the gallows are not notified until guards come to their cells in the morning. After a chat with a chaplain, a last bite or smoke, the prisoner is taken to the gallows.\nIf all 10 subway attack convicts are hanged, it would be the second-largest number executed on a single day in Japan's modern history. Japan on Jan. 24, 1911, hanged 11 political prisoners who allegedly plotted to assassinate the emperor.\nSome survivors of the cult's crimes oppose the executions because that would eliminate hopes for a fuller explanation of the crimes.\nAsahara talked incoherently, occasionally babbling in broken English, during his eight-year trial and never acknowledged his responsibility or offered meaningful explanations.\nBorn Chizuo Matsumoto, he has been on death row for nearly 14 years. His family says he is a broken man, constantly wetting and soiling the floor in his cell and not communicating with his family or lawyers.\nHis 34-year-old daughter, Rika Matsumoto, said he doesn't understand his punishment and needs treatment so he can recover and talk. \"I just want to hear my father explain in his own words,\" she tweeted recently.\nSome of the condemned have expressed regret and contributed to anti-terrorism measures. Shoko Egawa, a journalist who has covered the cult's crimes from early on, has proposed keeping them alive so they can provide lessons to a world facing the growing threat of extremism.\nExperts on the cult also warn that if they are executed, the members would be glorified as martyrs by cult remnants, likely bolstering their worship of Asahara.\nFounded in 1984, the group attracted many young people, even graduates of top universities, whom Asahara hand-picked as close aides.\nThe cult amassed an arsenal of chemical, biological and conventional weapons to carry out Asahara's escalating criminal orders in anticipation of an apocalyptic showdown with the government.\nThe cult claimed 10,000 members in Japan and 30,000 in Russia. It has disbanded, though nearly 2,000 people follow its rituals in three splinter groups, monitored by authorities.\n———\nFollow Mari Yamaguchi on Twitter at www.twitter.com/mariyamaguchi\nFind her work at https://www.apnews.com/search/mari%20yamaguchi",
    "source_domain": "abcnews.go.com",
    "title": "Aum cult members face execution for Tokyo subway gas attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/aum-cult-members-face-execution-tokyo-subway-gas-53863162"
}