{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:45+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The major policy shift comes days before President Trump will announce his pick to replace Supreme Court Justice Kennedy, who upheld affirmative action.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Ftrump-announces-reversal-affirmative-action-admissions-56359928.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_palmeri_0712_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump announces reversal of affirmative action in admissions\nTo Washington and t-minus five days until president trump res his pick for the supreme urt. That's supposed to Happe Monday. A decision that couldreshape the courtor generation. In aor policy shift the admiration is moving to rol back affirve action bed on race in sch admissions, an issue where one supre court vote could make the difnce so to Tara Palmeri withuch more on this. , Good morning. Reporter: Good morning, Dan. Justice kendis DI has been the swing vote that's upheld the affirmattion policut now president trump has the chance to replace him with a justice who could overturn that ruling. As prent trump approaches his self-imposed July 9th deadline to announce hisupreme court pick -- I've spent the last three interviewing and thinking about supreme court justices such an INT decision and we're going to give you a gre one. Reporter: He's pushing ward witis conservative agenda. We'll hit a homeun here. Reporter: Rollingack firmative action guidelines from the oba era meant to promote diversity at ols. The trump administration N longer encoudmissions to take race into account. The rement of justice edy who upheld affirmative tion amid challenges in the supreme court gives trump the chance T choose atice who could overturn the ruling and has already Snith seven candidates included on the short list two women, judge Amy coney etof Indiana and judge Joan Larsen of Michigan. Bothrump appointees to the court of appeals.recently confirmed by congress. Taking center stage at joint confirmation hearing, ortion. I would be bound by the precedents of the supreme court. I agr with justice Larsen. Reporter: Judge coney Barrett getting the most attention, the Mo of seven children, one special needs and two adopted from ITI. Many conservatives have embraced her. But some Democrats have raised concerns the Jue's cat faith placed an tsized role inthe law. When you read your speeches, theonclusion one draw is that the dogma lives loudly within U. Reporter: White house officials tell me that outside groups haven lobbying for Amy coney Barrett over oth candidates because she's sn as a reliable vote to overturn roe rsus wade. Some of these groups are excited to spend millions during the confirm fight R andgainst pdent ump's supreme cot pick. All eyes O that pick on Monday. Thank you very much, Ta\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump announces reversal of affirmative action in admissions",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/trump-announces-reversal-affirmative-action-admissions-56359928"
}