{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:22:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "One-fifth of Americans find workplace hostile or threatening",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Famericans-find-workplace-hostile-threatening-49199513.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_6ca4bcb1e1184396ac94452454707a20_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The American workplace is grueling, stressful and surprisingly hostile.\nSo concludes an in-depth study of 3,066 U.S. workers by the Rand Corp., Harvard Medical School and the University of California, Los Angeles. Among the findings:\n— Nearly one in five workers — a share the study calls \"disturbingly high\" — say they face a hostile or threatening environment at work, which can include sexual harassment and bullying. Workers who have to face customers endure a disproportionate share of abuse.\n— Nearly 55 percent say they face \"unpleasant and potentially hazardous\" conditions.\n—Nearly three quarters say they spend at least a fourth of their time on the job in \"intense or repetitive physical\" labor. \"I was surprised at how physically demanding jobs were,\" says lead author Nicole Maestas, a Harvard Medical School economist.\n—Telecommuting is rare: 78 percent say they are required to be present in their workplace during working hours.\n—Only 38 percent say their jobs offer good prospects for advancement. And the older they get, the less optimistic they become.\n—About half say they work on their own time to meet the demands of their job.\n\"Wow — (work) is pretty taxing place for many people,\" Maestas says. \"I was surprised by how pressured and hectic the workplace is.\"\nIn many cases, less-educated workers endure tougher working conditions. For example, fewer than half of men without college degrees can take a break whenever they want to, compared to more than 76 percent of men with college degrees. Likewise, nearly 68 percent of men without degrees spend at least a fourth of their time moving heavy loads.\nMaestas wonders whether toxic working conditions are keeping Americans out of the labor force. The percentage of Americans who are working or looking for work — 62.9 percent in July — has not returned to pre-recession levels and is well below its 2000 peak of 67.3 percent.\nThe unemployment rate is at a 16-year low, and many employers complain they can't fill jobs.\n\"There's a message for employers here,\" Maestas says. \"Working conditions really do matter.\"\nNot everything about American workplaces is grim. Workers enjoy considerable autonomy: more than 80 percent say they get to solve problems and try out their own ideas. Moreover, 58 percent say their bosses are supportive, and 56 percent say they have good friends at work.\nThe first-time survey of Americans ages 25-71 was carried out in 2015. It is similar to a long-running European survey, and researchers plan to conduct another survey next year and eventually to draw comparisons between U.S. and European working conditions.",
    "source_domain": "abcnews.go.com",
    "title": "One-fifth of Americans find workplace hostile or threatening",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/americans-find-workplace-hostile-threatening-49199513"
}