{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 12:39:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Federer Wins 1st Match on Return; France Beats Germany",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ffederer-wins-1st-match-return-france-beats-germany-44509510.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/federer-wins-1st-match-return-france-beats-germany-44509510",
    "language": "en",
    "localpath": null,
    "maintext": "Roger Federer returned from six months on the sidelines because of a knee injury to beat Dan Evans 6-3, 6-4 on Monday and give Switzerland a 1-0 lead over Britain at the Hopman Cup mixed teams tournament.\nThe 17-time major winner missed the French Open last year, ending a run of 65 consecutive Grand Slam tournaments, and hadn't played competitively since re-injuring his surgically repaired left knee at Wimbledon. But he showed no signs of rust in his 61-minute win over Evans.\n\"I'd like to live it again. I'm a little bit sad it's over, because it was so nice out there,\" Federer said of his return. \"I was actually quite emotional. When I walked down, I was like, 'Oh my God, this is better than I thought it would be.'\"\nThe 35-year-old Federer said it was the kind of feeling he missed the most while he was sidelined.\n\"I thought for a first match it was great, because my expectations were obviously quite low.\"\nBelinda Benic was playing Heather Watson later Monday, aiming to give Switzerland an unbeatable lead ahead of the mixed doubles match.\nFrance beat Germany 2-1 in the earlier Group A match, with Richard Gasquet defeating Alexander Zverev 7-5, 6-3 and combining with Kristina Mladenovic to win the deciding mixed doubles, which is being played in the Fast4 format, 4-2, 4-1. Andrea Petkovic had earlier beaten Mladenovic 6-2, 6-1 in the women's singles.",
    "source_domain": "abcnews.go.com",
    "title": "Federer Wins 1st Match on Return; France Beats Germany",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/federer-wins-1st-match-return-france-beats-germany-44509510"
}