{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 06:41:43+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "US-based climate scientists to take research to France",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-based-climate-scientists-research-france-51731958.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_119d8ab5627b421b89b30e17a187ca96_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It is a dream come true for U.S.-based climate scientists — the offer of all-expenses-paid life in France to advance their research in Europe instead of in the United States under climate skeptic President Donald Trump, two of the winners say.\nAmerican scientist Camille Parmesan and British scientist Benjamin Sanderson are among the 18 initial winners, including 13 based in the U.S., who were named recipients of French President Emmanuel Macron's \"Make Our Planet Great Again\" climate grants.\nMacron congratulated the winners during a brief ceremony in Paris on Monday evening, ahead of a climate summit that gathers more than 50 world leaders in the French capital Tuesday.\nIn an interview with The Associated Press, Parmesan expressed elation at the prospect of spending the next five years doing her research in France instead of the United States.\nA scientist from the University of Texas at Austin, she is a leader in the field on how climate affects wildlife. She lived for a few years in the United Kingdom for family reasons and was considering returning to the U.S. until Trump's election.\n\"He very, very rapidly has been actively trying to erode science in the U.S.A. and in particular climate science,\" she said. \"And it's hard for two reasons: Funding is becoming almost impossible, and in a psychological sense.\"\nParmesan answered with enthusiasm Macron's appeal for climate researchers to come work in France, minutes after Trump's rejection of the Paris climate accord. \"It gave me such a psychological boost, it was so good to have that kind of support, to have the head of state saying I value what you do,\" she said.\nParmesan, who said she is looking forward to improving her French, will be working at an experimental ecology station in the Pyrenees mountains.\nSanderson, who also worked in the U.S., told the AP that he found it \"very reassuring\" that France is \"openly encouraging climate research.\"\nHe said his application was motivated by \"the fact that France is making a stand on prioritizing climate change research, but also it's increasingly hard to get research funding in the U.S.\"\nSanderson used to work at the National Center for Atmospheric Research in Boulder, Colorado, on risks and uncertainties under climate change. For the next few years, he will be living in Toulouse, in southern France, where the country's national meteorological service is based.",
    "source_domain": "abcnews.go.com",
    "title": "US-based climate scientists to take research to France",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/us-based-climate-scientists-research-france-51731958"
}