{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:39:33+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "US to help Cambodia preserve Khmer Rouge victims' belongings",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-cambodia-preserve-khmer-rouge-victims-belongings-51712528.json",
    "image_url": "http://abcnews.go.com/International/wireStory/us-cambodia-preserve-khmer-rouge-victims-belongings-51712528",
    "language": "en",
    "localpath": null,
    "maintext": "The U.S government has provided more than $55,000 to Cambodia for the preserving of personal items belonging to prisoners at a Khmer Rouge prison and torture center in the 1970s.\nThe project agreement was signed Monday by U.S. Ambassador to Cambodia William Heidt and Cambodian Secretary of State for Ministry of Culture and Fine Art Chuch Phoeurn. The funding aims to preserve and maintain 3,000 to 5,000 items of clothing, shoes, hats and belts belonging to prisoners who were detained at the Khmer Rouge's main Tuol Sleng prison facility.\nUnder the 1975-79 Khmer Rouge regime, an estimated 17,000 Cambodians were tortured at the center, known as S-21 prison, and then killed. An estimated 1.7 million Cambodians died from execution, starvation and inadequate medical care under the rule of the ultra-communist group.\nHeidt said the timing of the project is critical since the items are slowly deteriorating. The prisoners' belongings tell the extremely personal and heartbreaking stories of the victims of the Khmer Rouge and include clothing, hats and other items from both adults and children.\n\"If you look closely, you even can see that some items still show blood and sweat stains,\" Heidt said. \"The conservation work will carefully preserve the textiles without removing this historical evidence. Each piece carries its own history and we recognize how important it is to preserve this story for future generations.\"\nChuch Phoeurn welcomed the U.S. funding and said the preservation of the belongings is important because they can help educate young Cambodians. He said some of the items will be displayed at the Tuol Sleng Genocide Museum.",
    "source_domain": "abcnews.go.com",
    "title": "US to help Cambodia preserve Khmer Rouge victims' belongings",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/us-cambodia-preserve-khmer-rouge-victims-belongings-51712528"
}