{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 07:52:46+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Pick 6: Transfers outside of QB who could have big impact",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fpick-transfers-qb-big-impact-49221283.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_363055630f77418b9c2721bf559a43bb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chris James has waited long enough to take a handoff at Wisconsin.\nThe running back sat out a year after leaving Pittsburgh to move to Madison, looking for a better backfield opportunity.\nThat moment has finally arrived. James is part of this year's crop of Division I transfers who could make immediate impacts with their new teams.\n\"It's been such a long time coming,\" the eager James said.\nThe Badgers have had recent success with transfers, a run that started when quarterback Russell Wilson arrived from North Carolina State to lead the Badgers to the Rose Bowl in 2011.\n\"Biggest thing is, are they a fit? It goes back to Russell,\" said Wisconsin coach Paul Chryst, who was the team's offensive coordinator in 2011. \"We spent a lot of time ... with Russell getting to know him. Is this a good fit?\"\nJames certainly hopes so. The 5-foot-10, 219-pound junior ran for 437 yards and four scores on 87 carries as a freshman at Pitt in 2014. His workload decreased the following season, after Chryst left for Wisconsin.\nNow James could be in line for the starting job at Camp Randall Stadium with the top two rushers from last season. James is competing with sophomore holdover Bradrick Shaw.\nA look at other transfers — outside of quarterbacks — with the potential to make big impacts in FBS:\nNICK NELSON, CB, Wisconsin\nTeammates have raved about Nelson's potential as a cover corner. A junior who previously played at Hawaii, Nelson is poised to take over for four-year starter Sojourn Shelton at one of the cornerback positions. Nelson spent his redshirt season last year learning under secondary coach Jim Leonhard — now the defensive coordinator.\nJEFF BADET, WR, Oklahoma\nJust what the Sooners needed: a speedster on the outside for quarterback Baker Mayfield. Badet, a graduate transfer from Kentucky, also adds veteran experience and leadership to the locker room. He caught 31 passes for 670 yards last season for the Wildcats, including seven touchdowns.\n\"He's a guy that's able to track the ball really well, which is something you're either born with or you're not,\" Mayfield said.\nAARON COCHRAN, OL, Oklahoma State\nAn already-experienced Cowboys offensive line added a graduate transfer from California who has 16 career starts and protected productive quarterbacks Jared Goff and Davis Webb. Listed at 6-foot-8, 350 pounds, Cochran has already impressed coach Mike Gundy after arriving at camp, having lost 30 pounds, 10 more than what the coach had requested.\n\"And when we talk about experienced players, we're talking about guys that have played on the road in tough spots when it's hot and loud and everything is going against you, and they've still found ways to be successful,\" Gundy said.\nDARREN CARRINGTON, WR, Utah\nThe Utes are going up-tempo this year under new offensive coordinator Troy Taylor. Carrington, a graduate transfer from Oregon, has just the kind of experience that makes him a good fit in Salt Lake City. The 6-foot-2, 205-pound receiver had 43 catches for 606 yards and five touchdowns last season as a junior with the Ducks. He was dismissed by new Oregon coach Willie Taggart earlier this year after a DUI arrest.\n\"He creates separation. He's got big hands, huge hands. Incredible ball skills. He's a special guy,\" Taylor said.\nSUNNY ODOGWU, OL, UCLA\nAt 6-foot-7, 315 pounds, the graduate transfer from Miami gives the Bruins a potential anchor on a rebuilt offensive line. The Bruins are trying to boost what was the FBS' second-worst running game last year. Odogwu started five games last season with the Hurricanes before being sidelined by a lower leg injury.\nCARSON WISE, K, North Carolina State\nWise is moving from Division II Carson Newman, though he's worthy of mention since kickers don't often have the potential make a quick impact as a graduate transfer. The Wolfpack had a chance to beat eventual national champion Clemson last year on the road but missed a 33-yard field goal as time expired. Wise was 21 of 31 at Carson Newman with a career long of 49 yards.\n———\nMore AP college football: www.collegefootball.ap.org and www.twitter.com/AP—Top25",
    "source_domain": "abcnews.go.com",
    "title": "Pick 6: Transfers outside of QB who could have big impact",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/pick-transfers-qb-big-impact-49221283"
}