{
    "authors": [
        "Abc News",
        "Carolyn Durand",
        "More Katie",
        "More Carolyn"
    ],
    "date_download": "2018-04-24 18:02:05+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Kate delivered an 8 pound, 7 ounces son on April 23, 2018.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fprincess-kate-wows-hospital-exit-hours-delivering-3rd%2Fstory%3Fid%3D54685370.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/kate-prince-william-baby7-gty-ml-180423_hpMain_1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Nearly seven hours was all the time it took for Princess Kate to leave a London hospital after giving birth to her third child.\nInterested in Royal Family? Add Royal Family as an interest to stay up to date on the latest Royal Family news, video, and analysis from ABC News. Add Interest\nKate, 36, did not leave the hospital straight from a bed -- she checked out in style, dressed in a red Jenny Packham dress, nylons, heels and fully done makeup and hair.\nBen Stansll/AFP/Getty Images\n“She is the envy of women around the world that she’s able to do that,” ABC News royal contributor Victoria Murphy told “GMA.” “I think it’s testimony to the fact that she has a really good medical team, obviously looking after her well, making sure that the birth goes really well.”\nKensington Palace announced around 8:30 a.m., local time on Monday morning that Kate had been admitted to St. Mary’s Hospital in London “earlier this morning.” ABC News understands she and William arrived at the Lindo Wing of St. Mary's Hospital before 6 a.m.\nKate gave birth to her 8 pound, 7 ounce son -– the highest birth weight royal baby in more than a century –- at 11:01 a.m., local time, according to Kensington Palace.\nBy Monday night, Kate was back home at Kensington Palace with William and their two older children, Prince George, 4, and Princess Charlotte, who turns 3 next week.\nLeaving the hospital so soon after giving birth is safe as long as there is proper support at home, according to ABC News chief medical correspondent Dr. Jennifer Ashton, also a practicing OB-GYN.\nHannah Mckay/Reuters\n“I think we have to distinguish here between the future Queen of England and the average woman,” Ashton said on “GMA.” “It can be safe, the key is support and follow up.”\nDoctors monitoring Kate, like any woman, soon after giving birth would be looking for potential post-delivery risks like bleeding, infection, high blood pressure and depression, according to Ashton.\n“We have to remember that even though this happens every single day in all types of environments, this is a major event,” she said of the birth process.\nIn 2015, Kate left St. Mary’s Hospital less than 10 hours after delivering her second child, Charlotte. Kate delivered Charlotte after just two-and-a-half hours of labor.\nPaul Treadway/Barcroft Media via Getty Images\nWhen Kate delivered George in 2013, she stayed in the hospital just one night.\nNeil P. Mockford/Getty Images\nAs for her glam look, Kate had the assistance of her longtime stylist, Natasha Archer Jackson, who was spotted leaving St. Mary’s Hospital on Monday, and her personal hairdresser, Amanda Cook Tucker.\nBut just because Kate is home from the hospital, it doesn’t mean she will immediately return to her normal activities.\n“As long as there is monitoring and support … it’s fine,” Ashton said. “This is not a situation where you’re going to have a woman go home and start taking care of the other children she has at home, cooking meals etc.”\nWelcome to the family. pic.twitter.com/nKSd5kh5bZ — Kensington Palace (@KensingtonRoyal) April 23, 2018\nWilliam and Kate currently have the help of a nanny, Maria Teresa Turrion Borrallo, among others.\nWilliam is also expected to take paternity leave to bond with the newborn and help Kate, as he did after the births of George and Charlotte.\nPrince George and Princess Charlotte arrive at St Mary’s to meet their little brother. pic.twitter.com/rfX9rsdJhU — Kensington Palace (@KensingtonRoyal) April 23, 2018\nMaternal care in the U.K. is also different from that in the U.S., according to Ashton.\n“They put a lot of the focus on the mom, where we put a lot of the focus on the baby,” she said. “There is incredible support and it is standardized care. So they do it the same exact way, like a military submarine, every single time.”\nThere is dedicated support for women, after birth.\n“They use midwives over 50 percent of the time so the mother is really supported,\" Ashton added, \"not just during pregnancy and delivery, but postpartum.”",
    "source_domain": "abcnews.go.com",
    "title": "Princess Kate wows with hospital exit 7 hours after delivering 3rd child",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/princess-kate-wows-hospital-exit-hours-delivering-3rd/story?id=54685370"
}