{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:41:37+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Frfk-funeral-train-show-kennedys-final-journey-photos-54687938.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/WireAP_8d12589da4444cd8aad552d88c40697e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The assassination of Robert F. Kennedy Jr. 50 years ago this June fractured the nation just two months after the assassination of Martin Luther King, Jr. and five years after his brother John F. Kennedy was killed.\nBut RFK's funeral, particularly the train that took his body from a memorial service in New York City to his resting place at Arlington National Cemetery in Virginia, brought the country together in a new, unprecedented way: An estimated 2 million ordinary Americans spontaneously gathered beside railroad tracks to honor him as the train passed by.\nAn exhibit at the San Francisco Museum of Modern Art, \"The Train: RFK's Last Journey,\" displays 21 of the 1,000 unique color slides made by photographer Paul Fusco on June 8, 1968. The images captured America's grief in a way that was unusual in photography, by seeing the events through the eyes of ordinary people.\nThe photos show Americans of all colors and classes. Catholic schoolgirls, field hands, firemen, blue-collar workers and housewives in their bonnets create a tableau of those who came to say farewell to the man many knew simply as \"Bobby.\"\nSome climbed fence posts to get a better view. Some saluted. Others stood rock-ribbed straight. Some waved American flags or handmade posters: \"So Long Bobby.\" Others turned from work to see what all the fuss was about as the maroon train car holding his coffin rolled by.\nFusco, at the time a staffer for Look magazine, made the images from his unique position aboard the funeral train en route to Arlington. He said he was astonished when the train emerged from a New York City tunnel to see hundreds of people gathering beside the tracks. At times he used a panning motion to isolate certain people and scenes, creating a blur around the edges of the images.\nThe exhibit also shows the importance of the day for those who were there, through a collection of personal images sought out by Dutch artist Rein Jelle Terpstra, who became fascinated with Fusco's photos and launched a research project in 2014 to collect pictures and films from the observers who watched the funeral procession go by. Among the most striking is a carefully labeled photo album collage decorated with red, white and blue construction paper.\nThe moving exhibit also includes a 70 mm film reconstruction of the day by French artist Philippe Parreno, complete with the haunting sound of a train clacking through fields and cities.\nSo many people came to say goodbye to Bobby Kennedy on June 8, 1968, that the train slowed and the journey took nearly twice as long as usual, nearly eight hours to travel a typically four-hour route.\nKennedy, a U.S. senator from New York, was running for president and had just won the California primary when he was shot at the Ambassador Hotel in Los Angeles by Sirhan Sirhan. Kennedy died June 6, 1968.\n\"RFK's Last Journey\" is on display at the museum through June 10.",
    "source_domain": "abcnews.go.com",
    "title": "'RFK Funeral Train' show: Kennedy's final journey in photos",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/rfk-funeral-train-show-kennedys-final-journey-photos-54687938"
}