{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:49:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Plea agreement reached for friend of San Bernardino gunman",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fplea-agreement-reached-friend-san-bernardino-gunman-45503246.json",
    "image_url": "http://abcnews.go.com/US/wireStory/plea-agreement-reached-friend-san-bernardino-gunman-45503246",
    "language": "en",
    "localpath": null,
    "maintext": "A plea agreement from the only person to be criminally charged in the San Bernardino terror attack drew mixed emotions from the victims' loved ones.\n\"It's a hell of a day to come out, Valentine's Day,\" said Mandy Pifer, whose boyfriend Shannon Johnson was killed in the 2015 shooting.\nEnrique Marquez Jr., 25, of Riverside, agreed to plead guilty Tuesday to providing the high-powered rifles used to kill 14 people and injure nearly two dozen others and to plotting a mass killing with the gunman Syed Rizwan Farook that they never carried out, court records say.\nPifer said despite the tough timing of the deal she's \"relieved that it won't be a long trial. If it'll be finished sooner, I'm all for it.\"\nShe said she planned to speak at Marquez's sentencing about the impact her boyfriend's killing has had on her. In his last moments, Johnson huddled with a colleague under a table, shielding her from the bullets.\n\"It is what it is,\" she said. \"Nothing's going to bring him back.\"\nFarook and his wife, Tashfeen Malik opened fire on his co-workers on Dec. 2, 2015, and were later killed in a gunfight with authorities.\nProsecutors said Marquez acknowledged being a \"straw buyer\" when he purchased two AR-15 rifles from a sporting goods store that were used in the attack at the Inland Regional Center in San Bernardino. Prosecutors have said Marquez agreed to buy the weapons because the attackers feared Farook's Middle Eastern appearance might arouse suspicion. Prosecutors said there is no evidence Marquez participated in the San Bernardino massacre or had advance knowledge of it.\nMarquez also admitted to plotting with Farook in 2011 and 2012 to massacre college students and gun down motorists on a gridlocked California freeway, though those attacks never occurred.\nFederal officials said the duo had envisioned halting traffic on state Route 91 with explosives and then firing at trapped motorists, or tossing pipe bombs into a crowded cafeteria at Riverside City College.\nMarquez said he backed out of the plot after four men in the area about 60 miles inland from Los Angeles were arrested on terrorism charges in late 2012, the FBI has said in court documents.\n\"While his earlier plans to attack a school and a freeway were not executed, the planning clearly laid the foundation for the 2015 attack on the Inland Regional Center,\" U.S. Attorney Eileen M. Decker said Tuesday.\nMarquez, who could face up to 25 years in prison, is scheduled to appear before a federal judge on Thursday. His attorney didn't immediately respond to messages seeking comment.\nMarquez and Farook first met in 2005 after Marquez moved next door to Farook's family in Riverside, about 55 miles east of downtown Los Angeles, officials said. The then-teens would meet in Farook's garage and Farook, a Muslim, began educating his new friend about his religion. Marquez converted and became a Muslim in 2007.\nThe FBI said the two began discussing extremist views shortly after Marquez converted. By late 2011, Marquez spent most of his time at Farook's home, where he read Inspire magazine, an official publication of al-Qaida in the Arabian Peninsula; watched videos produced by al-Qaida's affiliate in Somalia; and studied radical material online, federal officials said.\n———\nAssociated Press writer Amanda Lee Myers contributed to this report.\n———\nFollow Michael Balsamo on Twitter at http://twitter.com/MikeBalsamo1.",
    "source_domain": "abcnews.go.com",
    "title": "Plea agreement reached for friend of San Bernardino gunman",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/plea-agreement-reached-friend-san-bernardino-gunman-45503246"
}