{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:14:57+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Power Rankings: Columbus Blue Jackets remain the class of the league, with Wild close behind",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fpower-rankings-columbus-blue-jackets-remain-class-league%2Fstory%3Fid%3D44514763.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_nhl_pwr_rankings_576x324_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "I'm back behind the controls of the good ship Power Rankings. Feels good. Natural. Right. So let's set the power rankings record straight as we sail into 2017 and the league closes in on the midpoint of what has been an unpredictable season so far.\nAll you have to do to secure the top spot in the rankings is win 15 consecutive games -- which the surprising Blue Jackets have done, capped by a key road win on New Year's Eve over almost-as-hot Minnesota in the State of Hockey.\nThe Wild won 12 in a row before running into the buzz saw that is the Blue Jackets. Still, Wild coach Bruce Boudreau's squad hit Jan. 1 one point behind Chicago for the Central Division lead (with three games in hand) and owns the top winning percentage in the Western Conference.\nWith all the attention -- richly deserved -- focused on Columbus, it's been easy to forget just how good Pittsburgh has been. Led by the league's top goal-scorer,? Sidney Crosby , the Pens went 12-1-2 in December and their 17 home wins are tops in the league.\nThe Rangers are cooking once again, riding a three-game win streak. Their 13 road wins rank first in the NHL -- which is always a good barometer of what separates the contenders from the pretenders\nCaptain? Alex Ovechkin ?keeps rolling toward 1,000 points and the Capitals picked up points in 11 of 15 December games as they try to keep Columbus, Pittsburgh and the Rangers within sight in the Metro Division.\nThe Blackhawks, bitten by the injury bug again, plateaued a bit as they prepared to kick off 2017 with an outdoor tilt against division rival St. Louis at Busch Stadium. Chicago has won just once in its last five games.\nThe Sharks -- whose nine December wins vaulted them to the top of the Pacific Division standings -- are making life difficult for Edmonton, Anaheim and Calgary. Brent Burns continues to lead all defensemen with just under a point a game.\nThe Habs hit 2017 -- and a trip back to Nashville for defenseman Shea Weber ?-- tracking a little sideways, with just two wins in their last six outings. But the Canadiens still enjoy a comfortable lead atop the Atlantic Division and rank fifth in the league in both goals-for and goals-against per game.\nThe Blues are hoping that hosting their first outdoor game will help reverse a trend that has seen them struggle through the final days of 2016. St. Louis won just six of its 14 December games.\nThe Oilers have been very good on the road this season (10-5-5), but much less successful (9-7-2) in their shiny new home in Edmonton. So it's not necessarily a bad thing that the Oilers kick off '17 with four on the road -- although they'll have their hands full in Columbus on Tuesday.\nThe Ducks began a five-game homestand with a shootout win over Philadelphia on Sunday, vaulting them into second place in the very crowded Pacific Division. Given how ordinary the Ducks have been on the road (8-8-6), they'd better take advantage of that home ice at the Honda Center.\nMikael Backlund is on fire and now leads the Flames with 11 goals as Calgary has moved into the top wild-card spot in the Western Conference. They still give up too much -- the Flames rank 20th in goals allowed per game -- but have rebounded nicely after a grisly start to the season.\nThe Kings continue to be very much in the playoff discussion. Jeff Carter ?is leading the way with 20 goals, including seven game-winners. Imagine what will happen if? Anze Kopitar (three goals) gets going and Jonathan Quick gets healthy.\nThe 'Canes have their work cut out for them vis a vis the playoffs, but they have gone 5-2-1 in their last eight games and boast the league's top penalty-killing unit. Carolina has been exceptional at home and brutal on the road. It plays back to back in St. Louis and Chicago this week.\nIt wasn't that long ago that the Flyers were the toast of the NHL as they reeled off 10 wins in a row. Oops. The Flyers have gone 1-4-2 since that streak. They're dropped to the second wild-card spot in the Eastern Conference and are in danger of falling out of the playoff picture altogether.\nDon't look now, but the Leafs have won five in a row after? Auston Matthews' dramatic, OT winner in the Centennial Classic on Sunday outdoors in Toronto. Surely it's too soon for this young Leafs team to be a realistic playoff threat. Isn't it?\nThe Senators are just kind of meh, middle-of-the-road in the most important statistics-- and yet they continue to surprise by holding onto a playoff berth in the Atlantic Division. I honestly don't see that lasting much longer.\nThe Bruins, like Ottawa, are hanging around in the mediocre Atlantic in spite of an off season statistically for three-time Frank J. Selke Trophy winner Patrice Bergeron . Excellent penalty killing and the solid play of goalie? Tuukka Rask ?has helped.\nThe Lightning are getting healthier and Ondrej Palat and Nikita Kucherov are helping to keep their otherwise disappointing team within hailing distance of the playoffs. No Ben Bishop puts more pressure on netminder? Andrei Vasilevskiy ?-- although the latter has shown that he can handle the spotlight.\nThe Predators won just four of 14 games in December and will be without P.K. Subban for at least a couple more weeks. Nashville remains much in the playoff picture in the Central Division, but the Preds need to show more consistency if their preseason hype is to be fulfilled. The might want to start on Tuesday, when they welcome Shea Weber home.\nThe Stars keep waiting to turn the proverbial corner, but even with improved play they still lack the consistency needed to be a playoff team. If captain and emotional catalyst Jamie Benn , who was banged up in a New Year's Eve loss to Florida, is lost to injury for any length of time it could end Dallas' playoff hopes.\nEvery time I want to heap some more dirt on the Canucks they throw together an impressive stretch of hockey. Like now. In spite of an ugly minus-20 goal differential, Vancouver has won three in a row and remains in the hunt.\nJaromir Jagr , second all-time in NHL scoring, keeps chugging away. The rest of the moribund Panthers? Not so much. The defending Atlantic Division champs have not won three in a row all season. Good thing they fired their coach, though.\nThe Jets aren't very good at home, where they used to be dominant, and are worse on the road. It's pretty hard to make the playoffs that way. I have to think that ownership is getting a bit antsy about a team that is allowing just a hair under three goals a game.\nThe Wings showed plenty of heart in coming back outdoors in Toronto on New Year's Day to at least grab a loser's point for the overtime loss. But Detroit's offense is still pop gun on most nights and its power play, 0-for-3 on Sunday, is dead last in the league.\nThe Islanders, who waived netminder Jaroslav Halak last week, are actually playing their best hockey of the season. That they remain 13th in the Eastern Conference and have a league-low four road wins tells you all you need to know about their wasted season.\nThe Sabres are tied with Arizona for 29th in goals per game in the NHL and haven't won more than two games in a row since the first week of November. These have been hard times under the Pegula family for pro sports teams in Buffalo, with the Bills once again sitting out the NFL playoffs.\nInjuries are an issue for the Devils, but most hockey folks thought this team would be much better than the one that managed just four wins in 15 December games and fell out of the playoff race in the Eastern Conference. The most shocking stat? New Jersey is 27th in goals allowed per game. Ouch.\nTough times in the desert for Dave Tippett's young crew. This team may not be ready for prime time, but they should be better than they've shown this season.\nThe Avalanche and their league-worst minus-48 goal differential and league-low 25 points are a tire fire. When does ownership take enough interest to make meaningful changes?",
    "source_domain": "abcnews.go.com",
    "title": "Power Rankings: Columbus Blue Jackets remain the class of the league, with Wild close behind",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/power-rankings-columbus-blue-jackets-remain-class-league/story?id=44514763"
}