{
    "authors": [
        "Abc News",
        "More Evan"
    ],
    "date_download": "2018-05-30 22:58:32+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The viral #WhereAreTheChildren hash tag got details of story wrong, but also brought focus onto a marginalized community.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fwherearethechildren-showcases-power-pitfalls-social-media%2Fstory%3Fid%3D55507540.json",
    "image_url": "https://s.abcnews.com/images/International/caravan-us-border-01-as-gty-180429_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hundreds of thousands of Twitter users erupted in outrage over Memorial Day weekend around the hash tag #WhereAreTheChildren - generating more than 350,000 tweets about the tangled story of the fate of children detained at the U.S.-Mexico border.\nInterested in Immigration? Add Immigration as an interest to stay up to date on the latest Immigration news, video, and analysis from ABC News. Add Interest\nMany social media users got key details of the story wrong, yet drove attention to the plight of migrant families detained at the southern U.S. border.\nThe rapid spread of the #WhereAreTheChildren hashtag showcased an emerging social media paradox - the ability to generate advocacy around issues affecting marginalized communities, while simultaneously disseminating inaccurate information.\nDespite being based on month-old news reports, the narrative took off on social media last week that in April U.S. Department of Health and Human Services officials had told Congress that the agency \"was unable to determine with certainty the whereabouts of 1,475 unaccompanied alien children.”\nThe children were detained as unaccompanied minors at the U.S.-Mexico border and placed with sponsors within the United States.\nBut follow-up attempts failed to locate “with certainty” 1,475 of the children -- triggering fearful speculation that some of the minors may have been sold into human trafficking.\nThat narrative pre-dated a newly-announced and highly-controversial policy in early May in which ICE agents would separate children carried illegally into the United States from their undocumented immigrant parents.\n“If you are smuggling a child, then we will prosecute you and that child will be separated from you as required by law,” Attorney General Jeff Sessions announced at a press conference in early May on the new policy.\nThe Trump administration has pushed back against the characterization of the children as \"lost.\"\nThe \"lost\" story received scant attention until the end of last week, when it surfaced on Twitter amid growing concern over the Trump administration's new policy of separating children from parents at the border.\nMany appeared to misunderstand the story to mean that in the process of separating undocumented immigrant children from their parents at the border – a current Trump administration policy – ICE officials has taken the migrant children from their parents and then “lost” hundreds and hundreds of them.\nThe #WhereAreTheChildren hash tag emerged, and was rapidly amplified by liberal activists, Democratic lawmakers, celebrities and more.\nAt its peak on Saturday evening, the hash tag was being tweeted 35,000 times per hour.\nBut as the trend metastasized, the two plot lines merged, with many tweets conflating the HHS statement about having lost track of migrant children previously detained as unaccompanied minors with immigration agents currently tasked with separating children and parents.\nRipping young children away from their mothers is already beyond horrifying. But having some of the children sold into human trafficking is the greatest injustice this administration has ever done. It is a crime against humanity. #WhereAreTheChildren — Eugene Gu, MD (@eugenegu) May 26, 2018\n.@IvankaTrump, you are lucky to hold your son while 1500 mothers cannot, because your father ripped their children away under a vicious policy that he created. Ivanka, #WhereAreTheChildren? https://t.co/xKYAbdEyse — Paola Mendoza (@paolamendoza) May 27, 2018\n.@realDonaldTrump, will you please stop separating children from their families? We are begging you as a nation to do the right thing. #WhereAreTheChildren — Alyssa Milano (@Alyssa_Milano) May 27, 2018\nKids— kids that are my own kids' age, and younger— are being forcibly ripped from their parents & lost in the system. We ask #WhereAreTheChildren, but we should also be asking, \"Where is our humanity?\" because as a nation, we seem to have lost both. https://t.co/eODZ4fzMlz — Misha Collins (@mishacollins) May 26, 2018\nAs the hash tag grew, so did notice that the original story took a month to gain traction online. One conservative outlet called the online reaction “fake news.”\nYet just as quickly as the criticism came the corrections, as experts and others weighed in with context and additional information.\nGood morning, everyone! I’m seeing a lot of tweets about how 1,475 children “taken from their parents” were lost by HHS. That’s wrong. Most children sent to HHS—before last fall, ALL children sent to HHS—arrived in the US as unaccompanied minors. — Dara Lind (@DLind) May 25, 2018\nOne explanatory Twitter thread which warned those tweeting that inaccurate attention to the story could produce unintended consequences - from strategist Josie Duffy at the non-profit Fair Punishment Project - was retweeted tens of thousands of times.\nRice's thread became one of the most viral of the hundreds of thousands of tweets associated with the hash tag. The correction to the story was the most widely-shared aspect of it.\nNow that we’re all on twitter because of this game, I am making a public service announcement: PLEASE STOP SHARING THAT STORY ABOUT 1500 KIDS MISSING. The outrage I’ve seen is a result of a total misinterpretation and could SERIOUSLY threaten the children you want to save. — josie duffy rice (@jduffyrice) May 28, 2018\nThere are two things going on. 1) HHS doesn’t know where 1500 unaccompanied minors are. 2) we are separating parents and children at the border. — josie duffy rice (@jduffyrice) May 28, 2018\nOne analogy I heard from my dear friend who I won’t tag without her permission, is that ORR is basically a jailer. Do you want the jail keeping track of where every former inmate is? — josie duffy rice (@jduffyrice) May 28, 2018\nSome on Twitter were quick to follow up their previous tweets with new information, showing that social media's role in spreading incorrect information can sometimes be matched by its real-time capacity for self-correction:\nThis is helpful thread because a lot of people, myself included, have conflated the \"missing\" kids w/ those who have been separated from their parents at the border. https://t.co/68cm1m0au4 — Donut Seductress (@VeeCeeMurphy76) May 28, 2018\nMeanwhile, anger over the story of the \"lost\" children also fed into a social media frenzy as multiple images of conditions in which apprehended migrant children are kept -- one of migrant children apparently kept in a cage, another of a private prison bus outfitted for children -- went viral.\nBoth images were real, but both were eventually revealed to be from photos taken during the Obama administration, undermining their use as online criticisms of the Trump administration's immigration policies.\nWriter Sean McElwee, who has been actively pushing to abolish ICE on social media since the early days of the Trump administration, suggested that growing online efforts to resist the immigration agency's mandates under the current administration may have led some to conflate two negative stories about U.S. immigration policies.\n\"One of the successes of the 'Abolish ICE' movement is that people associate it quite negatively with separating parents from children,\" McElwee told ABC News.\nMcElwee realizes that it's a mixed blessing.\n\"I think that people immediately made the logical leap - and that is a testament to the power of 'Abolish ICE,' but also one thing that can go wrong with social media.\"\nMcElwee and others have pushed \"Abolish ICE\" -- or, in its hash tag version, #AbolishICE -- consistently as the Trump administration's border and deportation efforts have escalated.\nHe said he has sensed the powerful impact of social media in a growing interest from activists in opposing the organization, and more Democratic candidates supportive of defunding ICE.\n\"For better or worse, the people who create the hash tag content, the leads into politics that all these lawmakers consume,\" McElwee said.\nMcEwlee told ABC that the viral images revealed to have been taken during the Obama administration only underline how the institutional power of ICE transcends presidential administrations.\n\"People need to understand: if Trump is gone, ICE is still going to be there,\" McElwee said. \"It's still going to be the same institution with the same people.\"\nSure enough, the #WhereAreTheChildren hash tag, even if it began amid confusion, is already being translated into action.\nTexas congressman Joaquin Castro announced over the weekend that he would organize a rally to bring attention to the children.\nHis feed is now filled with news of rallies springing up around the country, as the advocacy sparked by the hashtag begins to outlast it:",
    "source_domain": "abcnews.go.com",
    "title": "#WhereAreTheChildren showcases the power and the pitfalls of social media",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/wherearethechildren-showcases-power-pitfalls-social-media/story?id=55507540"
}