{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 21:11:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Arkansas judge barred from execution cases after protest",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Farkansas-judge-barred-execution-cases-protest-46849393.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_06d6bc66bbf148b28a2a62e019b5bd69_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A judge who lay on a cot as though he were a condemned man on a gurney after issuing an order halting Arkansas' multiple execution plan was barred Monday from taking up any death penalty-related cases and referred to a disciplinary panel.\nThe state Supreme Court reassigned the cases from Pulaski County Circuit Judge Wendell Griffen days after he participated in the anti-death penalty demonstration outside the governor's mansion. Griffen's protest has sparked outrage among death penalty supporters, including Republican lawmakers who described it as judicial misconduct and potential grounds for Griffen's removal from the bench.\n\"To protect the integrity of the judicial system this court has a duty to ensure that all are given a fair and impartial tribunal,\" the court said in its two-page order. Justices also referred Griffen to the state Judicial Discipline and Disability Commission to consider whether he violated the code of conduct for judges.\nGriffen did not immediately return a message Monday seeking his reaction to the high court's order. He has said he's morally opposed to the death penalty and that his personal beliefs alone shouldn't disqualify him from taking up certain cases. For years, he has been pushing the boundaries of how much a judge can speak out on controversial issues.\n\"We have never, in my knowledge, been so afraid to admit that people can have personal beliefs yet can follow the law, even when to follow the law means they must place their personal feelings aside,\" Griffen told The Associated Press on Saturday.\nOn Friday, Griffen granted a restraining order preventing Arkansas from using its supply of vecuronium bromide, one of three drugs it uses in executions, because the supplier said the state misleadingly obtained the drug. The state has appealed the ruling, which blocked a plan to execute eight men in 11 days in four double executions, starting Monday night.\nLawmakers have suggested the move may be grounds for the Arkansas House to begin impeachment proceedings, saying the demonstration and a blog post Griffen wrote on the death penalty last week may amount to \"gross misconduct\" under the state constitution.\n\"He is outside the bounds of normal behavior for most judges probably anywhere in America,\" Republican state Sen. Jason Rapert said.\nThe Judicial Discipline and Disability Commission confirmed Monday an investigation of Griffen is pending following the state Supreme Court referral. Griffen, who served 12 years on the state appeals court, previously battled with the judicial discipline panel over remarks he made criticizing President George W. Bush and the war in Iraq. The panel ultimately dropped its case against him.\nGriffen testified before the state Legislature in 2015 against a religious objections measure that was criticized as anti-gay, and he regularly blogs about current events in posts that weave in Biblical passages. They include a post days before his ruling that criticized the execution push in Arkansas.\n\"While the world meditates about divine love, forgiveness, justice, and hope, Arkansas officials plan to commit a series of homicides,\" he wrote.\nGriffen, 64, is a Baptist minister who was first elected as Pulaski County judge in 2010. He ran twice unsuccessfully for state Supreme Court — including a bid for chief justice in 2004. In his other state Supreme Court race in 2006, Griffen challenged his rival to a debate over the free-speech rights of judges.\nGriffen said he wouldn't consider a person's participation in an anti-execution event enough, on its own, to warrant disqualifying a juror from a death penalty case. The question, he said, is whether the juror could set his or her personal views aside and follow the law.\n\"We do not require people to come into court with blank slates, either in their minds or their heart,\" he said Saturday.\n———\nFollow Andrew DeMillo on Twitter at https://twitter.com/ademillo",
    "source_domain": "abcnews.go.com",
    "title": "Arkansas judge barred from execution cases after protest",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/arkansas-judge-barred-execution-cases-protest-46849393"
}