{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 21:53:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Suspended Doug Martin at Bucs' facility for offseason program",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsuspended-doug-martin-bucs-facility-offseason-program%2Fstory%3Fid%3D46849825.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170417_NFL_Winston_doug_martin_short_stop_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "TAMPA, Fla. -- Buccaneers running back Doug Martin was at the team's facility Monday for the start of the offseason program, general manager Jason Licht confirmed.\nThe two-time Pro Bowler left the team with one game remaining last season to begin serving a four-game suspension for performance-enhancing substances and to enter a drug treatment program. League rules permit him to participate in the offseason program, training camp and the preseason, but he will miss the first three games of the regular season.\n\"He looks great right now; he looks as good as I've seen him since I've been here, from a physical standpoint,\" Licht said. \"He was in very good spirits. We're excited to have him, excited to see how he does out here in OTAs.\"\n\"It's good to see him. It's good to see him looking good physically,\" Licht said. \"[He's] in good spirits, it seems like the trajectory is going up.\"\nWith the NFL draft looming, Licht acknowledged that this next week and a half is critical for Martin to assert his place with the team.\nThe Bucs have worked out and met with a number of top running back prospects, including, most recently, Florida State's Dalvin Cook, a projected first-round pick (and possibly in the top 10), along with Texas' D'Onta Foreman and Oklahoma's Joe Mixon.\n\"We can't answer all the questions in 10 days but it's good to see him here,\" Licht said of Martin. \"It's good to see him. It's been good to see that he's been working his butt off.\"\nBecause he violated terms of his contract, the Bucs are no longer obligated to pay Martin the $7 million he was guaranteed for 2017. Licht said that the team's decision regarding him will not be financially motivated.\nHe also emphasized that the team is in no rush to make a decision on Martin and could actually wait to make a decision on him after the season begins, when Martin returns from serving his suspension.\nQuarterback Jameis Winston was asked about the \"uncertainty\" of Martin's situation.\n\"Well I'm very certain of Doug Martin. He's an amazing player. He battled some injuries last year but to this team, he means the world,\" Winston said. \"We loved seeing him out there [today], seeing Doug be Doug ... it was good to see him out there, good to see his spirits up -- I know he's going to have a great year for us.\"\nAdded defensive tackle Gerald McCoy: \"Nothing has changed for us. He's part of the family. Doug is Doug. We love Doug. Doug has an energy level that you guys miss seeing that he brings to this team in private. It's great to have him in the building.\"",
    "source_domain": "abcnews.go.com",
    "title": "Suspended Doug Martin at Bucs' facility for offseason program",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/suspended-doug-martin-bucs-facility-offseason-program/story?id=46849825"
}