{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 08:27:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Four Loco: NHL plays 4 OT playoff games in crazy night",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Floco-nhl-plays-ot-playoff-games-crazy-night-46856134.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_372ee5c7bd2f482198f3e49986f821d8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In Toronto, Tyler Bozak's tip-in put a charge into the Air Canada Centre. Ditto with Nashville when the Predators scored in OT for another win over Chicago.\nThey had some extra fun in Boston and Calgary, too, before Ottawa and Anaheim finally broke through.\nThere are few thrills quite like overtime playoff hockey, and the NHL hasn't had a night with this sort of excitement in more than 30 years. All four postseason games Monday went to OT for the first time since April 10, 1985, according to the Elias Sports Bureau. The only other time it happened before that was April 11, 1980.\n\"Those are the most fun games to play, definitely\" Bozak said.\nThere's been fun to go around in these playoffs.\nEleven of 24 postseason games have gone to overtime in the first round, including all three games between Toronto and Washington and two between Ottawa and Boston. All eight first-round series have included at least one OT finish. The record for an entire postseason is 17 overtime games in 2013.\nAnd with underdogs like Nashville, Toronto and St. Louis threatening early upsets, these playoffs are getting an extra boost.\n\"It was a 10,\" Predators coach Peter Laviolette said of the atmosphere Monday. \"I'm not sure there's another place like it.\"\nNashville got its win behind a backhand goal from 20-year-old Kevin Fiala 16:44 into OT, the longest game of the night. Fiala and teammates Mike Fisher and James Neal jumped together into the end boards to celebrate a 3-0 series lead over the top-seeded Blackhawks.\nThe quickest end came in Calgary, where Anaheim stunned the Flames. Perry scored 90 seconds into extra time, helping the Ducks rally from three-goals down to win — a first in the team's postseason history. Around the Saddledome, fans in red sweaters threw up their arms in frustration before quietly making their way to the exits.\nBoston's TD Garden crowd didn't disperse so easily. Bobby Ryan's winner came on the power play following a disputed roughing call against the Bruins' Riley Nash, and fans rained boos on the officials and threw items onto the ice in protest.\nAnd then there's the party in Toronto, which hadn't hosted a playoff game since 2013. Bozak's goal 1:37 into overtime, putting the Leafs ahead of Washington 2-1 in their first-round series. Bozak celebrated by jumping on Nazem Kadri, who passed the puck to set up the winner, and then the pair was mobbed by the rest of the squad.\n\"It's a lot of emotion,\" Bozak said. \"You just want to be with your teammates and celebrate.\"\n———\nMore AP hockey: https://apnews.com/NHLhockey",
    "source_domain": "abcnews.go.com",
    "title": "Four Loco: NHL plays 4 OT playoff games in crazy night",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/loco-nhl-plays-ot-playoff-games-crazy-night-46856134"
}