{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:45:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "10 Things to Know for Tuesday",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2F10-things-tuesday-51729240.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_e1570c1b841b42eca9006a43cc095e03_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about Tuesday:\n1. PIPE BOMB EXPLODES IN NYC SUBWAY\nThe only serious wounds from the blast during the morning rush hour are to the suspected bomber himself, who authorities say was inspired by Islamic State extremists.\n2. WHAT FINAL PITCH ROY MOORE IS MAKING TO VOTERS\nOn the eve of the Senate election, the Alabama Republican casts himself as the victim of a national barrage of unjust allegations of sexual misconduct with teenagers.\n3. #METOO SPOTLIGHT TURNS TO TRUMP\nSeveral women urge Congress to investigate their claims of sexual misconduct against the president, and a number of Democratic lawmakers demand his resignation.\n4. HOW PUTIN IS CELEBRATING MOSCOW'S DEEPENING MIDEAST TIES\nThe Russian president declares \"victory\" in Syria during a surprise visit to a military base there, then travels to Egypt and Turkey, highlighting his country's expanded reach.\n5. WIND-FANNED WILDFIRE FLARES ANEW\nAsh falls like snow and heavy smoke forces residents to gasp for air as a Southern California wildfire spreads alarmingly, becoming the fifth largest in state history\n6. WHICH RESEARCHERS HAVE HIT THE JACKPOT\nEighteen climate scientists from the U.S. and elsewhere are awarded millions of euros in grants to relocate to France for the rest of Trump's presidential term.\n7. PENTAGON OPENS DOOR TO TRANSGENDER RECRUITS\nTransgender individuals will be allowed to enlist in the military beginning Jan. 1, after Trump's ordered ban suffers another legal setback.\n8. WORLDWIDE, AN ECONOMIC UPTURN\nThe U.N. says the global economy is growing by about 3 percent — its highest rate since 2011 — and a significant acceleration from last year.\n9. CELEBRITY CHEF STEPS AWAY FROM RESTAURANT EMPIRE\nThe move comes after Mario Batali says that reports of sexual misconduct \"match up\" to his behavior.\n10. STAR QB SUFFERS SEASON-ENDING INJURY\nThe Eagles' Carson Wentz, a favorite in the NFL MVP race, has a torn left ACL and will miss the rest of the season and the playoffs.",
    "source_domain": "abcnews.go.com",
    "title": "10 Things to Know for Tuesday",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/10-things-tuesday-51729240"
}