{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 08:45:34+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "N. Korea skaters draw applause during Olympic practice",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fkorea-skaters-draw-applause-olympic-practice-52812470.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_0de0a055ada442a3828d4b4d1a1cec26_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A pair of smiling North Korean skaters carried out lifts, death spirals and other difficult moves during practices ahead of the Winter Olympics, drawing applause from South Korean spectators at Gangneung Ice Arena on Saturday.\nThe duo, Ryom Tae Ok and Kim Ju Sik, is the focus of intense media attention as they were the only North Korean athletes who were initially qualified to compete in the Pyeongchang Games before their Olympic committee missed a confirmation deadline. The International Olympic Committee later allowed them and 20 other athletes to compete in the Feb. 9-25 games in special entries given to the North as it worked out a set of Olympics-related rapprochement deals with South Korea.\nUnlike many other North Korean athletes who looked serious and rarely answered reporters' questions, the duo appeared more natural and often smiled when they practiced and passed through a mixed zone — an area where athletes go through after games or training.\nRyom, who turned 19 on Friday, already got the nickname \"angel of smile\" by some South Korean media outlets, after she waved and smiled broadly when she arrived at the Gangneung athletes' village on Thursday evening.\n\"I feel good,\" she told reporters in brief comments after training with Kim in the second practice at the venue since their arrival in South Korea.\nDozens of reporters, photographers and TV crews watched them perform at the Gangneung Arena's underground training site. Volunteer workers and organizing committee staff, many of them South Koreans, also watched the duo's practice, giving them a round of applause at least twice during about an hour-long session.\n\"It's good that everyone is welcoming us like this,\" the duo's North Korean coach, Kim Hyon Son, told reporters.\nLater Saturday, North Korean short-track speed skater Jong Kwang Bom practiced at the arena's main ice rink. His sole teammate Choe Un Song didn't show up, apparently due to an ankle injury during his first practice in Gangneung on Friday. Their coach told reporters it was up to Choe to decide whether to compete in the games after watching his condition.\nThe Koreas are in a rare Olympics-inspired reconciliation mood after a year of heightened animosities over North Korea's advancing nuclear and missile programs. They agreed to form a single women's hockey team and have their athletes to parade together in the Feb. 9 opening ceremony. The North also plans to send a 230-member cheering group and a 140-person art troupe to the South during the games.\nPyeongchang, a relatively small ski resort town, will host the ski, snowboard and sliding events during the Olympics. Gangneung, a larger coastal city about an hour's drive away, will host the skating, hockey and curling events.\nSome experts see the North's cooperation in the South Korean-hosted Olympics as an attempt to use improved inter-Korean ties as a way to weaken U.S.-led international sanctions against North Korea.\nOn Saturday, two members of the North's official Olympic delegation were found to have come to South Korea despite having no IOC-issued accreditations.\nUnder an IOC-brokered deal, North Korea was supposed to send a 46-member group composed of 22 athletes and 26 coaches, officials and journalists. But the North has so far sent 47 people to South Korea, and Seoul's Unification Ministry said two of the 47 have not been accredited by the IOC.\nThis means the North still has one more IOC-accredited figure to send to South Korea, and ministry officials said they expect the North to send that person along with non-Olympic delegations next week. According to a ministry statement, the two came to South Korea late last month with 12 female hockey players and their male coach who have formed a joint team with South Korean players.\nSouth Korean officials say they view the two as support staff though some social media and online message boards speculated they might be security agents assigned to prevent North Korean athletes and others from interacting too much with foreigners or possibly defecting to South Korea.\nObservers say the North might have already added security agents to the IOC-accredited delegation by disguising them as sport officials or journalists. They say it's highly unlikely for North Korean athletes or members of the cheering group or art troupe to defect while in the South. They are mostly from relatively affluent families and a defection would make their relatives in the north face possible reprisals.\nThe wife of North Korean leader Kim Jong Un, Ri Sol Ju, was part of a cheering group that visited in 2005 during the Asian Athletics Championships in Incheon.\nDuring a previous era of inter-Korean detente, North Korea also sent big delegations to South Korea when its rival hosted major international sports and other events. But none from those North Korean delegations defected, though about 30,000 North Koreans have chosen to flee to South Korea for political and economic reasons since the end of the 1950-53 Korean War, according to Seoul's Unification Ministry.",
    "source_domain": "abcnews.go.com",
    "title": "N. Korea skaters draw applause during Olympic practice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/korea-skaters-draw-applause-olympic-practice-52812470"
}