{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:34:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Talia Duff's classmates raised over $55,000 to help find cure for rare progressive disease.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2F6th-graders-fellow-student-raise-money-family-foundation-51727800.json",
    "image_url": "http://a.abcnews.com/images/WNT/171211_wn_muir1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 6th-graders help fellow student raise money for family foundation\nFinally, America strong. The sixth grade girl and her entire school behind her. It's Kathy Sims sixth grade math class in Massachusetts. What was the total per jar? Reporter: With jars of cookie dough, her students have learned an important lesson about coming together to help one of their own. Talia duff was born with a Progressive disease known as cmt4-j. Gene therapy may one day prove to be the cure. But doctors need a million dollars to take it to the next phase. Per classmates wanted to help her family's foundation in their fight. Selling those jars filled with cookie dough. I've been friends with Talia for so long. Every second of it has been a joy. Reporter: The children have raised more than $55,000, but they're not done. We had to do something, something much bigger than selling cookie jars. Reporter: The entire sixth grade, 160 students, 17 teachers, coming together to make this video that they hope will go viral and raise money. If everyone gives a little, then Talia and others like her will benefit a lot. Reporter: Performing for do F MARIA: Impact weather on the way. Take a look at the radar. You can see it heading toward Massachusetts. Some of us under a winter weather advisory. Good evening. I'm MARIA stephanos. Ed: And I'm Ed Harding. We will be dealing with this wintry mix during the morning\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "6th-graders help fellow student raise money for family foundation",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/6th-graders-fellow-student-raise-money-family-foundation-51727800"
}