{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 00:18:51+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Mark your calendars! The must-see home game for all 30 NBA teams",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmark-calendars-home-game-30-nba-teams%2Fstory%3Fid%3D49217025.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170814_nba_haberstroh_on_hayward_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Now that the NBA has released the full schedule for the 2017-18 season, we can dive into which matchups carry the most intrigue. Because let's face it: Not all 1,230 games are equally exciting.\nWith that in mind, we've chosen one home game for every team that looks -- on paper -- worthy of circling on our calendars.\nAtlantic Division\nBoston Celtics\nThe Wizards' first trip to Boston this season promises to entertain. The Celtics and Wizards have grown a healthy distaste for one another over the past two years, and it culminated last year during the Celtics' second-round win over Washington. The series went seven games and featured physical confrontations and fiery rhetoric. Expect more of the same in the regular season. -- Ian Begley\nVs. Cavaliers (Monday, Nov. 13 ): The Knicks are playing for the future, so there don't figure to be many must-see games at Madison Square Garden this season. But with the future in mind, it will be fun for fans to see the Cavaliers come to town. First off, there's Kyrie Irving, who has told friends that he'd like to be traded to New York, among other destinations. Then there's the return of Derrick Rose, the point guard Knicks management showed little interest in re-signing after his lone season in New York. And LeBron James always puts on a show at the Garden.? -- Ian Begley\nPhiladelphia 76ers\nVs. Timberwolves (Saturday, March 24):?If Joel Embiid, Markelle Fultz and Ben Simmons remain healthy, there should be plenty of exciting nights in Philadelphia this season. One that comes to mind: when the Timberwolves come to town in March. NBA junkies should probably circle this night on the calendar as the last four No. 1 overall picks share the floor in Philly -- Fultz, Simmons, Karl-Anthony Towns and Andrew Wiggins -- but Embiid facing off against Towns is reason enough to tune into this one.? -- Ian Begley\nToronto Raptors\nVs. Cavaliers (Thursday, Jan. 11): Toronto doesn't have a natural geographical rival, no deep-seeded ill will between the Raptors and another NBA franchise. But there's been a constant road block in front of Kyle Lowry, DeMar DeRozan and the Raptors over the past few seasons: LeBron James and the Cavaliers. Cleveland has knocked Toronto out of the playoffs for two straight seasons. That's what makes the Cavs' visit a stand-out night in Toronto. It will be Lowry & Co.'s first opportunity to measure themselves against the top team in the Eastern Conference.? -- Ian Begley\nBrooklyn Nets\nVs. Lakers (Friday, Feb. 2):?Lakers President Magic Johnson had some pointed criticism for point guard D'Angelo Russell days after executing a trade that sent Russell to Brooklyn. Johnson said the Lakers needed \"a leader\" and someone who \"players want to play with\" after jettisoning Russell. Ouch. It's safe to assume that Russell will have some extra motivation when the Lakers come to Brooklyn. He'll also be facing off against Lonzo Ball -- the player who made Russell expendable in L.A. -- Ian Begley\nCentral Division\nCleveland Cavaliers\nVs. Warriors (Monday, Jan. 15):?This game against the Warriors -- along with the rivals' Christmas Day matchup -- is one everyone always wants to see. It's the series the league expects to see at the end of the year -- and has for three consecutive Finals. The intensity always gets turned up when these two teams face off and that won't change any time soon. This game means more to both teams than most regular season games do. -- Nick Friedell\nVs. Thunder (Wednesday, Dec. 13 ): The atmosphere inside Bankers Life Fieldhouse will be rocking when Paul George comes back to Indianapolis for the first time as a member of the Thunder. Will he receive more boos or cheers? Either way, there will be a lot of emotion surrounding the All-Star's return. George and Russell Westbrook will be fun to watch each time they step on the floor. -- Nick Friedell\nChicago Bulls\nVs. Timberwolves (Friday, Feb. 9 ): Jimmy Butler and Taj Gibson return to the United Center with the Timberwolves in what figures to be a raucous environment. The fact that they'll do so with Tom Thibodeau leading the way against a rebuilding Bulls team is sure to tug at some fans' heartstrings. This is the Bulls' only scheduled national TV game (ESPN) of the season. -- Nick Friedell\nDetroit Pistons\nVs. Hornets (Wednesday Oct. 1 8): After close to three decades playing in The Palace of Auburn Hills, the Pistons open up their new downtown digs against the Hornets. Little Caesars Arena will surely be full of pageantry on opening night as the Pistons look to climb back into the playoff picture this season behind big man Andre Drummond. -- Nick Friedell\nMilwaukee Bucks\nVs. Warriors (Friday, Jan. 1 2): Any time Kevin Durant and Giannis Antetokounmpo fce off, it's worth the price of admission. Watching Stephen Curry, Klay Thompson and Draymond Green perform in their only Milwaukee appearance of the year isn't bad either. The Bucks want to take another step in their evolution as a contender in the Eastern Conference this season, and beating the Warriors at home is one of the best ways for this young group to garner even more attention. -- Nick Friedell\nSoutheast Division\nWashington Wizards\nVs. Celtics (Thursday, Feb. 8):?The Eastern Conference's chippiest rivalry returns to the nation's capital for the first time since these two teams engaged in a seven-game slugfest in the East semifinals last season. To spice things up, the Celtics added their own Morris twin (Marcus) but Kelly Oubre will have to find someone new to beef with now that Kelly Olynyk is in Miami. Tempers seem likely to flare regardless of new faces. --?Ohm Youngmisuk\nAtlanta Hawks\nVs. Nuggets (Friday, Oct. 27):?Visits from former Hawks All-Stars have become commonplace in recent seasons in Atlanta. This past summer, Atlanta elected to let Paul Millsap walk away following four All-Star seasons with the team. After signing with Denver, Millsap expressed disappointment in the lack of interest from a Hawks team that no longer has any of its four All-Stars from the 2014-2015 season (Millsap, Al Horford, Jeff Teague, Kyle Korver). -- Ohm Youngmisuk\nCharlotte Hornets\nVs. Lakers (Saturday, Dec. 9):? Dwight Howard should always be motivated against the Lakers, but the real curiosity here is whether LaVar Ball, father of No. 2 pick Lonzo Ball, elects to make the trip east for Los Angeles' lone Charlotte visit. Back in March, Ball claimed he would have \"killed\" Hornets owner Michael Jordan in 1-on-1. Jordan responded recently by saying he'd beat LaVar with just one leg. The Kemba Walker-Lonzo Ball matchup will be fun to watch regardless of MJ-LaVar shenanigans. -- Ohm Youngmisuk\nMiami Heat\nVs. Celtics (Saturday, Oct. 28):?Miami gets an early look at Gordon Hayward in a Boston uniform after being unable to lure the prized free agent to South Beach this summer. The other storyline here is Kelly Olynyk playing his first game against the team that drafted him after signing a four-year, $50 million contract with Miami this summer. - - Ohm Youngmisuk\nOrlando Magic\nVs. Raptors (Wednesday, Feb. 28):?Looking for a jump-start, the Magic hired former Raptors GM Jeff Weltman as their president of basketball operations this summer (giving up a second-round draft pick to do so). He made a handful of under-the-radar signings in adding Arron Afflalo, Jonathon Simmons, Shelvin Mack and Marreese Speights. The two teams also remained intertwined from last season's trade that sent Serge Ibaka to Toronto, while Orlando signed? Bismack Biyombo?away from the Raptors in the summer of 2016. -- Ohm Youngmisuk\nPacific Division\nGolden State Warriors\nVs. Cavaliers (Monday, Dec. 25): While the Cavaliers' telenovela-like turmoil dominated this summer, the Warriors enjoyed the spoils of being the champs with several players traveling the globe. Heck, Steph Curry even found time to work on his LeBron James workout moves to Kyrie Irving's delight, and Kevin Durant told a Twitter follower LeBron isn't better than him. So, as if a rematch of the last three NBA Finals wasn't enough reason to watch, there's plenty more petty reasons to watch Steph, KD and the gang welcome LeBron back to the Bay. -- Chris Haynes\nLos Angeles Lakers\nVs. Kings (Tuesday, Jan. 9): While we are eagerly anticipating D'Angelo Russell's return to L.A. and the guard reminding Magic Johnson exactly what he traded away this summer, the matchup we're more excited about is Lonzo Ball versus De'Aaron Fox. The Lakers-Kings rivalry might be rejuvenated by this point guard rivalry-in-the-making. The two played twice in college with Fox dominating in their last encounter in the NCAA tournament. The confident Fox is eager to show that Magic made a mistake passing him up for Ball with the second overall pick. When the two were supposed to play each other in the Las Vegas Summer League in July, the Lakers held Ball out due to a groin injury. Fox initially tweeted a \"facepalm\" emoji when the injury news broke before later deleting it. Fox would later tell reporters that he did not believe Ball was ducking him. While both the Kings and Lakers are rebuilding, Ball versus Fox should be incredibly fun to watch this seasons and potentially for years to come. -- Chris Haynes\nLA Clippers\nVs. Rockets (Monday, Jan. 15): When we last saw Chris Paul in the playoffs, he walked off the Staples Center floor with another stinging early-round exit. But this time, the Game 7 first-round loss to the Utah Jazz proved to be his final game as a Clipper. Paul was traded to Houston and the Clippers began a rebuild around Blake Griffin. Now Paul returns to L.A. with James Harden by his side and Mike D'Antoni's high-octane offense. It could be a long night for Paul's L.A. replacement, Milos Teodosic. -- Chris Haynes\nSacramento Kings\nVs. Pelicans (Thursday, Oct. 26): The Return of Boogie. DeMarcus Cousins has been waiting for this day to come since he was traded during All-Star Weekend to New Orleans, telling The Undefeated's Marc Spears in August: \"I can't wait. Oh my God. I can't wait ... I just got a lot to get off my chest.\" That doesn't bode well for the Kings and Vlade Divac. -- Chris Haynes\nPhoenix Suns\nVs. Cavaliers (Tuesday, March 13): Not long after news of Kyrie Irving's trade request emerged, the Suns were linked to the Cavaliers in potential landing spots for the All-Star point guard. James Jones, LeBron's friend and teammate, now is the Suns' VP of basketball operations. And Eric Bledsoe worked out with James in Las Vegas this summer. Bledsoe was linked to Cleveland in Irving trade rumors with rookie Josh Jackson being a rumored stumbling block to any potential deal. If Irving isn't dealt before these two teams meet, the Cavs might want to get a closer look at Bledsoe and other Suns in Phoenix. -- Chris Haynes\nNorthwest Division\nUtah Jazz\nVs. Celtics (Wednesday, March 28): The \"Stayward\" campaign wasn't enough to keep Gordon Hayward from leaving Utah after seven seasons and reuniting with his college coach Brad Stevens in Boston. The former Jazz All-Star will make his return to Vivint Smart Home Arena with just a few weeks left in the season, which will ramp up in intensity as this will not only be an emotional reunion, but could be a critical game for the Jazz's playoff positioning. The Celtics will likely be in a battle for the top seed in the East, so don't expect them to roll over either, as they'll likely play even harder to make sure that Hayward leaves Utah victorious. -- Adam Reisinger\nOklahoma City Thunder\nVs. Warriors (Wednesday, Nov. 22): For the rest of his career, every time Kevin Durant plays in Oklahoma City as a visitor, the game is bound to be fraught with emotion -- just look at what happened for the four seasons LeBron James played in a Heat jersey in Cleveland (or the three seasons since that he's played in a Cavs jersey in Miami). But this matchup has added drama this year, and not just because the Thunder made a big move in the offseason to try to close the gap between them and the Warriors. There have already been rumblings that Golden State will pursue Paul George in the offseason, so the Thunder will want to show George -- both on and off the court -- that OKC is the place he should be. -- Adam Reisinger\nVs. Knicks (Tuesday, March 6): As of this moment, Carmelo Anthony is still a New York Knick, despite the very public recruiting efforts of Damian Lillard and? CJ McCollum. If Anthony is still a Knick by the time New York visits Portland in March, then it could make for an awkward on-court situation. On the other hand, if Anthony does finally agree to waive his no-trade clause and accept a trade to the Blazers, then this could very quickly turn into another of the NBA's many notable reunion games in 2017-18, one where Melo would get to show off his new home to his old teammates. -- Adam Reisinger\nDenver Nuggets\nMinnesota Timberwolves\nFor years the Nuggets have had one of the best home-court advantages in the NBA. Not only is the Pepsi Center a mile above sea level, but the NBA would frequently schedule teams to play there on a back-to-back coming off a game in the Pacific Time Zone. The combination of the high altitude plus the opponent losing an hour to travel the night before resulted in plenty of \"schedule wins\" for the Nuggets. However, this year there is only one such games on Denver's home slate, and it's against the defending champs, who'll play a game in Sacramento on Feb. 2 that tips off at 8:30 p.m. Mountain Time, then fly to Denver and take the court for 7:00 p.m. MT on Feb. 3.? -- Adam Reisinger\nVs. Cavaliers (Monday, Jan. 8): Kyrie Irving apparently wants to be a Timberwolf, to play alongside his buddy Jimmy Butler. Kevin Love used to be a Timberwolf, but now has \"no complaints\" about his life in Cleveland. Andrew Wiggins was once a Cavalier (sort of) but was traded to the Timberwolves and now tries to make Cleveland pay any chance he gets (29.8 PPG in six career meetings). This game is dripping with drama, and we haven't even mentioned LeBron James or Karl-Anthony Towns, who are just two of the best players to watch in the league. -- Adam Reisinger\nSouthwest Division\nSan Antonio Spurs\nVs. Cavaliers (Tuesday, Jan. 23): There aren't many better individual matchups than Kawhi Leonard vs. LeBron James, a pair of perennial MVP candidates with championship pedigrees. The All-NBA forwards have played 20 games against each other in their careers -- including a couple of Finals meetings -- with Leonard's Spurs winning a dozen of them. LeBron's lone Alamo City appearance last season was ugly: a 29-point loss in which Leonard was plus-30 in 30 minutes. -- Tim MacMahon\nHouston Rockets\nVs. Warriors (Thursday, Jan. 4): The Rockets' offseason roster renovation was about positioning themselves to put up a fight against the Warriors. James Harden, Chris Paul & Co. will get first crack at the Warriors in opening night in Oakland, but it's probably not wise to reach grand conclusions if a team that made major changes struggle against an elite opponent in the first game of the season. (Kevin Durant and the Warriors didn't exactly look like a juggernaut while being blown out by the Spurs in last season's opener.) However, a home win over the Warriors would certainly help people see Houston as a legitimate threat to the loaded defending champs. -- Tim MacMahon\nMemphis Grizzlies\nVs. Kings (Friday, Jan. 19): Zach Randolph might as well be the mayor of Memphis after eight seasons of gritting, grinding and getting buckets for the Grizzlies and giving his heart to the community. Emotions will be through the FedEx Forum roof when Randolph, whose No. 50 will hang from the rafters soon after he retires, returns for the first time. Z-Bo never wanted to leave Memphis, but the Grizzlies wouldn't come close to matching the two-year, $24 million offer he accepted from the Kings.\nRandolph is widely respected as one of the NBA's toughest players, but it's a good bet that he will shed some tears on this night. ( Vince Carter, who spent the last three seasons with the Grizzlies, will also get a warm welcome back.) -- Tim MacMahon\nNew Orleans Pelicans\nVs. Nuggets (Wednesday, Dec. 6): The Pelicans' pair of DeMarcus Cousins and Anthony Davis form unquestionably the most skilled, talented center/power forward combination in the NBA. A strong argument can be made that Denver has the next best big duo with Nikola Jokic and his new Nuggets frontcourt partner Paul Millsap. These teams could also end up competing for a playoff spot at the end of the season, adding a little extra importance to their head-to-head meetings. -- Tim MacMahon\nDallas Mavericks\nVs. Lakers (Saturday, Jan. 13): Dennis Smith Jr. is Lonzo Ball's biggest threat in the Rookie of the Year race, according to the ESPN Forecast panel. The lotto-pick point guards' meeting in the Las Vegas Summer League lived up to entertainment expectations. With all due respect to Dirk Nowitzki, a still-productive legend nearing his career's finish line, Smith is the primary buzz source for Mavs fans who hope the high-flyer can speed up the franchise's rebuilding process. Early indications are that Ball, in part due to the one-man hype machine known as his dad LaVar, will fill seats in arenas around the league. -- Tim MacMahon",
    "source_domain": "abcnews.go.com",
    "title": "Mark your calendars! The must-see home game for all 30 NBA teams",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/mark-calendars-home-game-30-nba-teams/story?id=49217025"
}