{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:26:00+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "LEADING OFF: Yanks go for 9th straight, Thames on homer run",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fleading-off-yanks-9th-straight-thames-homer-run-46852824.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_cc30f7df5f7a4a5695cfeecab04bf6ff_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A look at what's happening all around the majors Tuesday:\n———\nBRONX BOOM\nThe Yankees aim for their ninth straight win when Luis Severino (1-0, 4.50 ERA) takes the mound against the visiting White Sox. The 23-year-old righty struck out 11 Tampa Bay hitters over seven innings in his last start and has fanned 17 in 12 innings this season after winning back a rotation spot in spring training. Miguel Gonzalez (1-0, 4.22) is up for Chicago.\nBREWER BOPPER\nMilwaukee newcomer Eric Thames has tied a franchise record by homering in five straight games. He connected Monday night against Cubs righty John Lackey and can set the club mark when the Brewers are back at Wrigley Field.\nThames matched the homer streak by Jeromy Burnitz for the Brewers in 1997. At 30, he is back from the playing in Korea and in the majors for the first time since 2012 with Seattle and Toronto. The major league record for consecutive games with a homer is eight by Ken Griffey Jr., Don Mattingly and Dale Long.\nAPRIL POWERS\nBrad Ausmus seems to have the magic touch early in the season. Detroit has stormed to the top of the AL Central standings early in each of his four years as manager, including an 8-4 start to 2017. The team's young starting pitchers have been excellent so far, a group led by Michael Fulmer (1-0, 2.25), who will start at Tampa Bay. The Tigers have won each of Fulmer's first two starts, including when he shut out Boston over six innings in his first outing.\nLET'S GO\nAfter a lot of winter talk about speeding up, the average time of a nine-inning game in the major leagues increased 5 minutes to 3:05 during the first two weeks of the season. The Pirates and Cardinals help cut that down Monday night, taking only 2 hours, 14 minutes as St. Louis won at home.",
    "source_domain": "abcnews.go.com",
    "title": "LEADING OFF: Yanks go for 9th straight, Thames on homer run",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/leading-off-yanks-9th-straight-thames-homer-run-46852824"
}