{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:59:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "In '47 Meters Down,' Moore and Holt embrace uncharted waters",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2F47-meters-moore-holt-embrace-uncharted-waters-48030674.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_9656f04e95344fc196bcad287f34546d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Mandy Moore spent six weeks at the bottom of a London pool trapped inside a steel cage, hyperventilating and screaming while filming the underwater thriller \" 47 Meters Down .\" It wasn't all called for in the script.\nCountless \"what ifs\" played out in her mind: What if her air suddenly cut out? What if her scuba equipment wasn't properly attached?\n\"It hadn't really been done before, so no one really knew the ramifications of spending that much time underwater,\" Moore, 33, said.\nIn total, Moore said she and her co-star Claire Holt spent 95 percent of production underwater for \"47 Meters Down,\" which arrives in theaters Friday more than two years after it was shot.\nMoore and Holt, 29, play sisters who try escaping their everyday problems by going on a Mexican vacation. They party, they argue and they go shark diving in a rickety cage. The cable suddenly breaks loose, sending them plummeting 154 feet to the ocean floor.\nIn reality the actresses only descended 20 feet down to reach the bottom of that London pool. But as Moore will tell you, that's still 20 feet underwater.\n\"It wasn't lost on us that we're breathing underwater and that is not normal,\" Moore said.\nMuch like their characters, Moore and Holt were running out of air the moment they dived in. Director Johannes Roberts said it sped up shooting. They had a fixed amount of time until each air tank emptied and production stopped.\nUnlike their characters, Moore and Holt were not dealing with actual sharks or darkness in the deep ocean.\nHowever, communication was an issue for all. In the film, the sisters were too deep for radio frequencies, leaving them unsure if help was on the way.\nOn set, Roberts directed on dry land, only audible to Moore and Holt through underwater speakers. They couldn't even communicate with the underwater crew who wore special scuba diving masks different than their costume versions.\nSo Moore and Holt looked to one another for guidance to both finesse their performances and remain calm.\nHolt said they didn't have to try too hard to act frightened — the strenuous production did that for them.\n\"We knew our characters more, what facial expressions worked and what didn't,\" she said.\nUnease wasn't just reserved for the actresses. It became something of a theme for the film off-screen as well.\nBefore the film's theatrical release, a bigger competitor emerged in the Blake Lively shark thriller \"The Shallows.\"\n\"47 Meters Down\" headed for different territory, opting for a straight to video release.\nRoberts learned about the changes, including a new title, \"In the Deep,\" from a horror film website. He and \"47 Meters Down\" co-writer Ernest Riera were already working on a new script in Spain, and Roberts told his creative partner he never wanted to speak of the film again.\nThe underwater production, lengthy editing and the video release had all took their toll on the director. \"It's a brutal job,\" Roberts said. \"How you deal with it, is badly.\"\nHowever things changed again. \"The Shallows\" did better than expected at the box office, earning over $55 million, according to comScore. A new distributor, Entertainment Studios, stepped in and set the film for a wide release.\n\"It showed there's a market for it,\" Roberts said, an admitted shark movie aficionado.\nMoore and Holt said they haven't seen \"The Shallows,\" though Holt said she read the script.\nShe noted they're distinct films, and \"47 Meters Down\" is not just a shark movie, she said.\n\"It's about being trapped underwater, running out of air with nowhere to go. You can't go up; you'll get the bends,\" Holt said. \"You don't know where you are. You don't know if anyone is coming for you.\"\nThe film's unconventional journey to theaters has coincided with a career resurgence for Moore, who stars in the hit NBC series \"This is Us.\"\nHolt is part of \"The Vampire Diaries\" franchise on the CW, most recently appearing in the spinoff \"The Originals.\"\nThey're proud of the hard work shooting \"47 Meters Down,\" especially those days spent underwater. As for the film's distribution woes and delayed premiere, that's the last thing on their minds.\n\"As actors, it's really important for us just to appreciate the experience,\" Moore said. \"That's the only thing we're in control of.\"\n———\nFollow Joseph Longo on Twitter: www.twitter.com/josephlongo—",
    "source_domain": "abcnews.go.com",
    "title": "In '47 Meters Down,' Moore and Holt embrace uncharted waters",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/47-meters-moore-holt-embrace-uncharted-waters-48030674"
}