{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:03:34+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmeek-mill-released-prison-sports-world-uproar%2Fstory%3Fid%3D54703068.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0424/dm_180424_Yates_on_Julio_Jones1143/dm_180424_Yates_on_Julio_Jones1143_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Pennsylvania Supreme Court has ordered that rapper Meek Mill be immediately released from prison on bail.\nThe Philadelphia-born rapper, whose real name is Robert Rihmeek Williams, has been fighting for his release while appealing a two- to four-year sentence for a probation violation.\nHis controversial incarceration has drawn response from the sports community. New England Patriots owner Robert Kraft visited Mill at a state prison in Pennsylvania earlier this month and later called for criminal justice reform.\n\"It's really bad. I know some of our players in the NFL have talked about this. I see it firsthand. It's just wrong,\" Kraft said then. \"We have to find a way to correct it and also help the community help themselves. It's just sad. This guy is a great guy. Shouldn't be here. And then think of all the taxpayers here paying for people like this to be in jail and not out being productive.\"\nPhiladelphia 76ers co-owner Michael Rubin has been one of Mill's biggest supporters. He tweeted Tuesday that he was on his way to pick up the rapper from prison. The Sixers host the Miami Heat on Tuesday night in Game 5 of their first-round playoff series.\nSaid Mill on Twitter:\n\"I'd like to thank God, my family, and all my public advocates for their love, support and encouragement during this difficult time. While the past five months have been a nightmare, the prayers, visits, calls, letters and rallies have helped me stay positive.\n\"To the Philly District Attorney's office, I'm grateful for your commitment to justice. I understand that many people of color across the country don't have that luxury and I plan to use my platform to shine a light on those issues.\n\"In the meantime, I plan to work closely with my legal team to overturn this unwarranted conviction and look forward to reuniting with my family and resuming my music career.\"\nMill was jailed in November 2017 for violating his probation by failing a drug test, traveling out of the region and getting arrested for fighting and other related offenses.?A team of lawyers and public relations consultants had waged a battle to get Mill freed on bail ever since.\nProsecutors say they believe Mill should get a new trial because of questions raised about the credibility of his arresting officer.",
    "source_domain": "abcnews.go.com",
    "title": "Meek Mill to be released from prison after sports world uproar",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/meek-mill-released-prison-sports-world-uproar/story?id=54703068"
}