{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 08:04:59+00:00",
    "date_modify": null,
    "date_publish": "2018-05-29 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frights-group-syrias-property-law-discourages-return-55500109.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_76ef0eb5632e4d38bc0ca7a0f5c90e27_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Syrian government is passing laws to allow itself to seize private property, displace residents, and discourage refugees from returning, Human Rights Watch said in a new report published Tuesday.\nThe New York-based group says a 2018 property law, known as Law 10, empowers authorities to confiscate property without compensating the owners or giving them an opportunity to appeal.\nThe Syrian Government passed Law 10 in April to create \"redevelopment zones\" to rebuild property damaged in seven years of civil war.\nIn an interview with the Greek newspaper Kathimerini this month, President Bashar Assad said the law allows authorities to \"re-plan the destroyed and the illegal areas,\" and said it does not \"dispossess anyone.\"\nA third of Syria's housing has been destroyed in the last seven years, according to Human Rights Watch. The World Bank says Syria has suffered close to $300 billion in material damage through its war.\nThe government has responded to the challenge in part by authorizing local governments to create public-private partnerships to take ownership of damaged neighborhoods and redevelop them.\nUnder law 10, residents have just 30 days to prove they own property in the redevelopment zones in order to receive shares in the projects, or the ownership will be transferred to the local government.\nHuman Rights Watch says there are numerous obstacles keeping residents from making claims to their properties in the 30-day window. It says many owners are displaced Syrians or refugees and cannot return to their local districts for fear of arrest. Many lack the identification documents that would allow relatives to make claims on their behalf. Only about half of Syrian property was registered with authorities before the war, and many registries were destroyed in the fighting.\nMore than 11 million Syrians have been displaced by war, including more than 5 million who fled across the country's borders.\nThe rights group says the Syrian government passed two previous laws, in 2012, letting authorities seize property and assets without due process. The watchdog says the government has a history of using the laws to demolish neighborhoods that opposed Assad's rule.\nGermany, Greece, and Lebanon — which host over 1.5 million Syrian refugees between them — have expressed concerns over the law.\nGerman government spokeswoman Ulrike Demmer called it a \"cynical plan\" to confiscate refugee property.\nLebanese Foreign Minister Gebran Bassil said refugees who have lost their property in Syria will have a reduced incentive to return. He urged the Syrian government to amend the law.\nAlso on Tuesday, Israeli Prime Minister Benjamin Netanyahu reiterated his position that his government would not allow Iran to maintain a military presence anywhere inside Syria.\n\"I have made clear our red lines many times, and we will enforce them without compromise,\" he said.\nHis comments come amid a flurry of military and diplomatic movements over the control of southwestern Syria, bordering the Israeli-occupied Golan Heights.\nThe Syrian government says it is planning to recapture rebel-held parts of the region, raising concerns its regional backers Iran and the Lebanese militant group Hezbollah — both archrivals of Israel — will take up positions along the frontier.\nA senior Russian diplomat said Tuesday that his country is pushing for a quick meeting with the United States and Jordan to discuss security provisions for southwestern Syria. In remarks carried by Russian news agencies, Deputy Foreign Minister Mikhail Bogdanov said the trilateral consultations should be held \"the sooner the better.\" The Russian outlet Russia Today said the talks are expected within a week.\nThe state-run RIA Novosti news agency said Moscow wants to cut a deal that would see Russian military police deployed to areas near Israel. The agreement would envisage the pullout of all Iranian forces from the area and require the rebels to surrender heavy weapons.\nIsraeli Defense Minister Avigdor Lieberman is set to travel to Russia on Wednesday to discuss the matter. Russia is a key ally of Assad.\n———\nAssociated Press writers Aron Heller in Jerusalem and Vladimir Isachenkov in Moscow contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Rights group: Syria's new property law discourages return",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/rights-group-syrias-property-law-discourages-return-55500109"
}