{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:30:05+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Dr. Janet Taylor appears live on \"GMA\" to discuss the controversy surrounding the new Netflix original series, co-produced by Selena Gomez,",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2F13-reasons-receives-backlash-suicide-prevention-community-46853527.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_schiavocampo3_0813_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "'13 Reasons Why' receives backlash from the suicide prevention community More Dr. Janet Taylor appears live on \"GMA\" to discuss the controversy surrounding the new Netflix original series, co-produced by Selena Gomez, Coming up in the next {{countdown}} {{countdownlbl}} Coming up next: {{nextVideo.title}} {{nextVideo.description}} Skip to this video now Related More information on this video Enhanced full screen Explore related content Share your favorite moment HELP Related Extras Related Videos Video Transcript Transcript for '13 Reasons Why' receives backlash from the suicide prevention community This transcript has been automatically generated and may not be 100% accurate. Now Playing: Kate Walsh talks about '13 Reasons Why'\nNow Playing: Lady Gaga, who is headlining Coachella, was seen filming her upcoming movie, 'A Star is born'\nNow Playing: '13 Reasons Why' receives backlash from the suicide prevention community\nNow Playing: Prince William speaks to Lady Gaga about the stigma over mental illness\nNow Playing: New details of Prince's death revealed as documents are released\nNow Playing: Prince Harry says he 'shut down' his emotions after his mother's death\nNow Playing: Author Kelly Oxford talks new book and social media fame\nNow Playing: Janet Jackson tweets photo of 14-week-old son, Eissa\nNow Playing: Prince Harry opens up about seeking counseling after his mother's death\nNow Playing: Anne Hathaway dishes on her $15 flea market dress\nNow Playing: Jennifer Hudson's favorite part about working with Adam Sandler\nNow Playing: Millions waiting for viral sensation April the giraffe's calf to be named\nNow Playing: Lady Gaga takes over for pregnant Beyonce at Coachella\nNow Playing: Star Wars fans descend on Orlando for 'Star Wars Celebration'\nNow Playing: April the giraffe finally gives birth\nNow Playing: Dave Filoni weighs in on Scarif battle and 'Star Wars Rebels' finale\nNow Playing: The biggest 'Star Wars' reveals we learned at Celebration 2017\nNow Playing: 'Star Wars' cosplay championship\nNow Playing: New York Giants memorabilia scandal\nNow Playing: April the giraffe gives birth Now Playing: {{itm.title}}\n{\"id\":46853527,\"title\":\"'13 Reasons Why' receives backlash from the suicide prevention community\",\"duration\":\"3:54\",\"description\":\"Dr. Janet Taylor appears live on \\\"GMA\\\" to discuss the controversy surrounding the new Netflix original series, co-produced by Selena Gomez,\",\"url\":\"/GMA/video/13-reasons-receives-backlash-suicide-prevention-community-46853527\",\"section\":\"GMA\",\"mediaType\":\"default\"}",
    "source_domain": "abcnews.go.com",
    "title": "'13 Reasons Why' receives backlash from the suicide prevention community",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/13-reasons-receives-backlash-suicide-prevention-community-46853527"
}