{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:38:04+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Jim Mulhern, 75, has cheered for The Eagles his whole life and has raised his children to be fans of the Birds.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ffamily-eagles-fans-surprise-father-tickets-super-bowl-52819979.json",
    "image_url": "http://a.abcnews.com/images/WNT/180203_wn_Pilgrim2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for A family of Eagles fans surprise their father with tickets to the Super Bowl\npatriots fans winning is nothing new. But for eagles fans, after decades of defeat, this is a once-in-a-lifetime chance. Here's Eva pilgrim. Reporter: For eagles' fans, it's a moment they've been waiting a lifetime to see. I think most of the country is on our side. That's just the way I feel. New England, how many do they want to win? Reporter: The birds have never won the super bowl. These notorious fans, starved, desperate to call themselves champions. And anyone who can get to the bold north making it happen. This video, two sons surprising their dad with tickets, going viral. I'm going, I'm going! Reporter: Jim Mulhern is 75 years old. He's cheered for the eagles his whole life. I just went bananas and I had not done that in a very, very long time. Reporter: So, when their beloved team made it, his sons knew they had to get their dad there. I just gave him a hug, and there was a lot of excitement and laughter, and it's been a long time coming for the eagles. Reporter: This love for the birds a family affair passed down from generation to generation. Wearing green a badge of honor. So you have forced it on your children, as well? Good parenting. But the road to the championship has one obstacle -- beating football royalty, legendary qb Tom Brady and coach Bill Belichick going for their sixth ring. But being the underdog is something eagles' fans are comfortable with, even relish. E-a-g-l-e-s! Eagles! Reporter: Eva pilgrim, ABC news, Minneapolis, Minnesota. Those fans are fired up. Thanks so much for watching. I'm Tom llamas in New York. \"Good morning America\" and \"This week\" in the morning. I'll see you right back here tomorrow night. Have a great evening. Good night.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "A family of Eagles fans surprise their father with tickets to the Super Bowl",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/family-eagles-fans-surprise-father-tickets-super-bowl-52819979"
}