{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 03:21:38+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Increase comes amid competitive contests for governor and other offices.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fearly-voting-illinois-primary-exceeds-midterm-53858656.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_ef5ad765c3bd4eafbd067427406e6479_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Midterm Elections? Add Midterm Elections as an interest to stay up to date on the latest Midterm Elections news, video, and analysis from ABC News. Add Interest\nFar more people have cast early ballots for Illinois' primary than did so four years ago, an increase that comes amid competitive contests for governor and other offices and record-breaking spending that has made the election nearly impossible to ignore.\nMore than 330,000 people had cast ballots for Tuesday's primary as of Sunday, according to the Illinois State Board of Elections, and thousands more people were voting on Monday. The total in 2014 was just over 200,000.\nSome of the biggest increases have been in Cook County, a Democratic stronghold that includes Chicago, where the number of early votes cast is almost three times the 2014 number. While some of the increase may be due to increased awareness of and comfort with early voting, officials noted the number of registered voters also has increased.\n\"From the top of the ballot to the bottom, there are contests on both the Democratic and Republican sides that have generated a great deal of attention and interest among voters,\" said Cook County Clerk David Orr, who handles elections in the suburbs surrounding Chicago.\nIn the Democratic primary for governor, Billionaire J.B. Pritzker has put almost $70 million into his campaign as he looks to defeat five other candidates, including state Sen. Daniel Biss and businessman Chris Kennedy, nephew of the late President John F. Kennedy. The race is far more competitive than four years ago, when Gov. Pat Quinn faced a little-known opponent.\nOn the Republican side, conservative state Rep. Jeanne Ives is trying to knock off Gov. Bruce Rauner, who angered many in the right flank of his party with actions on issues such as immigration and abortion. The wealthy former private equity investor also has been spending millions on his campaign.\nNBC News, citing data from the ad-tracking group Advertising Analytics, reported spending on TV ads for the two governor primaries has already topped $65 million, fueled largely by Rauner and Pritzker.\nVoters also will choose nominees for attorney general and other statewide and local contests, as well as some hotly contested congressional races.",
    "source_domain": "abcnews.go.com",
    "title": "Early voting for Illinois primary far exceeds last midterm",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/early-voting-illinois-primary-exceeds-midterm-53858656"
}