{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 15:12:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Nobel Peace Prize awarded to anti-nuclear campaign group",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fnobel-peace-prize-awarded-anti-nuclear-campaign-group-50325054.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_df63d22a6f754b87a489a93002972996_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Nobel Peace Prize was awarded Friday to the International Campaign to Abolish Nuclear Weapons, a group of mostly young activists pushing for a global treaty to ban the cataclysmic bombs.\nThe award of the $1.1-million prize comes amid heightened tensions over both North Korea's aggressive development of nuclear weapons and U.S. President Donald Trump's persistent criticism of the deal to curb Iran's nuclear program.\nThe prize committee wanted \"to send a signal to North Korea and the U.S. that they need to go into negotiations,\" Oeivind Stenersen, a historian of the peace prize, told The Associated Press. \"The prize is also coded support to the Iran nuclear deal. I think this was wise because recognizing the Iran deal itself could have been seen as giving support to the Iranian state.\"\nThe Geneva-based ICAN has campaigned actively for the Treaty on the Prohibition of Nuclear Weapons, which was adopted by 122 countries at the United Nations in July. On Sept. 20, the first day the treaty was open for signature, 51 countries signed it and three submitted their ratifications. The treaty needs 50 ratifications to go into force, which advocates are confident will happen.\nThe United States, Russia, Britain, France and China all boycotted the negotiations; India, Pakistan and North Korea did not vote.\nICAN also organized events globally in 2015 to mark the 70th anniversaries of World War II's devastating U.S. atomic bombing of the Japanese cities of Hiroshima and Nagasaki.\nLast month in Berlin, ICAN protesters teamed up with other organizations to demonstrate outside the U.S. and North Korean embassies against the possibility of nuclear war between the two countries. Wearing masks of Trump and North Korean leader Kim Jong Un, protesters posed next to a dummy nuclear missile and a large banner reading \"Time to Go: Ban Nuclear Weapons.\"\nThe group \"has been a driving force in prevailing upon the world's nations to pledge to cooperate ... in efforts to stigmatize, prohibit and eliminate nuclear weapons,\" Norwegian Nobel Committee chairwoman Berit Reiss-Andersen said in the announcement.\nThe prize \"sends a message to all nuclear-armed states and all states that continue to rely on nuclear weapons for security that it is unacceptable behavior. We will not support it, we will not make excuses for it. We can't threaten to indiscriminately slaughter hundreds of thousands of civilians in the name of security. That's not how you build security,\" ICAN executive director Beatrice Fihn told reporters Friday in Geneva.\nShe said that she \"worried that it was a prank\" after getting a phone call just minutes before the official Peace Prize announcement was made. Fihn said she didn't believe it until she heard the name of the group being proclaimed on television.\nICAN leaders later popped open some bubbly to celebrate the prize, and held up a banner with their group's name in their small Geneva headquarters.\n\"We are trying to send very strong signals to all states with nuclear arms, nuclear-armed states — North Korea, U.S., Russia, China, France, U.K., Israel, all of them, India, Pakistan — it is unacceptable to threaten to kill civilians,\" she said.\nReiss-Andersen noted that similar prohibitions have been reached on chemical and biological weapons, land mines and cluster munitions.\n\"Nuclear weapons are even more destructive, but have not yet been made the object of a similar international legal prohibition,\" she said.\nReiss-Andersen said \"through its inspiring and innovative support for the U.N. negotiations on a treaty banning nuclear weapons, ICAN has played a major part in bringing about what in our day and age is equivalent to an international peace congress.\"\nAsked by journalists whether the prize was essentially symbolic, given that no international measures against nuclear weapons have been reached, Reiss-Andersen said \"what will not have an impact is being passive.\"\nAnita Friedt, the U.S. acting assistant secretary of state for arms control, told the U.N. General Assembly this week that it would be irresponsible for the U.S. to support the treaty, citing the threat from North Korea.\n———\nJamey Keaten in Geneva, George Jahn in Vienna, Edith Lederer at the United Nations and Jim Heintz in Stockholm contributed to this story.",
    "source_domain": "abcnews.go.com",
    "title": "Nobel Peace Prize awarded to anti-nuclear campaign group",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/nobel-peace-prize-awarded-anti-nuclear-campaign-group-50325054"
}