{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 16:41:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "US stocks edge higher in morning trading; oil prices rise",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-stocks-edge-higher-early-trading-oil-prices-51718551.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/us-stocks-edge-higher-early-trading-oil-prices-51718551",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. stock indexes edged higher in morning trading Monday as gains in technology and energy companies outweighed losses among banks and makers of packaged foods and other consumer goods. Bitcoin futures began trading. Oil prices rose.\nKEEPING SCORE: The Standard & Poor's 500 index rose 2 points, or 0.1 percent, to 2,654 as of 11:17 a.m. Eastern time. The Dow Jones industrial average gained 21 points, or 0.1 percent, to 24,350. The Nasdaq composite added 14 points, or 0.2 percent, to 6,855. The Russell 2000 index of smaller-company stocks picked up less than 1 point to 1,521.\nCENTRAL BANK WATCH: Investors have their eye this week on the Federal Reserve, which is scheduled to issue an interest rate policy update on Wednesday. The Fed is expected to lift rates by 0.25 percent. That would be the third interest rate hike by the central bank this year.\nTECH SWELL: Gains among technology companies helped lift the market. Symantec rose 80 cents, or 2.9 percent, to $28.78, while Apple picked up $2.58, or 1.5 percent, to $171.95.\nBITCOIN: Trading in Bitcoin futures began Sunday. They fell slightly in early trading Monday from their overnight high on the Chicago Board Options Exchange. The contract that expires in January was trading at $18,200. The price of an actual bitcoin has soared since it began the year below $1,000 and on Friday was at $16,530 on the private exchange Coindesk. Overstock.com, which accepts Bitcoin, surged $7.47, or 16.6 percent, to $52.54.\nENCOURAGING RESULTS: Drugmaker bluebird bio surged 18.2 percent after it reported results from an early study of a cancer treatment that the company is developing with Celgene. Shares in bluebird gained $31.10 to $202.25. Celgene added $2.02, or 1.9 percent, to $108.11.\nUNAPPETIZING: Several packaged food and beverage stocks were trading lower. Hormel Foods slid 55 cents, or 1.5 percent, to $36.69.\nFINANCIALS SLIDE: Shares in banks and other financial companies declined. Charles Schwab shed 45 cents, or 0.9 percent, to $50.94.\nICAHN DO IT: Xerox shares slipped on news that Carl Icahn will nominate four directors to the company's board. One Xerox director linked to Icahn resigned as the activist investor called off a standstill agreement with Xerox that started in June 2016. Xerox was down 2 cents to $29.57.\nBONDS: Bond prices rose. The yield on the 10-year Treasury note fell to 2.36 percent from 2.38 percent late Friday.\nENERGY: The price of oil edged up, with benchmark U.S. crude gaining 33 cents to $57.69 per barrel on the New York Mercantile Exchange. Brent crude, the international standard, rose $1.06, or 1.7 percent, to $64.47 per barrel in London.\nThe pickup in oil prices helped boost energy sector stocks. Chesapeake Energy added 19 cents, or 5.2 percent, to $3.87, while Range Resources climbed 71 cents, or 4.4 percent, to $16.79.\nCURRENCIES: The dollar weakened to 113.33 yen from 113.51 yen late Friday. The euro rose to $1.1806 from $1.1768.\nMARKETS OVERSEAS: In Europe, Germany's DAX slipped 0.2 percent, while the CAC 40 in France fell 0.2 percent. Britain's added 0.8 percent. Earlier in Asia, Japan's Nikkei 225 stock index climbed 0.6 percent, while Hong Kong's Hang Seng index gained 1.0 percent. The S&P ASX 200 in Australia edged 0.1 percent higher. South Korea's Kospi picked up 0.3 percent. India's Sensex rose 0.2 percent. Shares in Southeast Asia also rose.",
    "source_domain": "abcnews.go.com",
    "title": "US stocks edge higher in morning trading; oil prices rise",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-stocks-edge-higher-early-trading-oil-prices-51718551"
}