{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:11:16+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fjournalist-joins-ranks-stranger-fiction-faked-deaths-55535319.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_a5443c3bb00347139578658cc1f2343a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In a twist straight out of a spy thriller, Russian journalist Arkady Babchenko showed up at a news conference in Kiev on Wednesday — a day after he was reportedly shot dead in the Ukrainian capital. Babchenko explained that his death had been faked as part of sting by Ukrainian security services to catch his would-be assassin.\nIt's an astonishing saga, but not the first time people under stress or duress have gone to the extreme of faking their own deaths. Here are a few cases:\nJUAN PUJOL\nSpanish chicken farmer Juan Pujol, codenamed Agent Garbo, played a key role in the Allied invasion of Normandy during World War II. He pretended to be an agent of Germany, but was really working for Britain's MI5, feeding the Nazis misleading information about Allied war efforts.\nHis greatest success was persuading German commanders that the Allied invasion would come in France's Pas de Calais region, far north of the real Normandy landing beaches.\nAfter the war, fearing revenge from surviving Nazis, he traveled with MI5 help to Angola where in 1949 he faked his death from malaria. Pujol, very much alive, moved to Venezuela, where he ran a bookshop. He died in 1988.\n————\nKEN KESEY\nKen Kesey — ringmaster of acid-tripping band of 1960s jesters the Merry Pranksters — had published the acclaimed novel \"One Flew Over the Cuckoo's Nest\" when he was arrested in 1965 for marijuana possession.\nFearing prison, he left his truck parked on a cliff-side road in California with an apparent suicide note reading \"Ocean, Ocean, I'll beat you in the end\" and was smuggled into Mexico in the trunk of a friend's car. He returned to the United States several months later, was arrested and served several months in prison.\nKesey spent the rest of his life in Oregon and died in 2001 at the age of 66.\n———\nJOHN STONEHOUSE\nJohn Stonehouse was a British Labour lawmaker with financial troubles. With his business ventures crumbling, Stonehouse went to Florida in 1974 and faked his own death by leaving his clothes in a bundle on a Miami beach.\nHe was arrested a month later in Australia where he was living under an alias taken from a dead former constituent. Extradited to Britain, he was sentenced to seven years for theft, fraud and deception.\nAfter being released, Stonehouse reinvented himself as the author of several thrillers. He died in 1988, aged 62.\nTwo decades after his death, it was revealed that Stonehouse had been a Czech spy throughout the 1960s. Papers released by Britain's National Archives revealed that the British government had found out about Stonehouse's spying while he was still alive, but covered it up as there was too little evidence to put him on trial.\n———\nDAVID FRIEDLAND\nNew Jersey state senator Friedland was a rising star in political circles until he was caught taking $300,000 in kickbacks in 1980. He was sentenced to seven years in jail, but avoided prison by agreeing to help the government catch other thieves.\nFriedland resumed his fraud, looting the pension funds of the Teamsters Union of more than $1 million. In 1985, when he learned an indictment was imminent, he traveled to the Bahamas and faked his death in a scuba-diving accident. Friedland eluded authorities until 1987, when he was captured in the Maldives, where he was running a scuba-diving business.\nOn his release from prison in 1997, he had few regrets about his years on the run.\n\"It would play better to say I had a miserable time, but that isn't true,\" he told the Asbury Park Press. \"It was fun.\"\n———\nPHILIP SESSAREGO\nTom Carew was the best-selling author of \"Jihad!\" — an account of special forces operations in Afghanistan written by a former member of Britain's elite Special Air Service. In the weeks after the Sept, 11 attacks, Carew appeared on television as an expert on the Taliban.\nBut Carew was really Philip Sessarego, who had served in the regular British army, not the SAS. In 1993, Sessarego had faked his death in a car bombing in Croatia and reinvented himself as the dashing Carew.\nAfter the ruse was exposed by the BBC in November 2001, Sessarego moved to Belgium. His decomposed body was found in a garage in Antwerp in 2008. Police said he had likely died of carbon monoxide poisoning.",
    "source_domain": "abcnews.go.com",
    "title": "Journalist joins ranks of stranger-than-fiction faked deaths",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/journalist-joins-ranks-stranger-fiction-faked-deaths-55535319"
}