{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 00:11:52+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Netflix on the verge of hitting 100 million subscribers",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fnetflix-verge-hitting-100-million-subscribers-46849016.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/AP-netflix-jef-161130_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Netflix is on the verge of surpassing 100 million global subscribers, a testament to how much the video streaming service has changed the entertainment landscape since its debut a decade ago.\nThe company will reach that milestone this weekend if its projections are correct. Netflix made the prediction Monday with the release of its first-quarter earnings.\nThe service added nearly 5 million subscribers during the first three months of the year, and will end March with 98.7 million customers in roughly 190 countries.\nTHANK THE SMARTPHONE\nOver the past decade, \"what really did it for Netflix was the explosion of phones and tablets that allowed people to watch video everywhere,\" said Wedbush Securities analyst Michael Pachter. \"But Netflix clearly had a vision before those devices became so ubiquitous.\"\nAbout 51 million of Netflix's subscribers are in the U.S. By the end of this year, Piper Jaffray analyst Michael Olson expects the majority of the company's subscribers to be overseas. Netflix ended March with nearly 48 million subscribers outside the U.S.\nNetflix CEO Reed Hastings expects the next 100 million subscribers to come more quickly than the first 100 million, but he didn't provide a specific timetable during online video review of the company's first quarter.\n\"Everybody watches TV and nearly everybody has the internet, so I don't see anything that's going to stop Netflix from getting to most people in the United States and then eventually hopefully most people around the world,\" Hastings said.\nProgress toward that ambitious goal has helped drive the company's stock price progressively higher over the past five years. In that time, Netflix has added 72 million more subscribers.\nThe Los Gatos, California company currently has a market value of about $63 billion. Its stock rose $1.90 to $149.15 in Monday's extended trading, even though subscriber growth during the first quarter came in slightly below management forecasts.\nSTILL CHASING HBO\nFor all its success, Netflix still has a ways to go before it catches up with HBO, the popular pay-TV channel that has served as its role model. HBO has 134 million subscribers worldwide, including viewers paying for an internet-only version of the channel that was inspired by Netflix's success.\nOther cable channels also are offering internet-only options as more viewers, especially younger people, eschew traditional TV packages and subscribe to streaming services instead.\nThe trend has confronted Netflix with more competition in the battle for household entertainment budgets. Netflix so far has answered the challenge by spending heavily on original shows such as \"Stranger Things\" and \"House of Cards\" and selling its service at a relatively low price. Netflix's subscriptions range from $8 to $12 per month, with the most popular option at $10.\n\"The model works from a consumer perspective because it is such a good value,\" Pachter said.\nIn a measure of how much Netflix subscribers like the service, Hastings said Monday that they collectively stream more than 1 billion hours of programming per week.\nBy comparison, Google says about 1 billion hours of video per day are watched on its mostly free YouTube service. \"We have YouTube envy,\" Hastings joked.\nWILL NETFLIX RAISE PRICES?\nPachter and other analysts wonder how long Netflix will be able to hold the line on price as its programming costs rise in tandem with its appeal to a more diverse international audience. Movie and TV studios typically also demand more money as more people subscribe to channels to in an effort to make as much as possible off their content.\nAs it is, Netflix expects to spend about $6 billion on programming this year.\nNetflix hasn't given any inkling it will raise prices again. It lost some long-time U.S. subscribers after their rates went up by as much as $2 per month last year. Netflix had previously frozen prices for millions of subscribers at 2014 levels.\nBut if it wants to keep investors happy, the company will eventually have to improve its relatively low profit margin. The Los Gatos, California, company earned $178 million on revenue of $2.6 billion in the first quarter. Analysts predict Netflix will make $482 million on revenue of more than $11 billion for the entire year.",
    "source_domain": "abcnews.go.com",
    "title": "Netflix standing on the threshold of 100 million subscribers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/netflix-verge-hitting-100-million-subscribers-46849016"
}