{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-04-24 21:03:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "A masseuse has accused the former Marvel head of behaving inappropriately.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fstan-lee-accused-sexual-misconduct%2Fstory%3Fid%3D54696921.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/stan-lee-gty-jef-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Chicago-area masseuse has accused former Marvel Comics editor-in-chief Stan Lee of sexual misconduct.\nAccording to a lawsuit obtained by Los Angeles ABC station KABC, Maria Carballo has accused Lee of assault, battery, violation of the Illinois Gender Violence Act, and emotional distress, and named his former assistant, Max Anderson, in a count of civil conspiracy, stemming from two separate massage therapy sessions on April 21 and 22, 2017, in a Chicago hotel room.\nCarballo is seeking more than $50,000 in damages for each count and reimbursement for her attorney fees.\n“For a long time, I was afraid to ask anyone to help me hold Mr. Lee accountable for how he treated me. He is rich and famous. I am not. After seeing other women fight to be treated with dignity and respect, I decided, 'Me too,'\" Carballo stated. \"I am still nervous and afraid, but not as much as I was before because I have other people helping me.”\nKABC has also confirmed that on March 16, a female victim filed a police report alleging that a male client touched her inappropriately while she was performing a duty in related to her occupation. The victim said the inappropriate contact occurred on April 22, 2017.\nLee's attorney did not immediately respond to KABC's request for comment, but did tell The Chicago Tribune that Lee was shocked by the allegations, which he denied. The attorney also said he was not aware of a criminal investigation and said the allegations might be part of \"a shakedown.\"\n\"The guy is 95,\" he added. \"I don't think he would do that.\"\nAnderson has not responded to a request for comment.\nThe lawsuit states that during the first massage session, Lee fondled himself while lying face down and later began to moan and groan, which made Carballo so uncomfortable that she ended the massage early and left. However, her employer, the owner of Therapy Professionals, asked that she return to Lee's hotel room to give him a second massage upon his request, according to the lawsuit. After two refusals, her employer called her a third time to say that Lee had apologized and assured her that there would be no further incidents, the lawsuit states.\nFearing for her job, Carballo returned to Lee's hotel to give him a massage, during which he began to moan, according to the lawsuit. To create distance from him, she began to do a Shiatsu massage, which can be performed with the feet, at which point Lee allegedly put his genitals against her foot, according to the lawsuit. After that, she claims she immediately stopped the massage and left, the lawsuit states.\n\"Not long thereafter, [Carballo] told her daughter and best friend about what happened but was fearful that, in light of Lee's wealth and status, reporting the incident to the police would hurt her job,\" the lawsuit states. \"After seeing other women protest in connection with the Me Too movement, [she] decided to fight for her dignity by standing up for herself.\"\nKABC's Julie Sone contributed to this report.\nABC News and Marvel Comics are both part of parent company Disney.",
    "source_domain": "abcnews.go.com",
    "title": "Stan Lee accused of sexual misconduct",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Entertainment/stan-lee-accused-sexual-misconduct/story?id=54696921"
}