{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 04:22:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "US Navy reports another tense encounter with an Iran drone",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-navy-reports-tense-encounter-iran-drone-49208549.json",
    "image_url": "http://abcnews.go.com/International/wireStory/us-navy-reports-tense-encounter-iran-drone-49208549",
    "language": "en",
    "localpath": null,
    "maintext": "An unarmed Iranian drone shadowed a U.S. aircraft carrier at night and came close enough to F-18 fighter jets to put the lives of American pilots at risk, the Navy said Tuesday, reporting the second such tense encounter within a week. Iran's Revolutionary Guard said the U.S. safety concerns were unfounded.\nThe Iranian Sadegh drone flew without any warning lights Sunday night while shadowing the USS Nimitz, said Lt. Ian McConnaughey, a spokesman for the Bahrain-based 5th Fleet.\nThe drone did not respond to repeated radio calls and came within 1,000 feet (300 meters) of U.S. fighters, he said.\nThat \"created a dangerous situation with the potential for collision and is not in keeping with international maritime customs and laws,\" McConnaughey said in a statement.\nThe drone was unarmed, the lieutenant said, though that model can carry missiles.\nIran's Revolutionary Guard issued a statement early Tuesday saying their drones are guided \"accurately and professionally,\" dismissing the U.S. Navy's concerns as \"unfounded.\"\nIn a similar encounter Aug. 8, the Navy said an Iranian drone came within 100 feet (30 meters) of an F-18 preparing to land on the Nimitz. Iranian vessels and U.S. warships have also had tense encounters in recent months.\nPresident Donald Trump has threatened to renegotiate the nuclear deal struck by his predecessor amid new sanctions targeting Iran over its ballistic missile tests.\nSo far this year, the Navy has recorded 14 instances of what it describes as \"unsafe and/or unprofessional\" interactions with Iranians forces. It recorded 35 in 2016 and 23 in 2015.\nThe incidents at sea almost always involved the Revolutionary Guard, a paramilitary force that reports only to Supreme Leader Ayatollah Ali Khamenei. Some analysts believe the incidents are meant in part to squeeze moderate President Hassan Rouhani's administration after the 2015 nuclear deal.\nOf the incidents at sea last year, the worst involved Iranian forces capturing and holding overnight 10 U.S. sailors who strayed into the Islamic Republic's territorial waters.\nIranian forces in turn accuse the U.S. Navy of unprofessional behavior, especially in the Strait of Hormuz, the mouth of the Persian Gulf, through which a third of all oil traded by sea passes.\n———\nFollow Jon Gambrell on Twitter at www.twitter.com/jongambrellap. His work can be found at http://apne.ws/2galNpz.",
    "source_domain": "abcnews.go.com",
    "title": "US Navy reports another tense encounter with an Iran drone",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/us-navy-reports-tense-encounter-iran-drone-49208549"
}