{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:04:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The country's severe economic crisis has created widespread corruption and goods shortages, leaving many families without basic essentials.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fbreaking-point-venezuelas-horrific-food-medicine-shortage-part-45502548.json",
    "image_url": "http://a.abcnews.com/images/Nightline/170215_ntl_venezuela_2g_1255_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Breaking Point: Venezuela's Horrific Food, Medicine Shortage: Part 1\nTonight an extraordinary journey inside a country on the brink of an economic collapse. Venezuela's once-thriving middle class is now trapped in desperation, struggling to put food on the table, some even dying from simple infections due to lack of basic medicines. Our Matt Gutman traveled to Venezuela for a rare firsthand report from inside this repressive, authoritarian regime. Reporter: Venezuela. A tropical paradise steeped in natural riches. Sitting atop the biggest oil reserves on the planet. Once oozing glamor and excess. Known for its beauty queens black gold, and its authoritarian rulers. But now it's a country in the midst of violent upheaval. When the price of oil crashed, the economy went with it. Exposing the failures of Hugo Chavez's socialist government, triggering hundreds of riots and mass instability. And now the people are paying the price. I traveled to Venezuela twice before. But this time from the moment we arrived, we saw people rising up. Freedom, freedom! Reporter: There are probably a couple thousand people who have overtaken this highway. Is life harder for you now than it was? Yes. There's no food. There's no quality of life here. We cannot go to sleep at night. Reporter: She tells us under the current president, Nicolas maduro, the descent into chaos has accelerated. Caracas is now the murder capital of the world. It's a humanitarian fight, not a political fight. Reporter: Lily Tory is an opposition leader. Do you think maduro is ready to give in? Maduro is a dictatorship, they need to go. Are you prepared for confrontation? I don't want confrontation. Reporter: Lillian has paid dearly for speaking out. Her husband has been a political prisoner here since 2014, imprisoned under maduro. May daughter row rules with an iron fist. Hauling opponents off to detention and silencing the press. At times violently. Food lines have to be guarded by soldiers, and they tell the story of the world's worst-performing economy with inflation over 800%. But shockingly, Venezuela's leaders deny it even exists. But when you talk to the people here, there is no denying the crisis is real. Food shortages pushing some people to ransack food trucks. We met up with second grade teacher Vanessa. She invited us into her class. She tells us some of her students have fainted from hunger. Just milk. These kids aren't asking for candy or fast food. When the food began to vanish, so did Vanessa's students. The upturned chairs on the desks, an unofficial roll call. But it's not just the students. More than one-third of the country's teachers miss school every day. So they can stand in lines like these. Hoping to buy the staples they need for their own children at a much cheaper government-subsidized price. Sometimes they wait for hours and get nothing at all. Vanessa and her husband Adolfo are two of the few teach there's despite the journey work every day. It's a two-hour hitchhike and a bus ride to and from school. They had to sell their car to survive. Vanessa and Adolfo have to alternate eating dinner on different nights to make sure their son gets to eat every day. The meals missed have taken a toll on their bodies. Just a morsel of cheese brings a smile to their young son's face. With inflation the equivalent for a U.S. Family, it would be $400. Teachers here need to earn 16 base salaries just to adequately feed a family of five. We went to the supermarket so we could see for ourselves what the average worker here can buy. They make about $30 a month. A dollar appeals for each of these apples. Each one of these apples is about 5% of the average worker's monthly wage. Just one of these apples. That's pretty crazy. We were surprised because the supermarket looked fully stocked. But turns out it's missing what people need to survive. Workers here tell us they don't have the staples of Venezuelan life. Flour, bread, butter, sugar, milk. What everyone here knows is that we are all under the watchful eye of the government-backed militias. But this one woman was so desperate to tell her story, she was willing to risk it all to follow us out. She says she's lost 30 pounds this year just because there's not enough food. She wants the world to know, she says, turning directly to the camera. Our Moto taxi driver told us, we're being watched, we've got to get out of here. We hop on those taxis. It's this regression, this everyday threat of violence mixed with complete failure of the government that is forcing tens of thousands to flee. Venezuela now leads U.S. Asylum requests worldwide, leaving China, a country with a population over 4,000 times its size, in second place. In this chaos, the only thing thriving is the black market. Scenes like this play out every day. People illegally buying products intended for the food lines right out of a government warehouse. Black marketeers like Marco making a profit. Marco asked us not to show his face or reveal his real name. But he invited us on his route through Caracas to witness this \"Mad max\" economy. His company is contracted by the government to deliver subsidized goods to hospitals, schools, and prisons. Marco tells us the corruption starts at the top. He says the military generals skim about 50% and sell it on the black market. He says people like him then skim another 30% to resell it. Only a fraction is actually delivered to the people. And it's not just food. The death toll here is on the rise. Due to shortages of medicine and basic supplies. This clinic director tells us she could only treat the most basic of ailments. Headaches, stomachaches. That's it. There are no antibiotics. Basic services have ceased to function. A simple infection can be deadly. Those shortages have driven people like Feliciano Reina to crowd source medications. The cornell-educated architect has created a medicine chest that distributes over 200 types of meds to 1,700 people. All of it for free. In a matter of just, let's say, two months, we got donations of medicines from Miami, also from Houston, Rome, Madrid. When we get donation, make a list, and then send it out via Twitter. Also we put lists on Facebook. The government is not admitting that this is happening. They just do not accept that there are these severe problems for people to have access to health care in general. Reporter: This is why he's doing everything he can to help his fellow citizens. Now our commitment is to be there with the people. This does not stop us from doing what we know is right. Reporter: The government has tightened its grip on the most vulnerable. Hospitals are now under military control. We saw armed guards at the doors. Doctors tell us they're not there to protect the patients, but to take control of any donations that might come in and to prevent journalists like us from reporting on what is really going on inside. In Caracas people told us, if you want to see how bad it really is, you have to go to the peripheries, cities like Valencia. We drove three hours after Caracas where we were told things were much worse. We were about to discover just how bad it could be.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Breaking Point: Venezuela's Horrific Food, Medicine Shortage: Part 1",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/breaking-point-venezuelas-horrific-food-medicine-shortage-part-45502548"
}