{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:09:46+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Angie Geyser says she couldn't believe it when detectives told her what her daughter Morgan admitted to doing.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2F2020%2Fvideo%2Fyoung-girls-police-plot-stab-friend-woods-part-52809895.json",
    "image_url": "http://a.abcnews.com/images/2020/180202_2020_act3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Young girls tell police about plot to stab friend in the woods: Part 3\nReporter: Two mothers now trying to reconcile the little girls they raised with the 12-year-olds who brutally attacked their friend. ??? Morgan was a very happy child. She was intensely creative. She was always making up songs and stories. Anissa did enjoy choir, she did enjoy singing. ??? Oh, bring back my bunny to me ??? Reporter: And only now do moments along the way seem to carry greater weight. Morgan's mom telling me she remembers showing her daughter a movie, a children's classic. You were watching \"Bambi,\" and you noticed something. What was it? When had been concerned to show Morgan the movie because we were afraid when Bambi's mother died, she would be upset. She, in fact, had quite the opposite reaction. And after Bambi's mother was shot Morgan just said, \"Run, Bambi! Run!\" And had no reaction whatsoever to the mother dying. Reporter: She wasn't at all concerned about the mom? No. No, not at all. Reporter: And Anissa's mom points to her daughter's childhood, and her struggle to fit in. Looking back, Anissa was never really invited to a lot of, like, birthday parties or anything. I don't think she really made friends that easy. Reporter: Which is why both mothers say they were happy when their two daughters met at the bus stop in middle school. Morgan, did endure a lot of bullying, especially in the sixth grade, by the other students. They knew what each other had gone through and they were going to be there for each other Reporter: What was Anissa like? Anissa was always extremely polite. Reporter: You were witnessing what you thought was a very Normal friendship? That's true. Yes. Reporter: It was a new friend for her daughter, Morgan, who had already been friends with Payton since the fourth grade. And their friendship seemed Normal too. They were just typical giggly girls. Reporter: Payton's parents told us the same thing. Were there ever any red flags. They would have arguments, but every 12-year-old girl had little arguments. Reporter: Payton parents had never met Anissa Weier. But say that Payton spoke of her at school. And they could never have imagined their daughter's friends were plotting against her talking about it on the bus for months. But that's what those girls were now telling detectives. And it turns out, the horror that played out in those woods -- was not the original plan for Payton. Morgan said that at her birthday party, while Bella was sleeping, we were going to, like, duct tape her mouth shut, stab her in the neck and then leave. She would bleed out. They would cover her up with covers to make it look like she was sleeping and the two girls would run. Reporter: But when they got home from skateland, the plan would change. I didn't think it would work. I didn't think any of this would work from the start. I wanted to give her at least one more morning. Reporter: The next morning, a new plan. We're going to do it today at the park. That's what Morgan said. Reporter: As they leave for the park, Anissa tells police that Morgan lifts up her white jacket. The knife tucked in her waistband. What were you thinking? I'm thinking, dear god. This is really happening. Reporter: Morgan and Anissa lead Payton into a bathroom at the park. But one more time, they would change the plan. The girls leave that bathroom and walk down a nearby road. Originally I was because I supposedly knew all the weak spots of a person. I pointed out the woods to Morgan and said, \"We should do it in there,\" so I told Bella we were going to play hide and seek. She sensed it. She said she was forced to go. She was gonna hide one way one place, I was gonna hide another. Morgan and I were gonna be like lionesses chasing down a zebra. I was going to tackle her and then Morgan was going to do the stabbing. Reporter: Anissa tells police she sits on Payton. Payton says to her, I can't breathe. She gives you the knife. I give it back to her and say, you do it. Go blallistic. Go crazy. What did she do then? Stab, stab, stab, stab, stab, stab. Reporter: Payton is stabbed 19 times. Stumbling, trying to get up. Listen to how Anissa describes that moment. The whole time Payton was screaming in agony. Reporter: They would leave her right there. And has Payton talked at all about the horror of that moment? We asked her what she remembered about what happened. And she said she remembered everything. Do you know what happened to the knife after Peyton got stabbed? I put it back in the bag and walked. It was weird. I felt no remorse. Reporter: Morgan said, \"It was weird that I didn't feel remorse.\" Yeah. Reporter: This was a girl who had been in your home many, many times. That was hard because I thought that she really cared about Payton as a person, and they were good friends. Do you know what happened to Bella? Is she dead? I don't know. She was taken to the hospital. I was just wondering. That's not my daughter saying those things. Reporter: It was like looking at a different child? Yes. She appears not to have any remorse, and doesn't appear to be frightened. Reporter: After hours of waiting, detectives finally reveal to Angie what her daughter has done in the woods. Could you believe what you were hearing? No, I couldn't believe what I was hearing, no. No. I never -- I never would have imagined that my daughter was capable of hurting another person. Reporter: Not only was this hurting. It was, you know, multiple stabbings with the intent to kill. Yes.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Young girls tell police about plot to stab friend in the woods: Part 3",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/2020/video/young-girls-police-plot-stab-friend-woods-part-52809895"
}