{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 21:28:54+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Democrats Extol Health Care Law in Bid to Derail GOP Repeal",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fdemocrats-extol-health-care-law-bid-derail-gop-44514850.json",
    "image_url": "http://a.abcnews.com/images/Politics/161129_vod_orig_eyntk_tomprice_16x9_1600.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Senior House Democrats on Monday extolled the benefits of President Barack Obama's health care law in hopes of derailing Republican plans to gut the statute and over time replace it.\nIn a conference call with reporters, House Minority Leader Nancy Pelosi said the GOP will begin its \"assault\" on the health care law when the 115th Congress convenes Tuesday. She said abolishing the law, known as the Affordable Care Act, as Republicans have promised will mean that people will pay more for their health insurance while getting much less than they do now. Undoing the law also will undermine Medicaid and Medicare, she said.\nCurrently Republicans plan to vote quickly on repealing the health care law and delay the effective date to give them time to craft a replacement. Pelosi blasted that strategy as \"an act of cowardice.\" She urged people to \"take a second look\" at how the health care law has improved their lives.\nMinority Whip Steny Hoyer, the No. 2 Democrat in the House, said he believes that many people who voted for President-elect Donald Trump want the health care law preserved even though Trump made repeal of the statute a central part of his campaign.\n\"I think a lot of people are going to be looking at this and saying, 'Gee, I really didn't mean that,'\" Hoyer said.\nRepublicans have opposed Obama's law since Democrats steered the law through Congress in 2010. The GOP has tried numerous times to repeal the law but failed due to internal divisions and Obama's veto power. But with the GOP in control of the House and Senate and Donald Trump set to become president in a few weeks, doing away with \"Obamacare\" is in sight for Republicans.\nGOP lawmakers are expected to spend the next several months working on legislation to cancel broad swaths of the law that the party's voter base staunchly opposes. Most likely to go are the law's mandate that people buy health insurance or face hefty IRS fines, and its expansion of Medicaid coverage to more lower-earning Americans. But several elements of the repeal likely wouldn't go into effect for two to four years.\nRep. Frank Pallone of New Jersey, the top Democrat on the House Energy and Commerce Committee, said Republicans are \"blind to the success\" of the health care law. Repealing the law is rooted in politics, he said, and will hurt middle class Americans.\n\"Repealing the Affordable Care Act is not logical; it's simply ideological,\" Pallone said.",
    "source_domain": "abcnews.go.com",
    "title": "Democrats Extol Health Care Law in Bid to Derail GOP Repeal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/democrats-extol-health-care-law-bid-derail-gop-44514850"
}