{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:55:59+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Flu's worsening shadow blanketing US",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fgroundhog-day-report-flus-worsening-shadow-blanketing-us-52795818.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/groundhog-day-report-flus-worsening-shadow-blanketing-us-52795818",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Flu Season? Add Flu Season as an interest to stay up to date on the latest Flu Season news, video, and analysis from ABC News. Add Interest\nIt looks like Groundhog Day for the nation's flu report, too: It's gotten worse and there are weeks of suffering ahead.\nThe government's report out Friday showed the flu season continued to intensify last week.\nOne of every 14 visits to doctors and clinics were for fever, cough and other symptoms of the flu. That's the highest level since the swine flu pandemic in 2009. Last week, 42 states reported high patient traffic for the flu, up from 39.\nHospital stays because of the flu also increased.\nExperts had thought this season might be bad, but its intensity has surprised most everyone.\n\"It's been the busiest I can remember for a long time,\" said Dr. Doug Olson, an ER doctor at Northside Hospital Forsyth, in Cumming, Georgia. Another hospital in the Atlanta area this week set up a mobile ER outside to handle flu cases.\nThe heavy flu season has also put a strain in places on some medical supplies, including IV bags, and flu medicine.\nThe Centers for Disease Control and Prevention tally shows hospitalization rates surged to surpass the nasty season of the winter of 2014-2015, when the vaccine was a poor match to the main bug.\nSo far, however, deaths this season from the flu and flu-related pneumonia have lagged a little behind some recent bad seasons. There are as many as 56,000 deaths connected to the flu during a bad year.\nThe flu usually peaks in February. This season had an early start, and health officials initially thought it would also have an early peak. But so far it hasn't worked out that way.\nAnd there are some signs the flu season will continue to get worse. The CDC's forecast though wasn't quite as precise as Punxsutawney Phil's; the groundhog \"predicted\" six more weeks of winter on Friday.\nAs for the flu: \"There may be many weeks left for this season,\" said the CDC's Dr. Dan Jernigan.\nSome good news: Illnesses seem to be easing a bit on the West Coast. Oregon joined Hawaii last week as the only states where flu wasn't widespread. Friday's report covers the week ending Jan. 27.\nIn the U.S., annual flu shots are recommended for everyone age 6 months or older. This season's vaccine targets the strains that are making Americans sick, including the key H3N2 virus. How well it worked won't be known until later this month. An early report from Canada for the same flu shot shows protection against that bug has been poor, just 17 percent.\nCanada's flu season so far has been milder with more of a mix of strains. But CDC officials said effectiveness figures in the U.S. may end up in the same range.\nSome researchers say part of the problem may be that most flu vaccine is made by growing viruses in chicken eggs; the viruses can mutate in the eggs, making the vaccine less effective in people.\nThe cold winter in many parts of the country may also have played a role, keeping people indoors and helping flu bugs to spread, said Dr. David Weber, a University of North Carolina flu expert.\nWhatever the reason, \"it's a whopper of a flu season,\" said Mimi Dreifuss, a North Carolina nurse who got sick this week.\nDreifuss, 61, worked in a pediatrician's office for years and didn't catch the flu. She retired last year and didn't get a flu shot figuring she was no longer around sick children. This week she had a 101 temperature and was diagnosed with the flu.\n\"I'm feeling kind of foolish,\" said Dreifuss, of Bynum, North Carolina.\nIn Pensacola, Florida, an ER nurse's Facebook rant after a 12-hour shift got attention this week, with her venting about people not doing enough to stop the spread of germs. She demonstrates the \"magic trick\" of sneezing or coughing into the crook of an arm.\nShe also complains about people without true emergencies crowding into waiting rooms, next to people with the flu.\n\"So guess what? Five flus came in, 15 flus walk out. It's great,\" says Katherine Lockler. \"They'll be back.\"\n———\nAP writer Robert Ray in Cumming, Georgia, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Flu's worsening shadow blanketing US",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/groundhog-day-report-flus-worsening-shadow-blanketing-us-52795818"
}