{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:40:00+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Amna Nawaz talks to Yahoo News' Andrew Romano about a new Yahoo News/Marist poll that finds Americans increasingly tolerant of marijuana use.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fvideo%2Fgrowing-number-americans-tolerant-marijuana-poll-finds-46844002.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/170417_gostream_weed00_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Growing number of Americans are tolerant of marijuana use, poll finds\nHey guys I'm on in the vase live here in New York sit this out. We clearly come a long way when it comes our attitudes towards the lead at the country right. But I think what's happening inside American families well for the first time. We get an off the look because of a new study Yahoo! has released today. Called week. And the American Bentley and here to join us to talk about that it enter an idyllic and great things from them. This is kind of an Austin reports because we've never seen anything like this before we talk a lot about the policy towards marijuana in our country that. Policy shift and the attitudes but this is the first time we're talking that was horrible happening all American families right why do I think that the I think. Don't look at the legal landscape has changed so much of the last four actors aren't happy years ago we don't know state to legalize recreational one now it puts Washington DC. 2829. States have legalized medical marijuana it's just all across the country and so we thought. A case of the legal landscape is changing that's changing social attitudes houses changing what's happening in your most intimate relationships. Father son mother daughter brother sister through what is really. Take a statistical look to a poll we partnered with Marist pastor read 11100 Americans and find out you know what they say about how this is affecting. Their family so what do where army and the country. Well I think that that the headline is that were a lot more. Open about our pot use than it is today I mean this is a big big difference so I think it's something like 47%. Parents who use marijuana you have used it with support for other children 47 point 7% own nearly half. And that's that's remarkable and I think it speaks to just the changing landscape that were seeing a way to stigma. Museums to hide it from your parents yeah parents if they did it hit it from you that's happening less now. Because it's seen as more acceptable socially you know. A there's no medical there's not adjective that the fix that alcohol or cigarettes but it is affixed it marijuana and the popular imagination and so it's. If not seen as as a bad thing as evil thing it's dangerous things used to. Which this degree isn't really surprising writer but do we know is it is it like the legal and policy side shifting of the way we view or is it the way we view it shifting the legal policy. Yeah I think both thing's happening and happening in response to there. So you know one of the most interesting stats that for me from this poll was that. What's I think it's 24 okay sweet ass all Americans in what are you most concerned about children and we give them a list of behaviors. On its largest target children and joke that we also looked at us with parents say the brakes on too much different subgroups but if you look at all Americans. What are you most concerned about children doing smoking cigarettes drinking alcohol having sex cheating on tester are doing pot pot. More people said smoking cigarettes then. Smoking pottery using I want. That's surprising to mean that that it can go back and watch an episode of mad men ever with smoking all the time that certainly wasn't attitude in the 1960s are probably more recently so really is. Change. What you think about anecdotally I guess it makes sense if you think I believe we grew up in our attitudes. But it now when you look at it in the way of familial relationships right you're talking about parents and how they are gonna teach their children about marijuana user acceptability it's at that's what's fascinating hour wanna get into some of the numbers that. One of the fascinating to the headline need to mention most Americans who have tried marijuana at some point in their life now have kits which makes. Right but wait youth. See it like that that might everyone's apparent now who tried pot growing up so the acceptability. Numbers really fascinated me here this is. Basically the country is evenly split and writes do you have those numbers that were on legalization on acceptability like our socially acceptable yet. Yeah I mean we we are seeing a fairly even split on I don't have the numbers in front of it. I trust you on that this isn't to say you're all about it this is a Massachusetts and Massa pulled but yeah we we we we saw that acceptability. Has. You know it's crossed that barrier yeah majority. And we also see when you look at legalization. The legalization of recreational marijuana. Now 49% earned paper that more than 47% post about something that you know not just among people tried pot but the country as a whole now favors legalization. What idiot idiot with ask parents if they thought their kids would approve or wouldn't care right if they use it what you find I pay I have that number here let me grab. So. Way to look at it to unity and you feel you know what you care about you but what you think your kids would would view right you. I borrowed I think it was something sixty yes 60% of parents who tried pot. Think their kids would either approve of their mom or dad's use of recreational pot or wouldn't. That is wishful thinking I don't think this at all I mean you know one of the most startling numbers was. Among. Parents who use pot. I think they said 60%. Send their kids know that they do ranked 70% of adult children who use pot stay at their parents. They use so it's just speaking that openness is just is not. As taboo it's not a statement ties with and the families used to be. Yes what and you mentioned that sort of ranking of concerns for children with cigarettes with the highest concern cigarettes was the highest concern among all Americans. Yeah and hot with downed I was I was actually the second one I'm there has and that if you look at parents parents actually say pot is their biggest concern it let me break this is what's fascinating in this this and I think it's pointing to the changing direction of the country's going it. When you look at parents who've tried pot or used. Either one but he tried it once in your life read it once or twice a year. And they put pot as. The the lowest concern both of those groups if they tried Italy strike if they tried it once their life it was the lowest. The lowest concern after everything else he made it to hit you between Trier and used to write write what's fat tires and want to warn you tripod in your life right. Okay user. Kind of occasionally once or twice a year the enemy had regular users as well. That's once or twice a month as did their attitudes differ absolutely not wildly but they needed obviously people who use it once or twice a month are going to be the most with the least concerned about. In other kids or their effect on their house but I was really surprised by that that list of concerns for children and help our pockets slipped down among people. Who have tried it before even once or twice when. I school. Yet there were other numbers I came across that I guess. When you look at them you know justice as sheer statistics. They're not that surprising though when it when you speak to how far we've come at midnight could accurately be open if you are making. About how whether people share with their spouses or partners in that they'd have tried it or use pot and that was a huge huge number a night out in the ninety's right exactly would you not terribly surprise reading but it is that you think 10152030. Years ago. He just wouldn't talked about. Maybe not yet released a public 6% of people who hide it from that that's actually I wanted to dig into that because I I think it's it must be as fascinating. Subset you know. The husband that still goes out to his attic room just you know smoke potter what is hide it just Heidi back to the argument that that's less and less com. As you mentioned 60% of the parent is that that their kids are aware. If they use it 72% of adult children say that their parents now know. That they fascinate me there's a little bit judgment. But the stigma that still in the number six that's right we've some of these he's regardless of the fact that most people now right or try it that's right there's a little bit of a statement tell me about yet. Setting 9% of Americans say they would have less respect for parents who use this marijuana in front of their child. Well I think part of it is also this distinction between adult children and underage and so when you asked that question. You imagine six year old an apparent smoking a joint. And I don't think anyone's really into that idea behaviors and small number people fit but a lot of people were talking moderate adult children. Need and you we have parents and whether they discussed their shared marijuana would there are those numbers are a lot higher when you underage but that's you know that actives you know note. Very few people are into the idea. Smoking pot assuring public underage but among grownups. When you're a grown up in your parents is a grown up. It's becoming a lot more common targets us origin together. Yeah exactly. Other that they be of the talk that you guys next morning and it is quote clearly settled for five. It speaks to you how far we've come right the country right I mean. So the talk have you had to talk. Quit your your kids semi 3% parents say they have had that talk. One that most interesting things is when you sort of break it down by generation antisense so. 60% of Americans say their parents did not talk to them. But that you did not at all but the older you get that higher that number ago 72% of baby boomers 95%. Greatest generation members. Pretty accurate and agreed to exchange their parents never never never and you Fannie and believe that it yet so it's still pretty high numbers in go to colonials I think it's like. 56. So it's because that the point it is as we move forward in time and media and you look at the younger age groups it's something that people are talking about right. I'm there was another split in there that Phoenix health risk. I. Is this different how easy period you have it's a 73% of the over 69 groups say marijuana as health risks you compare that to land deals it's very respectfully half it's not like you those lyrics yeah and that's it you know when you have something called medical marijuana. Literally used to help your health legal and 29 states. That's gonna change the way people think the drug I mean it's I think that that's a huge influence on it. And when we asked people which is worse for your health. Those directly. Cigarettes alcohol vs tobacco there are certain cigarettes out homers is now want to. It was a four times as many people said of cigarettes and alcohol and Merrill on realist about their I was like six. 75%. Vs 21. Fifteen there's. Me even at a time or numbers rank high on our but we're in that working people go and go to Yahoo! your comments right on the top of the case. We in the American that's right in their next check it out fender Romano Britain avenue think he's ever thanks tonight. Thanks Steve returning as well I you can always go to abcnews.com. For more and go check capital report on Yahoo! site as well we'd in the American family we'll see an accurate and.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Growing number of Americans are tolerant of marijuana use, poll finds",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/video/growing-number-americans-tolerant-marijuana-poll-finds-46844002"
}