{
    "authors": [
        "Abc News",
        "Tara Fowler",
        "More Gio",
        "More Tara"
    ],
    "date_download": "2017-12-12 02:34:48+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "\"Those four guys are heroes,\" PAPBA President Paul Nunziato told ABC News.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fheroic-officers-pinned-nyc-terror-suspect-ground-removed%2Fstory%3Fid%3D51728731.json",
    "image_url": "http://a.abcnews.com/images/US/port-authority-ht-er-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Even as panicked commuters rushed toward them, four officers didn't hesitate to engage the man accused of detonating an explosive in the New York City subway system this morning, leaping on top of the suspect and removing the device before more damage could be done.\nInterested in New York? Add New York as an interest to stay up to date on the latest New York news, video, and analysis from ABC News. Add Interest\nThe explosion occurred in an underground passageway near the Port Authority Bus Terminal, sending commuters scrambling to evacuate a major transit hub just blocks from Times Square. Despite the rush-hour crowds, only five people suffered minor injuries, officials said.\nThe 27-year-old suspect, Akayed Ullah, is in the hospital, badly injured in the arm and torso from the device that went off in his arms, law enforcement sources said.\nPort Authority Police Department Officer Anthony Manfredini apprehended Ullah, with the help of three other officers: Sean Gallagher, Jack Collins and Drew Preston, Port Authority Police Benevolent Association President Paul Nunziato told ABC News Monday evening.\nManfredini was stationed just outside the corridor where the detonation occurred. He \"saw the panic and commotion,\" radioed for help and then entered the corridor with the three other officers, Nunziato said.\n\"They engaged the suspect, who was on the ground, they handcuffed him, they saw wires, cellphone. They made a split-second decision to actually get on top of him and restrain him, and [Manfredini] actually removed the device off of his person before he could further detonate it,\" Nunziato said.\nNunziato praised the officers for their quick action. \"It's a split-second decision based on training. Training and having the moxie to get in there, to put your life on the line. ... I'm extremely proud. They couldn’t have done it any better.\"\nHe added: \"Those four guys are heroes.\"\nTLC\nA law enforcement source said the bomb was built from a 12-inch-long pipe, black powder and rigged with a 9-volt battery and a wire that came from a Christmas light. Because it was strapped to the suspect, the assumption is he had been prepared to die a suicide bomber, the source said. The pipe had nails stuffed into it, the source said, and it had the ability to impose more injuries than it did.\n“This could have been worse,” a law enforcement source told ABC News.\nHowever, the pipe did not fully shatter and a 6-inch piece was discovered fully intact.\nUllah, originally from Bangladesh, told authorities he is self-inspired from ISIS online propaganda, sources said. Ullah told authorities no one directed him to carry out the attack and he talked about the plight of Muslims over the years, a law enforcement source said.\nVideo of the incident, shot by a surveillance camera, shows commuters walking in the passageway when the explosion erupts. The camera screen filled with smoke as people scattered.\nUllah was not expected to be charged Monday but eventually is set to face terror-related federal charges, a law enforcement source said.\nABC News' Emily Shapiro and Aaron Katersky contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Heroic officers pinned NYC terror suspect to the ground and removed bomb, official says",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/heroic-officers-pinned-nyc-terror-suspect-ground-removed/story?id=51728731"
}