{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 09:19:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Australia scraps visa for skilled foreign workers",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Faustralia-scraps-visa-skilled-foreign-workers-46855964.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_3938213913a54d1495bc16af0833c54f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Australia will scrap a temporary visa for skilled overseas workers, the prime minister said Tuesday, arguing that Australians must be given priority over foreigners for local jobs.\nThe popular 457 visa, which allows foreigners to live and work in Australia for up to four years, will be replaced with a stricter scheme that requires a criminal background check and includes tougher English language requirements, Prime Minister Malcolm Turnbull said. The list of occupations that qualify for the new visa will be sharply reduced.\n\"We are an immigration nation, but the fact remains: Australian workers must have priority for Australian jobs,\" Turnbull said in a Facebook video announcing the change.\nThe decision by Australia comes one day before President Donald Trump is expected to sign an executive order that will make changes to a visa program that brings high-skilled workers to the U.S. The White House said the current visa program undercuts American workers by bringing in cheaper labor.\nAustralia's 457 visa was created to address shortages of local workers in certain skilled professions. But critics argued that businesses abused it by paying foreigners lower wages than most Australians would accept.\nTurnbull said the new visa scheme would ensure that businesses only bring in foreign workers who are crucial to filling shortages of critical skills.\n\"It is focused relentlessly on the national interest and in ensuring that temporary migration visas are not a passport for foreigners to take up jobs that could and should be filled by Australians,\" Turnbull told reporters in the nation's capital, Canberra.\nThe 95,000 people already in Australia on 457 visas will not be affected by the change.\nMembers of Australia's far-right political parties, particularly the anti-immigration One Nation party, were fierce critics of the 457 visa, arguing that it was allowing foreign workers to steal jobs from Australians.\nOne Nation leader Pauline Hanson took to Twitter on Tuesday to claim credit for Turnbull's decision.\n\"The government will deny their tough talk on immigration and plan to ban 457 visas is because of One Nation but we all know the truth!\" Hanson tweeted.",
    "source_domain": "abcnews.go.com",
    "title": "Australia scraps visa for skilled foreign workers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/australia-scraps-visa-skilled-foreign-workers-46855964"
}