{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:44:04+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Ray Lewis, Randy Moss, Terrell Owens, Brian Dawkins, Brian Urlacher among 2018 HOF class",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fray-lewis-randy-moss-terrell-owens-brian-dawkins%2Fstory%3Fid%3D52821418.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180202_Wit_and_Wisdom_of_Randy_Moss_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "BLOOMINGTON, Minn. -- It will be one of the youngest groups in the history of the Pro Football Hall of Fame as Ray Lewis, Randy Moss and Brian Urlacher were all selected for enshrinement in the Class of 2018.\nAll three players were in their first year of eligibility and join Terrell Owens and Brian Dawkins as the modern-era selections to be enshrined. Those five players join longtime personnel executive Bobby Beathard (contributor) and seniors committee nominees Jerry Kramer and Robert Brazile for enshrinement.\nThe Hall of Fame's Board of Selectors met Saturday, the day before Super Bowl LII, to select the class. The 15 modern-era finalists were trimmed to 10 and then five. Those five finalists were then voted on with a yes or no for enshrinement. The contributor and two seniors nominees were voted on separately with a yes or no.\nThe Hall of Fame's enshrinement ceremony will be Aug. 4 in Canton, Ohio.\nIt was a day for the 1990s and 2000s NFL as Owens was the modern-era selection who had waited the longest and he was in just his third year of eligibility. Dawkins was in his second year of eligibility.\nLewis was the most decorated of the group as a 13-time Pro Bowl selection, two-time Defensive Player of the Year and Super Bowl MVP in his career as a Baltimore Ravens linebacker. Lewis started 227 games in his career and was credited with eight 100-tackle seasons.\n\"For 17 years, we could point to No. 52 and tell the other players: 'Follow his lead. Practice like Ray practices. Prepare like Ray prepares. Be a great teammate like him,'\" Ravens general manager and executive vice president Ozzie Newsome said in a release from the team. \"It was our privilege to have him as a Raven. We are all better for having him here. His play on gamedays speaks for itself.\n\"Even in that small group who have the honor of being a Hall of Famer, Ray stands out. When you talk about the great players of all time, no matter position, he is among the greatest of the great.\"\nMoss, who played for five teams in his career, is second all-time in touchdown receptions with 156 and had eight 1,200-yard seasons in his career. He played seven full seasons and part of another in Minnesota, site of Sunday's Super Bowl.\nIn the days leading up to Saturday's selection meeting, some wondered if Urlacher would be chosen in the same class as Lewis, as two high-profile players at the same position in largely the same era. But the athleticism and production of the former Chicago Bears middle linebacker tipped the scales.\nUrlacher was an eight-time Pro Bowl selection and the league's Defensive Player of the Year in 2005.\nOwens, who had been a finalist for the past three years, had been a hot-button candidate as well as with his own public criticisms of the board of selectors after he had not been chose for the Hall in 2016 or '17.\nA third-round draft selection of the San Francisco 49ers in 1996, Owens ranks eighth all-time in receptions (1,078), second in receiving yards (15,935) and third in receiving touchdowns (153). He played for the 49ers, Philadelphia Eagles, Dallas Cowboys, Buffalo Bills and Cincinnati Bengals in a career that spanned 15 years.\n\"Terrell Owens gave our organization eight great seasons of service and some terrific memories that will live on in 49ers lore,\" CEO Jed York said in a statement congratulating the six-time Pro Bowler. \"He is one of the most accomplished wide receivers in the history of the NFL, and very deserving of this selection to the Pro Football Hall of Fame.\"\nOwens, who is the only player to score a touchdown versus each of the current 32 teams, acknowledged his selection Saturday in an Instagram post featuring a Hall of Fame hat.\nDawkins played 13 of his 16 NFL season for the Eagles, who will face the New England Patriots in Sunday's Super Bowl. Dawkins, a nine-time Pro Bowl selection, was a rare player to have finished a career with at least 35 interceptions and 20 sacks.\n\"This is tremendous news and I could not be more proud of Brian. Being inducted into the Hall of Fame is an honor he truly earned,\" said Eagles owner Jeffrey Lurie. \"He epitomized everything we love about the game of football. His intensity, his passion, his love of the game and his leadership were always dialed in at the highest possible level.\n\"He connected in every possible way with the city of Philadelphia and our legion of Eagles fans across the country.\"\nBut no former player waited longer than Kramer for enshrinement, who played his last season with the Green Bay Packers in 1968. Kramer was the only guard selected to the NFL's 50th Anniversary team and was a lead blocker for one of the league's iconic plays in the Packers' sweep. Kramer also cleared the way for Hall of Famer Bart Starr to score the winning touchdown in the Ice Bowl, the Packers' 21-17 win over the Cowboys in the 1967 NFL Championship Game.\n\"In the old days when the quarterbacks called their own plays, since most of them were right-handed, they called most of the plays to the right. So the defense would put their best men on that half of the field. Therefore, Jerry Kramer, as a right guard, played against the best defensive tackle every week. He still made All-Pro five times,\" said former Packers linebacker and 2013 Hall of Fame inductee Dave Robinson.\nBrazile was a seven-time Pro Bowl selection as well as a four-time first-team All-Pro. The player known as \"Dr. Doom'' was named to the NFL's all decade team of the 1970s.\nBeathard was a personnel executive for five teams in his career, including Super Bowl winners in the Miami Dolphins and Washington Redskins. He was part of 10 division winners and four Super Bowl winners overall, including the 1972 Dolphins that finished undefeated.\nBecause it takes an 80 percent yes vote for a finalist to earn enshrinement, the votes sometimes cancel each other out if players are clustered at one position group. With two wide receivers in Owens and Moss as well as two linebackers in Lewis and Urlacher selected for enshrinement, it was a difficult day for five former offensive linemen who were finalists.\nJoe Jacoby didn't make the cut from 15 finalists to 10, while Tony Boselli, Alan Faneca, Steve Hutchinson and Kevin Mawae did not make the cut from 10 remaining modern-era finalists to five.\nJacoby and former cornerback Everson Walls were both in their final year of eligibility as modern-era candidates. They now move to the seniors category and can only be considered for enshrinement if the seniors committee selects them as a nominee, a difficult proposition with the current backlog. Walls had not made the cut from 10 to five.\nFormer Patriots cornerback Ty Law was also eliminated in the cut-down from 10 to five. Wide receiver Isaac Bruce, running back Edgerrin James and safety John Lynch were eliminated in the cut-down from 15 to 10.",
    "source_domain": "abcnews.go.com",
    "title": "Ray Lewis, Randy Moss, Terrell Owens, Brian Dawkins, Brian Urlacher among 2018 HOF class",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/ray-lewis-randy-moss-terrell-owens-brian-dawkins/story?id=52821418"
}