{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:47:18+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Advocates demand New York lawmakers outlaw child marriage",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fadvocates-demand-york-lawmakers-outlaw-child-marriage-45495297.json",
    "image_url": "http://abcnews.go.com/US/wireStory/advocates-demand-york-lawmakers-outlaw-child-marriage-45495297",
    "language": "en",
    "localpath": null,
    "maintext": "Child advocates in New York are attempting to overturn a law that allows children as young as 14 years old to wed because they say it can trap minors in sexual abuse and domestic violence.\nDemocratic Assemblywoman Amy Paulin on Tuesday introduced a bill to raise the minimum age for marriage to 17. New York is one of three states that allow 14-year-olds to marry with parental and judicial consent.\nPaulin called the law an appalling loophole for adults to sexually abuse children and avoid statutory rape charges.\n\"I can't even begin to imagine the physical, psychological and emotional traumas these children have suffered,\" she said. \"We must safeguard the health, safety and welfare of our children, who are the future of our society.\"\nAccording to data from the Tahirih Justice Center, a nonprofit that protects immigrant women and girls, and the National Conference of State Legislatures, North Carolina and Alaska also allow 14 year olds to marry with parental and judicial consent. Twenty-seven states have no minimum age in state statutes, meaning children of any age could technically marry with court approval.\nPaulin said children have no escape from forced marriages because minors have limited access to legal services and domestic violence shelters. Paulin's proposal would prohibit marriage of children under 17, and children age 17 to 18 would require court approval.\nFraidy Reiss, founder and executive director of Unchained at Last, a nonprofit to end forced marriage, said religion, economic status and tradition motivate thousands of forced child marriages a year.\nHealth department data shows that between 2000 and 2010, 3,853 minors were married in New York. Eighty-four percent were minor girls married to adult men.\n\"The impacts of child marriage on a girl's life are devastating and long-lasting, undermining her health, education and economic opportunities and increasing her risk of experiencing violence,\" Reiss said.\nSafia Mahjebia of New York's Brooklyn borough was 16 years old when a close friend in her tight-knit Bangladeshi community was forced into a marriage with a 25-year-old man.\n\"Our immediate response was unanimous fear. Fear for her safety, fear for her future, and fear in the air to know you could be next,\" Mahjebia, now 20, said.\nMahjebia said she felt betrayed to learn the marriage was legal in New York, and it was only her parents' ignorance of that fact that prevented her own marriage as a young girl.\nAdvocates from Unchained At Last and the Human Rights Watch wore white gowns and chains on their wrists outside the Assembly chamber Tuesday singing \"Save the girls. Be the change. Help us to break the chains.\"",
    "source_domain": "abcnews.go.com",
    "title": "Advocates demand New York lawmakers outlaw child marriage",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/advocates-demand-york-lawmakers-outlaw-child-marriage-45495297"
}