{
    "authors": [
        "Abc News",
        "More Molly"
    ],
    "date_download": "2017-02-15 10:23:31+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Trump will host Netanyahu to talk Iran, Middle East peace",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Ftrump-host-netanyahu-meeting-focused-iran-middle-east%2Fstory%3Fid%3D45483068.json",
    "image_url": "http://a.abcnews.com/images/International/ap_bibi_don_dc_170215_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Israeli Prime Minister Benjamin Netanyahu will meet face-to-face with President Trump on Wednesday, setting the tone for what both leaders hope to be the dawn of a new era for the U.S.-Israel relationship. Analysts say that the meeting will hope to project a public theme of unity between the two governments on topics including Iran, Israeli settlements and the fate of the peace process.\n\"Both President Trump and Prime Minister Netanyahu have a very big stake in wanting to demonstrate that whatever the problems were with the last administration, they're now gone,\" Dennis Ross, a diplomat and former special Middle East coordinator under Clinton, told reporters on a call this week.\nWhile close security and economic ties between the U.S. and Israel continued and expanded during the previous U.S. administration, Netanyahu and then-President Obama often sparred on a number of key issues, particularly over the contours of an Israeli-Palestinian peace agreement and the U.S.-brokered Iranian nuclear deal, which the Israeli leader forcefully denounced.\n\"There's a strong presumption [now] to send a message how close things are between the two leaders ... to demonstrate that the U.S. and Israel are on the same page strategically and practically,\" Ross added.\nAnalysts say that while Iran is likely to figure at the top of Netanyahu's agenda, Israeli settlements, the location of the U.S. Embassy and the peace process are also likely to factor in.\nIran\n\"The Prime Minister probably comes in with an agenda very heavily focused on Iran,\" Ross said.\nMuch of that focus concerns Iranian policy in the region and the nuclear agreement signed in 2015 between Tehran and the so-called P5+1, which Netanyahu opposed.\nDuring his campaign, Trump voiced strong opposition to the Iran nuclear deal and in recent weeks has taken to Twitter to directly threaten Iran. While the administration has thus far continued U.S. participation in the agreement, Trump has expressed an interest in re-negotiating its terms.\nRoss said Netanyahu is unlikely to demand a scrap to the agreement altogether, in part because he is determined to work well with Trump out of the gate.\n\"I think what he [Netanyahu] wants is some understanding -- and awareness not just about enforcement of the deal but that more needs to be done to deter the Iranians,\" Ross said.\nWriting on Facebook on Jan. 30 after an Iranian ballistic missile test, Netanyahu said that “Iranian aggression must not go unanswered,” pledging to discuss with Trump “the renewal of sanctions against Iran in this context and in other contexts.”\nIn retaliation to the ballistic missile test, the Trump administration on Feb. 3 announced sanctions against Iran, a narrowly tailored action that did not alter the terms of the nuclear agreement that saw Iran receive sanctions relief in exchange for curbs to Tehran’s nuclear program.\nEmbassy moves\nOn the campaign trail, Trump pledged to move the U.S. embassy from Tel Aviv to Jerusalem, a move opposed by past U.S. administrations because both Israelis and Palestinians claim it as their capital. The U.S. has long maintained that the status of the city should be determined in final status negotiations between the two parties.\nStill, there have been some suggestions that Trump has slightly softened his stance.\n\"His policy seems to be settling back into the mean,\" former U.S. Ambassador to Israel under President Obama, Daniel B. Shapiro, told Israeli TV channel i24, \"which is to support efforts to a two-state solution, to support efforts to limit settlements and not to do things that might be disruptive and moving the embassy might fall into that category.\"\n\"It's not an easy decision,\" Trump said last weekend to the Israeli right-wing newspaper Israel Hayom, a free daily which is supported by Trump donor and Netanyahu patron Sheldon Adelson. \"It's been discussed for so many years. No one wants to make this decision, and I'm thinking about it seriously.\"\nBut Netanyahu has long supported the move, and is likely to again bring it up.\n“Jerusalem is the capital of Israel, and it is proper that not only should the American Embassy be here, but all embassies should come here,” Netanyahu said in January.\nSettlements\nSince Trump took office on Jan. 20, Netanyahu has ratcheted up settlement expansion, a signal that the White House is far less critical of building in the occupied Palestinian territories than past administrations.\nIn the last three weeks, Netanyahu announced the approval of more than 6,000 housing units and the first new settlement since the 1990s. The United Nations considers settlements illegal, and they have long been a bone of contention between the U.S. and Israel.\nBut Trump's pick for U.S. Ambassador to Israel, David Friedman, is an ardent supporter of Israeli settlements and has opposed the two-state solution.\nNonetheless, Trump in the same interview with Israel Hayom seemed to moderate past statements, saying settlements were an obstacle to peace.\n\"There is limited remaining territory. Every time you take land for a settlement, less territory remains,\" he told the newspaper. \"No, I'm not someone who believes that advancing settlements is good for peace.\"\nPeace negotiations\nPresident Trump has called reaching an Israeli-Palestinian peace the \"ultimate deal,\" and has identified his son-in-law and senior adviser the president Jared Kushner as the man for the job.\n\"I think we can reach an agreement and that we need to reach an agreement,\" Trump told Israel Hayom. \"I want Israel to act reasonably in the peace process,” he added.\nBriefing reporters Tuesday night, a White House official said that the peace process was a priority, but would not commit to pushing the two-state solution which has been the cornerstone of U.S. policy on the Israeli-Palestinian conflict for decades.\n\"Maybe, maybe not,\" the official said in response to a question about the two-state solution. \"It's something the two sides have to agree to. It's not for us to impose that vision.\"\nThe official added: \"We're looking at the two sides to come together to make peace together and we'll be there to help them.\"\nWhen asked by a reporter on the tarmac leaving Tel Aviv this week if he stands by a two-state solution, which he has at various times opposed or supported, Netanyahu responded: “Come with me, you will hear very clear answers, very clear answers.\"",
    "source_domain": "abcnews.go.com",
    "title": "Trump to host Netanyahu in meeting focused on Iran, Middle East talks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/trump-host-netanyahu-meeting-focused-iran-middle-east/story?id=45483068"
}