{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:46:13+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Bure shares the sweet moment Whoopi Goldberg comforted her backstage at \"The View.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Fcandace-cameron-bure-hardest-days-view-54696554.json",
    "image_url": "https://s.abcnews.com/images/theview/180424_view_candice_cameron_bure_1141_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Candace Cameron Bure on one of her 'hardest days' at 'The View'\nAnd since he left the table on her answer is full house and riding her brand new book called kind. Isn't new classy. Please welcome back the fabulous cat does cameramen. I know that I. Only boats. Though we have we were just talking about seeks to DC add IDA. And I just saw that a picture it think was texted. I know home. Oh wow we believe we don't know a lot of sneaks because my brother was allergic to see if I don't find dogs and my phone. So we actually are you can't yeah. So and so they had like a pretty tight bonds that worked ten and twelve heat and lots of Billiton sectors. And think I kept as pets. I east taking out its fleet and standards then this sneak inside when it real good size fits them really they're really smooth with. I would worry about them constricting me face or neck without me right now. You for stories about yeah I can I not I can understand well yeah they kind of Woodbury is gaining New York's your skin going to act like. We're play but until that wet and her whole night and I can't risk their hours later and radio gas I don't know what it is pretty accurate in Maryland recipe yeah. Note also you in your husband vowed have guessed three kids. Yet top studies twin look at all my bets I lost my Dari almost were rounding up yet led is eighteen. Yet Max is sixteen yes we. I ate and I feel like that time flew by I remember when you first had been watching you and now you're here does it feel weird to have grown adult children. And can you read here between many of the part. Yeah I think not if you spray but it's a little weird that I'm going to be an empty Masterson on he has its two excellent I can't visit your bracket my best French. Home joy and I happen here is he won't messages app known wild columnist that it's a little weird because my best friend just had her first baby. And yet. Where the vaccine may we are end and I am way it laughed about it gets added to her feet hit the gas and I want you themselves exact minute gentlemen going off to college and had a Tosh and then I have Max for a couple years left well at home let's just have another one do you stop. I'm. And it flow I think I haven't had a snake an adult I am I thought to have this lovely book. I knew classy yes way you basically say to be kind is a good idea which we agree with but I fact that. It's very hard to be kind all the time had he snapped. Of course I have tell us about I can't think you at the table and quiet and I'm not everybody who think my goodness I certainly have of course I mean. I'm the aryan IE that the sad things that I and regrets of my husband I have spoken out at -- I remember this one time I was at an ice cream shop trying to get a cable. Forget Tosh is birthday and they didn't have the right Kate and I and yelled at this port eighteen year old kid behind the counter or because. Really I was just pouring out my frustration that I did not prepare and was going to fail her birthday without having indicated. And to get out on this kid and I felt awful and I did go back yeah I'm tired selects. I apologize I won't act guys I sold the book is basically tried to be as kind as possible because we all failed. True value we have what we are able to make that choice every single diet we embrace its renewed and. Every day so we can make a choice to week hi I'm excited crowd. You begin the book so with the story about 1 morning here at the view. And it was December 2015 it was the day of the horrible shooting in San Bernardino California. I'm not very far from where your kids were in school and you know you were having a really tough time that day it was. It was one of the hardest days on the shelf for me and all the schools were on lockdown my kids were in school. Their schools were on lockdown and I felt so far away I felt like I was helpless. Because I couldn't. Beat like that and I was crying I didn't know how to really. Cope with it I was in my composite. With the door shot curled in a ball crying and praying because OPEC acted on live television and twenty minutes I don't know Condit and make it rep. And there is it's very persistent knock at the door and then I was hoping would go away a hit and didn't. What they and that when I open the door was booked and she just stood there and he asked if he could come and think yes he just went command when did need. And I hadn't jail and you hugged me and I cried into your shoulder. And you didn't let me go which made me feel even more incredible because he we're just my mom your mom and they are protecting me. And he said I'm not gonna let you. Fail our fall out there need to speak from the heart to they think she could feel that's. And you're kindness. I hope I don't face people in that situation but you know what's the first thing I won't think of because it needs such an impact on me what you did. That I will. I want to be there and do that for someone if that happens to them the residents within a I want I guess he. Let us active kind saying that comes at a and a Candace you are on the shallow and you had a different point you have been the other early is. I guess there was one another people who did it before me you have a hard time did not I'm not. I. That is right hander on corners and now I think the hardest part for me was the re bottle. Wasn't afraid to share my opinion I can get that part out but then went on how they challenging have gone like I didn't even battered yeah. An addict yeah are different women yeah. Yeah. Each other out so well yeah yeah let me Stanley doesn't it sometimes remind you of that dinner on a ride like what everyone's jumping on each other women. It's sometimes thought might be only we all have. Very similar points of view so what happens sometimes but where would. You should come visit our means less and yeah. Not you I'm. Passionate. Fuller house's bill renewed Lauren NASCAR scene. On screen we know what. Your life offscreen there's a lot of things happening for your friends and cast meets we have Bob Saget getting married if you. John stay Amos and his wife just what went a little baby adding the space on reality he's great on the show with kids what do you think when the babies never leave them like they're actually just to keep. He added he's going to be amazing he's been looking forward to this for so long it's all he's talked about and Caitlin it's just a doll his wife and she's going to be wonderful and the Canadian easing parent and a parishioner. Has yeah and you're directing an episode directing NASA I don't. Yeah yeah yeah. Challenge in trying to take nothing just go for written be Obama hagel has yet to continue. To have to direct the actors right. I. I got really serious thought yeah commercial and ask. Doesn't come back at you directed your first step aside and tell us what was yeah and it that I love tale. I think so our friend Candace Cameron were raised kind as the new class of the power living graciously comes out today and you know what job. You're all gonna get to find out exactly what you saw.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Candace Cameron Bure on one of her 'hardest days' at 'The View'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/candace-cameron-bure-hardest-days-view-54696554"
}