{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:53:04+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Falleged-drug-ring-leader-brought-colombia-us-court-54700084.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_ffd1691e887d4220b4fe2a999c58fbaa_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Daniel Rendon-Herrera, the alleged leader of a homicidal drug ring that imported tons of cocaine from Colombia into the U.S., was charged with leading a continuing criminal enterprise, authorities said.\nColombia's most wanted drug lord, also known as \"Don Mario,\" pleaded not guilty in Brooklyn federal court Tuesday after being captured in a jungle raid nine years ago and extradited to the U.S. on April 23.\n\"Don Mario is one of the most significant drug traffickers of our time, recognized for moving multi-ton shipments of cocaine to the United States at a moment's notice,\" said New York Police Commissioner James O'Neill.\nRendon-Herrera's attorney said she's \"looking forward to representing him.\"\n\"We are looking at disposing of the cases in one way or another,\" Johanna Zapp said, adding that her client also was charged in the Southern District.\nRendon-Herrera's organization sent U.S.-bound shipments of cocaine from Colombia through Central America between about June 2003 and December 2014 and employed hit men who carried out acts of violence across North and South America, authorities said.\n\"Don Mario was the most feared narco-terrorist in Colombia,\" Drug Enforcement Administration Special Agent in Charge James Hunt said in a statement.\nColombia's far-right militias, known as the United Self-Defense forces of Colombia, initially formed in the 1980s to counter kidnapping and extortion by rebels but evolved into regional mafias that committed more than 10,000 murders.\nThe militias built lucrative cocaine trafficking operations and stole millions of acres of land, often in collusion with local political, business and military leaders, prosecutors said.\nRendon-Herrera and his brother controlled an area of river-laced jungle near the Panama border that has long been a major corridor for drug and arms traffickers.\nThe brothers were among the last paramilitary leaders to demobilize under a 2003 peace deal that promised fighters reduced sentences and protection from extradition to the United States if they confessed to all their crimes.\nWhile his brother and other paramilitaries agreed to await justice in jail, Rendon-Herrera fled back to the jungle and rearmed, according to police.",
    "source_domain": "abcnews.go.com",
    "title": "Alleged drug-ring leader brought from Colombia to US court",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/alleged-drug-ring-leader-brought-colombia-us-court-54700084"
}