{
    "authors": [
        "Abc News",
        "More Matthew"
    ],
    "date_download": "2017-12-11 14:33:46+00:00",
    "date_modify": null,
    "date_publish": "2017-12-10 00:00:00",
    "description": "OPINION: Alabama Senate race highlights new 'tribalism' that threatens our democracy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Falabama-senate-race-highlights-tribalism-dangerous-us-democracy%2Fstory%3Fid%3D51704254.json",
    "image_url": "http://a.abcnews.com/images/Politics/roy-moore-ap-er-171208_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A little over 150 years ago, our tragic, violent Civil War came to a close.\nInterested in Roy Moore? Add Roy Moore as an interest to stay up to date on the latest Roy Moore news, video, and analysis from ABC News. Add Interest\nIt was fought by forces on one side who wanted to preserve the Union, the ideals our Constitution were based on, and the achievement of a common good for all Americans. On the other side were people driven by tribalism and values such as a support for slavery more than any belief in the Union or the larger good.\nThere was no guarantee the Union would survive, but it did because patriotic Americans stepped forward to preserve our Republic.\nThe secession of the Confederate states was a dramatic way to fight for one’s own tribe and to do damage to America and to the Union of folks who believed in the common good.\nToday, we are again faced with a group of Americans fighting against our Union and the common good in order to advance the interests of their tribe. This is incredibly dangerous to our democracy and the ideals based in our Constitution.\nA nation can have a healthy, functional democracy only if its citizens are willing to go beyond the interests of their tribe and work for the common good.\nAP\nWhen tribalism is the most powerful drive, democracy either can’t exist or it is not functional. Citizens have to be able to walk away from their tribes, compromise, and build a system that is good for all. We are at a key moment today where what color jersey one is wearing is more important to folks than the common good of the country.\nThis week a key Senate race highlighting this tribalism is happening in Alabama, and is again endangering our Union and putting our American ideals at risk.\nA group of voters in Alabama have decided that ideology and party are more important than integrity and the common good and they are fully embracing Roy Moore in a most tribal way.\nMoore, 70, has been accused by eight women of actions ranging from inappropriate behavior to sexual assault when he was in his 30s and in most of the cases the women were in their teens. He has denied the allegations.\nRichard Drew/AP\nEven apart from the disturbing allegations, Moore seems to have no interest in a strong America based on our diversity or on people coming together for the common good. His vision is of an America that is white, with a corrupt version of Christianity and a patriarchy where men have the power.\nWe saw this same wave in last year's presidential election.\nA huge part of President Trump’s support was rooted in a similar tribalism that sees a changing America demographic landscape as a danger.\nThis kind of failure to embrace values of tolerance, integrity, and equal rights for all is what many of our founders feared more than two centuries ago.\nAnd, yes, partisanship is a cause of concern among those wearing red or blue jerseys as we would hope all could put country over party.\nDrew Angerer/Getty Images\nWhat has emerged last year in our elections, in the decisions by this administration, and in the response from different tribes around the country especially at this moment in Alabama takes this to a dangerous extreme.\nWhile states haven’t voted to secede from the union, and there is no violent war between fellow Americans, what is going on poses an inherent threat to our Union and the health of our Republic.\nWhen voters and, worse, their leaders, refuse to work toward the common good but push only for the benefit of their tribes, they are taking the same undemocratic steps as leaders from an era many thought was long gone.\nThe vast majority of Americans agree on the fundamental ideals and norms of democracy and on solutions to some of our biggest concerns of the 21st century.\nBut the strengthening tribalism is preventing us from acting on what consensus exists toward a larger common good.\nMost citizens support commonsense gun reform — it isn’t getting done.\nMost citizens want fiscal responsibility and a balanced budget — it isn’t happening.\nMost citizens want a tax code that benefits all Americans and greater sacrifice from those most blessed with wealth — the opposite is occurring.\nMost citizens believe in tolerance and respect for all religious beliefs, races, sexuality, and cultural diversity. But too often the tribes of hate have the loudest voices.\nThis tribalism poses a grave risk to the United States as a functioning democratic republic.\nI said last year the divisions in America were as strong as any time since the Civil War, and many criticized this comparison. Unfortunately, the truth of this has become so clearly apparent.\nToday, the tribalism that emerged in the minds and hearts of those who supported secession long ago is visible again, though in a different way.\nIt is just as dangerous to this great American experiment. Let us all push back against this and fight again for our Union and for making the common good our driving principle.\nWe need a new round of patriots who are willing to step forward and protect our Union.",
    "source_domain": "abcnews.go.com",
    "title": "OPINION: Alabama Senate race highlights new 'tribalism' that threatens our democracy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/alabama-senate-race-highlights-tribalism-dangerous-us-democracy/story?id=51704254"
}