{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 13:46:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "US medal dominance could reflect doping cleanup in track",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fus-medal-dominance-reflect-doping-cleanup-track-49204145.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_3417da4bab634620905b74a8c662e021_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For years, athletes from the United States have quietly wondered how they might have fared if they had been competing on a level playing field. This year, they may have found out.\nFinal figures from the medals standings at the world championships that wrapped up Sunday offered evidence that track and field's attempt to crack down on a global doping crisis could be making a direct impact on the results themselves.\nExhibit A: The United States won 30 medals, while athletes from four countries that have been under the doping microscope — Kenya (11), Russia (6), Ethiopia (5) and Jamaica (4) — combined for 26.\nTwo years ago, the results looked like this: United States 17, Kenya 16, Jamaica 12, Ethiopia 8, Russia 4.\nFour years ago, with Russia competing on home turf and in the midst of what investigators have determined was a state-sponsored doping conspiracy, they looked like this: United States 26, Russia 14, Kenya 12, Jamaica and Ethiopia 10 each.\n\"Maybe the only good byproduct of the past corruption and scandal is that it forces sport to make sure it never happens again,\" said Travis Tygart, the CEO of the U.S. Anti-Doping Agency. \"Ultimately, that's good for clean athletes.\"\nAmong the changes that have taken place over the last two years:\n—The suspension of the Russian track federation. Only 19 Russians competed at this year's worlds, 100 fewer than were present in Moscow in 2013. The 19 competed as neutral athletes because the IAAF determined they've been under proper anti-doping controls.\n—Five countries, including distance-running powerhouses Kenya and Ethiopia, have been placed on a doping watch list — meaning they are being closely watched because of evidence that has surfaced about less-than-robust anti-doping procedures in those countries. Jamaica has also been under increased scrutiny, which has led to the stripping of a 2008 Olympic relay medal because of doping by one of Usain Bolt's teammates.\n—The IAAF has established an independent testing authority that takes responsibilities for conducting the anti-doping program out of its hands. A handful of former IAAF leaders are under investigation for their roles in doping cover-ups and related corruption.\n\"We have to be open about it,\" IAAF president Sebastian Coe said. \"There's been a disproportionate amount of damage to the sport produced by a relatively small number of nations, and we just have to get on top of that.\"\nAs a sign of the IAAF's willingness to tackle the issue head-on, the meet began with the reallocation of medals from 11 races dating to 2007.\n\"It's not a Russia thing, but it is a thing that sometimes you get out there and you wonder, 'Do I have a fair shot at this? If I'm doing the right thing, is everyone else doing the right thing?'\" said American sprinter Natasha Hastings, who received a reallocated relay gold from 2013.\nIt's a refrain shared up and down the roster in the United States, where athletes are widely considered to be subject to one of the world's toughest anti-doping programs.\n\"It's not uncommon for athletes in our training group to get tested every month,\" said U.S.-based track coach Loren Seagrave, who trains athletes from several countries. \"On some occasions, you get tested on one day, and they show up again the next day. I think they're as vigilant as they can be.\"\nOf course, it's a delicate proposition to attribute all these numbers to doping, or to assume all the problems are fixed. From Marion Jones to Tim Montgomery to Tyson Gay, Americans have a history of doping positives, reflected most starkly during this meet by the fans' reaction to Justin Gatlin. The 100-meter champion was roundly booed at every turn because of his doping history — he's served two bans.\n\"I thought in 2012, I was in a cleaner race, and it turns out that Olympic final was probably one of the dirtiest in history,\" said American middle-distance runner Shannon Rowbury, who finished out of the medals in a race in which no fewer than five of the 1,500-meter finalists have been investigated for doping violations.\nExhibit B (perhaps): Eleven of this year's 14 winning sprint times, including relays and hurdles, were slower than in 2013, which was the last world championships held the year after the Olympics. But a portion of that — as well as Jamaica's paltry showing, with only four medals — could be attributed to Bolt's rough week; he won bronze in the 100 meters and pulled up lame in the 4x100 with a hurt left hamstring.\nThe champion took umbrage to the linking of slow times and doping, calling it \"disrespectful.\"\n\"There's something called injury and sometimes, everything doesn't go as smoothly as you want,\" Bolt said. \"We came out and put on a good show for everyone.\"\nNobody enjoyed the show more than the Americans, whose 30 medals were only two short of what they picked up last year at the Olympics in in Rio de Janeiro, when some of the reforms were starting to take hold and Russia only sent one track and field athlete.\n\"There was a lot of shuffling, some medalists were completely unexpected,\" said American long jumper Tianna Bartoletta, who won a bronze medal. \"Whatever the explanation, it's promising. I'm encouraged by what I saw here this week.\"\n———\nMore AP track coverage: https://www.apnews.com/tag/London2017",
    "source_domain": "abcnews.go.com",
    "title": "US medal dominance could reflect doping cleanup in track",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/us-medal-dominance-reflect-doping-cleanup-track-49204145"
}