{
    "authors": [
        "Abc News",
        "More Rym"
    ],
    "date_download": "2017-12-11 15:40:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Saudi Arabia to reopen cinemas that have been banned since 1980s",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fcinemas-reopen-saudi-arabia-crown-prince%2Fstory%3Fid%3D51713660.json",
    "image_url": "http://a.abcnews.com/images/International/saudi-arabia-cinema-audience-gty-ps-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Cinemas are set to open in Saudi Arabia in March 2018 for the first time since they were banned in in the early 1980s, according to the Saudi minister of culture.\nInterested in Saudi Arabia? Add Saudi Arabia as an interest to stay up to date on the latest Saudi Arabia news, video, and analysis from ABC News. Add Interest\n\"It's a beautiful day in Saudi Arabia!\" tweeted Haifaa al-Mansour the first female Saudi director of a feature film, the acclaimed \"Wadjda\".\nThis is the second major social reform, after the lifting of the ban on women driving, announced in recent months as part of Saudi Crown Prince Mohammed bin Salman's \"Vision 2030\", a socioeconomic program aimed at modernizing the Saudi economy and shepherding the conservative kingdom into the 21st century.\n\"This is the best news! I've been waiting for it for 33 years\" said Nahar Alhamrani, a self-described movie fanatic from Jeddah. \"It will spark creativity and help build a change in people's mindset.\"\nCinemas existed in Saudi Arabia until they were banned in the early 1980s after a puritanical religious establishment gained control over social and educational affairs in the country.\n\"Today, the organized Islamist undercurrents that thrived in the 1980s and the beginning of the 1990s no longer have influence in society,\" said Mohammed Alyahya, a nonresident fellow at The Atlantic Council.\nBack then, \"young and old people traded DVDs, downloaded movies and visited Bahrain to watch movies. The reintroduction of movie theaters is long overdue\" added Alyahya.\nFayez Nureldine/AFP/Getty Images, FILE\nA multimillion-dollar bootleg industry flourished as a result. Saudis amassed large collections of pirated DVDs of the latest Hollywood blockbusters, circumventing both the ban and censorship. It’s this revenue that the decision today also aims to recapture.\n\"Opening cinemas will act as a catalyst for economic growth and diversification,\" said Minister of Culture Awwad Alawwad. \"By developing the broader cultural sector, we will create new employment and training opportunities, as well as enriching the kingdom's entertainment options\"\nThe Saudi cinema industry is still nascent but has been receiving more attention over recent years with breakthrough movies like \"Wadjdah\" and \"Barakah meets Barakah.\"\nIn September, it was announced that Saudi actress Ahd Kamel will star in the Netflix series \"Collateral.\"\n\"Born a King,\" a coming-of-age story about the teenager who would become King Faisal, wrapped filming last month. It is the first Saudi English-language feature film officially licensed to be shot in the kingdom.\nThe announcement by the ministry of culture did not specify whether seating in cinemas would be gender-segregated as most public spaces are in Saudi Arabia or how heavily censored movies will be. Films are usually greatly censored with pixelation added to cover the chest and legs of actresses, as seen on a recent Saudi Airlines flight. Regulations are expected to be announced in the coming weeks.\nMultiple malls currently being built had already received licenses to build multiplexes before today's announcement.\nBy 2030, over 300 cinemas with 2000 screens are expected to have opened across Saudi Arabia.",
    "source_domain": "abcnews.go.com",
    "title": "Saudi Arabia to reopen cinemas that have been banned since the 1980s, says crown prince",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/cinemas-reopen-saudi-arabia-crown-prince/story?id=51713660"
}