{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:44:07+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Sources: Ray Lewis, Randy Moss, Terrell Owens, Brian Dawkins, Brian Urlacher among 2018 HOF class",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsources-ray-lewis-randy-moss-terrell-owens-brian%2Fstory%3Fid%3D52820892.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180202_Wit_and_Wisdom_of_Randy_Moss_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Former linebacker Ray Lewis, receiver Randy Moss and linebacker Brian Urlacher have been elected to the Pro Football Hall of Fame in their first year of eligibility, sources told ESPN.?\nThey are joined in the Class of 2018 by?Terrell Owens and Brian Dawkins as the modern-era selections to be enshrined, sources said. Owens was in his third year of eligibility and third as a finalist, while longtime? Eagles?safety Brian Dawkins was in his second year of eligibility.??\nOwens, who ranks third all-time in career receiving yards and receiving touchdowns, acknowledged his selection in a tweet prior to the official announcement at Saturday night's NFL awards show.\nLongtime personnel executive Bobby Beathard (contributor) and seniors committee nominees Jerry Kramer and Robert Brazile were also voted into the Hall, according to sources.?\nLewis, who played his entire career with the Baltimore Ravens, was the most decorated of the group as a 13-time Pro Bowl selection, two-time Defensive Player of the Year and Super Bowl MVP.\n\"For 17 years, we could point to No. 52 and tell the other players: 'Follow his lead. Practice like Ray practices. Prepare like Ray prepares. Be a great teammate like him,'\" Ravens general manager and executive vice president Ozzie Newsome said in a release from the team. \"It was our privilege to have him as a Raven. We are all better for having him here. His play on gamedays speaks for itself.\n\"Even in that small group who have the honor of being a Hall of Famer, Ray stands out. When you talk about the great players of all time, no matter position, he is among the greatest of the great.\"\nMoss, who played for five teams in his career, ranks second all-time in touchdown receptions with 156 and had eight 1,200-yard seasons in his career. He played seven full seasons and part of another in Minnesota, site of Super Bowl LII.?\nThe Hall of Fame's enshrinement ceremony will be Aug. 4 in Canton, Ohio.",
    "source_domain": "abcnews.go.com",
    "title": "Sources: Ray Lewis, Randy Moss, Terrell Owens, Brian Dawkins, Brian Urlacher among 2018 HOF class",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/sources-ray-lewis-randy-moss-terrell-owens-brian/story?id=52820892"
}