{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:38:20+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Sen. John McCain responded to the release of the memo, saying it serves no American's interests, only Putin's.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fpresident-trump-calls-newly-released-memo-vindication-52819817.json",
    "image_url": "http://a.abcnews.com/images/WNT/180203_wn_wright3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for President Trump calls the newly released memo 'vindication'\npresident trump claiming total vindication. The president traveling with the first lady to mar-a-lago capping a whirlwind Friday. In which he declassified that controversial GOP memo. Despite a wide range of reaction even within his own party, trump wasted no time declaring victory. Tweeting his takeaway, no collusion, no obstruction. But special counsel Mueller is not finished yet. Several in trump's inner circle remain under scrutiny. Also outstanding questions about the substance of the memo and potential damage done to the intelligence community. ABC's David Wright. Reporter: Today in Florida, president trump celebrated his quote/unquote, vindication. Tweeting, \"This memo totally vindicates 'trump' in probe. But the Russian witch hunt goes on and on. This is an American disgrace!\" A lot of people should be ashamed of themselves and much worse than that. Reporter: The author of the newly released memo claims the document is proof that the Russia investigation is a partisan witch hunt. They got a warrant on someone in the trump campaign using opposition research paid for by the democratic party and the Hillary Clinton campaign. That's what this is about. And it's wrong. And it should never be done. Repter: But some members of the president's own party see it differently. This is a completely separate matter from Bob Mueller's investigation, and his investigation should be allowed to take its course. Let's release the memo. Oh, don't worry. 100%. Reporter: At the state of the union this week, trump was already intent on releasing the memo. And there was this line in the speech. So, tonight, I call on congress to empower every cabinet secretary with the authority to reward good workers and to remove federal employees who undermine the public trust or fail the American people. Reporter: Asking for carte Blanche to remove federal employees who \"Undermine the public trust or fail the American people.\" Fast forward to Friday, and trump's cryptic answer to questions about deputy attorney general rod Rosenstein, who, according to the GOP memo, mishandled that early warrant for a wiretap in the Russia investigation. Does it make you more likely to fire Rosenstein? Do you still have confidence in him after reading the memo? You figure that one out. Reporter: It was Rosenstein who appointed special counsel Bob Mueller and he is the only public official empowered to fire Mueller. And David is in Florida with the president. David, ABC news has obtained the Democrats' response to the nunes' memo and it says the president should not remove Rosenstein. That's right, Tom. This is it. A six-page memo written by congressman Jerry Nadler, the ranking member of the judiciary committee, circulating today to house Democrats. We should make clear that's not the classified democratic memo but the most detailed response yet to the nunes' memo. What this document says there's no credible basis to remove rod Rosenstein. It also accuses the Republicans of being part and parcel of the president's effort to obstruct justice. David Wright for us tonight. David, thank you. George Stephanopoulos will have much more on the memo released tomorrow on \"This week.\" With representatives Adam Schiff. Next, a new arrest tied to\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "President Trump calls the newly released memo 'vindication'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/president-trump-calls-newly-released-memo-vindication-52819817"
}