{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 21:41:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Larry Eustachy put on administration leave by Colorado State amid conduct investigation",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Flarry-eustachy-put-administration-leave-colorado-state-amid%2Fstory%3Fid%3D52818400.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0203/dm_180203_ncb_bilas_on_trae_young/dm_180203_ncb_bilas_on_trae_young_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Colorado State men's basketball coach Larry Eustachy has been placed on administrative leave amid an internal investigation into his conduct with players and other staff members.\nColorado State athletic director Joe Parker announced Eustachy's temporary leave in a statement Saturday, just hours before the Rams' home game against Nevada.\n\"I have asked head coach Larry Eustachy to temporarily step away from the men's basketball program, as he has been placed on administrative leave while we conclude our climate assessment,\" Parked said. \"We are diligently working through this assessment as expeditiously as possible, understanding the importance of a thorough and fair process. No conclusions have been made.\"\nAssistant coach Steve Barnes will coach Colorado State on Saturday night. The school announced Wednesday that it would have conversations with students and staff members about the 62-year-old Eustachy.\nIt marks the second time in four years that Colorado State officials have interviewed players and others about Eustachy's behavior. A 2013-14 investigation alleged that he created a \"culture of fear and intimidation\" and emotionally abused his players, according to the 90-page report completed by former Rams athletics director Jack Graham.\nEustachy's contract expires after the 2020-21 season.?",
    "source_domain": "abcnews.go.com",
    "title": "Larry Eustachy put on administration leave by Colorado State amid conduct investigation",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/larry-eustachy-put-administration-leave-colorado-state-amid/story?id=52818400"
}