{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:06:06+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsources-wr-prospect-antonio-callaway-tested-positive-marijuana%2Fstory%3Fid%3D54706546.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0424/dm_180424_Yates_on_Julio_Jones1143/dm_180424_Yates_on_Julio_Jones1143_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Former Florida wide receiver Antonio Callaway, who some personnel evaluators consider as talented as any wide receiver in this week's draft, tested positive for marijuana at the combine, NFL sources said.\nCallaway's new agent, Malki Kawa, said Tuesday that it was for a diluted sample. A diluted sample is treated as a positive test result under the NFL's Policy and Program on Substances of Abuse.\nKawa did not represent Callaway during the combine; he was hired two weeks ago.\nShortly after Callaway was informed that he tested positive, he and his former agent, Melvin Bratton, parted ways.\nCallaway was viewed by some teams as a potential second-day pick, and that was only because of his previous incidents off the field.\nIn December 2015, a female Florida student accused Callaway of sexually assaulting her, but a Title IX hearing officer cleared him of wrongdoing in August 2016. The woman and her witnesses boycotted the hearing because the university appointed an attorney who was also a Gators football booster to hear the case. Callaway was never criminally charged in the incident.\nAccording to the hearing officer's ruling, Callaway testified that he was \"high on marijuana\" during the encounter with the woman and stated that he was \"so stoned I had no interest in having sex with anyone.\"\nCallaway also was one of nine Florida players last season who allegedly used stolen credit card information to fund bookstore accounts, and he was cited for misdemeanor marijuana possession and possession of drug equipment during a traffic stop by Gainesville police in May 2017.\nOne talent evaluator said Callaway had enough talent \"to one day wear a gold jacket.\" Now it might be a challenge for Callaway to get drafted.\nAsked recently about his past mistakes, Callaway said: \"I mean, I matured. I'm past that. I don't dwell on it or nothing. It happened. It happened, so I can't cry over spoiled milk. I was young. I was dumb. I was immature. I've grown a lot, actually. Got a beautiful girl [his daughter, Aulani, was born in February] to look after, so I ain't got no choice but to be a man.\"\nInformation from ESPN's Mark Schlabach was used in this report.",
    "source_domain": "abcnews.go.com",
    "title": "Sources: WR prospect Antonio Callaway tested positive for marijuana at combine",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/sources-wr-prospect-antonio-callaway-tested-positive-marijuana/story?id=54706546"
}