{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:43:53+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Alabama OC Kiffin Leaving Before National Title Game",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Falabama-oc-kiffin-leaving-national-title-game-44513536.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/alabama-oc-kiffin-leaving-national-title-game-44513536",
    "language": "en",
    "localpath": null,
    "maintext": "Lane Kiffin isn't sticking around to run Alabama's offense in the national championship game, bringing an end to a successful but sometimes tense three-year pairing with Crimson Tide coach Nick Saban.\nSaban said Monday that Kiffin will leave to focus on his new job as Florida Atlantic's head coach. Incoming offensive coordinator Steve Sarkisian will replace him for the Jan. 9 game against Clemson in Tampa, Florida.\nKiffin and Saban said they made the decision after meetings following the Peach Bowl win over Washington.\n\"We appreciate all that Lane has done for our football program over the last three years,\" Saban said. \"We sat down following the Washington game and talked about the time demands of managing both jobs, and we recognized that it is best for our players, and for Lane, that we allow him to turn his full attention to his new head coaching role at FAU.\n\"This wasn't an easy decision and we appreciate the way Lane handled this in terms of doing what is best for our team. At the end of the day, both of us wanted to put our players in the best position to be successful.\"\nSarkisian, who was fired from USC last season , had already been announced as Kiffin's successor. He's been working as an offensive analyst for the Tide since the week after the opener against the Trojans and now has only a week to prepare for the national title game.\nKiffin said it became apparent over the last couple of weeks that it would be better for both programs if he focused solely on the Florida Atlantic job. After meeting with Saban Sunday night and Monday morning, \"we mutually decided that it was in everyone's best interests for the players and the program for Coach Sarkisian to take over all responsibilities as offensive coordinator for the championship game.\"\n\"This was a very difficult decision, but it's a decision made in the best interests of the program,\" Kiffin said. \"I look forward to helping Alabama win another championship, and would like to thank Coach Saban, the staff, and all the players and fans for the past three years at UA for an unforgettable time and championship run. Roll Tide!\"\nSaban hired Kiffin months after his firing at USC — famously at the airport after a late-night flight back from a game. The position gave him the chance to revitalize his career.\nThe pairing worked well on the field, when the Tide won three Southeastern Conference titles and earned a shot at a second national championship. But it was often tense.\nSaban could be seen a number of times on the sidelines giving Kiffin an earful during games.\nKiffin was asked before the Peach Bowl if he could recall the happiest moment with Saban in a game.\n\"I don't recall a happy moment,\" he said, adding that he only remembers the many times he was chewed out. \"I won't take that part of the process with me, though.\"\n———\nMore AP college football: www.collegefootball.ap.org",
    "source_domain": "abcnews.go.com",
    "title": "Alabama OC Kiffin Leaving Before National Title Game",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/alabama-oc-kiffin-leaving-national-title-game-44513536"
}