{
    "authors": [
        "Abc News",
        "More Kelly"
    ],
    "date_download": "2018-04-24 16:32:41+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Jenny Cavnar calls for Coors Field to 'fire up the fountains' in the historic first play-by-play call for a televised major league broadcast.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fjenny-cavnar-makes-mlb-history-rockies-padres-play%2Fstory%3Fid%3D54688429.json",
    "image_url": "https://s.abcnews.com/images/Sports/jenny-cavnar-rockies-broadcast-4-ht-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jenny Cavnar has had a long-running career in Major League Baseball, but she slid into a historic new role in the broadcast booth Monday night, becoming the first woman since 1996 to call the televised play-by-play for a major league team.\nCavnar called the Colorado Rockies and San Diego Padres matchup in Denver alongside analyst Jeff Huson and former Rockies outfielder-turned analyst Ryan Spilborghs. It was a fitting assignment for Cavnar, who previously reported for the Padres before joining the Rockies as a pre- and post-game host in 2012.\nWe are extremely proud of @jennycavnar who tonight becomes among the first women ever to call play-by-play for a @MLB broadcast. pic.twitter.com/Y8aQhARnnn — Colorado Rockies (@Rockies) April 24, 2018\nWith more than a decade of baseball reporting in various capacities under her belt, Cavnar called her first televised homerun Monday night when Rockies' third baseman Nolan Arenado stepped up to the plate.\n\"That ball is shot into left field, fire up the fountains she's gone,\" Cavnar announced, describing the two-run shot in the bottom of the first inning. Her run call coincided with the eruption of the classic Coors Field fountains whenever the home team hits a home run.\n107 mph off the bat for Nolan and then Story adds a clean shot to the concourse. 464 feet, the longest of his career. ?? pic.twitter.com/5EWDWPUiyx — Colorado Rockies (@Rockies) April 24, 2018\nCavnar joins a shortlist of women who have called America's pastime.\nMary Shane was the first female in a booth, doing radio for the Chicago White Sox in 1976 before moving on to television; and Suzyn Waldman was the first woman to do baseball game commentary, for a few New York Mets games on radio in June 1993, according to ESPN. Waldman called her first TV broadcast in July 1995 for a New York Yankees versus Texas Rangers game on ABC's \"Baseball Night in America\" and her first play-by-play in 1996.\nOther notable women who have spent time in the booth include Gayle Gardner, who replaced Charlie Jones on the Rockies TV broadcast for the Aug. 3, 1993 Rockies and Cincinnati Reds game. Pam Boucher announced 36 games on Yankees TV, WPIX in 1977.\nCavnar, a Colorado native, previously made history in 2015 as the first female analyst for a series of National League games in the radio booth.\nShe felt the love with messages of support from around the league and other women in the industry, including ESPN \"Sunday Night Baseball\" analyst Jessica Mendoza.\nMeans a lot @jessmendoza!! Thank you for doing your thing!! — Jenny Cavnar (@jennycavnar) April 24, 2018\nSo proud to be a part of @jennycavnar doing Play by Play tonight @ATTSportsNetRM between @Rockies and @Padres! I believe she will be the First woman in @MLB history to call Play by Play on a tv broadcast!!!! Breaking through ceilings! #makingHerStory! #GoJenny — Ryan Spilborghs (@spillygoat19) April 23, 2018\nAlthough the Rockies fell to the Padres 13-5, the night will go down as a win for Cavnar.",
    "source_domain": "abcnews.go.com",
    "title": "Jenny Cavnar makes MLB history with Rockies-Padres play-by-play call",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/jenny-cavnar-makes-mlb-history-rockies-padres-play/story?id=54688429"
}