{
    "authors": [
        "Abc News",
        "More Bill"
    ],
    "date_download": "2018-03-20 01:31:07+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The first lawsuit stemming from the Miami bridge collapse was filed Monday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmoment-silence-held-bridge-collapse-victims-1st-lawsuit%2Fstory%3Fid%3D53849566.json",
    "image_url": "https://s.abcnews.com/images/US/florida-bridge-memorial-2-ap-jt-180318_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Students and faculty of Florida International University returned to their Miami campus from spring break today and held a moment of silence to honor the six people killed in the collapse of a pedestrian bridge as lawyers for a man injured in the calamity filed a lawsuit\nThe moment of silence was held at 1:47 p.m., the exact time the 950-ton span that was being built to connect FIU to neighboring community of Sweetwater came crashing down on cars on Thursday.\nJennifer Kay/AP\nSeveral hundred students and faculty, including FIU President Mark Rosenberg, joined hands in front of the school's Graham Center, where the school flag and the state flag were lowered to half-mast.\nThe ceremony honored the people killed, including Alexa Duran, an 18-year-old student at FIU. Others who died were Brandon Brownfield, 39; Oswald Gonzalez, 57; Alberto Arias, 54; Rolando Fraga Hernandez, 60; and Navarro Brown, 37.\nFive of the victims died when the 174-foot-long prefabricated section of the bridge collapsed on top of their vehicles as they were waiting under the span, which had just been put into place a few days earlier, for a traffic light to change, officials said. Brown was removed from the rubble alive, but later died at a hospital.\nJoe Raedle/Getty Images\nMeanwhile, lawyers for one of the people injured in the bridge failure filed a lawsuit in Miami-Dade County Circuit Court charging the five companies involved in the construction, oversight and design of the bridge with reckless negligence.\nOrlando attorney Matt Morgan filed the lawsuit on behalf of Marquise Hepburn, 24, who suffered significant injuries in the catastrophe.\nHepburn, according to the suit, was heading to work, riding a bicycle under the bridge on Southwest Eighth Street when the span gave way and he was hit by a vehicle that veered into him.\nHepburn, \"like many other unsuspecting victims, was simply performing ordinary activities and like many other victims of this horrific event was simply passing under the bridge without warning of increased danger,\" the lawsuit reads.\nThe suit claims the roadway beneath the bridge should have been closed to traffic at the time of the collapse.\nThe National Transportation Safety Board is investigating the disaster, but has yet to determine what caused the collapse.\nOn Friday, NTSB investigator Robert Accetta said work crews were applying post-tensioning force on the bridge support cables when the span fell down, but investigators aren't sure if that's what caused the bridge to fall.\nOfficials also said Friday that an engineer left a voicemail with the Florida Department of Transportation two days before the bridge collapsed, reporting that cracks had been found at one end of the concrete span. The voicemail wasn't picked up until after the collapse, however. NTSB officials are investigating the report, but said it's not clear if cracks contributed to the bridge's catastrophic failure.\nAntoni Belchi/AFP/Getty Images\n\"If there's a crack in the bridge why is the motoring public still able to travel under the bridge? That's a fundamental question that needs to be answered in this case,\" Morgan said during a news conference today.\nAmong the companies named in the suit is FIGG Bridge Engineers, Inc., which designed the bridge, and Munilla Construction Management, which was responsible for building it.\nFIGG said in a statement: \"We are aware that a lawsuit has been announced regarding the pedestrian bridge accident. Our priority focus continues to place sympathies for the victims at the forefront of our thoughts. FIGG Bridge Engineers will work diligently with authorized investigators in an earnest ongoing effort to determine what led to the accident and what can be done to ensure that nothing like it happens again.\"\nMunilla Construction did not respond to a request from ABC News for comment, but a message on the company's answering machine, said, in part, \"We are all devastated and are doing everything we can to assist. We will conduct a full investigation and will cooperate in every way.\"",
    "source_domain": "abcnews.go.com",
    "title": "Moment of silence held for bridge collapse victims as 1st lawsuit filed",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/moment-silence-held-bridge-collapse-victims-1st-lawsuit/story?id=53849566"
}