{
    "authors": [
        "Abc News",
        "More Luis"
    ],
    "date_download": "2017-04-17 21:51:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "The North Korean missile that exploded shortly after launch on Saturday was a new kind of single-stage missile.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fnorth-koreas-failed-missile-launch%2Fstory%3Fid%3D46844052.json",
    "image_url": "http://a.abcnews.com/images/International/ap-nk-1-er-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The North Korean missile that exploded shortly after launch on Saturday was a new kind of single-stage missile that the country had previously tested in another failed launch two weeks ago. The launch failure has fueled speculation about the possibility that the United States may be using cyber technology to interfere with North Korea's missile program.\nAccording to U.S. officials, the missile fired on Saturday exploded four to five seconds after its launch near a North Korean submarine base in Sinpo along the country's eastern coast.\n\"The launch failed very early on, so that makes it harder to know exactly what they were trying to do,\" Susan Thornton, Acting Assistant Secretary of State for East Asian and Pacific Affairs, said on Monday. \"But I think that our understanding is that it was not one of the longer-range missiles that they were trying to test there; it was something like a medium-range ballistic missile.\"\nU.S. officials described the missile fired Saturday as a KN-17, a new mobile-launched, single-stage missile that uses liquid fuel. The KN-17 could possibly be either a short or medium-range missile. A full analysis of the missile's possible maximum range is difficult given that there has not been a successful test so far.\nThe first test of a KN-17 missile took place on April 4. In that test, the missile traveled about 34 miles over the Sea of Japan. But according to U.S. officials, that test was labeled a failure because the missile began to spin out of control and crashed into the water.\nThe U.S. intelligence community names North Korean missiles that it identifies with so-called KN-numbers. \"KN\" stands for North Korea, and the missiles are given corresponding numbers as they are identified. For its part, North Korea has its own names for many of its missiles.\nDetermining what missiles are fired by North Korea after explosive launch failures can be an imprecise science. For example, officials said that no determination has been made for a North Korean missile that was fired on March 21 and exploded moments later.\nA description of the missile launched on April 4 has also been revised several times. It was initially described by a U.S. Pacific Command press release as a KN-15, a new land-based, multi-stage, medium-range missile that uses solid fuel.\nThe new KN-15 designation was created to distinguish it from the KN-11, North Korea’s solid-fueled, submarine-launched missile, which the country tested last summer.\nHowever, the day after the launch, U.S. officials revised their assessment and described the missile as a SCUD missile with an existing range.\nDays later, it was re-designated again as the new KN-17 because it was different than existing single-stage SCUD missiles.\nTwo of North Korea's five missile launches this year have involved failures shortly after liftoff. These failures have been similar to the series of explosions that occurred with the intermediate-range Musudan missile in 2016.\nLast year, North Korea conducted eight tests of the Musudan missile, but only one of the missiles achieved flight. The vast majority of the Musudan tests ended in failure.\nAccording to a New York Times report, the U.S. military sabotaged North Korea's missile program by using cyber and electronic strikes that caused missiles to explode seconds after launch in March.\nAccording to the Times, the Obama administration signed off on the Pentagon's use of so-called \"left of launch\" techniques. These are techniques that could electronically affect North Korean missiles before launch or as they lift off.\nThe report has gained traction in the wake of Saturday's failed launch, although it remains unclear if such a program actually exists.",
    "source_domain": "abcnews.go.com",
    "title": "What we know about North Korea's failed missile launch",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/north-koreas-failed-missile-launch/story?id=46844052"
}