{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 08:09:33+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "American man escapes from prison on Indonesia's Bali",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Famerican-man-escapes-prison-indonesias-bali-51711647.json",
    "image_url": "http://abcnews.go.com/International/wireStory/american-man-escapes-prison-indonesias-bali-51711647",
    "language": "en",
    "localpath": null,
    "maintext": "An American citizen detained for a drug offense escaped Monday from an overcrowded and under-staffed prison on the Indonesian resort island of Bali.\nHead of Kerobokan prison Tonny Nainggolan said Christian Beasley, 32, was believed to have escaped at around 4 a.m. by sawing through a ceiling and then jumping over a 6-meter (20-foot) high wall behind the prison.\nBeasley was arrested in August at a post office in the Kuta tourist area of Bali with a package containing 5.7 grams of hashish.\nNainggolan said another American inmate, Paul Anthony Hoffam, 57, who was serving a 20-month jail since July for robbery, was captured while trying to escape.\nAn investigation was underway to find out possible involvement of prison guards in the incident, said Surung Pasaribu of the local Law and Human Rights Ministry. He also said there is a shortage of guards for the prison, which was built to accommodate about 300 people but has nearly 1,600 inmates.\nIt was the second escape from the prison in Bali's capital, Denpasar, since June when four foreign inmates from Australia, Bulgaria, India and Malaysia escaped through a drainage tunnel.\nTwo of them, Bulgarian Dimitar Nikolov Iliev and Indian Sayed Mohammed Said were recaptured in East Timor days later and were returned to Bali. Two others, Shaun Edward Davidson of Australia and Malaysian Tee Koko King bin Tee Kim Sai are still at large.\nJailbreaks are common in Indonesia, where prisons are overcrowded by people convicted of drug crimes as part of the government's anti-drugs crusade.\nIn May, more than 440 prisoners escaped from an overcrowded prison on Sumatra island when they were let out to perform Friday Muslim prayers. In July 2013, about 240 prisoners, including several convicted terrorists, escaped during a deadly riot at a prison in another part of Sumatra.",
    "source_domain": "abcnews.go.com",
    "title": "American man escapes from prison on Indonesia's Bali",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/american-man-escapes-prison-indonesias-bali-51711647"
}