{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:48:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Insurer Anthem fires back at Cigna",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fanthem-fires-back-cigna-45505387.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/anthem-fires-back-cigna-45505387",
    "language": "en",
    "localpath": null,
    "maintext": "Health insurers Anthem and Cigna are now trading lawsuits instead of working together to salvage their shaky $48-billion buyout agreement.\nThe Blue Cross-Blue Shield carrier Anthem said Wednesday that it is seeking a restraining order to block its smaller rival from terminating their deal, which has already been blocked by a federal judge.\nCigna announced Tuesday that it was suing Anthem and seeking more than $13 billion in damages for what it says were Anthem's breaches of the merger agreement. Anthem had filed documents seeking an expedited appeal to the judge's ruling a day before Cigna's complaint landed in federal court.\nThe two companies announced Anthem's plan to buy Cigna in 2015 a few weeks after two other insurers, Aetna Inc. and Humana Inc., announced a similar combination. But the Department of Justice sued to stop both acquisitions, and separate federal judges recently rejected them after a trial partially over concerns about their impact on consumers.\nAetna and Humana announced Tuesday they were ending their deal.\nBut Anthem said Wednesday that there still was enough time and \"a viable path forward\" for completing its deal.\nThe Indianapolis insurer added that Cigna's lawsuit was the next step in that company's \"campaign to sabotage the merger and to try to deflect attention from its repeated willful breaches\" of the deal.\nIt listed several maneuvers that it says that Cigna attempted to sabotage the deal. Anthem said Cigna refuses to allow meetings with its senior management team and has repeatedly delayed producing data.\nAnthem also said Cigna's CEO attacked the combined company's ability to achieve savings on medical costs during trial testimony.\nA Cigna spokesman did not immediately return a call from The Associated Press seeking comment.",
    "source_domain": "abcnews.go.com",
    "title": "Insurer Anthem fires back at Cigna",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/anthem-fires-back-cigna-45505387"
}