{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:06:48+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Pope to Bishops: Maintain 'Zero Tolerance' for Child Abuse",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fpope-bishops-maintain-tolerance-child-abuse-44512871.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/pope-bishops-maintain-tolerance-child-abuse-44512871",
    "language": "en",
    "localpath": null,
    "maintext": "Pope Francis has exhorted Catholic bishops worldwide to do what's needed to ensure children are protected from sexual abuse by clergy.\nThe Vatican on Monday released the text of a Dec. 28 letter Francis sent to bishops about injustices to children. They included slave labor, malnutrition, lack of education and sexual exploitation, including abuse by priests.\nIn the letter, Francis decried \"the sufferings, the experiences and pain of minors who were abused sexually by priests.\"\n\"It is a sin that shames us,\" the pope wrote. \"Persons responsible for the protection of those children destroyed their dignity.\"\nThe church's reputation has been stained in several countries during the last decade-and-a-half as people have come forward to report that parish priests or other Catholic clergy raped or molested them as minors.\nThe allegations showed that local bishops sometimes knew about and covered up child sex abuse involving problem priests and triggered multi-million-dollar lawsuits, as well as several criminal prosecutions.\nExpressing the church's \"regret,\" and begging forgiveness, the pope denounced the \"sin of what happened, the sin of failing to help, the sin of covering up and denial, the sin of the abuse of power.\"\nFrancis also asked bishops for \"complete commitment to ensuring that these atrocities will no longer take place in our midst.\"\n\"Let us find the courage needed to take all necessary measures and to protect in every way the lives of our children, so that such crimes may never be repeated,\" the pope said. \"In this area, let us adhere, clearly and faithfully, to 'zero tolerance.'\"\nThe pontiff himself has gotten mixed reviews on how the Vatican handles sex abuse.\nFrancis has laid out procedures to oust bishops for negligence, if they mishandle investigations into alleged abuse.\nBut he dismayed advocates for abuse survivors by appointing a Chilean bishop accused of covering up for a notorious pedophile.\nThe Vatican also took no immediate action after deaf students in Francis' native Argentina, in a 2014 letter to the pope, said a priest sexually abused them at school.",
    "source_domain": "abcnews.go.com",
    "title": "Pope to Bishops: Maintain 'Zero Tolerance' for Child Abuse",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/pope-bishops-maintain-tolerance-child-abuse-44512871"
}