{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 01:44:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Business group: China backtracking on market opening",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbusiness-group-china-backtracking-market-opening-46852179.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/business-group-china-backtracking-market-opening-46852179",
    "language": "en",
    "localpath": null,
    "maintext": "An American business group says China's push to develop its own technology and other industries has \"narrowed the space\" for foreign companies to compete in its market.\nIn a report released Tuesday, the American Chamber of Commerce in China appealed to Beijing to move faster on market-opening pledges.\nThe report joins mounting complaints that Beijing is hampering or reducing market access despite its public defense of free trade in response to U.S. President Donald Trump's call for import restrictions.\nTrump hailed the rapport he developed with his Chinese counterpart, Xi Jinping, during a meeting last week in Florida that seemed to ease tensions over China's multibillion-dollar trade surplus with the United States. But neither side has announced policy changes.\nThe U.S. group cited examples from agriculture to health care to movies where China limits and might be reducing access as it tries to nurture its own competitors in biotech, electric cars and other fields. The chamber complained in March that the regulatory process for approving foreign farm-related biotech products for use in China was slowing.\n\"The pace of economic reforms and market opening has been slow and faltering, and industrial policies and related measures designed to support domestic industries and national champions have narrowed the space for future participation in China's economy by foreign companies,\" the report said.\n\"With the backdrop of a slowing economy and increasing geopolitical uncertainty, we hope that China will pursue bold reforms to create a more open, market-driven investment environment.\"\nXi and other Chinese leaders have promised market forces and private business will play a bigger role in China's state-dominated economy. But their ambitious plans to develop Chinese technology and manufacturing have prompted warnings that foreign companies might be squeezed out of promising fields.\nChinese leaders also say they will increase the ruling Communist Party's control over state-owned companies that dominate banking, telecoms, oil and gas and other major industries.\nXi defended free trade in a January speech at the World Economic Forum in Switzerland that was seen as a rebuke to Trump. Still, trading partners note China is the most-closed major economy, while the United States is among the most open to trade and investment.\nProgress on carrying out Chinese market-opening pledges is \"slow and uneven\" and \"China even appears to be moving in the opposite direction in some regards,\" the American chamber said.\nIt noted progress in some areas such as expanding foreign access to China's bond market but said it saw little action in most industries.\nDespite official pledges, more than 60 percent of companies that responded to a survey have \"little or no confidence that the government is committed to opening China's markets further in the next three years,\" the chamber said.\n\"There is an increasing perception of animosity toward foreign business,\" it said.\nThe chamber noted the United States and other countries impose few limits on Chinese companies that are on a global buying spree to acquire technology and companies.\nThe report appealed to Chinese regulators for changes including the release of more information about court rulings, rejections of license applications, anti-monopoly investigations and customs and tax rules. It also called for an end to \"window guidance,\" in which regulators issue orders to banks and other companies in private contacts without announcing them.\nForeign companies are especially concerned about government initiatives to develop competitors in electric cars, robotics, biotech and other fields.\nOnly 10 percent of companies in technology-intensive industries that responded to a survey have an \"optimistic viewpoint on the regulatory environment,\" the American chamber said.\nAuthorities also are making little progress on promises to scale down steel and other industries where supply exceeds demand, leading to a flood of low-cost Chinese exports that are hurting foreign competitors, the group said.\nIt noted the amount of steel production capacity in use rose last year, while much of the 45 million tons of capacity the government said was closed represented mills that already were idle.\n\"Unemployment concerns, vested interests and an unclear message from the central leadership have caused these efforts at cutting overcapacity to flounder,\" the report said.\n———\nThe American Chamber of Commerce in China: www.amchamchina.org",
    "source_domain": "abcnews.go.com",
    "title": "Business group: China backtracking on market opening",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/business-group-china-backtracking-market-opening-46852179"
}