{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 20:23:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "D'Antoni looking for 1st title in his 1st year with Rockets",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fdantoni-1st-title-1st-year-rockets-46848838.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_e5d2164c29ca41009adf1dbf724514c9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In his first trip to the playoffs since 2013, Mike D'Antoni knows the rub on him is that he's never won a championship.\nThe 65-year-old first-year coach of the Houston Rockets doesn't spend much time worrying about that criticism.\n\"That's cool,\" he said. \"I know a lot of golfers that didn't win a major and they said: 'Oh he can't win the big one.' And then he wins five. It's hard to win a championship.\"\nIt's been one playoff disappointments after another for the innovative coach.\nD'Antoni shook up the game by introducing his fast-paced offense to the Phoenix Suns in the early 2000s. His Phoenix team in 2004-05 that was led by Steve Nash won 62 games before losing in the Western Conference finals. A year later the Suns won 54 games but were sent home in the conference finals again. In 2006-07 the Suns won 61 games, but were ousted in the conference semifinals.\nIn 2005 and 2007 they were eliminated by the San Antonio Spurs, who went on to win the title.\nThe 2007 season is the last one in which D'Antoni advanced past the first round. In his last three trips to the postseason, 2008 with Phoenix, 2011 with the Knicks and 2013 in Los Angeles, he's managed just one win combined .\nHe isn't daunted by his postseason misfortune, and is looking forward to changing things this year.\n\"We'd like to put that to rest,\" D'Antoni said. \"I would personally, but everybody would, too. So that's what we're going to work for.\"\nThe Rockets are off to a good start.\nHouston rolled to a 1-0 lead in their first-round series against Oklahoma City with a 118-87 win on Sunday night .\nThe series-opener was a reflection of D'Antoni's success this year.\nHe has revived his coaching career and put the Rockets back in contention in his first head coaching stint since resigning from the Lakers after going 27-55 in 2013-14. Under his tutelage, Houston shook off last year's disappointing season where it finished eighth in the West and was eliminated in the first round. This year they have the third best record in the NBA.\nPerhaps most important to Houston's success was D'Antoni moving James Harden to point guard. The change elevated the five-time All-Star from an elite player in the league to one of its best.\nHarden had 22 triple-doubles and finished with 29.1 points, 11.2 assists and 8.1 rebounds — all career-highs — to help Houston to 55 wins a year after the team won just 41 games.\n\"It's a dream come true,\" Harden said of playing in D'Antoni's system.\nHe went on to explain why he believes D'Antoni has been so successful this season.\n\"He's confident in what he has,\" Harden said. \"He's been doing it for so long so he knows that what he does and what he brings to the table works. And his personnel — we just go out there and compete for him and try to win as many games for him.\"\nThough relying heavily on 3-pointers has long been a hallmark of D'Antoni's offense, he's taken it to another level in Houston. The Rockets set an NBA record this season by making 1,181 3-pointers.\nHouston finished the regular season with three of the top 10 3-point shooters in the league. Harden was third with 262, Eric Gordon ranked fourth with 246 and Ryan Anderson made 204 for ninth place.\nHis work in not only improving the Rockets overall, but getting the most out of his roster has made him a leading candidate for coach of the year.\n\"What he's so good at is really giving his players confidence and belief in what they're doing, and they're obviously believing,\" Warriors coach Steve Kerr said. \"They're having an amazing year, and my guess is that Mike will get the trophy. He's earned it.\"\nHis players certainly feel the same way. They not appreciate his work with them on the court, but the vibe he created in the building from the moment he took over after the players struggled through a season where Kevin McHale was fired after just 11 games last year.\n\"He doesn't look at you as a number, he looks at you as a player,\" Patrick Beverley said. \"He talks to you, you have conversations. You get a coach like that who not only cares about the basketball part but you as a person and as a man you're willing to run through walls for him and as you can tell that's what we've been trying to do this season.\"\nD'Antoni is excited to see just how far this team can go. He isn't surprised by its success, but there are occasions where he steps back to think about just how thankful he is for this opportunity.\n\"You just appreciate them every day,\" D'Antoni said, \"and it keeps growing.\"\n———\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "D'Antoni looking for 1st title in his 1st year with Rockets",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/dantoni-1st-title-1st-year-rockets-46848838"
}