{
    "authors": [
        "Abc News",
        "Lesley Messer",
        "More Lesley"
    ],
    "date_download": "2017-06-14 20:55:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Corinne Olympios calls 'Bachelor in Paradise' incident 'my worst nightmare'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fcorinne-olympios-calls-bachelor-paradise-incident-worst-nightmare%2Fstory%3Fid%3D48040046.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/gty-warner-er-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Former \"The Bachelor\" contestant Corinne Olympios on Wednesday broke her silence about the incident that allegedly took place on the set of \"Bachelor in Paradise\" earlier this month.\nThe reality TV star confirmed in a statement to ABC News on Wednesday afternoon that she was a part of the incident that prompted Warner Brothers, the studio behind the show, to suspend production and launch an investigation into allegations of misconduct.\nThough she did not delve into details, Olympios explained that she's piecing together what happened and is in therapy to \"begin dealing with the physical and emotional trauma\" that she sustained while in Mexico for the show.\nShe also said that she has retained an attorney to \"obtain justice.\"\n“I am a victim and have spent the last week trying to make sense of what happened on June 4. Although I have little memory of that night, something bad obviously took place, which I understand is why production on the show has now been suspended and a producer on the show has filed a complaint against the production,\" she said. \"As a woman, this is my worst nightmare and it has now become my reality.\"\nA representative for Warner Brothers did not immediately respond to a request for comment. A representative for ABC, the network on which the show airs, referred a request for comment to Warner Brothers, as the incident deals with production.\nOn Sunday afternoon, Warner Brothers released a statement confirming that production on season four of the show had been suspended as a result of \"allegations of misconduct,\" and \"appropriate responsive action\" would be taken following a \"thorough investigation.\"\nTwo days later, Chris Harrison, the host of the \"Bachelor\" franchise, urged fans to \"be patient\" and apologized for \"any inconvenience and disappointment\" caused by the show's suspension.\n\"The safety and care of the cast and crew of our show is of the utmost importance to us. It is with this thought in mind that we made the decision to suspend filming,\" he said. \"Out of respect to all involved, there's only so much I can and will say at this time. Normally with a situation like this I would not say anything until the incident is fully resolved, but with all the rumors and misinformation being put out there I don't find that to be possible anymore.\"\n\"I know in this day and age we want and even expect immediate answers but in this case it's just not possible,\" Harrison continued. \"I will keep you as informed and up to date as I possibly can.\"\nLast week, ABC released the names of several \"Bachelor in Paradise\" contestants. In addition to Olympios, several women from the last season of \"The Bachelor\" had signed up.",
    "source_domain": "abcnews.go.com",
    "title": "Corinne Olympios calls 'Bachelor in Paradise' incident 'my worst nightmare'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/corinne-olympios-calls-bachelor-paradise-incident-worst-nightmare/story?id=48040046"
}