{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:52:44+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ffrances-train-standoff-eyes-striking-worker-54685220.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_36e695eee2914df59dadc231db5e3791_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "French train mechanic Jonathan Seigneur says President Emmanuel Macron has it all wrong.\nSeigneur fixes trains for a modest salary that he accepted in exchange for job security, a tradeoff made by workers across the world's fifth-biggest economy. And now he is on strike, along with thousands of others at national railway SNCF, to protest Macron's changes to the rail sector — and protect the French way of life.\nMacron, a former investment banker who is currently visiting the U.S., argues that worker protections stifle growth and innovation, and that the French lifestyle is no longer tenable in the 21st century global economy.\nSeigneur, a 35-year-old father of two, says job security encourages people to spend money and helps France weather global recessions better than other leading economies.\n\"If job security is a privilege then I'd like for all the French to have this privilege,\" he said. \"Soon it will be a privilege just to have a job. Or to eat at each meal.\"\nSeigneur is fighting what many French workers see as an encroaching American-style system, where people are laid off without warning and \"you take your pickup and the wife and kids, and go somewhere else.\"\n\"I don't believe the French want this kind of society,\" he says.\nIt's a timely criticism — coming just as Macron is being feted by U.S. President Donald Trump on a state visit to Washington.\nSeigneur, with the powerful hard-left union CGT, talked to The Associated Press at different protest sites around Paris — starting from a blockade he set up in the Paris suburb of Pantin to try to save a threatened depot.\nLater he donned a red union hat and stormed the SNCF freight headquarters in the suburb of Clichy with other union activists. They waved flags as they entered the building and mounted the roof, where they lit flares and sang songs, fists in the air.\nSome two-thirds of French high-speed trains were cancelled Tuesday as workers held their 10th day of train strikes so far this month. Unions plan rolling train strikes through the end of June, and other sectors are also holding scattered walkouts as discontent mounts against Macron's changes to the French economy.\nThe SNCF reform aims to abolish a special status for train workers — known as cheminots — that effectively guarantees jobs for life. The reform would only apply to future hires, but Seigneur fears it would be the beginning of the unraveling of France's \"notion of public service.\"\n\"We don't earn much but we do something for people,\" he said, notably providing extensive and affordable train service that \"allows the little grandmother in the countryside to be able to see her grandchildren in Paris.\"\nAfter 15 years at SNCF, he says his base gross salary is 1,600 euros a month. Base salaries are augmented with extra pay for difficult hours or seniority, all subject to income taxes and France's high payroll charges. He rides trains for free, and like all French workers has relatively generous vacation.\nSeigneur rejects arguments that the strikers are clinging to unfair privileges, or are holding passengers hostage. While the strike has left many commuters and tourists fuming, France is proud of its railways and many riders think SNCF plays a special role.\nThe European Union is requiring its members to open up state-run rail networks to competition, and Macron's reform is in part meant to prepare SNCF for that challenge.\nSeigneur is ready to carry the strike into the July-August school vacations if needed, and says it's important to stand up to Macron.\n\"It's like we didn't elect a president but a king, and we're going to show him that even if he's a king ... we won't give in. We are as stubborn as him,\" he said.\nStill, Seigneur fears the reform will go ahead anyway.\nAnd if it does?\nDespite his attachment to the railways, he said he would quit SNCF and look for another job. Then he laughed and added, \"Maybe as an Uber driver.\"\n———\nNicolas Garriga contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "France's train standoff, through the eyes of striking worker",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/frances-train-standoff-eyes-striking-worker-54685220"
}