{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:32:13+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Linus Phillip Jr., 30, was killed by a police officer in Largo, Florida.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fdead-mans-finger-effort-unlock-phone-police-54699872.json",
    "image_url": "https://s.abcnews.com/images/US/180424_wfts_dead_man_finger_iphone4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Dead man's finger used in effort to unlock phone by police\nNate can only come out there in Barnett are. March. A mother so upset her son line is still up killed by Largo police on Friday detectives say the initially approached him. Because of illegal dark tint on his car but then they smelled marijuana. It's. Now what happens big to rear Armstrong the mother of his two children visibly shaken by the betrayal of her longtime love my son is not. Longer to grow up and father. Are games. And make my daughter aren't he's not here anymore because the events. And they're just slander and you name it seems. Awful birth. The family is demanding video police just telling us today. Video from the wall why did not capture the honor only officers giving Philip CPR. But there was no denial of the existence of India's defense that's the first I've heard. And then another bombshell the family claiming that detectives. Gil legally use their dead loved one's finger to access his phone at the funeral home. So they're allowed to pull him out of the refrigerator and use a dead man's finger. To try to get. Into his phone. This is disgusting.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Dead man's finger used in effort to unlock phone by police",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/dead-mans-finger-effort-unlock-phone-police-54699872"
}