{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 07:20:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The Latest: 18 killed in Burkina Faso restaurant attack",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-18-killed-burkina-faso-restaurant-attack-49200501.json",
    "image_url": "http://abcnews.go.com/International/wireStory/latest-18-killed-burkina-faso-restaurant-attack-49200501",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the attack in Burkina Faso (all times local):\n7 a.m.\nTurkey says a Turkish national was killed and another was wounded in the attack by suspected Islamic extremists at a Turkish restaurant in the capital of Burkina Faso.\nTurkey's Foreign Ministry released a statement Monday condemning \"in the strongest way\" the attack on the upscale Aziz Istanbul restaurant which killed at least 18 people.\nThere was no immediate claim of responsibility for the violence, which continued into the early hours Monday.\nThe ministry statement said Turkey would maintain its support and solidarity with Burkina Faso, which it said had become the target of international terror over the past years.\n———\nSuspected Islamic extremists opened fire at a Turkish restaurant in the capital of Burkina Faso late Sunday, killing at least 18 people in the second such attack on a restaurant popular with foreigners in the last two years.\nThere was no immediate claim of responsibility for the violence, which continued into the early hours Monday. Gunfire could be heard almost seven hours after the attack began.\nCommunication Minister Remi Dandjinou told journalists that at least 18 people were dead and eight others wounded, according to a provisional toll. He said two of the attackers were also killed.\nThe victims came from several different nationalities, he said. At least one of the dead was French.\nSecurity forces arrived at the scene with armored vehicles after reports of shots fired near Aziz Istanbul, an upscale restaurant in Ouagadougou. The attack brought back painful memories of the January 2016 attack at another cafe that left 30 people dead.\nPolice Capt. Guy Ye said three or four assailants had arrived at the Aziz Istanbul restaurant on motorcycles, and then began shooting randomly at the crowds dining Sunday evening.\nBurkina Faso, a landlocked nation in West Africa, is one of the poorest countries in the world. It shares a northern border with Mali, which has long battled Islamic extremists.\nThe three attackers in the 2016 massacre were of foreign origin, according to al-Qaida in the Islamic Maghreb, which claimed responsibility in the aftermath along with the jihadist group known as Al Mourabitoun. But the terror threat in Burkina Faso is increasingly homegrown, experts say.\nThe northern border region is now the home of a local preacher, Ibrahim Malam Dicko, who radicalized and has claimed recent deadly attacks against troops and civilians. His association, Ansarul Islam, is now considered a terrorist group by Burkina Faso's government.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: 18 killed in Burkina Faso restaurant attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-18-killed-burkina-faso-restaurant-attack-49200501"
}