{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2017-08-14 12:14:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Sessions defends Trump on Charlottesville, says car-ramming fits 'domestic terrorism'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrumps-attorney-general-evil-charlottesville-car-ramming-fits%2Fstory%3Fid%3D49202191.json",
    "image_url": "http://a.abcnews.com/images/Politics/jeff-sessions-abc-ml-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Attorney General Jeff Sessions said the incident of a driver ramming a car into a crowd of demonstrators in Charlottesville, Virginia, on Saturday, which killed a young woman and sent 19 other people to hospitals, \"does meet the definition of domestic terrorism\" in U.S. law.\n\"It does meet the definition of domestic terrorism in our statute,\" Sessions said on ABC News' \"Good Morning America\" today. \"We are pursuing it in the [Department of Justice] in every way that we can make a case.\"\n\"You can be sure we will charge and advance the investigation towards the most serious charges that can be brought because this is unequivocally an unacceptable evil attack,\" he said. \"Terrorism investigators from the FBI are working on the case as well as civil rights division FBI agents.\"\nThe car-ramming incident occurred shortly after authorities in Charlottesville called off a planned white nationalist rally, titled \"Unite the Right,\" and ordered crowds to disperse following violent clashes between rallygoers and counterprotesters.\nHeather Heyer, 32, who was with a group protesting against the white nationalist gathering, was killed when the car plowed into the crowd.\nThe suspected driver, 20-year-old James Alex Fields Jr. of Ohio, was arrested and charged with second-degree murder in the incident.\nPresident Trump drew criticism when after the incident he said he condemned \"hatred, bigotry and violence on many sides,\" which some commentators said appeared to draw a moral equivalence between the white nationalists rallying in Charlottesville and the counterprotesters.\nBut Sessions said on \"GMA\" that the president \"explicitly condemned the kind of ideology behind these movements of Nazism, white supremacy, the KKK. That is his unequivocal position, he totally opposes those kind of values.\"\nThe attorney general added, \"The president, I suspect, will be talking to the country again soon, maybe today. I plan to meet with him today and the FBI today will be meeting with him to brief him on this case. He takes this exceedingly seriously.\"",
    "source_domain": "abcnews.go.com",
    "title": "Sessions defends Trump's comments on Charlottesville, says car-ramming fits definition of domestic terror",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trumps-attorney-general-evil-charlottesville-car-ramming-fits/story?id=49202191"
}