{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:48:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "People trapped inside were desperate to escape as the fire quickly spread while many were sleeping.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fvideo%2Fdeadly-fire-engulfs-london-apartment-building-48043756.json",
    "image_url": "http://a.abcnews.com/images/International/170614_gostream_molly4a0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Deadly fire engulfs London apartment building\nOr to start with that breaking these flames engulfing a highrise apartment building. In London we got word moments ago there are a number of fatalities. Witnesses said once the fire broke out at covered almost the entire tower within just an hour. That left anyone sleeping inside very little time to get out. We give you live look right now the smoldering building can be seen for several miles a major concern though at this minute. The building appears to be leaning to one side in danger of collapsing. ABC's Molly hunter is on the scene Molly what's the latest from your vantage point. Good morning and if that's right that you see the building right there still smoldering absolutely. Blackened but there aren't still leans that there down on the ground police are actually screaming get back up. But from here we are we feel that debris and we can actually feel this break from the firemen. A raging inferno high above London. Overnight incredible images flooding social media. Flames shooting from an apartment complex just not cut want to force on the next site via. It's night. But not respectful to the life if you got that call back. The fires stretching to one. Flaming debris raining down on the streets below and ash covering everything for more than a hundred yards away. This morning witnesses saying there were signs of people trapped inside makeshift growth seen hanging from the windows. She's British police now pushing everyone away from the scene due to fears the building may collapse. This man saying he got out of the building after a neighbor obtained on his door and will come up its. Everything he knows he DOS days of this of the globe captain when an off the boat people screen often a couple of minutes was TV was still sleeping. I was debating how he was going on him short often involves unison it's dwindled to he cautioned that all blacks. This morning as the sun rises the horrifying extent of the damage is visible. The building completely charred and still smoldering. How did this actually as clothes and as we can get through that building we're hearing banking increase at if that building may actually collapsed sometime soon. Tennis I have my own not through long ago you actually could see someone still live in the building waving at you. Is there any sense of whether they'll be able to stabilize the building enough to try to get in there. Not anytime in that's exactly right we actually thought I am not from this vantage point of a man inside on the eleventh floor when you look at that. But the ordinary to think actually someone is still in the live in there but police and fire brigade air of course standing by waiting for any opportunity to rescue. Any survivors. Thank and it's. And Molly we are hearing some horrific stories of people actually jumping from the building what are some of the other. Sir is it you're hearing there. Renovating the thing that sticks out from every single eyewitness that we've spoken with is this school re still on them immediately adds those Clinton. But if that fire started the load up planes people actually spread rapidly upbeat pop but the building. And residents are talking about this means of families of children waiting flashlight actually. Small children being tossed out of little lower at to waiting aren't allowed. The tragedy aptly until. A and Molly one of the big theater here is how quickly this all spread I mean just an hour from gulf such a large building is there any sense of what caused this. Fans to let residents are telling cast their time if you that may have caught that rapid spread and it may have also. And the reason why so many people got trapped up about that into that by acting in your apartment or on her are you weren't able to get out. It into the fire happened at her apartment building residents who think they were actually stay in place at eight blamed the rapid credit on the act. Colonel adding it was. It now a massive. Thirteen billion dollar rip Irving again this was just refer base last. Year and everything external cloudy which is it our for insulation and are for aesthetic reasons. Residents that as soon as that caught fire eat tiger building caught fire. ABC's Molly hunter on the scene of that horrific fire there in the west of London 120 units. Up in flames this morning it is a catastrophe there are some fatalities of course we're gonna keep on top of this breaking news story.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Deadly fire engulfs London apartment building",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/video/deadly-fire-engulfs-london-apartment-building-48043756"
}