{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 06:37:31+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frussia-foreign-minister-arrives-talks-north-korea-55552209.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_f6dd9f31e5b1433fb2aaf1d9efbfcbd4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Russian Foreign Minister Sergey Lavrov met with his North Korean counterpart Ri Yong Ho on Thursday in Pyongyang, a trip seen as an attempt by Moscow to make its voice heard in its neighbor state's new push for diplomacy.\nLavrov's visit comes ahead of a planned summit between President Donald Trump and North Korean leader Kim Jong Un, who has also made recent diplomatic overtures to Seoul and Beijing.\nAfter his arrival, Lavrov met with Foreign Minister Ri Yong Ho and others at an assembly hall in the capital.\nRussia's Foreign Ministry said in a statement earlier they would discuss bilateral issues as well as the overall situation on the Korean Peninsula. Details of Lavrov's schedule in Pyongyang were not disclosed.\nDespite having a border with the North and relatively cordial relations that President Vladimir Putin has seemed to want to develop further, Russia has so far remained largely on the sidelines as Kim has emerged onto the world stage this year.\nKim has already met twice with China's President Xi Jinping and South Korean President Moon Jae-in. One of Kim's top lieutenants, former intelligence chief Kim Yong Chol, is now in New York to discuss with U.S. officials the agenda for the summit planned in Singapore on or around June 12.",
    "source_domain": "abcnews.go.com",
    "title": "Russian foreign minister meets with North Korean counterpart",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/russia-foreign-minister-arrives-talks-north-korea-55552209"
}