{
    "authors": [
        "Abc News",
        "Emily Shapiro",
        "More Aaron",
        "More Emily"
    ],
    "date_download": "2017-12-11 17:33:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "NYC explosion suspect self-inspired from ISIS online propaganda: Sources",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fnyc-explosion-suspect-made-statements-indicating-supports-isis%2Fstory%3Fid%3D51718097.json",
    "image_url": "http://a.abcnews.com/images/US/port-authority-explosion9-gty12-ht-mem-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The suspect in custody after what New York City officials called an \"attempted terrorist attack\" near Times Square this morning told authorities he is self-inspired from ISIS online propaganda, sources said.\nInterested in New York? Add New York as an interest to stay up to date on the latest New York news, video, and analysis from ABC News. Add Interest\nThe suspect, 27-year-old Akayed Ullah, was hospitalized after he was badly injured in the arm and torso from the device that went off in his arms, sources said.\nUllah, originally from Bangladesh, entered the United States seven years ago on a family-based visa and has an address in Brooklyn, sources said.\nThe explosive was assembled in his apartment, sources said.\nAuthorities called the explosive an \"improvised low-tech explosive device\" that was held on the suspect with Velcro and zip ties.\nJason Szenes/EPA\nThe explosive detonated at about 7:20 a.m. in a subway passageway between Times Square and the Port Authority Bus Terminal. New York Gov. Andrew Cuomo said hearing of a bomb in the subway is \"one of our worst nightmares.\"\nThree people were injured, but none of their wounds appear to be life-threatening, the FDNY said.\nThe FBI is now searching several Brooklyn locations.",
    "source_domain": "abcnews.go.com",
    "title": "NYC explosion suspect told authorities he's self-inspired from ISIS online propaganda: Sources",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/nyc-explosion-suspect-made-statements-indicating-supports-isis/story?id=51718097"
}