{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:15:14+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Alek Minassian appeared in court this morning in Toronto, which is the sprawling capital of Ontario province. He is scheduled to appear in court again May 10 via video link.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fvideo%2Fsuspect-toronto-van-attack-charged-murder-54694230.json",
    "image_url": "https://s.abcnews.com/images/International/180424_nwo_toronto_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Suspect in Toronto van attack charged with murder\nPoint five year old Alec may now feud in court this morning as police continue their search for a motive. In what the Canadian prime minister is calling senseless attack the half of. All Canadians side I'll offer my deepest heartfelt condolences to the loved ones of all those who were killed. And we wish a full recovery. This new surveillance video showing the dead leave BN massacre in broad daylight eyewitnesses telling ABC news the V and swerved across multiple lanes of traffic. Before jumping onto the sidewalk and hitting pedestrians across sixteen blocks. Couldn't believe what I see him and those. Everybody helps people on the streets kitty it won't I want all I can envision is that vivid image of the lady being on top of this. And then being so into the crowd and then he ran over her as he plowed into. To the crowd eye witnesses are stealing shocked the suspect's neighbors and also in disbelief this is our first great tragedy. Of this kind in the Toronto area. And trump will never be the same again it. Toronto now a city in morning. Overnight a moment of silence at the Toronto Maple Leafs game. And this makeshift memorial at the site of the attack rolling by the hour. What to name an afternoon with charged with ten counts of murder and thirteen counts of attempted murder. As remote if it remains under investigation for now police say they believe this attack was intentional. But not over deleted. Elizabeth her ABC news New York.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Suspect in Toronto van attack charged with murder",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/video/suspect-toronto-van-attack-charged-murder-54694230"
}