{
    "authors": [
        "Abc News",
        "More Angela"
    ],
    "date_download": "2018-05-30 19:55:47+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "She has a new book, “My Chickens and I.”",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fisabella-rossellini-experiencing-ageism-modeling-industry%2Fstory%3Fid%3D55510151.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/isabella-rossillini-gty-mem-180522_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A lot has changed for women in the modeling world, according to former supermodel Isabella Rossellini.\nInterested in Popcorn? Add Popcorn as an interest to stay up to date on the latest Popcorn news, video, and analysis from ABC News. Add Interest\nRossellini was the face of the Lancome cosmetics company for nearly 15 years. It was a dream job, but it came with a big twist.\nDiana Walker/Time & Life Pictures/Getty Images\n“When I was working with Lancome to begin with, I had to be anonymous. They wanted a beautiful woman that made people dream,” Rossellini said in a recent appearance on “Popcorn with Peter Travers.” “My identity was never written, I never gave interviews.”\nShe added, “Be beautiful and shut up was the code.”\nWhen Rossellini turned 40, the company decided not to renew her contract, saying she was too old.\n\"I couldn’t understand it. They said to me that women dream to be young. Advertisement is about women’s dreams. It’s not about women’s reality. So if you ask women if you’re happy that a 48-year-old is representing you, they might say yes. But they really mean no because they want to be young. And I think that was a mistake. That was ageism. It was so ingrained,\" Rossellini said.\nTwenty-three years later, Rossellini, 65, got a phone call from the company.\n“A phone call (came) from Lancome saying we want you back. I said, ‘You’ve got to see me, because I’m 23 years older,’” quipped Rossellini. “And there was a woman executive. She said, ‘I want you because I want to make it right.’ That touched me and I’m delighted to be back.”\nShe continued, “I thought it was very good news not only for me, but that these big companies, they are now changing and being inclusive.”\nShe said she's also a fan of the spokeswomen for Lancome.\n“When I look at who is representing Lancome (now), Kate Winslet, Penelope Cruz, Julia Roberts, Lupita Nyong’o, all women that have careers, they are authors of themselves and I love this. First of all I love being a part of that group. I’m so flattered. It’s incredible how women want this type of woman instead of the silent beauty of 30 years ago,” she said.\nDownload the all new \"Popcorn With Peter Travers\" podcasts on Apple Podcasts, Spotify, Tunein, Google Play Music and Stitcher.\nRossellini said working at Lancome allowed her to become financially independent, and she was able to return to school to study animal behavior and write about chickens. Her new book, “My Chickens and I,” has just been released.\nPatrice Casanova\n“When I first ordered the chickens, I expected them to look like the yellow chicks that you see at Easter. But they all came and looked so different,” Rossellini said. She started to draw pictures to help recognize the different types of chickens. Then she realized photos might help with the process and teamed up with photographer Patrice Casanova.\n“So it started just as a documentation but the photos became quite beautiful,” said Rossellini, adding that it was fascinating to see the animals’ different expressions pop in the photos.\nShe decided to pair the photos with her drawings of the chickens and shared them with a friend as a joke. The friend suggested she actually create a book.\nEmilie Richardson/ABC News\n“My Chickens and I” is available now in bookstores and online.\nBe sure to watch the full interview with Peter Travers and Isabella Rossellini in the video above.",
    "source_domain": "abcnews.go.com",
    "title": "Isabella Rossellini on experiencing 'ageism' in the modeling industry",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/isabella-rossellini-experiencing-ageism-modeling-industry/story?id=55510151"
}