{
    "authors": [
        "Abc News",
        "More Mike"
    ],
    "date_download": "2018-03-19 22:31:15+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "An ex-spy Sergei Skripal and his daughter were poisoned with a nerve agent in the center of Salisbury, England, and now lie critically ill in the hospital.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Flife-quaint-british-city-center-russian-spy-scandal%2Fstory%3Fid%3D53856770.json",
    "image_url": "https://s.abcnews.com/images/International/salisbury-hazmat-tent-gty-ps-180315_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Salisbury is a quiet, historic English provincial city. In fact, the Salisbury Cathedral is about 800 years old and boasts the tallest spire in England. Additionally, the wonderous prehistoric ring of massive stones at nearby Stonehenge make Salisbury a big tourist destination.\nHowever, two weeks ago the ex-spy Sergei Skripal and his daughter were poisoned with a nerve agent in the center of town and now lie critically ill in the hospital. Now, Salisbury has become the focus of the world's attention.\n\"The world’s media descended on Salisbury and it took awhile to get used to that,\" local radio presenter Martin Starke told ABC News.\nKommersant/Yuri Senatorov via Reuters\n”People rely on us for trusted news,\" Martin, the host of a breakfast show on local radio station SpireFM, said. ”We report the things that the people of Salisbury need to know, we’ve not been sensationalist at all, our job is not to scare people.”\nSo are the people of Salisbury scared? Martin said that contrary to some national newspaper reports, Salisbury is not a city living in fear. People are being very British about things, he added and trying to carry on normally.\n“Salisbury is very much open for business,” he said.\nBut there have been inconveniences, as the area around the city center is cordoned off and what was a 30-second walk in the area has now become a five-minute walk via numerous detours.\nBusinesses behind the cordons have suffered, too. Recently, it was Mother’s Day, a busy time for the card shop and flower sellers. Both businesses in the city center were on the wrong side of the cordon, according to Martin, and the card shop was forced to close with the flower seller forced to move his stall where no one could find him.\nMatt Cardy/Getty Images\nAfter the attack, groups of people in hazmat suits suddenly became a common sight in Salisbury, according to Martin. To which, Martin said, people’s reaction to this occurrence hasn’t been completely one of fear, but more one of curiosity. While the rest of the world sees people in hazmat suits, the locals recognize their friends and neighbours zipped into the protective shells.\nEverything becomes very personal for the people of Salisbury, including Nick Bailey, a first responder policeman who's recovering in the hospital after coming into contact with the nerve agent.\nSooner or later Salisbury will return to being the “quintessentially English city” as Martin described it. He said he believes there will be no negative effect on the tourism which the city needs to survive. If anything, it will put Salisbury on the map a bit more he suggested before adding, once again the city will be “the best place to get a cream tea.”",
    "source_domain": "abcnews.go.com",
    "title": "A look into life in the quaint British city at the center of a Russian spy scandal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/life-quaint-british-city-center-russian-spy-scandal/story?id=53856770"
}