{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 03:30:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Granderson snaps tie with 300th HR, Mets rally past Cubs 9-4",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fgranderson-snaps-tie-300th-hr-mets-rally-past-48047857.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_4821568b135f4be9b71eb704fb6b8da2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Curtis Granderson opened a five-run eighth inning with his 300th homer, a tiebreaking shot that helped the New York Mets rally past the Chicago Cubs for a 9-4 victory Wednesday night.\nInjury replacement Lucas Duda added a three-run homer off Hector Rondon, and T.J. Rivera capped the outburst with an RBI single for his third hit.\nWith sluggers Yoenis Cespedes and Michael Conforto on the bench to begin the game, the resurgent Mets came back from a 4-1 deficit and took two of three from the defending World Series champions despite losing second baseman Neil Walker to a left leg injury.\nGranderson received a standing ovation and came out for a curtain call after connecting in the eighth off Carl Edwards Jr. (2-1).\nJerry Blevins (4-0) struck out three of his four batters to earn the win.\nJuan Lagares hit a tying triple with two outs in the sixth, the start of a meltdown by Chicago's bullpen that allowed New York to bail out starter Matt Harvey. The right-hander gave up three home runs in four innings, including Anthony Rizzo's latest leadoff shot and a mammoth drive by Kyle Schwarber.\nBatting leadoff Tuesday for the first time in his career, Rizzo homered on Zack Wheeler's second pitch to spark a 14-3 rout by the Cubs. The 240-pound slugger did himself one better this time, connecting on the first pitch from Harvey and prompting excited high-fives from giddy teammates in the dugout.\nChicago rookie Ian Happ, who hit a grand slam the previous night, followed with his seventh home run and the Cubs had a 2-0 lead after seven pitches. Schwarber's 467-foot shot over the Shea Bridge, a walkway for Citi Field fans above and beyond the bullpens in right-center, made it 4-1 in the fourth.\nWith the bases loaded in the bottom half and the Mets short on the bench, manager Terry Collins sent up pitcher Steven Matz to pinch hit for Harvey. Matz came through with an RBI infield single off starter Mike Montgomery, and Lagares trimmed it to 4-3 with a sacrifice fly.\nAddison Reed retired Rizzo with the bases loaded for the final out.\nTRAINER'S ROOM\nCubs: 2B-OF Ben Zobrist (left wrist) was out of the lineup for the second consecutive game but available to pinch hit, manager Joe Maddon said. After a day off Thursday, the team hopes Zobrist can start Friday night in Pittsburgh. If not, the disabled list could become a consideration. ... RHP Kyle Hendricks (hand tendinitis) was scheduled to have a second MRI.\nMets: Cespedes received a scheduled rest but is expected to start the next three games against division-rival Washington, Collins said. Cespedes, who recently returned from a strained hamstring, singled as a pinch hitter in the eighth and was immediately removed for a pinch runner. ... Conforto (stiff back) was held out of the starting lineup for the third consecutive night but said he felt great. \"It tightened up a few days ago and I think we're pretty sensitive to those kinds of things lately,\" Conforto said. \"We're just being really cautious.\" Conforto struck out as a pinch hitter in the sixth. \"I think what (Collins) really wants is for me to be 100 percent for this weekend,\" Conforto said. ... One day after double-play partner Asdrubal Cabrera (thumb) went on the 10-day disabled list, Walker pulled up lame trying to beat out a bunt in the third inning. The team announced he has a left leg injury and will have an MRI on Thursday. Duda entered in the fourth at first base, with Rivera shifting from first to second to replace Walker. And it appears the Mets once again will hold off on calling up hot-hitting shortstop prospect Amed Rosario from Triple-A Las Vegas. Second baseman Gavin Cecchini was scratched from the 51s lineup after Walker got hurt. ... LHP Josh Smoker was placed on the 10-day DL with a strained left shoulder and RHP Rafael Montero was recalled from Las Vegas. Smoker threw 81 pitches in long relief Tuesday night — 33 more than his previous career high in the majors.\nUP NEXT\nCubs: Begin a three-game series Friday night in Pittsburgh with RHP Eddie Butler (3-2, 4.03 ERA) on the mound against Pirates rookie RHP Trevor Williams (3-3, 5.13).\nMets: With the Mets using a six-man rotation during a long stretch between days off, rookie RHP Robert Gsellman (5-3, 4.95 ERA) gets another start Thursday night in the opener of a four-game series against NL East-leading Washington. Gsellman threw 6 2/3 shutout innings Saturday in Atlanta and has won a career-best three straight outings. After making two relief appearances, he is 3-0 with a 2.16 ERA in four starts since returning to the rotation. He faces Nationals LHP Gio Gonzalez (5-1, 2.91), who is 9-1 with a 1.62 ERA in 14 starts at Citi Field — including a 3-1 win over Jacob deGrom on April 22 during Washington's three-game sweep.\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "Granderson snaps tie with 300th HR, Mets rally past Cubs 9-4",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/granderson-snaps-tie-300th-hr-mets-rally-past-48047857"
}