{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 21:42:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Neff, Target surge, while Newmont Mining dips",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fneff-target-surge-newmont-mining-dips-49214938.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/neff-target-surge-newmont-mining-dips-49214938",
    "language": "en",
    "localpath": null,
    "maintext": "Stocks that moved substantially or traded heavily Monday:\nNeff Corp., up $4.15 to $26\nThe equipment rental company Neff said it received a buyout offer worth $25 per share, or $596 million.\nFiat Chrysler Automobiles NV, up 99 cents to $12.60\nAutomotive News reported that a Chinese car maker offered to buy the company, but that the offer was rejected.\nNewmont Mining Corp., down 51 cents to $36.02\nThe price of gold fell as tensions between the U.S. and North Korea appeared to ease.\nTesco Corp., up 50 cents to $4.40\nThe drilling technology developer said it will be acquired by drilling contractor Nabors Industries in an all-stock deal.\nNetflix Inc., down 40 cents to $171\nThe streaming video company announced a deal with show creator Shonda Rhimes, one of the biggest names in TV.\nTarget Corp., up 76 cents to $55.79\nThe retailer said it will buy transportation technology company Grand Junction to help it offer same-day delivery to shoppers.\nVMware Inc., up $6.07 to $98.02\nThe cloud computing company gave a strong second-quarter forecast.\nJD.com Inc., down $1.65 to $44.25\nInvestors were disappointed with the Chinese online retailer's second-quarter results.\nAdvanced Micro Devices Inc., up 53 cents to $12.67\nTechnology companies including chipmakers did better than the rest of the market on Monday.",
    "source_domain": "abcnews.go.com",
    "title": "Neff, Target surge, while Newmont Mining dips",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/neff-target-surge-newmont-mining-dips-49214938"
}