{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 06:12:39+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Joel Embiid set for first back-to-back games, then off to Minneapolis",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fjoel-embiid-set-back-back-games-off-minneapolis%2Fstory%3Fid%3D52812366.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0202/dm_180202_NBA_Zach_Lowe_on_Griffin_debut/dm_180202_NBA_Zach_Lowe_on_Griffin_debut_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "PHILADELPHIA -- Joel Embiid opened the first set of back-to-back games in his NBA career with 17 points and 11 rebounds to help lead the Philadelphia 76ers to a 103-97 win over the Miami Heat on Friday night. Embiid is set to play games on consecutive nights for the first time since he was picked No. 3 overall in the 2014 draft. He should be in the starting lineup Saturday at Indiana.\nEmbiid also said that after Saturday, he'd be attending the Super Bowl on Sunday.?\nEmbiid, selected to his first All-Star team, missed his first two seasons with injuries, and the Sixers have been leery of pushing their 7-foot-2 center into major minutes over the last two seasons.\n\"We're not going to be too paranoid about how we play him,'' coach Brett Brown said. \"There will be that in the back of our minds as the game plays out. But the bottom line is, we are going to play him to win this game, and we will figure it out. There is no type of concrete minute restriction, just an awareness that I have to have and the medical staff has to have to try to get him to play in both games.''\nThe Sixers are eighth in the Eastern Conference playoff standings and clearly need a healthy Embiid down the stretch to crack the postseason for the first time since 2012. Brown said Embiid will play in back-to-backs because he has been cleared to go -- not to avoid the lousy optics that might come in two weeks when Embiid will play in the Rising Stars Challenge, the Skills Challenge and the All-Star game within 48 hours.\n\"Joel's availability has got nothing to do with desperation or crunch time. It's all about his health,'' Brown said.\nBrown said that, as of yet, no one from the Sixers has talked to anyone involved with All-Star Weekend about limiting Embiid's minutes.\nInformation from the Associated Press was used in this report.?",
    "source_domain": "abcnews.go.com",
    "title": "Joel Embiid set for first back-to-back games, then off to Minneapolis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/joel-embiid-set-back-back-games-off-minneapolis/story?id=52812366"
}