{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 17:10:51+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Congress Ushers in New Era of All-Republican Rule",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcongress-ushers-era-republican-rule-44512111.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/congress-ushers-era-republican-rule-44512111",
    "language": "en",
    "localpath": null,
    "maintext": "Congress ushers in a new era of all-Republican rule.\nOn Tuesday at noon, with plenty of pomp and pageantry, members of the 115th Congress will be sworn in, with an emboldened GOP intent on unraveling eight years of President Barack Obama's Democratic agenda and targeting massive legacy programs from Franklin D. Roosevelt and Lyndon B. Johnson such as Social Security and Medicare.\nIn the election, Republicans kept their tight grip on the House and outmaneuvered the Democrats for a slim majority in the Senate. In less than three weeks, on the West Front of the Capitol, Chief Justice John Roberts will administer the presidential oath to Donald Trump, the GOP's newfound ally.\nFirst up for Republicans is repeal and delay of the health care law, expediting the process for scrapping Obama's major overhaul but holding off on some changes for up to four years. The tax code is in the cross-hairs. Conservatives want to scuttle rules on the environment and undo financial regulations created in the aftermath of the 2008 economic meltdown, arguing they are too onerous for businesses to thrive.\nThe only obstacle to the far-reaching conservative agenda will be Senate Democrats who hold the power to filibuster legislation, but even that has its political limitations. Twenty-three Democrats are up for re-election in 2018, including 10 from states Trump won, and they could break ranks and side with the GOP.\nHere are a few things to know about Congress:\n———\nBY THE NUMBERS\nVice President Joe Biden, in one of his final official acts, will administer the oath to 27 returning senators and seven new ones. Republicans will have a 52-48 advantage in the Senate, which remains predominantly a bastion of white men.\nThere will be 21 women, of whom 16 are Democrats and five, Republicans; three African Americans, including California's new Democratic senator Kamala Harris, and four Hispanics, including Nevada's new Democratic senator Catherine Cortez Masto.\nAcross the Capitol, the House is expected to re-elect Rep. Paul Ryan as Speaker, with all the campaign-season recriminations involving the Wisconsin Republican and Trump largely erased by GOP wins. Once sworn in, Ryan will then administer the oath to the House members.\nThe GOP will hold a hefty 241-194 majority in the House, including 52 freshmen — 27 Republicans, including Wyoming's Liz Cheney, daughter of former Vice President Dick Cheney, and 25 Democrats.\n———\nCONFIRMING THE CABINET\nThe Senate will exercise its advice and consent role and consider nominations of 15 department secretaries and six people tapped by Trump to lead agencies or serve in roles with Cabinet-level status, such as the EPA and U.N. ambassador.\nDemocrats won't make it easy.\nSeveral in the party have been highly critical of several of Trump's choices, from Rick Perry, who forgot during the 2012 presidential campaign that the Energy Department was the one he wanted to eliminate, to Treasury pick Steve Mnuchin, the former Goldman Sachs executive whom Democrats have dubbed the \"foreclosure king\" for his stake in OneWest Bank that profited from the foreclosure crisis.\nOthers nominees, such as retired Marine Corps Gen. James Mattis for defense secretary, should easily win confirmation. First, though, Congress must pass a law allowing the former military man to serve in a civilian post.\nThere is a limit to what Democrats can do. Rules changes in 2013 allow some nominees, including Cabinet picks, to be confirmed with a simple majority, preventing Democrats from demanding 60 votes to move forward.\n———\nSUPREME COURT VACANCY\nAdding to the drama of the new Congress will be high-profile confirmation hearings for Trump's nominee for the Supreme Court.\nJustice Antonin Scalia died last February and Republicans refused to consider Obama's nominee, Merrick Garland, insisting that the next president should fill the high court vacancy that's now lasted more than 10 months.\nTrump released a list of potential choices during the campaign that included Utah Sen. Mike Lee, who clerked for Justice Samuel Alito. Since the election, the president-elect also has met with Texas Sen. Ted Cruz, who clerked for former Chief Justice William Rehnquist, prompting talk about a possible nomination for the onetime presidential rival.\nTrump has said he wants to nominate a justice who would help overturn Roe v. Wade, the 1973 decision that legalized abortion. Cruz and Lee would fulfill that pledge.\n———\nNEW FACE IN LEADERSHIP\nThe point man for Senate Democrats is Brooklyn-born Chuck Schumer, who will be a chief antagonist to fellow New Yorker Trump.\nSchumer succeeds Nevada's Harry Reid, who retired after five terms, and joins Congress' top leaders — Majority Leader Mitch McConnell, R-Ky., House Minority Leader Nancy Pelosi, D-Calif., and Speaker Ryan — in what is certain to be tough negotiations next year on spending and policies.\n———\nRUSSIAN HACKING\nThe first public hearing on the intelligence community's assessment that Russia interfered in the U.S. election is Thursday in the Senate Armed Services Committee, with James Clapper, the director of national intelligence, set to testify. Expect individual panels to investigate, but not a special, high-profile select committee. McConnell has rejected that bipartisan call.",
    "source_domain": "abcnews.go.com",
    "title": "Congress Ushers in New Era of All-Republican Rule",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/congress-ushers-era-republican-rule-44512111"
}