{
    "authors": [
        "Abc News",
        "More Adam"
    ],
    "date_download": "2017-02-15 04:25:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Arrest of 'dreamer' immigrant could be first under Trump to defy DACA",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Farrest-dreamer-immigrant-trump-defy-daca%2Fstory%3Fid%3D45499878.json",
    "image_url": "http://abcnews.go.com/Politics/arrest-dreamer-immigrant-trump-defy-daca/story?id=45499878",
    "language": "en",
    "localpath": null,
    "maintext": "The Obama administration policy protecting the children of undocumented immigrants who were brought to the United States in their youth may face its first test under the Trump administration when Immigration and Customs Enforcement agents arrested a Mexican migrant in Washington state last week.\nThe arrest of Daniel Ramirez, 23, first reported by Reuters Tuesday evening, is possibly the first of an immigrant protected by the Deferred Action for Childhood Arrivals program during the presidency of Donald Trump.\nTrump campaigned on the progress to halt undocumented immigration, particularly from Mexico, and to roll back Obama-era programs that provide amnesty to immigrants already living in the country.\nICE said in a statement Ramirez is a \"self-admitted gang member\" arrested on Feb. 10 \"during an operation targeting a prior-deported felon.\"\n\"ICE officers took Mr. Ramirez into custody based on his admitted gang affiliation and risk to public safety,\" the statement said.\nAccording to the government, gang membership can be an indicator that an immigrant poses a public safety threat.\nRamirez's attorney, Theodore Boutrous Jr., said: “The government offered no explanation of why Mr. Ramirez was initially taken into custody and why he is still being held\" and said his client \"had documentation that clearly indicated he had DACA( Deferred Action for Childhood Arrivals) status, allowing him to live and work in the United States.\"",
    "source_domain": "abcnews.go.com",
    "title": "Arrest of 'dreamer' immigrant could be first under Trump to defy DACA",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/arrest-dreamer-immigrant-trump-defy-daca/story?id=45499878"
}