{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 02:53:09+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Senior FBI officials consider the intelligence memo deeply flawed and clearly political, sources said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ffbi-director-sends-video-message-rank-file-inside-52809062.json",
    "image_url": "http://a.abcnews.com/images/Politics/180202_wn_thomas2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for FBI director sends video message to rank and file inside agency after classified memo release\nIn the meantime, Jon, this move by the president is not sitting well inside the FBI. Now ignoring concern from his new FBI director, and tonight, the personal message from that FBI director, Christopher WRAY, sent to his rank in file late today. Here's ABC's chief justice correspondent, Pierre Thomas, with what we have learned tonight. Reporter: Tonight, ABC news has learned that many in the FBI are fuming after president trump ignored the warning from the FBI and his own handpicked FBI director after they went public with, quote, grave concerns about the memo's release.\" And late today, FBI director Chris WRAY taking the raretep of sending a video message to the FBI rank and file. We have learned he told them, quote, we stay laser-focused on doing great work, even when it's not easy, because we believe in the FBI. Law enforcement sources tell ABC news that senior FBI officials consider the intelligence memo to be deeply flawed for cherry picking information and clearly political. They say it omits multiple other pieces of intelligence not just the dossier, that led to that warrant being issued to monitor Carter page. Tonight, a Democrat on the house intelligence committee says what this is is obvious, an attempt to undermine Robert Mueller's investigation of possible collusion and obstruction of justice. I have seen the evidence. I have not seen a shred of evidence that would suggest that there's been an abuse in the Russia investigation. But what I do see is attempt after attempt to go after Bob Mueller and his team. And tonight, the 13,000-member FBI agents association is also taking a stand. Quote, FBI agents have not and will not allow partisan politics to distract us from our solemn commitment to our mission. And former FBI Reporter: And former FBI director James Comey, fired by president trump, tweeting of the memo's contents \"That's it?\" \"Dishonest and misleading.\" Judge would a distraught Pierre, the president's own attorney general, Jeff sessions in the middle of all this showing support for his deputy attorney general, rod Rosenstein, and tonight is under fire from the president. Reporter: That's right, David. Sessions and Rosenstein were both at a justice department conference today, and sessions said Rosenstein symbolizes the kind of quality and leadership his department needs, David. Pierre Thomas, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "FBI director sends video message to rank and file inside agency after classified memo release",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/fbi-director-sends-video-message-rank-file-inside-52809062"
}