{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:21:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Italy OKs ambassador for Cairo, cites murder probe progress",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fitaly-progress-probe-cairo-torture-murder-scholar-49211615.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_85e41625a64c4997bb6b71bece416bc0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Italy is letting its ambassador take up his post in Cairo, citing on Monday progress by Egypt in the investigation of the 2016 torture death of an Italian scholar that had weighed on diplomatic ties.\nThe move does not mean Italy intends to ease the pressure on Egyptian authorities to bring Giulio Regeni's killers to justice, Italian Foreign Minister Angelino Alfano said. The ambassador will bear a letter asserting the Italian government's determination to discover the truth about the murder, Alfano said.\nAmbassador Giampaolo Cantini \"will have the task of contributing, via contacts with Egyptian authorities, toward reinforcing judicial cooperation, and, as a consequence, the search for the truth,\" Alfano said in a statement.\nRegeni was a Cambridge University doctoral student researching labor movements in Egypt when he was abducted in Cairo in January 2016. His body was found along a Cairo road a few days later bearing marks of extensive torture.\nItalian news agency ANSA said Italian and Egyptian prosecutors issued a joint statement pledging to find the \"truth and all the circumstances that led to the abduction, torture and death.\"\nItalian state TV said Egypt has sent Italian prosecutors transcripts of fresh questioning of Egyptian police officers who had a role in investigating Regini's death. Egypt also assured Italy it would provide video surveillance footage from cameras at the Cairo subway stop where Regeni was known to have been last seen alive.\nIn April 2016, the then-ambassador was recalled to Italy for consultations, to highlight the Italian government's frustration with Egyptian investigators. Since then, that ambassador was assigned elsewhere, and the embassy in Cairo awaited its ambassador.\nRegeni disappeared on a day Cairo police were on a tense watch for protests on the fifth anniversary of the 2011 popular uprising.\nAfter his body was discovered, Egyptian authorities offered various explanations, including an assertion that Regeni had been hit by a vehicle. Later, they said he was a victim of a robbery.\nEgypt is considered a key ally both in international efforts to combat Islamist-terrorism as well as efforts to stabilize neighbor Libya, a base for human traffickers who have sent hundreds of thousands of migrants by sea toward Italy in the last few years.\nIn a statement, Alfano dismissed any suggestion that Italy's desire to slow the flow of migrants across the Mediterranean Sea had triggered dispatching the ambassador to Cairo.\n\"That Egypt is an inescapable interlocutor on issues of primary importance for Italy, like the stabilization of Libya and the fight against terrorism, doesn't signify that Italy intends to turn the page in the search for truth in Giulio Regeni's murder,\" the minister said.\nRegeni's family has been outspoken in demanding that Italy insist on getting the truth from Egypt. His mother has said her son's face was so badly pummeled the only facial feature she could recognize was the tip of his nose.\nItalian state TV said Monday night the family was indignant that the ambassador was allowed to go to Cairo.\n———\nFrances D'Emilio on twitter: www.twitter.com/fdemilio",
    "source_domain": "abcnews.go.com",
    "title": "Italy OKs ambassador for Cairo, cites murder probe progress",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/italy-progress-probe-cairo-torture-murder-scholar-49211615"
}