{
    "authors": [
        "Abc News",
        "More Erica"
    ],
    "date_download": "2018-04-24 21:03:47+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "President Trump and President Macron's 'bromance' continues at White House.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-macrons-bromance-continues-kisses-praise%2Fstory%3Fid%3D54694470.json",
    "image_url": "https://s.abcnews.com/images/Politics/macron-trump2-gty-ml-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Walking hand in hand, kisses from cheek to cheek, effusive praise.\nThe \"bromance\" between President Donald Trump and French President Emmanuel Macron continued to raise eyebrows Tuesday on day two of Macron's state visit.\nMark Wilson/Getty Images\nNot shy about expressing his affection for Macron, Trump told reporters in the Oval Office, “We do have a very special relationship,” as he brushed off what Trump called “a little piece of dandruff” off Macron's suit jacket shoulder.\n“We have to make him perfect. He is perfect,” Trump added.\nThe official day began when the two shared an unreserved double-cheek kiss upon Macron's arrival at the White House Tuesday.\nMark Wilson/Getty Images\nAfter the arrival ceremony, the two men walked side by side into the White House with their hands on each other's backs.\nThey then walked hand in hand through the colonnade toward the Oval Office.\nKevin Lamarque/Reuters\nIn a rare comment, Trump agreed with how the news media portrays his relationship with Macron.\n“They are always saying what a great relationship we have. It is not fake news,” Trump said.\nThe president also praised Macron for his leadership.\n“He is doing a great job... he will be a great President of France,” he said.\nAndrew Harnik/AP\nLater, at their joint press conference, the two again locked hands and shared a kiss.\n\"I like this guy a lot,\" Trump said.",
    "source_domain": "abcnews.go.com",
    "title": "Trump and Macron's 'bromance' continues with kisses, praise",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-macrons-bromance-continues-kisses-praise/story?id=54694470"
}