{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 13:03:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "ABC News senior meteorologist Rob Marciano tracks the latest weather forecast as the Northeast prepares for the coldest wind chills of the season.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fnortheast-braces-winter-blast-snow-51713449.json",
    "image_url": "http://a.abcnews.com/images/GMA/171211_gma_marciano_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Northeast braces for winter blast, snow\nI know you know you were invited. So much of the country we've been looking at is cold here but so many people are bracing for winter weather. Did you see the Buffalo bills game Sunday. Take a look at what it was like in the stands. You couldn't see in front of you so as a player I would have just defended the run. They can't throw the ball. Nobody can see it. Hearty fans there. Very hearty fans. They love the game. Speaking of being on the field, the colts were trying hard to clear a path for their kicker. Adam vinatieri. I think they had something like that in the past too. He's kind of used to that. Losing the game, though. That's hard. More now on the snow. It's on the way. Rob is here with all of that. Good morning, rob. Good morning, robin. Your next system diving down into Minneapolis. Crashes across Minneapolis and northern parts of Minnesota. Travel advisories out by the department of transport. The cold air in place. Frost advisory to lake okeechobee, sugar cane fields there and the northeast, this will bring a little snow and -- but really the cold air will be the main thing. Tomorrow morning it will feel like minus two in Chicago and by the time Wednesday morning rolls along single digits in New York City, the coldest of the season. Back to you. Thank you, rob.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Northeast braces for winter blast, snow",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/northeast-braces-winter-blast-snow-51713449"
}