{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:15:18+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "AP Explains: National security adviser a policy whisperer",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fap-explains-national-security-adviser-policy-whisperer-45503419.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/ap-explains-national-security-adviser-policy-whisperer-45503419",
    "language": "en",
    "localpath": null,
    "maintext": "The national security adviser is the president's policy whisperer and confidant on military matters, diplomacy, intelligence, terrorism — even the odd hurricane. The adviser usually enjoys unmatched trust with the chief executive and lots of behind-the-scenes clout.\nA man-made hurricane consumed the latest one.\nA look at the job:\nOUT LIKE FLYNN\nNo other national security adviser has gone out quite like Michael Flynn, who lasted less than a month, a record low. Before Flynn was forced out as President Donald Trump's national security adviser, the Obama administration fired him for insubordination in 2014, when he was defense intelligence chief.\nAt issue this time: Flynn's contact with Russia's ambassador to the U.S. late last year, which raised questions about whether he was freelancing on policy about Russian sanctions while President Barack Obama was still in office and how he misled Trump officials about the calls. Trump wanted him to step down because of an \"eroding level of trust,\" said White House spokesman Sean Spicer.\n———\nAT THE CENTER\nIn his brief tenure, Flynn was at the heart of deliberations over provocative missile tests by North Korea and Iran, close to the president's side in his meetings and calls with world leaders and privy to all manner of secrets by virtue of his position straddling the military, diplomatic and intelligence components of national security.\nDemocrats want to find out when Trump knew of the circumstances that eventually got Flynn fired and why he was allowed to maintain his access when it emerged that he had not given an accurate account of his communications with the ambassador.\n———\n'DE-HOT' THE WORLD:\nThat's how banker Robert Cutler described the nature of his counsel to President Dwight D. Eisenhower when he served as the first national security adviser, starting in 1953.\nCutler set the template in terms of discretion. Said his New York Times obituary in 1974: \"No man in the Government, except the President, knew more of the nation's strategic secrets; yet no other man so high in the Administration was so little known outside the President's inner circle.\"\n———\nTHAT'S NOT TO SAY THEY'RE PEACENIKS\nHardly. There have been hawks aplenty. McGeorge Bundy, for one, pushed an expansion of U.S. fighting in Vietnam while working as national security adviser to presidents John F. Kennedy and Lyndon Johnson.\n———\nNOT HOUSEHOLD NAMES\nMany aren't well-known to the public when they come into the job or all that famous when they leave. Dillon Anderson, anyone? He served in 1955-56.\nAmong the very well known: the two women, among 20 men, who have been national security adviser: Condoleezza Rice, who served George W. Bush in his first term before becoming secretary of state; and Susan Rice, Obama's second-term national security adviser. Rice was ambassador to the U.N. in his first term.\nTrump on Tuesday appointed retired Lt. Gen. Keith Kellogg on an acting basis.\n———\nOH HENRY\nIt's hard to overstate the influence Henry Kissinger wielded on Richard Nixon from the dawn of his presidency to its bitter final days.\nKissinger was such a driver of foreign policy and more that Nixon had him multitask as national security adviser and secretary of state during his second term, abbreviated by Nixon's 1974 resignation. Kissinger, the longest-serving national security adviser, kept both jobs for more than a year under President Gerald Ford, then finished Ford's term as secretary of state only.\nColin Powell was national security adviser under Ronald Reagan and later chairman of the Joint Chiefs of Staff under George H.W. Bush and Bill Clinton, and secretary of state under George W. Bush.\n———\nWHAT COUNTS AS NATIONAL SECURITY?\nNational security advisers have not been limited to traditional threats to the U.S. Stephen Hadley, for example, was involved in the federal emergency response to Hurricane Katrina during George W. Bush's administration and Susan Rice took up climate change as a matter of national security during Obama's second term.",
    "source_domain": "abcnews.go.com",
    "title": "AP Explains: National security adviser a policy whisperer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/ap-explains-national-security-adviser-policy-whisperer-45503419"
}