{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 16:20:47+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "3 People Arrested in Dakota Access Pipeline Stadium Protest",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fpeople-arrested-dakota-access-pipeline-stadium-protest-44510436.json",
    "image_url": "http://a.abcnews.com/images/US/161031_vod_orig_dakotatimeline_16x9_1600.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Three people are in custody Monday after two Dakota Access pipeline protesters rappelled from the roof of the U.S. Bank Stadium in Minneapolis to hang a banner during the Minnesota Vikings' season finale against the Chicago Bears.\nThe game was not interrupted by the protest Sunday, but eight rows of fans seated below the banner were cleared as a precaution. The Vikings beat the Bears, 38-10.\nThe banner urged Minneapolis-based U.S. Bank to divest from the four-state, $3.8 billion pipeline. Opponents contend the pipeline could affect drinking water and Native American artifacts. Texas-based developer Energy Transfer Partners says the pipeline will be safe.\nMinneapolis police spokesman Officer Corey Schmidt said a 32-year-old man and 26-year-old woman were arrested Sunday on misdemeanor burglary and trespass charges for the high-flying stunt. Police later arrested a 27-year-old woman whom they accuse of obstructing the legal process, but have released no details of her role in the incident.\nThe protesters rappelled into place during the second quarter, and then hung in a seated position about 100 feet above the seats that were evacuated for safety. The pair watched the rest of the game, occasionally shifting positions or waving at spectators. One wore a purple Brett Favre Vikings jersey.\nU.S. Bank Stadium operator SMG said in a statement that they apparently climbed over a guard rail to access the ridge truss. Police spoke with them from a catwalk in attempt to get them to stop, and by the fourth quarter about a half-dozen police and firefighters in rappelling gear were on the truss waiting to remove the pair.\nThe protesters willingly climbed up their ropes when the game ended, as fans booed them from below.\nVikings spokesman Lester Bagley said the team's only concern was for the \"safety of our fans and guests.\"\nProtesters say U.S. Bank has extended a large credit line to Energy Transfer Partners. U.S. Bank spokesman Dana Ripley declined comment.\nThe pipeline would carry oil from western North Dakota through South Dakota and Iowa to a shipping point in Illinois. Protesters camped in North Dakota for months to try to stop completion of the project.\n———\nAssociated Press reporter Jeff Baenen contributed to this story from Minneapolis.",
    "source_domain": "abcnews.go.com",
    "title": "3 People Arrested in Dakota Access Pipeline Stadium Protest",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/people-arrested-dakota-access-pipeline-stadium-protest-44510436"
}