{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 20:17:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "US blames North Korea for series of cyberattacks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fus-blames-north-korea-series-cyberattacks-48039814.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/us-blames-north-korea-series-cyberattacks-48039814",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. officials are blaming the North Korean government for a series of cyberattacks dating to 2009 against media, aerospace, financial sectors and infrastructure in the United States and around the world.\nThe FBI and the Department of Homeland Security issued a warning this week, saying the cyberattacks were carried out by actors within the North Korean government who are known as \"Hidden Cobra.\"\n\"DHS and FBI assess that Hidden Cobra actors will continue to use cyber operations to advance their government's military and strategic objectives,\" the alert said.\nU.S. officials are distributing internet addresses to help networks defend against any attacks. The FBI said it has high confidence that the internet addresses are linked to systems infected with Hidden Cobra malware to further exploit networks. The cyberattacks targeted weaknesses in Microsoft Corp. operating systems and Adobe Systems Inc.'s Flash software, which were patched in January and June, respectively.\nThe joint alert was issued Tuesday, the same day that American student Otto Warmbier, who was released from serving a 15-year sentence in a North Korean prison for participating in alleged acts against the government, arrived in Cincinnati, Ohio.\nThe U.S. remains in a standoff with North Korea over its nuclear program. The U.S. has issued sanctions, but Pyongyang has not made any move to give up weapons that it says are a deterrent to any invasion. Thousands of U.S. troops are based in neighboring South Korea, and the Demilitarized Zone between the North and South is one of the most heavily fortified borders in the world.",
    "source_domain": "abcnews.go.com",
    "title": "US blames North Korea for series of cyberattacks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/us-blames-north-korea-series-cyberattacks-48039814"
}