{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2017-06-14 19:24:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "A North Carolina hospital is celebrating babies who are ending their stay in the neonatal intensive care unit.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fnurses-honor-tiny-graduates-leaving-nicu%2Fstory%3Fid%3D48035959.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/HT-Christopher1-MEM-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A North Carolina hospital is celebrating babies who are ending their stay in the neonatal intensive care unit.\nThe staff at CaroMont Health in Gastonia, North Carolina, honor their tiny patients with a special photo shoot and a graduation cap.\nAbout six months ago, Nurse Melissa Jordan began the \"graduation ceremonies\" after she helped care for an infant who spent 62 days in the NICU.\nOn the day he was leaving, the baby's parents dressed him up in a \"NICU Grad\" onesie, which inspired Jordan to continue the tradition.\n\"It's an emotional roller coaster for a preemie,\" Jordan, 28, told ABC News. \"One day could be really happy and then another day there can be several setbacks. You have to be there emotionally for the parents and celebrate every single, teeny milestone.\"\nCourtesy CaroMont Health\nCourtesy CaroMont Health\nOn the last day of the NICU stay, each baby gets a professional photo shoot and a foam cap with a message written by Jordan.\nBella Baby Photography takes the photos of each graduate free of charge.\nCourtesy CaroMont Health\n\"We thought it'd be a great experience for us to give back to the families and be a part of that milestone as the babies are being discharged,\" said photographer Amanda Meixsell.\nJordan will display the pictures of all the NICU grads on the walls of the unit to give hope to preemie parents, she said.",
    "source_domain": "abcnews.go.com",
    "title": "Nurses honor tiny 'graduates' leaving the NICU",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/nurses-honor-tiny-graduates-leaving-nicu/story?id=48035959"
}