{
    "authors": [
        "Abc News",
        "Alexa Valiente",
        "More Stefan",
        "More Alexa"
    ],
    "date_download": "2018-03-20 00:01:15+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "\"I have a platform to speak out. And it must be for a f------ reason,\" Bella Thorne said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fbella-thorne-pressure-maintaining-perfect-image-finally-honest%2Fstory%3Fid%3D53859731.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/bella-1-gty-er-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "At 20 years old, Bella Thorne may appear to have it all but according to the star, she’s very much still figuring life out.\nFrom private jets to movie premieres, the actress seems to live an exciting life and she documents it on Instagram for her 17 million followers to see.\nBut scroll a bit further through her social-media accounts and you’ll find a raw, unfiltered side of the star, who revealed she is bisexual on Twitter in 2016.\nThorne says she hopes being honest about her life and using her platform to inspire others will show fans that they too can be themselves.\n“The things that have happened to me in my life have happened to me, I feel, for a reason,” she told ABC News’ “Nightline.” “And it sounds cheesy, but it's a reason for change. … I have a platform to speak out and it must be for a f------ reason.”\nABC News\nThis message is heard loud and clear in her latest film, “Midnight Sun,” in which she stars as Katie Price, a senior in high school with a devastating disease. Thorne’s character falls in love with her next-door neighbor Charlie, who helps Katie find her voice.\nNow, Thorne hopes to help others discover theirs.\n“I feel like so many people would end up in healthier places if they felt like they actually had someone that's going to sit there and just listen to them,” she said. “And it's not fair that they don't have help. … Which is why I use my social media to talk about being dyslexic, to talk about, you know, other things from the past, to talk about basically anything. Any time you're creating debate, I think, is the best way to start any revolution.”\nEd Araquel/Open Road Films\nBut her personal revolution didn’t happen overnight.\n“I started modeling when I was 6 weeks old, out of the womb, literally,” Thorne said. “And then I modeled every single day growing up -- my whole life, like, three jobs A? day, you name it.”\nHer breakthrough role was on Disney Channel’s “Shake It Up.” She now stars on Freeform’s “Famous in Love.” Disney Channel and Freeform are owned by Disney, ABC News’ parent company.\nOn “Famous in Love,” Thorne plays a girl plucked from obscurity and thrown into a world of fame and glamour while navigating the Hollywood machine. It’s a reality Thorne knows all too well.\n“I talked in a higher voice, in a completely different pitch,” Thorne said of what she was like earlier in her career.\nShe said she spoke differently in interviews to keep up with the image she portrayed on “Shake It Up.”\n“People look at me now and they’re still like, ‘Please be that girl. Please be the girl with the long, nice, red hair that’s blown out and the light lashes and the little bit of eyeliner and the little bit of a lip, but not too much ‘cause you don’t want to be too much, you want to be just enough,’” she said.\nThat pressure to maintain a perfect image became very real after her father died suddenly in a motorcycle accident. When she was just 9 years old, Thorne became the breadwinner for her family. She said her only option was to get a job.\nCraig Sjodin/Disney Channel via Getty Images\n“When my father died, we had nothing,” Thorne said. “Everyone had taken everything, and then you’ve got a single mom with four kids who just lost her husband trying to have a roof over your head.” “We were very close to actually just literally being on the street,” she said.\nAnd while Thorne played a middle-school student on TV, her real-life education took a backseat.\n“I remember getting on ‘Shake It Up’ and I didn't know how to do simple adding and subtracting. Also being dyslexic, it's a little bit more difficult for me,” Thorne said. “It's one of the few things of my childhood that do make me a little bit angry.”\nToday, Thorne is using her life experiences to show the world who she really is. She’s opened up to her fans on issues ranging from her struggles with acne to more serious subjects, like depression, low self-esteem and even the #MeToo movement.\nIn January, Thorne posted a deeply personal story on Instagram, saying that she’d been sexually and physically abused “from the day I can remember [till] I was 14.”\n“I wanted to talk about it, but like all the other victims, you know, it’s like you feel like you’re a bad fruit,” she said.\nAfter she made the post, Thorne said she reached out to her longtime manager to ask whether what she’d said was OK.\n“And he was like, ‘What do you mean, “Is this OK?” This is great. You have nothing to be ashamed of, Bella,’” Thorne said. “And I was like, ‘Man, that's like what I've wanted to hear my whole life.’”\nThorne said she’s still trying to figure out who she is.\n“I think that for the rest of my life I’ll be asking myself that question,” she said.\nWatch the full story on ABC News' \"Nightline\" TONIGHT at 12:35 a.m. ET.",
    "source_domain": "abcnews.go.com",
    "title": "Bella Thorne on the pressure of maintaining a perfect image and finally being honest about who she is",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/bella-thorne-pressure-maintaining-perfect-image-finally-honest/story?id=53859731"
}