{
    "authors": [
        "Abc News",
        "More Andrea"
    ],
    "date_download": "2018-04-25 00:06:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "\"We are fighting to find out what happened,\" the victim's girlfriend said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fdead-mans-girlfriend-police-finger-effort-unlock-iphone%2Fstory%3Fid%3D54689590.json",
    "image_url": "https://s.abcnews.com/images/US/largo-florida-wawa-shooting-02-wfts-jc-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After Linus Phillip Jr., 30, was killed by a police officer after he was stopped at a gas station in Largo, Florida, for heavily tinted car windows. Authorities went to the funeral home recently in an effort to use his finger to unlock his phone as part of an investigation, Phillip's family attorney confirmed.\nDays before the funeral on April 31, two detectives held the man's hands up to the iPhone's fingerprint sensor in the cold storage at the funeral home but did not successfully unlock it, John Trevena, the family's pro bono attorney told ABC News.\nPhillip's family was at the funeral home making arrangements when the detectives showed up.\n\"So they are allowed to pull him out of the refrigerator and use a dead man's finger to get to his phone. It's disgusting,\" Phillip's girlfriend Victoria Armstrong told ABC affiliate WFTS in Tampa Bay, Florida. \"We are fighting to find out what happened.\"\nLargo Police\nThe Sylvan Abbey Funeral Home, where Phillip's funeral was held, did not immediately respond to ABC News' request for comment.\nLt. Randall Chaney confirmed the incident at the funeral home to the Tampa Bay Times, saying that detectives didn't think they would need a warrant since there's no expectation of privacy after death.\nWhen reached by ABC News, the Largo Police Department declined to provide further information about the case.\n\"The case is still presently active, however, sometime in the near future the investigation should be concluded and the report will be available for any public records requests,\" a spokesperson for the police department said.\nWFTS\nOn March 23, Largo police officers saw Phillip's vehicle had heavily tinted windows, which violates Florida law, according to a press release that the police department shared with ABC News.\nPhillip was driving a rental car and stopped at a Wawa gas station when the officers approached him. Phillip provided police with paperwork showing the car was a rental before an officer asked him why the car smelled like marijuana.\nThe officers told Phillip they were going to search him, according to the press release. When the officers attempted to lawfully detain Phillip, police said he jumped into the driver's seat and tried to flee.\nAn officer was hanging onto the car when Phillip allegedly put the car in reverse and accelerated nearby the gas pump, which made the officer fear for his life and fire his weapon, according to the press release.\nPhillip was shot four times, killing him.\n\"It is the conclusion of the State Attorney's Office that the death of Linus Phillip Jr. was the result of having been shot by Officer Matt Steiner in the legal performance of his duty and the shooting was justifiable homicide,\" the press release said.\nWFTS\nThe Largo Police Department reviewed multiple Wawa cameras and said that the footage is \"limited\" and does not show the encounter between Phillip and the officers.\n\"Did they really need to kill him to stop him?\" said Trevena. \"It makes no sense.\"\nThe family of Phillip is demanding that all of the camera footage be released, according to WFTS.\n\"They killed him after his 30th birthday. Oh god, he turned 30 on March 11,\" Martha Hicks, Phillip's mother, told WTFS. \"It's too much, too much. We just want to know what happened.\"\nPhillip had marijuana, crack cocaine, powdered cocaine, hydromorphone pills, and over $1,500 in cash in his pockets at the time, according to the police report.\nHe did not have a gun in his possession and had a past criminal history, reported WFTS.\nThe Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Dead man's girlfriend says police use of his finger in an effort to unlock iPhone after they killed him is 'disgusting'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/dead-mans-girlfriend-police-finger-effort-unlock-iphone/story?id=54689590"
}