{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 16:01:55+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Anna Mae Blessings, 92, allegedly pulled a gun from her bathrobe and shot her 72-year-old son, authorities said.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fwoman-refuses-move-assisted-living-facility-fatally-shoots-56364867.json",
    "image_url": "https://s.abcnews.com/images/US/180704_knxv_grandma_shooter_arizona_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Woman refuses to move into assisted living facility, fatally shoots son: Police\nWe watch sketch investigators tonight talked to neighbors knocking on doors to make sure stray bullets. Didn't hurt anyone else you're about to hear how this murder played out not only from deputies perspective. But from the survivors. Com lenient rally hiding in the bedroom she's at it. Dispatch audio from miracle but county deputies paints a picture. Of terror. Shot him in the neck. Investigators say on Monday 92 year old in a may blessings pulled a gun from her bath robe pocket. It killed or 72 year old son as discussions over movie blessings into an assisted living facility intensified. A complainant in an upcoming earning out of a lot of screaming. On the phone with nine more in one. Her son's girlfriend. Saw begun I have another woman running out dot. Techies say blessings supported gun right matter which you wrestle the weapon away it is under a bed on the phone with police. Blessings then pulled a second gun from her robe pocket that terrified woman fought back again. We got a little or want. And down route. Officers eventually found blasting sitting at a recliner at the home. That's when she was handcuffed. We will. Work. This is an extremely sad situation blessing apparently said that her son had told her she had become. Too difficult to live with and they plan to move her into an assisted living home stating. You ended my life so I'm taking yours and downhill on camera mobile ABC fifteen Arizona.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Woman refuses to move into assisted living facility, fatally shoots son: Police",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/video/woman-refuses-move-assisted-living-facility-fatally-shoots-56364867"
}