{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:26:49+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "US Open hole by hole",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fus-open-hole-hole-48036912.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/us-open-hole-hole-48036912",
    "language": "en",
    "localpath": null,
    "maintext": "A hole-by-hole look at Erin Hill Golf Club, site of the 117th U.S. Open to be played June 15-18:\nNo. 1, 608 yards, par 5: The last time the U.S. Open began with a true par 5 was at Olympia Fields in 2003 (the first hole at Chambers Bay played a par 5 and a par 4). A tee shot up the left side, closer to the wetlands, will help the hole play shorter. Players going for the green will negotiate a right-to-left slope in the fairway that can feed the ball toward the small green. This should be a good birdie chance.\nNo. 2, 338 yards, par 4 : The shortest par 4 on the course features a partially blind tee shot. Those trying to drive the green will have to be precise because the green is the smallest at Erin Hills and slopes from front to back. Anything left will leave a delicate pitch from below the green. A bunker is right of the green.\nNo. 3, 508 yards, par 4: The fairway is well-bunkered and slopes significantly to the left in the landing area. The approach is slightly uphill and is guarded with a bunker short of the green, and two bunkers on each side of the putting surface. The green features two levels divided by a pronounced ridge.\nNo. 4, 439 yards, par 4: Tee shots must avoid fairway bunkers. The absence of trees makes it difficult to pick a line for the uphill second shots, and players should avoid going over the greens because of the closely mown area behind the green. The putting surface is shallow and features a false front.\nNo. 5, 505 yards, par 4: This is the first hole that goes in an easterly direction. It has a pair of bunkers on the right side of the fairway. The front bunker is perpendicular to the green, which has a backstop on the left that can feed a shot back onto the green.\nNo. 6, 208 yards, par 3: The first par 3 plays with the prevailing wind and features the longest green on the course at 48 yards. It slopes away from front to back, obscuring the back part of the green. A forward tee is likely to be used for any front pin positions.\nNo. 7, 607 yards, par 5: The hole has 14 bunkers, several of them making the landing area tight. This plays into the prevailing wind, and more bunkers could come into play on the second shot. Approach shots that miss right leave a tough up-and-down on the largest green at Erin Hills, with a ridge that defines distinct quadrants.\nNo. 8, 492 yards, par 4: The tee shot is partially blind, and while it has no bunkers in the landing area, the fairway slopes to the right as the holes bends to the left. Three deep bunkers front a shallow green (26 yards). There is a slope on the back left of the green that should help feed the ball toward the middle.\nNo. 9, 135 yards, par 3 : The shorter the hole, the more loft in the shot, and the more the wind can wreak havoc. That's why the shortest hole at Erin Hills should not be underestimated. The tee is about 25 feet higher than the narrow green. The green has a false front and slopes from front left to back right. It is surrounded by bunkers, with the most daunting at the back left of the green.\nNo. 10, 504 yards, par 4: The 10th hole is the only one that plays in a northerly direction and has a large landing area with plenty of contours, including a slope that can send the ball bounding further down the fairway. The green is only 24 yards deep and bisected by a ridge. The right side is smaller and slightly raised.\nNo. 11, 460 yards, par 4: The blind tee shot is one of the most intimidating on the course, and players will have to choose their line to a fairway set on an angle from right to left. The deep bunkers fronting the green are not as close to the putting surface as they appear. The small green slopes from left to right and from back to front.\nNo. 12, 464 yards, par 4: The landing area is narrow, and players can get more roll down the right side. But a miss to the right could leave an awkward sidehill or downhill lie for the second shot to an extremely narrow green that is crowned, with subtle slopes running toward the front and back of the green.\nNo. 13, 193 yards, par 3: The tee shot goes from hill to hill and has a large bunker to the left of the green, along with a swale that helps feed errant shots into it. Players who miss the green to the right will likely see their ball fall away, leaving an uphill pitch to a green that slopes away from them. The green is 40 yards deep and has a small plateau at the front left.\nNo. 14, 594 yards par 5: Tee shots that favor the right side provide a better angle of attack to the green, and those who attempt to reach the green in two must hit a precise shot, guarding particularly against the severe drop-off to the right. A variety of shot options are available from the closely mown areas around the green, which features a large false front.\nNo. 15, 357 yards, par 4 : The back nine also has a short par 4 that requires precision for those who hit driver. The putting surface is small and slightly elevated, which will repel a shot that slightly misses. Laying up requires players to face a wedge into a green surrounded by several bunkers. A spine bisects the green, and players will face a tough two-putt if they're on the wrong side.\nNo. 16, 183 yards, par 3: This plays in an easterly direction to an elevated green angled from the front right to the back left. The two-tiered putting surface is 42 yards deep but very narrow, and it slopes significantly from back to front. There are deep, narrow bunkers on both sides of the green.\nNo. 17, 509 yards, par 4: This is the only hole at Erin Hills without a bunker. The fairway is undulating, meaning there will not be many even lies for the second shot. A large mound on the left can obscure the player's view of the green, particularly from the left side. Approach shots that miss long or to the right can bounce away from the green, which slopes from back to front.\nNo. 18, 637 yards, par 5: This joins Chambers Bay (on two days) and Torrey Pines and Pebble Beach as U.S. Open courses that end with a par 5, though this one should be a three-shot hole. Two accurate shots are required to get into range for the wedge shot to the green. Players who get out of position will have a hard time catching up because of several bunkers that come into play. And the green is receptive only to short shots.",
    "source_domain": "abcnews.go.com",
    "title": "US Open hole by hole",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/us-open-hole-hole-48036912"
}