{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:47:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Tiger Woods to enter diversion program Oct. 25",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ftiger-woods-enter-diversion-program-oct-25%2Fstory%3Fid%3D49215982.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0813/dm_170813_MLB_Coley_Harvey_on_Harpers_injury/dm_170813_MLB_Coley_Harvey_on_Harpers_injury_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "PALM BEACH GARDENS, Fla. -- Tiger Woods has agreed to plead guilty to reckless driving and will enter a diversion program that will allow him to have his record wiped clean if he completes the program, a prosecutor said Wednesday.\nWoods, 41, was charged with driving under the influence in May when he was found asleep in his Mercedes-Benz, apparently under the influence of a prescription painkiller and sleeping medication. No alcohol was found in his system.\nWoods did not appear at the Palm Beach County courthouse for his arraignment. Prosecutor Adrienne Ellis said the golf superstar agreed to plead guilty at an Oct. 25 hearing and enter the county's program for first-time DUI offenders.\n\"He is not being treated any different than anyone else,\" Ellis said.\nWoods' attorney, Douglas Duncan, entered a not guilty plea to the DUI charge on Woods' behalf and declined comment as he left the courthouse.\nUnder the plea deal, prosecutors would drop the DUI charge, which is a more severe charge than reckless driving. If he completes the program, he can ask a judge to expunge the reckless driving conviction.\nIn the diversion program, Woods will spend a year on probation, pay a $250 fine and court costs, attend DUI school and perform 50 hours of community service. He would also have to attend a workshop where victims of impaired drivers detail how their lives were damaged and face other conditions. Since the program began four years ago, almost 2,400 defendants have enrolled, according to the Palm Beach County State Attorney's Office.\nIf convicted of DUI, Woods would have faced a fine of between $500 and $1,000, had his car impounded for 10 days and other conditions. He also could have been jailed for up to six months, although that was unlikely, received probation and lost his driver's license for six months to a year.\nThe DUI arrest was the first time Woods had been in trouble since Thanksgiving weekend 2009, when he plowed his SUV into a tree and a fire hydrant outside his then-Windermere, Florida, home. That led to revelations that he had multiple extramarital affairs and a divorce from his wife Elin Nordegren, the mother of his two children. He spent 45 days in a Mississippi clinic where he was treated for sex addiction.\nWoods was arrested at 2 a.m. May 29 about 15 miles from his home in Jupiter, Florida, when officers found him unconscious in his Mercedes-Benz, which was parked awkwardly on the side of the road and had damage to the driver's side. It's not clear how he damaged the car. Officers checked the area but didn't find that he had hit anything.\nWoods didn't know where he was when asked by officers, and he stumbled and swayed through a field sobriety test, police dashboard camera video showed. Woods told officers he was taking the painkiller Vicodin and Xanax, which treats anxiety and insomnia, to cope with his fourth back surgery in April.\nWoods announced last month he had completed treatment at an out-of-state clinic to deal with his use of prescription medications.\nHis 79 PGA Tour victories and 14 major titles both rank No. 2 all-time. He has not competed since February because of his back injury and is not expected to return this year. His last win was in August 2013.",
    "source_domain": "abcnews.go.com",
    "title": "Tiger Woods to enter diversion program Oct. 25",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/tiger-woods-enter-diversion-program-oct-25/story?id=49215982"
}