{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:41:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-suspect-shooting-la-house-fire-injury-54691645.json",
    "image_url": "http://abcnews.go.com/US/wireStory/latest-suspect-shooting-la-house-fire-injury-54691645",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on a shooting following a house fire south of downtown Los Angeles (all times local):\n8:30 a.m.\nAuthorities say a 50-year-old woman was fatally shot after a house fire in Los Angeles and her son was taken into custody at the scene.\nFire Capt. Erik Scott told reporters that firefighters saw smoke billowing out of the windows of a two-story home in the Harbor Gateway neighborhood before dawn Tuesday morning. He says they extinguished the flames and gunshots rang out about 15 minutes later.\nScott says firefighters had to \"shield themselves behind their own apparatus.\"\nLos Angeles police Sgt. Frank Preciado says the suspect is believed to be the victim's son. He says the man retreated back into the house and was in a standoff with police for about two hours.\nHe says the suspect had a self-inflicted gunshot wound when he later surrendered to police. The suspect was in critical condition.\n———\n7:35 a.m.\nPolice say a suspect who opened fire, killing one person, after a house fire in Los Angeles appears to have suffered a self-inflicted gunshot wound.\nLos Angeles police say the suspect was taken into custody after holing himself up Tuesday morning for two hours inside the burned home.\nPolice said one person had been killed but provided no additional details.\nFirefighters were first called to the home in the Harbor Gateway neighborhood before dawn and reported hearing gunshots after knocking down the flames.\nPolice and sheriff's deputies had set up a perimeter and evacuated nearby homes.\n———\n7:05 a.m.\nLos Angeles authorities say one person was fatally shot at the scene of a house fire and a suspect is in custody after holing himself up for two hours inside the burned home.\nPolice Officer Chris No confirmed one fatality in the shooting early Tuesday but didn't know whether the victim is a man or woman.\nThe Fire Department says crews heard gunshots after knocking down the flames before dawn south of downtown Los Angeles.\nThe gunman was taken into custody shortly before 7 a.m. Several homes in the Harbor Gateway neighborhood were evacuated as police set up a perimeter.\nThere are no reports of injuries to firefighters or police officers.\n———\n6:30 a.m.\nAuthorities say a suspect fired a weapon at the scene of a house fire south of downtown Los Angeles.\nThe Fire Department says crews heard gunshots after dousing the flames in the Harbor Gateway neighborhood early Tuesday.\nOfficials say the suspect then holed up inside a home. Police and sheriff's deputies have set up a perimeter and evacuated nearby homes.\nAuthorities have not confirmed if anyone is hurt.",
    "source_domain": "abcnews.go.com",
    "title": "Latest: Woman fatally shot after Los Angeles house fire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-suspect-shooting-la-house-fire-injury-54691645"
}