{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:33:04+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fbid-toughen-louisiana-anti-bestiality-law-draws-pushback-54693501.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_8ad7ec506a79429a8dc0fd44249cf2a0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In Louisiana, a proposal to strengthen the law against bestiality is facing unexpected opposition from conservative lawmakers who see it as an underhanded move to strike the state's unconstitutional ban on sodomy.\nCreating a new, wide-ranging anti-bestiality law would untangle the offense from the ban on sodomy in Louisiana's \" crime against nature \" statute, prompting some lawmakers to label the measure a sly chess move.\n\"This bill was written because the far left wants to undermine our other laws that protect family and traditional values that the people of Louisiana hold dear,\" said Sen. Ryan Gatti, a Republican who was one of 10 senators to vote against the bill.\n\"That was our concern, that it most likely will be used as a Trojan horse to delete the sodomy law,\" he said.\nNews about lawmakers voting against the measure that would expand the state's four-word bestiality law with requirements for mental evaluations and penalties for trafficking provoked confusion and mockery outside the Deep South state.\nSix states have expanded laws on bestiality crimes in the past three years, according to Leighann Lassiter, director of animal cruelty policy at the Humane Society of the United States, which is advocating for the rewritten law. Three states, including Louisiana, have similar proposals working through their legislatures.\n\"This has been the first time we've seen one hint of opposition to these bills,\" she said. \"It's quite surprising.\"\nFor Sen. J.P. Morrell, what has been frustrating is that opposition to his bill is rooted in fear that games are afoot to remove the state's unenforceable statute against \"unnatural\" sex in Louisiana.\n\"I don't know how to answer a conspiracy theory,\" he said. \"There's no evidence that the bill does that. What you hear from people is that they don't trust me because I'm a Democrat from New Orleans.\"\nAnti-sodomy laws in Louisiana and other states were invalidated in 2003 by the U.S. Supreme Court, which ruled that forbidding people of the same sex from certain sexual conduct violated the 14th Amendment. Despite that ruling, Louisiana's existing law remains on the books.\nMorrell has not been shy about his distaste for regulation on what kind of sex is allowed between consenting adults in Louisiana, but he emphasized that he's not taking aim at that rule with this proposal.\nHe said the measure would modernize an inadequate Louisiana law that doesn't account for today's technology. He even urged fellow lawmakers to vote against an amendment that sought to strike the anti-sodomy law because it would ensure his bill's failure.\nOn the Senate floor, he offered a stern warning: \"God forbid you vote against this bill — good luck explaining it.\"\nHis bill passed the Senate 25-10 and awaits debate in the House of Representatives. It's unclear how the measure will fare in the House because the leader of the Louisiana Family Forum, a Christian conservative organization with considerable sway in the chamber, has raised concerns about it.\n\"I think the provisions of his bill go way too far,\" said Gene Mills, president of the group.\nThe Humane Society's Lassiter said holes in the law haven't prevented district attorneys from prosecuting cases where people are having sex with an animal. Opponents to the Louisiana bill have said that's good reason to leave the state's law as is.\nBut the existence of online marketplaces for buying and selling animals for sex complicates matters when that act falls outside the law's boundaries, Lassiter said. Bringing animal cruelty charges is an option, though authorities often have to prove harm has been done, which isn't always clear in these cases.",
    "source_domain": "abcnews.go.com",
    "title": "Bid to toughen Louisiana anti-bestiality law draws pushback",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/bid-toughen-louisiana-anti-bestiality-law-draws-pushback-54693501"
}