{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 20:45:56+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "8 Turkish troops die in Syria operation; Russian pilot slain",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frebel-stronghold-northwestern-syria-heavily-bombed-52814668.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_fd54c6feed30495995dad28cacda6cdd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Turkey said eight of its troops were killed Saturday in Ankara's military operation against a Syrian Kurdish militia, the deadliest day in the two-week-old offensive in the enclave of Afrin, while in another part of Syria, al-Qaida-linked militants downed a Russian fighter jet, then shot and killed the pilot.\nIn a statement late Saturday, the Turkish military said five soldiers were killed after their tank in Syria came under attack near Afrin. The soldiers could not be saved despite all attempts, it said.\nEarlier in the day, three Turkish soldiers were reported killed in the Afrin offensive — one was killed in the area of the tank attack, another in northern Syria and the third on the Turkish side of the border in what Ankara said was an attack by Syrian Kurdish militiamen.\nThe total death toll for Turkish troops since the operation, codenamed Olive Branch, started on Jan. 20 now stands at 13.\nTurkey launched the incursion into Afrin to rout the U.S.-backed Syrian Kurdish militia, known as the People's Protection Units or YPG, which it considers to be a terrorist organization and an extension of Kurdish insurgents fighting within Turkey.\nFrom Istanbul, Turkish presidential spokesman, Ibrahim Kalin, said Turkey will not tolerate the presence of the YPG \"anywhere\" along its southern border, hinting that Ankara might expand the Afrin operation eastward. Turkey's first demand is to see the YPG move east of the Euphrates River and leave the town of Manbij, where American troops backing the Syrian Kurdish fighters are stationed, Kalin said.\nHe called on the United States to \"disengage\" from the YPG and said Turkey will continue communications with \"our American allies to avoid any confrontation.\"\nTurkey shares a 911-kilometer border with Syria. The YPG controls much of the territory along the border and an uninterrupted strip from Manbij to the Iraqi border.\nMeanwhile, in the embattled northwestern province of Idlib, al-Qaida-linked militants said they downed a Russian fighter jet and killed its pilot after he ejected from the plane and landed on the ground.\nThe pilot resisted being captured and fired at the militants who then shot and killed him, according to one of the militants and Syrian monitors.\nThe Russian Defense Ministry confirmed the downing of the Su-25 and said the pilot was killed in fighting with \"terrorists.\" A report on the ministry's Zvezda TV said preliminary information indicated the plane was shot by a portable ground-to-air missile in an area under control of al-Qaida's branch in Syria.\nThe Britain-based Syrian Observatory for Human Rights said the plane was downed near the rebel-held town of Saraqeb, which Syrian troops have been trying to take under the cover of Russian airstrikes.\nRussia is a key ally of President Bashar Assad, and has been waging a military campaign on behalf of his forces since 2015. Since then, Syrian troops have captured wide parts of the country and in recent weeks have been making advances in Idlib. The province is also a base for al-Qaida's branch in Syria and other Islamic groups.\nA Syrian militant in the area told The Associated Press that the Russian pilot was shot and killed when he resisted capture. The pilot opened fire from his pistol as the militants were trying to seize him, said the militant, who refused to be identified by his real name because was not authorized to speak to the media.\nA video circulating on social media shows a lifeless body of a man, his face stained with blood, as bearded gunmen stand around him. One of the armed men shouts: \"He is Russian.\" The authenticity of the video could not be independently confirmed but it corresponded to events reported by the AP.\nEarlier in the day, the Observatory and the media arm of al-Qaida-linked militants reported intense airstrikes in Idlib. The Observatory reported more than 35 airstrikes on Saraqeb since late Friday, adding that many of its residents are fleeing.\nThe Ibaa News Agency of the al-Qaida-linked Levant Liberation Committee, said Russian and Syrian warplanes and helicopter gunships have been pounding Saraqeb and the village of Tel Mardeekh in Idlib since the early hours of Saturday.\nThe agency later quoted militant commander Mahmoud al-Turkmani as saying that anti-aircraft weapons were sent to al-Qaida's fighters in the Saraqeb area after airstrikes intensified this week. He warned that Russian warplanes will not pass through Syrian airspace without \"paying a price.\"\nSyria's state news agency, SANA, said Syrian troops captured the village of Maasaran as well as the Tel Tokan hill, cutting links between Saraqeb and the rebel stronghold of Maarest al-Numan to the south.\nSyrian government forces and their allies launched a push into Idlib six weeks ago, inching closer to a key highway that connects Syria's two largest cities, Damascus and Aleppo.\nThe U.N. says more than 270,000 people have been displaced in Idlib because of the government onslaught since Dec. 15.\nAlso Saturday, Syria's Foreign Ministry has dismissed as \"null and void\" U.S. accusations that Assad's government is producing and using \"new kinds of weapons\" to deliver deadly chemicals despite committing to abolish its program in 2013.\nThe American statements are \"nothing more than lies\" based on accounts of what the Trump administration called its partners on ground, the ministry said. It also said reports by Western-backed media outlets about Damascus using chemical weapons were \"a new version of U.S. and Western desperate intentions to create\" an excuses to attack Syria.\nPresident Donald Trump has not ruled out additional military action to deter attacks or punish Assad, administration officials said earlier this week, although they did not suggest any action was imminent.\n———\nBilginsoy reported from Istanbul. Associated Press writers Jim Heintz in Moscow and Albert Aji in Damascus, Syria, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "8 Turkish troops die in Syria operation; Russian pilot slain",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/rebel-stronghold-northwestern-syria-heavily-bombed-52814668"
}