{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 08:45:37+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Greek Cypriots to vote in runoff in hopes of peace deal",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fgreek-cypriots-vote-runoff-hopes-peace-deal-52813586.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_3e93782ff896490d8195ac9dd5d4e585_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Greek Cypriots are gearing up for a presidential runoff on Sunday, barely seven months after the latest failure to reunify the eastern Mediterranean island nation of Cyprus.\nPresident Nicos Anastasiades is looking to reprise his triumph over left-leaning Stavros Malas in 2013 when the two men faced each other. Earlier polls had shown Anastasiades beating Malas convincingly in Sunday's runoff, but Malas' strong showing in last weekend's first round of voting might make it a closer race.\nVoters are skeptical about whether anyone can lead them out of the labyrinth of the decades-old division with Turkish Cypriots.\nCyprus was divided into a Greek-speaking south and a Turkish-speaking north in 1974 when Turkey invaded following a coup by supporters of union with Greece. Only Turkey recognizes a Turkish Cypriot declaration of independence and keeps more than 35,000 troops in the north.\nAnastasiades, 71, who says it will be his last term in office if re-elected, is counting on his track record of turning the economy around after a 2013 financial crisis that saw unemployment soar and salaries slashed. He has also been trumpeting his role in steering peace talks with breakaway Turkish Cypriots farther than anyone else since the 1974 split.\nBy contrast, the 50-year-old Malas is hoping his relative youth will strike a chord with the 550,000 eligible voters, many of whom are disillusioned by the acrimonious breakdown of the latest round of peace talks and years of economic uncertainty that's shaken the confidence of the middle class.\nAnastasiades and Malas secured 35.5 and 35.2 percent of the vote, respectively, in the first round, setting up potentially a tighter than anticipated final vote.\nBoth were busy trying to reach out to the supporters of candidates that have been eliminated, notably those of the center-right Nicholas Papadopoulos, son of late former President Tassos Papadopoulos, who came in third with more than 100,000 votes — or 25.7 percent of the vote.\nNicholas Papadopoulos backs a tougher approach to the peace talks, arguing that both final candidates have been willing to make too many concessions to Turkish Cypriots. Papadopoulos and the coalition that backed him have decided not to endorse either candidate in the runoff.\nConscious of Papadopoulos' sizeable voter support, Anastasiades and Malas have sought to ease concerns about how far they're willing to go in peace talks. Both insisted that they wouldn't agree to a Turkish demand to incorporate military intervention rights and a permanent troop presence into any peace deal.\nTurkey's intentions on Cyprus lie at the root of Greek Cypriot fears, and political leaders broadly agree on the need to lift Ankara's hand from a reunified Cyprus. Anastasiades has repeatedly said that Turkey wants to turn the island into its \"protectorate.\"\nA recent opinion poll found that nearly 90 percent of Greek Cypriots don't believe there will be an agreement any time soon.\nAiming to keep hopes for peace alive, both candidates said among their first acts in office if elected would be to approach Turkish Cypriot leader Mustafa Akinci in hopes of reviving negotiations.\nMost voters who supported Papadopoulos will cast their ballots for who they consider the least worse candidate, political analyst Giorgos Kentas said.\nWith both Anastasiades and Malas perceived to be on the same page regarding peace talks, voter preference may boil down to which candidate voters trust most to deliver the most benefits from an economy on the mend.\nAnastasiades says a Malas presidency will bring in a period of overspending that will hobble the economy once again.\nMalas argues that Anastasiades has little credibility — the incumbent backtracked in 2013 and accepted a rescue package from creditors that forced the seizure of savings over 100,000 euros in Cyprus' two largest banks.\nHe also says Anastasiades' fiscal policies are geared toward the wealthy rather than ordinary households that aren't reaping the benefits of an economy growing at around 4 percent, one of the highest in Europe.",
    "source_domain": "abcnews.go.com",
    "title": "Greek Cypriots to vote in runoff in hopes of peace deal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/greek-cypriots-vote-runoff-hopes-peace-deal-52813586"
}