{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:05:36+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Michael Riordan said he's concentrating on his children.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fhusband-woman-killed-southwest-flight-shares-news-54706165.json",
    "image_url": "https://s.abcnews.com/images/WNT/180424_wn_raddatz7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Husband of woman killed on Southwest flight shares how he got the news\nWe have been reporting here on the wife and mother, the passenger on that southwest flight who was sucked out of the plane and pulled back in. She did not survive it. Tonight, her husband, who spoke so beautifully about his wife, now talking to ABC's Martha Raddatz. Reporter: Jennifer Riordan was killed on flight 1380, when the plane's left engine exploded at 32,000 feet. The mother of two, the first person to die in an accident on a U.S. Airline in nearly ten years. Tonight, for the first time, her husband, Michael, telling us how he got the news. The chaplain at the hospital called. He's like, \"I need to have the doctor talk to you.\" And then before the doctor could call, I was able to click on a news site. And I saw one passenger was brought to the hospital, I'm like, she can't be injured that bad, she's just in the hospital. But I can get out there and I can hold her hand and love on her. And then two minutes later, I got a call from the doctor who said, \"We're sorry, we tried everything we could, but she couldn't make it.\" Reporter: Despite wearing her seatbelt, Riordan was partially sucked out of this window. Passengers pulling her back inside. I immediately thought of the kids, and how do you tell your kids their mom was gone? I just held their little hands and took a knee and I said, \"Mommy's not going to come home, guys.\" Reporter: On Sunday, hundreds in Albuquerque turned out to mourn the 43-year-old wife, mother and bank executive. And David, Michael Riordan has avoided listening to news reports about the incident and southwest's response. For now, he is concentrating only on his children. David? Which is so understandable. Martha, thank you. And when we come back here\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Husband of woman killed on Southwest flight shares how he got the news",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/husband-woman-killed-southwest-flight-shares-news-54706165"
}