{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2017-06-14 20:55:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "The suspected shooter was shot and has since died.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdramatic-video-captures-sounds-gunfire-congressional-baseball-practice%2Fstory%3Fid%3D48040349.json",
    "image_url": "http://a.abcnews.com/images/US/170614_abc_social_shooting_video_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Video captured the moment gunfire rang out at an Alexandria, Virginia, baseball field this morning, injuring Rep. Steve Scalise, R-Louisiana, the House majority whip, and four others.\nOver dozens of gunshots can be heard in the video, as well as people yelling.\nThe gunfire at Eugene Simpson Stadium Park broke out around 7 a.m. this morning when the suspect, identified by police as 66-year-old James Hodgkinson of Belleville, Illinois, opened fire as lawmakers were practicing for the annual charity congressional baseball game set for Thursday. Only Republicans were at this practice; Democrats practiced earlier in the morning.\nScalise, a lobbyist, a congressional staffer and two Capitol Police officers were injured.\nOfficers returned fire at Hodgkinson and the suspect died from his injuries.\nHospital officials said this afternoon that Scalise was in critical condition. Scalise's office said he was shot in the hip and underwent surgery.\n\"Prior to entering surgery, the Whip was in good spirits and spoke to his wife by phone,\" his office said in a statement. \"He is grateful for the brave actions of U.S. Capitol Police, first responders, and colleagues. We ask that you keep the Whip and others harmed in this incident in your thoughts and prayers.\"\nMatt Mika, who works as a lobbyist for Tyson Foods, was also injured and is in critical condition and was undergoing surgery, his family said in a statement.\nZachary Barth, a legislative correspondent working for Texas Rep. Roger Williams, was among those shot as well, according to a statement from Williams. Barth has since been released from the hospital, the family spokesperson said. He is expected to make a full recovery, Williams said.\nThe two injured Capitol Police officers are David Bailey and Crystal Griner, according to House Speaker Paul Ryan. U.S. Capitol Police Chief Matthew R. Verderosa said Griner was shot in the ankle and is in good condition, while Bailey was treated for a minor injury and released.",
    "source_domain": "abcnews.go.com",
    "title": "Dramatic video captures sounds of gunfire at congressional baseball practice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/dramatic-video-captures-sounds-gunfire-congressional-baseball-practice/story?id=48040349"
}