{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 09:47:39+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Flatest-merkel-eu-seeks-avoid-trade-war-us-56358759.json",
    "image_url": "https://abcnews.go.com/Business/wireStory/latest-merkel-eu-seeks-avoid-trade-war-us-56358759",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the trade dispute between China and the U.S. and plans for both sides to impose tariffs on each other's exports (all times local):\n4:15 a.m.\nGerman Chancellor Angela Merkel says the European Union will make every effort to avoid a trade war with the United States, but Washington needs to join in that effort.\nPresident Donald Trump's administration has imposed tariffs on EU steel and aluminum imports and is mulling whether to add tariffs on cars, trucks and auto parts.\nMerkel told the German parliament Wednesday: \"It is worth every effort to try to defuse this conflict so that it doesn't turn into a real war, but of course there are two sides to that.\" She added that the good functioning of the world economy depends on countries working together as partners.\n———\n11:00 p.m.\nU.S. authorities are allowing China's ZTE Corp. to resume some business with American companies, temporarily easing part of a ban imposed over the tech giant's exports to Iran and North Korea.\nThe Commerce Department's order this week follows a settlement under which ZTE agreed to pay a $1 billion fine, replace its executive team and hire U.S. compliance officers.\nThe order said ZTE will be allowed to conduct business with American companies to maintain existing telecom networks and mobile phones and to support security features. The suspension lasts through Aug. 1.\nZTE suspended most operations after it was banned in April from buying U.S. components and technology. The company had been paying American suppliers an estimated $1.8 billion annually.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Merkel says EU seeks to avoid trade war with US",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/latest-merkel-eu-seeks-avoid-trade-war-us-56358759"
}