{
    "authors": [
        "Abc News",
        "More Luis"
    ],
    "date_download": "2017-06-14 22:26:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Iranian ship targets laser at U.S. military helicopter in Strait of Hormuz",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Firanian-ship-targets-laser-us-military-helicopter-strait%2Fstory%3Fid%3D48043651.json",
    "image_url": "http://abcnews.go.com/International/iranian-ship-targets-laser-us-military-helicopter-strait/story?id=48043651",
    "language": "en",
    "localpath": null,
    "maintext": "An Iranian Navy vessel trained a laser at a U.S. military helicopter as it accompanied three U.S. Navy ships moving through the Strait of Hormuz early Wednesday morning, in an incident the U.S. Navy has characterized as \"unsafe and unprofessional.\"\n\"Three U.S. Naval ships and a U.S. Marine Corps helicopter had an unsafe and unprofessional interaction with an Iranian Navy vessel while transiting the international waters of the Strait of Hormuz, June 13,\" said Commander William Urban, a spokesman for the U.S. Navy's Fifth Fleet.\nThe Strait of Hormuz is the vital narrow body of water that separates the Persian Gulf and the Gulf of Oman.\n\"The amphibious assault ship USS Bataan (LHD 5), guided-missile destroyer USS Cole (DDG 67) and dry cargo ship USNS Washington Chambers (T-AKE-11) were transiting the strait when the Iranian vessel paralleled the U.S. formation, shining a spotlight on Cole,\" said Urban.\n\"Shortly thereafter, the Iranian vessel trained a laser on a CH-53E helicopter that accompanied the formation,\" said Urban. \"The Iranian vessel then proceeded to turn its spotlight on Bataan, scanning the ship from bow to stern and stern to bow before heading outbound from the formation.\"\nThe closest the Iranian vessel got to the American ships was 800 yards.\nUrban explained that \"illuminating helicopters with lasers at night is dangerous, as it creates a navigational hazard that can impair vision and can be disorienting to pilots using night vision goggles.\"\nThe laser targeting led the Marine helicopter to automatically discharge flares as a defensive measure said a U.S. official.\nU.S. Navy vessels routinely have encounters with small Iranian craft as they transit through the Strait of Hormuz.",
    "source_domain": "abcnews.go.com",
    "title": "Iranian ship targets laser at U.S. military helicopter in Strait of Hormuz",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/iranian-ship-targets-laser-us-military-helicopter-strait/story?id=48043651"
}