{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:10+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Dr. Jen Ashton, ABC News' chief medical correspondent, and Navy SEAL and former Deputy of U.S. Central Command Admiral Robert Harward discuss the rescue.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Fexperts-weigh-options-risk-rescue-trapped-soccer-team-56359926.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_howard1_0707_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Experts weigh options, risk to rescue trapped soccer team from Thai cave\nbetween the parents and cren when it happens. James Longman, thank. A lot T talk about so let's bring Jen ashto and our contributor admiral Robert Harward. Thank you for being here. Jen, let me stt with you. What are you worried about T most now? Well, really the sics.you want to knowhat their oxygen supply is, hydrat temperature control. Their psychological state. Theirtal and emotional S and their nutritional state. They're breaking down aot of muscle even though the incredibly sedentary so we always want get anessment of their current situat hope for the best but prepare for the worst. Et's bring you in. A myriad of differentescue ops. Do honestly feel scuba diving is the bestay out? No, not necessarily at Thi point. There may other means. As you know a, you have T carry a lot of equipment. They may be able to get J like thehone Lin surface suppliedir so air with ae so they don't have toear aot of gear and they C swim out that way S I'm sure they're pursuill those options to ensuhat theses come out safe. And tact that we're feeding them, gettingerial to them, TV cameras to them are indive of the good conditionthey're in at the Mo. Jen, I was surprised to learn although entirely even how cool you are that you are actually aim being a phician a certified rescue and fight scuba diver. This was a six-hour journey for these elite divers so it' going to take a long time for the boys to learn. GHT, but we also have T remember and I did it, of course, recreatially, the admi of coursehey do this for the real deal and you can take, train and teach someo to scuba dive with very minim kind of equipment buthis is a very unpredictable and chaotic tuation and their mental state is very, so important but, ain, all they need is that air supply. They don't even necessarily need to B anything with them so that's going T be song that the team is therend the ue professls like the admiral will work on but after being olonged in a cave light deprivation, the psychical and emotional effect these are young kids and think of them more as a mom than a doc and diver and that will beeally important. A lot of facto going I this but right now at least I sounds like stable situation. R quick, they have a harrowing journey. Are you optimistic? Of course. There are going be people with them eve step of they. They're going to have swim buddy.somebody W be accompanying anking sure they're safe the whole way out. T's reassuring you to say thatmiralobt Harward and Dr. Jen Ashton, thank you both.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Experts weigh options, risk to rescue trapped soccer team from Thai cave",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/experts-weigh-options-risk-rescue-trapped-soccer-team-56359926"
}