{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 16:17:45+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "\"The Flash\" actor opens up about his breakout role as Wally West and what to expect in season 4.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fvideo%2Fkeiynan-lonsdale-talks-season-flash-49207254.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/170614_gostream_flashmusic_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Keiynan Lonsdale talks new season of 'The Flash'\nI am Mike Rothman and here with the very talented singer actor dance there. He's going on human yeah. That's all right cool guy -- in Lawndale from the flash and you also have some new music coming out and talk about a second. Definitely at last first just because it's like my being and so happier here in the I'll take you fragility seriously. Get flash. Pretty awesome. And we talk about spoilers a second ago you guys had two months not gonna like hold back on the field area. There is gone so next season is at least that for a few episodes is a big step up for Wally. Yet that it's. It's a huge step up for the team in general like we. Really have to have to come together. In order to sort of fill that space. And you know we figured but without lead that we each have to become the leader together. Which actually brings people really close. But also it has its death falls to we're not quite used to being in positions. And working in that way we can tell us that it can be kind of funny to. Food mistakes. Overrule its which is doing what we can. He started filming it that's only two months out of a look at okay see you you know single secrets now that he let's try to try to get some Canadiens but definitely tough. B eight I watched and interviews you did and there's there's so great and you cities to watch it before you joined on later on as the use and now. You're essentially that in the books to this is that a lot of those Orleans will near the books as well you'd flash starting offseason for mean it. It's not us that's on secret they said at the and unity they stepped up that we deal with last year. What's that like the Viet. Last year I mean he's still in still kid flash. And I think I think you know full well he still has hope that buyers going to be back think. At any point in his mind Wiki. He tried you wanted to replace him I think because that would then mounted he'd have to accept that he was gone I don't think but he wants to accept that he's gone. Because that would suck. Yet it is also something that is is still a reality like you know it's he is the only flash this. He does so have to step. In terms of since of that. The Edison way of socialism that resources. And that's the last thing off had a Pratt Susan for a BVL teed up freeing go whatever you want look we expect he was a little bit of like. And file. It's. You know I say it feels more electric comic book come to life this season Oca. You know I think we we. We went in it was quite dock us season. Was really cool. But I think it's nice to have this up and down movements and because it cuts that. It's that made away for this sort of like lightness. To come through anything because this list of the station. That there is so much losses like so it's hot chip it's like. You get to a point where you have to have this like positive outlook and just make it work and I think that that's where. For a lot of it you know in as realistic as you can be that's where rat. Over the last secrets because that they can just put the little legal entity known can be truthful with their friends and yeah show last season self with is there's going to be some more honestly yeah coming up in sort of violence. The I think that's that's the truth and if the right way and others. And. What I'll let you also as of go to your social media you are so cool and the show is to look at their fans and you interact to your fans and I love that about. This genre and certain shows and and movies and genre love when it when people like in Iraq and their fans the fans would love this kind of stuff. What's it like feet also to go into this character and put with the modern stamp like Mike following what's it's like I'm Michael B Jordan with the testing for. Really making like a classic character more modern more realistic we have today. And obviously getting the support from your finance. Well a lot of it is in the writing. You know also had watched the show already so it felt I sort of I could understand the world and it's very passionate about it. Think it so yell and I kind of by a came through like. Read up on. The few the comics and and also seemed like can flash in the young justice the cut in and whatnot and so I really just. I had to go off the writing off of the history of that and my and instincts in. It it here he felt moments if that wasn't really too much but tops. This is bringing and life. Differently. Now salute but the fan the fan the Ares to stand it very. They can be very the do you see someone you're saying loudly. Knew it. And you thought they can't comment link while that's so cool idea when us went to Chris the season like my net user access to this like my and that he. He gets the hole in. Really hit us like it's an interesting lessons bigger. A monologue got silently at their debt actually he had not spoken to him about it like that it wouldn't like. I'm sure it next though it took to be you know it's how old is. He's pointing. At other that case the Thompson's not now that he got away you the show. Think that when your so far do you think of all the possibilities. You know and also some of these kids it is geniuses and I think it's really cool that they can. They can they get evidence that they circle photos they get screens and mean it's that the power of the Internet and we also I think like. The creative at team really that you leave. Easter eggs in the kidnappings and leading up something so. Yeah if you on the lookout in Austin. The hike it.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Keiynan Lonsdale talks new season of 'The Flash'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/video/keiynan-lonsdale-talks-season-flash-49207254"
}