{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:55:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Sources: Mark Gottfried likely out at NC State barring late surge",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsources-mark-gottfried-nc-state-barring-late-surge%2Fstory%3Fid%3D45501097.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0214/dm_170214_mma_okamoto_mayweather_mcgregor/dm_170214_mma_okamoto_mayweather_mcgregor_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "NC State coach Mark Gottfried's tenure in Raleigh is likely coming to an end following the season, unless the Wolfpack go on a run over the next few weeks and in the ACC tournament, sources told ESPN.\n\"He could be gone this week if they get pounded by North Carolina tomorrow night,\" one source close to the situation told ESPN on Tuesday night.\nGottfried, 53, was hired by athletic director Debbie Yow in 2011 -- and proceeded to go to the NCAA tournament in each of his first four seasons, including a pair of Sweet 16 appearances.\nHowever, the Wolfpack were 16-17 last season and are 14-12 and 3-10 in ACC play this season, with a likely high lottery pick on the roster in Dennis Smith Jr.\nYow, according to several sources, has been unhappy with the lack of effort with the current team.\n\"They have more than enough talent to get to the NCAA tourney,\" one ACC coach told ESPN. \"They just don't play hard at all.\"\nNC State spokesman Fred Demarest told ESPN that Gottfried remains the coach, and that the focus of the team is on North Carolina. He also denied that the school has reached out to other candidates, as several reports have indicated.\nIf NC State does make a coaching move, it's likely that Dayton coach and NC State alum Archie Miller would be high atop the list, although sources told ESPN that Miller is unlikely to take the job.",
    "source_domain": "abcnews.go.com",
    "title": "Sources: Mark Gottfried likely out at NC State barring late surge",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/sources-mark-gottfried-nc-state-barring-late-surge/story?id=45501097"
}