{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:28:51+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fexxon-aims-boost-production-climate-rules-55540812.json",
    "image_url": "https://abcnews.go.com/Business/wireStory/exxon-aims-boost-production-climate-rules-55540812",
    "language": "en",
    "localpath": null,
    "maintext": "Exxon's CEO says the company can more than double its earnings by 2025 and will invest in new oil and gas production even if policymakers adopt rules to combat climate change.\nDarren Woods told shareholders Wednesday that technology like biofuels will allow the company to produce energy with lower carbon emissions.\nEnvironmentalists say Woods is offering political spin instead of solutions.\nThe oil giant's annual meeting in a symphony hall was a tame affair, lacking the usual number of protesters. For the first time in years, there were no environmental resolutions from activist shareholders and no fiery speeches during the open-comment period.\nWoods, like his predecessor and former Secretary of State Rex Tillerson, said the world will need oil and gas for decades. Exxon, Woods said, is responding to that demand while investing in technology such as carbon capture and biofuels to reduce heat-trapping carbon emissions. Last week, the company promised to cut its own emissions of methane, a powerful greenhouse gas, by 15 percent by 2020 largely by reducing leakage from natural gas wells.\n\"We see our role as helping close the gap between what people want and what can be responsibly done,\" Woods said.\nEnvironmentalists counter that Exxon's technology investments, some in partnership with leading universities, will not produce enough reductions to avoid the worst effects of climate change, including more bouts of severe weather.\nKathy Mulvey, a climate activist at the Union of Concerned Scientists, called Woods' comments \"all PR\" — public relations. She said Exxon's investments in alternative fuels and other technological breakthroughs are a pittance compared with its spending on finding more oil and gas.\n\"It's clear the company is banking on increased fossil-fuel production, despite being well aware of the climate risks,\" she said.\nThe Irving, Texas-based company earned $19.7 billion last year, as rising oil prices reversed a slide in profit. Yet the shares fell 7 percent last year and are down so far in 2018. Woods said the stock will rise as earnings improve.\nEarlier this year, one of Exxon's most prominent critics, New York Attorney General Eric Schneiderman, was forced from office by charges that he physically abused several women. Schneiderman, a Democrat, was investigating whether Exxon misled the public and investors by hiding what it knew about the link between climate change and burning oil and gas.\nSchneiderman's interim replacement, Barbara Underwood, is continuing the investigation, an aide said. Voters will pick the next attorney general in November in a state where registered Democrats outnumber Republicans about 2-to-1.\nExxon tried unsuccessfully to kill the investigation in the courts. Woods said he is confident Exxon will prevail, but he has not spoken to the interim AG about the case.\n\"There's going to be a new election,\" he told reporters. \"Let's see what that election brings.\"\n———\nDavid Klepper in Albany, New York, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Exxon aims to boost production even with any climate rules",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/exxon-aims-boost-production-climate-rules-55540812"
}