{
    "authors": [
        "Abc News",
        "Jeffrey Cook",
        "More Bill",
        "More Jeffrey"
    ],
    "date_download": "2018-03-19 19:46:22+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "A self-driving Uber car hit and killed a pedestrian Sunday night in Tempe, Arizona, police said, in what appears to be the first case of its kind.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fwoman-killed-driving-uber-car-identified-company-suspends%2Fstory%3Fid%3D53853861.json",
    "image_url": "https://s.abcnews.com/images/Technology/uber-bicycle-crash-01-abc-jc-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A self-driving Uber car hit and killed a pedestrian Sunday night in Tempe, Arizona, police said, in what appears to be the first case of a pedestrian death caused by an autonomous vehicle.\nInterested in Uber? Add Uber as an interest to stay up to date on the latest Uber news, video, and analysis from ABC News. Add Interest\nThe vehicle was in \"autonomous mode at the time of the collision, with a vehicle operator behind the wheel,\" Tempe police said in a statement.\nABC15 Arizona\nThe female pedestrian, identified as 49-year-old Elaine Herzberg, was walking her bicycle across the street outside the crosswalk when she was struck, police said, adding that an investigation is ongoing.\nShe died of her injuries at a hospital.\nNatalie Behring/Reuters, FILE\nThere were no passengers in the Uber vehicle.\nIn a statement to ABC News, Uber said, \"Our hearts go out to the victim’s family. We are fully cooperating with local authorities in their investigation of this incident.\"\nIn the wake of the crash, Uber has suspended its self-driving operations in San Francisco, Pittsburgh, Phoenix and Toronto, the ridesharing service said.\nEditor's note: An earlier version of this story misidentified the women. She was walking her bike across the street when hit, police said.",
    "source_domain": "abcnews.go.com",
    "title": "Woman killed by self-driving Uber car identified, as company suspends testing",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/woman-killed-driving-uber-car-identified-company-suspends/story?id=53853861"
}