{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 19:47:57+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjudge-20-million-bond-wife-slain-nba-player-55538408.json",
    "image_url": "https://abcnews.go.com/Sports/wireStory/judge-20-million-bond-wife-slain-nba-player-55538408",
    "language": "en",
    "localpath": null,
    "maintext": "A Tennessee judge issued a $20 million bond Wednesday for the ex-wife of former NBA player Lorenzen Wright in his shooting death nearly eight years ago.\nShelby County Criminal Court Judge Lee Coffee said his decision to give Sherra Wright such a high bond was partly driven by her bad behavior while being held at a women's jail on murder and attempted murder charges in her ex-husband's slaying.\nLorenzen Wright played for 13 seasons as a forward and center in the NBA, including several for the Grizzlies in Memphis, where he was born and raised.\nHis decomposing, bullet-riddled body was found in a swampy field in suburban Memphis on July 28, 2010 — 10 days after the 34-year-old was reported missing. In an affidavit read in court by prosecutor Paul Hagerman, witnesses said she masterminded a plan to have two men kill Lorenzen Wright at his home in Atlanta, but that attempt failed.\nAuthorities said she and Billy Turner then conspired to kill him in Memphis, and they dumped one of the guns used in the shooting in a Mississippi lake. One witness cited in the affidavit said Sherra Wright identified the spot where her ex-husband's body would be found, days before it was discovered.\nTurner also has been charged with murder and attempted murder. He is being held on $15 million bond. Both have pleaded not guilty.\nSherra Wright received $1 million from her ex-husband's life insurance policy. She was arrested in December in California, where she had lived for three years after moving away from Memphis.\nHer lawyer Blake Ballin argued the 47-year-old is indigent, has no serious crimes on her record and has strong ties to the community in asking for a $100,000 bond. Ballin said Wright would live with her brother in Shelby County if she were to be released on bond.\n\"Mrs. Wright has no criminal history of a violent nature,\" Ballin said.\nCoffee noted her family connections but gave more weight to her repeated instances of unruly behavior in jail. Hagerman cited six instances where she was written up by jail guards, including three the day before her bond hearing.\nOn Tuesday, Wright was caught passing items to another inmate, Hagerman said. Later, she allegedly took off her clothes, flooded her jail cell and verbally insulted and threatened jail guards with language Coffee called abusive and offensive.\nWhile flooding her cell, Wright said she was \"going swimming,\" an indication of her troubled mental state, Coffee said. The judge called Wright's actions the day before her bond hearing \"absolutely shocking and mind numbing\" and said she presents a danger to the community.\n\"I cannot trust her,\" Coffee said.\nWright shook her head repeatedly during Coffee's lecture, during which he also said there is a \"reasonable likelihood of conviction\" in the case.\nAs she was leaving the courtroom with court officers, Wright addressed the judge.\n\"Thank you, your honor,\" she said.\nWright faces up to life in prison plus 50 years if convicted on charges of first-degree murder, conspiracy to commit first-degree murder and attempted first-degree murder.",
    "source_domain": "abcnews.go.com",
    "title": "Judge: $20 million bond for ex-wife of slain NBA player",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/wireStory/judge-20-million-bond-wife-slain-nba-player-55538408"
}