{
    "authors": [
        "Abc News",
        "Conor Finnegan",
        "More Elizabeth",
        "More Conor"
    ],
    "date_download": "2017-10-06 22:45:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Top officials recommend staying in the deal, but leave Trump room to decertify.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Ftrumps-top-officials-iran-deal%2Fstory%3Fid%3D50332183.json",
    "image_url": "http://a.abcnews.com/images/Politics/donald-trump-james-mattis-gty-jc-171006_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump is expected to \"decertify\" Iran's compliance with the Iran nuclear agreement next week because his administration has determined it no longer serves America's national security interests, sources have told ABC News.\nTrump has until Oct. 15 to make a decision about Iran's compliance in the 2015 agreement, which he has repeatedly called one of the \"worst deals\" for the United States. He last recertified Iran's compliance in July.\nIf Trump chooses decertification, Congress must decide within 60 days whether or not to reimpose nuclear sanctions against Iran, which would constitute a material breach and could effectively destroy the agreement.\nThe president's own top military officials and diplomats have said Iran is in technical compliance with the Iran deal. But, in recent months, they've also played a balancing game: seeming to recommend the U.S. stay in the deal, while at the same time giving the president room to say it isn't in America's national security interests.\nHere's what three top officials have been saying about the Iran deal.\nSecretary of Defense James Mattis\nTwelve days before the Oct. 15 deadline, Mattis told the Senate Armed Services Committee that it was in America's national security interest to remain part of the agreement.\nHe went on to say that \"If we can confirm that Iran is living by the agreement, if we can determine that this is in our best interest, then clearly, we should stay with it. I believe, at this point in time, absent indications to the contrary, it is something the president should consider staying with.\"\nBut Mattis immediately couched that response, adding, \"There is another requirement we certify that it's in our best interest.”\nThe certification process is not part of the agreement, but a requirement of U.S. law, which says the president must determine every 90 days if Iran is complying and if the deal is in U.S. national security interests.\nThe Trump administration will reportedly use that second factor as grounds for decertification, given Iran’s destabilizing activity in the Middle East -- something Mattis has often raised.\n“The president has to consider, more broadly, things that rightly fall under his portfolio of looking out for the American people in areas that go beyond the specific letters of the JCPOA,\" he said, referring to the Iran deal's formal name, the Joint Comprehensive Plan of Action. \"In that regard, I support the rigorous review that he has got going on right now.\"\nChairman of the Joint Chiefs of Staff Gen. Joseph Dunford\n\"Iran is not in material breach of the agreement, and I do believe the agreement to date has delayed the development of a nuclear capability by Iran,\" Dunford told the Senate Armed Services Committee on Tuesday.\nCritics of the administration jumped on those remarks -- from Trump’s top military adviser, no less -- to bolster their claim that without the deal, Iran will be closer to a nuclear bomb.\nDunford also warned in his reconfirmation hearing before Congress last week that \"holding up agreements that we have signed, unless there's a material breach, would have an impact on others' willingness to sign agreements.\"\nLike Mattis, he said that because Iran is in compliance with the deal, the U.S. \"should focus on addressing the other challenges: the missile threat they pose, the maritime threat they pose, the support of proxies, terrorists, and the cyberthreat they pose.\"\nSecretary of State Rex Tillerson\nTillerson acknowledged in early August that he and the president have had differences of opinion on the Iran deal, with Tillerson urging certification and Trump seeking ways to decertify. But more recent statements show the secretary trying to align with his commander in chief, at least publicly.\nAt the United Nations General Assembly in late September, Tillerson said Trump was \"very carefully considering\" whether the administration finds the Iran deal \"to continue to serve the security interests of the American people or not.\"\nIn particular, Tillerson has raised the issue of the deal’s so-called “sunset provisions” where limits on Iran’s nuclear program expire.\n\"One can almost set the countdown clock to when Iran can resume its nuclear weapons programs, its nuclear activities,\" Tillerson said. \"And that’s something that the president simply finds unacceptable.\"\nBut citing a flaw that Trump can criticize the deal for doesn’t mean Tillerson favors tearing up the accord. Instead, he too has urged dealing with Iran’s other activities in addition to these shortcomings.\nThe agreement \"represents only a small part of the many issues that we need to deal with when it comes to the Iran relationship,\" he told reporters Wednesday.",
    "source_domain": "abcnews.go.com",
    "title": "What Trump's top officials have said about the Iran deal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/trumps-top-officials-iran-deal/story?id=50332183"
}