{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 16:55:45+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Fsimona-halep-drops-set-rallies-win-round-match%2Fstory%3Fid%3D55533388.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "PARIS -- Top-ranked Simona Halep overcame some opening-match nerves to advance to the second round of the French Open on Wednesday, beating 83rd-ranked Alison Riske of the United States 2-6, 6-1, 6-1.\nHalep took a bathroom break after Riske jumped out to a 5-0 lead and won the opening set, and looked like a new player when she came back on court. The Romanian unwrapped a new racket and attacked Riske's serve with renewed vigor and aggression, breaking her to love in the second set's first game.\nAfter making 16 unforced errors and winning less than half the points on her serve in the first set, Halep completely reversed the momentum of the match, rediscovering her range and accuracy on the clay of Court Philippe-Chatrier.\nRiske, meanwhile, wilted and won only 22 points in losing the second and third sets.\n\"It's always tough to start the tournament,\" said Halep, a finalist at Roland Garros last year and in 2014.\nThe match, the last in the first round of the women's draw, was postponed Tuesday before storms drenched Roland Garros.\nHalep's next opponent, 72nd-ranked Taylor Townsend of the United States, played her first-round match on Tuesday.\n\"I'll be ready,\" Halep said. \"We just have to adapt.\"\nHalep needs to reach the semifinals or better this year to have a chance of holding onto her No. 1 ranking after the French Open.",
    "source_domain": "abcnews.go.com",
    "title": "SImona Halep drops first set, rallies to win first-round match",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/simona-halep-drops-set-rallies-win-round-match/story?id=55533388"
}