{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:17:21+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Feds: At least 6 tornadoes cause damage southwest of Houston",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ffeds-tornadoes-damage-southwest-houston-45497837.json",
    "image_url": "http://abcnews.go.com/US/wireStory/feds-tornadoes-damage-southwest-houston-45497837",
    "language": "en",
    "localpath": null,
    "maintext": "Residents of a coastal area southwest of Houston are cleaning up debris after severe storms, including at least six tornadoes, swept through the area Tuesday.\nAt least six people were injured in Van Vleck, about 70 miles southwest of Houston, by a weak tornado rated by a federal survey team as an EF1, with winds of 86 to 110 mph.\nA preliminary review of the damage in Van Vleck indicates up to four homes were destroyed and several others damaged, said Doug Matthes, emergency management coordinator for Matagorda County. Seven people were transported by ambulance for medical care and it's not clear how many more may have been taken to hospitals by private vehicle, he said. The seven people taken by ambulance didn't appear to have serious injuries, he said.\nOne of those injured in Van Vleck, a town of about 1,800 residents, was Harry Hobbs.\n\"I was going into the room and the center blew off, then I got popped upside the head\" by debris, Hobbs told KTRK-TV of Houston. \"I looked back and said, 'I can't take another one of them,' so I went to block it and that's how I hurt my hand.\"\nSaid Sally Farley, Hobbs' girlfriend, \"We have nothing. We might be able to salvage some clothes and stuff out of the house, but everything's gone. I just keep telling myself that at least everybody's OK.\"\nThe path of the tornado was close to a junior high school where students sheltered in place, Matthes said. Crews were working Tuesday afternoon and evening to restore power and the Red Cross was offering assistance.\n\"It's a rural community so these folks take care of themselves,\" he said.\nAn EF2 tornado with winds of 111 to 135 mph caused extensive damage to subdivisions 27 miles southwest of Houston. A weak tornado also was confirmed in Wharton, about 55 miles southwest of Houston.\nThe weather service had issued tornado warnings for dozens of counties extending from the San Antonio area to Southeast Texas.\nElsewhere, more than 3 inches of rain fell in some areas west of Austin, and rain was mixing with snow in the Texas Panhandle, resulting in slick roads and delays in school openings.",
    "source_domain": "abcnews.go.com",
    "title": "Feds: At least 6 tornadoes cause damage southwest of Houston",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/feds-tornadoes-damage-southwest-houston-45497837"
}