{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 21:51:49+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Skier Jean Vuarnet, Who Struck Gold With Tuck Position, Dies",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fskier-jean-vuarnet-struck-gold-tuck-position-dies-44515959.json",
    "image_url": "http://abcnews.go.com/International/wireStory/skier-jean-vuarnet-struck-gold-tuck-position-dies-44515959",
    "language": "en",
    "localpath": null,
    "maintext": "Olympic skiing champion Jean Vuarnet, who helped pioneer the aerodynamic tuck position for downhill racers but suffered tragedy with the deaths of his wife and son in a doomsday cult murder-suicide, has died, the French Olympic Committee announced Monday. He was 83.\nVuarnet died of a stroke, a statement by the committee said.\nThe Frenchman won Olympic gold in the downhill at the 1960 winter games in Squaw Valley, California. Rejecting wooden skis, he was the first skier to win an Olympic gold on metal skis.\nHe was also the only competitor in that race to use the speedier low tuck position, squatting down with knees bent.\nVuarnet later lent his name to a successful brand of eyewear and was involved in the development of the Avoriaz ski resort in the French Alps.\nBorn in the Tunisian capital of Tunis on Jan. 18, 1933, Vuarnet grew up in the Alpine Morzine region of France\nIn 1995, Vuarnet's wife, Edith, and their youngest son, Patrick, were among 16 people who died in a murder-suicide involving the Order of the Solar Temple doomsday group.\nFrench police discovered the charred remains of 14 victims — arranged in a star formation — in a forest clearing near the Alpine city of Grenoble. Two other bodies were found nearby.\nInvestigators said police officer Jean-Pierre Lardanchet and Swiss architect Andre Friedli fatally shot the others, doused the bodies with gasoline and set them afire before killing themselves. Autopsies showed that most had taken sleep-inducing drugs.",
    "source_domain": "abcnews.go.com",
    "title": "Skier Jean Vuarnet, Who Struck Gold With Tuck Position, Dies",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/skier-jean-vuarnet-struck-gold-tuck-position-dies-44515959"
}