{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:12+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fwatchdog-blasts-denver-sheriffs-response-inmates-death-53854122.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_440588da89e54418aaceaf2692284b04_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Denver Sheriff's Department mishandled an investigation into the 2015 death of a man restrained by deputies at the jail and must change its disciplinary and investigative process, a law enforcement watchdog agency said in a blistering report Monday that focused new attention on a case that has already resulted in a $4.6 million settlement.\nThe report made public by Denver's independent police monitor, a civilian oversight agency for Denver's police and sheriff departments, recommends that a civilian be put in charge of the Internal Affairs Bureau of the sheriff's department that investigates allegations of officer misconduct.\nIt also called on the sheriff's department to make a variety of changes to its policies on staff training, hiring and interaction with medical staff when an inmate's health conflicts with jail security.\nThe city of Denver reached the settlement with Michael Marshall's family in November that required other changes at the jail, including mental health coverage being provided there 24 hours a day and training for all deputies on mental illness.\nMarshall, 50, died nine days after he was restrained in a prone position for several minutes by Denver jail deputies because they said Marshall was aggressive with another inmate and had ignored commands. He choked on his own vomit, lost consciousness and died later at a hospital.\nThe report includes new detail about how the sheriff's department responded to Marshall's death and levels harsh criticism at the Internal Affairs Bureau, which began its review of the case in 2016 after prosecutors announced that no criminal charges would be filed.\nAbout a month later, the bureau told the independent monitor's office that its investigation was complete, according to the report.\nIndependent Monitor Nick Mitchell's office objected, arguing that investigators did not interview any of the deputies who restrained Marshall at the jail or the nurses who were called to the area when Marshall became unconscious. The monitor's office also objected in June when investigators again declined to further investigate.\nBoth attempts to end the inquiry \"raised troubling questions about IAB's willingness to conduct a thorough and impartial investigation of this serious case,\" the report says. Choosing a civilian to lead the internal affairs division could insulate it from \"internal pressures,\" it says.\nThe report also questioned why several sergeants present as deputies restrained Marshall were not disciplined.\nAs supervisors, they should have stepped in, the report said. Deputy Bret Garegnani, Deputy Carlos Hernandez and Captain James Johnson received brief suspensions that were overturned after the officers appealed.\nThe report also criticizes the sheriff's department for failing to create a policy for reviewing deaths and other incidents at the jail.\nThe department \"tried to minimize potential issues....instead of seeing it as an opportunity to learn,\" the report said. Garegnani was nominated for the department's \"Life Saving Award\" for performing CPR on Marshall, the report added.\nJess Vigil, Denver's deputy director of its safety department, defended the internal investigation and disciplinary decisions. He said concerns were raised by the watchdog group but that it ultimately found the investigation \"thorough and complete.\"\nVigil said internal investigators mistakenly relied on results of the criminal investigation into the death initially but did end up conducting their own interviews and research.\nThe report said nurses told deputies that too much pressure placed on Marshall's neck could cause him to choke after vomiting but deputies refused and said they had to control Marshall.\nThe monitor's report recommended more training and a supervisor's input during future conflicts between jail medical staff and deputies.",
    "source_domain": "abcnews.go.com",
    "title": "Watchdog blasts Denver sheriff's response to inmate's death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/watchdog-blasts-denver-sheriffs-response-inmates-death-53854122"
}