{
    "authors": [
        "Abc News",
        "More Patrick"
    ],
    "date_download": "2018-05-30 15:19:51+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A well-known Russian journalist was reported shot and killed at his apartment building Tuesday in Ukraine -- but then showed up alive, on television, the next day.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Frussian-opposition-journalist-reported-killed-shows-alive-news%2Fstory%3Fid%3D55526893.json",
    "image_url": "https://abcnews.go.com/International/russian-opposition-journalist-reported-killed-shows-alive-news/story?id=55526893",
    "language": "en",
    "localpath": null,
    "maintext": "In a stunning twist, a well-known Russian journalist who Ukrainian authorities said was shot and killed in the capital of Kiev Tuesday showed up alive Wednesday, with Ukrainian security services saying they faked his death.\nInterested in Russia? Add Russia as an interest to stay up to date on the latest Russia news, video, and analysis from ABC News. Add Interest\nArkady Babchenko, a celebrated war reporter who fled his home country last year amid a campaign of intimidation, was said to have been killed at his his apartment building in Kiev he appeared at a press conference Wednesday.\nAuthorities said they pretended Babchenko was dead in order to stop a Russian plot to kill him. Babchenko is a ferocious critic of the Kremlin.\nUkrainian police said Tuesday that his wife had found him Tuesday night in his apartment building’s stairwell covered in blood after being shot repeatedly in the back, and that she had called an ambulance but he died before reaching the hospital.\nPolice said Tuesday they believed Babchenko was likely targeted because of his work, and earlier Wednesday, they even released a sketch of the suspected killer, an unnamed bearded man between 40 and 45 years old.\nUkrainian officials had said suspicion for the supposed killing fell immediately on the Russian security services. Ukrainian Prime Minister Vladimir Groisman wrote on Facebook that he was “sure the Russian totalitarian machine had not forgiven” Babchenko “his honesty and principles.”\nAnton Gerashchenko, a member of Parliament (MP) who works as an adviser to Ukraine’s Interior Ministry, said investigators were going to be looking at “Russian spy agencies' efforts to get rid of those who are trying to tell the truth about what is going on in Russia and Ukraine.\"\nRussian Foreign Minister Sergey Lavrov responded by denouncing the Ukrainian accusations, calling the supposed killing a “tragedy.” He accused Ukraine and its “Western handlers” of seeking to use it to stir up anti-Russian feeling, saying it followed a familiar pattern of using such assassinations to frame Russia.\n“This fashion,” Lavrov said “is very sad. But, as you see, it suits many people, especially those, like our Ukrainian neighbors, who are taking advantage of the complete impunity coming from their Western handlers.”\nThe killing would have been the latest in a string of killings in Kiev in recent years of officials, journalists and soldiers, among them critics of the Kremlin. In March 2017, Denis Voronenko, a former pro-Kremlin Russian MP who had defected to Ukraine, was gunned down in broad daylight in front of a hotel in central Kiev.\nIn 2016, Pavel Sheremet, a renowned reporter, who was a prominent critic of the Russian and Ukrainian governments, was killed by a bomb placed on his car. A number of Ukrainian military officers have also been killed in bomb and gun attacks in the city in the past two years.\nBabchenko, 41, is a highly regarded war correspondent who had himself twice fought in the Russian military in Chechnya during the 1990s. The second time, he had signed up as a volunteer to fight and there began to write. He became a scathing critic of the Kremlin’s wars, most recently attacking it over its 2014 seizure of Crimea and invasion of Ukraine and later its intervention in Syria.\nHis criticisms attracted the fury of pro-Kremlin officials and activists, as well as state media, and for years he endured regular abuse and threats. But in February 2017, he fled Russia after becoming the subject of a particularly intense campaign of public harassment.\nIt was sparked by a Facebook post in which he criticized Russia’s bombing campaign in Syria and the indifference he, therefore, felt toward a Russian army choir that had died in a plane crash. The post prompted a huge backlash, with Russian MPs saying he ought to be prosecuted and state media and pro-Kremlin activists mounting venomous attacks on him as “unpatriotic”.\nWriting in an article in the U.K. newspaper, the Guardian, explaining his decision to flee Russia, Babchenko said the campaign “was so personal, so scary, that I was forced to flee.”\n“My home address has also been published on the internet, together with an invitation ‘to visit.’ I have received threats to me and my family by the thousand – in my email inbox, on Facebook and by phone,” he wrote.\n“To cap things off, a pro-government ultranationalist TV channel, Tsargrad, recently released a list of the ‘Top 100 Russophobes’ – I’m number 10, and I fought twice for this country. A country I no longer feel safe in.”\nBabchenko moved to Prague and then settled in Kiev with his wife and child. He has been working for the Crimean Tatar television station, ATR, that was driven out of Crimea after Russia’s seizure of the peninsula.\nBabchenko had recently reported extensively and critically on the pro-Russian separatists fighting Ukraine’s government in the country’s east and who are backed by Moscow.\nSome of his former colleagues have suggested he could have been targeted by the rebels. With an ongoing war, weapons are abundant in Ukraine and contract killings have become increasingly common.\nIlya Ponomarev, a former opposition Russian MP, who now lives in Kiev as an anti-Kremlin activist, said in the past three days he had heard about three other assassinations ordered against Russian opposition emigres in Ukraine. Ponomarev said he believed former separatist fighters were being recruited to act as killers.\n“I’m afraid this is not the last death,” he wrote in a Facebook post.\nBabchenko is widely respected in Russia and Ukraine's journalistic communities as an unblinking and remarkably talented chronicler of war. The day before his death, Babchenko published a post on Facebook with a photograph of a military helicopter on which he said he had been invited to fly during fighting in eastern Ukraine in early 2014 but from which had been ordered off at the last minute.\nThe helicopter was later shot down with all aboard killed. Babchenko wrote he was, therefore, marking the day as his \"second birthday.”",
    "source_domain": "abcnews.go.com",
    "title": "Russian journalist reported dead shows up alive at news conference; Ukrainian officials say they faked his death",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/russian-opposition-journalist-reported-killed-shows-alive-news/story?id=55526893"
}