{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 04:55:22+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Funmet-months-maria-hit-puerto-rico-53865945.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_0af6da2f7a1c4f82bd3bb9526226431e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Puerto Rico? Add Puerto Rico as an interest to stay up to date on the latest Puerto Rico news, video, and analysis from ABC News. Add Interest\nGenerators are still humming. Candles are still flickering. Homes are still being repaired.\nPuerto Rico was hit by Hurricane Maria exactly six months ago, and the U.S. territory is still struggling to recover from the strongest storm to hit the island in nearly a century.\n\"There are a lot of people with needs,\" said Levid Ortiz, operating director of PR4PR, a local nonprofit that helps impoverished communities across the island. \"It shouldn't be like this. We should already be back on our feet.\"\nSome 250 Puerto Ricans formed a line around him on a recent weekday, standing for more than two hours to receive bottles of water and a box of food at a public basketball court in the mountain town of Corozal. Many of those waiting were still without power, including 23-year-old Keishla Quiles, a single mother with a 4-year-old son who still buys ice every day to fill a cooler to keep milk and other goods cold amid rising temperatures.\n\"Since we're a family of few resources, we have not been able to afford a generator,\" she said. \"It's been hard living like this.\"\nCrews already have restored water to 99 percent of clients and power to 93 percent of customers, but more than 100,000 of them still remain in the dark. Justo Gonzalez, interim director for Puerto Rico's Electric Power Authority, said he expects the entire island to have power by May, eight months after the Category 4 storm destroyed two-thirds of the island's power distribution system — and just as the 2018 Atlantic hurricane season is about to start.\nGonzalez also pledged to inspect dozens of wooden and cement poles still leaning haphazardly across the island after a wooden telephone pole fell on a car. It killed an elderly couple on Sunday as they returned from a town fair in the mountains of western Puerto Rico. The deaths of Luis Beltran, 62, and Rosa Bosque, 60, have angered Puerto Ricans and raised concerns about the safety of people as they recover from the hurricane.\n\"It worries me because ... it can happen anywhere,\" Mayor Edwin Soto told The Associated Press, adding that crews were going to inspect poles across the mountain town of Las Marias to ensure they are in good condition.\nBeltran's youngest sister, Migdalia Beltran, said her brother was living in New Jersey when Hurricane Maria hit, but that he moved back three months ago to be with family.\n\"He was No. 1,\" she said as her voice cracked and she began to cry. \"He was the one who gave me support to keep going.\"\nThe storm caused an estimated $100 billion in damage, killed dozens of people and damaged or destroyed nearly 400,000 homes, according to Puerto Rico's government.\nIn the six months since the hurricane, more than 135,000 people have fled to the U.S. mainland, according to a recent estimate by the Center for Puerto Rican Studies at Hunter College in New York.\nMore than 40 percent of them settled in Florida, followed by Massachusetts, Connecticut, New York and Pennsylvania, the study found.\nMeanwhile, those who stayed behind say they need more help.\nThe AP recently found that of the $23 billion pledged for Puerto Rico, only $1.27 billion for a nutritional assistance program has been disbursed, along with more than $430 million to repair public infrastructure. The U.S. Federal Emergency Management Administration also has spent more than $6 billion from its standing emergency fund.\nMeanwhile, the U.S. House Committee on Natural Resources issued a letter on Friday demanding that the U.S. Army Corps of Engineers explain why it is reducing the number of crews helping restore power when there are still people who remain in the dark.\n\"While we recognize that much progress has been made in restoring power to the majority of customers, the job is not done,\" the letter stated.",
    "source_domain": "abcnews.go.com",
    "title": "Needs go unmet 6 months after Maria hit Puerto Rico",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/unmet-months-maria-hit-puerto-rico-53865945"
}