{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 11:03:44+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "What the GOP memo says (and doesn't say)",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fgop-memo-52812365.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_555614f7ed4b46d6a54c3d41595cba9c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After more than a week of partisan bickering and social media-fueled buildup, the #releasethememo crowd got their wish.\nPresident Donald Trump declassified it. The GOP majority of the House intelligence committee released it. And the public dissection of the four-page, GOP-authored document began.\nHere are a few key takeaways:\n———\nWHAT'S THE GIST?\nThe memo makes a series of allegations of misconduct on the part of the FBI and the Justice Department in obtaining a warrant under the Foreign Intelligence Surveillance Act, or FISA, to monitor former Trump campaign foreign policy adviser Carter Page.\nSpecifically, it takes aim at the FBI's use of information from a former British spy, Christopher Steele, who compiled a collection of memos containing several allegations of ties between Trump, his associates and Russia.\nThe memo says the FBI and the Justice Department didn't tell the FISA court enough about Steele's role in an opposition research effort. The research was funded by Democrat Hillary Clinton through a Washington law firm.\nThe document also takes aim at several senior FBI and Justice Department officials. Among them is former Associate Deputy Attorney General Bruce Ohr, who it says knew of Steele's anti-Trump leanings and whose wife worked at the firm behind the opposition research effort.\n———\nWHAT'S NEW?\nThe memo provides the first formal government confirmation of the secret FISA warrant and that Page was the person being monitored.\nInformation like that is ordinarily considered among the most tightly held national security information, and it almost never gets released to the public.\nThough the memo takes issue with the FBI's methods, it also confirms that the FBI and Justice Department believed there was probable cause that Page was acting as an agent of a foreign power and a judge agreed — four times over.\nThe memo fills in the timeline of the Russia investigation, showing that Page was under surveillance for months.\nAccording to the memo, the Justice Department and FBI obtained the FISA warrant on Page on Oct. 21, 2016, and then had it reauthorized three additional times.\nGiven that FISA warrants must be renewed every 90 days, the memo indicates that the government monitored Page's communications for nearly a year.\n———\nIT STARTED WITH PAPADOPOULOS\nThe whole Russia investigation, that is.\nAccording to the memo, information about former Trump campaign foreign policy adviser George Papadopoulos \"triggered the opening of an FBI counterintelligence investigation in late July 2016.\"\nThat's significant because Trump and his allies in the GOP have tried to undermine the Russia investigation by saying it all stems from the Steele dossier.\nThe memo doesn't provide further details about the information the FBI received about Papadopoulos. But it appears to confirm in part reporting by The New York Times late last year that FBI concerns about Papadopoulos started the investigation.\nPapadopoulos pleaded guilty to lying to the FBI last year. Court papers show he had several contacts with people representing themselves as being tied to the Russian government starting in the spring of 2016.\nCourt papers show that Papadopoulos learned the Russians had \"dirt\" on Hillary Clinton in the form of \"thousands of emails\" prior to that information becoming public.\n———\nTHE FBI DID USE INFORMATION FROM STEELE, THOUGH\nThe memo says Steele's collection of reports \"formed an essential part\" of the FISA application for Page, but it doesn't specify exactly what information was used or how much.\nIt also says that the FISA application relied on a September 2016 Yahoo News article, and claims that the information in the article also came from Steele.\nThe document quotes former FBI Deputy Director Andrew McCabe as telling the House intelligence committee in December that \"no surveillance warrant would have been sought\" from the FISA court \"without the Steele dossier information.\"\nAccording to the memo, the application also included \"Steele's past record of credible reporting on other unrelated matters.\"\n———\nNO UNDERLYING INFORMATION RELEASED\nThe accuracy of the memo is hard to assess because the majority of the underlying contents are classified or confidential.\nThe memo cites an initial FISA warrant application — a document which usually has dozens of pages — as well as three additional renewals by the court. None of those documents are public.\nThe same is true of the transcripts of the committee's closed-door interviews with McCabe and other senior FBI officials who had contact with Steele.\nOn Friday, the committee's ranking Democrat, Rep. Adam Schiff of California, took issue with the memo's characterization of McCabe's comments, saying the former FBI deputy director was speaking generally about how any FISA application relies on \"each and every component\" included.\nBut the committee's chairman, Rep. Devin Nunes of California, said late Friday on Fox News the description of McCabe's comments is \"a summation of a long interview and that's definitely what he said.\" He noted that other witnesses have said \"similar things.\"\n———\n'MINIMALLY CORROBORATED'\nIt's been a burning question ever since the dossier was published by Buzzfeed News last year: How much did the FBI corroborate?\nAccording to the memo, not much at the time the FBI obtained the FISA warrant on Page. The memo cites FBI Assistant Director Bill Priestap as saying FBI corroboration of the dossier was in its \"infancy\" when the court authorized the first FISA warrant.\nIt also says an \"independent unit\" in the FBI conducted a \"source validation report\" on Steele's reporting and found it \"only minimally corroborated.\"\nBut without the underlying documents or transcripts of Priestap's testimony, it's hard to judge the accuracy of the memo's description.\n———\nFollow Chad Day on Twitter: https://www.twitter.com/ChadSDay",
    "source_domain": "abcnews.go.com",
    "title": "What the GOP memo says (and doesn't say)",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/gop-memo-52812365"
}