{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:34:54+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Officials identify the man as Akayed Ullah, who moved to New York from Bangladesh seven years ago.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fsurveillance-footage-captures-man-detonating-pipe-bomb-york-51727831.json",
    "image_url": "http://a.abcnews.com/images/WNT/171211_wn_benitez5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Surveillance footage captures man detonating pipe bomb in New York terror attack\nThe governor calling it, quote, one of our worst nightmares. Video capturing the moment the attack attacker's bomb went off before it was supposed to. A massive police and fire response shutting down times square. Police say the suspect is an immigrant from Bangladesh. He survived this, and tonight, what he's now telling police. As we as learn authorities say he was wearing the bombing the entire time, from the moment he boarded the train in Brooklyn, during his trim to times square. ABC's gio Benitez leading us off. Reporter: Tonight, this is the moment authorities are calling about act of terror. Surveillance camera footage capturing a man detonating a homemade pipe bomb strapped to his body. Here from another angle, the suspect circled. Surrounded by unsuspecting commuters. Then suddenly, an explosion. A cloud of smoke. The crowd disperses. Injuring five and looefg the suspect on the ground, still alive, and so was everyone around him. The bomb only partially detonated. This was an attempted terrorist attack. Thank god the perpetrator did not achieve his ultimate goals. Reporter: The attack striking the heart of New York City in the middle of this morning's rush hour. A law enforcement source tells ABC news the suspect had been on the train for some time, the bomb strapped to him the whole time. Evacuating at this time. Reporter: Police responding to a reported explosion at around 7:20 this morning near times square. In a jam-packed, underground tunnel beneath New York's port authority bus terminal. Officials say these four police officers approached the suspect, still on the ground. Identifying the man as 27-year-old akayed Ullah, originally from Bangladesh. He moved to America seven years ago on a family Visa and has a green card. Suffering injuries to his arms and torso, he was taken to the hospital. It was there, officials say, he told them he was inspired by ISIS propaganda, and built the makeshift bomb in his Brooklyn apartment using instructions he found on the internet. He's believed to have acted alone. The device was based on a pipe bomb. It was affixed to his person with a combination of velcro and zip ties. Reporter: According to a law enforcement source, the bomb was built from a pipe about 12 inches in length with black powder and rigged with a nine-volt battery and a wire that came from a Christmas light. Because it was strapped with zip ties and velcro, the assumption is he was prepared to die. In the immediate aftermath, commuters quickly evacuated. The police were all behind them yelling, \"Everybody out of the building, everybody out of the building!\" Reporter: Christina Bethea was in that tunnel, saw the explosion and safely ran from it. What's going through your mind right now as you see all of this going on? This is where you work? If I don't believe in no god, I believe in god today. That's nhe only thing I could say. Reporter: The NYPD, outfitted with assault rifles, locking down the scene, checking for other possible devices. The normally packed subway platforms, today, empty. And we are underground right now in the subway station and you can see right there, it is all boarded up, because beyond that point, that is where the pipe bomb detonated. Bomb-sniffing dogs brought in. Choppers roared overhead. While in Brooklyn, the FBI searching three different homes in the area thought to be connected to the suspect. His family inside. Neighbors stunned. We all know each other. We're all friends. We all go to the same church. I mean -- I'm shocked. And gio Benitez with us live tonight outside the scene O the blast in the heart of New York. And gio, just moments ago, we heard from the suspect's family? Reporter: That's right, David. We just got this through a spokesperson, the family says this. \"We are heart broken by the violence and allegations,\" and they add, \"We have confidence that the justice system will find the trust behind this attack.\" David? Gio Benitez leading us off.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Surveillance footage captures man detonating pipe bomb in New York terror attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/surveillance-footage-captures-man-detonating-pipe-bomb-york-51727831"
}