{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 03:16:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "At 117, Jamaican woman likely just became world's oldest",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2F117-jamaican-woman-worlds-oldest-46850516.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_1a1ddc99e23442ffaa30749b58121683_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Violet Brown spent much of her life cutting sugarcane in the fields around her home in western Jamaica. She attended church regularly, avoids pork and chicken and celebrated her 117th birthday last month.\nOn Saturday, she is believed to have become the world's oldest living person following the death of Emma Morano of Italy, born Nov. 29, 1899.\nBrown told The Associated Press she is surprised but grateful to have lived this long.\n\"This is what God has given me, so I have to take it — long life,\" Brown said in an interview in her home in the town of Duanvale.\nBrown is considered to be the oldest person in the world with credible birth documentation, according to Robert Young, director of the supercentenarian research and database division at Gerontology Research Group, a network of volunteer researchers into the world's oldest people. Its website says she was born on March 10, 1900.\nBrown has not yet been declared the world's oldest by Guinness World Records, considered to be the official arbiter of the oldest person title but Guinness depends heavily on Young's group. Young said he has met Brown and examined her birth certificate, which was issued by the British authorities who governed Jamaica at the time of her birth.\n\"She's the oldest person that we have sufficient documentation for at this time,\" Young said.\nJamaica's prime minister congratulated Brown on Twitter.\nGuinness said it was researching a number of candidates for the new world's oldest person title.\n\"It can be a uniquely complex and sometimes lengthy process,\" Guinness spokeswoman Elizabeth Montoya said. \"There is no confirmation of a new title holder until our thorough processes are complete.\"\nBrown has two caregivers and spends most of the day resting in the home she shares with her 97-year-old son. She is able to sit up by herself and walk short distances. And while she is hard of hearing, she offered swift, complete responses to questions about her life and family.\nThe secret to long life is hard work, she said.\n\"I was a cane farmer. I would do every work myself,\" she said. \"I worked, me and my husband, over that hill.\"\nShe also credited her Christian faith for her long life.\n\"I've done nearly everything at the church,\" she said. \"I spent all my time in the church. I like to sing. I spent all my time in the church from a child to right up,\" to today, she said.",
    "source_domain": "abcnews.go.com",
    "title": "At 117, Jamaican woman likely just became world's oldest",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/117-jamaican-woman-worlds-oldest-46850516"
}