{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 04:55:39+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fquick-challenge-mississippis-15-week-abortion-ban-53865457.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_f444946ee06b45ada9c400ee402e080e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The nation's most restrictive abortion law is headed for a showdown before a federal judge only hours after it was signed by Mississippi's governor.\nU.S. District Judge Carlton Reeves late Monday scheduled arguments Tuesday morning over whether he should immediately block the law after a request by the state's only abortion clinic and a physician who works there.\nRepublican Gov. Phil Bryant signed House Bill 1510 on Monday, immediately banning most abortions after 15 weeks of gestation. How quickly will the effects of the law be felt in Mississippi? Dr. Sacheen Carr-Ellis of the Jackson Women's Health Organization stated in court papers that a woman 15 weeks or more pregnant is scheduled for a Tuesday afternoon abortion.\nThe law and responding challenge set up a confrontation sought by abortion opponents, who are hoping federal courts will ultimately prohibit abortions before a fetus is viable. Current federal law does not.\nSome legal experts have said a change in the law is unlikely unless the makeup of the U.S. Supreme Court changes in a way that favors abortion opponents.\n\"We are saving more of the unborn than any state in America, and what better thing can we do?\" Bryant said in a video his office posted on social media.\nThe law's only exceptions are if a fetus has health problems making it \"incompatible with life\" outside of the womb at full term, or if a pregnant woman's life or a \"major bodily function\" is threatened by pregnancy. Pregnancies resulting from rape and incest aren't exempted.\nMississippi previously tied with North Carolina for the nation's strictest abortion limits at 20 weeks. Both states count pregnancy as beginning on the first day of a woman's previous menstrual period. That means the restrictions kick in about two weeks before those of states whose 20-week bans begin at conception.\n\"We'll probably be sued in about half an hour,\" Bryant said to laughter from supporters as he signed the bill. \"That'll be fine with me. It'll be worth fighting over.\"\nBryant's prediction was accurate. The state's only abortion clinic and one of the physicians who practices there sued in federal court within an hour, arguing the law violates other federal court rulings saying a state can't restrict abortion before a child can survive on its own outside the womb.\nThe Jackson Women's Health Organization, in a lawsuit handled by the Center of Reproductive Rights, argued the measure is unconstitutional and should immediately be struck down.\n\"Under decades of United States Supreme Court precedent, the state of Mississippi cannot ban abortion prior to viability, regardless of what exceptions are provided to the ban,\" the suit states.\nThe suit says the clinic performed 78 abortions in 2017 when the fetus was identified as being 15 weeks or older. That's out of about 2,500 abortions performed statewide, mostly at the clinic.\nCarr-Ellis, in a sworn statement, says she'll have to stop providing abortions to women past the 15 week ban, or else lose her Mississippi medical license, as House Bill 1510 requires. She says women shouldn't be forced to carry their pregnancies to term against their wills or leave the state to obtain abortions.\n\"A woman who is pregnant should have the ability to make the decision that is best for her about the course of her pregnancy, based on her own values and goals for her life,\" Carr-Ellis said in the statement.\nRepublican legislative leaders Lt. Gov Tate Reeves and House Speaker Philip Gunn both attended Bryant's private signing ceremony\n\"The winners (today) are those babies that are in the womb, first and foremost,\" Gunn said. \"Those are the ones we're trying to protect.\"\nWhen asked if the state is prepared to bear the cost of a lawsuit, Gunn said, \"Absolutely.\"\n\"I don't know if you can put any value on human life,\" Gunn said. \"We are all about fighting to protect the unborn. Whatever challenges we have to take on to do that, is something we're willing to do.\"\nOpponents, though, predicted the attempt to allow states to restrict abortion before viability would fail.\n\"We certainly think this bill is unconstitutional,\" said Katherine Klein, equality advocacy coordinator for the American Civil Liberties Union of Mississippi. \"The 15-week marker has no bearing in science. It's just completely unfounded and a court has never upheld anything under the 20-week viability marker.\"\nThe bill was drafted with the assistance of conservative groups including the Mississippi Center for Public Policy and the Alliance Defending Freedom.\n\"We believe this law should be a model for the rest of the country,\" Jameson Taylor, acting president of the Mississippi Center for Public Policy, said in a statement.\nBoth Republican-controlled chambers passed the bill overwhelmingly in early March, by a vote of 35-14 in the Senate and 76-34 in the House.\nThe U.S. Senate failed to pass a 20-week abortion ban bill in January. With 60 \"yes\" votes required to advance, the bill failed on a 51-46 vote.\n———\nFollow Jeff Amy at: http://twitter.com/jeffamy . Read his work at https://www.apnews.com/search/Jeff—Amy .",
    "source_domain": "abcnews.go.com",
    "title": "Quick challenge for Mississippi's 15-week abortion ban",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/quick-challenge-mississippis-15-week-abortion-ban-53865457"
}