{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 16:55:57+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "AG's religious objection order undercuts LGBT protections",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Ftrump-religious-objection-order-upends-lgbt-protections-50325818.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/trump-religious-objection-order-upends-lgbt-protections-50325818",
    "language": "en",
    "localpath": null,
    "maintext": "In an order that undercuts federal protections for LGBT people, Attorney General Jeff Sessions issued a sweeping directive to agencies Friday to do as much as possible to accommodate those who claim their religious freedoms are being violated.\nThe guidance, an attempt to deliver on President Donald Trump's pledge to his evangelical supporters that he would protect religious liberties, effectively lifts a burden from religious objectors to prove that their beliefs about marriage or other topics are sincerely held.\nUnder the new policy, a claim of a violation of religious freedom would be enough to override many anti-discrimination protections for LGBT people, women and others. The guidelines are so sweeping that experts on religious liberty are calling them a legal powder-keg that could prompt wide-ranging lawsuits against the government.\n\"This is putting the world on notice: You better take these claims seriously,\" said Robin Fretwell Wilson, a law professor at the University of Illinois at Urbana-Champaign. \"This is a signal to the rest of these agencies to rethink the protections they have put in place on sexual orientation and gender identity.\"\nTrump announced plans for the directive last May in a Rose Garden ceremony where he was surrounded by religious leaders. Since then, religious conservatives have anxiously awaited the Justice Department guidance, hoping for greatly strengthened protections for their beliefs amid the rapid acceptance of LGBT rights. Religious liberty experts said they would have to see how the guidance would be applied by individual agencies, both in crafting regulations and deciding how to enforce them. But experts said the directive clearly tilted the balance very far in favor of people of faith who do not want to recognize same-sex marriage.\n\"Except in the narrowest circumstances, no one should be forced to choose between living out his or her faith and complying with the law,\" Sessions wrote. \"To the greatest extent practicable and permitted by law, religious observance and practice should be reasonably accommodated in all government activity.\"\nThe document lays the groundwork for legal positions that the Trump administration intends to take in future religious freedom cases, envisioning sweeping protections for faith-based beliefs and practices in private workplaces, at government jobs and even in prisons.\nIn issuing the memo, Sessions, a deeply devout Methodist from Alabama, is injecting the department into a thicket of highly charged legal questions that have repeatedly reached the U.S. Supreme Court, most notably in the 2014 Hobby Lobby case that said corporations with religious objections could opt out of a health law requirement to cover contraceptives for women.\nThe memo makes clear the Justice Department's support of that opinion in noting that the primary religious freedom law — the Religious Freedom Restoration Act of 1993 — protects the rights not only of people to worship as they choose but also of corporations, companies and private firms.\nThe document also says the government improperly infringes on individuals' religious liberty by banning an aspect of their practice or by forcing them to take an action that contradicts their faith. As an example, Justice Department lawyers say government efforts to require employers to provide contraceptives to their workers \"substantially burdens their religious practice.\"\nThe document also calls into question the Johnson Amendment, which bars churches and tax-exempt groups from endorsing political candidates. Trump in May signed an executive order aimed at weakening the enforcement of that law, which he has said penalizes people for protected religious belief.\nThe Justice Department, in the document, says the Internal Revenue Service may not enforce the Johnson Amendment \"against a religious non-profit organization under circumstances in which it would not enforce the amendment against a secular non-profit organization.\"\nThe department's civil rights division will now be involved in reviewing all agency actions to make sure they don't conflict with federal law regarding religious liberty.\n———\nZoll reported from New York.",
    "source_domain": "abcnews.go.com",
    "title": "AG's religious objection order undercuts LGBT protections",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/trump-religious-objection-order-upends-lgbt-protections-50325818"
}