{
    "authors": [
        "Abc News",
        "Jordyn Phelps",
        "More Meridith",
        "More Jordyn"
    ],
    "date_download": "2018-05-30 16:55:22+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "President Donald Trump will welcome Wednesday world-class athletes to the White House.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fsports-fitness-day-white-house-questions-abound-presidents%2Fstory%3Fid%3D55486650.json",
    "image_url": "https://s.abcnews.com/images/Politics/trump-abe-golfing-gty-ps-180402_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump will welcome Wednesday world-class athletes, like Olympian Shauna Rohbock and baseball great Mariano Rivera to the White House for the Sports and Fitness Day as the Trump administration seeks to highlight the importance of youth sports participation.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nBut Trump, who has claimed he is the “best athlete,” has struggled with his own personal fitness regimen.\nTrump, 71, prefers hitting the golf links over hitting the gym. And even when spotted playing a round of golf, he typically employs an electric golf cart rather than walking the roughly four miles of a full course.\nDuring a press conference following Trump’s first physical as president in January, his then-personal physician Rear Adm. Ronny Jackson announced that the president was on board with a plan to modify his diet and exercise habits with an eye toward losing 10 to 15 pounds in the course of the year.\n“He’s more enthusiastic about the diet part than the exercise part, but we’re going to do both,” Jackson said at the time, later adding: “Right now, on a day-to-day basis, he doesn’t have a dedicated, defined exercise program. So that’s what I’m working on.”\nFive months later, as the White House now seeks to highlight the benefits of youth sports participation, questions about how the president’s own physical fitness routine is going have so far gone unanswered.\nWhen the question was posed to Ivanka Trump, his daughter, and advisor, during a call on Tuesday, reporters were informed that Ivanka Trump had already jumped off the call.\n“Ivanka had to step out for another meeting but Holli [Richmond] is here to take the rest of your questions,” a junior press aide explained after a reporter inquired about her father’s fitness routine.\nHolli Richmond, the executive director of the President’s Council on Sports, Fitness, and Nutrition, similarly referred questions to the White House press office.\nABC News' questions directly to the White House press office have so far gone unanswered.\nTrump has also previously given voice to an unusual view of physical fitness, reportedly calling exercise “misguided” and “arguing that a person, like a battery, is born with a finite amount of energy,” according to biographers Mike Kranish and Marc Fisher in their book, “Trump Revealed.”\nIn his younger days, however, Trump was reportedly an accomplished athlete. He played baseball, basketball, and football at the New York Military Academy where he attended high school.\nTrump even tweeted that he was “said to be the best bball [sic] player” in New York state. Trump said his high school coach Ted Dobias said he was the “best he ever coached.”\n“I was always the best athlete, people don't know that,” Trump told the Wall Street Journal in an interview last year.\nBut, now, as president, what is publically known about his fitness activity consists almost exclusively of golf.\nIt’s a shift from President George W. Bush and President Barack Obama, who both made time for daily workouts. Bush also enjoyed riding bikes as president and Obama was known to play basketball with his staffers.\nWhile Trump might not be as athletic as he was decades ago, he’s remained a devoted sports fan over the years, once owning a professional football team and counting professional athletes as friends.\nOne of those friends, New England Patriots Coach Bill Belichick, is now co-chair of the White House Council on Sports, Fitness, and Nutrition.\nOther members of the council include volleyball player Misty May-Treanor, professional baseball player Mariano Rivera of the New York Yankees, and television physician Dr. Oz.\nIn a proclamation dubbing May as-as “National Physical Fitness and Sports Month,” Trump touted the benefits of exercise for people “of all ages.”\n“Setting time aside each day to exercise improves both mental health and overall quality of life,” he said in a proclamation.\n“When I'm up there speaking in front of 15,000, 25,000 people up there, using a lot of motion, I guess, in its own way it's a really healthy act,\" Trump told Dr. Oz on his show about speaking at political events. \"I really enjoy doing it. A lot of times these rooms are really hot, like saunas. I guess that's a form of exercise.\"\nWith Wednesday’s Sports Day event, the White House says it seeks to highlight and reverse a trend of declining youth participation in sports.\nAmong the activities planned, kids will get a chance to throw a football with former professional football player Herschel Walker, practice their baseball skills with Mariano Rivera, swing a golf club with Natalie Gulbis, and kick a soccer ball with Shauna Rohbock. These athletes, among others expected, have been named by Trump to sit on his Council on Sports, Fitness, and Nutrition.\nFirst lady Melania Trump is not expected to be in attendance, though Ivanka Trump will play a prominent role. On Tuesday, Ivanka Trump made the case that youth sports participation is linked to stronger earning potential later in life and decreases the chance of children being involved in crime.\n“Studies have shown that children who participate in sports have greater self-discipline, higher self-esteem, and are better at working with others. Individuals who acquire these skills have proven that they can excel in the workplace and earn higher wages than their peers who did not engage in athletics according to a recent study,” Ivanka Trump said. “Similarly, students who participate in after-school sports are less likely to commit a crime or be a victim of a crime, or to suffer from mental or physical health problems.”\nIvanka Trump further contended that the challenge ahead is to break down “pay-to-play” barriers, the extra costs sometimes associated with participating in team sports that may prevent a low-income child from signing up for a sports team.\n“We must break down barriers to youth sports participation,” Trump said, citing statistics showing that sports participation has decreased in recent years among economically disadvantaged students, and even more so among girls.\nSo what actions does the administration intend to take to reverse the trend?\nThe administration will take a four-phase approach to first increase awareness and identify barriers; second, promote public and private sector participation to develop an action plan; third develop metrics to measures success; and, finally, develop a local and national volunteer strategy, Richmond told reporters.",
    "source_domain": "abcnews.go.com",
    "title": "It's Sports and Fitness Day at the White House but questions abound about the president's own fitness",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/sports-fitness-day-white-house-questions-abound-presidents/story?id=55486650"
}