{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2017-08-14 18:16:12+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The motive is believed to be gang-related, officials said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdeadly-shooting-wisconsin-car-racing-track%2Fstory%3Fid%3D49205356.json",
    "image_url": "http://a.abcnews.com/images/US/shooting-wisconsin-great-lakes-dragaway-ap-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A suspect is at large after three men were shot and killed Sunday at a car racing track in Wisconsin.\nHere's what we know about the investigation.\nThe shooting\nThe deadly shooting was reported at the Great Lakes Dragaway in Union Grove at 6:59 p.m.\nAccording to The Associated Press, officials said the men were shot at point-blank range while they were near a concession area in the parking lot.\nNo additional injuries were reported beyond the three people shot and killed, Sergeant Mark Malecki of the Kenosha Sheriff’s Department told ABC News.\nKenosha Sheriff’s Department said it was estimated that over 5,000 people were at the Great Lakes Dragaway event \"known as 'Larry’s Fun Fest' which in the past has attracted persons from Milwaukee, Chicago and other surrounding areas.\"\nThe motive\nMalecki told ABC News today the shooter remains at large and that the motive is believed to be gang-related.\nMalecki said all indications are that the victims were targeted and this was not a random act of violence.\nThe victims\nThe victims were all men from Illinois, Malecki said: two 30-year-old men and one 26-year-old man.\nThe sheriff is expected to release the victims' names at a news conference this afternoon, Malecki said.",
    "source_domain": "abcnews.go.com",
    "title": "What we know about deadly shooting at Wisconsin car racing track",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/deadly-shooting-wisconsin-car-racing-track/story?id=49205356"
}