{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:26:02+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Dana White: If Jon Jones is ready late July, he'll fight Daniel Cormier",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fdana-white-jon-jones-ready-late-july-hell%2Fstory%3Fid%3D46852825.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0417/dm_170417_ncf_tomherman_interview/dm_170417_ncf_tomherman_interview_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The UFC is willing to grant former light heavyweight champion Jon Jones an immediate title shot upon his return this summer, according to UFC president Dana White.\nWhite told ESPN.com on Monday he is open to booking a highly anticipated rematch between Jones (22-1) and defending champion Daniel Cormier at UFC 214 on July 29 in Anaheim, provided Jones wants the Cormier fight right away.\nThe 29-year-old is currently serving a one-year suspension for a failed drug test, which ends the first week of July.\nShould Jones require more time or want a tuneup fight first, White said Cormier (19-1) will face British contender Jimi Manuwa (17-2), possibly at UFC 213 on July 8 in Las Vegas.\n\"Cormier is available to fight on July 8, but that timeframe doesn't work for Jon Jones,\" White said. \"Cormier already told me he's willing to fight either Jones or Manuwa.\n\"If Jon Jones is ready to fight [by UFC 214] on July 29, we'll see the Jones versus Cormier rematch, finally.\"\nRepresentatives for Jones did not immediately respond to request for comment.\nThe UFC stripped Jones of the 205-pound championship in 2015 for disciplinary reasons. Earlier that year, Jones had defended his title an eighth time, defeating Cormier via unanimous decision at UFC 182.\nA rematch between Cormier and Jones was originally scheduled to take place at UFC 197 in April 2016, but Cormier was forced to withdraw due to a knee injury. It was later scheduled to headline UFC 200 last July in Las Vegas, but Jones was pulled from the event just days prior due to the failed drug test.\nFighting out of Albuquerque, New Mexico, Jones has made just one appearance in the last two years. He received a one-year suspension from United States Anti-Doping Agency (USADA) last July after testing positive for estrogen blockers he later said came from an unmarked sexual enhancement pill.\nIf the Cormier, Jones rematch is added to UFC 214, it is unclear where it would fall on the card. White has stated he will not trust Jones in a headlining role in his first fight back.\nWhile Jones's situation is uncertain, Cormier and Manuwa have recently gone back and forth with one another on social media, promoting a potential fight.\nOn Monday, Cormier wrote to Manuwa via Twitter, \"Let's go! I wanna fight you! Jones needs to get his sea legs back. Where's the contract. This [is] light work.\"\n\"Jimi wants Cormier,\" White said. \"They got into it at UFC 210 [earlier this month] and Jimi told me he's never been talked to like that before. We'll see how this plays out.\"",
    "source_domain": "abcnews.go.com",
    "title": "Dana White: If Jon Jones is ready late July, he'll fight Daniel Cormier",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/dana-white-jon-jones-ready-late-july-hell/story?id=46852825"
}