{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:35:35+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "ABC News' Becky Worley tries out the Amazon Alexa and Google Home to see how the home assistants compare.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fvoice-assistant-best-51709937.json",
    "image_url": "http://a.abcnews.com/images/GMA/171211_gma_worley3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Which voice assistant is best for you?\nstories in \"Pop news.\" Now to a big day of online deals as you rush to finish or start your holiday shopping. It's green day, green Monday which means huge savings and one of the top sellers so far this year, hose home voice assistants. Becky Worley is joining us from San Francisco. Becky, it seems like there's a little bit of a battle going on. Tell us about it. Reporter: Yeah, robin. That's right. Good morning, 50% of U.S. Homes will buy one of these voice estimates in the next five years so, hey, echo or hey, Google, that's a question millions are asking this holiday season. Hey, Google. Alexa how do I set you up? Amazon's echo and Google home are battling to be your digital assistant. Which one should you choose? Cnet's Brian tong says picking the right assistant depends on. You ha it comes down is are you in Google's ecosystem and all their services or maybe you're a prime subscriber. You have all those benefits from that and how many smart devices at home do you want to control? Reporter: So who should buy Google home? Hey, Google, what's the golden state warriors' record right now. If search is your main focus -- They're in second place in the western conference with 20 wins and 6 losses. We know Google is the king of search and that stays the same. It has the best brains of both so go Google home. Reporter: Next media. All right, music on YouTube. Here you go. ??? Reporter: It's a good choice if you own a android, have all your Google and use a chrome cast for streaming. ??? Google, pause the song before I embarrass my children. Well if you're in the Google world and use the chromecast, have your e-mail, calendar is all set up you have to go Google home. Reporter: So to recap Google home is good for folks who already have all their accounts with Google and who mainly plan to use the voice assistant as a search engine. Amazon echo, my son and his friend Evan think its music services are cool. Echo, play imagine dragons in the living room. \"Believer\" by imagine dragons. ??? Reporter: 90 million people are already prime subscribers and many use prime music. Now speaking of prime -- Echo, buy a fidget spinner. When it comes to products -- You have to go Amazon. Reporter: Now if you want to control your smart home by voice, Google is ramping up fast but -- Echo, set the thermostat to 65 degrees. You got to go Amazon. They have the most compatibility with smart home devices. Reporter: You want Amazon echo if you have smart home device, already are tied into the Amazon prime world of music and plan to shop by voice. Echo, tell me a joke. Reporter: The future is voice controlled. No matter which product you choose. Now, these devices don't have cameras in them but many people are still worried about the privacy issues with devices that are basically listening to you all the time and yet, robin, they are still selling like hotcades. We have two of them right here. What can you tell us more about them, Becky? We're happy to have them. You have -- yeah, you got the Google home mini and Amazon echo dot and a few other in those families. The smaller ones are the entry models. 29 bucks for each of them, target, Walmart, Amazon. $20 off today and been that way for a lot of the holiday season stow far. Some other great sales as well today, right, Becky? Yeah, it's green Monday and you have a bunch of cute kids in studio there. They don't know that green Monday is yet another completely made up shopping holiday. But the discounts are real. Target has a toy sale spend $100, get 25 bucks back and that includes some of those execute scooters and a lot of the fun toys that parents have got to get this time of year. Anything for us adults, I mean -- hey. Down goes Frazier, are you okay, kid? He can own this place. Yeah. Got to get back up. Anything more for adults, though, Becky? Whoa. Ebay coined this term green Monday. Are you okay? They're offering a ton of discounts today. I hope the audience and that little kid is all right. He takes a licking but he keeps on ticking.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Which voice assistant is best for you?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/voice-assistant-best-51709937"
}