{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 18:01:32+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ffort-worth-gang-member-die-killing-girl-grandmother-54694229.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_16f1f148fb7a4eb2a3752efbe20d10d9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ice cream and slices of a Hannah Montana-themed birthday cake were being served at a 9-year-old girl's party outside a Fort Worth apartment when a man dressed in black got out of a car, grabbed a laser-sighted semi-automatic rifle from the trunk and opened fire.\nAbout 20 people — more than a dozen of them children — scurried to get inside the home. Six were hit. Two of them were killed: Annette Stevenson, 48, and her 5-year-old granddaughter, Queshawn Stevenson.\nA former Fort Worth street gang member, Erick Daniel Davila, 31, is scheduled to be executed Wednesday for the slayings 10 years ago.\nHe'd be the fifth inmate executed in Texas this year and ninth nationally.\nDavila's attorneys asked the U.S. Supreme Court to halt his lethal injection, arguing it was improper for Davila's trial judge, Sharen Wilson, now the Tarrant County district attorney, to request an execution date. They also questioned the role of a lawyer working with Wilson on capital appeals cases who previously represented Davila in an earlier appeal.\n\"It clearly shocks the consciences and offends the basic notion of fair play,\" lawyer Seth Kretzer told the justices in a filing.\nThe appeal also contends prosecutors withheld information that Davila was high on drugs at the time of the shootings. His attorneys argued that could have influenced jurors to decide on a lesser penalty, and they questioned whether the way Texas juries decide death sentences is constitutionally proper.\nState attorneys said Wilson never represented Davila and state law and court rulings allow her office to represent the state's interests in the case. Prosecutors also argued Wilson prohibits assistants from participating in cases where they were defense lawyers and that courts have upheld the state's capital sentencing procedure.\nThey also said evidence showed Davila's trial attorneys were provided notes from police investigators. Katherine Hayes, an assistant Texas attorney general, told the high court that evidence did not show Davila was on drugs at the time and that the shooting \"was the result of intentional deliberate action.\"\nDefense lawyers at Davila's trial tried to show he didn't intend to kill multiple people, a criterion for the capital murder charge. They argue he only intended to kill Jerry Stevenson, whose daughter and mother were shot to death. Authorities said Jerry Stevenson belonged to a rival gang, which he denied, but whose members Davila blamed for shooting him in 2005.\nQueshawn Stevenson's sister, then 11, testified she saw a man April 6, 2008, inside the dark car holding a gun with \"a red dot\" on it and pointed it at her family's residence. Then she saw him standing next door and shoot at the porch as screaming people \"stacked up on top of each other\" trying to funnel through the front door and seek safety inside.\nDavila was caught the next day after a brief police chase. He told police in one of several statements he wanted to do a \"shoot em up,\" according to court documents.\nDavila previously was in prison for a 2004 burglary in Tarrant County and was released after about a year.\nKnown on the streets as \"Truman\" and wearing a \"Truman Street Bloods\" tattoo on his chest, Davila was accused but not tried for another fatal shooting days before the birthday party slayings. While awaiting trial for capital murder, evidence showed he attacked Tarrant County jailers and maintenance workers during an escape attempt.\nDavila's mother testified he was the result of her being raped at age 13 by a friend of her alcoholic father. At the time of his trial, testimony showed Davila's father was in prison for a murder conviction.\nCharges against the getaway driver, Garfield Thompson II, were dropped after he pleaded guilty in unrelated cases. He's serving 20 years in prison.",
    "source_domain": "abcnews.go.com",
    "title": "Fort Worth gang member to die for killing girl, grandmother",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/fort-worth-gang-member-die-killing-girl-grandmother-54694229"
}