{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 06:28:14+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fchinese-man-realizes-accidentally-photobombed-wife-11-years%2Fstory%3Fid%3D53867136.json",
    "image_url": "https://s.abcnews.com/images/International/photobomb2_180320_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Chinese couple that met on a blind date in 2011 and married the following year very nearly met more than a decade earlier while vacationing in the same city.\nInterested in China? Add China as an interest to stay up to date on the latest China news, video, and analysis from ABC News. Add Interest\nWhile visiting his wife's mother about two weeks ago, Mr. Ye was looking through old photographs and saw his wife, Ms. Xue, in Qingdao at the exact same spot on the exact same day -- and there in the background of a picture of her, was him.\nChengdu Shangbao\nYe posted on social media: \"This was my wife on vacation in Qingdao in 2000, I didn’t know her back then, but I was right behind her. This is so amazing, I took a picture at the same place too!\"\nThey visited Qingdao again in 2012 and took a photo together while on vacation, not yet knowing the significance of the location.\nYe later told the local media outlet Chengdu Shangbao that as amazing as their near-meeting was 18 years ago, he remains focused on how well he and Xue are getting along in their marriage, of which she's been very supportive.\nThe couple now has twin daughters and is planning to return to Qingdao one day to take a family photo of all four of them.\nABC News' Kaijing Xiao contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Chinese man realizes he accidentally photobombed wife 11 years before they met",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/chinese-man-realizes-accidentally-photobombed-wife-11-years/story?id=53867136"
}