{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:12:42+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fuber-driving-vehicle-hits-kills-pedestrian-arizona-53853445.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_f9b63d26cee5472d9cf92fe84011a2f5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Uber suspended all of its self-driving testing Monday after what is believed to be the first fatal pedestrian crash involving the vehicles.\nThe testing has been going on for months in the Phoenix area, Pittsburgh, San Francisco and Toronto as automakers and technology companies compete to be the first with the technology.\nUber's testing was halted after police in a Phoenix suburb said one of its self-driving vehicles struck and killed a pedestrian overnight Sunday. The vehicle was in autonomous mode with an operator behind the wheel when a woman walking outside of a crosswalk was hit, Tempe police Sgt. Ronald Elcock said.\nThe woman, whose name hasn't been released, died of her injuries at a hospital.\nUber CEO Dara Khosrowshahi expressed condolences on his Twitter account and said the company is working with local law enforcement on the investigation.\nThe federal government has voluntary guidelines for companies that want to test autonomous vehicles, leaving much of the regulation up to states.\nThe U.S. Department of Transportation is considering other voluntary guidelines that it says will help foster innovation. But Transportation Secretary Elaine Chaos also has said technology and automobile companies need to allay public fears of self-driving vehicles, citing a poll showing that 78 percent of people fear riding in autonomous vehicles\nThe number of states considering legislation related to autonomous vehicles gradually has increased each year, according to the National Conference of State Legislatures. In 2017 alone, 33 states introduced legislation.\nCalifornia is among those that require manufacturers to report any incidents to the motor vehicle department during the autonomous vehicle testing phase. As of early March, the agency received 59 such reports.",
    "source_domain": "abcnews.go.com",
    "title": "Uber suspends self-driving car tests after pedestrian death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/uber-driving-vehicle-hits-kills-pedestrian-arizona-53853445"
}