{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 02:42:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Faustralia-admiral-us-ambassador-south-korea-54707292.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_9e424724983a4da4bafc60e59c4ae8bf_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Adm. Harry Harris, the commander of U.S. forces in the Pacific, will become the next U.S. ambassador to South Korea instead of Australia, the Australian foreign minister said Wednesday.\nForeign Minister Julie Bishop said she had been informed of the decision by Acting Secretary of State John Sullivan on Tuesday.\n\"While we would have welcomed Adm. Harris here as ambassador to Australia, we understand that there are significant challenges for the United States on the Korean peninsula,\" Bishop told reporters in Sydney.\n\"We of course have a very strong and deep relationship with the United States and I am sure they will choose a very appropriate ambassador to take his place in due course,\" she added.\nBishop said Sullivan made it clear a new appointment would be a priority for the next secretary of state.\nPresident Donald Trump nominated Harris in February to become Australia's next ambassador.\nThe United States had not had an ambassador in Australia since John Berry, president of the American Australian Association, left the post in September 2016.\nAndrew Shearer, a former Australian government security adviser and now an adviser on Asia-Pacific security at the Washington-based Center for Strategic and International Studies, said the change of ambassador plans made Australia appear to be a second-class ally of the United States.\n\"Australia really ... is ... a collateral casualty here to the shambolic practices of the Trump Administration,\" Shearer told the Australian Broadcasting Corp.\n\"I don't think there's anything sinister to it. I think it's much more typical of the ad hoc, moment-to-moment decision making if this particular administration,\" he added.\nBishop noted past appointments for U.S. ambassador to Australia took time.\nIn the meantime, Charge d'Affaires Jim Caruso will continue to act in the role.\nOpposition defense spokesman Richard Marles said the sooner Australia got a new U.S. ambassador the better.\n\"We're close friends, I don't think anyone is taking offence,\" Marles told Sky News television.\nFormer government minister and the current Australian War Memorial director Brendan Nelson said while he wouldn't describe it as a snub, the United States should have proper representation in Australia.\n\"I say to President Trump and those who are advising him: we need an ambassador, we deserve an ambassador and we'd like one soon,\" Nelson said.\nFormer deputy prime minister and diplomat Tim Fischer said the delay in appointing an ambassador reflected its low priority in Washington.\n\"Nigh on two years will be an insult with impact, notwithstanding the good work of the acting ambassador in Canberra,\" Fischer said of the absence of an ambassador.",
    "source_domain": "abcnews.go.com",
    "title": "Australia: Admiral to become US ambassador to South Korea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/australia-admiral-us-ambassador-south-korea-54707292"
}