{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:14+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-uk-anti-terror-police-join-probe-substance-56360385.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_f655d99c9dca46babd3598258c33e826_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the major incident near Salisbury, England, in which two people have been left in a critical condition (all times local):\n12:20 p.m.\nBritish police say counterterrorism officers are working with local detectives after two people were sickened by an unknown substance in southwest England.\nThe Metropolitan Police says \"officers from the counter terrorism network are working jointly with colleagues from Wiltshire Police\" on the incident in Amesbury.\nPolice say a man and a woman in their 40s were hospitalized after being found unconscious at a residential building in Amesbury. The town is eight miles (13 kilometers) from Salisbury, where ex-spy Sergei Skripal and his daughter Yulia were poisoned with a nerve agent on March 4.\nPolice say they are keeping an open mind and do not yet know whether a crime has been committed.\n———\n6 a.m.\nBritish police declared a \"major incident\" Wednesday after two people were left in critical condition from exposure to an unknown substance a few miles from where a former Russian spy and his daughter were poisoned with a nerve agent.\nThe Wiltshire Police force said a man and a woman in their 40s were hospitalized after being found unconscious at a residential building in Amesbury, eight miles (13 kilometers) from Salisbury, where Sergei and Yulia Skripal were poisoned on March 4.\nPolice cordoned off the building and other places the two people visited before falling ill, but health officials said there was not believed to be a wider risk.\nThe man and woman were hospitalized Saturday at Salisbury District Hospital, where authorities initially believed they might have taken a contaminated batch of heroin or crack cocaine.\n\"However, further testing is now ongoing to establish the substance which led to these patients becoming ill and we are keeping an open mind as to the circumstances surrounding this incident,\" police said. \"At this stage, it is not yet clear if a crime has been committed.\"",
    "source_domain": "abcnews.go.com",
    "title": "UK anti-terror police join probe into substance",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/latest-uk-anti-terror-police-join-probe-substance-56360385"
}