{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:22:42+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Uber suspended nationwide testing after one of its vehicles struck a woman.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fntsb-probe-deadly-crash-involving-driving-car-53860783.json",
    "image_url": "https://s.abcnews.com/images/WNT/180319_wn_benitez2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for NTSB to probe deadly crash involving self-driving car\nWe learned today of the first deadly accident involving one of those self-driving cars and a pedestrian. Here's ABC's gio Benitez. Reporter: Tonight, Uber suspending its self-driving tests across the country after, police say, one of its autonomous cars hit and killed a woman in Tempe, Arizona. Investigators say it happened late Sunday. 49-year-old Elaine Herzberg was reportedly walking with her bike outside of the crosswalk when she was hit. A human operator was inside the self-driving car at the time. Our investigation did not show, at this time, that there were significant signs of the vehicle slowing down. Reporter: In Arizona, autonomous vehicles are legal, as long as they are registered and insured. While there have been other accidents, including this Tesla crash in Los Angeles in January where no one was injured, this is likely the first pedestrian death involving an autonomous vehicle. Tonight, Uber's CEO echoing the company statement on Twitter, saying they will \"Work with local law enforcement to understand what happened.\" And David, tonight, we've learned the national transportation safety board is sending a team of investigators to Tempe, Arizona, to investigate this crash. David? All right, gio, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "NTSB to probe deadly crash involving self-driving car",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/ntsb-probe-deadly-crash-involving-driving-car-53860783"
}