{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:34:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Fed set to raise rates as Yellen gives final news conference",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ffed-set-raise-rates-yellen-final-news-conference-51719767.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/fed-set-raise-rates-yellen-final-news-conference-51719767",
    "language": "en",
    "localpath": null,
    "maintext": "Investors seem certain about this: The Federal Reserve is going to raise interest rates this week for the third time this year.\nThey're less sure about what the central bank might have in store for 2018, and they will look to Janet Yellen's final news conference as Fed chair Wednesday for any clues.\nWill the Fed's policymaking change once Yellen steps down in February and is succeeded by Jerome Powell? Powell was a Yellen ally who backed her cautious stance toward rate hikes in his five years on the Fed's board. Yet no one can know how his leadership or rate policy might depart from hers.\nWhat's more, Powell will be joined by several new Fed board members who, like him, are being chosen by President Donald Trump. Some analysts say they think that while Powell might not deviate much from Yellen's rate policy, he and the new board members will adopt a looser approach to the regulation of the banking system.\nMost analysts have said they think the still-strengthening U.S. economy will lead the Fed to raise rates three more times next year. A few, though, have held out the possibility that a Powell-led Fed will be compelled to step up the pace of rate hikes as inflation finally picks up and the economy, perhaps helped by the Republican tax cuts, begins accelerating.\n\"While the Fed has been indicating that they will hike rates another three times in 2018, I think Powell will depart from that forecast and the Fed will end up hiking rates four times,\" said David Jones, chief economist at DMJ Advisors. \"That is based on the added growth that will come from the tax cuts.\"\nAt his Senate confirmation hearing last month, Powell impressed his listeners as an evenhanded moderate who favored the kind of incremental stance on rate hikes that both Yellen and her predecessor, Ben Bernanke, embraced. The committee approved Powell's nomination and sent it to the full Senate, where his confirmation is considered certain.\nBesides Powell, Trump has so far chosen two new members for the seven-member board. And he has the opening to nominate three more, including a Fed vice chair. In his view of the Fed, Trump has made clear that he favors low rates. But he has also expressed a desire to pull back on many of the regulations that were imposed on banks after the 2008 financial crisis. Trump and many Republicans argue that those regulations are too burdensome, especially for smaller banks.\nIt was in the midst of the 2008 crisis that the Fed cut its key rate to a record low near zero and left it there for seven years. Eventually under Yellen, the Fed responded to a steadily improving job market and economy by modestly raising the rate — in December 2015, in December 2016 and twice this year. Since June, the policymakers have left rates alone while puzzling over why inflation has slipped farther below their 2 percent annual target.\nThe widespread expectation that the Fed will raise rates three additional times next year — possibly causing higher rates on some consumer and business loans — comes from the Fed's so-called \"dot plot.\" The dot plot, updated quarterly, displays the anonymous projections of individual Fed officials for the path of their benchmark rate as well as for inflation and economic growth. The dot plot, which the Fed will update when its policy meeting ends Wednesday, most recently showed an expectation of three rate increases in 2018.\nIn updating its projections, it's possible the Fed will take account of the likelihood that Congress will pass tax cuts and perhaps cause the economy to accelerate next year. In its latest survey, SIFMA, a lobbying group for the U.S. securities industry, found that 41 percent of its respondents foresee three rate hikes next year, 38 percent foresee two hikes and 17 percent expect four.\nBrett Ryan, senior U.S. economist at Deutsche Bank Securities and chairman of SIFMA's economic advisory group, said his personal forecast was for four hikes because of the boost he expects from tax cuts.\n\"While the tax package is not a game changer, it does add more confidence that the Fed can keep going\" with its rate increases, Ryan said.\nHe suggested, too, that the Fed's evolving committee of board members and regional bank presidents who set rates will tilt slightly toward \"hawkish\" officials — those who tend to worry more about the threat of higher inflation than about the need to further increase employment.\nOn Wednesday, at her final news conference as Fed chair, Yellen may feel at liberty to go further than usual in illuminating the Fed's outlook for the coming months.\n\"I would expect her to be more vocal about her beliefs,\" said Sung Won Sohn, an economics professor at California State University, Channel Islands. \"This could be one of the more interesting press conferences she has given.\"\nOthers said they would be surprised if Yellen diverts from her usual cautious demeanor.\n\"Yellen gets to do a victory lap: She is going out with low unemployment and stronger growth,\" said Diane Swonk, chief economist at DS Economics. \"But with just one month to go in her term, she doesn't want to do anything to undermine Jay Powell.\"",
    "source_domain": "abcnews.go.com",
    "title": "Fed set to raise rates as Yellen gives final news conference",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/fed-set-raise-rates-yellen-final-news-conference-51719767"
}