{
    "authors": [
        "Abc News",
        "More Kelly"
    ],
    "date_download": "2018-07-04 09:47:08+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "A festive take on a classic summer sangria recipe that is perfect for July 4 from lifestyle blog Heart and Seam.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FLiving%2Fstar-spangled-sangria-perfect-4th-july%2Fstory%3Fid%3D56343736.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/sangria4-ht-ml-180703_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Happy Fourth of July! Celebrate Independence Day with this fruity star-spangled sangria from lifestyle blog Heart and Seam.\nFrom fashion and beauty to wellness and recipes Heart and Seam founder Janet Cooke shares real-life experiences on her blog from her home in New Hampshire -- including her festive and tasty summer sangria recipe.\nHeart and Seam Lifestyle Blog\n\"This is a fun festive spin on a classic sangria recipe,\" Cooke told \"GMA.\" \"The best part about this recipe is that you can make it in large batches so it's perfect for a Fourth of July cookout where there will be lots of family and friends to enjoy.\"\nCheck out the full recipe and pour this red, wine and blueberry beverage all day for friends and family.\nHeart and Seam Lifestyle Blog\nIngredients\n1 bottle red wine (I like Pinot Noir or Shiraz)\n1-1/2 cups cranberry juice\n1 cup brandy\njuice from one large orange\n2 cups fresh blueberries\n8 ounces fresh strawberries cut in quarters\nClub soda\nDirections\nTo a large pitcher add wine, cranberry juice, brandy and orange juice.\nAdd blueberries and strawberries. Chill for a few hours.\nTo serve, fill glasses half full with ice and use a slotted spoon to add fruit from the pitcher to each glass. Pour liquid over ice and fruit, top with club soda and serve.\nTips\nAdd raspberries, blackberries and even apples to create even more of a festive drink.\nBe sure to add the ice to the glasses and not the pitcher itself. You will dilute the sangria if you add directly to the pitcher.",
    "source_domain": "abcnews.go.com",
    "title": "Star-spangled sangria perfect for the 4th of July",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Living/star-spangled-sangria-perfect-4th-july/story?id=56343736"
}