{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 12:47:54+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Stocks Start 2017 With Gains, but Many Markets Stay Shut",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fstocks-start-2017-gains-markets-stay-shut-44509508.json",
    "image_url": "http://abcnews.go.com/International/wireStory/stocks-start-2017-gains-markets-stay-shut-44509508",
    "language": "en",
    "localpath": null,
    "maintext": "Global stocks rose on the first day of 2017, though trading volumes were thin as many major markets observed New Year's holidays.\nKEEPING SCORE: Germany's DAX was up 0.8 percent at 11,574 and France's CAC 40 was 0.4 percent higher at 4,883. Italy's FTSE MIB was up 1.5 percent at 18,520, though trading was still suspended in the shares of Monte dei Paschi di Siena, the bank that is due to get a government bailout. Britain's FTSE 100, which closed at a record high on Friday, remained closed.\nUPBEAT DATA: Markets were buoyed by a report showing the manufacturing sector in the 19-country eurozone grew at the fastest rate in 68 months in December. The so-called purchasing managers' index rose to 54.9 points from 53.7 points in November. Also helping sentiment was a report published Sunday showing that China's manufacturing sector continued to expand in December, though at a slightly slower pace than the month before.\nANALYST TAKE: \"While the eurozone seems to have ended 2016 on the up in economic terms, we are concerned that GDP growth could be increasingly hampered in 2017 by political uncertainties,\" said Howard Archer, global economist at IHS Markit. Those uncertainties include Britain's formal start to talks to leave the European Union and elections in France and the Netherlands, where far right parties that favor leaving the euro are expected to do well.\nHOLIDAY IMPACT: Trading was slow as many markets were closed to observe the New Year's holiday. Besides Britain, markets were closed in Japan, China and Hong Kong and were due to remain shut in New York. Of those that did trade in Asia, India's Sensex ended the day 0.1 percent lower at 26,595.45 while South Korea's KOSPI was flat at 2,026.16.\nCURRENCIES: The dollar started the new year with broad gains in currency markets. It was at 117.30 yen, up from 117.00 the previous day. The euro was trading at $1.0477, from $1.0443.\nTrading in several commodities, including crude oil, was closed on Monday.",
    "source_domain": "abcnews.go.com",
    "title": "Stocks Start 2017 With Gains, but Many Markets Stay Shut",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/stocks-start-2017-gains-markets-stay-shut-44509508"
}