{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2018-05-30 22:58:35+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The illegal process includes shoving a pipe-like object down the throat to damage the vocal cords.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2F15-dogs-seized-unlicensed-breeder-illegally-debarked-animal%2Fstory%3Fid%3D55538616.json",
    "image_url": "https://s.abcnews.com/images/US/dogs-01-as-ht-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "More than a dozen dogs have been seized from an unlicensed breeder in Pennsylvania after animal officials received word that dogs there were being illegally debarked.\nOfficers from the Pennsylvania SPCA removed 15 dogs from the breeder in Lancaster County on Thursday after a \"concerned citizen\" alerted staff on the tip line, Gillian Kocher, director of the Pennsylvania SPCA's public relations, told ABC News.\nThree adult dogs -- a Siberian Husky named Rosella and two Doberman Pinschers -- were found to have undergone the procedure, which involves pushing a pipe or long object down the dog's throat \"multiple times to damage the vocal cords,\" Kocher said. The person who alerted the Pennsylvania SPCA had voiced concerns that the adult female husky had recently been debarked, according to a press release.\nPennsylvania SPCA\nThe two Doberman Pinschers hat been debarked \"sometime in the past,\" according to the Pennsylvania SPCA.\nPennsylvania SPCA\nDebarking, or devocalization, is illegal in the state of Pennsylvania \"for any reason unless the procedure is performed by a licensed veterinarian using anesthesia,\" the release states.\nIn addition to the dogs that had been debarked, officers confiscated an adult Doberman Pinscher, an adult German Shepherd, and 10 puppies, including seven weeks-old Doberman Pinschers and a 3-month-old Siberian Husky puppy. The adult German Shepherd was found to be pregnant.\nPennsylvania SPCA\nPennsylvania SPCA\nThe dogs are in PSPCA's custody and will be placed in \"loving homes or partner rescues\" after they receive medical attention.\nThe PSPCA is investigating and plans on pressing charges, it said.\n\"The manner in which these dogs were devocalized is concerning on many levels, not the least of which is that it is illegal,” said Nicole Wilson, PSPCA Director of Humane Law Enforcement. \"These animals were debarked because it was a nuisance, and the inhumane manner in which the act was carried out can carry a felony charge. We will continue our investigation and press charges to the fullest extent allowed by the law in an effort to ensure this never happens again.\"",
    "source_domain": "abcnews.go.com",
    "title": "15 dogs seized from unlicensed breeder after 3 were illegally debarked, animal advocates say",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/15-dogs-seized-unlicensed-breeder-illegally-debarked-animal/story?id=55538616"
}