{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 02:56:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Kevin Durant says Warriors 'work extremely well together,' but aren't a superteam",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fkevin-durant-warriors-work-extremely-superteam%2Fstory%3Fid%3D48047187.json",
    "image_url": "http://abcnews.go.com/Sports/kevin-durant-warriors-work-extremely-superteam/story?id=48047187",
    "language": "en",
    "localpath": null,
    "maintext": "OAKLAND, Calif. -- On Wednesday during exit interviews, Kevin Durant dismissed the notion that the Golden State Warriors are constructed as a superteam. In making his point, he directed attention to the organization's drafting prowess and recruiting targets rather than just focusing on the fact that the team has four All-Stars in himself, Stephen Curry, Klay Thompson and Draymond Green.\n\"First of all, if everybody wanted Steph, he would have been the No. 1 pick,\" Durant said. \"A lot of people passed on him. A lot of people doubted Steph, saying he wasn't going to be this good. Klay Thompson, he was just supposed to be this OK shooter in the league, like that's what you thought of Klay Thompson when he came in. Draymond, nobody wanted him. He was a 6-5 power forward. [They said] he couldn't play in the league, he couldn't start in the NBA. Shaun Livingston had a crazy knee injury.\n\"Nobody wanted him. Nobody thought that he would get back to being Shaun Livingston. Andre Iguodala, he got traded a couple of times. Nobody wanted him. A lot of people didn't expect these guys to be where they are today. Superteam? No, we just work extremely well together. Coach puts us in position to maximize our strengths.\"\nCleveland Cavaliers superstar LeBron James also took exception to the superteam moniker. After the Game 5 loss in the 2017 NBA Finals, he stated that he was never a part of a superteam.\n\"I don't believe I've played for a superteam,\" James said. \"I don't believe in that. I don't believe we're a superteam here.\"\nGolden State has a cumulative 207-39 record in the last three regular seasons. In his lone season with the team, Durant said it's the selflessness that stands out to him. He cited that, not just their talent, in explaining why the Warriors are so successful.\n\"We make each other better and it's not about who gets the credit,\" Durant said. \"It's like, really just about having fun playing ball and let's see how we can win together and that alone just helps the ego. So, sorry I went on a little rant, but that's how I feel about the team. A lot of these guys beat the odds and came out and played a great brand of basketball and put the team first. That should be rewarded, and it did get rewarded with a championship.\"",
    "source_domain": "abcnews.go.com",
    "title": "Kevin Durant says Warriors 'work extremely well together,' but aren't a superteam",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/kevin-durant-warriors-work-extremely-superteam/story?id=48047187"
}