{
    "authors": [
        "Abc News",
        "More Mark"
    ],
    "date_download": "2018-07-04 07:59:04+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The girl was swimming when she was bit by something.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fgirl-injured-apparent-shark-attack-myrtle-beach%2Fstory%3Fid%3D56358220.json",
    "image_url": "https://s.abcnews.com/images/US/shark-attack-incident-ugc-mo-20180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A girl swimming at a popular resort town in South Carolina was injured in what was an apparent shark attack on Monday.\nCristy Torres, who was at Myrtle Beach, South Carolina, on Monday celebrating her husband's birthday, filmed video of the girl being treated for a bite wound on her leg. The video, shared on Torres' Facebook page had been viewed over 1.6 million times early Wednesday.\nMyrtle Beach Fire Rescue wasn't able to confirm whether it was a shark attack, but said the girl was transported to the hospital for a \"marine-life incident\" at around 2:55 p.m. on Monday.\n\"All of a sudden we see a family screaming for help,\" Torres told ABC News in an interview Tuesday. \"Nobody was doing anything so we all looked around and then they all started running back to shore. \"That's when I heard, 'Someone's been bitten by a shark, someone's been bitten by a shark.' I told my husband that someone was bitten by a shark. I saw the family, they started screaming, 'Shark, shark.'\"\nTorres said she ran over to where the girl had come out of the ocean with her family, which is when she began filming. The girl was immediately attended to by lifeguards and had the wound wrapped.\n\"I glanced [in the water] real fast, I saw a tip of a fin,\" Torres said. \"I couldn't tell if it was big or small.\"\nCristy Torres\nMyrtle Beach is a popular tourist destination, but not unfamiliar with shark sightings. A blacktip reef shark was filmed swimming on June 5 in the same location where the girl was apparently bitten on Monday. The video was shared with Durham, North Carolina, ABC affiliate WTVD by Nicki Welch-Hudson.\n\"I'm hoping that tourists seeing the video will respect our oceans a little more,\" Welch-Hudson said. \"I heard lots of people on the beach attempting to say the shark wasn't dangerous, one man even said he would jump in and 'punch the shark,' that angered me of course.\"\nThe water was cleared by lifeguards during that incident.\nBlacktip sharks, bull sharks and tiger sharks are all common to the South Carolina coast, according to the South Carolina Department of Natural Resources, and can all pose a threat to humans in coastal areas.\nABC News' Rachel Katz contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Girl injured in apparent shark attack at Myrtle Beach",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/girl-injured-apparent-shark-attack-myrtle-beach/story?id=56358220"
}