{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:41:44+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "George Stephanopoulos' wife dishes on her new book \"Go Ask Ali,\" which is about some of the unsolicited advice she gives out.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fvideo%2Fali-wentworth-opens-book-gma-54679972.json",
    "image_url": "https://s.abcnews.com/images/GMA/180424_gma_breakfast1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Ali Wentworth opens up about new book on 'GMA'\nSo evil about this how much you love how uncomfortable I am. You should feel the tension up on this table right now in not for us. All because my wife Ali wenworth is about to come out. Brand-new book \"Go ask Ali.\" Please welcome Ali wenworth. Hi. Hi. It's been too long. I know. I know. Hi, gorgeous. Hollow. Good to see you. Good to see you. Have a seat. Oh, the gang is all here. All is right in the world. The girls are wearing bright colors. Happy spring. Happy spring. I get to kick this all off. Oh, good lord. Yeah, that's right. Because this is a serious question because this is Ali's fourth or fifth book. Way to know me. It's my fourth. Well, it depends if you count the cookbook. Before -- Great start. This is going well. Every other book I'm allowed to read the chapters as they're being written. Yeah. I saw this one in hard cover. Oh, we're going to do this on national television? It's a very -- it's a very simple thing. We need to for our marriage to work, we need to stay in our lanes, right? So I don't need you reading a galley and going, you know what would be really funny, right? You don't do -- I don't say you should ask Comey would he go for Betty or Veronica. So you do your thing and I'll do mine. George, I'm going to save you. I'll ask a question now. But it does work for you. You guys have been married 16 years. Yes. 16 years. And you guys, \"People\" magazine, I opened it and read -- this is the only thing I read in that whole magazine. Well, thank you, Michael. I was so interested. You say you guys are happily married. What is the secret? Oh. What is the secret? I'm always right and he's always wrong. I think -- I think it's hard for him in some ways because I'm a lingerie model and I'm all about, you know, being sexy and -- but he's very smart. Sometimes. Although I had to write all his Comey questions and he didn't know where the Middle East was until I showed him on the map but -- no, I think humor. I think we have -- we are hot for each other. I think that helps. We did read about that. Yes. We had a whole segment on \"Gma\" -- By the way, there's nothing wrong with that. Chris rock said you're a married couple and you have an active physical life. That's a great thing. I am not ashamed of it. There's nothing to be ashamed of. There's nothing to be ashaped. 8:30 across the country. You do handle things differently like the rocky flight. Rocky flight you all had. Yes, we were flying to nantucket and there was a lightning storm and the plane was literally going and my daughter -- we all thought we were going to die. I was trying to calm everybody down the back of the plane but when you dip very quickly, I would say, we're going to die! No, we're good. We're good. So I just see his back the whole time and I thought, well, he's -- he's probably totally freaked out so I threw a pen at the back of his head and nothing happened. Not threw. You speared a pen. I darted a pen then I realized he was meditating while we were going down. Meditating -- would I do downward facing dog on a runaway train? No. I was like where is -- where are the life jackets, where are the things? He's meditating. We're here today. Oh, you're so zen. I get it. But, Ali, you do reveal in the book, maybe why she didn't want you to see it that you're fully -- you come clean you have a boyfriend. Ooh. I do. Well, let's be honest that's a secret to a great marriage. I think that petco should have a peri-menopause adoption day because I don't know why women, you know, after years of marriage go out and have an affair or do rejuvenation, get a dog. Get a dog. You have dogs. You have dogs. Yes. They are -- it's unconditional love. This is the love -- the other love of your life. That George calls my boyfriend. He is your boyfriend. He is. As soon as George levers in the morning, guess who gets in bed with me. Doesn't ask for anything. Really. He gets canned food. I wish I could just give George canned food. All joking aside I really believe that. Oh, my god. I think in our senior years it's nice to have a dog. Unconditional love. Unconditional love. He doesn't lick my face. Like why do you think -- people do come to you for advice. What do you think it is about your -- It's mostly because of my chocolate chip cookie dough. I'm not going to lie but I think somehow I have pretended to be some kind of therapist in a way and so people -- I'm not saying it's good advice but they come over. And I sort of, you know, make things up and they sound kind of interesting but this is not a dear Abby book. This book is based on all the mistakes I've made so I'm trying to save you from making a lot of the mistakes I've made. Which I'm sure he could write a trilogy about. But starting with this morning, but it's more about that. It's more about, you know, then there's cautionary tales like I have had three friends that have lost their husbands to the sexy baby-sitter. And my feeling is, don't hire a hot baby-sitter. You know. You don't -- you don't go to a bakery when you're on a diet, right? I just don't understand that. Basic advice that you give us, that's why we ask you, Ali. It's basic but people don't always get it. That's why we had a file pinot with no teeth who is 93 years old. I don't need that in my house. Now we thought we'd put your skills to good use. I'm speechless over here. Which skills are we talking about. Your advice skills. We have some audience members here and have questions. We'll art out with amber in the front row. Hi. Hi. So, my husband -- My husband refuses to help with the laundry. Your husband refuses to help with the laundry. How would you recommend I go about getting him help a little bit more? He does it a lot. He better make up for it in other areas like he should know how to build a bench or paint a bathroom or change a lightbulb would even be great. Does he do any of that stuff? He does. Okay. All right. You're doing great. So don't -- at least you get a machine. I have to go to the rocks and do it. You're luckier than most people. I guess perspective. And Laura. Hi, Ali. How are you? I'm good. Good. I recently found out my son has a secret Instagram account. How can I handle that and still be the cool mom? Oh, don't get me started on Instagram. Don't get me started. Because our girls are on Instagram and has to be private. Is it private? Yes. What's on it? Is it dirty or -- Is it finsta? George said is it finsta. Basically you have to say to him, everything you put out there in the ether is always going to be out there. Colleges look at social media. That's what scared our kids. Our daughter was like, what? I was like, yeah, social media, they look at everything. So no more click, let me see if it's a mole. None of that. I would scare -- I like a scare tactic, you know, like, you know, my kids' sex education, we show a photo book of STDs and that scares them. I like it. This is all very good advice. Very good advice. You never disappoint, Ali wenworth. Thank you. Never. . That's what he said. And, George, I was supposed to read this but I don't think I can. \"Go ask Ali\" everywhere today and all of the audience, you all\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Ali Wentworth opens up about new book on 'GMA'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/video/ali-wentworth-opens-book-gma-54679972"
}