{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:51:31+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "No-frills grocer Lidl to open first US stores this summer",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ffrills-grocer-lidl-open-us-stores-summer-45508473.json",
    "image_url": "http://abcnews.go.com/US/wireStory/frills-grocer-lidl-open-us-stores-summer-45508473",
    "language": "en",
    "localpath": null,
    "maintext": "Lidl, the German no-frills supermarket chain, is opening its first wave of stores in the U.S. this summer ahead of schedule, with plans to open up to 100 locations across the East Coast within a year.\nThe details of the expansion, announced Wednesday, come as Wal-Mart and traditional grocery chains already are seeing a stronger threat from German low-priced retailer Aldi, which has been aggressively expanding. Both offer low prices by focusing on store-label products rather than name brands. Aldi has also been adding items to include gluten-free products and fresh produce.\nLidl's first 20 U.S. stores will be opening in North Carolina, South Carolina and Virginia, where the company established its first U.S. headquarters in 2015. Originally, it planned to open its first batch of U.S. stores no later than 2018. Lidl operates about 10,000 stores in 27 countries.\nBoth Lidl and Aldi have been aggressively expanding in Europe. In the United Kingdom, a fierce price war has hurt Wal-Mart's Asda business as well as traditional local retailers.\nAldi, which opened its first store in the U.S. in 1976, now has more than 1,600 stores in the U.S. and plans to increase that to nearly 2,000 by the end of 2018. It announced earlier this month that it's spending $1.6 billion on remodeling more than 1,300 of them.",
    "source_domain": "abcnews.go.com",
    "title": "No-frills grocer Lidl to open first US stores this summer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/frills-grocer-lidl-open-us-stores-summer-45508473"
}