{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:14:49+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Who should win NFL awards for 2016? Here's a guide",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fwin-nfl-awards-2016-guide%2Fstory%3Fid%3D44512271.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_nfl_mvp_poll_576x324_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With the NFL regular season over, it's time for all kinds of important activities to begin.\nNFL teams couldn't even wait until the day after the season to start firing coaches, but that will happen (officially) Monday. The playoffs are just five days away, but neither the Raiders nor the Texans have any idea who will be starting for them under center when the postseason kicks off Saturday.\nOne other important project: awards balloting. The NFL and The Associated Press will hand out their picks for several important trophies during the annual NFL Honors ceremony the night before the Super Bowl, but we're not going to wait. Now that all the action under consideration for these awards is in the books, let's hand out a few statues for the 2016 season.\nFor context, here are my? quarter-season and midseason?awards columns. This one operates the same way: I'm picking the player who I think deserves the award given the typical way the electorate treats the voting, even if it's not the most logical way to vote for an award or the player who I think is most likely to actually win the award in the real balloting. In other words, even though I don't understand how a quarterback who wins MVP can't also be the Offensive Player of the Year, I'm keeping those awards separate.\nWith the ground rules in place, here are my picks:\nComeback Player of the Year\nInjuries that were seen as career-threatening or even career-ending in years past are beginning to look survivable. A 34-year-old coming off a torn Achilles such as Wake might have been left on the scrap heap in years past. Instead, Wake finished with 11.5 sacks and 24 quarterback hits, while Terrell Suggs was useful after suffering his second Achilles injury. Gordon made it back from a disappointing rookie year and a microfracture procedure on his knee to serve as the workhorse of an injury-riddled Chargers offense (until he went down again in December). And both Graham and Victor Cruz recovered from patella injuries, with Graham returning and producing 100-yard games less than a year after he went down in the end zone in Seattle.\nTorn ACLs aren't quite as devastating as those other injuries were in 2016, and Nelson had a full year to recover after tearing up his knee during the 2015 preseason, but he has been remarkable this season. His 2016 numbers -- 97 catches, 1,257 receiving yards, and a league-best 14 receiving touchdowns -- aren't far off from the 98/1,519/13 line he posted in 2014. If anything, Nelson would be expected to decline given the typical receiver aging curve and the fact that he's now in his age-31 season, so he's outperforming what we would have expected from him even if he hadn't suffered an injury. Comeback might be the wrong word: It's like Nelson never left.\nWinner: Jordy Nelson\nDefensive Rookie of the Year\nThis is really a two-person race to me. Apple, Neal and Ngakoue have each been useful for their respective teams, with Apple notably pushing Dominique Rodgers-Cromartie out of the starting lineup, but they're in a second tier alongside the likes of Artie Burns, Karl Joseph?and DeForest Buckner. It's a big group of players who haven't been consistent, haven't been healthy, and/or haven't put together Pro Bowl-caliber stretches of play for lengthy periods of time.\nThere are two rookies who have looked like two of the better players in football at their respective positions for most of 2016. Ramsey hasn't gotten much hype by virtue of playing for a struggling Jaguars team, but outside of producing takeaways, he has been quite good. The fourth overall pick has shown the ability to primarily play outside but also hold up in the slot while mostly guarding the opposing team's No. 1 wide receiver, a feat that very few cornerbacks in the league pull off. That sort of skill set puts Ramsey in a group with players like Chris Harris Jr. and Patrick Peterson, even if he's not quite on their level yet. Even more impressively, Ramsey has been great as a rookie at a position where even the best veterans often struggle during their debut seasons. Teams are already avoiding him when the Jags do play sides in lieu of sticking Ramsey on the other team's best guy.\nRamsey also gets credit for playing a full 16-game season, whereas his counterpart in this race, Bosa, suited up for only 12 contests. While Ramsey has had the occasional stinker, though -- Jacksonville's ugly loss against Tennessee on national television comes to mind -- Bosa has pretty much been one of the best pass-rushers in football from the moment he stepped onto the field. In those 12 games, he has produced 10.5 sacks and 21 quarterback hits, which is in line with what Chandler Jones (11 sacks, 21 hits) produced in 16 games. Watch what Jones gets in free agency this offseason and remember that Bosa is locked up for the next three years at just over $21 million with a team option attached.\nI'll give the nod to Bosa here because his impact has been more tangible. The Chargers were fifth in pass-defense DVOA heading into Week 17 despite giving Eric Weddle away in free agency and losing starting cornerbacks Brandon Flowers and Jason Verrett for most of the season. San Diego has received a great season from free-agent acquisition Casey Hayward, and Melvin Ingram?has?had a productive contract year across from Bosa, but the rookie is the one who stands out on a weekly basis. He's arguably the biggest building block on a frustrating but promising Chargers team heading into 2017.\nWinner: Joey Bosa\nOffensive Rookie of the Year\nIt's hard to think of a rookie class more productive on offense in recent years than this one, and that's without even getting to Jordan Howard, Taylor Decker?or Carson Wentz. Thomas became arguably the focal point of the Saints' offense when he was healthy from Week 12 on, during which he averaged over 91 receiving yards per game and was thrown the ball on 24.2 percent of his routes, a figure topped by Julio Jones alone among wideouts. Conklin played at a Pro Bowl level during his debut season as a right tackle. And Hill's 95-yard punt return on Sunday gave him eight touchdowns of 30 yards or more this season, a figure topped by only 10 players since the 1970 merger.\nAnd yet we all know this award is coming down to Zeke vs. Dak. There's no wrong choice in picking between Dallas' two star rookies. Neither did much in the Cowboys' meaningless Week 17 game against the Eagles. Prescott threw eight passes on Dallas' first two possessions before giving way to Tony Romo, while Elliott was active but never stepped onto the field. We have to judge them on their first 15 games. Each benefited from both the incredible Dallas offensive line and the presence of each other; the threat of Prescott as a runner helped keep backside defenders at bay and created cutback lanes for Elliott, while Elliott's success created throwing lanes and play-action opportunities for Prescott. Dak posted the league's second-best QBR (89.5) on play-action passes.\nI don't think there's a fair way to really compare the two to each other. They each had their worst game of the season in one of Dallas' two competitive losses, both to the Giants. Elliott was a mess during Dallas' season-opening loss, carrying the ball 20 times for just 51 yards in a 20-19 defeat. It was perhaps more telling that Zeke put together a typically effective performance (24 carries for 107 yards) against the Giants in Week 14 and the Cowboys still scored only seven points because Prescott had his worst game of the season, but that's weirdly giving Prescott credit for having a disappointing performance.\nInstead, we have to really gauge their abilities by comparing Prescott and Elliott to the competition at their respective positions. A tie here or anything close would go to Prescott, given the positional value of playing quarterback, so Elliott has to be notably ahead of his backfield mate. I compared Elliott to David Johnson earlier this season in a comparison I'll touch on again in a moment, and Le'Veon Bell is also in the discussion for best running back in football. They all have similar levels of volume in terms of overall touches, but Zeke has been the most efficient back of the three as a runner. He's third in the league in yards per attempt among guys with 200 carries or more and led the league among those same players in terms of success rate heading into Week 17.\nPrescott, too, is one of the best passers in football on a rate basis. He finished the year third in passer rating (104.9), fourth in yards per attempt (8.0) and third in opponent-adjusted QBR (81.6), ranking behind only? Matt Ryan and Tom Brady for most of that stretch. Any perception that he slowed late in the season really amounts to a two-game blip against the excellent defensive lines of the Vikings and Giants; he was third in the league in QBR during Weeks 15 and 16, completing a ridiculous 83.9 percent of his passes while averaging 7.4 air yards per throw.\nThe problem for Prescott with these awards is volume. Elliott got the rock as much as any back in football this season. Prescott was hyperefficient when he did throw the ball, but he finished the season 24th in the league in number of dropbacks and 23rd in pass attempts. Prescott did run the ball 56 times, which helps, but 15 of those runs were kneeldowns. It's not Prescott's fault the Cowboys were winning, but these are awards based on production more than anything else. The difference in workload is enough to push the second-most-difficult award to judge toward Dallas' star running back.\nWinner: Ezekiel Elliott\nCoach of the Year\nBill Belichick , Patriots; Jack Del Rio, Raiders; Jason Garrett, Cowboys; Adam Gase, Dolphins; Dan Quinn, Falcons\nFuture generations are going to look back and wonder how Bill Belichick won Coach of the Year only three times in 17 seasons given what he has accomplished during his run in New England. Keep in mind that he didn't win the award in 2001 after he took a team with a then-unknown Brady to an 11-5 record and the AFC East crown, with the electorate instead handing the award to Dick Jauron of the 13-3 Bears in a move that has not aged well. We simply take Belichick and New England's success for granted, even in a season in which Brady was suspended for the first month.\nBelichick did get Brady for 12 games, though, and that's a huge reason the Patriots were so successful. And while the turnaround produced by Del Rio has been remarkable, can it really be more impressive than what Garrett has done in Dallas? The Cowboys lost their starting quarterback indefinitely during training camp, and his backup, and had to turn to a rookie fourth-round pick in Prescott, a move with few parallels and precious little likelihood of succeeding without a dominant defense. Rod Marinelli's defense has exceeded expectations, but Garrett had a quarterback the league valued as a midround pick and got him to play like a superstar basically from Day 1 of his rookie season. The list of quarterbacks taken in the third round or later who posted above-average numbers as a starter during their rookie season since the merger includes two names:? Russell Wilson and Dak Prescott.\nCould Belichick have gone 13-3 with Jimmy Garoppolo as his quarterback? Possibly -- maybe even probably. He didn't have to, though. Garrett had to succeed with an unknown at the most important position in the game and exceeded everyone's wildest expectations. That's enough to make him Coach of the Year.\nWinner: Jason Garrett\nDefensive Player of the Year\n: Vic Beasley, DE, Falcons; Landon Collins , S, Giants; Aaron Donald , DT, Rams; Khalil Mack , DE, Raiders; Von Miller , LB, Broncos\nMiller was the shoo-in candidate for this award a month ago, but he has gone quiet during Denver's frustrating final quarter of the season. The Super Bowl 50 MVP had 13.5 sacks and 22 quarterback knockdowns through 12 games and finished the year with ... 13.5 sacks and 24 hits. It's the first time Miller has gone four games without a sack in his career, and the first time he has gone as many as three games without one since his rookie campaign in 2011. Miller's quiet quarter opened the door for somebody else to claim the prize.\nDid anybody else grab the brass ring, though? Many of the top DPOY candidates had modest Decembers. Mack, arguably the most disruptive pass-rusher in football when he's on his game, had 10 sacks with a quarter of the season to go and produced just one over the final month. Collins, who had stuffed the stat sheet all season, had just one fumble recovery over the final month of the year, along with a sack and two quarterback knockdowns that he registered Sunday. Donald had six quarterback knockdowns over the last four games but just two sacks and two tackles for loss.\nThe pass-rusher who stood out the most over the final month of the season was Beasley, who built on a disappointing, injury-affected 2015 with a stunning 2016 season. He finished with a league-high 15.5 sacks and feasted over the final four games, racking up five sacks, including a forced fumble. Three of those sacks came against Jared Goff, who seemed to magnetically attract pass-rushers (he posted an absurd 11.2 percent sack rate), but the sacks count just as much.\nBeasley tied with Bruce Irvin for the league lead with six forced fumbles this season, suggesting his sacks were more disruptive than the typical player's takedowns, but he was also relatively anonymous outside of those sacks. Despite his 15.5 sacks, he knocked the quarterback down just 16 times all season, which owes to the idea that he was stripsacking the passer without knocking him to the turf and was also very lucky in terms of timing. Just looking at edge-rushers with 10 or more knockdowns this year, a typical one turns a little under 45 percent of his hits into sacks. Beasley was at 97 percent, with nobody else in football above 75 percent.\nThere's nothing wrong with Beasley turning basically every one of his pressures into sacks, but it does suggest his sack total inflates his perceived impact on the game. A typical pass-rusher with 15.5 sacks will have another 20 plays in which he knocks down the opposing quarterback as he makes the throw, likely forcing an incompletion or even a possible interception. Beasley doesn't have many of those plays this season. Because of that, although Beasley comes close, Miller still sneaks this one out for me.\nWinner: Von Miller\nOffensive Player of the Year and Most Valuable Player\n: Tom Brady, QB, Patriots; Derek Carr , QB, Raiders; Ezekiel Elliott, RB, Cowboys; David Johnson, RB, Cardinals; Aaron Rodgers , QB, Packers; Matt Ryan, QB, Falcons\nOne of these six players will be my MVP, so the Offensive Player of the Year category here stands, as usual, as basically a runner-up trophy. ( Cam Newton was a rare exception to this last year, and if the NFL's MVP award winner continues to win Offensive Player of the Year, I'll start changing the way I think about this award.) Let's start with this group of six and see who we end up with by process of elimination.\nLet's start with the running backs. Bell misses out here because he was gone for three games and his numbers don't compare; he has arguably been better than Zeke or Johnson on a per-game basis, but this is about cumulative impact, and missing games counts against a player. He's 190 yards from scrimmage and nine touchdowns short of Johnson's numbers. Elliott sat out in Week 17, which would have made it harder to gauge him versus Johnson, but Johnson promptly suffered a knee injury in the first quarter of Arizona's season finale that thankfully does not appear to be as serious as it seemed at first glance.\nI compared Elliott to Johnson in December, pointing out how Johnson's work as a receiver makes up the difference between the two as a runner. Here are the updated numbers comparing the two through the end of the regular season (and while Zeke sat out the final game, Johnson?missed most of it, too):\nAt the very least, Elliott and Johnson are in the same ballpark. Given how Elliott enjoys the best offensive line in football while Johnson has been working with an injury-riddled set of blockers, I would suggest Johnson has been the better back. In either case, it takes a truly special season from a running back jumping out of the pack to claim this hardware over a quarterback, and neither Elliott nor Johnson fit. They both drop out of the running here.\nWe're left with four quarterbacks, three of whom offer precious little value with their legs. Brady ran for 10 first downs this season, which is helpful, but that's about as many on a prorated basis as Ryan's 13. Neither of them come close to Rodgers and his 25 first-down runs. (Carr had five such runs.) We can give Rodgers a bonus for his mobility, but this is almost exclusively going to be a passing analysis. Let's compare their numbers:\nCarr, unfortunately for Raiders fans who miss him dearly right about now, is the easiest person to wipe from the voting. His numbers pale in comparison to the rest of the group's, and while he deserves credit for producing seven fourth-quarter comebacks and game-winning drives this year, he's one behind Matthew Stafford in each category, and Stafford is not receiving much MVP support. ( Not anymore, at least.) It's also tough to build the case around Carr coming up with big moments in the clutch when he had his worst game of the season against the Chiefs in that critical \"Thursday Night Football\" matchup in Week 14. Carr was also pressured on just 19 percent of his dropbacks, the second-lowest rate in football. He had an excellent season, but it's hard to really make a case that he's the best of these four quarterbacks.\nThe next person to remove from the list is tougher. Brady's candidacy is hardly anything surprising, but he has the most obvious flaw to overcome, having missed a full quarter of the season thanks to his suspension. As a result, he's way behind in terms of volume; Rodgers has thrown 178 more passes than Brady and produced 874 additional yards along with 12 more touchdowns. Brady is even further behind Ryan, who has 1,390 additional passing yards and 10 more touchdowns.\nInstead, the argument for Brady has to revolve around the idea that he's been better on a snap-by-snap basis than the other quarterbacks. It's true that he has protected the football, throwing 28 touchdowns and just two picks, the best touchdown-interception ratio in league history, but that stat seems less impressive when you remember Brady is breaking a record held by Nick Foles. Brady's 0.5 percent interception rate is also great, but the difference between his interception total and that of Rodgers (seven) over a 610-pass season is four picks. Is that really enough to make up the gap between Brady and the, um, bunch?\nPro-football-reference.com found that the \"value\" of a typical interception in terms of field position is about 45 yards and built a formula called adjusted yards per attempt (AY/A) to account for that figure. The value of a passing touchdown by this same measure is 20 yards. After filling in those values, Rodgers' typical pass has been worth an average of 8.1 AY/A. Brady is well ahead of him, at 9.3 AY/A. And Ryan is lapping them both, at 10.1 AY/A.\nTo be honest, this is where it gets hard to build suspense for the MVP vote. I don't really see a strong argument for either of the other quarterbacks to win over Ryan. Ryan has been more effective than Brady on a per-play basis by every metric besides interception rate and has done so while throwing 102 more pass attempts. Ryan also has played the league's toughest schedule of opposing defenses. Patriots fans may want to cling to the game-losing pick-two Ryan threw against the Chiefs, but there's more to quarterback play than avoiding interceptions. Brady has been brilliant, but Ryan has been more efficient, even while Julio Jones was on the sideline.\nAs for Rodgers, while there may be voters who see the future Hall of Famer putting the Packers on his back with his \"run the table\" comment and subsequent brilliant form, Ryan has been every bit as good over the same time frame. The Packers started their six-game winning streak that gave them the NFC North title in Week 12. Atlanta went 5-1 over that same stretch. Here's how Ryan and Rodgers performed over that span:\nRyan doesn't have the sexy 15-0 touchdown-interception ratio, but he has matched Rodgers stride for stride by creating more big plays on offense. And over the first 11 weeks of the season, Ryan blew Rodgers away:\nAs I wrote in December, the Falcons quietly have one of the best offenses in recent memory, including what is likely the best first-down offense in NFL history. Nobody in the league has been better at getting chunks of yardage than Ryan, who has enjoyed playing behind the only line in football to make all 80 starts uninterrupted this season. The voters may fall for two of the game's biggest icons, but the evidence -- all apologies to the Cowboys' offensive line -- suggests that Ryan is the clear choice for 2016 MVP. I'll throw Rodgers a trophy for his furious end to the campaign.\nOffensive Player of the Year winner: Aaron Rodgers\nMost Valuable Player winner: Matt Ryan",
    "source_domain": "abcnews.go.com",
    "title": "Who should win NFL awards for 2016? Here's a guide",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/win-nfl-awards-2016-guide/story?id=44512271"
}