{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:22:26+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "ABC News correspondents cover the latest from the White House, Puerto Rico's hurricane preparations and continued volcanic activity in Hawaii.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fabc-news-live-trump-north-korea-hawaii-55533455.json",
    "image_url": "https://s.abcnews.com/images/US/180530_vod_abclive_1100_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for ABC News Live: Trump, North Korea and Hawaii\nHey I hope governor gray day got exactly keys here in the ABC news live our own we appreciate you. Joining us today we're gonna touch on some of the biggest stories. From around the globe check out this way here these are some shots of the recovery effort happening. In Puerto Rico they're also preparing for hurricane season we're going to be joined on the phone by our producer Josh holiest and then. Check out some of these shut these are overnight shots from Hawaii. In that relentless hurricane down there are correspondent whit Johnson would join us Deborah first Benigno. To the White House in be joined by Karen Travers of course Donald Trump last night with they. Campaign style speech in Nashville Tennessee touch him when he calls spy gate he woke up this morning got into. This back and forth he has with Jeff Sessions Karen Travers first off. What's new with this back and forth between the presidents and Jeff Sessions. Had this is another chapter in an ongoing stock at between president Tran and his attorney general Jeff Sessions in factory last year he called him. Our beleaguered EG he not been shy about putting out public criticisms of action. And all of stems from his frustration that Jeff Sessions recused himself from the Russia wrote remember a year and a half ago. That was all because of Jeff Sessions own contacts with Russian officials to report New York Times that talks about different and anger boiling over once again on this issue. And this thing that congressman tree got in line at the president was talking on television and said that. He understands the president's frustration thing you know he would have also been upset its session. Had told him before accepting the job that he might have to step away from the rusher broke. The president. Quoting trade Goudie on Twitter this morning and here's a great quote. Dowdy said there a lot of really good lawyers in the country heat meaning the president could pick somebody else the president said. And I wish I am very very strong statement. But again just another layer to this ongoing saga between the two on the residence has left Jeff Sessions hanging in the way in many times over the past year. Now the president has said that the Obama FBI infiltrated his campaign is there anything to substantiate those clamps. There's still no evidence to back this happened that entered trade Audi one more time so the president likely hearing wintry Gotti talking about frustration with Jeff Sessions. Trade Goudie last night said that after everything he got last week classified briefing from the FBI and Justice Department officials. He says there is no evidence to suggest that with any politics. Or spy infiltrating the trump campaign. Trade Goudie said that the FBI did exactly what they should have done by having an informant reach out to turn campaign officials. Packer notably we did see the president quoting that part of tree Goudie statements over the last four hours certainly picking and choosing the one that he agreed. Ken Travis force that the White House thank you so much Karen have a great day. Never gonna head out to out to London we're gonna talk with a bit more about trump in this North Korea summit that. On again off again we're joined by Terry Moran from Marlboro in London. Big meeting today Terry between Pompeii oh. And North Korean air North Korean representative here in New York City with a meeting all about. Well it's an extraordinary meeting it only happened once before where North Korean and American officials have met on US soil and Kim Jung on sent his right hand man. This is Kim young told is his name. He has long been a long time associated with the Kim family former spy chief he actually started out life as a body guard for the family tell he's close he's the guy. As negative state Mike Pompeo sitting down with him today in. New York and there have a bay that got a big job ahead of him they've got to try. Under incredible time pressure to come up with and agenda. For this summit that clearly did Donald Trump and Kim Jung on very much want. An agenda for the denuclearization. Of North Korea that is an enormously complex difficult issue the CIA in a report. That is that has been. Released to members of congress and others have said that that they don't believe that North Korea ever will fully. So this is a tall order for Pompeo and for Kim young Joseph but as I say their bosses. Donald Trump and Kim Jung on. They want this done and so it's this crash preparation. For a summit not just in New York but a while all this is happening there are American and North Korean officials meeting in Singapore. Where that summit supposed to happen on June 12 they're trying to hammer out enormously complicated logistics imagined security and rooms in the rest of it. So in the lot lot of work being done scrambling on the diplomatic front. To do what these two leaders want to do get a room get mad at a table and cut a deal. Terry Guinea's cent to what could this mean for the president if he's able to pull good so. What would be extraordinary if he's able to pull but the court does pull what off. A meeting with with the North Korean leader is a moment a very high spectacular. International drama. No president has done it before because they didn't trust that regime didn't Dick they'd get anything from did they give this enormous prestige and and the recognition. Of North Korea is owed family dynasty the Qin dynasty as on a par. With the presidency of the United States didn't want to give that without something in return. President trump is confident he will get that a lot of people around him. Are not and one of the things you're seeing in this on again off again may be on again summit. Is that while these two leaders as I say our. Boldly moved trying to get to that negotiating table they are each. Dealing with national security establishments. Who don't really want to do this on this time frame anyway who are deeply skeptical. There's history in both the Pentagon and the CIA and the State Department. And in the North Korean equivalent of those of dis trust not trusting the other of not believing that. That anything is possible here so it is if both leaders trying to push through their bureaucracy. To get to that table. If they do it will be spectacular. But it will only really mean. A legacy for president trump if the deal is real verifiable. And done. Terry Moran forests in London they can somewhat for all your insight Terry appear great fit. You bet thanks acting. The problem return now to the latest from this attack in Belgian. We have our correspondent James long man out there with the all the latest information. But we have been learning more about not horrific attack on cheese state it killed three people hey. Now authorities have been giving us more information about individual Benjamin home in the 36 year old who they believe carried out. This attack. We understand he may have been radicalized in prison and as any on Tuesday need Forte Allen leave from prison when he committed. These murders. I'm also learning that he may also have been responsible for another load the night before just hours off the meeting prison. It's though he went to the home all of former cellmate at this from prison and bludgeoned him to death and in the next day. Went on his Rampage. Townsend. Let me just say you at a debate about where we offices. You know yes it's a small town. This has been a huge shock I think the people hey I'm particularly. When it comes to the victims these two police women both mothers won a mother of thirteen year old queen. Gals they would ordeals that all of us. Which means now thanks to the rebels. Now been within minutes terribly terribly sad and not reason people are becoming a whole night today that tributes and other. Floral tribute. Similar to the kinds of things that we've seen in other towns and cities a pro Sierra. And it's right on the spot lad those two women were killed because Benjamin ominous thought to have been on the tonight approach states tape these women found them. Today comes from them and then shot them dead and it was right here on the street backed you can see where shell casings have been circles. By police. In their investigation. Stop the killing. Phase two women he then took their gums and started spraying bullets. Taking another individual 22 year old who's sitting in on line moments we think he was sitting in the call alongside his moment. She of course and that's what's parents on dying from. I mean just about every stage of this attack. Some pretty gruesome and very area sixty. Does he continued. Out this Rhodes it then alleged that he thought shout out and I'll walk which is given and authorities data sense that this was. Terrorist attack Ella meaning what is right of course he carried on out pay any made its way up that to the school where he ran inside he took. One woman hostage before then running back counts again and by that time social media. Tells us with people filming from that balcony there the police had swarmed the area it was a huge group a bomb these societies over the right. Cut him down. It's a tremendously dramatic scene and on Tuesday a lot of questions. For authorities to offs and now. I'm gentleman ABC news in yet. James Longman forests and les we turn now. To the political shakeup in Missouri Eric Wright and has been defiant but yesterday the governor announced that he will be stepping down I'm joined now. By Alex Torres who is in Jefferson City, Missouri I mean this guy was once considered a rising star Alex. Who now win in what now in who takes over. While pay Zachary the lieutenant governor's had to be taking over that's right we are in Jeff city. As the locals call articulate that is the State Capitol building it was inside that building act on the renovations now you can see inside that building that. Legislators spent a lot of time. Working on the impeachment process trying to impeach the governor but. They won't have to do that anymore because the governor in a surprise decision. Has announced that he is resigning he is stepping down the governor buckling to bipartisan pressure. You step out of office now all of this really start it will back up a little bit back when he was charged with felony invasion of privacy. Now those charges stem from allegations. From a one man he had an affair with before he was governor now that woman. Claim that the governor took a partially nude photo of her with out her consent and threatened to distribute that photo if she told anyone about their sexual encounters. The governor the whole time denied any wrongdoing he did it make to the affair. Now eventually those charges were dismissed but on top of all that he was then facing. A separate criminal case where he's at views of illegally obtaining. A list of donors using that list to out fund raise for his campaign. The governor was facing a lot of legal troubles that cars are really starting to stack up against him. And at this point in making that announcement the governor said it was those legal fees that were mounting and the told that this has had. And his family that forced them to finally after for months saying he would not step down. To finally make that decision and resign so his resignation becomes official here June 1 Zachary. Yeah Alex you know the governor says he didn't break any laws you've called it a political witch hunt I mean what's the general center around Jefferson City is his political career over at this point. Well you know the governor has. Safe to say probably no friends left here in Jefferson City he was once seen as were rising star in the Republican Party he even. I had reserve though web site that domain Eric Wright is for president so this is clearly a governor who had aspirations to do. Something much bigger than what he was doing now but. These legal troubles really just cause them to lose any and all support across the state this was a bipartisan effort to really get him. Out of office those impeachment proceedings had started legislators were in special session and they were willing to continue working through the summer. And do whatever it took to really investigate briefings bring things to light and eventually impeached discover. Alex thank you so. A much have a great that. Where to go now to Puerto Rico where there. Making way for working prep that there are getting some new numbers in related. To death poll numbers were joined now by Josh toy is on the phone he's one of our producers are just touched down there. Yesterday I believe just first ball I did just curious what are you seeing around their house the recovery process going. Hey good morning Thackeray. It's quite stunning to actually drive around quickly once you beat and wind starts getting to did not in the area that. The hound that word neared BS land all of art Maria caught the efforts when he beat you at some of the greenery its. Back I remember flying around the I lane in the days following are needed in Ireland error. Reached three. Palm Beach and Broward now all of this theater art back to being green but is pistols in the court stripped and I groups. Sort of very symbolic of what happens that I like they are rebuilding and they're trying to move forward they're realizing that they have so many challenges. In now we're getting some new information related to death numbers I'm cure they're the number of deaths I'm curious. Is it higher than what we previously. Had known or thought. Yup so yes Larry harper university. Study which gave arranged to doubt they said that the number of doubt that. They have been able to. Sort of figure out pastor council survey on the Iowa with a pre. But certainly I'm more than what he current debt hole official government debt sold and that that it. Before this Harvard study that 4006 current debt occurred on the island in the days following Kirk in Maria and also he got. Later on don't be beaten stormont it is a Morton's fixing the root of their home would you destroyed it McCartney tell often die. At that sort of gray area up in investigators aren't worked. You talk about how relentless the people are down there in their you know their. Their willingness to kind of fight through this put all of this he's is coming as they prep for another hurricane season is that right. They are broker they are preparing any Friday is June 1 started the Atlantic hurricane season. At them only 99 point cheapest the I look at our pumping ground over 121000 households are still without power. Each month option to absorb this current in the longest walk and mayor street continued. Josh we appreciate all you worked on merit have a safe stay here and I get home safe for rent. Thanks so much thank you now we're gonna turn out to Hawaii again these relentless volcanoes have been. Going in going whit Johnson our correspondent is on the ground wit what's the latest out there. Good morning from the big island of Hawaii we are right in the middle of Leila Ali S states this is an area that has been evacuated. We've been given a special escort from the National Guard other members of the media are here as you can see you walk. And the spectacle that we're all watching this this massive flop thousand over here first couple hundred feet. Into the air take a look back. You can hearing sounds like a massive waterfall. It's. Coming up through the Earth's just on the other side of those trees this is coming from Fisher number eight. We've been watching this fissure over the last couple days but this is the most act. Active that we've seen as all of found so far the highest we've seen it soar into the sky we saw at one point. What looked like funnel clouds over spiraling. Out. Couple from the lava below it really is an incredible sight here. We've just been watching it over the past few minutes as we've been moving around. There are also some hazards that we need to be aware of obviously to gas coming up from the law movement. He's lava rocks have been falling from the sky show every now and then were moved away moved to a safe place so that nobody gets hurt. A couple of updates as that'll give you his if we just push you a little bit water photographer here. David is a close up look you can see the big gurgling lava coming from your. We're getting some new information from Hawaii county. The number of homes destroyed is now aren't you 75. Now that sounds like a big increase coming from 51. Just about a day ago but we're told that they use some new technology to update their numbers and else on the five homes though in this community destroyed. We're also getting some new information. From officials about the era quality and the volcanic haze that we've had in this area. It's actually been blowing according to build National Weather Service. 4000. Miles away to the island who want they've been able to pick up some Trace amounts of the volcanic haze coming until away at. A hero on the big island which is quite incredible. We have also been watching the geothermal plant in the area there are concerns about a release of toxic gas the love actually. Briefs the property. Covered a couple wells we've been told from officials at those wells have been secured. And that the facility at the moment appears to be contained so. We've been checking in is making sure what the situation is there and no release of toxic gas from that facility. Right now but I get this site. Just incredible as we continue to watch this. And this is the closest we've been able to get to this Fisher and this lava fountains. Because of the dangerous conditions but that's it here from the big why it let's go back to. You in New York. Lava rocks coming from this guidance at some powerful images out there. In a why we think we've Johnson for all of his help that's gonna do it. Four today you can get more updates on ABC news live dot com where you can visit the ABC news app from exactly keys look you have a great day. The care.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "ABC News Live: Trump, North Korea and Hawaii",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/video/abc-news-live-trump-north-korea-hawaii-55533455"
}