{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:05:57+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A prominent GOP and Trump supporter said there was no spying on the campaign and the FBI did nothing wrong",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fwh-concern-trumps-spy-claims-55546094.json",
    "image_url": "https://s.abcnews.com/images/WNT/180530_wn_karl4_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for WH: 'There's still cause for concern' regarding Trump's spy claims\nNext tonight, president trump pus forward with his claim that the fbipied on his mpaign, infiltrated the campaign. He's pro no proof repuan trey Gowdy, a member of the house intelligence committee, who went after Hillary Clinton often, shooting down trump's allega. The white houses theres still reason to beconcerned, though, and here's ABC chief white house correspondent jonathanl. Reporter: The president has rned an unfod allegation into a campaign rallying cry. So, W do you like E fact they had people infiltrating our can? Can you imagine? Can you imagine? Reporter: But there is evidencethat.and now, arominent Republican with access to the infor what the fbas doing says there was spyg on the campaign, and Thi did nothing wrong. I am even more convinced that the FBI ditly what my fellow citizens would want them to do they got the information they got. D that it has nothing to do with Donald Trump. Reporter: Trey Gowdy isn't just any Republican. He T investiga into Hillary Clinton and Benghazi. Hea ump supporr, and he was one of a handful of congional leaders to receive a classified briefing last on the I'stics during the Russia investigation. Goays they were doing just what prent trump wd them to do. He said, I didn't collude withia, but if anyone connected with my campaign did, I want you investigate it. Reporter: Given what trey Gowdy has said, is the president prepared to retract allegation the FBI was spying on his campaign? Clearly,here's still cause for crn that needs to be lo at. Let's not forghe deputy of thrector of the FBI was actually firor misconduct. The president'ncerned about the matter and we'reng to continue to follow the issue. Reporter: Gowdy was in briefing, he knows what was done ands saying these allegatione baseless, there was no sg on the trump campai Certainly, the president feelat there is cause for concern and hope looked at. We'd like to see this Fu looked into and we'lntinue to follow that matter. Rter: But based on what evidence? What evidence does he ha Sorry, jonath we'ring to keep moving. Eporter: But tuty FBI director was fired for an entirely unred matter. It's Nott Gowdy who is calling the spying allegation baseless, so is another outspoken trump defender. Fox nenalyst Andrew napolo. There is no evidence of that atsoever. Let's get to Jon karl,e at the white house tonight. And prenrump also tweeting H attorney general Jeff sessions suggesting he wishes he had picked someone else for the job. We've this before, Jon, T back at it? Reporter: That is a harsh condemnation of the president's own attorney general. Illoutraged that sessions recused himself from the Russia investigation. Anvid, while it doesn't appear the president actually plans to sessions, the two N barely speak to each other anymore.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "WH: 'There's still cause for concern' regarding Trump's spy claims",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/WNT/video/wh-concern-trumps-spy-claims-55546094"
}