{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:06:12+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Frob-gronkowski-ends-speculation-tells-patriots-playing-year%2Fstory%3Fid%3D54705453.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0424/dm_180424_Yates_on_Julio_Jones1143/dm_180424_Yates_on_Julio_Jones1143_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "New England Patriots tight end Rob Gronkowski and his agent, Drew Rosenhaus, met Tuesday with coach Bill Belichick, telling him that Gronkowski will play for the Patriots this season. The decision ends speculation that he could retire.\n\"It was very positive and Rob is committed,\" Rosenhaus told ESPN's Adam Schefter.\nA source told Schefter that Gronkowski will not be traded this season.\nGronkowski announced his return on Instagram.\nGronkowski, who turns 29 on May 14, earned All-Pro honors in 2017 as he bounced back from a season in which he was limited to eight regular-season games in 2016 and underwent back surgery. He led the Patriots with 69 receptions, which went for 1,084 yards and eight touchdowns.\nHe missed two games in the regular season -- one because of his thigh and one due to NFL suspension -- and was knocked out of the AFC Championship Game because of a concussion.\nHis health might have been on his mind after Super Bowl LII when he was asked about possibly retiring.\n\"I don't know how you heard that, but I mean, I'm definitely going to look at my future, for sure,\" Gronkowski said moments after the Patriots lost to the? Philadelphia Eagles. \"I'm going to sit down in the next couple of weeks and see where I'm at.\"\nWhen asked that day what would make him retire, Gronkowski said, \"I'm not ready for these types of questions right now. I mean, I'm just going to sit down, reflect on the season, keep talking to my teammates ... and just see what happens.\"\nGronkowski, who has undergone three back surgeries in his career, in addition to procedures on his knee and forearm, said after the Super Bowl that concussions would not be the reason for him to retire.\nInformation from ESPN's Mike Reiss was used in this report.",
    "source_domain": "abcnews.go.com",
    "title": "Rob Gronkowski ends speculation, tells Patriots he's playing this year",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/rob-gronkowski-ends-speculation-tells-patriots-playing-year/story?id=54705453"
}