{
    "authors": [
        "Abc News",
        "More Dominick"
    ],
    "date_download": "2018-03-19 22:31:08+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The puppy eventually made it to where it was supposed to go.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdelta-apologizes-week-puppy-wrong-location%2Fstory%3Fid%3D53856907.json",
    "image_url": "https://s.abcnews.com/images/US/HT_Boeing_767_170707KA_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Delta is the latest airline to experience a snafu involving the transport of a pet.\nIn a post on Delta’s Facebook page, customer Josh Schlaich wrote about his experience with the airline after his new puppy was not delivered to him Saturday night.\n“Hey Delta, was supposed to receive my 8-week old pup this evening,” Schlaich wrote on the company's Facebook page. He went on to say that he received a call from “an inconsiderate and uninformed person” from Detroit’s airport saying that the new puppy was going to an unknown location due to a delayed flight.\nThe puppy was supposed to be flown to Boise, Idaho.\nSchlaich said he tried multiple phone numbers to try to connect with someone to find the new addition to his family, but said a rep yelled at him and hung up.\nDelta replied to his Facebook post multiple times, apologizing for the incident and giving him a number to call to speak with a supervisor.\nIn a statement to ABC News, Delta admitted the puppy was sent to another place. “We know pets are important members of the family and apologize for the delayed shipment of a dog, which is now in the hands of its owner, after it was routed to the wrong destination.”\nDelta said it reimbursed Schlaich for all the shipping costs associated with the puppy getting delivered to Boise. The airline also launched a review of the procedures to see what caused the puppy to end up in another location, the statement added.\nSchlaich updated his Facebook post to Delta, saying the dog was delivered safely and thanking the Delta team in Boise for their helpfulness.\nABC News has reached out to Schlaich for comment but did not immediately hear back.",
    "source_domain": "abcnews.go.com",
    "title": "Delta apologizes after 8-week-old puppy sent to wrong location",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/delta-apologizes-week-puppy-wrong-location/story?id=53856907"
}