{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:10:35+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Indonesians burn US flags in 4th day of Jerusalem protests",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Findonesians-burn-us-flags-4th-day-jerusalem-protests-51712424.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_e00f2d246f4043cbbba1d582c0e54592_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Activists burned U.S. and Israeli flags in front of the American embassy in Jakarta on Monday in a fourth day of protests in Indonesia against President Donald Trump's recognition of Jerusalem as Israel's capital.\nSeveral hundred protesters from an Islamic youth group rallied outside the embassy, burning flags and images of Trump and Israeli Prime Minister Benyamin Netanyahu.\nWearing white robes, the protesters unfurled banners reading \"U.S. Embassy, Get Out from Al-Quds\" and \"We are with the Palestinians.\" Al-Quds is the Arabic name for Jerusalem, the historic Middle East city that is a holy site for Jews, Christians and Muslims.\nA weekend protest at the embassy attracted several thousand people and similar protests have been held in other cities around Indonesia, the world's most populous Muslim nation.\nIndonesian President Joko \"Jokowi\" Widodo has strongly condemned Trump's move, which he described as a violation of U.N. resolutions.\nIndonesia does not have diplomatic ties with Israel and has long been a strong supporter of Palestinian aspirations for statehood.\nTrump's announcement Wednesday overturned decades of U.S. policy, and a longstanding international consensus, that the fate of Jerusalem be decided as a part of a peace deal between Israel and Palestine.\nIsraeli and Palestinian claims to the city's eastern sector form the core of their conflict, and Trump's announcement was seen as siding with the Israelis.",
    "source_domain": "abcnews.go.com",
    "title": "Indonesians burn US flags in 4th day of Jerusalem protests",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/indonesians-burn-us-flags-4th-day-jerusalem-protests-51712424"
}