{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-04-24 18:02:02+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The actress created a collection that channels her \"Sex and the City\" character.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FStyle%2Fsarah-jessica-parkers-bridal-line-gilt%2Fstory%3Fid%3D54694785.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/sarah-jessica-parker-1-gty-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sarah Jessica Parker has collaborated on a bridal collection that would make her \"Sex and the City\" alter-ego Carrie Bradshaw very proud.\nThe actress, in conjunction with Gilt, unveiled a new line of apparel on Tuesday that included dresses, skirts, bodysuits and other pieces, ranging in price from $295 to $2,395 and from sizes 0 to 14.\nParker said in a statement released by Gilt that, while non-traditional brides-to-be may have luck finding their dream dresses in the collection, it's not merely meant to be wedding attire.\n\"Women come in all sizes and shapes and backgrounds and colors and I just knew that I had to produce something I felt proud of and that I wanted to wear that would last,\" she said. \"These pieces are not limited to a wedding. They're also great for special occasions and parties that are unrelated to milestone events. They can be for everything.\"\nParker, 53, also designed the clothing to be in a variety of \"friendly\" colors, including red, black and blue, in addition to the more traditional white and cream. The \"Divorce\" star famously wore a black dress to her wedding to Matthew Broderick.\nBows, feathers and embroidery decorate some of the more intricate pieces in the collection.\n\"What was fun for us is creating pieces that have a life to them,\" Parker said.\nGILT\nGILT\nGILT\nGILT",
    "source_domain": "abcnews.go.com",
    "title": "What to know about Sarah Jessica Parker's bridal line with Gilt",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Style/sarah-jessica-parkers-bridal-line-gilt/story?id=54694785"
}