{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:17:24+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Vermette ejected for slashing ref, Ducks beat Wild 1-0",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fgibson-makes-37-saves-ducks-beat-wild-45500651.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/gibson-makes-37-saves-ducks-beat-wild-45500651",
    "language": "en",
    "localpath": null,
    "maintext": "Anaheim Ducks goalie John Gibson got all the cushion he needed five minutes into a game against the Western Conference-leading Minnesota Wild on a night teammate Antoine Vermette was ejected for slashing a ref.\nGibson made 37 saves for his fourth shutout of the season, rookie Joseph Cramarossa scored his fourth goal and Anaheim beat Minnesota 1-0 on Tuesday night.\nVermette was ejected in the third period with a game misconduct for abuse of an official. After losing a faceoff near center ice, Vermette used his stick to hit the linesman on the back of the legs. Vermette will face a suspension, with the number of games based on the category decided by officials. NHL rules state deliberately applying physical force on an official results in an automatic 10-game suspension.\nGibson stalled the league's fourth-highest scoring team, and the Ducks beat former coach Bruce Boudreau for the first time in three meetings this season.\n\"You never know what's going to happen, but I think it's a pretty rare situation that an early goal in the first holds up,\" Cramarossa said. \"But it is what it is. ... Gibby stood on his head there to not let any in for them. We'll take it, and we're going home now for a little home stretch.\"\nThe Wild were 0 for 5 on the power play and lost in regulation for the first time in six games and the fifth time since the start of December, a span of 34 games. Devan Dubnyk made 22 saves.\n\"You could tell very early on, or I could — maybe I know him a little bit — but he was really on his game and it was going to take something special to beat him,\" Boudreau said of Gibson. \"But we couldn't find that.\"\nCramarossa scored for the first time in 16 games 4:38 into the first period. Corey Perry's shot from Dubnyk's left side was stopped, but the puck dropped near Dubnyk's feet and Cramarossa alertly tapped it in.\n\"It was in the net pretty fast, and that's my job to try tidy up rebounds,\" Dubnyk said. \"But that's why you throw the puck at the net from bad angles.\"\nFollowing the goal, Anaheim went nearly 10 minutes without a shot.\nMinnesota had 13 shots on goal in the first period and then peppered Gibson in the second with another 16 shots. The Wild outshot the Ducks 37-23 in the game.\nClosing against Anaheim has proven to be a tough task for any team this season. The Ducks have allowed the fewest third-period goals in the NHL this season.\nMinnesota had plenty of chances. The closest was Christian Folin's slap shot early in the third that deflected hard off the post behind Gibson. The Wild were shutout for the second time at home this season.\nMinnesota had scored four power-play goals in the past two games and had 13 in its previous 13 home games. The Wild were a league-best 30.1 percent on the power play at home this season heading into the game and sixth overall.\n\"He's played great,\" Anaheim center Ryan Getzlaf said of Gibson. \"He played good again tonight. The shot totals, they took a lot of shots, they were throwing everything at the net from the corners, everything. We got a few bounces and our goaltender played great. It was an ugly hockey game, but we'll take it and go home.\"\nNOTES: Anaheim scratched D Sami Vatanen for the fifth straight game with a lower-body injury. The team listed him as day-to-day. ... Minnesota scratched D Matt Dumba for the second game in a row with a lower-body injury. ... The Wild reassigned C Tyler Graovac to Iowa of the American Hockey League after he cleared waivers. ... The Ducks finished a season-long, six-game road trip at 2-3-1. Their last home game was Jan. 31.\nUP NEXT\nDucks: Return home Friday night against the Florida Panthers.\nWild: Host the Dallas Stars on Thursday night.",
    "source_domain": "abcnews.go.com",
    "title": "Vermette ejected for slashing ref, Ducks beat Wild 1-0",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/gibson-makes-37-saves-ducks-beat-wild-45500651"
}