{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:57:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Perry scores in OT, Ducks take 3-0 series lead over Flames",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fperry-scores-ot-ducks-series-lead-flames-46855325.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_c041dba9f68147b380bf246f93c08c2a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Corey Perry scored 1:30 into overtime and the Anaheim Ducks rallied from three goals down to beat the Calgary Flames 5-4 Monday night, taking a 3-0 series lead in the first-round series.\nPerry's sharp-angled shot deflected off several players and past Flames goalie Brian Elliott.\nShea Theodore had two goals, Nate Thompson had a goal and two assists, and Nick Ritchie also scored for the Ducks. Rickard Rakell, Kevin Bieksa and Hampus Lindholm each had two assists.\nJohn Gibson gave up four goals on 16 shots before he was replaced by Jonathan Bernier in the second period. Bernier stopped all 16 shots he faced.\nSean Monahan had a goal and an assist, and Kris Versteeg, Sam Bennett and Michael Stone also scored for Calgary. Mikael Backlund and T.J. Brodie each had two assists, and Elliott finished with 22 saves.\nGame 4 is Wednesday night.\nThe Flames started stronger, were more disciplined and sharper in the faceoff circle than they were in a pair of 3-2 losses to open the series in Anaheim. Calgary built a 4-1 lead midway through the second period, scoring three power-play goals on five chances.\nHowever, the Theodore got the Ducks' comeback started with 49 seconds left in the middle period as his wrist shot from the boards deflected off Elliott's left pad and into the net.\nThompson deflected Lindholm's shot from inside the blue line under Elliott with 8:46 left in the third to pull Anaheim within one, and Theodore scored his second goal of the game on a shot from the point to tie it with 4:21 remaining.\nMonahan, on Gibson's doorstep, converted Troy Brouwer's feed from behind the net into his third power-play goal of the series to get the Flames on the scoreboard first at 2:10 into the game.\nVersteeg banged a rebound by a sprawling Gibson during a goal-mouth scrum on a power play at 9:18 for a 2-0 lead.\nRitchie cut Anaheim's deficit in half with 4:27 remaining in the first, knocking in a rebound off Antoine Vermette's shot from the top of the faceoff circle.\nStone scored even-strength at 4:34 of the second, threading a shot through traffic and past Gibson stick side, and Mark Giordano's shot from the point deflected off Bennett's foot for a 4-1 Calgary lead at 8:33.\nGiordano was soundly booed in Anaheim because of a regular-season collision with Cam Fowler that took Anaheim's big-minute defenseman out of their lineup to start this series.\nNOTES: Ducks D Sami Vatanen participated in the morning skate, but was scratched a second straight game. He sustained an upper-body injury when he was checked by Calgary's Lance Bouma in Game 1. ... Fowler skated after his teammates in the morning. Ducks coach Randy Carlyle indicated the 25-year-old is recovering from his knee injury, but did not provide a timetable for Fowler's return. \"We think that he's on pace to be available to us some time here shortly,\" Carlyle said.",
    "source_domain": "abcnews.go.com",
    "title": "Perry scores in OT, Ducks take 3-0 series lead over Flames",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/perry-scores-ot-ducks-series-lead-flames-46855325"
}