{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 06:41:45+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "UK banker back in Hong Kong court for murder appeal",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fuk-banker-back-hong-kong-court-murder-appeal-51732496.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_6e26ee7aac3f42029f07c5acd566d7bb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A British banker sentenced to life in prison for the gruesome slayings of two Indonesian women appeared in a Hong Kong court on Tuesday in a bid to appeal his conviction.\nLawyers for Rurik Jutting presented their arguments in the semiautonomous Chinese city's Court of Appeal.\nThey were requesting the court's permission for an appeal, on the basis that the trial judge gave incorrect instructions to the jury on deciding their verdict.\nThe nine-person jury last year convicted the Cambridge University-educated Jutting of the 2014 killings of Seneng Mujiasih, 26, and Sumarti Ningsih, 23.\nThe case shocked residents of Hong Kong, while also highlighting wide inequality and seedy aspects usually hidden below the surface.\nJutting, 32, watched the proceedings from the dock Tuesday, wearing eyeglasses with dark frames and a blue dress shirt and often leafing through a bundle of court documents as he followed along. During a break he chatted with the three uniformed court officers sitting alongside him.\nJutting worked for Bank of America-Merrill Lynch, while Sumarti and Seneng arrived in Hong Kong as foreign maids but ended up as sex workers. During the trial, jurors were shown graphic iPhone video evidence shot by Jutting of him torturing Sumarti and snorting drugs.\nJutting attempted at the trial to plead guilty to manslaughter, which the court rejected. His defense argued that he was under diminished responsibility.\nOn Tuesday, Lawyer Gerard McCoy told the three-judge appeal panel that the trial judge made a \"fatal error\" in his directions to the jurors on how to consider whether Jutting was suffering from a psychiatric disorder.",
    "source_domain": "abcnews.go.com",
    "title": "UK banker back in Hong Kong court for murder appeal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/uk-banker-back-hong-kong-court-murder-appeal-51732496"
}