{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:49:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Cracks may offer clues to California dam's troubles",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcracks-offer-clues-california-dams-troubles-45503009.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_4fda1b0eeb5540fba84c3ef5a44e0b41_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Six months before rushing water ripped a huge hole in a channel that drains a Northern California reservoir, state inspectors said the concrete spillway was sound. As officials puzzle through how to repair Oroville Dam spillway, federal regulators have ordered the state to figure out what went wrong.\nEarlier inspection reports offer potential clues, including cracks on the spillway surface that if not properly repaired could let water tear through the concrete. In recent years, construction crews patched cracks — including in the area where water burrowed a huge pit last week.\nDamage to the main spillway triggered a series of problems culminating with the first use of the emergency spillway, which quickly began eroding and threatened to unleash a torrent of water on cities downstream. On Tuesday, officials said the immediate danger had passed, and allowed nearly 200,000 residents to go home after evacuation orders scattered them for nearly two days.\nInspectors with the state agency that both operates and checks the dam, the nation's tallest at 770 feet, walked the half-mile-long spillway in 2014 and 2015 and did not find any concerns.\n\"Conditions appeared to be normal,\" the inspector wrote in reports from both years.\nLast August, a team of inspectors did not check the channel on foot but instead from afar, also concluding that everything looked fine.\nThe inspection came as California was enduring a five-year drought, and the channel rarely was used to relieve pressure on Oroville Lake, which is about 70 miles north of Sacramento. An extraordinarily wet subsequent six months changed that. Dam managers were draining water from the fast-filling reservoir into the Feather River below when the pit appeared last week.\nExperts said problems like the cracks in the concrete spillway and spots in nearby areas where water seeped from the reservoir through a hillside were common issues with dams. What mattered, said John Moyle, New Jersey's director of dam safety and flood control, was whether dam operators dealt with the problems carefully — patching cracks so they were watertight, and dealing with spots where water was leaking through so they didn't grow to undermine the concrete.\nThe Department of Water Resources declined to answer specific questions about the repair work, saying engineers were focused on ensuring public safety.\nRobert Bea, professor emeritus of civil and environmental engineering at University of California, Berkeley, said it's \"obvious those repairs didn't work.\"\n\"We don't have details on the repairs, but they put cement into the cracks and troweled it over,\" Bea said. \"I call it 'patch and pray.'\"\nOn Monday, federal regulators told the department it must enlist a group of independent consultants both to assess what went wrong and to recommend long-term fixes.\nDocuments and interviews show that crews were patching cracks in 2009 and 2013. A water resources department spokesman said it was normal for maintenance crews to be troubleshooting cracks in the channel during dry summer months.\nOne resident of the region said he saw crews in the spillway at least once a year for the past several years.\n\"When they have four or five trucks down there, the only thing they have to do is fill cracks,\" said Don Reighley, a retiree and fisherman who several times a week drives past the channel to launch his boat into the reservoir.\nOne of the state inspectors who went to Oroville Dam in August said authorities may never know exactly what destabilized the spillway.\n\"Any type of evidence that might have been there is gone,\" Eric Holland of the water resources department's dam safety division said. \"Everything has been washed away.\"\n———\nKnickmeyer reported from Sonoma, California, Pritchard reported from Los Angeles. John Flesher in Traverse City, Michigan, contributed.\n———\nContact Pritchard at https://twitter.com/lalanewsman .",
    "source_domain": "abcnews.go.com",
    "title": "Cracks may offer clues to California dam's troubles",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/cracks-offer-clues-california-dams-troubles-45503009"
}