{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 21:20:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The Latest: Experiments, ice cream launched to space station",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Flatest-experiments-ice-cream-launched-space-station-49210366.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_8ef27d164c264e02840b437a94d9b5c4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on SpaceX launch to the International Space Station (all times local):\n12:31 p.m.\nA SpaceX capsule is rocketing to the International Space Station — carrying a few tons of research, plus ice cream.\nSpaceX launched its unmanned Falcon 9 rocket Monday from Florida's Kennedy Space Center.\nExperiments make up most of the 6,400 pounds of cargo. That includes 20 mice.\nThe Dragon — due at the station Wednesday — is also doubling as an ice cream truck this time. There was extra freezer space, so NASA packed little cups of vanilla, chocolate and birthday cake ice cream for the station's crew of six, as well as ice cream candy bars. Those treats should be especially welcomed by U.S. astronaut Peggy Whitson, who has been in orbit since November.\n10 a.m.\nSpaceX is about to launch a few tons of research to the International Space Station — plus ice cream.\nAn unmanned Falcon 9 rocket is scheduled to blast off at 12:31 p.m. Monday from Florida's Kennedy Space Center.\nExperiments make up most of the 6,400 pounds of cargo. That includes 20 mice. The Dragon capsule is also doubling as an ice cream truck this time. There was extra freezer space, so NASA packed little cups of vanilla, chocolate and birthday cake ice cream for the station's crew of six, as well as ice cream candy bars. Those treats should be especially welcomed by U.S. astronaut Peggy Whitson, in orbit since November.\nAs usual on these cargo flights, SpaceX will try to land its leftover booster back at Cape Canaveral.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Experiments, ice cream launched to space station",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/latest-experiments-ice-cream-launched-space-station-49210366"
}