{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 01:21:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Security at Capitol tighter than ever after members of Congress were shot at a park in Alexandria.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fshockwaves-halls-congress-shooting-48046091.json",
    "image_url": "http://a.abcnews.com/images/WNT/170614_wn_bruce5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Shockwaves sent through the halls of Congress after shooting\nA sad day indeed. The shooting sending shock waves through the capitol right here behind me. We saw security tighter than ever. In the hallways and meeting rooms today, members of congress has the rhetoric gone too far. Where are we now as a nation? ABC's Mary Bruce also here on capitol hill. Reporter: Congressman Steve Scalise was looking forward to the big game. I couldn't even make my high school team. But, you know, kind of bloomed later in life. Reporter: The Louisiana lawmaker, a proud Ragin' cajuns fan, calling his wife before heading into surgery. Also hit, Zack Barth, a congressional aide from Texas. Posting that he was in the hospital but \"Okay.\" And lobbyist Matt Mika, one of the team's coaches, shot in the chest. Tonight in critical condition. And those two heroic officers, crystal Griner, shot in the ankle. And David Bailey, a nine-year veteran of the capitol police, suffering minor injuries. Both there to protect Scalise, but protecting so many more. Scalise gets a security because he's in leadership. Had Scalise not been there I think it would have been a massacre today because there would have been no way to defend yourself. Reporter: Congressman Rodney Davis of Illinois, the team's catcher, was at bat when shots rang out. We show him the shooter's photo. It makes me nauseous to find out he may be from my home state. The hate just over political differences has ratcheted up to where it becomes entertainment value, and that has to stop. It's my breaking point. I'm going to do everything I can to make it stop. Reporter: And today moments of unity. That image in the dugout, the democratic team praying for the Republican colleagues, and in the halls of congress. An attack on one of us is an attack on all of us. Mary, both we heard that often today. So many here on capitol hill do believe we have reached a breaking point with the rhetoric in this country. You've learned that the congressional baseball game will go on tomorrow. David, that show of unity will extend to the baseball diamond tomorrow night. Democrats and Republicans feel it sends a strong message that Americans will not back down to fear. One Republican at that field today, they all agree they need to play ball. David. Mary Bruce just behind us at the capitol.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Shockwaves sent through the halls of Congress after shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/shockwaves-halls-congress-shooting-48046091"
}