{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:44:09+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Tweets from the president over the weekend reignited questions about whether he will fire special counsel Robert Mueller -- \"The View\" co-hosts discuss.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Ftrump-fire-mueller-53853153.json",
    "image_url": "https://s.abcnews.com/images/theview/180319_view_mueller_1102_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Will Trump fire Mueller?\nSo, is it last call for Mueller time? Trump spent the weekend attacking Robert Mueller on Twitter, and his lawyers want an end to the Russia investigation, but his golf buddy, Lindsey graham, thinks it's a bad idea. Watch. Are you worried that the president is preparing fo order the firing of Mueller? It sure looks that way from his tweets. Well, as I said before, if he tried to do that, that would be the beginning of the end of his presidency because we're a rule of law nation. When it comes to Mr. Mueller, he is following the evidence where it takes him, and I think it's very important he be allowed to do his job without interference. There are many Republicans who share my view. So who are these other Republicans? Paul Ryan said through his spokesperson that Mueller should be able to do his job. That's what he said. And Mitch Mcconnell has said zip. So why won't they just step in and way -- really say -- as a matter of fact Mcconnell said we don't need a law to protect Mueller. Trey goudwdy said that does him a disservice. He said firing Mueller would be cataclysm cataclysmic, I think Lindsey graham in particular because he's a hard person to pin down. Some days he's golfing with trump, some days he's a critic of the administration. If you're innocent, that's the thing that trey Gowdy -- I also liked that quote. He said if you've done nothing wrong you should want the investigation to be as fulsome as possible. At the end of this I'm going to come out looking good. The more he tries to shut it down, the more I'm intrigued. It's very disingenuous for them to say if you have nothing to hide. He has plenty to hide. I remember there were people that we would investigate and they'd say come into my office, take all my computer files. They wanted the investigation to be as robust as possible. As a prosecutor you start to think, well, maybe they don't have anything to hide if they're being so transparent. But when you have someone who is at every turn trying to obstruct justice and you're investigating him for obstructing justice, it raises a lot of red flags. I know, I know. Graham is a notorious flip-flopper. I like him but he flip-flops. I don't know if I can believe him. We were talking about it in the meeting today. He was the one that said you shouldn't be able to fire the special counsel. He co-sponsored this bill to prevent the president from firing -- Where is Mitch Mcconnell and Paul Ryan? They're the leaders of the party. They say nothing, really. Honestly, I don't think it's logical that Mueller is going to get fired. I don't think it's in the realm of possibility. I think on both sides there would be absolute bedlam in the street if it happened. Really? Yes. Constitutional crises for sure. I think it would be absolute chaos. So I don't see -- I think you can tweet a lot of things and say a lot of things but if it happens, I mean, we would probably come into this show drinking, quite frankly. We've already seen that in history with Nixon, right? But the Republicans were different. They actually cared more than these Republicans. For god's sake, trey Gowdy, Lindsey graham, I'm here telling you -- It's only Monday. Let's work into this. It was because of the Republican party back in the day of watergate that Nixon had to resign. I wonder if that will happen. It's so obvious that the Russians have hacked into this election. They control our national grid. When is trump and the rest of them going to -- when they stop not being able to watch fox News, is that when it's going to happen that the lights go out? If they can do that they can tap into our nuclear facilities. I mean, we're in trouble in this country and everybody seems to be la, la, la. I don't think it's la, la, la. There are studies that more people are going to therapists and on medication. I don't think anybody is like la, la, la.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Will Trump fire Mueller?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/trump-fire-mueller-53853153"
}