{
    "authors": [
        "Abc News",
        "More David"
    ],
    "date_download": "2018-02-04 07:08:09+00:00",
    "date_modify": null,
    "date_publish": "2018-02-04 00:00:00",
    "description": "Trumps hosting Super Bowl watch party at Palm Beach golf club",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrumps-hosting-super-bowl-watch-party-palm-beach%2Fstory%3Fid%3D52824794.json",
    "image_url": "http://a.abcnews.com/images/Politics/ap_fb1_dc_020418_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump and first lady Melania Trump will join millions of other Americans Sunday in hosting a Super Bowl watch party.\nThe first couple will host the get-together at Trump International Golf Club in Palm Beach, Florida, according to the president's schedule, released Saturday by the White House.\nThe New England Patriots will take on the Philadelphia Eagles at Minneapolis' U.S. Bank Stadium. Trump is friends with Patriots owner Robert Kraft, as well as quarterback Tom Brady.\nAP Photo/Andrew Harnik\nThe president kept mum when asked on Friday if he had a prediction which team would snag the Vince Lombardi Trophy.\n\"I better not get involved,\" Trump said.\nFollowing the presidential party, the Trumps -- who have been spending the weekend at their Mar-a-Lago resort -- will return to Washington.\nAP Photo/Andrew Harnik\nTrump has had a contentious relationship in recent months with the NFL, sparring with owners, players and others in the organization about the controversial practice of players kneeling during the national anthem to raise awareness to racial injustice and police brutality.\nAt an Alabama rally in September, the president said, \"Wouldn’t you love to see one of these NFL owners, when somebody disrespects our flag, to say, 'Get that son of a bitch off the field right now. Out! He’s fired. He’s fired!'\"",
    "source_domain": "abcnews.go.com",
    "title": "Trumps hosting Super Bowl watch party at Palm Beach golf club",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trumps-hosting-super-bowl-watch-party-palm-beach/story?id=52824794"
}