{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 09:45:56+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Samsung, Hyundai Motor See Growing Uncertainties in 2017",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsamsung-hyundai-motor-growing-uncertainties-2017-44508702.json",
    "image_url": "http://abcnews.go.com/International/wireStory/samsung-hyundai-motor-growing-uncertainties-2017-44508702",
    "language": "en",
    "localpath": null,
    "maintext": "Chiefs of Samsung Electronics and Hyundai Motor said Monday their businesses would face increased uncertainties due to growing protectionism.\nSamsung Vice Chair Kwon Oh-hyun urged employees in a new year's speech to reform the company by strengthening quality control as growth slows in its key markets and trade protectionism increases uncertainties in the economy and politics.\nSamsung is expected to announce this month the findings of its investigation into the Galaxy Note 7, JoongAng Ilbo reported, citing an unnamed company official. The flagship smartphone, released in August, caught fire and overheated, prompting two global recalls and its discontinuation last year. Samsung declined to comment on when it would share the findings with public.\nHyundai Motor Chair Chung Mong-koo also warned about the increased uncertainties this year, citing slow growth in the global economy, the spread of protectionism and the increased competition in the auto industry.\nHe said that South Korea's largest automotive group aims to sell 8.25 million vehicles this year.\nHyundai Motor and its sister Kia Motors missed their sales target in 2016, selling 7.88 million cars as consumers flocked to sports utility vehicles rather than sedans, Hyundai's mainstay, and the popularity of imported vehicles grew in South Korea. Hyundai Motor workers' strike disrupted local car production, hurting sales.",
    "source_domain": "abcnews.go.com",
    "title": "Samsung, Hyundai Motor See Growing Uncertainties in 2017",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/samsung-hyundai-motor-growing-uncertainties-2017-44508702"
}