{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:14:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "The actor's plane came dangerously close to a 737 passenger jet as he landed.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ffaa-investigates-harrison-ford-piloting-error-45498703.json",
    "image_url": "http://a.abcnews.com/images/WNT/170214_wn_kerley_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for FAA investigates Harrison Ford over piloting error\nNext tonight here, the runway error. The FAA investigating a close call involving actor Harrison Ford piloting his ownplay plane. Coming dangerously close to a 737. Here's ABC's David Kerley. Reporter: Harrison Ford, in this plane taking off from Santa Monica, is tonight part of an FAA investigation of a close call. It all happened Monday, Ford landing at Orange county, an airport named for another acting legend, John Wayne. But Ford was lined up for a taxiway instead of runway 20-left, and passed right over an American airlines 737 that was waiting to take off. Ford apparently not realizing his mistake asking controllers if the jet was supposed to be below him. It's not the first incident for the star of \"Indiana Jones\" and \"Star wars.\" Engine failure, immediate return. Reporter: Two years ago, he crashed landed another plane, details of which he didn't remember. How are you feeling? I'm doing great, thank you. Thank you. I'm back playing tennis, riding my bikes, and having a good time. Reporter: The FAA says the pilot of the small plane did call out the right runway, but the American airlines pilot watched him fly over them. The FAA investigation, and the NTSB says it's gathering information. Thank you. When we come back, the the\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "FAA investigates Harrison Ford over piloting error",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/faa-investigates-harrison-ford-piloting-error-45498703"
}