{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:39:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "In South Florida, green iguanas spread into suburban scourge",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fsouth-florida-green-iguanas-spread-suburban-scourge-46842512.json",
    "image_url": "http://a.abcnews.com/images/US/AP-iguana-jef-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Perched in trees and scampering down sidewalks, green iguanas have become so common across South Florida that many see them not as exotic invaders, but as reptilian squirrels.\nNative to Central and South America, green iguanas that escaped or were dumped as pets have been breeding in the Miami suburbs and the Keys for at least a decade without making headlines like other voracious invasive reptiles such as Burmese pythons or black-and-white tegu lizards.\nThey've been considered mostly harmless because they eat plants instead of native animals. But their burrows undermine seawalls, sidewalks and levees, and they eat their way through valuable landscaping as well as native plants. Their droppings can be a significant cleanup problem, as well as a potential source of salmonella bacteria, which causes food poisoning.\nCompared with elusive pythons in the Everglades, iguanas are easy to spot. They can grow to more than 5 feet long, and they like what draws people to Florida: nice landscaping, waterfront views, swimming pools and sunbathing.\nOne iguana even stopped a first-round tennis match at this year's Miami Open by crawling over a scoreboard onto the court. German player Tommy Haas snapped a selfie with it, but his Czech opponent Jiri Vesely complained to the umpire that he couldn't concentrate. An ATP Tour video shows the umpire telling Vesely, \"It's not a dangerous animal.\"\nTrapper Brian Wood easily caught three iguanas one recent afternoon, each roughly 3 feet long, basking on a condominium's seawall in the resort community of Sunny Isles Beach. Using a long fishing pole, he looped wire around their necks, reeled them in, and placed them in a narrow metal cage.\nJanet Sarno, board chairwoman at King's Point Imperial Condo, hired Wood because the number of iguanas — big adults and bright green babies — hanging around the building's pool has been growing despite residents' attempts to chase them away or block their entry.\n\"Maybe 10 years ago, you might see one or two on the seawall. Now there's 20 at a time coming out. There's just too much,\" she said.\nThe iguanas burrow under the seawall and first-floor patios, climb trees to reach second-floor balconies and eat the bright blooms off recently planted bougainvillea, Sarno said.\n\"They just come and they eat, they dig ... they're in the pool,\" Sarno said. \"Lately, there's crap all over. It's terrible.\"\nWood primarily hunts alligators and tans their skins for luxury leather goods, but he's received so many calls from homeowners seeking help with iguanas in the last several years that he created a pest control business called Iguana Catchers.\nHe wants to breed the iguanas he catches to sell hatchlings as pets in northern states with cold winters. In the meantime, he euthanizes them and sells their meat as a delicacy. He's also trying to generate interest in iguana skins as a sustainable leather source, alongside alligator and python skins available in his Hollywood store.\n\"They're like rats, they're always going to be here,\" Wood said. \"I think it's going to be a growing business.\"\nNot much threatens adult iguanas here except cars and cold weather, which has kept them from spreading farther north. Prolonged cold snaps in 2009 and 2010 killed off many of them — news stations showed frigid iguanas stiffly falling from trees — but the population rebounded. Scientists say development has only increased their preferred habitat.\nThe damage, cleanup and health concerns associated with iguanas, as well as their dramatic population growth, has prompted state officials to start thinking about management strategies.\n\"Calls from residents about iguanas have increased, which pushed us to address them this year,\" said Sarah Funck, non-native species program coordinator for the Florida Fish and Wildlife Conservation Commission.\nIn the Florida Keys, iguanas ate up the host plant for the endangered Miami blue butterfly in Bahia Honda State Park. Nearly 600 iguanas have been removed from the park in the last two fiscal years, according to Florida's Department of Environmental Protection, but the quarter-sized butterflies haven't returned.\nState officials worry their digging may exacerbate long-term ecological damage if their burrows destabilize water restoration projects or flood-control structures near the Everglades. The South Florida Water Management District has reinforced some canal banks in Palm Beach County to prevent damage from burrowing iguanas, said Rory Feeney, the district's land resources bureau chief.\n\"Burrowing in these levees, particularly around structures, can cause hydraulic eddies and can increase erosion to our system,\" Feeney said.\nFlorida wants to protect its smaller native lizards and keep green iguanas from becoming as big a pest as they have become in the Caribbean. In the Cayman Islands, researchers have confirmed with DNA evidence that green iguanas have hybridized with native iguanas.\nOn Grand Cayman, the adult green iguana population grew from 127,660 in 2014 to more than 400,000 last year, according to Jane Haakonsson, a researcher with the terrestrial resources unit of the Cayman Islands' environment department. An experimental hunt in July on the 22-mile-long island netted nearly 14,500 iguanas — 16 tons of carcasses — hardly enough to control them.\n\"Everyone is complaining about it. Everyone has issues with their pools and their gardens, and on the roads they're being run over all the time,\" Haakonsson said. \"A lot of the hatchings being born are surviving. What we're doing is not stopping them.\"\n———\nContact Jennifer Kay at https://twitter.com/jnkay",
    "source_domain": "abcnews.go.com",
    "title": "In South Florida, green iguanas spread into suburban scourge",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/south-florida-green-iguanas-spread-suburban-scourge-46842512"
}