{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:24:27+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Donetsk residents say OSCE monitors ineffective",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fdonetsk-residents-osce-monitors-inffectual-45505888.json",
    "image_url": "http://abcnews.go.com/International/wireStory/donetsk-residents-osce-monitors-inffectual-45505888",
    "language": "en",
    "localpath": null,
    "maintext": "About 1,000 residents of Ukraine's largest rebel-held city on Wednesday demonstrated outside the hotel were monitors with the Organization for Security and Cooperation in Europe stay to complain that the monitoring mission in the conflict is ineffective.\nDemonstrators in Donetsk Wednesday carried banners telling OSCE monitors to \"open your eyes\" and \"speak the truth.\"\nMore than 9,800 people have died since April 2014 in fighting in eastern Ukraine between government forces and Russia-backed separatists. Fighting on Donetsk's outskirts escalated for several days early in the month.\nSeparatist rebels have been deeply unhappy about the OSCE mission, which along with reporting acts of war on the Ukrainian side has documented the movement of rebels' heavy artillery and troops, indicating a possible Russian involvement among other things.\nThe local monitors' director, Olga Skripovskaya, said unarmed staff had been unable to reach a section of the city that was coming under sniper fire.\n\"Both sides have very big expectations from us ... (but) the mission is a civil mission, which cannot influence parties who are shooting,\" she said.\nEver since Russian-backed separatists took control of Donetsk in spring 2014 all rallies and gatherings have been tightly controlled. Rebel commanders off the record have vented their frustration with OSCE monitors who are practically the only non-Russia-affiliated representatives except for rare journalists who still have access to this area.\nLocals have been seen rallying against the OSCE mission in the past. In one incident they vandalized the observers' car, making it impossible for them to leave for a monitoring trip.\nAlmost all protesters at these rallies typically refuse to talk to journalists and some have indicated that they were not there of their own volition.",
    "source_domain": "abcnews.go.com",
    "title": "Donetsk residents say OSCE monitors ineffective",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/donetsk-residents-osce-monitors-inffectual-45505888"
}