{
    "authors": [
        "Abc News",
        "More Morgan"
    ],
    "date_download": "2018-02-03 23:12:37+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "A Kansas father of three, who was detained by immigration officials last week as he was getting his kids ready for school, is facing deportation.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fice-arrests-father-kids-ready-school%2Fstory%3Fid%3D52818039.json",
    "image_url": "http://a.abcnews.com/images/US/180203_vod_icearrest_father_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Kansas father of three, who was detained by immigration officials last week as he was getting his kids ready for school, is facing deportation.\nU.S. Immigration and Customs Enforcement (ICE) agents arrested Syed Ahmed Jamal, 55, outside his home in Lawrence, Kansas, on Jan. 24. He's since been detained and will be deported to Bangladesh, where he's from, ICE said in a statement.\n“ ” 'I don't really understand why this is happening'\nJamal has been living in the United States for decades and attained his undergraduate and master degrees here, his family told ABC affiliate KMBC. He and his wife, who is also from Bangladesh, have three children who are all American citizens.\nNow, his family worries they'll never see him again.\n\"I don't really understand why this is happening.\" Jamal's daughter, Naheen, told KMBC as tears rolled down her cheeks. \"So that's frustrating because he hasn't done anything wrong.\"\nABCNews.com\nAn online petition to stay Jamal's deportation has garnered well over 8,000 signatures. The petition describes him as a \"family man, scientist and community leader\" who has lived in the United States for 30 years.\n\"He's obviously a very dedicated dad,\" Jamal's eldest son, Taseen, told KMBC. \"I just want him to come back.\"\nICE told ABC News in a statement that Jamal initially legally entered the United States in July 1998 on a temporary nonimmigrant visa. After he overstayed that visa, a federal immigration judge gave him 120 days to depart the United States. Jamal abided the judge's order and left for Bangladesh in July 2002, according to the statement from ICE.\nThree months later, Jamal legally re-entered the United States on a temporary nonimmigrant visa. He again overstayed his visit and a federal judge gave him 120 days to depart. But Jamal violated the judge's order and failed to leave the United States, so the judge issued a final order of removal, or deportation, according to the statement from ICE.\n“ ” 'He's obviously a very dedicated dad. I just want him to come back'\nICE said Jamal came to the agency's attention in September 2012 after he was arrested on misdemeanor criminal charges in Johnson County, Kansas. ICE agents took Jamal into custody and subsequently released him on an order of supervision, requiring him to report to an ICE office in November 2012. In May 2013, the Board of Immigration Appeals dismissed Jamal's appeal of his removal order, according to the statement from ICE.\n\"To effect this removal order, deportation officers with U.S. Immigration and Customs Enforcement arrested Jamal outside his residence on Jan. 24, 2018. He is currently in ICE custody pending his removal to Bangladesh,\" ICE said in the statement.\nJeffrey Bennett, a Kansas City lawyer reportedly retained by the Jamal family, did not immediately respond to ABC News' request for comment.",
    "source_domain": "abcnews.go.com",
    "title": "ICE arrests father of 3 as he was getting kids ready for school",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/ice-arrests-father-kids-ready-school/story?id=52818039"
}