{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:20:04+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fburger-king-grows-tim-hortons-makeover-54701974.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_cebfe2d7b0f8486ab041385c709f6f0b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A new burger and a spicy chicken sandwich sold well at Burger King, helping boost profits for its owner Restaurants Brands. But the company's other chain, Tim Hortons, didn't do as well, and Restaurant Brands plans to remodel those stores to try to get more people to come in to buy its coffee and doughnuts.\n\"We're not happy with our sales growth and overall financial results at Tim Hortons,\" said Restaurant Brands CEO Daniel Schwartz, in a call Tuesday.\nTim Hortons, where sales fell 0.3 percent at existing locations, will renovate most of its nearly 4,800 stores in the next four years. Increasing competition from other coffee sellers hurt sales, Schwartz said.\nAt Burger King, sales rose 3.8 percent at existing restaurants after the launch of the Double Quarter Pound King and the spicy chicken sandwich. Sales at its fried chicken chain Popeyes, which the company bought last year, rose 3.2 percent.\nRestaurant Brands, based in Oakville, Ontario, also reported first-quarter earnings and revenue that beat expectations.\nThe company said it had net income of 59 cents per share during the three months that ended March 31. Adjusted earnings came to 66 cents per share, 10 cents above what analysts expected, according to Zacks Investment Research.\nIt had revenue of $1.25 billion in the period, beating the $1.13 billion analysts expected.\nShares of Restaurant Brands International Inc. rose 5 percent to close at $56.30 on Tuesday.\n—————\nParts of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on QSR at https://www.zacks.com/ap/QSR",
    "source_domain": "abcnews.go.com",
    "title": "Burger King grows; Tim Hortons to get makeover",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/burger-king-grows-tim-hortons-makeover-54701974"
}