{
    "authors": [
        "Abc News",
        "More Joohee"
    ],
    "date_download": "2017-02-15 14:59:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "In Seoul, assassination of Kim Jong Un’s half brother captivates, doesn't amaze",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fspy-movie-seoul-assassination-kim-jong-uns-brother%2Fstory%3Fid%3D45508363.json",
    "image_url": "http://abcnews.go.com/International/spy-movie-seoul-assassination-kim-jong-uns-brother/story?id=45508363",
    "language": "en",
    "localpath": null,
    "maintext": "The assassination of Kim Jong Nam is presumed to have been based on North Korean leader Kim Jong Un’s “paranoia” about his half-brother, according to South Korea’s top spy agency. Kim Jong Nam was poisoned to death by two Asian women at Malaysia's Kuala Lumpur International Airport on Tuesday.\nPublic reactions in Seoul are of shock and horror, if not amazement.\n“We all know how brutal and psychotic Kim Jong Un is, but news every hour has been more like a spy movie,” said Park Choon Ho, a 60-year-old taxi driver.\n“Kim Jong Un is cruel and cold-blooded but this [assassination] only shows how insecure his political power stands,” noted Kim Do Yeon, a college student.\nGetting rid of the eldest son of the late Kim Jong Il has been a long “standing order” from Pyongyang, said South Korea’s national intelligence chief Lee Byung Ho at a briefing to the National Assembly.\nNorth Korean agents had actually attempted to assassinate Kim in early 2012, which led Kim to write a letter to his younger half brother, asking for mercy for him and his family.\n“I ask for you to cancel the punishment order on me and my family. We have nowhere to go and nowhere to hide. We clearly know that the only way to run away is to commit suicide,” the letter said.\nKim Jong Nam's first legitimate wife and eldest son, Kim Han Sol, are residing in Beijing. His second wife and their son and daughter have been living in Macao. The family members are under protection by the Chinese government, the spy agency confirmed.\nThe South Korean government has doubled the number of security guards protecting North Korean defectors who have held senior political positions in Pyongyang.\nThe national military also announced plans to spread the news to North Korean residents who are completely blinded from outside information by resuming news broadcasts on dozens of loudspeakers facing the North along the inter-Korean border.\nCCTV footage from the domestic check-in area at the airport showed two young Asian women approaching Kim. One woman was wearing a white T-shirt emblazoned with the block letters “LOL.” Jong Nam had complained to a ground attendant that someone had covered his nose and mouth with a piece of cloth and that his eyes burned. He died in the ambulance on the way to the hospital. Police in Malaysia have arrested an alleged 29-year-old female secret agent traveling on Vietnamese documents.\nAn autopsy of Kim Jong Nam's body has been completed at a morgue in the presence of the North Korean ambassador to Malaysia, Kang Chol, but the results are still unknown.\nABC News' Hong Yoo, from Seoul, and Maureen Jeyasooriar, from Kuala Lumpur, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "'Like a spy movie': In Seoul, assassination of Kim Jong Un’s half brother captivates, doesn't amaze",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/spy-movie-seoul-assassination-kim-jong-uns-brother/story?id=45508363"
}