{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 16:44:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "A recap of this week's episode of \"What Would You Do?\" with ABC's John Quiñones.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWhatWouldYouDo%2Frecap-man-pushes-pregnant-wife-lose-weight%2Fstory%3Fid%3D49208086.json",
    "image_url": "http://a.abcnews.com/images/WhatWouldYouDo/170811_wwyd_act1_901_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Here is a recap of this week's episode of \"What Would You Do?\" with ABC's John Quiñones.\nWhat would you do: Gender-appropriate toys\nA young boy picks out a doll for his mother to buy him at a toy store. She is ashamed by his choice and wants him to select what she considers a boy’s toy. A young girl wants to play with a truck, but her mother does not agree with her choice. What will other shoppers think when they see the mothers disapprove? Watch what happens:\nWhat would you do: Half his age\nA single father is introducing his daughter to his girlfriend for the first time. The daughter doesn't approve of his falling in love with a much younger woman. How will others react? Watch what happens:\nWhat would you do: OCD waiter\nA waiter’s obsessive-compulsive disorder is upsetting a pair of diners who say it is affecting their dining experience. How will other customers react? Watch what happens:\nWhat would you do: Roadside assistance\nOn a busy street, a motorist doesn’t know how to change his flat tire. How quickly will passersby offer to assist? What happens when the stranded motorist is an attractive blond woman? What about a Muslim man? Watch what happens:\nWhat would you do: Lesbian cake discrimination\nA lesbian couple is being denied a wedding cake at a bakery because the owner says same-sex marriage is in conflict with his beliefs. With whom will the other customers side? Watch what happens:",
    "source_domain": "abcnews.go.com",
    "title": "'What Would You Do?' recap: Man pushes pregnant wife to lose weight",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WhatWouldYouDo/recap-man-pushes-pregnant-wife-lose-weight/story?id=49208086"
}