{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 05:00:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Inglewood council to vote on exclusive negotiating deal with Clippers",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Finglewood-council-vote-exclusive-negotiating-deal-clippers%2Fstory%3Fid%3D48048426.json",
    "image_url": "http://abcnews.go.com/Sports/inglewood-council-vote-exclusive-negotiating-deal-clippers/story?id=48048426",
    "language": "en",
    "localpath": null,
    "maintext": "LOS ANGELES -- The Los Angeles Clippers want a new arena of their own and have focused in on Inglewood, California, as their future home.\nThe Inglewood City Council is scheduled to vote Thursday on an exclusive negotiating agreement with the Clippers to build a state-of-the-art arena on city-owned land. The 18,000- to 20,000-seat arena would be fully financed by Clippers owner Steve Ballmer, sources said. Ballmer, who is worth an estimated $31.8 billion, bought the Clippers for $2 billion in 2014.\nThe arena would sit on 22 acres just south of where a $2.6 billion football stadium is being built to house the Los Angeles Rams and Los Angeles Chargers. The football stadium, which is set to open in 2020, is the centerpiece of a 298-acre sports and entertainment district being built by Rams owner and real estate developer Stan Kroenke.\nWhile Kroenke and the Rams aren't directly involved in the Clippers' plans, the addition of 41 regular-season NBA games as well as other events the arena would attract every year would come as welcome news to Kroenke, as he plans to open restaurants, stores and a hotel on his site.\nThe proposed agreement with the Inglewood City Council, which is expected to be approved Thursday, would give the Clippers a three-year window to complete an environmental review and other inspections before moving forward with the project. The Clippers aren't expected to break ground on a new arena anytime soon. The team's lease to play at Staples Center runs through June 2024.\nThe Clippers currently share Staples Center with the Los Angeles Lakers, the NHL's Los Angeles Kings and the WNBA's Los Angeles Sparks. Ballmer became agitated with the arrangement fairly early in his ownership, sources said. AEG, which owns and operates Staples Center, also owns the Kings and a piece of the Lakers. The Clippers are effectively third in the pecking order when it comes to scheduling priority and need approval for anything they would want to do in the arena physically or cosmetically.\nThey are the only tenant at Staples Center without a championship banner or a retired jersey. The front of the arena is littered with statues honoring great Lakers and Kings players from Magic Johnson to Wayne Gretzky. The only permanent Clippers-related tribute at the arena is the media and team member entrance. Last year that stairway was named the \"Ralph Lawler Media and Team Member Entry,\" in honor of the Clippers' longtime play-by-play announcer.\nThe Forum in Inglewood was once the home of the Lakers, Kings and Sparks before Staples Center was built in 1999. The Forum was acquired by the Madison Square Garden Group in 2012 and underwent a $50 million renovation. It is now one of the premier concert destinations in Los Angeles.",
    "source_domain": "abcnews.go.com",
    "title": "Inglewood council to vote on exclusive negotiating deal with Clippers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/inglewood-council-vote-exclusive-negotiating-deal-clippers/story?id=48048426"
}