{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:18:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Bank of America profits jump, helped by interest rates",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbank-america-beats-street-1q-forecasts-46858336.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_a38824e5559e4e52a5e5c586bfee146f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bank of America's first quarter profits grew nearly 40 percent, the bank said Tuesday, helped by higher interest rates as well as a strong performance in its investment banking division.\nThe Charlotte, North Carolina-based consumer banking giant reported net income of $4.86 billion, compared with $3.47 billion in the same period a year earlier. On a per-share basis, Bank of America earned 41 cents per share, beating the 35 cents that analysts were looking for.\n\"The U.S. economy continues to show consumer and business optimism, and our results reflect that,\" BofA's CEO Brian Moynihan said in a prepared statement.\nLike its major competitors, JPMorgan Chase, Citigroup and Wells Fargo, Bank of America benefited from higher interest rates. The Federal Reserve raised interest rates once in December and again in March, which has allowed the big retail banks to charge more for their loans. The bank said it had net interest income of $11.06 billion, compared with $10.49 billion in the same period a year earlier.\nThe bank expects that if interest rates continue to move higher, Bank of America could see its net interest income grow by $3.3 billion over the next 12 months.\nBank of America's investment and trading divisions, which includes Merrill Lynch, also had a strong quarter, in line with the bank's competitors. Global investment banking had net income of $1.73 billion compared with $1.09 billion in the same period a year earlier.\nRevenue from trading rose to $3.9 billion from $3.4 billion.\nOverall, Bank of America had revenue of $22.49 billion compared with $20.79 billion in the same period a year earlier. The bank was able to keep its expenses flat as well, at $14.84 billion, which helped bolster the bank's bottom line.\nBank of America shares were up 0.7 percent in pre-market trading at $22.87.",
    "source_domain": "abcnews.go.com",
    "title": "Bank of America profits jump, helped by interest rates",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/bank-america-beats-street-1q-forecasts-46858336"
}