{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:24:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Shipments to nation's only nuclear dump will resume in April",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fshipments-nations-nuclear-dump-resume-april-45495672.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/shipments-nations-nuclear-dump-resume-april-45495672",
    "language": "en",
    "localpath": null,
    "maintext": "The U.S. Energy Department said Tuesday that shipments to the nation's only underground nuclear waste repository are expected to resume in April, more than three years after they were halted in response to a radiation release that contaminated part of the facility.\nOfficials released plans for nearly 130 shipments from federal laboratories and other national defense sites over the next year. Those sites must demonstrate that they're ready to load the radioactive waste and that it meets new safety requirements.\nThe Waste Isolation Pilot Plant was forced to close in February 2014 after an inappropriately packed drum of waste ruptured. Some operations resumed in December after an expensive recovery effort that has yet to be fully completed.\nOver the last three years, tons of waste left over from decades of nuclear weapons research and development has been stacking up at sites around the country, hampering the government's multibillion-dollar cleanup program.\nTodd Shrader, manager of the DOE's Carlsbad Field Office, acknowledged that the suspension of disposal work posed challenges for the agency and the sites where waste has been building up.\n\"Resuming shipments from generator sites is important to support cleanup and ongoing missions at those sites,\" he said in a statement. \"We look forward to doing that as soon and as safely as possible.\"\nMost of the shipments will be coming from the Idaho National Laboratory. Both Los Alamos National Laboratory and Oak Ridge in Tennessee are expected to send off two dozen shipments each. Several other shipments are expected from Savannah River in South Carolina and the private Waste Control Specialists site in Texas.\nThe Energy Department said the exact schedule will be adjusted based on several factors, including logistical issues such as weather and how quickly the waste can be taken below ground once it arrives at the Waste Isolation Pilot Plant in southern New Mexico.\nThe waste includes gloves, tools, clothing and other materials.\nIt was a drum packed at Los Alamos that triggered the 2014 release. Investigators have said the incident could have been avoided had existing policies and procedures been followed.\nIn the wake of the incident, policies were overhauled and criteria for characterizing, treating and packaging the waste were bolstered.\nPointing to a history of mismanagement and lax oversight, watchdog groups had voiced concerns late last year that the federal government was moving too quickly to reopen the repository. Federal officials have argued that corrective actions were taken and that state regulators did not identify any issues that would prevent work from restarting.\nWork to move the waste into its final resting place — disposal vaults carved out of an ancient salt formation about a half-mile below the surface — now takes more time because of the extra clothing, respirators and heavy monitoring devices that workers must wear to protect against the contamination. Limited ventilation also slows the work.",
    "source_domain": "abcnews.go.com",
    "title": "Shipments to nation's only nuclear dump will resume in April",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/shipments-nations-nuclear-dump-resume-april-45495672"
}