{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:12:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Feva-longoria-weaves-empowerment-clothing-line-53852712.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/WireAP_c08c3b8a01f84fe3a3c9bbd2b312b867_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Eva Longoria is a master of multitasking.\nThe 43-year-old actress is producing a new pilot, continuing her work with the Time's Up initiative, launching her clothing line on HSN and preparing to welcome her first child with husband Jose \"Pepe\" Baston.\n\"I have two babies,\" said Longoria with a hearty laugh. \"My line and my actual baby in my stomach.\"\nFor Longoria, who has been sewing and designing since she was 7, everything comes back to championing women.\n\"You have to be comfortable not only physically in what you're wearing, but like comfortable in your skin. Does that empower me? Do I feel like this is my best self today? And that's what my collection is meant to do.\"\nThe former \"Desperate Housewives\" star has been rallying for parity in Hollywood and beyond alongside the Time's Up campaign, which raised $20 million and helped 1,500 women with harassment suits. She gave an impassioned speech at the recent women's march in Los Angeles and called out E! over a pay equity dispute with former anchor Catt Sadler during an interview with the network at the Golden Globes.\n\"It's not a moment, it's a movement,\" she said of continuing the momentum after Hollywood's awards season. \"It needs to be celebrated and applauded every time we have an accomplishment. But at the same time, we just need to keep moving it forward and we need to keep making real change.\"\nThe thread of female empowerment is also woven throughout the Eva Longoria Collection.\n\"I wanted to really get inspiration from real women in the world and I wanted to use my global travels to, you know, give it a personality of not only Eva's DNA, but a global DNA of like women everywhere doing everything,\" she said.\nHer spring line features ruffled sleeves, graphic tees, floral patterns and feminine pleated skirts meant to be dressed up for work or down with a pair of sneakers.\nDuring an interview in Los Angeles, Longoria showed off patterned crepe jumpsuits, which she calls \"onesies,\" wide-legged pants and comfy stretch denim she promised will ward off the dreaded muffin top.\nLongoria sported one of the collection's popular bomber jackets in floral-print jacquard, joking that it's the only thing that fit her growing belly.\n\"I'm in the golden months of energy! And the glow— although that's my highlighter,\" she said. \"I feel great. I feel good, you know, and I feel my best when I'm working. So people are like, 'Slow down! Slow down!' And it's just not who I am. It's not in my DNA.\"\nThere's little time to relax as she's currently producing a pilot for the ABC drama \"Grand Hotel,\" launching her collection live on HSN on March 22 and 23 and starring in the remake of 80's comedy \"Overboard,\" which premieres in May.\n\"Then I can really relax and just bake the baby,\" she added.\n—————\nOnline:\nhttps://www.hsn.com/shop/eva-longoria/9160\nhttps://evalongoria.com\n—————\nFollow Nicole Evatt on Twitter at https://twitter.com/NicoleEvatt",
    "source_domain": "abcnews.go.com",
    "title": "Eva Longoria weaves empowerment throughout her clothing line",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/eva-longoria-weaves-empowerment-clothing-line-53852712"
}