{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:13:35+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Nominations for 75th annual Golden Globes coming Monday",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fnominations-75th-annual-golden-globes-coming-monday-51711847.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_c7d132eeeaea45db9d3dfd7d5497c497_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Golden Globes? Add Golden Globes as an interest to stay up to date on the latest Golden Globes news, video, and analysis from ABC News. Add Interest\nWhen nominations for the 75th annual Golden Globe Awards are announced Monday morning, the shadow of sexual misconduct scandals will be hard to avoid.\nThe nominations will begin at 8:15 a.m. EST. A second batch of nominees will follow live on NBC's \"Today\" show, where less than two weeks earlier, longtime host Matt Lauer was fired following multiple allegations of sexual misconduct.\nLauer was just the latest media figure to be toppled by the ongoing revelations that have followed the ouster of former Weinstein Co. co-chairman Harvey Weinstein, along with many others, including Kevin Spacey. As a co-star in Ridley Scott's upcoming \"All the Money in the World,\" Spacey — whose performance has been removed in reshoots — might have once expected to hear his named among Monday's best supporting actor nominees.\nAmazon's \"Transparent\" and star Jeffrey Tambor have also been regular Globes nominees, and could be again Monday for the show's fourth season. Two women have come forward in the past month to accuse Tambor of sexual harassment, including \"Transparent\" actress Trace Lysette and his former assistant. Tambor has said \"the idea that I would deliberately harass anyone is simply and utterly untrue.\"\nThe Globes will be the most prominent platform yet in Hollywood's awards season to confront the post-Weinstein landscape. Presented and chosen by the Hollywood Foreign Press Association, their deliberations aren't representative of the larger industry. The HFPA is composed of approximately 90 largely unknown international journalists.\nBut the Globes, which this year will be hosted by Seth Meyers on January 7, have long characterized themselves as one of the frothiest stops on the awards season circuit. Many will be watching to see how the Globes weigh the likes of \"Transparent\" and \"All the Money in the World.\" A rough cut of the latter was reportedly screened for the HFPA shortly after Scott finished reshooting the film with Christopher Plummer stepping in for Spacey.\nAmong the favorites at the Globes this year are Steven Spielberg's Pentagon Papers drama \"The Post\" and Christopher Nolan's World War II tale \"Dunkirk.\" In the television categories, Hulu's \"The Handmaid's Tale\" and HBO's \"Big Little Lies\" could be in for a big morning.\n———\nFollow AP Film Writer Jake Coyle on Twitter at: http://twitter.com/jakecoyleAP",
    "source_domain": "abcnews.go.com",
    "title": "Nominations for 75th annual Golden Globes coming Monday",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/nominations-75th-annual-golden-globes-coming-monday-51711847"
}