{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 20:51:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Americans sentenced in Panama for 5 murders",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Famericans-sentenced-panama-murders-49212416.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_139e7c32523041a3ac08f53907b404ce_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. citizen William Dathan Holbert was sentenced to 47 years in prison by a court in Panama for robbing and killing five other Americans in a Caribbean tourist destination, authorities said Monday.\nHolbert's ex-wife Laura Reese was sentenced to 26 years for her role.\nAuthorities said Holbert admitted killing five people between 2007 and 2010 in Bocas del Toro province in order to steal their property.\nHolbert's lawyer, Claudia Alvarado, suggested an appeal was likely.\nHolbert and Reese were arrested while trying to enter Nicaragua from Costa Rica in 2010.\nThat year, the bodies of four adults and one child were found buried on the property of a hostel that Holbert owned.\nHolbert killed a U.S. citizen named Mike Brown, his wife and young son in 2007. Authorities have said Brown may have been living under an alias and they don't know where he was from. In 2010, Holbert killed Cheryl Lynn Hughes, a native of St. Louis, Missouri, who ran a small hotel in Panama, and Bo Icelar, former owner of a gallery in Santa Fe, New Mexico.\nHolbert had left North Carolina after he went through a divorce to a previous wife, sold his landscaping business and filed for bankruptcy. He met Reese in North Carolina.\nIn Montana, Holbert stole a car and sold it. Back in North Carolina he sold a $200,000 home that he didn't own. Authorities pursued him across a half dozen states that included a high-speed chase in Wyoming.\nHe and Reese had been living in Panama under the alias Cortez. They were fleeing a Panamanian investigation when they were arrested in Nicaragua.",
    "source_domain": "abcnews.go.com",
    "title": "Americans sentenced in Panama for 5 murders",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/americans-sentenced-panama-murders-49212416"
}