{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 08:34:15+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fleagues-casinos-lobby-states-cut-legal-sports-bets-53867651.json",
    "image_url": "https://s.abcnews.com/images/Sports/WireAP_e3b31c2c675a47e693a3279e8aeb3249_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With the Supreme Court poised to rule on a case that could end the federal ban on sports gambling, more than a third of U.S. states are considering legislation to get in on the action, and professional leagues and casino interests are lobbying against each other for the biggest cut of the winnings.\nThe push to legalize betting on sports has already led to fractures in an uneasy alliance that had developed between leagues and gambling legalization advocates before Supreme Court arguments last fall.\nThe NBA and Major League Baseball have been asking states to give them 1 percent of the total amount wagered on their games, calling it an \"integrity fee\" so they can protect their products and snuff out attempts at cheating and game-fixing.\n\"Now, let's be clear — that's just a euphemism for a cut of the action,\" Joe Asher, CEO of William Hill U.S., a sports book operator, told New York state lawmakers in January. \"There will be plenty of financial benefits to the leagues.\"\nGambling proponents say kicking back that much to the leagues would make sports books unprofitable and prevent a legal, regulated betting market from developing. They're seeking an arrangement similar to what exists in Nevada, where the state takes 6.75 percent of winnings on top of a federal tax of 0.25 percent of the amount wagered.\nCasinos have a built-in edge when it comes to battling in statehouses. Casinos are legal in 40 states; the commercial companies and American Indian tribes that run them are well-versed in dealing with regulators and state lawmakers. The NBA and MLB, on the other hand, are new to lobbying states on gambling and have sometimes relied upon the bully pulpit of their commissioners to get their point across.\n\"The leagues feel like they're out of their element, and that's making them uncomfortable,\" said Kevin Braig, a Columbus, Ohio-based attorney, gambling industry analyst and handicapper. \"The gaming industry lobbies all the states. I think it goes even beyond that: They're almost partners in what they're doing. They have a very close relationship because they have very closely overlapping interests.\"\nBefore the Supreme Court heard New Jersey's challenge to the 1992 federal law limiting sports betting to the four states that already had laws on the books, casino interests — and their influential trade group, the American Gaming Association — were encouraged by the professional leagues' changing attitudes about gambling, even as leagues argued before the justices that the ban should remain. NBA Commissioner Adam Silver has said betting should be legalized and MLB Commissioner Rob Manfred has said it could enhance fan interest in the sport. Although the NFL remains publicly opposed to gambling, Commissioner Roger Goodell has said his position has \"evolved.\"\nThe NFL and the NCAA have sat out the debate entirely in states considering legislation. That's despite the fact that 31 percent of sports gambling winnings in Nevada last year came from football bets, and more is wagered on college basketball's NCAA Tournament than on the Super Bowl.\nThe NBA and MLB argue their reputations are on the line because of the possibility of games being fixed. Sports fans are still familiar with the Black Sox scandal of 1919, Pete Rose's lifetime banishment from baseball for betting on games and a point-shaving scandal involving former NBA referee Tim Donaghy.\n\"The damage from even a hint of scandal will hurt the sports leagues far worse than anyone else,\" said Bryan Seeley, senior vice president and deputy general counsel at MLB.\n\"The NBA spends billions of dollars each year creating the games that would serve as the foundation for legalized sports betting, while bearing all of the risk and therefore incurring enormous additional expenses for compliance and enforcement,\" NBA spokesman Mike Bass said. \"As a result, we believe it is reasonable for operators to compensate the NBA with a small percentage of the total amount bet on our games.\"\nState regulators monitor wagering 24/7 in Nevada, and the leagues pay contractors to monitor overseas bets.\nCasinos argue that sports books don't make much money and are really there to get gamblers in the door. Unlike blackjack or slots, where casinos have a house edge, sports books make money by encouraging individual gamblers to each side of a wager, and then charging a percentage for placing the bet. Casinos say leagues will benefit from enhanced fan interest and gambling-company sponsorships.\nBills to legalize sports betting have been introduced in 18 states. This month, West Virginia approved a bill that would legalize sports betting immediately if the Supreme Court allows it. A decision by the court is expected this spring.\nMississippi, New Jersey, New York and Pennsylvania have also already authorized sports gambling. New York is considering whether to expand a law already on the books to allow sports gambling at racetracks and betting parlors. In Iowa, a bill to authorize sports books has advanced out of committee.\nThe states that have only introduced bills or are not as far along in the process are California, Connecticut, Illinois, Indiana, Kansas, Kentucky, Louisiana, Maryland, Michigan, Missouri, Oklahoma, Rhode Island and South Carolina.\nThe NBA and MLB haven't successfully sold lawmakers on a 1 percent cut so far, although the New York bill was amended to give 0.25 percent of the amount wagered to the leagues.\nWest Virginia's new law doesn't kick back anything to the leagues. Manfred said it has \"serious problems\" and benefits \"only the gaming industry.\" He may have found a sympathetic ear in Republican Gov. Jim Justice, who allowed the bill to become law without his signature and urged lawmakers to consider partnering with the leagues.\nWhile 1 percent may not sound like a lot, sports books generally hold onto only around 5 percent of what's wagered. That means a 1 percent tax on the handle can siphon away about 20 percent of gambling revenue. Add state and federal taxes, and casinos may find sports books to be a sucker bet.\nSara Slane, senior vice president of public affairs at the American Gaming Association, said the proposed fee runs counter to the leagues' and casinos' shared goal of curtailing illegal gambling.\n\"If you are trying to stamp out the illegal market and drive more traffic to the legal, regulated market,\" Slane said, \"you're not going to be able to accomplish that with this type of business model.\"",
    "source_domain": "abcnews.go.com",
    "title": "Leagues, casinos lobby states for cut of legal sports bets",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/leagues-casinos-lobby-states-cut-legal-sports-bets-53867651"
}