{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 20:45:36+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Police: 5-year-old girl burned in voodoo ritual; 2 charged",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpolice-year-girl-burned-voodoo-ritual-charged-52816757.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_24f0235d15c44783ad1367aee95d3afb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two sisters tied down and burned a 5-year-old girl, permanently disfiguring her, in a voodoo ritual meant to rid her of a demon causing her to misbehave, police said. The women also threatened to cut off the head of the girl's 8-year-old brother with a machete, authorities said.\nThe boy said his sister was tied down on at least two occasions while the sisters blew fire over her face and cut her on the arm and in the collar area with a needle-like object, drawing blood, according to police. The girl said the women also poured over her eyes a substance that stung.\nPeggy LaBossiere, 51, and Rachel Hilaire, 40, of East Bridgewater, denied injuring the girl and threatening the boy, the Brockton Enterprise reported . They pleaded not guilty on Jan. 29 to mayhem, assault and other charges. A public defender for the women didn't return a call seeking comment on Saturday.\nPolice say the girl's mother is a hair stylist of Haitian descent who has LaBossiere as a client and requested the ritual. She has not been charged but is receiving mental health treatment.\nThe sisters will be back in Brockton Superior Court on Wednesday for a hearing to determine whether they're too dangerous to be released.\nThe sisters told police that they have performed \"cleansing baths\" for family and friends in the past, something that involves chanting prayers, rubbing frankincense and eucalyptus oils and sea salt on their bodies, and burning myrrh, the newspaper reported. Children sometimes get burned as spirits leave the body, they said.\nThe girl suffered a third-degree burn across her face that will leave her permanently disfigured, police said. She was treated at a hospital and taken into custody by state welfare authorities, along with her brother, who described to police what happened at the sisters' house over multiple days.\nVoodoo refers to religious practices developed centuries ago by enslaved Africans in the Caribbean, primarily in Haiti, where the practices are sometimes spelled \"vodou.\"\n———\nInformation from: The (Brockton, Mass.) Enterprise, http://www.enterprisenews.com",
    "source_domain": "abcnews.go.com",
    "title": "Police: 5-year-old girl burned in voodoo ritual; 2 charged",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/police-year-girl-burned-voodoo-ritual-charged-52816757"
}