{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:14:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Scott Peterson breaks his silence on his conviction: 'I had no idea it was coming'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fscott-peterson-breaks-silence-murder-conviction-idea-coming%2Fstory%3Fid%3D49195999.json",
    "image_url": "http://a.abcnews.com/images/US/scott-peterson1-gty-ml-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Scott Peterson, who was found guilty of murdering his pregnant wife and unborn child nearly 15 years ago, is breaking his silence for the first time since the conviction, saying, \"I was staggered by it. I had no idea it was coming.\"\nPeterson spoke out from death row in an interview for an upcoming A&E documentary series, \"The Murder of Laci Peterson,\" which premieres Tuesday. The series takes a new look at the case that riveted the nation, after Laci Peterson disappeared on Christmas Eve in 2002, while eight months pregnant. Her body and the body of her unborn child were later found in San Francisco Bay.\nJohn Marks, one of the Executive Producers of the documentary, said Scott Peterson may have decided to speak out for the first time since his conviction now, more than a decade later, because he is in the process of appealing his sentence.\n\"There's an appeals process that's ongoing, so his case is under appeal,\" Marks told ABC News. \"So it felt like a moment, I think, for him, and for his lawyer to step up and ... say something about the case.\"\nIn the documentary, Peterson also described the moment he found out about his guilty verdict.\n\"It was crazy, just this amazing, horrible, physical reaction I had,\" Peterson said, adding that he \"couldn't feel my feet on the floor. I couldn't feel the chair I was sitting in. My vision got a little blurry.\"\nThe documentary series revisits most of the key players in the case, including Scott Peterson's former mistress, Amber Frey.\nFrey recalls how scared she was when she learned Scott Peterson was actually a married man with a missing wife, and when she had to pretend everything was fine as Scott Peterson continued calling her after Laci Peterson vanished.\nIn a never-before-broadcast audio recording from 2004, Scott Peterson addresses why he decided to talk to Frey after his wife had gone missing, saying, \"The overriding reason throughout it all was she starts giving media interviews, there is no more search for Laci and Conner,\" referring to the unborn child they had planned to name Conner.\n\"I'd seen what had happened to the search for Chandra Levy with Gary Condit as soon as it was revealed that he had sex with her, there was no more search for her,\" Scott Peterson added.\nMarks told ABC News that even as the 15-year anniversary of the case approaches, the new documentary reveals details that many have never heard before.\n\"I think when you listen to the witnesses who say they saw Laci in the park, I think that will be really ... that will be kind of a surprise,\" Marks said.\nMarks, who maintained that the documentary is not an exoneration piece, also opened up about what he is hoping to accomplish with the series, telling ABC News, \"I just want people to say, 'What actually happened here?'\"\n\"The Murder of Lacie Peterson\" premieres on the A&E Network on Tuesday, August 15 at 10 p.m. ET.",
    "source_domain": "abcnews.go.com",
    "title": "Scott Peterson breaks his silence on his murder conviction: 'I had no idea it was coming'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/scott-peterson-breaks-silence-murder-conviction-idea-coming/story?id=49195999"
}