{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-05-30 21:26:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "This will be the actress' fifth child.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fbrigitte-nielsen-pregnant-54%2Fstory%3Fid%3D55538675.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/brigitte-gty-er-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Danish actress Brigitte Nielsen is expecting a baby, she announced Wednesday.\nThe 54-year-old TV personality and model took to Instagram to reveal two photos of her pregnant belly and tell her nearly 86,000 followers: \"family getting larger.\"\n\"happy time positive vibes #happyness [sic] #positivevibes,\" she captioned one shot.\nThis will be the fourth child for Nielsen, who has been married to her current husband, Mattia Dessi, for more than a decade. She also has four sons, ages 34, 28, 25 and 23, from previous relationships.\nIn 2011, Nielsen, who has appeared on reality TV shows including \"The Surreal Life\" and \"Celebrity Big Brother,\" told The Guardian that she was hoping to have another child, but felt torn about doing so because of her age.\n\"I would love to because of all the things I have learned. It would be like starting all over again. But am I too old? I'm young at heart and I would be different this time round,\" she said. \"Mattia and I have discussed it, but I don't know how likely it is. And to interfere with things just because I feel as if I could give more to a child than I did when I was 20 – is that too selfish? I don't know.\"\nA representative for Nielsen did not immediately respond to ABC News' request for comment.",
    "source_domain": "abcnews.go.com",
    "title": "Brigitte Nielsen is pregnant at 54",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/brigitte-nielsen-pregnant-54/story?id=55538675"
}