{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:09:43+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "During her plea hearing, Morgan Geyser described to the judge her role in Payton Leutner's stabbing.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2F2020%2Fvideo%2Fgirls-trial-separately-slender-man-stabbing-case-part-52809943.json",
    "image_url": "http://a.abcnews.com/images/2020/180202_2020_act5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Girls go on trial separately in Slender Man stabbing case: Part 5\nReporter: It has been more than three years now since that horror in the woods in waukesha, Wisconsin, and now a community torn. As brutal as the attack was, what do you with two girls who were just 12 years old when they did it? Morgan geyser and Anissa Weier are now preparing to be tried as adults, facing the possibility of decades in prison. I mean, to me, it's unthinkable to try a 12-year-old child as an adult, regardless of what they've done. Reporter: You know there are some who will say she planned it and look what she did. I don't think that any of that changes the fact that she was a child. We do everything else possible in our society to protect our children from themselves. For some reason, we view that differently been within the criminal justice system, and that just doesn't make sense to me. Reporter: Both girls plead not guilty by reason of mental disease or defect. The girls will be tried separately. Anissa's case is first. And just days before her trial, she strikes a deal with prosecutors pleading guilty to a lesser charge of attempted second degree intentional homicide. Anissa took the plea deal. It was her decision to plead guilty to save Payton from reliving that day. Reporter: But as part of that deal, Anissa will now stand trial so a jury can determine if she should be sent to prison or to a state mental institution instead. The evidence will show. Reporter: Now 15 years old, walking into court -- Anissa's attorney Joe Smith, acknowledges she attacked her friend, but argues she is not criminally responsible because she was under the spell of a delusion. The prosecution paints a starkly different picture of a calculating 12-year-old. She knew what she was doing was wrong. Reporter: The defense calls family members, friends, teachers to the stand to testify that they never knew Anissa was struggling with mental illness. I do. Reporter: Starting with her father bill. Was there any time where she expressed that she had seen things? There was an episode when Anissa was about 10. She had gone to bed for the night. She saw something in her closet looking at her. So, you know, 10-year-old, monster in the closet. We turned the lights on, we opened the closet, nothing's in there. I didn't give it any more credit than that. Reporter: But it would turn out the centerpiece of the testimony would be testimony from three mental health experts. Reporter: Have you ever seen a case like this before? No, it's almost unfathomable that this could happen. Reporter: Dr. Melissa Westendorf was one of the court appointed forensic psychologists who evaluated Anissa. What they had in common was the delusion about slender man. Reporter: Neither family knew that their daughters -- were mentally ill. Is that difficult for you to believe? No. Reporter: That it would go unnoticed? It can go unnoticed. You know, especially with delusions. Delusions can remainl compartmentalized, for people. Reporter: And it was Morgan's mother Angie who told us she believes her daughter actively hid her delusions from those around her. I think that, as she got older, and she realized that hey, maybe this isn't Normal, that she did make a conscious effort to hide it. A lot of her hallucinations were friends to her, and I don't think that she wanted to lose those friends. Reporter: And Dr. Westendorf says there also may have been something uniquely compelling, to these already vulnerable minds of Morgan and Anissa, about the way slender man is presented online. Once you find this character on the internet, you can read all these stories that look real. Reporter: And the doctor says with Anissa, there was something different at play. Remember it was Morgan who was diagnosed with schizophrenia. Dr. Westendorf then diagnosed Anissa with what's called a \"Shared psychotic disorder.\" Saying that with Morgan's schizophrenia when paired with both of their delusions about slender man would create a perfect storm, luring Anissa in too. Reporter: A lot of parents will say, \"My 12-year-old knows the difference between right and wrong. They would know that it's wrong to stab your friend 19 times in the woods.\" How did they not know this? They appreciated that what they were doing was wrong. Reporter: So if they knew it was wrong, why do it? Because their belief in slender man was so powerful and was so strong, they believe that if they did not fulfill their plan, slender man was going to come back and kill their families. Reporter: Dr. Westendorf testified that because Anissa's mental disorder led to her actions that day in the woods that she should not be held criminally responsible. Prosecutors disagreed. All the psychiatrists were saying the same thing, which is they had this shared delusion and that compulsion was, \"If we don't kill Payton, then slender man is going to either kill us or our families.\" And what we argued repeatedly was Anissa, by her own words, said she didn't even know that slender man was a threat till after the act was over. The silly thing about this was I didn't know I was in danger until -- after. Reporter: The case goes to the jury. The seven men and five women deliberate for 11 hours before coming back with their decision. As they file in we see Anissa visibly shaking. Anissa Weier was found not guilty by reason of mental disease or defect. With that, I will order that she be committed to the department of health services. Their decision was humane. Reporter: But her daughters sentencing was yet to come and given the jury's decision in Anissa's trial, prosecutors now allowed Morgan to plead guilty too. Her family awaiting sentencing as well. She's sick, and she belongs in a mental health facility as opposed to a prison. Reporter: At her plea hearing Morgan is required to tell the judge what she did. What did you do on may 31, 2014? I hurt Bella. All right so what did you do? I came up from behind her and I jumped on her. And then what happened? And then I stabbed her.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Girls go on trial separately in Slender Man stabbing case: Part 5",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/2020/video/girls-trial-separately-slender-man-stabbing-case-part-52809943"
}