{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:23:31+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Centrist upends French presidential race in era of extremes",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fcentrist-upends-french-presidential-race-era-extremes-45504059.json",
    "image_url": "http://abcnews.go.com/International/wireStory/centrist-upends-french-presidential-race-era-extremes-45504059",
    "language": "en",
    "localpath": null,
    "maintext": "France's presidential race this year is upending every political assumption that has governed the country for decades.\nAnd now Emmanuel Macron, a 39-year-old former economy minister who is running an independent, centrist campaign, has a real chance to become France's next president in the country's two-round April-May vote.\nAmong the startling events: an incumbent president is not running. His prime minister did not win the Socialist primary. The far right is surging. The conservative front-runner who vowed to slash government spending has seen his chances plummet after giving his wife and children well-paid jobs for years.\nJealous rivals call Macron a guru with no substance. Macron, who plans to present a budget for the five-year presidential term next week and a platform later, mostly promises the French a better future — and that may be enough.\n\"Some people think we are a sect. Welcome,\" Macron joked in front of hundreds of supporters at the Bobino theater in Paris.\nRecent polls show Macron could be among the two top contenders to emerge from the April 23 ballot and advance to the presidential runoff on May 7, where he would be in a good position to win against his expected opponent, Marine Le Pen of the far-right National Front.\nA former investment banker with impressive academic credentials, Macron is young, outspoken and sometimes theatrical. He speaks fluent English and is very familiar with social media. Macron backs free-market, pro-European policies and litters his speeches with references to mythology, philosophy or literature.\nMacron became Socialist President Francois Hollande's economic adviser in 2012 and two years later, his economy minister. Last year he launched his own centrist political movement En Marche (\"In Motion\").\nConservative rival Francois Fillon and far-right politician Florian Philippot of the National Front recently compared Macron to a \"guru.\"\nFillon, the former favorite, has seen his popularity sink following revelations about well-paid — and possibly fake — political jobs that he gave his wife, son and daughter. Fillon admits the practice was legal at the time but is \"unacceptable\" now. Prosecutors are investigating.\nFillon has criticized Macron's \"political adventure without a program\" but Macron told the Journal du Dimanche that politics are \"mystical.\"\n\"It's an error to think the program is at the core of a campaign,\" he said.\nMacron has proposed to cut taxes for businesses, wants to reduce by half the number of pupils per class in poor neighborhoods. He traveled to Algeria, a former French colony, this week to boost his international stature. He has also visited the United States, Germany and Lebanon in the last few months and will hold a rally in London next week.\nIn a video on Twitter, Macron urged researchers, entrepreneurs and engineers working on climate change in the U.S. to leave for France.\n\"You are welcome ... we like innovation, we want innovative people!\" he said in English, in a bid to capitalize on U.S. President Donald Trump's doubts about global warming.\nMacron has also laughed at rumors about his sexuality. He said having a gay affair while also being married would come as news to his wife, Brigitte.\n\"Since she shares my life from morning to night, her only question is how, physically, I would manage,\" he joked at the Bobino theater.\nBrigitte Macron-Trogneux, who was his secondary school theater teacher, is 24 years older than her husband. While French politicians traditionally keep their private lives private, she acts more like an American political spouse, attending her husband's rallies and public events. The couple appears hand-in-hand on the front page of celebrity magazine Paris Match for the fourth time.\n\"You'll be hearing the worst things about me. It's unpleasant, it's discourteous and sometimes it's hurtful,\" Macron told his supporters. \"I am who I am. I've never had something to hide.\"\nThe polling institute Ifop says Macron tends to be popular among educated people from the upper and middle-class — and unpopular in the working class.\nThis illustrates the dividing line between the winners and the losers of globalization, wrote Jerome Fourquet of Ifop.\n\"By designating each other as their main rival, Marine Le Pen and Emmanuel Macron pursue a common interest: substitute the traditional confrontation between the left and the right by this new division,\" Fourquet wrote.\nMacron calls the divide \"progressives against conservatives\" while Le Pen \"the pro-globalization against the patriots,\" he said.\nPolitical scientist Thomas Guenole says Macron's rising popularity has been aided by the media. Last year, the proportion of articles about him in French newspapers was oversized compared to his relatively low profile, Guenole told The Associated Press.\n\"Nobody can detail his program ... yet people have sympathy for him,\" he said, adding that what he called Macron's \"doped\" popularity is likely to lead to real results in the presidential election.",
    "source_domain": "abcnews.go.com",
    "title": "Centrist upends French presidential race in era of extremes",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/centrist-upends-french-presidential-race-era-extremes-45504059"
}