{
    "authors": [
        "Abc News",
        "Susan Schwartz",
        "More Enjoli",
        "More Susan"
    ],
    "date_download": "2018-07-04 22:22:44+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Maya Tisdale, a 4-year-old with cerebral palsy, was captured on video posted to social media taking her first independent steps after surgery.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2Fyear-cerebral-palsy-celebrates-taking-independent-steps%2Fstory%3Fid%3D56370753.json",
    "image_url": "https://s.abcnews.com/images/Health/cerebral-palsy-06-ht-mt-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A 4-year-old with cerebral palsy in Michigan stole the hearts of countless people recently when her family posted video of her gleefully taking her very first independent steps.\nWith her parents, older brother and pet dog close by and urging her on softly, Maya Tisdale, beaming from ear to ear, rises from a blue bench in their Traverse City home and takes a few steps. In the video, she then sits back down but not before celebrating the major milestone.\n\"I'm walking! ... I'm walking!\" Maya says in the video posted to social media Sunday. \"I'm walking! Yes! ... I even took a big step.\"\nAnn Tisdale\nThe moment took just a few seconds but for her family and for Maya, it was a momentous journey.\nHer mother, Ann Tisdale, told ABC News Wednesday that Maya was born four months early at 26 weeks and weighed 1 pound, 10 ounces at birth. Her fighting spirit in the NICU earned her the nickname \"Mighty Miss Maya\" among family and friends.\nBefore she turned 2 years old, however, Maya was diagnosed with spastic diplegia cerebral palsy.\nThis specific type of cerebral palsy caused \"the muscles in her hips, legs and feet to be tight or spastic\" and left her \"unable to stand on her own for more than a few seconds, or walk without the use of walker,\" the family's website said.\nAnn Tisdale\nTisdale said that despite the diagnosis, Maya remained very independent, wanting to do everything that her two older brothers did.\n\"We're always trying to help her and she always says, 'No, I can do it!'\" she said. \"She doesn't need or want help to do things. She's going to try to do it herself.\"\nTisdale said that although Maya had been using the assistance of a walker since she was 1, Maya really desired to walk independently.\nAnn Tisdale\nSo, in March, after much research and appointments, her family traveled with her to St. Louis Children's Hospital in Missouri, where she underwent a surgical procedure called Selective Dorsal Rhizotomy.\nAccording to the family's website, the surgery was intended to \"permanently reduce Maya's spasticity, giving her the ability to live with less pain and greater mobility.\"\nTisdale said after the surgery, Maya's doctor had told them that she'd be able to walk \"someday\" but not without grueling, daily physical therapy.\nAnn Tisdale\nSo watching Maya walk -- just a smidge past seven weeks postsurgery -- left her family in shock and disbelief.\n\"We expected where Maya was before surgery that it would take her at least six months to a year to get to independent steps and here we are seven weeks after. ... She's just kind of blowing it out of the water,\" Tisdale said.\nWhile she celebrated this joyous moment for her daughter, Tisdale said Maya had a \"long road of learning\" ahead of her.\nAnn Tisdale\n\"Maya still has CP (cerebral palsy). She still has the damage in her brain and she still has some tightness in her legs. ... She's going to continue with physical therapy five days a week, just like we've been doing, and get stronger and practice her skill of walking,\" she said. \"But to just to have those first steps and knowing that it's possible is so great for her and our family.\"",
    "source_domain": "abcnews.go.com",
    "title": "4-year-old with cerebral palsy celebrates after taking first independent steps",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/year-cerebral-palsy-celebrates-taking-independent-steps/story?id=56370753"
}