{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 18:01:44+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "James Shaw Jr., along with friend Brennan McMurry, spoke on the floor of the Tennessee state legislature.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fheroes-waffle-house-shooting-honored-lawmakers-54696254.json",
    "image_url": "https://s.abcnews.com/images/US/180424_vod_orig_waffle_house_heroes_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Heroes in Waffle House shooting honored by lawmakers\nAll I can say is. This was. His is that true test of a man. I do what's a year. Apologize to to the people that loss. Low ones. For is so friendly. I would Tbilisi. I want to go see victims. And Vanderbilt hospital did worrying critically at issues that are now in a stable condition. They out they all remember me. But I want to ought to know. And I'll say this in. A medieval person. I didn't actually doing to save people did it is to save my life. ME saving lives I saved a couple of so. That's probably one of the greatest. Things update. You could do so. That's that's all that's all I have to say. Mr. Mick Mary you'll recognize. This man right here is. Now only a hero to many. He's of this for an me. You know when. You hear shots very out bolstering shots very close to you you can feel the wind off the bullets going past you. You don't really have time think. I talked to a general manager of my my bank and we have. Active shooter training. And they tell you that the first he is supposed to do is run. If you can't run the new guy. And if you can't five. We ran. We tried to get to the back door and didn't I told people to jump into the bathrooms. And locked the doors I mean there's no other way to go back out towards shooters so I thought by saying that the time that was on the way to save my life. And by pushing other people and at bats in the cargo hallway but. He sometimes doesn't listen to me. And this is by far the best time that you've never listen to me and I appreciate that. He's a best friend he's a great man you can see very humble. And I'm very thankful to you. I'm thankful that my parents for raising me. The second set of parents to me. And I'm just glad that I got to go home see my wife and my son. And also his daughter who's my god daughter. It is you know got put you in certain places for reason and if we would have never left that bureau Waffle House. And went to the Murfreesboro and it would be would be standing here. And a lot of people probably wouldn't be there so I thank god for that. And I think you guys who recognize Anniston we keep saying is we dated to try to save ourselves. And I'm just glad that there are more people on earth today. In they may have not been. So thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Heroes in Waffle House shooting honored by lawmakers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/heroes-waffle-house-shooting-honored-lawmakers-54696254"
}