{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 03:16:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Pence, headed to Japan, turns focus to trade with key ally",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpence-headed-japan-turns-focus-trade-46852774.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_b109f7d4b83346f5acdad6cb20c7e064_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. Vice President Mike Pence is traveling to Japan for talks expected to focus largely on trade with America's anchor ally in the region.\nConcluding a visit to South Korea, Pence told business leaders in Seoul on Tuesday the administration is taking a fresh look at trade agreements as part of its \"America First\" policy.\n\"We're reviewing all of our trade agreements across the world to ensure that they benefit our economy as much as they benefit our trading partners,\" Pence told the American Chamber of Commerce in Korea.\nWhite House officials said the economic meetings in Tokyo, with Deputy Prime Minister Taro Aso and other officials, are meant to forge a framework for future discussions after the U.S. withdrew from a Pacific Rim trade pact.\nThey will serve as the kickoff to the U.S.-Japan economic dialogue that was announced by President Donald Trump and Prime Minister Shinzo Abe in February.\nWhile Japan's trade surplus with the U.S. is much smaller than China's, Trump has decried the imbalance, especially in auto exports.\nIn Japan, Pence's two main goals are to spur increased U.S. access to Japanese markets and strengthen Japanese foreign investment.\nBoth sides said they do not expect the talks in Tokyo this week to delve into sector-by-sector talks on trade. With no U.S. Trade Representative yet in office and other key negotiator positions still unfilled, such nitty-gritty discussions will have to come later.\nBut the meetings could indicate how forcefully the U.S. will pressure Japan to further open its farm and automotive sectors.\nPence's advisers said the vice president would seek to make the case to Abe and Aso that the U.S. rejection of the Trans-Pacific Partnership, or TPP, under Trump did not signal a U.S. withdrawal from trade and economic development in the region.\nBefore Pence's arrival, Aso told Japanese broadcaster NHK that Japan was providing, \"not friction, but cooperation.\"\nChief Cabinet Secretary Yoshihide Suga told reporters over the weekend that Japan might push ahead with a revised, 11-nation version of the TPP despite the U.S. rejection of the trade accord.\nAs Indiana governor, Pence saw firsthand the impact of Japanese automakers Toyota, Honda and Subaru, whose factories employ thousands of people in his home state.\nDuring his visit to South Korea, at the outset of his 10-day trip to Asia, Pence's attention mostly was directed at the North Korean situation.\nWhile inspecting the Demilitarized Zone between North and South Korea, Pence warned Pyongyang that after years of testing the U.S. and South Korea with its nuclear ambitions, \"the era of strategic patience is over.\"\nSuga, the Japanese government spokesman, said Japan hopes to discuss policies on North Korea with Pence and to convey a growing sense of urgency over its missile tests and other actions.\n———\nThomas contributed from Seoul, South Korea. Associated Press writer Mari Yamaguchi in Tokyo contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Pence, headed to Japan, turns focus to trade with key ally",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/pence-headed-japan-turns-focus-trade-46852774"
}