{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 10:04:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "US Nobel laureate fears US politics could undermine science",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fus-nobel-laureate-fears-us-politics-undermine-science-51712323.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_5f8a9284dde94d288252f28763340d33_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An American scientist who shared this year's Nobel Prize for medicine bluntly criticized political developments at home in his address at the awards' gala banquet, saying that U.S. scientists are facing funding cutbacks that will hurt research.\nMichael Rosbash, who was honored for his work on circadian rhythms — commonly called the body clock — expressed concern that U.S. government funding such as that received by him and Nobel colleagues Jeffrey Hall and Michael Young is endangered.\n\"We benefited from an enlightened period in the postwar United States. Our National Institutes of Health have enthusiastically and generously supported basic research ... (but) the current climate in the U.S. is a warning that continued support cannot be taken for granted,\" Rosbash said in a short speech Sunday night at Stockholm's ornate city hall.\nThe 2018 federal budget proposed by President Donald Trump calls for cutting science funding by billions of dollars.\n\"Also in danger is the pluralistic America into which all three of us of born were born and raised after World War II,\" Rosbash said. \"Immigrants and foreigners have always been an indispensable part of our country, including its great record in scientific research.\"\nLiterature laureate Kazuo Ishiguro of Britain expressed concern about increasing tensions between social factions.\n\"We live today in a time of growing tribal enmities of communities fracturing into bitterly opposed groups,\" said Ishiguro, who was born in Japan.\nHe said Nobel prizes can counterbalance such animosity.\n\"The pride we feel when someone from our nation wins a Nobel prize is different from the one we feel witnessing one of our athletes winning an Olympic medal. We don't feel the pride of our tribe demonstrating superiority over other tribes. Rather it's the pride that from knowing that one of us has made a significant contribution to our common human endeavor,\" he said.\nIn the Norwegian capital of Oslo, a survivor of the atomic bombing of Hiroshima compared her struggle to survive in 1945 to the objectives of the group awarded this year's Nobel's Peace Prize.\nSetsuko Thurlow, who was 13 when the U.S. bomb devastated her Japanese city during the final weeks of World War II, spoke as a leading activist with the Nobel-winning International Campaign to Abolish Nuclear Weapons.\nThurlow said the Hiroshima blast left her buried under the rubble, but she was able to see light and crawl to safety. In the same way, the campaign to which she belongs is a driving force behind an international treaty to ban nuclear weapons, she said after ICAN received the Nobel prize it won in October.\n\"Our light now is the ban treaty,\" Thurlow said. \"I repeat those words that I heard called to me in the ruins of Hiroshima: 'Don't give up. Keep pushing. See the light? Crawl toward it.'\"\nThe treaty has been signed by 56 countries — none of them nuclear powers — and ratified by only three. To become binding it requires ratification by 50 countries.\nICAN Executive Director Beatrice Fihn, who accepted the prize along with Thurlow, said that while the treaty is far from ratification \"now, at long last, we have an unequivocal norm against nuclear weapons.\"\n\"This is the way forward. There is only one way to prevent the use of nuclear weapons — prohibit and eliminate them,\" Fihn said.\nThe prize winners were announced in October. All except the peace prize were awarded in Sweden on Sunday.\nThe other laureates were American Richard Thaler for his work in behavioral economics; American physicists Kip Thorne, Rainer Weiss and Barry Barish for confirming the existence of gravity waves; and Jacques Dubochet of Switzerland, American Joachim Frank and Richard Henderson of the United Kingdom for advances in electron microscopy.\n———\nHeintz reported from Moscow.",
    "source_domain": "abcnews.go.com",
    "title": "US Nobel laureate fears US politics could undermine science",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/us-nobel-laureate-fears-us-politics-undermine-science-51712323"
}