{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 21:45:55+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Blues Top Blackhawks 4-1 in Busch Stadium Winter Classic",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fblues-top-blackhawks-busch-stadium-winter-classic-44516136.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/blues-top-blackhawks-busch-stadium-winter-classic-44516136",
    "language": "en",
    "localpath": null,
    "maintext": "The Blues and Blackhawks took to the outdoors Monday, with Vladimir Tarasenko scoring twice in a 1:53 span of the third period and Jake Allen stopping 22 shots to lead St. Louis to a 4-1 victory over Chicago in the Winter Classic at Busch Stadium.\nIt was 46 degrees when play began before a sellout crowd of 46,556, the sixth largest for a Winter Classic. This was the 21st regular-season outdoor NHL game.\nBobby Hull and son Brett dropped the ceremonial first puck. Bobby wore a Blackhawks jersey and Brett wore the Blues sweater.\nThe Blues went ahead 2-1 when Tarasenko made a backhand pass that hit Nilas Hjalmarsson's skate and slipped by goalie Corey Crawford at 12:05 of the third period. Tarasenko then scored on a wrist shot over Crawford's shoulder at 13:58, giving him 18 goals this season. Robbi Fabbri assisted on both goals.\nThe Blues added an empty-net goal by Alexander Steen at 18:46.\nSt. Louis tied it 1-1 when Patrick Berglund scored at 7:45 of the second period. From behind the net, Jay Bouwmeester fed Berglund in the slot. Berglund one-timed the pass for his sixth goal this season. Steen got the second assist on the goal, the 300th of his career.\nThe Blackhawks scored 62 seconds into the game. Michal Kempny hit a slap shot from just inside the blue line that bounced and wobbled and went off the top of Blues goalie Jake Allen's glove. Kempny got the puck on a pass from behind the net by Artemi Panarin.\nIt was Kempny's second goal of the season. He did not score in his first 24 games without a goal. Now he has scored in his last two games.\nCrawford, who faced 34 shots, made his best save when he denied Taraskeno on a breakaway three minutes into the third period. But then the St. Louis sniper struck twice to provide the winning margin.\nSt. Louis improved to 2-1-1 this season against Chicago.\nThe Blues are the 11th team to play in the annual Winter Classic. The Blackhawks are 0-3-0 in their Winter Classic after previous appearances in 2009 and 2015.\nNOTES: The Winter Classic matchup at Busch Stadium was the fifth outdoor game for the Blackhawks since 2009. Jonathan Toews, Patrick Kane, Duncan Keith and Brent Seabrook each played in the previous four, and Corey Crawford started the last three in goal. ... Until Monday, the only Blues players to have played in an outdoor game were defensemen Carl Gunnarsson and Jay Bouwmeester. ... Chicago RW Marian Hossa is on the injured list with an upper-body injury and was not activated. ... Chicago C Marcus Kruger has been placed on the injured list. ... Blues RW Nail Yakupov was out because of illness.\nUP NEXT:\nChicago: Will host Buffalo on Thursday.\nSt. Louis: Will host Carolina on Thursday.",
    "source_domain": "abcnews.go.com",
    "title": "Blues Top Blackhawks 4-1 in Busch Stadium Winter Classic",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/blues-top-blackhawks-busch-stadium-winter-classic-44516136"
}