{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2017-04-18 13:49:13+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "On Monday night, the first screening of \"Guardians of the Galaxy Vol. 2\" took place and most fans and critics are raving already!",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fguardians-galaxy-vol-reactions-1st-screening%2Fstory%3Fid%3D46860506.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/HT-guardians-01-as-170301_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Most fans and critics are raving after the first screening of \"Guardians of the Galaxy Vol. 2\" Monday.\nThe film is not out until May 5, but early moviegoers said the sequel is fun and emotional -- and that, of course, Groot \"is everything.\"\nHere's what some of the lucky few who saw the movie early had to say:\nGuardians of the Galaxy Vol. 2 is a whole heap of fun. Gorgeous, a bit mad, and surprisingly emotional. And yes, Baby Groot is everything. — Haleigh Foutch (@HaleighFoutch) April 18, 2017\nHoly smokes was Guardians of the Galaxy, Vol 2 fun! I had a smile plastered on my face nearly the whole time. Tons of Easter eggs too. pic.twitter.com/558Q7nw8yN — Dan Casey (@DanCasey) April 18, 2017\nGuardians of the Galaxy Vol. 2 is funnier than the original, a ton of surprises, and an unexpected emotional profoundness. I am Groot. — Peter Sciretta (@slashfilm) April 18, 2017\nDamn. I loved Guardians of the Galaxy Vol. 2. @JamesGunn is a hero and surprise faces steal the show. — Brandon Davis (@BrandonDavisBD) April 18, 2017\nGuardians of the Galaxy Vol. 2 is filled with tons of surprises and an unexpected amount of emotion. Another Marvel winner. — Germain Lussier (@GermainLussier) April 18, 2017\nGUARDIANS OF THE GALAXY VOL 2. is very fun. Takes the EMPIRE \"split up your characters\" strategy. Drax is a hoot. Baby Groot steals the show — Mike Ryan (@mikeryan) April 18, 2017\nI say without hyperbole: #GotGVol2 is MCU at its very best. Grand adventure with intimate stakes. Uses every damn color in the crayon box. ?? — Angie J. Han (@ajhan) April 18, 2017\nI need to see GUARDIANS OF THE GALAXY VOL. 2 a second time, but after one viewing: very funny, a bit shaggy, grade-A Kurt, and so much heart pic.twitter.com/IO4GXO4ANX — Kevin P. Sullivan (@KPSull) April 18, 2017\nTo be fair, there were a few who liked the first movie better and some who were not impressed.\nGUARDIANS VOL. 2 feels like a solid one-and-done issue between big stories; lots of character bits, not much story. MVP: Dave Bautista. — Matt Singer (@mattsinger) April 18, 2017\nHate to be the Voice of Reason, but GUARDIANS OF THE GALAXY VOL. 2 isn't as good as the first. What felt fresh now feels forced. 2.5/4 stars — Jeff Sneider (@TheInSneider) April 18, 2017",
    "source_domain": "abcnews.go.com",
    "title": "'Guardians of the Galaxy Vol. 2': Reactions to the 1st screening",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/guardians-galaxy-vol-reactions-1st-screening/story?id=46860506"
}