{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 23:05:23+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "State legislative action so far this year on abortion policy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fstate-legislative-action-year-abortion-policy-52818688.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/state-legislative-action-year-abortion-policy-52818688",
    "language": "en",
    "localpath": null,
    "maintext": "Abortion policy has been a hot topic in state legislative sessions that began or resumed last month. A look at some of the actions:\n— California: The Senate voted for a bill that would make California the first state to require public universities to offer medication abortion, a service that is rare on college campuses.\n— Georgia: A committee approved a bill that would require underage girls to justify why they should be allowed to avoid notifying a parent or guardian if they want an abortion.\n— Idaho: A Senate panel introduced legislation requiring the state to provide information to women saying medication-induced abortions can be halted after taking just one of two pills.\n— Indiana: The Indiana Senate approved a bill that would require medical providers to report additional information about patients who seek treatment for an abortion complication.\n— Iowa: A group of Republican House members proposed legislation that would ban abortion once a fetal heartbeat is detected, which is as early as six weeks.\n— Mississippi: The House has voted to advance legislation that would make Mississippi the only state to ban all abortions after 15 weeks of pregnancy. The bill now goes to the Senate.\n— Missouri: Lawmakers are considering several bills to restrict access to abortion, including one that would ban abortions after 20 weeks of pregnancy.\n— Ohio: The Senate has approved a bill that would require Ohio abortion clinics to either bury or cremate fetal remains. The House is expected to consider that measure, along with another already approved in the Senate that would ban the most commonly used procedure to terminate abortions after 13 weeks of pregnancy.\n— South Carolina: State senators voted to delay a bill that would likely ban all abortions, saying they need time to consider possible exceptions to the law.\n— Tennessee: A lawmaker has proposed banning any Medicaid funding going to abortion providers, such as Planned Parenthood, for non-abortion services. A legislative committee has declined to endorse a plan that would ban all abortions once a fetal heartbeat is detected, amending it to remove that language.\n— Utah: Lawmakers are considering bills that would penalize doctors who do not show an informational video to women seeking an abortion, and another that would bar doctors from performing abortions sought because the fetus has Down syndrome.\n— Washington: The Senate passed a measure that would require insurers in the state to offer maternity care that also covers elective abortions and contraception.\n———\nSource: AP research",
    "source_domain": "abcnews.go.com",
    "title": "State legislative action so far this year on abortion policy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/state-legislative-action-year-abortion-policy-52818688"
}