{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 08:43:45+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Yemen's Children Starve as War Drags On",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fyemens-children-starve-war-drags-44508227.json",
    "image_url": "http://abcnews.go.com/International/wireStory/yemens-children-starve-war-drags-44508227",
    "language": "en",
    "localpath": null,
    "maintext": "As the first light of dawn trickles in through the hospital window, 19-year-old Mohammed Ali learns that his two-year-old cousin has died of hunger. But he has to remain strong for his little brother Mohannad, who could be next.\nHe holds his brother's hand as the five-year-old struggles to breathe, his skin stretched tight over tiny ribs. \"I have already lost a cousin to malnutrition today, I can't lose my little brother,\" he says.\nThey are among countless Yemenis who are struggling to feed themselves amid a grinding civil war that has pushed the Arab world's poorest nation to the brink of famine. The family lives in a mud hut in northern Yemen, territory controlled by Shiite Houthi rebels, who are at war with government forces and a Saudi-led and U.S.-backed coalition.\nThe coalition has been waging a fierce air campaign against the rebels since March 2015, trying unsuccessfully to dislodge them from the capital, Sanaa, and much of the country's north. A coalition blockade aimed at preventing the Houthis from re-arming has contributed to a 60-percent spike in food prices, according to an estimate used by international aid groups.\nDuring the best of times, many Yemenis struggled to make ends meet. Now they can barely feed themselves.\nMohammed's father works seasonal farming jobs that pay only a few dollars a day. Mohammed dropped out of school after the war began and scrapes by on occasional construction and farming work. Before the war, they could afford to eat beef or chicken once a week, but now they are lucky to have some fish with lunch. Their diet mainly consists of bread, rice and tea.\nEarlier this month, Mohammed and his brother made the hour-long journey, over a bumpy and unsafe road, to the nearest hospital, in the town of Abs. Mohannad's condition, which began with diarrhea, had been worsening for the past two years, but they couldn't afford treatment.\nSome 2.2 million children suffer from malnutrition across Yemen, according to the U.N. children's agency, UNICEF. That includes 462,000 who, like Mohannad, are afflicted with Severe Acute Malnutrition (SAM), which makes them especially vulnerable to otherwise preventable illnesses like diarrhea and pneumonia.\nUNICEF is supporting the treatment of 215,000 children suffering from SAM and has provided vitamin supplements to millions more, said Rajat Madhok, the agency's spokesman in Yemen. But \"this lifesaving work remains hindered by the shortage of funding and limited access to areas caught in the fighting,\" he said.\nThe war has taken a heavy toll on the country's health facilities. A number of hospitals and clinics have been bombed, while others have had to close their doors because of the fighting. Less than a third of Yemen's 24 million people have access to health facilities, according to UNICEF, which says at least 1,000 Yemeni children die every week from preventable diseases.\nMohammed hopes his brother won't be next.\n\"I can see that my brother's condition is worsening day after day,\" he says. \"There's nothing I can do.\"",
    "source_domain": "abcnews.go.com",
    "title": "Yemen's Children Starve as War Drags On",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/yemens-children-starve-war-drags-44508227"
}