{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 02:42:18+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-envoy-warns-crisis-syrias-idlib-54687922.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_552a977cc1034453ab5ed56e5d6048a2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the Syria conflict (all times local):\n10 p.m.\nAn activist group documenting war crimes in Syria has published a database of suspected chemical attacks there since 2012.\nThe Syrian Archive, which works with human rights groups such as Amnesty International, has been collecting videos, images and other data from chemical weapons attacks for four years.\nThe group said Tuesday it has verified 861 videos from 193 sources covering some 212 attacks in Syria. Much of the material was collected from social media.\nHadi al-Khatib, the group's co-founder, told an audience in Berlin the activists want to ensure the material isn't lost and that it can be used to prosecute those responsible for the crimes.\nPresident Bashar Assad's government has denied widespread allegations of using chemical weapons against its own people, most recently in the town of Douma, near Damascus.\n———\n4:15 p.m.\nSyrian state TV says members of the Islamic State group have shelled a government-held area in southern Damascus killing at least four people.\nTuesday's shelling came as government forces intensified their offensive against IS fighters holed up in an area south of the capital including a Palestinian refugee camp.\nThe TV said IS fighters in the neighborhood Hajar al-Asward fired a shell on the nearby government-held neighborhood of Nahr Aisha killing four people and wounding 15.\nThe Britain-based Syrian Observatory for Human Rights said the shelling of Nahr Aisha killed five and wounded 17.\n———\n3:45 p.m.\nA U.N. official says international efforts to rebuild Syria once the civil war is over should center on agriculture to jumpstart the economy and quickly improve the livelihoods of the people.\nThe senior official in the Food and Agriculture Organization said that in case of a return to peace the impact of providing funds for farming would yield almost immediate results.\nFAO's Deputy Director General Daniel Gustafson said in an interview with The Associated Press ahead of an international Syria donors conference that \"if you invest in that, you are going to get a quick return.\"\nEven after seven years of war, farming still accounts for about a quarter of Syria's Gross Domestic Product.\n———\n3:30 p.m.\nU.N. Syria envoy Staffan De Mistura is warning that the northern rebel-held province of Idlib could become the conflict-ravaged country's newest humanitarian crisis area, as international donors gather in Brussels to drum up emergency support.\nDe Mistura said Tuesday that \"Idlib is the big new challenge — 2.5 million people.\"\nHe told reporters that \"there are women, children, civilians, and this is looming up there.\"\nDe Mistura hopes the two-day donor conference \"will be an occasion for also making sure that Idlib doesn't become the new Aleppo, the new eastern Ghouta, because the dimensions are completely different.\"\nThe Syrian Observatory for Human Rights says 177,000 people have fled combat in eastern Ghouta since February. The rest — including about 12,000 fighters — relocated to Idlib.\n———\n12:45 p.m.\nSyrian state TV is reporting that government forces have launched a new operation targeting underground tunnels used by the Islamic State group in the capital, Damascus.\nThe TV says the aim of the operation is to destroy dug-out trenches and tunnels in the Hajar al-Aswad neighborhood and the nearby Palestinian refugee camp of Yarmouk that is also mostly controlled by IS.\nA group of journalists taken on Tuesday to the adjacent neighborhood of Qadam witnessed intense shelling and airstrikes on IS positons in the camp and Hajar al-Aswad.\nThe area in southern Damascus is the last part of the capital not controlled by President Bashar Assad's forces. Other insurgents in the area, including an al-Qaida-linked group, have said they would relocate to rebel-held regions in northern Syria.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Syria activists publish data on chemical attacks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-envoy-warns-crisis-syrias-idlib-54687922"
}