{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2018-04-25 00:06:09+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The Marshfield Police Department’s harbormaster patrolled the waters to make sure no other boats came close to the pod of whales, The Patriot Ledger reported.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdozens-endangered-whales-gloriously-feeding-off-massachusetts-coast%2Fstory%3Fid%3D54702917.json",
    "image_url": "https://s.abcnews.com/images/US/whale-pod-sighting-01-wcvb-jef-180424_hpMain_4x3_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dozens of endangered North Atlantic Right whales were seen feeding off the coast of Massachusetts over the past few days.\nThe massive ocean mammals were seen swimming at the surface of the Atlantic Ocean near Marshfield -- a town about 30 miles southeast of Boston -- in chopper video captured by ABC Boston affiliate WCVB over the weekend.\nThe Marshfield Police Department's harbormaster and the U.S Coast Guard patrolled the waters nearby to make sure no other boats got too close to the pods of about 50 whales, Marshfield Harbormaster Mike DiMeo told ABC News. They were likely migrating north from Florida and the Carolinas, he said.\nWCVB\nMarshfield resident Doug MacFarland, who watched the whales through a pair of binoculars, told The Patriot Ledger that he lost count of how many he saw in the ocean.\nThe 10 to 12 pods of whales were spread out over up to 10 miles along the Atlantic coast, DiMeo said.\n\"It's an anomaly for us,\" DiMeo said of the number of whales.\nWCVB\nDiMeo was able to witness the whales for himself on Monday from about 50 yards away, he said.\n\"It's quite fascinating to see them in that close range,\" he said, adding that they \"basically shut the engines down\" and kept a distance to \"let them go their way.\nThe species was hunted to near-extinction about a century ago, according to the local newspaper.\nThe Right whale remains critically endangered, although recent analysis suggests that the species has recently experienced a slight growth in population size, according to the National Oceanic and Atmospheric Administration (NOAA). In 2011, at least 465 individual Right whales were in existence, according to the NOAA.\nThe last time the area had seen a large number of whales was in May 2015, when about 15 to 20 whales were spotted off the coast, DiMeo said. It could be a sign of a population increase, he added.\nWCVB\nAmong the biggest threats to the species include ship collisions, entanglement in fishing gear, habitat degradation, climate and ecosystem change, disturbance from whale-watching activities and noise, according to the NOAA.\nRight whales have a protection zone of 500 yards, NOAA regulations state. So the harbormaster and Coast Guard were helping to enforce it, DiMeo said. Regulations also state that vessels over 65 feet must travel at 10 knots or less.\nWCVB\nHumarock resident Paul Armstrong was paddleboarding when he had a close-up encounter with the whales, which can weigh up to 79 tons.\n\"I was almost on top of them at one point,\" Armstrong told The Patriot Ledger. \"They were kind of curious about what I was.\"\nThe avid surfer described the sighting as \"a really cool experience,\" adding, \"It’s something I’ve always wanted to do.\"",
    "source_domain": "abcnews.go.com",
    "title": "Dozens of endangered Right whales seen gloriously feeding off Massachusetts coast",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/dozens-endangered-whales-gloriously-feeding-off-massachusetts-coast/story?id=54702917"
}