{
    "authors": [
        "Abc News",
        "Tara Fowler",
        "More James",
        "More Tara"
    ],
    "date_download": "2018-02-03 00:01:59+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Fifty-eight people were killed and hundreds injured in the shooting.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fman-charged-conspiracy-allegedly-selling-vegas-shooter-armor%2Fstory%3Fid%3D52807551.json",
    "image_url": "http://a.abcnews.com/images/US/haig-ap-er-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A man has been charged with conspiracy in connection to October's massacre in Las Vegas for allegedly selling armor-piercing ammunition to shooter Stephen Paddock.\nFifty-eight people were killed and hundreds injured in the shooting.\nDouglas Haig, 55, has been charged with conspiracy to manufacture and sell armor-piercing ammunition.\nAccording to the complaint, which was obtained by ABC News, Haig admitted to selling hundreds of rounds of tracer ammo to Paddock in September, which isn't illegal. However, among the unfired rounds found in Paddock’s hotel room were two cartridges which forensic analysis determined were armor-piercing/incendiary ammo that had Haig’s fingerprints on them, the complaint states. Such ammunition is illegal to manufacture without a license. Haig, according to the complaint, did not have such a license.\nA subsequent search warrant at his business located more armor-piercing and incendiary rounds and records of Haig selling them around the country, according to the complaint.\nEthan Miller/Getty Images\nEarlier today, Haig and his attorney, Marc Victor, gave a press conference defending Haig as a \"law-abiding citizen\" with no history of legal problems.\nHaig said he was sickened and horrified when he learned of the massacre.\nJohn Locher/AP, FILE\n“I had no contribution to what Paddock did,\" he said, adding the amount of ammunition he sold to Paddock was very common. \"I had no way to see into his mind.\"\n\"The product I sold him had absolutely nothing to do with what he did,\" Haig added, referring to the legal tracer ammunition.\nVictor told ABC News Wednesday that Haig only sold tracer rounds to Paddock.\nHaig did not acknowledge selling Paddock armor-piercing/incendiary ammunition.\nThis evening, Haig, in shackles, appeared in federal court with Victor by his side on the single charge listed in the complaint, according to local ABC affiliate KNXV. The judge ordered him to surrender his passport, guns, ammunition, and tools used to manufacture ammunition.\nVictor declined to comment to ABC News following the court appearance.\nPaddock took his own life after unleashing the hail of gunfire from the 32nd floor of the Mandalay Bay Resort and Casino on Oct. 1. Unsuspecting concertgoers were attending a music festival below.",
    "source_domain": "abcnews.go.com",
    "title": "Man charged with conspiracy for allegedly selling Vegas shooter armor-piercing ammo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/man-charged-conspiracy-allegedly-selling-vegas-shooter-armor/story?id=52807551"
}