{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:30:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Kate Upton is Sports Illustrated's swimsuit issue cover model",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fkate-upton-sports-illustrateds-swimsuit-issue-cover-model%2Fstory%3Fid%3D45508090.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_c3c69a9b210941759cdd5498135226b9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "On Tuesday night Kate Upton was revealed as the 2017 Sports Illustrated swimsuit issue cover model on ABC’s \"Jimmy Kimmel Live!\"\nJimmy Kimmel had the first interview with Upton after making the announcement during the broadcast.\nUpton, 24, joined the host on the couch to thunderous applause. Kimmel pointed out that this is her third Sports Illustrated cover, but that Elle Macpherson holds the record with five.\nEXCLUSIVE: Watch Kate Upton's reaction backstage after seeing her 2017 Sports Illustrated Swimsuit covers https://t.co/boqi9tW68D pic.twitter.com/LIrZxxDvSu — SI Swimsuit (@SI_Swimsuit) February 15, 2017\nUpton revealed that she didn’t find out she was on the cover until Monday.\nKimmel showed Upton some gag covers of the issue, including one of Upton buried in sand.\nThe actual cover was presented in a projection on the Empire State Building in New York City, and then Kimmel revealed that Sports Illustrated is issuing three collector’s covers, with an especially provocative cover featuring Upton in what Kimmel referred to as “a hammock that got torn to bits.”\nThe announcement kicks off a week of festivities culminating in Vibes by Swimsuit, a music, food and culture festival taking place in Houston on Feb. 17 and 18.",
    "source_domain": "abcnews.go.com",
    "title": "Kate Upton is Sports Illustrated's swimsuit issue cover model",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/kate-upton-sports-illustrateds-swimsuit-issue-cover-model/story?id=45508090"
}