{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2018-02-03 21:41:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Beauty experts picked these face moisturizers to get you through the winter",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FStyle%2Fbeauty-experts-share-favorite-face-moisturizers-70-winter%2Fstory%3Fid%3D52806234.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/moisturizer-gty-jt-180203_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "If you woke up this morning feeling extra dry, you're not alone.\nWinter is notorious for stripping us of our natural moisture, whether you normally have oily skin, dry skin or even combination. We're all going through a little dry period when it comes to our faces.\nWhether it's bracing the wintry elements while being outside, or even being stripped of moisture because you have the heat blasting indoors, face it: It's a tough couple of months for moisture.\nBut it's especially important to stay hydrated -- and not just on your body but on your face in particular. So along with naming our favorite face moisturizers under $70, we've also tapped a few beauty bloggers and fashion writers to tell us their favorite finds.\nGlossier\n\"Glossier’s Priming Moisturizer Rich ($35) is ballin’ on a budget. It provides a luxe experience from the packaging to the actual product quality itself. Many opt to use this during the winter months (opposed to the brand’s original priming moisturizer during spring/summer) because of its thickness and super hydrating properties, but I use it year-round because it’s that good.\" - Morgan Pitts , representative for Glossier\nNeutrogena\n\"Neutrogena Hydro Boost Water Gel ($18.99) goes on smooth and leaves your skin feeling full of moisture without any residue or heavy feel. Because it's more of a gel, it sets right into the skin and leaves it feeling bright and light!\" - Kelly McCarthy , digital reporter at ABC News\nIT Cosmetics\n\"IT Cosmetics Secret Sauce Anti-Aging moisturizer ($68) has been my go-to all winter. It works overtime to reduce discoloration, lines, and wrinkles. With key ingredients like anti-aging collagen, peptides, hyaluronic acid, vitamin C and licorice root, the secret really is in the sauce. - Ty Alexander , creator of Gorgeous in Grey\nShaffali\n\"My facialist at HeyDay spa recommended I try Shaffali Organic Orange Blossom Facial Moisture ($48) and I see why. If you have sensitive skin like me, it's great because it's organic and offers vitamin E, vitamin A and vitamin C. Plus, I only have to apply it once a day without it feeling heavy. I use it year-round, but during the winter months, I add one drop of carrot seed oil to make it last just a bit longer. Carrot seed oil also helps with anti-aging.\" - Joi-Marie McKenzie , beauty/style writer for Good Morning America\nMurad\n\"Murad Oil-Control Mattifer SPF 15++ moisturizer ($40) is a godsend because it absorbs oil for up to eight hours, but also provides broad spectrum protection from the sun. Plus, it detoxifies my acne-prone skin -- which means less breakouts!\" - Channing Hargrove , fashion news writer at Refinery 29",
    "source_domain": "abcnews.go.com",
    "title": "Beauty experts share their favorite face moisturizers under $70 to get you through the winter",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Style/beauty-experts-share-favorite-face-moisturizers-70-winter/story?id=52806234"
}