{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:39:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Affidavit: Doctor prescribed meds for Prince in another name",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Faffidavit-doctor-prescribed-meds-prince-46842203.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_a3e67257d0584ebaa4175d8bdc5d3250_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A doctor who saw Prince in the days before he died had prescribed oxycodone under the name of Prince's friend to protect the musician's privacy, according to court documents unsealed Monday that revealed nothing about how the pop superstar got the fentanyl that actually killed him.\nThe affidavits and search warrants were unsealed in Carver County District Court as the yearlong investigation into Prince's death continues. The documents show authorities searched Paisley Park, cellphone records of Prince's associates, and Prince's email accounts to try to determine how he got the fentanyl, a synthetic drug 50 times more powerful than heroin.\nThey don't reveal answers, but do shed light on Prince's struggle with addiction in the days before he died. Oxycodone, a painkiller, was not listed as a cause of Prince's death.\nPrince was 57 when he was found alone and unresponsive in an elevator at his Paisley Park home on April 21.\nA search of Prince's home yielded numerous pills in various containers. Some were in prescription bottles for Kirk Johnson, Prince's longtime friend and associate. Some pills in other bottles were marked as if they were a mix of acetaminophen and hydrocodone — but at least one of those tested positive for fentanyl, meaning the pill was counterfeit and could only be obtained illegally.\nThe documents show Prince was struggling with an addiction to prescription opioids. Just six days before he died, Prince fell ill on a plane and made an emergency stop in Illinois as he was returning home from a concert in Atlanta. First responders revived him with two doses of a drug that reverses the effects of an opioid overdose.\nOne affidavit says Dr. Michael Todd Schulenberg, who saw Prince April 7, 2016, and again on April 20, admitted to authorities that he prescribed oxycodone for Prince the same day as the emergency plane landing \"but put the prescription in Kirk Johnson's name for Prince's privacy.\"\nAuthorities also searched Johnson's cellphone records, to see who he was communicating with in the month before Prince died.\nMessages left with attorneys for Schulenberg and Johnson weren't immediately returned Monday. Schulenberg has an active medical license and is currently practicing family medicine in Minnesota. His attorney, Amy Conners, told the AP last week that there are no restrictions on his license.\nInvestigators haven't interviewed either Johnson or Schulenberg since the hours after Prince died, an official with knowledge of the investigation told The Associated Press on condition of anonymity because the investigation is ongoing.\nWhile authorities have the power to ask a grand jury to investigate and issue subpoenas for testimony, that step hasn't been taken, the official said.\nPrince did not have a cellphone, and authorities searched multiple email accounts that belonged to him, as they tried to determine who he was communicating with and where he got the drugs that killed him, according to the search warrants. The search warrants don't reveal the outcome of the email searches.\nThe documents say some of the drugs in Prince's bedroom were in a suitcase with the name \"Peter Bravestrong\" on it. Police believe Bravestrong was an alias that Prince used when he traveled. The suitcase also contained lyrics for the song \"U Got the Look\" that appeared to be in Prince's handwriting.\nInvestigators have said little about the case over the last year, other than it is active. The official who spoke to the AP said the case has taken investigators to Illinois and California, as authorities have interviewed friends, family and any potential witnesses, including the flight crew and hospital staff that were present when Prince overdosed on the plane.\n———\nFollow Amy Forliti on Twitter: http://www.twitter.com/amyforliti . More of her work can be found at http://bigstory.ap.org/content/amy-forliti",
    "source_domain": "abcnews.go.com",
    "title": "Affidavit: Doctor prescribed meds for Prince in another name",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/affidavit-doctor-prescribed-meds-prince-46842203"
}