{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2018-02-03 00:02:02+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "The erroneous alert resulted in panic across the state.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fhawaii-employee-false-missile-alert-100-percent-real%2Fstory%3Fid%3D52806235.json",
    "image_url": "http://a.abcnews.com/images/Politics/hawaii-mistaken-missle-alert-1-ap-thg-180115_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Hawaii Emergency Management Agency employee who mistakenly sent out a mobile alert warning of an incoming ballistic missile said he \"was 100 percent sure it was real.\"\nThe man, who has asked to remain anonymous, told ABC News, \"I did what I was trained to do\" by \"making the selection to notify the public.\"\nHe said, \"I heard the middle of the message and the end of it,\" which he said announced, \"This is not a drill.\"\n\"I didn't hear the word 'exercise,'\" he said. \"I was convinced it was real.\"\nIt was a \"terrible feeling\" to learn it was false, he said, adding that he was \"very emotional afterward.\"\n\"We all did our best to try to remedy the situation,\" he said.\nThe last few weeks have been \"utter hell,\" he added. \"Death threats, they've been coming into the agency. ... I've been very worried about my safety and the safety of my family.\"\nThe erroneous alert sent to the cellphones of Hawaiians on Jan. 13 resulted in panic across the state, including people abandoning their vehicles on the highway. A video of a man putting his child in a manhole went viral.\nCaleb Jones/AP\nAbout 10 minutes after the initial alert, the Hawaii Emergency Management Agency (HI-EMA) tweeted there was no threat.\nNO missile threat to Hawaii. — Hawaii EMA (@Hawaii_EMA) January 13, 2018\nBut HI-EMA didn't send a retraction to cellphones until 38 minutes after the original alert.\nThat day, while logging into his workstation, \"we received a call,\" he said. \"I don’t hear the beginning of the message coming across because what we’re supposed to do is hit speakerphone on the line so everyone can hear the message. So the beginning of the message was lost as far as [hearing the warning] 'exercise'.\n\"In the middle of the message it said, 'This is not a drill,' and at the end, I didn’t hear exercise either,\" he said. \"It was rather chaotic in the office as far as we were just coming on shift during shift change. Logging onto our computers here. We were not ready for the call.\n\"Immediately afterward, I was very emotional about what happened and just assisted my team as best I could,\" he said.\nThe employee, who has since been terminated, said he worked at the Hawaii agency for 11.5 years.\nKyodo/Newscom\nThe message \"was very real to me,\" he said, adding he was \"100 percent sure it was the right decision based on the message.\"\nAsked if he would do anything differently, he said, \"It's hard to say.\"\n\"I've learned from it,\" he said. \"I feel a lot of guilt.\"\nHe said he empathizes with the families impacted and said he hasn't been able to sleep or eat very well.\nA preliminary federal report found at least two previous incidents in 10 years with that employee during which he confused a drill with a real-world situation, officials said Tuesday.\nThe employee said today that \"that's not true.\"\nHe added that he thinks the \"military should handle this job -- missile notifications for Hawaii. I don't think were equipped to do it.\"\nTwo more employees have resigned, including the administrator of HI-EMA; a third employee will be suspended without pay, an official said Tuesday.\nABC News' Jeffrey Cook and Cheyenne Haslett contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Hawaii employee who sent false missile alert: 'I was 100 percent sure it was real'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/hawaii-employee-false-missile-alert-100-percent-real/story?id=52806235"
}