{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:56:09+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Correction: Army-Vaping Danger story",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fcorrection-army-vaping-danger-story-52804920.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/correction-army-vaping-danger-story-52804920",
    "language": "en",
    "localpath": null,
    "maintext": "In a story Feb. 1 about a U.S. Army warning on the dangers of vaping synthetic cannabinoid oil, The Associated Press, based on an incorrect news release, reported erroneously that two Marines had died. The U.S. Army Public Health Center now says it has not been able to confirm any deaths. The story also erroneously reported that 33 troops in Utah experienced serious medical problems. Utah public health officials say they have had 40 reports involving members of the public, not the military. The incorrect information has been deleted.\nA corrected version of the story is below:\nArmy: 60 hospitalizations blamed on vaping oils\nA rash of military personnel stationed in North Carolina have been hospitalized for issues believed to have been caused by vaping oils\nJACKSONVILLE, N.C. (AP) — The U.S. Army is warning about the dangers of vaping synthetic cannabinoid oil after about 60 soldiers and Marines in North Carolina experienced serious medical problems in January.\nIn a Monday public health alert, the U.S. Army Public Health Center said military personnel have suffered headaches, nausea, vomiting, palpitations, dilated pupils, dizziness, agitation and seizures. All these symptoms are associated with synthetic cannabinoids.\nArmy regulations ban the use of so-called CBD oil or any products derived from marijuana, so some soldiers are using synthetic replacement oil.\nPublic Health Center spokeswoman Chanel S. Weaver tells The Fayetteville Observer that stopping this trend is a \"top priority.\"",
    "source_domain": "abcnews.go.com",
    "title": "Correction: Army-Vaping Danger story",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/correction-army-vaping-danger-story-52804920"
}