{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 12:41:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "10 Things to Know for Today",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2F10-things-today-51713488.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_ca1af5dee30c4337a1aaff09b331ddf7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:\n1. PUTIN MAKES SURPRISE STOP IN SYRIA EN ROUTE TO CAIRO\nThe Russian president visits a Russian military air base in Latakia and announces a partial pullout of his forces from the country.\n2. DIVERGENT VIEWS ON WHAT ALABAMA SENATE VOTE MEANS\nThe matchup between Roy Moore and Doug Jones mixes both the Deep South state's tortured history and the nation's current divisive, bitterly partisan politics.\n3. MYANMAR MILITARY'S RAPE OF ROHINGYA MUSLIMS SWEEPING, METHODICAL\nIn interviews with the AP, more than two dozen women and girls bolster the U.N.'s contention that the Myanmar armed forces are systematically using rape as a \"calculated tool of terror\" to exterminate the Rohingya people.\n4. FOR TRUMP, GOP A MOMENTOUS 2 WEEKS\nRepublicans are determined to deliver the first revamp of the nation's tax code in three decades and agree on a spending bill to avert a government shutdown over the holidays.\n5. WHAT ARE UNINTENDED CONSEQUENCES OF WORKPLACE SCANDALS\nSome women, and men, worry the same climate that's emboldening women to speak up about sexual misconduct could backfire by making some men wary of female colleagues.\n6. FIREFIGHTERS BRACE FOR 2ND WEEK OF CALIFORNIA WILDFIRES\nSouthern California fire officials anticipate more growth and danger due to continued strong wind gusts, no rain and decades-old dry vegetation.\n7. DEADLINE WEEK CRUNCH FOR HEALTH LAW SIGN-UPS\nFriday is the last day for millions of people still eligible to enroll in subsidized private coverage in 39 states served by the federal HealthCare.gov website.\n8. BITCOIN FUTURES RISE AS VIRTUAL CURRENCY HITS MAJOR EXCHANGE\nThe futures contract that expires in January surges more than $3,000 to $18,580 eight hours after trading launched on the Chicago Board Options Exchange.\n9. WHO ARE FAVORITES FOR POST-WEINSTEIN GOLDEN GLOBES\nSteven Spielberg's Pentagon Papers drama \"The Post\" and Christopher Nolan's World War II tale \"Dunkirk\" are expected to lead the film categories, while Hulu's \"The Handmaid's Tale\" and HBO's \"Big Little Lies\" could be in for a big day on the TV side.\n10. STEELERS CLINCH AFC NORTH\nBen Roethlisberger throws for 506 yards and two touchdowns, becoming the first quarterback in NFL history to top 500 yards passing three times, as Pittsburgh (11-2) rallies past Baltimore 39-38.",
    "source_domain": "abcnews.go.com",
    "title": "10 Things to Know for Today",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/10-things-today-51713488"
}