{
    "authors": [
        "Abc News",
        "More Mark"
    ],
    "date_download": "2018-03-20 06:02:43+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "The \"Late Show\" host criticized the social media giant over Cambridge Analytica.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fstephen-colbert-tackles-stolen-data-scandal-time-wanted%2Fstory%3Fid%3D53866918.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/stephen-colbert-gty-jt-170816_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Stephen Colbert weighed in on this weekend's Cambridge Analytica scandal on Monday night's \"Late Show,\" saying Facebook, which learned of the data leak in 2015, was a little late on the uptake.\n\"Really!? The one time it would have wanted a Facebook alert,\" Colbert joked. \"Perhaps that could have replaced one of the four messages I get a day about my ex-roommate's college girlfriend's one-woman show.\"\nPhoto Illustration by Jaap Arriens/NurPhoto via Getty Images\nChristopher Wylie, a former employee for the Britain-based data firm which stole user information from 50 million Facebook users, blew the whistle on the company using the stolen information to aid the Trump campaign during the 2016 election.\nWylie told ABC News, \"When you think about what you do on social media, you curate your identity, so when you like things, when you follow things, you reveal all these little clues and if we have enough of those clues, we can start to develop a portrait of who you are.\"\nColbert also showed clips from undercover video shot by Channel 4 in Britain in which Cambridge Analytica was caught admitting to questionable tactics for obtaining information about political opponents, such as setting up fake websites, entrapping them with illegal donations and even using \"very beautiful Ukrainian girls\" to elicit information.\n\"Well, we don't have to worry about them blackmailing our leaders, as long as no one in Washington is attracted to eastern European women. ... Oh, my god!\" Colbert joked, referring to Donald Trump and his wives.",
    "source_domain": "abcnews.go.com",
    "title": "Stephen Colbert tackles stolen data scandal: 'The one time I actually wanted a Facebook alert'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/stephen-colbert-tackles-stolen-data-scandal-time-wanted/story?id=53866918"
}