{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:18:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The newly unsealed court documents revealed the \"Purple Rain\" singer's apparent struggle with opioid addiction and how he tried to hide it.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fdetails-princes-death-revealed-documents-released-46857364.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_pilgrim2_0731_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for New details of Prince's death revealed as documents are released\nYou always do that. Yeah. Prince's death, the newly unsealed court documents are revealing the superstar's apparent struggle with opioid addiction and how he tried to keep it a secret and Eva pilgrim has the details. Reporter: Good morning, it's been nearly a year since the superstar died of an overdose found dead inside that elevator in his paisley park estate. We are learning for the first time what investigators found inside prince's home the day he died. Search warrants in the music superstar prince's death unsealed painting a picture of the singer's opioid addiction. ??? All my cares and trouns dive right off my windowsill every time I pop a pill.\" Reporter: They found a sizable am of narcotics stored not in prescription bottles but hid in vitamin, as men and over the counter pain relief bottles including the singer's dressing room, music room and purple rain room, none in prince's name. ??? You got the look that in us have took ??? Reporter: Some found in a suitcase with the name Peter bravestrong, an alias he was believed to use along with handwritten lyrics to \"You've got the look\" prescribed under the name of his longtime friend and drummer Kirk Johnson including oxycodone that was prescribed by Dr. Michael shillenburg after his plane made that emergency landing just days before he die. What's the nature of the emergency? Unresponsive passenger. Reporter: Shellen berg told investigators he put the prescription in Johnson's name for prince's privacy but his lawyer saying Dr. Shulen berg never predirectly prescribe them to prince or any other person with the intent they will be given to prince. Johnson telling investigators he was unaware prince was daddicted to pain medication even though the star's assistant had arranged a meeting with a rehab center for help and that center's representative at the home the morning prince died and called 911. At paisley park, 7801 audubon road. Person down not breathing. Reporter: His ex-wife telling \"Good morning America\" -- He was a machine. Music kept him going. Reporter: Not clear where he got that fentanyl that took his life ultimately. Investigators scouring his computer, e-mail and phone records looking for clues but still no answer to that question. For more let's bring in Dr. Drew Pinsky. Always good to see you and get your insight and perspective. You heard the report. You've heard what these documents are alleging and so what do you make of the fact that so many prescriptions, so many drugs were found in various areas of the house? Well, robin, I don't make much of it. It just start of standard fare with a history of opioid excess, stashes all over. What is unusual about the prince case, many things are unusual but some things that jump out are the issue of the fentanyl. How and why he got enough to take a huge a that's a hard drug to overdose on unless you're shooting it. I will remind people, people don't typically die of prescription opioid use unless you add a benzodiazepine and they found alprazolam and they graduate from that to heroin as physicians are getting the message we have to curtail the prescribing of oral opiates. We heard in Eva's report about that doctor that said he filled it under a friend's name for privacy reasons. You're not buying that. Well, if that's true, again, we don't know what the doctor was up to. If a doctor does that it's unkosher superma unconsciona unconscionable. It violates safety codes and rules and we can't monitor the practices but it does highlight one thing that happens all the time which is that people in special positions -- excuse me, celebrities and whatnot often seek out special care. Michael Jackson's physician being case a of that and when you get special care, you inevitably get substandard care. The standard is for a reason. It's the best care and if a physician is somehow sort of turned on by taking care of somebody special, that's terrible for the patient. What prince kneed was the same as every person with addiction. He lived 30 minutes from one of the premiere treatment centers from Hazelton. They could have taken him there and he would be alive today but the special needs people flying from San Francisco, it's unthinkable. Unthinkable to try to treat an opioid addict like that. Dr. Drew, thanks as always. Coming up, the new claims\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "New details of Prince's death revealed as documents are released",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/details-princes-death-revealed-documents-released-46857364"
}