{
    "authors": [
        "Abc News",
        "Ali Rogin",
        "Angie Yack",
        "More John",
        "More Ali"
    ],
    "date_download": "2018-02-02 22:27:44+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Capitol Hill reacts to release of GOP memo",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fcapitol-hill-reacts-release-gop-memo%2Fstory%3Fid%3D52800026.json",
    "image_url": "http://a.abcnews.com/images/Politics/schumer-mccain-meadows-ap-abc-gty-mem-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Reaction across Capitol Hill to the controversial memo compiled by Republican staff on the House Intelligence Committee was swift.\nInterested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\nDemocrats harshly criticized the decision to release the memo, which President Trump authorized Friday morning in a letter relayed to the House Intelligence Committee. The memo details the process that led to the court-approved surveillance of former Trump campaign adviser Carter Page, a suspected Russian agent.\nRep. Adam Schiff, D-Calif., the top Democrat on the House Intelligence Committee, wrote in a statement Friday, \"Chairman Nunes' decision, supported by House Speaker Ryan and Republican Members of the House Permanent Select Committee on Intelligence, to publicly release misleading allegations against the Department of Justice and Federal Bureau of Investigation is a shameful effort to discredit these institutions, undermine the Special Counsel’s ongoing investigation, and undercut congressional probes.\"\nSen. Mark Warner, D-Va., the top Democrat on the Senate Intelligence Committee, called the decision \"reckless and demonstrates an astonishing disregard for the truth.\"\n\"This unprecedented public disclosure of classified material during an ongoing criminal investigation is dangerous to our national security. This will make it far more difficult for the Intelligence Committees to conduct meaningful, bipartisan oversight of intelligence activities in the future. This action was also taken without regard to the damage it could do to our ability to protect Americans from threats around the globe,\" Warner said.\nMark Wilson/Getty Images\nSen. Richard Burr, R-N.C., who chairs the Senate Intelligence Committee, declined to comment on the memo when asked by ABC News.\nIn a letter to President Trump, top Democrats from the House and Senate warned against using the contents of the memo as a rational to fire special counsel Robert Mueller.\n\"We write to inform you that we would consider such an unwarranted action as an attempt to obstruct justice in the Russia investigation. Firing Rod Rosenstein, DOJ Leadership, or Bob Mueller could result in a constitutional crisis of the kind not seen since the Saturday Night Massacre,\" the letter, sent Friday by both Senate Minority Leader Chuck Schumer, D-N.Y., and House Minority Leader Nancy Pelosi, D-Calif., and other members of the House and Senate leadership, said.\nSenator John McCain, R-Ariz., also harshly criticized the release of the memo.\n\"In 2016, the Russian government engaged in an elaborate plot to interfere in an American election and undermine our democracy,\" McCain wrote in a statement Friday. \"The latest attacks on the FBI and Department of Justice serve no American interests – no party’s, no president’s, only Putin’s. The American people deserve to know all of the facts surrounding Russia’s ongoing efforts to subvert our democracy, which is why Special Counsel Mueller’s investigation must proceed unimpeded. Our nation’s elected officials, including the president, must stop looking at this investigation through the warped lens of politics and manufacturing partisan sideshows. If we continue to undermine our own rule of law, we are doing Putin’s job for him.\"\nJocelyn Augustino/Redux\nOther Republicans, however, defended the decision, saying the information needed to be released to the public in order to ensure full transparency.\nSince reading the memo, I’ve believed that ALL deserve to see its contents. I commend the @HouseIntelComm and @POTUS for declassifying its material for the American people to see.https://t.co/rHKmZDiB49 — Rep. Arrington (@RepArrington) February 2, 2018\nW/out dossier, there would've been no FISA warrant. Was admitted under oath by McCabe. DOJ/FBI already knew dossier's source was unreliable & shouldn't be used, but filed applic w/it anyways. Waited until after to fire Steele. Then applied for extensions on warrant anyways. — Lee Zeldin (@RepLeeZeldin) February 2, 2018\nHere it is. The FBI took an unverified political dossier and used it to get a secret warrant to spy on an American citizen and political opponents. And they *didn't* tell the FISA judge that the DNC and Clinton campaign had paid for that dossier. https://t.co/qgOKd8lJd5 — Mark Meadows (@RepMarkMeadows) February 2, 2018\nFBI takes \"salacious and unverified\" dossier to secret court to get secret warrant to spy on a fellow American, and FBI doesn't tell the court that the DNC/Clinton campaign paid for that dossier. And they did that FOUR times. Read #NunesMemo. #MemoDay https://t.co/Ls02ktHcgD — Rep. Jim Jordan (@Jim_Jordan) February 2, 2018\nIt is important to keep in mind that this does not necessarily affect the work of the special counsel related to Russia. We will continue to work to ensure that the bureau remain fair, impartial and respect the Constitution. https://t.co/YnBTPki3fO — Rep. Garret Graves (@RepGarretGraves) February 2, 2018\nSteven Senne/AP\nSome Democrats expressed grave concerns over the precedent set by the release of the memo.\nTHREAD: The release of the Majority’s misleading, classified memo is extraordinarily reckless and will do permanent damage to the House Intelligence Committee’s work, which has a scope much larger than Russian election interference. https://t.co/rO1V0ADa2E — Mike Quigley (@RepMikeQuigley) February 2, 2018\n#NunesMemo is a biased political diatribe masquerading as Intel. FBI, under Trump-appointed McCabe, says “we have grave concerns about material omissions of fact that fundamentally impact the memo’s accuracy.” Schiff memo is accurate, balanced & fills-in the “material omissions.” — Rep. Brad Sherman (@BradSherman) February 2, 2018\nNow that @POTUS has released the memo, the American people can see how politically-motivated, uneventful & juvenile it is. Facts don’t change; warrants were obtained on valid, legal grounds. This memo only proves that @HouseGOP puts politics before #nationalsecurity. #MemoDay — Robin Kelly (@RepRobinKelly) February 2, 2018\nRepublicans, like Rep. Tom MacArthur, R-N.J., took a more nuanced approaching, acknowledging the concerns raised by the memo but also urging caution.\nAllegations in memo are serious, but must not be used to impugn the FBI or discredit the investigation by Special Counsel Robert Mueller. Anytime we talk about abuse of govt, Americans need to know, but we must not allow this memo to become a distraction from work we need to do. — Tom MacArthur (@RepTomMacArthur) February 2, 2018\nRep. Trey Gowdy, the chairman of the House Intelligence Committee, said that while the memo raises concerns, he still has confidence in Mueller, the FBI and the Department of Justice.",
    "source_domain": "abcnews.go.com",
    "title": "Capitol Hill reacts to release of GOP memo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/capitol-hill-reacts-release-gop-memo/story?id=52800026"
}