{
    "authors": [
        "Abc News",
        "More Mark"
    ],
    "date_download": "2018-03-20 07:33:12+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Sudan, 45, is survived by only his daughter and granddaughter.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fmale-white-rhino-dies-health-complications-leaving-animals%2Fstory%3Fid%3D53867742.json",
    "image_url": "https://s.abcnews.com/images/International/last-white-rhino-ap-mo-20180320_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The last male northern white rhino has died, the conservation organization in Kenya caring for the animal announced Tuesday, leaving only two remaining white rhinos in existence.\nThe rhino, named Sudan, who was 45 years old, was euthanized after his health fell into sudden decline \"over the last 24 hours.\" Ol Pejeta Conservancy and the Dvur Králové Zoo made the decision.\n\"It is with great sadness that Ol Pejeta Conservancy and the Dvur Králové Zoo announce that Sudan, the world’s last male northern white rhino, age 45, died at Ol Pejeta Conservancy in Kenya on March 19th, 2018,\" the conservancy announced. \"Sudan was being treated for age-related complications that led to degenerative changes in muscles and bones combined with extensive skin wounds. His condition worsened significantly in the last 24 hours; he was unable to stand up and was suffering a great deal.\"\nNichole Sobecki for The Washington Post via Getty Images\nThe only two northern white rhinos still in existence are Sudan's daughter and granddaughter. The second-to-last male northern white rhino died in 2014, at age 42, at the San Diego Zoo.\nOl Pejeta Conservancy had been \"cautiously optimistic\" just two weeks ago when Sudan appeared to be recovering from treatments for his \"age-related infection.\" They also posted a photo on Twitter showing Sudan enjoying the mud brought on by heavy rains in Kenya.\nIt’s been raining heavily on Ol Pejeta for the past couple of days and the weather certainly seems to have lifted Sudan’s spirits. He has been able to wallow in the mud - with the careful assistance of his caregivers – something that he seems to savour. pic.twitter.com/B0bhaIL7GN — Ol Pejeta (@OlPejeta) March 6, 2018\nSudan lived in captivity for the final 38 years of his life in order to protect and care for him.\n\"During his final years, Sudan came back to Africa [from Dvur Králové Zoo in the Czech Republic] and stole the heart of many with his dignity and strength,\" Ol Pejeta Conservancy said in a release.\nThe survival of the species, however, depends on less on the death of Sudan and more on the health of the two remaining females. Semen from dead northern white rhinos is stored around the world, according to The Associated Press. His daughter Najin and granddaughter Fatu would need to reproduce through in vitro fertilization, a technique which is still being developed, according to Ol Pejeta.",
    "source_domain": "abcnews.go.com",
    "title": "Last male white rhino dies after health complications",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/male-white-rhino-dies-health-complications-leaving-animals/story?id=53867742"
}