{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-03-19 19:26:15+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Steve Hemmert sold the guns back to the Miami Police Department as part of their gun buyback program this weekend.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fgun-owner-hopes-owning-ar-rifles-toxic-wearing%2Fstory%3Fid%3D53849671.json",
    "image_url": "https://s.abcnews.com/images/US/gun-buyback-ht-er-180319_hpMain_v4x3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Steve Hemmert lives a mile away from Marjory Stoneman Douglas High School in Parkland, Florida.\nInterested in Gun Control? Add Gun Control as an interest to stay up to date on the latest Gun Control news, video, and analysis from ABC News. Add Interest\nHe said Feb. 14 -- the day when a former student gunned down 17 people at the school -- was \"surreal.\"\nHemmert, who was a member of the Army Reserves, is familiar with guns. He said he used to enjoy going to the shooting range, sometimes with his teenage daughter, firing two of his AR-style rifles.\nBut now, after the Parkland shooting, the fun is gone.\nAnd soon, too, will his guns: Hemmert sold the guns back to the Miami Police Department this weekend as part of its gun buyback program.\n\"It was like a transformation between thinking of guns as kind of a fun hobby, to my God, these exact types of rifles just killed kids in my community,\" he told ABC News.\nKenRussellMiami/Twitter\nHe continued, \"I can't imagine ever having any fun shooting those guns. I was almost embarrassed to own them because how insulting to the victims that I would even want to keep those things in my house.\"\nHemmert, who left the Reserves in 2005 and now works as a lawyer, published a picture of himself turning over two AR-style rifles to a Miami police officer on Saturday. He later shared an emotional post on his Facebook page.\n\"My daughter recently told me that her plan is to only wear sneakers to school from now on, in case she needs to run. And I realize that, unlike some of my neighbors, I am lucky to still HAVE a 14-year-old daughter,\" he wrote.\nHemmert, 45, told ABC News that the shooting impacted his entire family, including his daughter, who attends a different high school.\n\"In the week after that [shooting], she said she went through each classroom and figured out where the best hiding spot was in each classroom,\" he said. \"It's disgusting that our kids should even think about that stuff.\"\nHemmert said he was always incredibly careful with his guns, breaking them down and storing them under lock and key. He realized there was no way he could guarantee that another person would take the same precautions.\nRhona Wise/AFP/Getty Images\nThat's why he decided to participate in the Miami Police Department's gun buyback program. Each gun the department received would be examined and possibly destroyed if found to be stolen or involved in a crime, officer Michael Vega told ABC News.\nThe Miami Police Department shared a picture on Facebook of the 128 firearms it received during the buyback.\nHemmert, who got a $250 Visa gift card for each of his guns, said he hopes that \"owning ARs becomes toxic, almost like wearing fur or owning ivory. It just becomes socially unacceptable to own AR rifles.\"\nHis emotional Facebook post has received more than 100,000 comments. While most have been overwhelmingly positive, he guessed 10 to 15 percent were \"really ugly.\"\n\"There are a lot of people that have a lot of guns that are really unhinged out there,\" he said, referring to some of the people who have made threats against him and his family.\nHemmert said that one of the worst messages he received was a text by someone who threatened to rape Hemmert's teenage daughter.\n\"There are so many people saying so many crazy and scary things on the internet,\" he said, adding, \"I don't know how the FBI could even keep up with all those people.\"\nRhona Wise/AFP/Getty Images\nSurvivors from other school shootings have also reached out to him. Hemmert called their messages \"humbling.\"\n\"I think people want to believe that there's a reasonable middle ground in the gun control debate,\" Hemmert said.\nHe added, \"Listen, these may be legal to own and they're fun to own but they're just too dangerous for the general public to have.\"",
    "source_domain": "abcnews.go.com",
    "title": "Former gun owner says he hopes owning AR rifles becomes 'toxic like wearing fur or owning ivory'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/gun-owner-hopes-owning-ar-rifles-toxic-wearing/story?id=53849671"
}