{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 05:19:40+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Both front-runners in the election for governor are inordinately wealthy.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fillinois-primary-set-expensive-governors-race-53866180.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_ef5ad765c3bd4eafbd067427406e6479_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Midterm Elections? Add Midterm Elections as an interest to stay up to date on the latest Midterm Elections news, video, and analysis from ABC News. Add Interest\nTwo inordinately wealthy front-runners who have largely bankrolled their campaigns for Illinois governor faced nomination challenges Tuesday in a primary that also features a self-described \"middle-class candidate,\" a member of a famous political family and an insurgent state legislator.\nWith Republican Gov. Bruce Rauner and Democratic businessman J.B. Pritzker combining to spend more than $120 million out of their own pockets so far on the contest, the battle for Illinois' top job is on pace to top California in 2010 as the most expensive governor's race in U.S. history.\nThe 61-year-old governor, a former venture capitalist serving in his first public office, took advantage of a national GOP wave four years ago to pull off a surprising victory in a state otherwise dominated by Democrats. Rauner's personal wealth is just shy of $1 billion, but Pritzker — an investor and one of the heirs to the Hyatt hotel chain — is worth several times more.\nPritzker, 53, has poured nearly $70 million into capturing a Democratic nomination that has proved tougher than initially expected. The field also includes developer Chris Kennedy, the 54-year-old son of the late Sen. Robert F. Kennedy; and Daniel Biss, 40, a state senator who for much of the campaign joked that he only gave himself $25 — drawing a contrast to his far wealthier opponents.\nRauner has his own GOP challenge from 53-year-old state Rep. Jeanne Ives. She has raised just $4 million — less than any of the other prominent candidates, but has attacked the governor's conservative credentials in edgy TV ads. One of them, which the chairman of the state GOP blasted as a \"cowardly attempt to stoke political division,\" portrays actors mockingly thanking Rauner for not doing enough to restrict illegal immigration, abortion and transgender bathroom rights.\nIn other races on the Illinois primary ballot, former Democratic Gov. Pat Quinn — whom Rauner ousted in 2014 — was locked in a tough competition with state Sen. Kwame Raoul for state attorney general. There also are numerous contested congressional primary races, including progressive candidate Marie Newman's challenge to seven-term Democratic Rep. Dan Lipinski.\nBut none involved the kind of spending as seen in the governor's race. Personal wealth solidified Rauner and Pritzker's front-runner status but also made them frequent targets for opponent attacks. Even Kennedy spent $2 million of his own money on the race.\nBiss, a Harvard-educated mathematician who gave up teaching to enter politics, set up a website to track what he says is a $171,000-a-day campaign by Pritzker. The Democratic front-runner has been advertising on television from nearly the moment he announced his candidacy 11 months ago.\nPritzker's opponents also have attacked his connections with overseas trusts in low-tax countries, though he maintains they're focused on charitable giving and that he has no control over them. In response, Biss has called him a \"fraud\" while Kennedy labeled him a \"liar.\"\nBut far more damaging were ads that Rauner ran against Pritzker after wiretap audio surfaced of him talking with former Gov. Rod Blagojevich. The ads included a 30-minute infomercial-style ad with the full FBI recordings.\nRauner took on Pritzker again when more tapes surfaced from the Chicago Tribune. They revealed Pritzker describing Secretary of State Jesse White — a Pritzker backer — as the \"least offensive\" black officeholder to be considered for the Senate seat vacated by then-President-elect Barack Obama. Pritzker has apologized, and White continues to back him.\nAlthough Biss has built his campaign around claiming to be the \"middle-class candidate,\" he has faced criticism as the architect of a plan to cut the roughly $100 billion gap in pension funding for the cash-strapped state by reducing some of the promised retirement benefits. Although he says he has learned his lesson and won't support it again, Pritzker has repeatedly criticized his change of heart.\nBiss and Kennedy have teamed up against Pritzker for his silence on whether Michael Madigan, the longest-serving state House speaker in modern American history, should step aside because of criticism about how he handled sexual harassment complaints by campaign workers against two of his political aides.\nRauner also has invoked Madigan in his ads against Ives, calling her \"Mike Madigan's favorite Republican and Illinois' worst nightmare.\"\nRauner rolled to victory in 2014 with a promise to \"shake up\" Springfield with a pro-business, anti-union agenda including lower property taxes and term limits on officeholders. But his ongoing spat with Madigan and other legislative Democrats left the state without a budget for two years while billions of dollars of debt piled up.\n———\nO'Connor reported from Springfield, Illinois.\n———\nFollow Sara Burnett at https://twitter.com/sara—burnett and John O'Connor at https://twitter.com/apoconnor .\n———\nSign up for the AP's weekly newsletter showcasing our best reporting from the Midwest and Texas: http://apne.ws/2u1RMfv",
    "source_domain": "abcnews.go.com",
    "title": "Illinois primary could set up most expensive governor's race",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/illinois-primary-set-expensive-governors-race-53866180"
}