{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:13:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Subway paleontology: LA construction unearths fossil trove",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTravel%2FwireStory%2Fsubway-paleontology-la-construction-unearths-fossil-trove-51712261.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/WireAP_f29e73bec53c47fba3a00e2430cb124d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As part of the crew digging a subway extension under the streets of Los Angeles, Ashley Leger always keeps her safety gear close by.\nWhen her phone buzzes, she quickly dons a neon vest, hard hat and goggles before climbing deep down into a massive construction site beneath a boulevard east of downtown.\nEarth-movers are diverted, and Leger gets on her hands and knees and gently brushes the dirt from a spot pointed out by a member of her team. Her heart beats faster because there's a chance she'll uncover what she calls \"the big find.\"\nLeger is a paleontologist who digs for fossils in the middle of a city rather than an open plain or desert. She works for a company contracted by Los Angeles transportation officials to keep paleontologists on hand as workers extend a subway line to the city's west side.\n\"They're making sure that they're recovering every single fossil that could possibly show up,\" Leger said of her team of monitors. \"They call me anytime things are large and we need to lead an excavation.\"\nSince work on the extension began in 2014, fossilized remains have routinely turned up from creatures that roamed the grasslands and forests that covered the region during the last Ice Age, about 10,000 years ago.\nThey include a partial rabbit jaw, mastodon tooth, camel foreleg, bison vertebrae, and a tooth and ankle bone from a horse.\nBut the discovery that still makes Leger shake her head in disbelief came about a year ago, shortly after construction began on the project's second phase. She was at home getting ready for bed when a call came in from one of her monitors.\n\"It looks big,\" he told her.\nThe next morning, Leger knelt at the site and recognized what appeared to be a partial elephant skull.\nIt turned out to be much more. After 15 hours of painstaking excavation, the team uncovered an intact skull of a juvenile mammoth.\n\"It's an absolute dream come true for me,\" said Leger, who spent the previous decade at a South Dakota mammoth site with no discoveries even close to the size of the one in Los Angeles. \"It's the one fossil you always want to find in your career.\"\nCalifornia's stringent environmental laws require scientists to be on hand at certain construction sites.\nPaleontologists have staffed all L.A. subway digs beginning in the 1990s, when work started on the city's inaugural line, said Dave Sotero, spokesman for the Los Angeles County Metropolitan Transportation Authority.\nPaying for the paleontologist staff from Cogstone Resource Management is factored into the project's cost, he said. When scientists are brought in to see what crews might have unearthed, work on the project continues, albeit in a different location.\n\"Our crews try to be as mindful as possible to help them do their jobs. We get out of their way,\" Sotero said, adding that when the mammoth skull was uncovered, construction workers helped deliver it to the mouth of the site.\nFrom there, the skull was hauled a mile or so to Los Angeles' La Brea Tar Pits and Museum, home to one of America's most fossil-rich sites.\nAssistant curator Dr. Emily Lindsey called it a \"pretty remarkable find,\" noting that while thousands of dire wolf and saber-toothed cat remains have been uncovered in L.A., there have been only about 30 mammoths.\nA few hundred pounds and the size of an easy chair, the skull is especially rare because both tusks were attached. It's being studied and is available for public viewing inside the museum's glass-walled Fossil Lab.\nWith a nod to Hollywood, the 8- to 12-year-old Colombian mammoth was named Hayden, for the actress Hayden Panettiere, featured in the TV series \"Nashville\" and \"Heroes.\"\nThe Cogstone monitor at the construction site had been watching her on television before spotting the speck of bone that turned out to be the intact skull.\nSimilar endeavors have turned up subterranean treasures during digs in other cities.\nWorkers at a San Diego construction site found fossils including parts of a mammoth and a gray whale and multiple layers of ancient seashells.\nLast year, crews working on a development near Boston's seaport uncovered a 50-foot (15-meter) wooden boat possibly dating as far back as the late 18th century.\nLindsey praised California's efforts to ensure science and urban development overlap, while bemoaning what bygone treasures may have been lost before the regulations went into place in the early 1970s.\n\"Most of the past is below the ground, so you're only going to find it when you dig,\" she said. \"As the city grows, I'm sure we'll find more exciting fossil material.\"\n———\nFollow Christopher Weber at https://twitter.com/WeberCM .",
    "source_domain": "abcnews.go.com",
    "title": "Subway paleontology: LA construction unearths fossil trove",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Travel/wireStory/subway-paleontology-la-construction-unearths-fossil-trove-51712261"
}