{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 06:20:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "A sign of MLB's future? Why the Cubs' 4-man outfield matters",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsign-mlbs-future-cubs-man-outfield-matters%2Fstory%3Fid%3D49220947.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r96517_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "There are only three positions in baseball that have the force of law behind them.\nThe pitcher really is the pitcher; once he comes into a game, he must face at least one batter before he can be replaced by another pitcher. The catcher really is the catcher; he has to set up in the area behind home plate, and if he's not in that area when the pitch is delivered the pitcher is charged with a balk. And the first baseman really is the first baseman, as he's the only player allowed to wear a special glove. There are rules about where these guys can stand.\nEverything else is just a suggestion. As with Ikea instructions, you're totally free to ignore them and build the thing however you like. It might fall apart, but if you can make it work, there's a Pinterest page waiting to celebrate you.\nOn Monday, when Joey Votto batted in the fifth inning of the Cincinatti Reds' 15-5 loss to the Chicago Cubs, opposing manager Joe Maddon decided to go off book. He sent his third baseman Kris Bryant into the outfield:\nWe might remember this as a freak show moment, a one-time thing that cutesy Maddon tried because isn't he precious. One-time thing or not, though, it should be taken more seriously than that. Baseball's having a serious conversation with itself right now, and this is an important moment in that conversation. Whether Maddon ever employs a four-man outfield again, we might trace something else back to this moment.\nWe might also wonder, simultaneously, why Maddon tried it here of all times.\nVotto's an odd candidate for the treatment. He's not an extreme fly ball or line drive hitter. His fly-ball rate (40 percent) is five percentage points above the league overall, but trails true flyballers like Joey Gallo (58 percent) and Cody Bellinger (49 percent). Despite an ability to go foul pole to foul pole, he isn't particularly damaging with his fly balls -- at least, with those that stay in the park. His batting average on fly balls in play over the past four years is only .080, which is roughly the league average. He's not a very fast runner, so there's no extra pressure on outfielders to cut balls off quickly to hold him to a single.\nBy moving an infielder to the outfield, the Cubs took away the chance to put on an infield shift, and Votto is a hitter against whom the shift has been very effective. Over the past three years he has faced 652 shifts, according to Baseball Info Solutions, and hit 53 points lower against the shift than against a more traditional infield alignment.\nHe was facing Jose Quintana, who is a moderately groundball-oriented pitcher. Quintana is also a lefty, whom Votto is less dangerous against than righties. (Votto had grounded out twice Monday night before the fifth inning.) And, for good measure, Wrigley Field isn't even a spacious outfield. By square footage, it's slightly smaller than the median pastures.\nFinally, the Cubs were up by five. They were trading a much higher likelihood of a single for a much lower likelihood of extra bases. The score would say their priorities should have been otherwise.\nI can name four points in favor of the call:\nWith one out and nobody on, a single is a little less harmful than usual and a double is a little more harmful than usual, so the base/out state was favorable.\nWith a five-run lead, it's a fairly safe time to try something you've always wanted to try.\nIt's fun, which isn't something you can usually say about facing Votto. Because...\nVotto has hit 354/.473/.628 against the Cubs since Maddon took over as manager. At a certain point, a reasonable human is willing to try almost anything.\nThese are the things you think about when deciding whether it's time for the four-man outfield. I happen to know a bit about it. A couple summers ago, Ben Lindbergh and I ran baseball operations for an independent minor league team. One of our beliefs was that positions are a social construct; one of our hypotheses was that we could do better. In select spots, we used both a five-man infield and a four-man outfield in regular (i.e. non-walkoff) game situations.\nThe five-man infield was the much scarier call to make. It left a huge part of the field exposed, and if the batter beat the alignment, he wouldn't just get a single (as he would beating an extreme infield shift) but a triple. Realistically, perhaps, even an inside-the-park home run.\nThe four-man outfield, on the other hand, was fairly low-risk. It would most likely cost only a single if it backfired, and the area that the alignment left exposed (opposite-field groundballs) is one that defenses are generally willing to concede to pull hitters these days anyway. But if it wasn't as scary, it also offered a lot less benefit. While tons of groundballs sneak through the holes in the infield (about a quarter of them), the vast majority of fly balls (about 91 percent) are already caught. The hits that go to the outfield tend to be either line drives in front of outfielders -- for which a four-man alignment like the Cubs used would offer little help -- or dingers, which, ditto.\nIn both cases, we made the decision because the spray charts told us it would make sense. But the more compelling reason for both the five-man infield and the four-man outfield was that we were facing batters we couldn't think of anything else to do. Our team kept trying to play regular defense against them and we kept failing. So we tried irregular defense. It's allowed!\nMaddon's move on Monday night matters because it reminds baseball of those two words: It's allowed. There's no reason to stand three guys in the outfield and four in the infield except that you believe it's the best way to do things. Usually it will be. Virtually, it always will be. But to do it that way, you should believe it's the best way to do things, and to believe that confidently requires constantly reassessing and constantly ruling out the alternative. Because there might very well be exceptions.\nMy guess is that, within a couple decades, we'll see corner outfielders routinely swap spots depending on who is batting; perhaps corner infielders, too. My guess is we'll see five-man infields when pitchers bat, particularly when the pitcher is expected to bunt. My dumb dream is that we'll see this dumb thing:\nOr maybe not. But the key to all of these is the acceptance that the law only has power over three positions. Everybody else is just a fielder, paid to stand where they can catch the most baseballs.\nFor the record, Votto doubled.\nHe doubled right past first baseman Anthony Rizzo, who might very well have been shaded that one extra step over if the Cubs had used a regular infield shift instead. Of course, the \"regular\" infield shift used to be considered pretty irregular, even radical. Nowadays, when the third baseman jogs over and stands in shallow right field, almost as far away from third base as he can go without getting light-headed, nobody even blinks. Third base is just a suggestion.",
    "source_domain": "abcnews.go.com",
    "title": "A sign of MLB's future? Why the Cubs' 4-man outfield matters",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/sign-mlbs-future-cubs-man-outfield-matters/story?id=49220947"
}