{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:26:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "The Latest: 650,000 celebrate at Penguins Stanley Cup parade",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Flatest-stanley-cup-champion-penguins-greet-raving-fans-48036669.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_8318a6f0e4784c64aeb98eaae6876b49_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the parade celebrating the Pittsburgh Penguins' Stanley Cup championship (all times local):\n1:45 p.m.\nThe Pittsburgh Penguins' Stanley Cup victory parade and rally drew an estimated 650,000 people downtown. Not bad for a city that, officially, has only 305,000 residents.\nThe crowd estimate by city public works and public safety officials makes it the largest parade, by far, to turn out for any of the Penguins' five championships. Last year's parade drew about 400,000 people — the most up to that point — and officials predicted as many as 500,000 might turn out to celebrate the team's back-to-back championships.\nThis year's parade was different than last year's in that it ended at Point State Park, where a stage was set up so the team and coaches could address the fans.\nSunny weather and temperatures in the mid-80s helped the turnout.\n———\n12:45 p.m.\nPittsburgh Penguins players have greeted cheering fans while riding in pickup trucks, convertible cars and buses during a parade celebrating the Stanley Cup champions.\nMVP Sidney Crosby was riding with the cup during the Wednesday parade in downtown Pittsburgh. But he jumped out of the vehicle occasionally to give fans a close look and allow them to take pictures.\nThe cheering crowd was 20 deep in some spots along the route. The city says it will provide a crowd estimate, but planners predicted as many as 500,000 people might show up.\nThe Penguins beat the Nashville Predators 2-0 in Game 6 on Sunday.\n———\n6:25 a.m.\nHundreds of fans already have lined up along downtown Pittsburgh streets and in Point State Park for a parade to celebrate the Penguins' Stanley Cup championship.\nPlanners say as many as 500,000 people could turn out Wednesday, surpassing the 400,000 who attended last year's celebration, which was the biggest for any of the team's five Stanley Cup championships.\nThe parade route streets will close by 9 a.m. for the 11 a.m. parade. The parade will run along Grant Street and Boulevard of the Allies as it did last year. But this year, it will continue into Point State Park, where players, coaches and other dignitaries will take the stage.\nThe Penguins won the cup Sunday against the Nashville Predators with a 2-0 win in Game 6.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: 650,000 celebrate at Penguins Stanley Cup parade",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/latest-stanley-cup-champion-penguins-greet-raving-fans-48036669"
}