{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 04:55:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Protesters topple Confederate statue in North Carolina",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fprotesters-topple-confederate-statue-north-carolina-49219043.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_e642c47835134a5d9842654049b4c204_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Protesters in North Carolina toppled a nearly century-old statue of a Confederate soldier Monday at a rally against racism.\nActivists in Durham brought a ladder up to the statue and used a rope to pull down the Confederate Soldiers Monument that was dedicated in 1924. A diverse crowd of dozens cheered as the statue of a soldier holding a rifle fell to the ground in front of an old courthouse building that now houses local government offices.\nSeconds after the monument fell, protesters began kicking the crumpled bronze monument.\n\"I was a little bit shocked people could come here and come together like that,\" said Isaiah Wallace, who is black.\nWallace said he watched as others toppled the statue. He hopes other Confederate symbols elsewhere will follow.\n\"I feel like this is going to send shockwaves through the country and hopefully they can bring down other racist symbols,\" he said.\nThe Durham protest was in response to a white nationalist rally held in Charlottesville, Virginia, over the weekend. Authorities say one woman was killed Saturday after one of the white nationalists drove his car into a group of peaceful counter-protesters.\nAlthough the violence in Virginia has prompted fresh talk by government officials about bringing down symbols of the Confederacy around the South, North Carolina has a law protecting them. The 2015 law prevents removing such monuments on public property without permission from state officials.\nIn response to the statue in Durham being torn down, Democratic North Carolina Gov. Roy Cooper tweeted: \"The racism and deadly violence in Charlottesville is unacceptable but there is a better way to remove these monuments.\"\nAfter the statue fell, several dozen protesters congregated on the street in front of the old courthouse. Some took pictures standing or sitting on the toppled soldier, in front of a pedestal inscribed with the words \"In Memory of the Boys Who Wore The Gray.\" Police cruisers blocked off the street, and officers looked on — some filming. As it got dark, rally participants began to peacefully disperse.\nRobin Williamson, who works downtown, arrived in the area about an hour after the statue came down. Williamson, who is black, said he can sympathize with people who are upset with the state of racial discourse in the country.\n\"People feel that with Donald Trump as leader, racists can be vocal,\" he said.\nHe said that while Confederate monuments have been defaced in other cities, it was surprising to see an entire statue brought down by protesters.\n\"This is a little bit more intense because they took the whole statue down,\" he said.\n———\nFollow Drew at www.twitter.com/jonldrew",
    "source_domain": "abcnews.go.com",
    "title": "Protesters topple Confederate statue in North Carolina",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/protesters-topple-confederate-statue-north-carolina-49219043"
}