{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:32:06+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Authorities said the officer was trying to pull the person of interest over for an expired tag.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fpolice-person-interest-allegedly-shot-officer-car-chase-55547435.json",
    "image_url": "https://s.abcnews.com/images/WNT/180530_wn_perez1_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Police looking for person of interest who allegedly shot down officer after car chase\nhour, the urgent manhunt for the killer of a sheriff'sut in Tenn authorities say deputy Daniel bake a his father, was responding a report of a suspicious vehicle. He was then St a Kil confronting the suspect. Tonit, police now identifying the AEG gunman asve Wiggins. They are warning he I armed and dangers. And ABC's Alex Perez with news coming I the searconight. Reporter: An inmanhunt. Just outside Nashville tht. Inveators urgently going door-to-door, looking for a suspect say gunned a deputy sheriff trying to pull him over onthat wouldder a deputy sheriff protecting our community a threat to anyone. Reporter: Teal unfolding about 7:00s morning inkson county, Tennessee. Nashville all units. Prepare to copy on a bolo.\" Reporter: Authorities say ea Daniel batried to pull Steven wiov for an expired tag. Wiggins then allegedly leading Ker on a chase ended with a shootout. Investigatoren say baker's radio went silent. Using gps, they later tracke down hisicle finding his bodyinside. According to a police report, wiggwas wanted F assault and theft after policeesponded a domestic call Tuesday and were told he slappwoman, put a gun to her head threatened to kill her if she police. Later, sing her car. As autties work to zero in Wiggins, sergeant baker's colleagues tonight are praying for justice. T my prayero god T our court will be a ter him on the --N the phment he receives. And Perez with us now. Dalex, we know the veter sheriff's deputy was beloved by S colleagues there. Reporter: Ah,david. They are artbroken. He was ten-year veteran of the force. Eaves behind his wife and a young daughter. Law enforc across Tennessee tonight search for that suspect, who is believed T armed dangerous. David? Ex Perez tonight. Al thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Police looking for person of interest who allegedly shot down officer after car chase",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/WNT/video/police-person-interest-allegedly-shot-officer-car-chase-55547435"
}