{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 21:44:05+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "President Trump unveiled his plan to tackle the opioid epidemic in Manchester, New Hampshire.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrump-calls-death-penalty-drug-dealers-53857829.json",
    "image_url": "https://s.abcnews.com/images/Politics/180319_gostream_trump_opioids_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump calls for death penalty for drug dealers 'where appropriate'\nPresident Donald Trump in Manchester, New Hampshire outlining his old you wait a tax plan and quite a bit more. On ABC news political director recline joined here by our White House reporter Catherine falters there was a lot packed in here this is a major hallmark. The president's campaign in New Hampshire and elsewhere talked about hope UAW's in the surgical Hewitt. He also got quite a bit into drug policy more broadly immigration policy a little bit of politics and a whole lot of political intrigue to not at all. Not death penalty that's not as well but let's start though with the with the basics of the substance because there's been so much anticipation around the president has office. For a little more than a year now a fourteen month. A couple months ago we had that passports to come back led by former governor Chris Christie that recommended meter action populist what are we talking about here that's actually be new. I mean that's a good question right you heard a lot of this when he was campaigning in New Hampshire and obviously that state is having a difficult time with you crisis and that sparked his interest at least he says right so. About four months ago he declared this public health emergency and now and now you have. Him rolling out this Nancy but he's been at teasing at a lot that you content. I'm more specifics here you just for minorities is going to launch a public awareness campaign we've heard that from him before he's going to enforce mandatory minimum sentences for drug traffickers. And then seek the death penalty where appropriate now the administration and we had to call them last night couldn't. I'm really define when the appropriate circumstances would be but as he remembers talking about before he's really. Changing any laws here you know we've seen and in previous drafts put forward on by the administration of taking a harder line on as the language that you they used in another traps with the death I don't. Tony should be stopped for certain cases where OP would including fentanyl related. Drug dealing and trafficking are directly responsible. For death so a little bit of a walk back at least than in what we're seeing them them put forward but this is the first time. And that they have really well in this this death penalty. Into policy we've heard and he's alive especially you've heard other countries any mention went. But yes the first time we've seen it. And how long we should we should mention is why did it here that talks about preventing opium addiction. And this incentivizing doctors from making those prescriptions. Treatment but this a lot of this really was about drug policy is supposed to public health policy and that's for the president's call for the death penalty for drug dealers comes in. He obviously has some modeling of other countries that have done it that he would like is that gets half model that that he uses is critical to addressing a Pulitzer and drug rock. Exactly you heard that means they get cup multiple times and especially was talking and adapt to the apps right that the first time that was really about. How then in preventing addiction and tighten federal funding around epic song and shift into. Making about immigration policy on newstalk another Wally said we're gonna build belong to keep the damage that is what he sent him is so. Also using it as a platform to talk about his aggression pollen season and in the drug. Yet he singling out Sanctuary Cities in New England in the Manchester area Massachusetts's. In the region as part of the problem he also be. What a good bit of politics into it says the Wallace in Kennedy going to be part of this were to make it part of our campaign I wanna look in Jordan Phelps is over at the White House. It seems like the president had a lot on his mind that was much broader than just OP Lloyd's today and I'm not even talking about the issues around has that the Muller probe in his own legal team entered into in a minute but. The way heat this Jordan wraps immigration policy and and more broadly drug policy in the opulent announcement at least surprise me at that this wasn't a very tailored OPO it message today. Yeah average at times the White House staffers load any very carefully worded message into a teleprompter but. You could tell there that the president wise going off prompter from time to time as he. Is apps to deal and I and another headline that. I noticed was that he sad that he wants cynics here kids against using drugs he talked about having. And expensive commercial campaign. I which really harks back to the 1980s. Just say no campaign. At which of course his was liked by Nancy Reagan in large part. Back then I so it's kind of interest saying that the president. Eyes harking back to you kind of an old approach. And to taking on drugs which I you know the track record of that. Act has been taxed at our day in history. And snow EI interesting to see him do that and sat talking about at scaring kids against using drugs which is something we we. Hurt and talk about four. A lot of the cabinet is fitting into the broader world view the president brings to this witches is there's bad guys out there. We need to stop the flow we need to crack down on the back us much else to me is since it in contrast with what a lot of what you hear from people on the ground the opulent crisis. A lot of the folks who've fell victim to addiction. Are not your prototypical criminals there right at the BBB become addicted the pain killers via prescription drugs. It's not how we typically thought about the openly crisis it seems that the president is putting that together in his mind his approach. And I absolutely is it's not how we've thought about it we've talked to people who have. That affected by the U mantras he he bought a cup on the folks up there. To discuss that but that you're exactly right aid fits into his message of keeping the bad guys out having the good guys and and you know we're gonna look bill this wallet prevent writing it as it kind of goes and other policies of his as well you know we're talking about haven't specifically here that you you know client to. Some of those other policies and hear a lot of thing inlets Franklin. Yet and Jordan there was a reference there of the president's he's an announcement we'll see if it happens or not is a tendency to say these things happen and maybe not a news conference at some point talk about scripture drug prices he's talked about this in in the past and never. Seems to have much follow up at the White House had anything about. What might be in the works in terms of the next step for a next phase of this. Yeah at a rate the president he bit of news there I got ahead at his own press department as he added does from time to time. I there is no word at a press conference coming next month bike. You can bet that will be something we're following up on by Rick is you know as well as we DO at this when it beat up first time. If that press congress doesn't happen that the president announces something that adds that never makes its way Andrea Day. And that's that's interest exactly because it was not that long ago that the president was saying it would be no changes in his legal team and today. We find out that a better in former US attorney. Joseph DiGenova is added to build legal team captain Eric a lot of time. I'm talking to legal team tracking these developments what does the city use the president is adding this and veteran Washington. Oh well and I think Jordan actually have made this plan on our. I'm internally earlier right he is the president just recently said that he wasn't going to expand his legal team that he was satisfied with his two outside attorneys I'm John Dow. And down Ty Cobb on the inside Wright said this. He's adding in judgement house sign on legal team to expand acting they'll be three lawyers now that tells you is that this broad is far from crying and they've. Told the president multiple times and he is thought so too that this was coming to an end but I. Think we're far from the hi this is Washington learned has been around for a long time he's obviously. Has some theories that the president has been framed by the DOJ and the FBI. That could've played into his hiring a little bit there. But what it tells me is that it it's expanding and it probably is not coming to mean any patents. And a presidency to realize that over the weekend activities tweets were quite aggressive. Using using Muller's name and a tweet by our reckoning for the first time I influence incline is a witch hunt as recently as this morning talking about the Democrats and higher as part of legal team. I was entry Catherine in in in Jordan by the fact that Jeff Sessions made the trip today and got. A little shout out from the president he sat right next to the First Lady on it thought it was just Friday night. That the attorney general be good on. A lot of people's calls from president trump on down to fire. And indicate the former FBI deputy director. He was fired on Friday night Jeff Sessions meet that decision if the suit. I'm and bask in some presidential blow today it's a little while since we had. Any insults aimed at Jeff Sessions like the president at least from the outward signs of real accurate attorney general Norton. Yeah it seems like Jeff Sessions stock at least for a couple of days has gone up in this administration and I someone joked on Twitter that this is the most nice. I accept that president trump is sad about fashioned analog timing really all he said ways spanking jab for a year at a perhaps. By yet that's chef suggests how look at this relationship as sign that. Hinges getting assembled shout out from the president today was that good news story for Jeff Sessions. And teeing up the rest of the week we know there going to be a lot of questions on Capitol Hill and beyond about. A what to do about the president's lashing out at at at these special counsel Robert Mueller there are calls Catherine for special legislation to protect his status. And in a lot of warnings on the Sunday shows yesterday very striking for Republicans allies typically of the president saying this to be very bad idea to fire Bob Lawler. Ready side tree Goudie Lindsey Graham on the Sunday shows saying yeah it a bad idea but it going to be the thing about. I've been here before Brighton and White House that said. Over at least ten times that we can count the president isn't going to fire. Special counsel Robert Mueller so of course now we see these tweets and we start. Discussing an and it legislation on capitol that can preventing access but at that is really going to. Dominant conversation this week and he wonders and an half fund where wine is something we're talking about what we're Keith. Is the conversation is Blair release the late night statement last night and after his outside Blair released pretty is statement saying. He didn't meet this project conduit and well time com the White House special counsel had to say that unit reassure again that the president is not I'm considering or discussing. I'm hearing Robert Mueller but I think the reality is that he's the only ones friends in the U. And told him multiple times and stamped Twitter and not talk about this but. It hasn't worked so I think we'll see warrant. Of these attacks on the line even today touted what. Yeah I India and finally Jordan I am struck by the mixing of the policy in the political Leo VOA. Epidemic reports is not a partisan issue has. Brought by and I you know what you guys bull covers the campaigns in 2016 extensively on different candidates you've heard about this almost every way. The real legitimate public health crisis that that matters in New Hampshire and so many other parts of the country. This struck me as a very political response to it in addition to new policy steps the president even talking about this Jordan as a as it has a left moral issue when it comes to immigration months. Absolutely at this is an issue that cuts across apt partisan lines by act of person you have a president get up there and talk about the death penalty for drug dealers. I doesn't take long for that to become political and and that's what what we saw today. And you know this is something this is part of that image that beat top image that presidents from whites took her Jack. I and that's what we saw him him really playing up today even about it. Hinted that saying you know in countries where they are zero tolerance policies. I have what is it when it comes to drug dealers and they don't have a drug problem. Eyes so it you know the president and it is projecting that is as part of his image. And I you know well we'll see how that at with the voters. And for all that Katherine as we discussed that not clear that ref to talk about new policy when it. It comes to the death penalty for his enforcement of existing policies we've reported others are reported that the president has been talking. Behind closed doors about it and firing squads as the potential. Ready for for drug dealers weak but it seems like this is not quite as far as some of his instincts may have let him when he's been using privately about this issue. Exactly it doesn't seem quite as far as Ali elegant from the previous drafts we've seen what we've heard. Behind closed doors but the reality is in this actually this policy it says quote under current law outbreak and the administration haven't. Made clear what exactly onions so. We've heard him and we've heard that he's been discussing these things and private really Rick Santelli says that publicly or what exactly. In the expectations here arm from Lew all right. Next phase in the OP way to attack that plan that Katherine folders and Jordan felt over a White House. Thanks a lot for being here that does it for now on ABC news political director Rick liking watching all the time here AD BC news.com after next.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump calls for death penalty for drug dealers 'where appropriate'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trump-calls-death-penalty-drug-dealers-53857829"
}