{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 02:53:12+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Turf Nation and Sportsfield Specialties are just some of the companies making the weekend special.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fgoal-posts-turf-made-america-companies-hand-super-52808916.json",
    "image_url": "http://a.abcnews.com/images/WNT/180202_wn_muir_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for From the goal posts to the turf, these Made in America companies have a hand in Super Bowl LII\nMade in America. The victory even before the super bowl. Reporter: Just 48 hours from kickoff, super bowl Sunday in Minneapolis. The patriots and the eagles, and the American workers already winning. Turf nation in Dalton, Georgia. Spools of green turf coming off the line, 80 workers in all. Making 10 million square feet of turf this year alone. Ten shipping it to U.S. Bank stadium. Rolling it out. Setting it in place. The finishing touches by hand. Turf nation. Proudly made in America. Reporter: And at the ends of that turf, the goal posts. From Delhi, New York. 100 workers at sportsfield specialties welding, shaping, and painting about 1,000 goal posts a year. And just to be clear -- Our goal posts are made in America. Reporter: All eyes on the end zone, and on the ads. The one that got our attention years ago. Nobody builds factories in the U.S. Anymore. You can't do that. Reporter: Weathertech spending millions to get the word out. You want to hire workers here in the states? Reporter: They do, and this year, their fifth consecutive super bowl ad. They are building a factory right outside Chicago. 1,000 new workers since we last visited and we remember what the founder told ps. We create jobs here, and we keep the money right here in America. Reporter: With so many fans coming to Minneapolis, 10,000 volunteers and what's keeping many of to them more, those purple hats from love your melon made in Minneapolis. 200 workers and more than a million hats a year. It's special to say everything is made here, and it's keeping jobs alive here in our own country and we're just really proud of that. Reporter: And something else they are proud of -- half of every sale going to cancer research. Visiting hospitals, donating their hats to children in the fight, keeping the children and super bowl fans warm, with these words in mind -- Mad From Boston's news leader, this is WCVB newscenter five at 7:00. Emily: We begin with breaking\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "From the goal posts to the turf, these Made in America companies have a hand in Super Bowl LII",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/goal-posts-turf-made-america-companies-hand-super-52808916"
}