{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:28:17+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "20-year-old man guilty in the torture, starving and beating of two children.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcalifornia-man-convicted-torture-deaths-children-54702578.json",
    "image_url": "http://abcnews.go.com/US/wireStory/california-man-convicted-torture-deaths-children-54702578",
    "language": "en",
    "localpath": null,
    "maintext": "A jury in Northern California convicted a 20-year-old man of torturing, starving and beating two children whose bodies were found in a storage unit.\nThe jury on Monday found Gonzalo Curiel guilty in the 2015 killings of a 7-year-old boy and his 3-year-old sister. They also convicted him of torturing their older sister in their Salinas apartment, KSBW-TV reported.\nCuriel's former girlfriend and the children's relative, Tami Huntsman, 42, pleaded guilty in February to two counts of murder. Huntsman had agreed to care for the three children after their mother was killed in a car accident and their father — who is related to Huntsman — was sent to prison.\nAn officer found the oldest child, then 9, with bruises and a broken collarbone in the backseat of a locked SUV in December 2015. Officials later located the tiny bodies of her siblings in plastic containers inside a storage unit in Redding, about 300 miles (483 kilometers) north of Salinas.\nThe child told investigators that Huntsman and Curiel killed her younger siblings on Thanksgiving after she was caught stealing a bagel. The girl, now 12, was the primary witness in Curiel's trial.\nShe told jurors she and her siblings were stripped naked, sprayed down with cold water, beaten with a shower head, and locked in a tiny bathroom for extended periods of time as punishment.\nCuriel was a \"sadistic\" person who \"enjoyed controlling and hurting children,\" Monterey County Assistant District Attorney Steve Somers said.\nCuriel was a minor when the killings occurred. He was tried as an adult, but prosecutors were not able to seek the death penalty under California law. He and Huntsman were scheduled to be sentenced next week.\n———\nThis story has been corrected to show Gonzalo Curiel's first name was misstated as Gustavo.\n———\nInformation from: KSBW-TV.",
    "source_domain": "abcnews.go.com",
    "title": "California man convicted of torture deaths of 2 children",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/california-man-convicted-torture-deaths-children-54702578"
}