{
    "authors": [
        "Abc News",
        "More David"
    ],
    "date_download": "2018-02-03 09:17:01+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "'We Love Our Mayor' billboards pop up in Nashville after mayor's admission of affair",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Flove-mayor-billboards-pop-nashville-mayors-admission-affair%2Fstory%3Fid%3D52813026.json",
    "image_url": "http://a.abcnews.com/images/Politics/ht_billboard_dc_020318_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "If billboards popping up in Nashville are any indication, Mayor Megan Barry's admission on Wednesday that she had an affair with the former head of her security detail, has done little to erode her support among the residents of Tennessee's largest city.\nCase in point: At least two billboards proclaiming \"We Love Our Mayor\" have been spotted in Nashville. One is situated off Interstate 24 and another is located in downtown Nashville on Silliman Evans bridge, ABC affiliate WKRN reported Friday.\nAccording to WKRN, it is unclear who paid for the billboards. WKRN said it reached out to the billboard company for comment but has yet to hear back.\nMark Humphrey/AP\n\"Today, I have acknowledged publicly that I have engaged in an extramarital affair with the former head of my security detail,\" Barry said in a statement Wednesday, of the affair with retired Metro Nashville Police Department Sgt. Robert Forrest.\nBarry continued, \"I accept full responsibility for the pain I have caused my family and his. I am so sorry to my husband Bruce, who has stood by me in my darkest moments and remains committed to our marriage, just as I am committed to repairing the damage I have done.\"\nAt a press conference Wednesday, following her statement's release, Barry told reporters that the affair \"is over.\"\nWKRN\nForrest, meanwhile, said in a statement, \"I deeply regret that my professional relationship with Mayor Barry turned into a personal one. This has caused great pain for my wife, my family, friends and colleagues. At no time did I ever violate my oath as a police office or engage in actions that would abuse the public trust.\"\nWKRN via Nashville.gov\nNashville TV station WZTV spoke to drivers who expressed their support of the embattled mayor.\n\"Megan Barry has done a lot for Nashville,\" Nashville resident Latisha Yarlett told WZTV. \"She's brought us a very far way.\"\nFellow resident Andy Martin told the TV station, \"When I saw the billboard I thought you know that's Nashville . That's pretty cool.\"",
    "source_domain": "abcnews.go.com",
    "title": "'We Love Our Mayor' billboards pop up in Nashville following mayor's admission of affair",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/love-mayor-billboards-pop-nashville-mayors-admission-affair/story?id=52813026"
}