{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 13:03:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Police are searching for the person responsible for allegedly shooting at least four random cars within 10 miles and 20 minutes of each other.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fgunman-allegedly-terrorizing-drivers-michigan-highways-51713489.json",
    "image_url": "http://a.abcnews.com/images/GMA/171211_gma_bankert2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Gunman allegedly terrorizing drivers on Michigan highways\ngoing to stop any time soon. To an apart serial shooter in Detroit. Police are trying to find a gunman terrorizing drivers on the highway after a fourth person came forward saying she was targeted. ABC's Adrienne Bankert has the latest. Reporter: An urgent manhunt to find the person responsible for shooting at random cars on two Michigan freeways. People were hanging outside the vehicle shooting. Reporter: At least four cars have been hit. Individual says that he was driving down the road. Heard some popping sound, pulled over to the sound of the freeway and saw bullet shoes in in his car. Reporter: He pulls over bleeding as he limps inside for help. Can you call E police for me? I just got shot in my electric. I thought it was a rock. I'm on I-94. Reporter: All within ten miles and roughly 20 minutes of each other. Sounds like our caller's vehicle was struck. He's got a couple of flat tires and he has holes in his vehicle. Reporter: Three describe a silver car pulling alongside them and shots fired. Police believe it is the work of one gunman. We don't rule out anything because we're at the very beginning of this investigation. Reporter: Now, we're here on that stretch of roadway where the man says that bullet hit his leg. None of the other drivers were hurt. But when you do the math, the gunman had to be traveling at speeds well over 80 plus miles per hour in order to be at all four shooting scenes. All right, Adrienne, thanks for being there with us.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Gunman allegedly terrorizing drivers on Michigan highways",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/gunman-allegedly-terrorizing-drivers-michigan-highways-51713489"
}