{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 16:35:17+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The actress discusses what fans can expect next on the hit comedy series.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fvideo%2Fsutton-foster-opens-younger-live-gma-55530111.json",
    "image_url": "https://s.abcnews.com/images/GMA/180530_gma_breakfast_foster3_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Sutton Foster opens up about 'Younger' live on 'GMA'\nOur next gue is a triple at. She can sing, ladied gentlemen. She can dance and she C act. Please welcome two-timeony winner and the star of the hit show \"Younge\" Sutton foster. Hi. So N to meet you. Morning. Hi. Congratulations on everng. Thank you. Thank you. Hey. Mwah. Great to S you. So good to see you too. Hi. Oh hi,guys. Took away the chicken fingers. I know -- I got excited. I love them. We caing them bk. So exci th fifth season for \"Younger.\" Yes,conglations. Sogood. So tive. Wonderful, wonderful ca okay, for those people who hav not seen it, shame on Y because it's anxclent show. You are trying to pul off B 27 years old at work. Yes. S? Yes, yes, and yes. And it's five seasons in, play a 41-year-old mom W is trying vent her life and troubl getting hired in the publishingld and so age is just a number people -- if you- peo believe what you tell them so I tell them I'm in my 20s so I'm -- yeah. Ying to be more relevantnd so far five season , people are buying it. Y really are you haven't aged a bit in the St five years. We have a lit sneak peek to season . You all want to see? Yeah. Let's D. Ave a surprise for you in office. Can I have hint? I don't think I couake another one today. Colleen. I missed yous ek. Didee \"Good morning America\"? I did. I wish you had been th that your victory too. Plse ] Sry about T would you ever want to B to your 20 K. No. I was a mess in my 20s. I feel like myife has only ten better every decade. M 43 now and I feel like yeah, there's way. I mean M if could retain L of my knowledge a then . But, no. What was the biggestng you had to about being in your 20s day. You mean now like going back in T 20s. So much C when I in my 20s it wa before social media, before the, know, the worldwide web and so I feel L idt grow up with all phone. I didn't have that type instant access to things that's really -- it's like the social media culture I what and, you know a of the lingo andll the things, ye those still, I't know what that me I have to look that up. You Kee yourself very . Yes, you do. W is this crocheting baby blankets. So my husband and I, we have a 15-month-old Daer, Emily. We adopted her last yht before season foured a have all this extra anx I started crting baby blankets and madey new year's resolution to make T baby blankets. At the end of the yea I'll Aun them off charity. Nice. Great idea. So -- Great blankets. Yeah, so I startedesigning my own patterns and I auc them off for an adoption charity so I can help other families. Bleour heart. Be able tore in the joy of adoptionecause it's changed our lives. And robin said we have slow this outthere. \"Take me to rld.\" Ur new album you have so you're definitely keeping yours busy. A long time in the making and totally INSPI by becoming a mom. It's everything, thing I and do is different now. So thing -- this is all all songsor of inspired by her. Does she have a fate. Actually I played her -- a lullaby \"My best friend and I we have beans T are seven weeks apart and so we sing a song on there, ush little baby\" and a quiet thing and the very first time played itor my daughter she look at the speaker and looked at me looked at the spe a looked he and she call crawled into my lapnd puter forehead against M forehead and I was like, what's happening? And she wasli, I'm like, this is for you. This is for Yo so it's -- yeah, B I don't know if she realizes mommy a voice comes from the speaker. Ow someday she's going to B like don'tsing, but for now? We're happy you came here for we really are. Sutton, thank you soh. Season F of \"Younger\" premieres 5th onv land and Sutton's new album isut Friday. Make sure you G pick U a copy. Everyone in audience, you're going home W a free copy. How about that?\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Sutton Foster opens up about 'Younger' live on 'GMA'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/video/sutton-foster-opens-younger-live-gma-55530111"
}