{
    "authors": [
        "Abc News",
        "More Ali"
    ],
    "date_download": "2018-05-30 19:55:33+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Reality TV star Kim Kardashian is bringing her quest for clemency for an imprisoned grandmother to the White House today.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fkim-kardashian-west-visiting-white-house-discuss-clemency%2Fstory%3Fid%3D55532055.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/kim-kardashian-ap-jt-171112_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Reality TV star Kim Kardashian Wednesday brought her quest for clemency for an imprisoned grandmother to the White House.\nInterested in Kardashians? Add Kardashians as an interest to stay up to date on the latest Kardashians news, video, and analysis from ABC News. Add Interest\nWhite House spokeswoman Sarah Huckabee Sanders confirmed that Kardashian was visiting the White House but would not confirm the people with whom she was meeting. She was expected to meet with Jared Kushner, the president’s adviser and son-in-law, who has led the Trump administration’s efforts on criminal justice reform.\nKardashian began advocating on behalf of 62-year-old Alice Marie Johnson earlier this year. The grandmother was given a mandatory life sentence plus 25 years in 1997 for her part in a cocaine distribution ring, her first offense.\nKushner, whose father spent time in prison, has made prison reform a personal passion, saying he wants to help those who \"have made mistakes, paid the price and are deserving of a second chance.\"\nJohnson’s daughter Tretessa had earlier told ABC News that she was grateful to Kardashian and her legal team for working on behalf of and shining a light on her mother’s case.\n“She could have just saw the video or read an article or whatever and just said ‘oh that's a shame’ or whatever and went on with her life, but she didn't, she chose to get involved in a major way,” Johnson told ABC.\nThe Johnson family first sought clemency for Alice, unsuccessfully, from President Barack Obama, gathering letters of recommendations from her warden and from members of Congress.",
    "source_domain": "abcnews.go.com",
    "title": "Kim Kardashian West visiting White House to discuss clemency case",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/kim-kardashian-west-visiting-white-house-discuss-clemency/story?id=55532055"
}