{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 08:21:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Harry admitted in an interview with The Telegraph's Mad World podcast that he received mental health counseling because he was struggling to cope with Princess Diana's death.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fprince-harry-shut-emotions-losing-mother-46855573.json",
    "image_url": "http://a.abcnews.com/images/Nightline/170418_ntl_prince_harry_1253_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Prince Harry says he shut down his emotions after losing his mother\nYou know we all know that for years, prince Harry was known as the naughty bachelor prince. Often landing in the tabloid for his exploits. Now he is in a steady relationship showing us his vulnerable side. What led to his drastic life change. Here Nick watt. Reporter: Prince Harry fun one, hell raiser T. Party prince. Recently, Harry has mellowed going stoed with Megan Markel and we know what lies beneath. 32-year-old prince unguarded, candid, mildly sweary on a just posted mental health broadcast, bryony Gordon's \"Mad world.\" It was 20 years of not thinking about it and two years of chaos. There has been a terrible accident involve dyingian that princess of Wales. Reporter: His mother, princess Diana, the princess without the fairy tale ending died in a car crash in Paris, 1997, Paparazzi on her tail, a year after her divorce from prince Charles. She was 36 years old. The images of William and Harry walking behind their mother's coffin, no tears, just stiff upper lips. All around. Gives you some idea of how people from that country, from that class, traditionally, deal with loss. I can safely say that losing my mum at the age of 12 and therefore shutting down all of my emotions for the last 20 years, has had a quite serious effect on, on not only my personal life but also my work as well. It was described as the party prince, coming out of night clubs. Red faced. Reporter: Older brother, quieter William stays home with his seemingly perfect family. Harry struggled. We saw that, we witnessed that in his behavior. He was saying he was close to a full mental breakdown. Where he was nervous about going, to royal engagements. He didn't really know if he could carry those out. Reporter: He started dealing with it just a couple years ago. Served himself in Afghanistan. And worked helping veterans rehabilitate. I'm lucky enough to watch some one who should be dead, run the 100 meters. You want definition of inspiration. That is probably it. How is the training going? Going well. Nice. Reporter: That work is partly what sparked the personal realization that he also needed help. William, also encouraged him. Some of the best or easiest people to speak to is a shrink or who ever, I know the Americans call them shrinks, you sit down. And you just let it all rip. You've done that have you? I've done that a couple of times. It was great. Can't believe I have never didn't. There was a little nervousness admitting that he sought professional help even then because of the royal family stiff upper lip. I actually did a bit of boxing during those two years, I took up boxing. Everyone was saying boxing is good for you. Really good way of letting out aggression. That really saved me. Because I was on the verge of punching some one, so being able to punch someone who had pads was certainly easier. Reporter: Along with Kate and William. He launched a charity. Heads together. Just one. Do this one. To tackle mental illness. What we're freeing to do is normalize the conversation to the point of where any one can sit down and have a coffee and just go, you know what, I've had a really Day. Can I tell you about. Everyone needs a hug now and then. And I've been told, I am very good at hugs, giving hugs. Fantastic. Harry speaking to our own robin Roberts about his healing process. This used to be mum's sitting room. We had to make the decision between the two of us, are we ready to go back into the house that we grew up in. I'm glad we have. It's like constant reminder, not that we forget. Think of her every day. Reporter: The special life he mentioned he neglected. Now been with Megan Markel of suits fame. Long enough that royal watchers are getting all excited about possibly marriage. They reportedly spent this past weekend in tore Ron tomorrow where she lives -- Toronto where she lives. And according to people she is the plus one for pippa Middleton's reception and Markel shut down her lifestyle blog. After three about yul years on this adventure time to say good-bye. No reason given. Maybe unseemly, to blog if you are intending to marry a prince. He is in a great place. In Toronto with Megan Markel, the relationship is going well. He seems emotionally sound. Reporter: Looking back the nearly 20 years to when Diana died there was an uncharacteristic, unprecedented reaction from the British public, to Diana's death. Scenes outside kensington palace, unbridled mourning for a woman very few new. Inside the Paris for Harry, denial and stoicism. My way of dealing with it was stick might head in the sand, refusing to think about my mum, because why would that help? It is only going to make you sad not going to bring her back. Shows you what an umter nightmare he has had. Also the bravery, the courage that he has got to go out and talk publicly about this. So that it helps other people understand their own mental health. He is now at the other side, happy, apparently excited to become a father sometime and using his cut to -- his clout. Could there be a better way to\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Prince Harry says he shut down his emotions after losing his mother",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/prince-harry-shut-emotions-losing-mother-46855573"
}