{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:22:55+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The \"Yes You're Racist\" Twitter account is asking internet users to expose those who participated in the violent demonstrations on behalf of online hate groups, leading to cases of mistaken identities.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Ftwitter-users-identify-charlottesville-protestors-49201769.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_davis3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Twitter users try to identify Charlottesville protestors\nWell, one thing that has been clear is the social media reaction to the attack. It has created the #endofhate. The top trend, so many people speaking out against hate and violence and some are even trying to use social media to shame some of those marchers. Linsey Davis has been tracking it all. Good morning. Reporter: Images of those protesters over the weekend have gone viral and a Twitter account called yes, you're racist is trying to serve what it calls justice by asking the internet to identify and expose those who participated in the violent demonstrations on behalf of online hate groups. The account quickly found and outed some of the attendees and took responsibility for one man losing his job and another had to call in to his local news station to defend himself. However, one professor was mistakenly identified as a man at the rally. Forcing the man to defend his location over the weekend. But there have also been some unifying tweets as well. Former president Barack Obama shared quotes from Nelson Mandela after the clashes in charlottesville saying that no one is born hating another person because of the color of their skin or his background or his religion. People must learn to hate and if they can learn to hate, they can be taught to love for love comes more naturally to the human heart than its opposite. Michael. All right, thank you, linsey and that is -- no truer words were ever spoken. To ginger now.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Twitter users try to identify Charlottesville protestors",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/twitter-users-identify-charlottesville-protestors-49201769"
}