{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:20+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2F60-migrants-refused-italy-malta-arrive-barcelona-56358761.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_1173d48e9ca34daab50f40ac5200f8a3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A rescue ship carrying 60 migrants arrived Wednesday in a Spanish port after being refused entry by Italy and Malta, the second time in a month that a humanitarian group has been forced to travel for days to unload people rescued in the central Mediterranean.\nThe Italian government is blocking private rescue boats that it blames for encouraging human traffickers to launch unseaworthy boats loaded with migrants toward Europe.\nBut the aid groups deny having any link to smugglers in Libya or elsewhere, and say they are being forced to leave unattended the busy migrant sea transit route where deaths are mounting.\nThe Open Arms rescue ship completed a four-day journey to Barcelona, in northeastern Spain, after it saved 60 people Saturday from a rubber boat floating in waters north of Libya.\nThe migrants come from 14 different countries and include five women, a 9-year-old boy and four older teenagers, some of them unaccompanied. The Spanish aid group Proactiva Open Arms said they were generally in good health but some may have fuel burns.\nThe migrants were going through health checks and identification procedures. Authorities granted them a 30-day permit to apply for residence or asylum in the European Union. Many have relatives in Germany, Belgium and France.\nAccording to the International Organization for Migration, more than 500 people have died trying to cross from Libya since the Aquarius, another charity rescue ship, was blocked from ports in Italy and Malta in early June. The 630 migrants were finally taken in by Spain and France.\nDoctors Without Borders blamed the deaths on the European Union's inaction.\n\"The EU is abdicating their responsibilities to save lives, blocking search and rescue and condemning people to be trapped in Libya,\" the group said in a tweet Wednesday. \"Any deaths caused by this are now at their hands.\"\nIn all, IOM says 1,405 people have died in the dangerous Mediterranean Sea crossing this year.\nThe Open Arms docking in Barcelona was followed closely by the Astral, a sister boat run by the same organization where four European Parliament lawmakers witnessed the rescue operation.\nLawmaker Javier Lopez of Spain said the rescue boat's arrival was a reason \"to celebrate life\" but deplored the mounting death toll in the Mediterranean.\nLopez said Europe should be able to manage the number of migrants arriving by sea this year— around 50,000 so far into Spain, Italy and Greece.\n\"Aren't we, 500 million Europeans, able to manage the arrival of 50,000 people?\" he said.\n——\nParra reported from Madrid.",
    "source_domain": "abcnews.go.com",
    "title": "60 migrants refused by Italy and Malta arrive in Barcelona",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/60-migrants-refused-italy-malta-arrive-barcelona-56358761"
}