{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 08:12:45+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "Subway blast arrest leads to discussion of immigration rules",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsubway-blast-arrest-leads-discussion-immigration-rules-51732721.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_e610dabd70d446a1a3d5b82ff44b1b8b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The arrest of a Bangladeshi immigrant accused of making a homemade pipe bomb and setting it off in the New York subway system has led to discussion of the nation's immigration system, with President Donald Trump repeating his refrain that it needs to be overhauled in favor of more restrictions.\nWhat you should know:\n———\nTHE BOMBING SUSPECT\nAuthorities have identified the bombing suspect as 27-year-old Akayed Ullah. Originally from Bangladesh, he arrived in the United States in 2011 and was living in Brooklyn. The Department of Homeland Security says he's a lawful permanent resident of the U.S.\n———\nHOW HE GOT HERE:\nUllah came to the U.S. on an F43 visa, issued to him through his family connection to an American citizen. The American immigration system allows citizens to apply for certain relatives — spouses, children, parents, siblings and their spouses and minor children — to be allowed to come and live in the U.S. The visas fall under different preferences, or categories; siblings of U.S. citizens come in the fourth preference, the F4, and their children come under F43s.\n———\nWHAT'S THE HISTORY?\nSince a law change in 1965 loosened what had been a very restrictive system, America's immigration policy has been based around giving preference to people with advanced education or skills or those with family ties to U.S. citizens. What that has meant is that as immigrants from places like Asia and Latin America started coming to the U.S. in larger numbers and became citizens, they applied for their family members to join them. Once naturalized, those brought in were able to then sponsor their own relatives.\n———\nWHAT'S THE CONCERN?\nThose who favor restrictions on immigration are in strong opposition to that kind of linked migration. It's an issue that's been brought up in proposed immigration reform legislation before. U.S. Sen. Tom Cotton, of Arkansas, and U.S. Sen. David Perdue, of Georgia, both Republicans, have most recently proposed the RAISE Act, which would limit the number of permanent-resident visas and do away with the ability of citizens to bring over relatives other than spouses and minor children. Immigrant advocates have called the bill an attack on immigrants.\n———\nWHAT TRUMP SAYS\nTrump has made who's allowed into the United States a centerpiece of his presidency, in the form of banning residents from certain countries from traveling to the U.S., calling for the construction of a wall along the Mexican border and limiting the number of refugees allowed in.\nAfter Monday morning's subway explosion, which seriously injured Ullah but no one else, Trump issued a statement saying, \"America must fix its lax immigration system, which allows far too many dangerous, inadequately vetted people to access our country. Today's terror suspect entered our country through extended-family chain migration, which is incompatible with national security.\"\nTrump, a Republican, has voiced his support of the RAISE Act.\n———\nDeepti Hajela covers issues of race, ethnicity and immigration for The Associated Press. Follow her on Twitter at http://www.twitter.com/dhajela. For more of her work, search for her name at https://apnews.com",
    "source_domain": "abcnews.go.com",
    "title": "Subway blast arrest leads to discussion of immigration rules",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/subway-blast-arrest-leads-discussion-immigration-rules-51732721"
}