{
    "authors": [
        "Abc News",
        "More Genevieve"
    ],
    "date_download": "2018-04-24 19:32:00+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Ella Chambers was greeted with hugs, chants and cheers.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fentire-student-body-welcomes-back-3rd-grade-special%2Fstory%3Fid%3D54661454.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/ella-chambers-01-jef-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When Ella Chambers returned to Hazel Grove Elementary School after competing in the Special Olympics, she was given a hero's welcome.\nEvery member of the student body and faculty was waiting for the third-grader outside, chanting her name, carrying signs and cheering her on.\n\"She was so stunned,\" Ella's mom, Renee Chambers, told \"Good Morning America.\"\nElla, her mom told \"GMA,\" is the only kid in her school with Down syndrome.\n\"All the kids love her,\" Chambers said. \"She's been there since kindergarten. Everyone was so excited to see her.\"\nThe school didn't share their plan with the Chambers family ahead of time. Ella's sister Audrey, who is a second-grader at Hazel Grove, was just as surprised.\nThe school's principal said she wanted to make Ella's homecoming feel special.\n\"We sent out an email asking each class to come out and celebrate Ella,\" Fran Blackburn, principal of Hazel Grove Elementary, told \"GMA.\" \"I had a teacher make a banner and every student in the school signed it.\"\nThe school, which has 250 students, has been like a home away from home for the Chambers family.\n\"It's everyone who is so great, the administration, the teachers, the parents and the kids,\" Chambers said.\n\"I tell my teachers I want two things from them, to love our students and to teach them,\" Blackburn told \"GMA.\" \"We celebrate every child at Hazel Grove Elementary. Ella is just one of our Hazel Grove Rams.\"",
    "source_domain": "abcnews.go.com",
    "title": "Entire student body welcomes back 3rd-grade Special Olympian in style",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Family/entire-student-body-welcomes-back-3rd-grade-special/story?id=54661454"
}