{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:18:54+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ftransgender-migrant-dies-us-custody-55537229.json",
    "image_url": "https://abcnews.go.com/International/wireStory/transgender-migrant-dies-us-custody-55537229",
    "language": "en",
    "localpath": null,
    "maintext": "Authorities are awaiting autopsy results to determine what caused the death of a transgender woman who was in the custody of U.S. Immigration and Customs Enforcement.\nFederal authorities say the 33-year-old woman from Honduras died early Friday at an Albuquerque hospital, where she was admitted after showing symptoms of pneumonia, dehydration and complications associated with HIV.\nThe woman was identified by activists as Roxana Hernandez. They say she was part of a caravan of Central American migrants that traveled to the U.S. border through Mexico.\nFederal authorities listed her name as Jeffry Hernandez and said she was taken into custody on May 13 in San Diego. She was later transferred to El Paso, Texas, and then to a detention center in western New Mexico where she was housed in the transgender unit.\nHernandez's death has reignited concerns about the treatment of transgender people in custody.\nThe California-based Transgender Law Center and other groups issued statements this week demanding that transgender people not be detained by immigration authorities.\n\"The community, now more than ever, needs to organize to protect our most vulnerable, in particular transgender immigrant women who are surrounded by violence on a daily basis,\" said Anandrea Molina, president of Organización Latina de Trans en Texas.\nOrganizers from Pueblo Sin Fronteras say Hernandez had first presented herself to U.S. border officers at the San Ysidro port of entry in California on May 9 and asked for asylum.\nThe group questioned whether Hernandez received adequate medical care while in federal custody.\nAccording to Immigration and Customs Enforcement, all detainees get medical, dental and mental health screening within 12 hours of arriving at a detention facility. Detainees also have access to 24-hour emergency care.\nHernandez is the sixth detainee to die in ICE custody since October 2017.\nAccording to immigration authorities, Hernandez was admitted May 17 to Cibola General Hospital in Grants, New Mexico. She was transferred later that day to the Albuquerque hospital, where she remained in the intensive care unit until she was pronounced dead. Hospital staff identified the preliminary cause of death as cardiac arrest.\nNew Mexico health and law enforcement agencies were notified about the death. The U.S. Department of Homeland Security's Office of Inspector General and ICE's Office of Professional Responsibility also were notified along with the Consulate of Honduras in Houston.\nImmigration authorities say that between 2005 and 2009, Hernandez twice illegally entered the United States and was granted voluntarily return to Mexico each time since she claimed Mexican nationality. In 2014, she illegally re-entered the U.S. a third time and was arrested and removed.\nAuthorities also say she was convicted of theft in 2006 and of prostitution and other charges in 2009. Both cases were in Texas.",
    "source_domain": "abcnews.go.com",
    "title": "Transgender migrant dies while in US custody",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/transgender-migrant-dies-us-custody-55537229"
}