{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:15:11+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "FSU, Virginia Tech make the ACC even more formidable",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ffsu-virginia-tech-make-acc-formidable%2Fstory%3Fid%3D44514343.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170101_Power_Rankings_Week_6_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It was mayhem this past week as 11 of the top 25 teams suffered a setback -- and seven of them went down to teams that weren't in the power rankings. Oregon cracked the top 25 with a healthy Dillon Brooks; the Ducks beat UCLA and crushed USC.\nA pair of ACC teams -- Florida State and Virginia Tech -- were the big movers. The Seminoles used a tremendous long-distance display from Dwayne Bacon to beat Virginia in Charlottesville, while the Hokies cruised past Duke (without Grayson Allen) in Blacksburg.\nNorth Carolina took a hit with its shocking loss to Georgia Tech. Indiana fell after a pair of setbacks (including one at home against Nebraska). South Carolina was the lone team to fall out after a loss at Memphis.\nWeek 1 | Week 2 | Week 3?| Week 4?| Week 5?| Week 6?\n1. Villanova Wildcats\nRecord: 14-0\nLast week's ranking: 1\nJay Wright's team got wins over DePaul and at Creighton to close out 2016 with 38 wins in the calendar year, which is the most since Kansas won 39 in 1997.\n2. Baylor Bears\nRecord: 13-0\nLast week's ranking: 3?\nThe Bears handed Oklahoma its worst loss in Norman in the Lon Kruger era with a 26-point shellacking. Johnathan Motley went for 19 points and 13 boards in the rout.\n3. UCLA Bruins\nRecord: 14-1\nLast week's ranking: 2?\nThe good news was that the Bruins got big man Thomas Welsh back and he scored 20 at Oregon. The bad is that Steve Alford's team lost to the Ducks on a last-second shot from Dillon Brooks.\n4. Kansas Jayhawks\nRecord: 12-1\nLast week's ranking: 4\nLanden Lucas had 15 points and a career-high 17 boards, but the Jayhawks struggled at TCU. It was largely due to the defense. Without Udoka Azubuike, there isn't much in terms of interior defense.\n5. Gonzaga Bulldogs\nRecord: 14-0\nLast week's ranking: 7?\nThe Zags remain undefeated following wins at Pepperdine and Pacific. Gonzaga trailed by 8 early in the second half against Pacific before going on a 25-4 run.\n6. Louisville Cardinals\nRecord: 12-2\nLast week's ranking: 6\nAfter a home loss to Virginia in which he scored just seven points and didn't defend as well as Rick Pitino wanted, Donovan Mitchell was benched to start the game against Indiana. He responded with a career-high 25 points in the win over the Hoosiers.\n7. Kentucky Wildcats\nRecord: 11-2\nLast week's ranking: 8?\nIsaiah Briscoe recorded the program's second triple-double (19 points, 11 assists, 10 rebounds) this season -- and just third in program history -- in an easy win at Ole Miss.\n8. Duke Blue Devils\nRecord 12-2\nLast week's ranking: 5?\nIn the first game without Allen, the Blue Devils lost in Blacksburg to Virginia Tech. Luke Kennard did his part with 34 points, but Duke's defense allowed Virginia Tech to shoot 55 percent from the field and 62 percent from 3.\n9. Florida State Seminoles\nRecord: 14-1\nLast week's ranking: 19?\nDwayne Bacon shot 28 percent from 3 a season ago and improving his perimeter shot was one of the reasons he didn't try and leave for the NBA after his freshman season. Bacon went for 29 points in a win over Virginia, was 6 of 9 from deep and hit the game-winner with two seconds left -- a 3-pointer.\n10. Creighton Bluejays\nRecord: 13-1\nLast week's ranking: 10\nCreighton lost at home to Villanova in the first Big East matchup of unbeatens since 1989. Creighton only made 6 of 24 shots from beyond the arc.\n11. Oregon Ducks\nRecord: 13-2b\nLast week's ranking: NR?\nThe loss against Baylor doesn't look so bad now, and the setback against Georgetown came in Dillon Brooks' first game back. Oregon beat previously undefeated UCLA and pounded USC this past week.\n12. West Virginia Mountaineers\nRecord: 12-1\nLast week's ranking: 16?\nBob Huggins' team blasted Oklahoma State in Stillwater, exacting a little revenge over his former assistant Brad Underwood, who beat him last year in the NCAA tournament when he was with Stephen F. Austin.\n13. Virginia Tech Hokies\nRecord: 12-1\nLast week's ranking: 23?\nThe Hokies snapped a nine-game losing streak in the series with a win over an Allen-less Duke team -- and it wasn't even close. Virginia Tech scored 89 points. That's the most the Blue Devils have allowed this season.\n14. Virginia Cavaliers\nRecord: 11-2\nLast week's ranking: 18?\nTony Bennett and the Cavs got a huge road win against Louisville, but then watched as Bacon went bananas and lost to Florida State in Charlottesville. The Seminoles were just the second team all season to out-rebound Virginia.\n15. North Carolina Tar Heels\nRecord 12-3\nLast week's ranking: 9?\nJustin Jackson couldn't miss from deep in the rout over Monmouth, going 6 of 9 from 3. But he was 0-for-5 in a shocking loss in Atlanta to a Georgia Tech team that is slated to finish at or near the bottom of the ACC.\n16. Wisconsin Badgers\nRecord: 12-2\nLast week's ranking: 11?\nNigel Hayes attempted 31 3-pointers in the first six games; he has taken just six over the past eight.\n17. Xavier Musketeers\nRecord: 12-2\nLast week's ranking: 14?\nEdmond Sumner's best effort of the season -- a 28-point, 8-rebound, 6-assist performance in a win at Georgetown -- was needed while Trevon Bluiett scoring just one point.\n18. Florida Gators\nRecord: 10-3\nLast week's ranking: 20?\nNorth Little Rock native KeVaughn Allen was booed in his return to Arkansas; he responded with 21 points in the 81-72 win.\n19. Butler Bulldogs\nRecord: 12-2\nLast week's ranking: 13?\nButler bounced back from a loss at St. John's with an easy win against Providence. Next is a date at Hinkle with No. 1 Villanova on Wednesday.\n20. Notre Dame Fighting Irish\nIrish Record: 12-2\nLast week's ranking: 17?\nSteve Vasturia's game-winning 3 with 2.5 seconds left gave the Irish a road win at Pittsburgh. It also gave Notre Dame its sixth consecutive overtime victory.\n21. Arizona Wildcats\nRecord: 13-2\nLast week's ranking: 24?\nSean Miller got point guard Parker Jackson-Cartwright back, and the Wildcats swept Cal and Stanford on the road.\n22. Saint Mary's Gaels\nRecord: 12-1\nLast week's ranking: 22\nRandy Bennett returned just about everyone from last year's team, but it was a pair of freshmen who were key in a win against San Diego: Aussie Tanner Krebs and California native Jordan Ford combined for 24 points in 23 minutes.\n23. Purdue Boilermakers\nRecord: 12-3\nLast week's ranking: 12?\nCaleb Swanigan had another 20-20 game, his third in the last four, but the Boilermakers lost at home to Minnesota.\n24. Indiana Hoosiers\nRecord: 10-4\nLast week's ranking: 15?\nThe wins over Kansas and UNC seem like an eternity ago after IU lost at home to Nebraska and was blown out by Louisville in Indianapolis this past week.\n25. USC Trojans\nRecord: 14-1\nLast week's ranking: 21?\nThe trio of Chimezie Metu, Shaqquan Aaron and Jordan McLaughlin were just 3-of-25 from the field in a blowout loss at Oregon, the Trojans' first setback of the season.\nDropped out: South Carolina",
    "source_domain": "abcnews.go.com",
    "title": "FSU, Virginia Tech make the ACC even more formidable",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/fsu-virginia-tech-make-acc-formidable/story?id=44514343"
}