{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:52:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "A high-school classmate of James T. Hodgkinson said he didn't seem radical, but that Hodgkinson did voice his political opinion often in the local newspapers.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Ffriend-alleged-virginia-shooter-inclination-hodgkinson-violent-48037278.json",
    "image_url": "http://a.abcnews.com/images/US/170614_abc_spec_hodgkinson_friend_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Friend of Virginia shooter had no inclination he was violent\nJoined by Kevin Cooper check who has known I'm James Hutchinson a fan of James options and for many years. Kevin thank you for joining us right now how long these you know mr. Auschwitz in. Well they're going back in 1966 we hear Hayward high school the dealer at. Belleville township high school least he was here at. Do you have any idea that he is capable of violence like this. No I don't coordination whatsoever. And hey hidden so he would never it never spoken about going to Washington DC carrying out a threat like this. Well I'll meet Georgia only judge QC EU. The last few years I saw a few letters from trump to the letters to the editor of the Belleville news Democrat. Expressed some opinions as some dissatisfaction. Did strike me at the time that I read all of it it was anything. Radical ability thing. That really out of the ordinary. Just somebody giving their opinion. Revenue was pretty energized politically Hong. Well let's be charming NAS states will be about do different things she's blocked recently. Social media persons shall. I honestly I can't comment on they had former. Personal standpoint it's a do you have any idea why he was in Virginia are now. If no idea whatsoever what what I was watching the news this morning and he mentioned his name actual my wife. I know that so much sit poets Virginia and they mentioned Bellevue resident bill but boy says. Some conscience it. So that's it bush. And well Kevin thank you thank you for joining us this morning thank you for that. In sight as we've been reporting all morning long the shooting this morning in Alexandria Virginia congressional baseball practice Republican. Baseball team practicing this morning shooter James T Hutchinson. Unloads on the field wounding at least five. One member of congress to use police and four others including two capitol police who brought the shooter down we have now learned. From president trump the James Hutchinson. Has indeed had died.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Friend of alleged Virginia shooter had no inclination Hodgkinson was violent Video",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/friend-alleged-virginia-shooter-inclination-hodgkinson-violent-48037278"
}