{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 01:49:45+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Roger Goodell talks national anthem, Ezekiel Elliott at Q&A session",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Froger-goodell-talks-national-anthem-ezekiel-elliott-qa%2Fstory%3Fid%3D49218481.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0814/dm_170814_NBA_SC_Haynes_on_Warriors1434/dm_170814_NBA_SC_Haynes_on_Warriors1434_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "GLENDALE, Ariz. -- While NFL commissioner Roger Goodell considers the national anthem a \"special moment\" and a \"point of pride,\" he wants to respect the rights of players across the league to sit during the anthem as a form of protest.\nGoodell voiced his feelings during a question-and-answer session for Arizona Cardinals?season-ticket holders before training camp Monday. A question was posed to Goodell about whether anthem protests this season were \"going to be another problem.\"\nOn Saturday, Oakland Raiders running back Marshawn Lynch sat on a cooler during the national anthem before a preseason game against the Cardinals, and Seattle Seahawks defensive end Michael Bennett sat for the anthem before his game at the Los Angeles Chargers on Sunday.\n\"It's one of those things where we have to understand that there are people who have different viewpoints,\" Goodell said. \"It's something that I think everybody wants. The national anthem is a special moment for me. It's a point of pride. That is a really important moment but we also have to understand the other side -- that people do have rights, and we want to respect those.\"\nGoodell said he had a similar discussion during a New York Jets?fan forum a couple weeks ago. A player, whom Goodell did not name, was asked about the ongoing silent protest, Goodell said. The player, according to Goodell, said there was \"a time and a place\" to engage in protest.\nThat, Goodell said Monday, is one of the key components for players to recognize.\n\"That's what we all have to, sort of, understand -- the responsibility of doing it at the right time and in the right way,\" Goodell said.\n\"Protest to progress is what I call it. We all have to recognize that people want to see change. Let's go out and try to make that happen in a peaceful and an important way.\"\nGoodell touched on other topics, as well.",
    "source_domain": "abcnews.go.com",
    "title": "Roger Goodell talks national anthem, Ezekiel Elliott at Q&A session",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/roger-goodell-talks-national-anthem-ezekiel-elliott-qa/story?id=49218481"
}