{
    "authors": [
        "Abc News",
        "Kristen Mcfann",
        "More Emily"
    ],
    "date_download": "2017-01-02 22:08:58+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Dylann Roof Faces Sentencing in Federal Death Penalty Case",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdylann-roof-faces-sentencing-federal-death-penalty-case%2Fstory%3Fid%3D44510754.json",
    "image_url": "http://a.abcnews.com/images/US/rtr-dylann-roof-jc-161125_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dylann Roof's fate will soon be back in the hands of the jurors who found him guilty of killing nine black parishioners at a church in Charleston, South Carolina.\nThe sentencing phase of Roof's federal trial, in which he could face the death penalty, is set to begin Tuesday.\nRoof, 22, has said he intends to represent himself for the sentencing phase of the trial, although U.S. District Judge Richard Gergel has said he does not support Roof's decision. Roof told Gergel last week he will make an opening statement but said he has \"no plans whatsoever to call witnesses\" during the sentencing phase.\nThe government plans to call more than 30 witnesses, mostly survivors and victims' family members, to testify in the sentencing phase. Survivors Polly Sheppard and Felicia Sanders, who testified during the guilt phase of the trial, are expected to testify again.\nDuring the sentencing phase Roof cannot approach the jury, the witness stand or the bench, Gergel wrote in an order today. Roof's standby counsel will sit in the first two seats at the defendant's counsel table closest to the center aisle and Roof will sit in the third seat, Gergel ordered.\nRoof appeared in court today at a sealed competency hearing, wearing a prison jumpsuit with his hands and feet shackled. The hearing was sealed, Gergel said, because of the risk of jurors’ being exposed to new information through the press or social media. Gergel said he would release information from Monday's hearing in 10 days, after Roof is sentenced.\n\"This is an incredibly sensitive moment in this trial,\" Gergel said.\nRoof, who is white, was convicted last month of shooting and killing nine parishioners at the predominantly black Emanuel AME Church on June 17, 2015. The 33 federal counts against Roof included hate crimes resulting in death and obstruction of exercise of religion resulting in death.\nRoof entered the church armed and \"with the intent of killing African-Americans engaged in the exercise of their religious beliefs,\" according to the federal indictment against him. The parishioners welcomed Roof into their Bible study group, according to the indictment, after which Roof drew his pistol and opened fire.\nIn a video interview of Roof played in court, Roof laughed as he admitted to the shooting. He also said he used a Glock 45 to do it, according to the video. \"I didn't say anything to them before I pulled it out, not even one word,\" Roof said of the gun in the video. \"I mean they reacted after I shot them.\"\nIn the defense's opening statements during the guilt phase of the trial, attorney David Bruck told the court, \"He did it ... You're probably wondering, so what we are doing here? Why does there need to be a trial? ... The practical reason is that the government has asked for the death penalty after conviction, and because of that, we have a procedure to go through.”\n\"Our society does not order the death penalty if there are reasons to choose life,\" Bruck added. \"You're going to want to understand who this person was and why on earth he would want to cause so much grief.\"\nRoof also faces a state trial, set for early next year, in which he may again face the death penalty.",
    "source_domain": "abcnews.go.com",
    "title": "Dylann Roof Faces Sentencing in Federal Death Penalty Case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/dylann-roof-faces-sentencing-federal-death-penalty-case/story?id=44510754"
}