{
    "authors": [
        "Abc News",
        "More Elizabeth"
    ],
    "date_download": "2018-04-24 22:35:38+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Michael Riordan said a doctor told him, \"We tried everything we could.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fhusband-woman-killed-southwest-flight-immediately-thought-kids%2Fstory%3Fid%3D54701767.json",
    "image_url": "https://s.abcnews.com/images/US/michael-riordan-abc-jef-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Michael Riordan met his wife Jennifer in a shopping mall 29 years ago. He was 17 years old. She was just 15.\nInterested in Airlines? Add Airlines as an interest to stay up to date on the latest Airlines news, video, and analysis from ABC News. Add Interest\nLast week, Michael's world changed when he learned Jennifer had been killed on Southwest Flight 1380 after an engine failed 32,000 feet above the ground on April 17.\nJennifer, a 43-year-old bank executive and mother of two, was partially sucked out of the plane's window, despite wearing her seat belt. Her fellow passengers were able to pull her back inside of the aircraft but were not able to save her.\nJennifer became the first person to die in an accident on a U.S. airline in nearly 10 years.\nMichael sat down with ABC News in his hometown of Albuquerque, New Mexico, to share how he learned about Jennifer's death and how he broke the news to their young children.\nIt began with a phone call from the chaplain at the Philadelphia hospital where Jennifer's body was taken after the flight made an emergency landing.\nJoe Marcus/Twitter\n\"The chaplain at the hospital called and said, 'We need to speak with Mike Riordan who is married to Jennifer. Are you married to Jennifer Riordan?'\" Michael said. \"I said, 'Yes, but she wasn't going through Philadelphia. She was planning on going to Chicago so I don't think you --' just absolute denial. I'm still in denial.\"\nThe chaplain told Michael he was going to have the doctor call him. Before the doctor got through, however, Michael was able to search for news online that could have affected Jennifer.\n\"I saw one passenger brought to the hospital, like, 'OK, but the whole plane didn't crash,'\" he said, adding, \"I was like, 'She can't be injured that bad she's just in a hospital, but I can get out there and I can hold her hand and love on her.'\"\nAP\nTwo minutes later, Michael said, the doctor called and told him they were sorry and had tried everything they could to save his wife but she didn't make it.\n\"I immediately thought of the kids and how do you tell your kids their mom was gone,\" Michael said, referring to the couple's young son and daughter. Jennifer had planned to meet the family at their son's baseball game that Tuesday night after her flight from New York.\nInstead, Michael drove to his children's school, where he brought them into a chapel to share the news.\n\"I just held their little hands and took a knee and said, 'Mommy's not going to come home guys,'\" he said.\nOn Sunday, hundreds of people turned out to mourn Jennifer's passing. Michael said it was the first time he had felt peace since her death, being in the presence of those who loved her and were touched by her life.\nMichael told ABC News he has avoided listening to news reports about the incident and Southwest's response, choosing for now to only concentrate on his children.\nObtained by ABC\nSouthwest Airlines Chief Executive Officer Gary Kelly expressed gratitude that no one else was seriously injured, but described the passenger's death as a \"tragic loss.\"\n\"This is a sad day, and our hearts go out to the family and loved ones of the deceased customer,\" Kelly said during a press conference April 17.\nKelly said he was not aware of any issues with the Boeing 737, which was last inspected on Sunday. No issues with the plane or engine were reported at that time, he said, calling the Boeing 737 the \"workhorse of the airline industry.\"\nIn a statement, Boeing expressed its \"deepest condolences\" to the victim's family.\nNTSB investigators will continue the investigation in Washington, D.C., where in 12 to 15 months they are expected to announce a probable cause and more safety recommendations.\nMeanwhile, airlines are under an order to quickly inspect engines like the one that failed on Flight 1380.\nABC News' Martha Raddatz’s conversation with Michael Riordan will air on an upcoming episode of ABC News’ “20/20.”",
    "source_domain": "abcnews.go.com",
    "title": "Husband of woman killed on Southwest flight: 'I immediately thought of the kids'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/husband-woman-killed-southwest-flight-immediately-thought-kids/story?id=54701767"
}