{
    "authors": [
        "Abc News",
        "More Angela"
    ],
    "date_download": "2017-06-14 19:24:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Kyle MacLachlan on the return of 'Twin Peaks'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fkyle-maclachlan-twin-peaks-reboot-ready-jump-completely%2Fstory%3Fid%3D47984214.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/ht-kyle-er-170609_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It’s a joyous TV viewing season for “Twin Peaks” fans.\nThe series has returned after a 25-year break and Kyle MacLachan is back as Agent Dale Cooper. MacLachlan told ABC News he had no hesitations about taking on the role again.\n“Oh my gosh, was I excited. I was ready to jump in completely,” MacLachlan said in a recent appearance on “Popcorn With Peter Travers.\"\nMacLachlan said he got a call from “Twin Peaks” director David Lynch and \"he wanted to know if I was on board. And I said, ‘David, I never left.’ I said I wanted to go back and play Cooper since the last frame of the last episode of the first time around.”\nWHAT TO KNOW Kyle MacLachlan appears on Popcorn With Peter Travers\nTravers asked MacLachlan if it was tough getting back into character after the long break.\nDownload the all new \"Popcorn With Peter Travers\" podcasts on Apple Podcasts, Spotify, Google Play Music and Stitcher.\n“We were all different. The world is different now,” MacLachlan, 58, responded. “I tell you what was not that different. It was walking on the set that first day and seeing David [Lynch] sitting in the director’s chair. And walking up to him in the black suit and seeing his face, shaking his hand, and looking around and saying, 'We’re going back.' In that instant I was right back in Cooper. I was right back in 'Twin Peaks.' And that relationship with David was like we never stopped.\"\nMaryellen McGrath/ABC News\nMacLachlan added that he appreciates the buzz surrounding the return of the show.\n“Certainly the drum beat has been very strong on Twitter, on Instagram, talking about what’s coming. It’s been a lot of fun watching all the activity,” he said.\nBe sure to watch the full interview with Peter Travers and Kyle MacLachlan in the video above.",
    "source_domain": "abcnews.go.com",
    "title": "Kyle MacLachlan on 'Twin Peaks' reboot: 'I was ready to jump in completely'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/kyle-maclachlan-twin-peaks-reboot-ready-jump-completely/story?id=47984214"
}