{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 01:46:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Venezuela's Maduro seeks to expand armed civilian militias",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fvenezuelas-maduro-seeks-expand-armed-civilian-militias-46850100.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_6e30af1ec4c642f691b19384fabe7e52_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Embattled Venezuelan President Nicolas Maduro announced plans Monday to expand the number of civilians involved in armed militias as tensions in the crisis-wracked South American nation continued to rise.\nMaduro said he hopes to expand the number of civilians involved in the Bolivarian militias created by the late Hugo Chavez to 500,000, up from the current 100,000, and provide each member with a gun.\nSpeaking to thousands of militia members dressed in beige uniforms gathered in front of the presidential palace to mark the force's seventh anniversary, Maduro said it is time for Venezuelans to decide if they are \"with the homeland\" or against it.\n\"Now is not the time to hesitate,\" he said.\nThe announcement comes as Maduro's opponents are gearing up for what they pledge will be the largest rally yet to press for elections and a host of other demands Wednesday.\nThousands of Venezuelans have taken to the streets since the Supreme Court stripped the National Assembly of its last vestiges of power nearly three weeks ago, a decision it later reversed. At least five people have been killed, dozens hurt and more than 100 detained in the demonstrations.\nThe Maduro government has vowed to hold a counter mass gathering Wednesday in defense of the socialist movement started by Chavez.\nChavez created the civilian militias with the goal of training 1 million Venezuelans to assist the armed forces in the defense of his revolution from external and domestic attacks. Maduro told the militia Monday that vision remains relevant as Venezuela continues to face \"imperialist aggression.\"\n\"A gun for every militiaman!\" he cried.\nMaduro's government claims foreign-backed opposition leaders are fomenting violence in an attempt to remove him from power. The opposition denies that assertion, saying it is Maduro himself who is responsible for Venezuela's woes, including triple-digit inflation, rising crime and food shortages.\nThey also blame Maduro for ordering security forces to use tear gas against protesters and failing to stop pro-government armed groups from attacking demonstrators.\nFormer congresswoman Maria Corina Machado posted a photo of the militia gathering Monday on her Twitter account, calling it a, \"pathetic, desperate and unconstitutional attempt by the regimen to intimidate Venezuelans.\"",
    "source_domain": "abcnews.go.com",
    "title": "Venezuela's Maduro seeks to expand armed civilian militias",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/venezuelas-maduro-seeks-expand-armed-civilian-militias-46850100"
}