{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 20:36:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Winners to be announced in annual Michigan art competition",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fwinners-announced-annual-michigan-art-competition-50332444.json",
    "image_url": "http://abcnews.go.com/Entertainment/wireStory/winners-announced-annual-michigan-art-competition-50332444",
    "language": "en",
    "localpath": null,
    "maintext": "The winners of this year's international ArtPrize competition are being announced during an event in western Michigan that's known for openness — and increasingly, this year, politics.\nIn all, $500,000 in cash prizes will be awarded as part of ArtPrize Nine — including $200,000 for the public favorite and $200,000 for a winner picked by an expert jury. An awards event takes place Friday night in Grand Rapids before ArtPrize wraps up on Sunday. The first round of voting narrowed entries down to 20 chosen by the public and 20 by the jury. The second round of voting ran through this week. The work of more than 1,300 artists has been on display since last month at more than 170 venues.\nNine years in, the open, experimental mission remains firm for the show that draws hundreds of thousands of attendees annually. It comes directly from founder Rick DeVos, grandson of multibillionaire Rich DeVos, a co-founder of direct-sales giant Amway Corp., an ArtPrize sponsor, and son of U.S. Education Secretary Betsy DeVos. Her critics say she's hostile to public education and indifferent to civil rights, citing her push for school choice and her decision to end the Obama administration's rules for investigating allegations of on-campus sexual violence. School choice programs include charter schools, which are publicly funded but usually independently operated, and vouchers that help families cover tuition at private schools.\nA spokeswoman said Rick DeVos wasn't available to comment. He told The Associated Press in 2011 that organizers \"want to make sure everyone knows that ArtPrize can host really any type of expression.\"\nThe show has works critical of Betsy DeVos and the Trump administration, including \"For-profit Education\" by Sarah Ellis, a Grand Rapids high school teacher. She says in an artist's statement that her video and installation-based piece reflects her concern over policies that harm \"free and quality education for all.\" Her video shows a hammer striking plaster casts of the ancient Greek philosopher Plato, who is quoted in the work saying, \"Education is teaching our children to desire the right things.\"\nDetroit artist Eric Millikin's \"Made of Money\" consists of dollar bills cut up and fashioned into portraits of \"great people,\" such as Nikola Tesla, Hedy Lamarr, Joe Louis and Edgar Allan Poe, who \"died penniless.\" Millikin said his work is designed to remind \"that our best people aren't always rewarded with wealth, and that our wealthiest people aren't always our best.\"\nMillikin said he has long known about the DeVos family through their wealth and political connections. He recalls in particular Betsy DeVos' husband, Dick DeVos, a former Amway president who unsuccessfully ran for Michigan governor in 2006. The DeVos family's support of ArtPrize kept Millikin away for the first eight years, but he saw the election of Trump and Betsy DeVos' cabinet appointment as a way \"to make a statement.\"\n\"That made it a better place (to exhibit) because I'm addressing a national figure,\" he told the AP. \"It's equivalent to someone ... speaking up at the town hall.\"\nArtPrize Exhibitions Director Kevin Buist said political statements — including those against the DeVos family — have been part of the competition since the beginning. In 2009, Anna Campbell exhibited \" The Seeding Trilogy,\" which featured drink coasters with messages calling out efforts by members of the DeVos family to fight same-sex marriage.\nBuist said an increase in political pieces — and an increasing spotlight on them — is no surprise, given the current climate.\n\"Some (artists) are angry and they have a right to be angry,\" he said. \"They're using ArtPrize as a vehicle to express that and to work through really complicated and tricky issues.\n\"Of course, some of that is going to be directed toward the current administration, and some of our funders,\" he added. \"That's fine. I'd be worried if that weren't happening.\"",
    "source_domain": "abcnews.go.com",
    "title": "Winners to be announced in annual Michigan art competition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/winners-announced-annual-michigan-art-competition-50332444"
}