{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:52:16+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "A 7-year-old in Rockwall, Texas, has started a nonprofit called Mac and Cheese and Pancakes to collect foods popular among kids for his community pantry.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fyear-collects-7000-kid-food-items-community-pantry%2Fstory%3Fid%3D45494526.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/ht-pantry-kid-hb-170214_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kaden Newton's great, big idea came after he donated items to a community food bank and realized the pantry didn't have any of his favorite foods.\n\"They didn't have like, Chef Boyardee or pancake mix,\" he recently told ABC affiliate WFAA in Dallas..\nThis went on for several years: Kaden and his family taking trips to the Helping Hands food pantry in their hometown of Rockwall, Texas, and him growing increasingly concerned about the scarcity of foods that he and many other kids most enjoy.\nSo last week, with his parents' help, Kaden, 7, started his own nonprofit, Mac and Cheese and Pancakes -- named for his two favorite things to eat -- to collect donations of foods like pasta, soups, snack bars and crackers.\nYou know, typical things kids like.\n10-Year-Old Sells Baseball Cards to Raise Money for Friends With Cancer\nFifth-Graders Go 'All In' Raising Funds for Accessible Playground for Kindergartener\nHe asked for help from friends and family via social media and even created a wish list on Amazon to make donating easy.\nIn a little more than 10 days, the Newtons' home has gotten crammed with truckloads of comfort foods donated for children in need.\nKaden's organization has already received more than 7,000 items ready to go to the Helping Hands pantry, and the deliveries keep coming.\n\"It's cool that we have this much food here ... We have Goldfish, juice, granola bars, soup,\" Kaden said. \"Pasta, definitely mac-and-cheese.\"\nHe said his mom, Diana Newton, had set a goal of 100 food items to donate to the pantry, though his was higher.\n\"We never expected to get this kind of response,\" Diana Newton said. \"To get this kind of response is absolutely amazing.\"",
    "source_domain": "abcnews.go.com",
    "title": "7-year-old collects over 7,000 kid-food items for community pantry",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/year-collects-7000-kid-food-items-community-pantry/story?id=45494526"
}