{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 22:23:14+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Officials says the victims were exposed to Norvichok, the same nerve agent that contaminated ex-Russian spy Sergei Skripal and Yulia Skripal.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Fvideo%2Fscotland-yard-confirms-people-exposed-nerve-agent-amesbury-56370772.json",
    "image_url": "https://s.abcnews.com/images/International/180704_vod_orig_scotland_yard_nerve_agent_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Scotland Yard confirms 2 people were exposed to a nerve agent in Amesbury\nThis evening I proceed test results important that the check to people have been exposed to the nerve agents overkill. At approximately 10:15 AM on sept favorite that if you this after west ambulance service was going to residential addresses things. 44 year old woman had collapsed she was subsequently technicals. At a ram three two he had met the ambulance that was useful facts about segment press reports and you know peddles simple. The man was taken to hospital and we'll keep placement that full. From initial assessment it was cool that two patients to little avail after using drugs. We could have affected. However oh Monday the second of July due to concerns that the symptoms but the man and the woman would display. Samples from both nations was sent to hold them or analysis. Following the detailed analysis of those samples we can have the man and woman have been exposed to in the thank you novatel. Which has been identified as the save vacant contaminated that you and say guys. The latest update we have from the hospital as both patients remained in critical condition. I felt British national and a late into the head. Offices is still working to identify them next to it. That stage of this whole. At this stage no one else has presented with the same symptoms linked to the since.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Scotland Yard confirms 2 people were exposed to a nerve agent in Amesbury",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/video/scotland-yard-confirms-people-exposed-nerve-agent-amesbury-56370772"
}