{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:34:50+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Security is being ramped up after ISIS calls for attacks against soft targets during the holiday season.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fyork-city-heightened-alert-isis-inspired-attack-51727813.json",
    "image_url": "http://a.abcnews.com/images/WNT/171211_wn_davis1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for New York City on heightened alert after ISIS-inspired attack\nThis comes as millions visit New York City for the Christmas season, and why the suspect targeted times square. Tonight, authorities have taken note of what was recently said in ISIS propaganda. And the question tonight, how do you keep areas like times square and the subway safe? Here's ABC's linsey Davis. Reporter: Tonight, security across New York ramped up in the wake of today's attack. The city is already on heightened alert heading into the holidays. Law enforcement sources tell ABC news Ullah did not say specifically why he chose times square but indicated to authorities he had consumed ISIS and Al Qaeda propaganda, which mentioned times skwarp as a possible venue for attack. ISIS releasing this chilling image just a few weeks ago. A picture of Santa standing next to a box of dynamite in times square, and a threat. \"We meet at Christmas in new York soon.\" The police commissioner recently told David this is their new reality. Are you fearful of more isis-inspired attacks here in your city? This is part of our job. You know, it used to be it was about traditional crime. Now, it's about fighting terrorism. This is what we do every day. Reporter: Just weeks ago, eight people died in this truck attack in lower Manhattan when the driver plowed down a bike path. And late last year, more than two dozen were injured in the city's Chelsea neighborhood after a pressure cooker packed with shrapnel detonated. Linzsey Davis with us live tonight. She's in the heart of times square. We can see the police presence there behind you. Late word today about that suspect is now saying to authorities about ISIS and about the Middle East? Reporter: Yes, David. Authorities say that he told them he did it for ISIS. They say that he also mentioned the plight of muslims over the years and historical grievances. But they say he did not mention the current controversy involving Jerusalem. David? All right, linsey, thank you. We've learned this could have been far worse, obviously, as we reported, the suspect claims to have worked by himself. Let's get right to our senior justice correspondent Pierre Thomas tonight. He's live at the FBI. And Pierre, tonight, you're learning that sources say the suspect wanted to inflict significant harm, but was unable to, because this device went off early? Reporter: David, according to a law enforcement source, the bomb did not function as intended. There were names and other parts stuffed into the pipe and it had the ability to cause more injuries than it did. The pipe did not fully shatter. A six-inch piece was discovered fully intact. The source was blunt, saying, this could have been worse, David. All right, Pierre Thomas with us live.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "New York City on heightened alert after ISIS-inspired attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/york-city-heightened-alert-isis-inspired-attack-51727813"
}