{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 01:50:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Goodell: Have to understand other side in anthem protests",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fgoodell-understand-side-anthem-protests-49217733.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_ad7f31eb6be04421817ed2372815aa34_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Asked about players who did not stand for the national anthem before preseason games, NFL Commissioner Roger Goodell said Monday that while the playing of the anthem is a special moment to him, \"we also have to understand the other side.\"\nGoodell made the comments at University of Phoenix Stadium during a 45-minute question-and-answer period with Arizona Cardinals club seat holders. One season ticket-holder, Bruce Olson, asked the commissioner whether players were going to continue to protest during the anthem and if anything could be done about it.\n\"It's one of those things where I think we have to understand that there are people that have different viewpoints,\" Goodell said. \"The national anthem is a special moment to me. It's a point of pride. But we also have to understand the other side, that people do have rights and we want to respect those.\"\nSeattle Seahawks defensive end Michael Bennett sat on the visiting bench during the anthem before the preseason opener against the Los Angeles Chargers on Sunday, a decision he made before weekend protests by white supremacists in Charlottesville, Virginia. Bennett has said that the aim of his protest is to make people uncomfortable. In the process, he hopes to spur greater communication, understanding and involvement across racial, gender and socio-economic lines.\nOakland Raiders running back Marshawn Lynch sat on a cooler during the anthem Saturday night on the field at University of Phoenix Stadium. Los Angeles Rams defensive end Robert Quinn raised a first before his team's game.\nThe fact that former San Francisco 49ers quarterback Colin Kaepernick is still looking for a team to play for after his kneel-down protests last season is also still a hot topic.\nGoodell, without mentioning any of the players, said other players are taking the platform they have into local communities to create dialogue toward positive change.\n\"Protest to progress is what I call it, and we all have to recognize that if we want to see change, let's go out and try to make that change happen in a peaceful and important way,\" Goodell said.\nOlson, who described himself as a season-ticket holder \"since Day 1,\" said the commissioner \"beat around the bush\" on the issue. He said he'd like Goodell to take a tougher stance.\n\"The thing is, all he (Lynch) has to do is stand up for two minutes and he can still have whatever beliefs he wants. Go with what looks good for the game and to the people,\" Olson said. \"He (Goodell) makes rules and, 'You do this, you do that,' why can't he just say 'You stand up. You can believe what you want or do what you want. Just stand up like a man.'\"\nGoodell also addressed other issues:\n— On starting the season with a major star suspended, as is the case with Cowboys running back Ezekiel Elliott, who is out for six games after the league investigated accusations of domestic violence against him: \"You never like to see that happen. That's not something good. Those things are dictated by circumstances. We do everything we can to make sure we're enforcing our policies and holding the standards to the highest level. That's an unfortunate part of that, but that's what you do.\"\n— On the rule change that will allow players more freedom to celebrate big plays: \"They (players) were a driving force behind our changes in the celebration rule. They've been very impactful in the way we think about different aspects of our game and our experience in what we need to do.\"\n— On concussions, when a fan asked him about safety for his 10-year-old son: \"The most important thing is to get the right facts, and we've put all our facts out there. We want a greater awareness. . The reality is nowadays we're so much smarter about the brain and injuries, and we have so much further to go.\"\n———\nMore AP NFL: www.pro32.ap.org and www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Goodell: Have to understand other side in anthem protests",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/goodell-understand-side-anthem-protests-49217733"
}