{
    "authors": [
        "Abc News",
        "More Carolyn"
    ],
    "date_download": "2017-04-18 12:21:14+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Prince William spoke with pop superstar Lady Gaga about tackling and removing the stigma around mental health issues in a conversation that was livestreamed on Facebook.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fprince-william-speaks-lady-gaga-facebook-video-tackling%2Fstory%3Fid%3D46856621.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/HT-Lady-GaGa-prince-william-ml-170418_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Just a day after Prince Harry revealed personal details about how he struggled with his mother's death, his brother Prince William and Lady Gaga released a video on Facebook calling for an open conversation about dealing with emotional trauma.\nThe video was streamed live on Facebook with the pop star and Prince William encouraging young people to feel safe confronting their challenges and expressing themselves when they feel overwhelmed.\nPrince William and Lady Gaga said that it was vital to work together so they could help shatter the taboo surrounding mental illness.\n\"It’s okay to have this conversation, it's really important to have this conversation, you won't be judged – it's so important to break open that fear and taboo which is only going to lead to more problems down the line,\" Prince William said in the video.\n\"Yes, it can make a huge difference,\" Lady Gaga agreed. \"I feel like we are not hiding anymore we're starting to talk and that's what we need to do.\"\nThe two spoke over FaceTime from their respective homes in London and Malibu. William sat in his study at Kensington Palace while Lady Gaga joined from her kitchen in California.\nThanks to Prince William & @heads_together for inviting me to join this important conversation around mental health awareness #oktosay pic.twitter.com/w4RYmw7Llj — xoxo, Joanne (@ladygaga) April 18, 2017\nLady Gaga opened up in the candid conversation with Prince William about her fears when she had to address her own mental illness. \"It made me very nervous at first. For me waking up every day and feeling sad and going on stage is something that is very hard to describe. There's a lot of shame attached to mental illness.\n\"You feel like something is wrong with you,\" she told Prince William. \"But it was like saying this is a part of me and that's OK.\"\nPrince William, his wife Catherine the Duchess of Cambridge and Prince Harry have all participated in an effort to make it easier for young people to speak about their mental health concerns through their Heads Together campaign.\nThe Duke of Cambridge and @LadyGaga join forces to encourage more people to speak openly about their mental health #OKtosay pic.twitter.com/kCuQyS3Svn — Kensington Palace (@KensingtonRoyal) April 18, 2017\nLady Gaga brings her own experience working as a mental health advocate.\nLast December, she penned an open letter through her Born this Way foundation that she suffers from post-traumatic stress disorder (PTSD) as a result of a rape at age 19. Prince William was struck by her message and reached out to the pop star to see if she would get involved in their efforts.\n\"We have to make the strongest, most relentless attempt we can to normalize mental health issues, so that people feel like they can come forward,\" Lady Gaga said in the video, which released on the Royal Family's Facebook page.\nThe multi-platinum recording artist revealed how difficult yet therapeutic it was when she finally addressed her own challenges with PTSD.\n\"Even though it was hard it was the best thing that could come out of my mental illness was to share it with other people and let you know our generation as well as other generations know that if you are feeling not well in your mind that you are not alone and that people that you would think would never have a problem do,\" she said.\nIn addition to the Facebook discussion with Lady Gaga, Prince William and Prince Harry also participated in an interview with Calmzine magazine in which Prince William called for a society where children and adults felt free to discuss their feelings and not bottle things up.\n\"If you don’t acknowledge how you feel it will only bottle up, and could reassert itself later as illness,\" Prince William told the magazine.\nPublished by the charity CALM, Calmzine hopes to tackle issues surrounding men's mental health. CALM, an acronym whose letters stand for \"Campaign against living miserably,\" is a charity partner in Prince William's Heads Together campaign and focuses on preventing suicide in young men.\n\"Sometimes, emotions have to be put to one side to get the job done, but if you have been through an especially traumatic or stressful situation it is essential to talk it through after the event,\" Prince William said.\n\"Catherine and I are clear that we want both George and Charlotte to grow up feeling able to talk about their emotions and feelings,\" Prince William told Calmzine. Prince Harry also told the magazine, \"We will all go through tough times in our lives, but men especially feel the need to pretend that everything is OK, and that admitting this to their friends will make them appear weak.\"\n\"There may be a time and a place for the 'stiff upper lip,' but not at the expense of your health,\" Prince William said, urging readers to end the taboo about discussing traumatic personal issues.\nPrince William and Harry's magazine interview coincided with the release of Prince Harry's personal account of how he struggled to cope with his mothers death in a podcast with Bryony Gordon from the Telegraph.\nThe fifth in line admitted he sought counseling to help him deal with his own grief.",
    "source_domain": "abcnews.go.com",
    "title": "Prince William speaks with Lady Gaga in Facebook video about tackling mental health issues",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/prince-william-speaks-lady-gaga-facebook-video-tackling/story?id=46856621"
}