{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:16+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The explosion was the fourth incident this month in Austin.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fsuspect-austin-explosions-serial-bomber-authorities-53852824.json",
    "image_url": "https://s.abcnews.com/images/US/180319_nwo_austin_bombing_presser11am_MIX_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Suspect in Austin explosions a 'serial bomber,' authorities say\nAnother bomb rocking the city of Austin, Texas. Without a closure seen. The fourth explosion in less than twenty days. I don't understand why this this happening this entire neighborhood on lockdown federal agents and police sweeping the area. This neighborhood is still. I'm being locked down right now for safety are doing as an over abundance of caution so that we can keep this neighborhood say what we process the scene authorities responding to a blast potentially caused by a trip wire injuring two men in their twenties. That's the real situation now it's not. You know don't touch any packages it's like. Now season. The latest blast comes seventeen days after the first reported explosion just a few miles away. Police have now followed up on more than 700 phone calls about suspicious packages in the Austin area. We're pushing the message out that we need every tip every piece of information. However inconsequential you may think it is that may be the one piece of evidence that we need. Authorities are now investigating of last night's attack. But the response to this press briefing. That there's been an increase in the reward the blast triggered just six and a half hours after the Austin police department offered 1151000. Dollars. For any tip leading to the arrest of a suspect police worry these bombings are meant to send a message. Investigators say the bombs are made with nails and other metal pieces as shrapnel and the fact that the bomber was able to move the packages without detonating them. Shows a suspect is highly skilled. Now authorities worry they could have it well trained at serial bomber on there hands accurately ABC news New York.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Suspect in Austin explosions a 'serial bomber,' authorities say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/suspect-austin-explosions-serial-bomber-authorities-53852824"
}