{
    "authors": [
        "Abc News",
        "More Daniel"
    ],
    "date_download": "2018-02-03 12:21:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Another storm will deliver snow from the Midwest to the Northeast interior.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fbitter-cold-blasting-upper-midwest-northeast%2Fstory%3Fid%3D52814244.json",
    "image_url": "http://a.abcnews.com/images/US/weather-main_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Much of the Upper Midwest and Eastern U.S. is in the midst of a February cold blast. Wind chills this morning along the I-95 corridor from Washington, D.C., to Boston are in the low teens and single digits. The wind chills are below zero in interior New England.\nInterested in Weather? Add Weather as an interest to stay up to date on the latest Weather news, video, and analysis from ABC News. Add Interest\nABC News\nSingle-digit wind chills are expected Saturday morning for much of the Midwest, including Chicago, Columbus and Detroit. Chilly winds will be felt all the way south to the Florida-Georgia border, where wind chills will be in the 20s.\nABC News\nTemperatures in the East will moderate a bit on Sunday, but a bitter blast of cold air will move into the Upper Midwest and Northern Plains. The wind chill in Minneapolis Sunday morning will be nearing -20, as a wind-chill advisory has been issued for other parts of Minnesota and the Dakotas. With wind chills of -20 to -30, frostbite could develop in as little as 30 minutes.\nABC News\nABC News\nThe Upper Midwest also will see more freezing-cold wind, with snow in the Dakotas and light snow falling as far east as Indianapolis. This disturbance is expected to slide south and east, dropping snow into Iowa, Illinois and Wisconsin tonight. By Sunday, the storm may tap into some moisture across the south and bring heavy rain, ice and snow to the Eastern U.S.\nABC News\nABC News\nLight to moderate snow will develop and move through the Ohio Valley and Great Lakes tomorrow morning. Heavier bursts of snow will limit visibility greatly in cities including Louisville, Columbus, Erie, Detroit and Chicago.\nOf particular concern will be a combination of snow, freezing rain and sleet that will fall between the northern suburbs of Atlanta and Southwest Virginia. In addition to a light accumulation of snowfall, a thin layer of ice may form, making travel in this region treacherous. Atlanta should be warm enough to stave off any serious ice issues itself.\nThe interior Northeast, especially Buffalo, Watertown and Burlington, will get more snow as the I-95 corridor can expect more rainfall.\nABC News\nThis developing storm may drop 2 to 4 inches of snow from Iowa to Maine. Some Great Lakes areas may see extra moisture and snowfall totals closer to 6 inches, especialy in Western Michigan and Northwest New York. Watertown may see 10 inches because of lake-effect snow.\nMeanwhile, areas out west may see temperatures 15 to 20 degrees above average.\nABC News\nOn Friday, there were several record highs in California:\nRiverside, 87 degrees (tying a record from 1995)\nSan Francisco, 73 degrees (breaking a record of 69 degrees in 1995)\nWoodland Hills, 87 degrees (tying a record from 1995)\nABC News\nToday and tomorrow, the West may see record highs throughout the region, especially in California. Temperatures in the Los Angeles and San Diego metro areas will be 80 degrees or higher -- about 10 to 15 degrees above normal.\nMost of the western U.S. will see milder temperatures today, with 50s expected from Denver to Seattle.",
    "source_domain": "abcnews.go.com",
    "title": "Bitter cold blasting through Upper Midwest, Northeast",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/bitter-cold-blasting-upper-midwest-northeast/story?id=52814244"
}