{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:47:46+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Warriors host Cavaliers as part of Christmas lineup",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fwarriors-host-cavaliers-part-christmas-lineup%2Fstory%3Fid%3D49215588.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170810_NBA_woj_on_kyrie_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Golden State Warriors will face the Cleveland Cavaliers in the centerpiece Christmas Day game for the third consecutive season, the NBA revealed Thursday, along with the rest of its high-profile Dec. 25 schedule.\nAs the defending NBA champions, the Warriors get the reward of being home at Oracle Arena on Christmas and will host the game at 3 p.m. ET, tipping off a tripleheader on ABC.\nThe Cavs beat the Warriors on Christmas last year when Kyrie Irving made a shot with Klay Thompson draped on him with 3.4 seconds left in the game. Kevin Durant scored 36 points and LeBron James had 31 in what was one of the best games of the regular season.\nThe NBA also announced the season's featured first week of games. The Warriors and Cavs will both play on opening night, Oct. 17. The Cavs will host the Boston Celtics in a rematch of the Eastern Conference finals in the first game at 8 p.m. ET on TNT, followed by the ring ceremony at Oracle Arena as the Warriors host the Houston Rockets at 10:30 p.m. ET.\nIn all, there are five games on Christmas, including some new faces.\nThe Philadelphia 76ers' process has landed their promising young core its first marquee game, as they will open the day at noon ET on ESPN when they visit the New York Knicks. The Sixers, who haven't had a winning season since 2004-05, will be playing on Christmas for the first time since 2001.\nWhether Irving or Carmelo Anthony will be a part of those first two games is a mystery at this point, with both players being involved in trade talks. The makeups of the teams could significantly change between now and December.\nIn the third game of the day, the Washington Wizards will visit the Celtics at 5:30 p.m. ET on ABC. This is a rematch of last postseason's most intense series between two growing rivals. Both teams have racked up flagrant fouls and harsh words over the past two seasons.\nThe Celtics won their second-round series in seven games in May following an emotional two weeks, with Isaiah Thomas playing inspirational ball in the wake of his sister's death. John Wall, who has been vocal about wanting to play on Christmas, hit one of the biggest shots of the postseason when his 3-pointer with 3.5 seconds left in Game 6 won it for the Wizards.\nThe 8 p.m. ET game on ABC will be star-studded as Houston's James Harden and new teammate Chris Paul visit Oklahoma City for a game against MVP? Russell Westbrook?and new running mate Paul George.\nIt is the first Christmas Day game for George. Paul and Harden will be returning to the holiday affair. The Rockets didn't play on Dec. 25 last season and Paul missed Christmas 2016 with the LA Clippers because of a hamstring injury.\nThe final game of the day will feature two up-and-coming teams, the Minnesota Timberwolves and? Los Angeles Lakers, at 10:30 p.m. ET on TNT.\nThe visiting Wolves, who played on Christmas last season, had one of the most active offseasons in the league by trading for Jimmy Butler and signing Jeff Teague, Taj Gibson and Jamal Crawford. It will be the first Christmas game for Lakers rookie Lonzo Ball, who will be featured on national television heavily this season.\nAs Christmas falls on a Monday this year, the NBA will have to compete with NFL games for the second consecutive year. The Pittsburgh Steelers play the Texans in Houston at 4:30 p.m. ET on NBC, and the Oakland Raiders will play the Eagles in Philadelphia on Monday Night Football at 8:30 p.m. ET on ESPN.\nFans in Houston, Philadelphia and Oakland will get a chance to see both their pro basketball and football teams play on Christmas.\nAs for the rest of the NBA's opening week, each night has several games with high-profile teams and stars. On Oct. 18, the Sixers open their season on ESPN at the Wizards, who are prominently featured on the national television schedule this season. That game is followed by Butler's first game with the Wolves, in San Antonio.\nOn Oct. 19, the Knicks visit the Thunder on TNT followed by the new-look Clippers against the new-look Lakers in Ball's first game.\nOn Friday, Oct. 20, the Cavs will be in Milwaukee for the Bucks' home opener as Giannis Antetokounmpo begins his new $100 million contract. The Cavs will be followed again by the Warriors, who play in the New Orleans Pelicans' home opener as Anthony Davis, DeMarcus Cousins and Jrue Holiday start their first full season together.",
    "source_domain": "abcnews.go.com",
    "title": "Warriors host Cavaliers as part of Christmas lineup",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/warriors-host-cavaliers-part-christmas-lineup/story?id=49215588"
}