{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:32:33+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "They said the sting operation was intended to foil a real assassination plot; he apologized to family and friends.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fauthorities-reveal-murder-russian-war-journalist-staged-55543823.json",
    "image_url": "https://s.abcnews.com/images/WNT/180530_wn_moran1_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Authorities reveal the murder of Russian war journalist was staged\ntonight. A stunning twist, 24 hours after ties claimerussian reporter was gunned down inside his ho that reporter suddenly surised everybody today, appearing before cameras alive and well. He had HD foil the plot. Here's ABC's C foreign correspondent Terry Moran. Reporter: Polsurround crime scene in kiev. Arkady babchenko, a veteran Russian correspondt and crusading anti-putin journalist living in ukrain gunned down, police said. Shot in thick. This sketch of a suspect on the loose. Ukrainian auities blamin Russia. And then, this. Ba babchenko, very much alive. Was all staged, the authorities said, including a ure of babchenko playing dead on thegrou, all partal of an operation tolhat they claim was a real Russian assassinatioattemp look at howis grieving colleagues re as they watched the news live. At the press confer, babchenko apolod for T pain he them, and is wife. \"Olechka,\" he sa\"forgive me,please.\" Aand T released this video, thetakedown, they claim, of theplot's masterm the Kremlin dent all, and many of babchenko's cogues, while glad he's alive, criticizing him for undermining the credy of jours by participating I this policein David?\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Authorities reveal the murder of Russian war journalist was staged",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/WNT/video/authorities-reveal-murder-russian-war-journalist-staged-55543823"
}