{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 23:59:08+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Frustrated police appeal for public's help in Las Vegas case",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Fthousands-mourn-slain-officer-las-vegas-probe-50318934.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_f1177963cbbd41e8bc6eb81ac46c0520_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After five days of scouring the life of Las Vegas gunman Stephen Paddock and chasing 1,000 leads, investigators confessed Friday they still don't know what drove him to mass murder, and they announced plans to put up billboards appealing for the public's help.\nInvestigators have examined Paddock's politics, his finances, any possible radicalization and his social behavior — typical investigative avenues that have helped uncover the motive in past shootings.\n\"We still do not have a clear motive or reason why,\" Clark County Undersheriff Kevin McMahill said. \"We have looked at literally everything.\"\nThe FBI announced that billboards would go up around the city asking anyone with information to phone 800-CALL-FBI.\n\"If you know something, say something,\" said Aaron Rouse, agent in charge of the Las Vegas FBI office. \"We will not stop until we have the truth.\"\nPaddock, a reclusive 64-year-old high-stakes gambler, rained bullets on the crowd at a country music festival Sunday night from his 32nd-floor hotel suite, killing 58 and wounding hundreds before taking his own life.\nMcMahill said investigators had reviewed voluminous video from the casino and don't think Paddock had an accomplice in the shooting, but they want to know if anyone knew about his plot beforehand.\nIt is unusual to have so few clues five days after a mass shooting. In previous mass killings or terrorist attacks, killers left notes, social media postings and information on a computer — or even phoned police.\n\"The lack of a social media footprint is likely intentional,\" said Erroll Southers, director of homegrown violent extremism studies at the University of Southern California. \"We're so used to, in the first 24 to 48 hours, being able to review social media posts. If they don't leave us a note behind or a manifesto behind, and we're not seeing that, that's what's making this longer.\"\nWhat officers have found is that Paddock planned his attack meticulously.\nHe requested an upper-floor room overlooking the festival, stockpiled 23 guns, a dozen of them modified to fire continuously like an automatic weapon, and set up cameras inside and outside his room to watch for approaching officers.\nIn a possible sign he was contemplating massacres at other sites, he also booked rooms overlooking the Lollapalooza festival in Chicago in August and the Life Is Beautiful show near the Vegas Strip in late September, according to authorities reconstructing his movements leading up to the deadliest mass shooting in modern U.S. history.\nHis arsenal also included tracer rounds that can improve a shooter's firing accuracy in the dark, a law enforcement official told The Associated Press. It wasn't clear whether Paddock fired any of the illuminated bullets during the high-rise massacre.\nPaddock bought 1,000 rounds of the .308-caliber and .223-caliber tracer ammunition from a private buyer he met at a Phoenix gun show, a law enforcement official not authorized to comment on the investigation said on condition of anonymity.\nTracer rounds illuminate their path so a gunman can home in on targets at night. But they can also give away the shooter's position.\nVideo shot of the pandemonium that erupted when Paddock started strafing the festival showed a muzzle flash from his room at the Mandalay Bay resort, but bullets weren't visible in the night sky.\nA federal official said authorities are looking into the possibility Paddock planned additional attacks, including a car bombing. The official wasn't authorized to discuss the matter publicly and spoke to the AP on condition of anonymity.\nPaddock had 1,600 rounds of ammunition in his car in a casino parking garage, along with fertilizer that can be used to make explosives and 50 pounds (23 kilograms) of Tannerite, a substance used in explosive rifle targets.\nHis girlfriend, Marilou Danley, told FBI agents Wednesday that she had not noticed any changes in his mental state or indications he could become violent, the federal official said.\nPaddock sent Danley on a trip to her native Philippines before the attack, and she was unaware of his plans and devastated when she learned of the carnage while overseas, she said in a statement.\n———\nMelley reported from Los Angeles. Associated Press writers Michael Balsamo, Regina Garcia Cano and Josh Hoffner in Las Vegas; Jacques Billeaud in Phoenix; and Don Babwin and Michael Tarm in Chicago contributed to this report.\n———\nFor complete coverage of the Las Vegas shooting, click here: https://apnews.com/tag/LasVegasmassshooting.",
    "source_domain": "abcnews.go.com",
    "title": "Frustrated police appeal for public's help in Las Vegas case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/thousands-mourn-slain-officer-las-vegas-probe-50318934"
}