{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 23:45:46+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Transgender people can enlist in military Jan 1",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fapnewsbreak-transgender-people-enlist-military-jan-51721949.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_a4e7e252c75f4aceb1adb51925b53838_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in LGBT? Add LGBT as an interest to stay up to date on the latest LGBT news, video, and analysis from ABC News. Add Interest\nTransgender recruits will be allowed to enlist in the military beginning Jan. 1, the Pentagon said Monday, as President Donald Trump's ordered ban suffered another legal setback.\nThe new policy reflects the difficult hurdles the federal government would have to cross to enforce Trump's demand earlier this year to bar transgender individuals from the military.\nTwo federal courts already have ruled against the ban and on Monday a federal court judge denied a government request to set aside the January start date for enlistment.\nIn October, U.S. District Judge Colleen Kollar-Kotelly barred the Trump administration from proceeding with its plan to exclude transgender people from military service. Part of the effect of the ruling was that the military would be required to allow transgender people to enlist beginning Jan. 1.\nThe government had asked Kollar-Kotelly to put the Jan. 1 date on hold while they appealed her full ruling but she declined Monday, reaffirming the Jan. 1 start date. Department of Justice spokeswoman Lauren Ehrsam said Monday evening that the department will ask a federal appeals court to put on hold the Jan. 1 requirement \"as we evaluate next steps.\"\nPotential transgender recruits will have to overcome a lengthy and strict set of physical, medical and mental conditions that could make it difficult for them to join the armed services.\nMaj. David Eastburn, a Pentagon spokesman, said the enlistment of transgender recruits will begin next month and proceed amid legal battles. The Defense Department also is doing a review, which is expected to carry into 2018.\nEastburn told The Associated Press on Monday that the new guidelines mean the Pentagon can disqualify potential recruits with gender dysphoria, a history of medical treatments associated with gender transition and those who underwent reconstruction. But such recruits are allowed in if a medical provider certifies they've been clinically stable in the preferred sex for 18 months and are free of significant distress or impairment in social, occupational or other important areas.\nTransgender individuals receiving hormone therapy must be stable on their medication for 18 months.\nThe requirements make it challenging for a transgender recruit to pass. But they mirror concerns President Barack Obama's administration laid out when the Pentagon initially lifted its ban on transgender service last year.\n\"Due to the complexity of this new medical standard, trained medical officers will perform a medical prescreen of transgender applicants for military service who otherwise meet all applicable applicant standards,\" Eastburn said.\nAaron Belkin, director of the California-based Palm Center, an independent institute that has conducted research on sexual minorities in the military, said the 18-month timeline is fair.\n\"It's a good standard because the Pentagon is treating gender dysphoria according to the same standards that are applied to all medical conditions,\" he said.\nHowever, Elaine Donnelly, president for the Center For Military readiness, said Trump \"has every right to review, revise, or repeal his predecessor's military transgender policies, which would detract from mission readiness and combat lethality.\" Court judges, she said, are not qualified to run the military.\nThe Pentagon move Monday signals the growing sense within the government that authorities are likely to lose the legal fight.\n\"The controversy will not be about whether you allow transgender enlistees, it's going to be on what terms,\" said Brad Carson, who was deeply involved in the last administration's decisions. \"That's really where the controversy will lie.\"\nCarson worried, however, that the Defense Department could opt to comply with a deadline on allowing transgender recruits, but \"under such onerous terms that practically there will be none.\" Carson, who worked for Carter as the acting undersecretary of defense for personnel, said requiring 18 months of stability in the preferred sex is a reasonable time.\n\"It doesn't have any basis in science,\" he said, noting that experts have suggested six months is enough. \"But as a compromise among competing interests and perhaps to err on the side of caution, 18 months was what people came around to. And that's a reasonable position and defensible.\"\nSarah McBride, spokeswoman for Human Rights Campaign, praised the court's ruling, saying that it affirms \"there is simply no legitimate reason to forbid willing and able transgender Americans from serving their country.\"\n———\nAssociated Press Writer Jessica Gresko in Washington contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Pentagon to allow transgender people to enlist in military",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/apnewsbreak-transgender-people-enlist-military-jan-51721949"
}