{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:29:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "President Donald Trump is set to sign an executive order titled \"Buy American, Hire American\" Tuesday morning in Kenosha, Wisconsin, calling on agencies to overhaul the H-1B visa program.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fpresident-trump-sign-executive-order-targeting-foreign-work-46858255.json",
    "image_url": "http://a.abcnews.com/images/Politics/170418_atm_trump_eo_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for President Trump to sign executive order targeting foreign work visas\nPresident trump is poised to sign an executive order in Wisconsin today highlighting his push to buy American and higher American and he order aims to make changes to visa programs like the H one B which is often used by tech companies to attract high skilled workers from other countries. The White House says those B says undercut American's by bringing in cheaper labor. The order also calls for stricter requirements for the federal government to use American made products. Well on this tax day the current administration is fending off criticism about a lack of transparency. After thousands of protesters turned out across the country to call on president from to release his tax returns. The White House again citing ongoing audits but declined to provide proof of those audits. For explain why the president has a release taxes for the years that are not under audit. You always talk about to wilt under audit the president's is under water. Is is it times to say Watson fall the president is never going to release his tax returns. We'll have to get back him. You what I mean you see. I mean really. We may know I sent it after your backyard and I think that forced he still wonder audit that statement still stands. Our Jonathan Karl there was Sean Spicer and Spicer also defended the president for his decision. To keep White House visitor logs secret he said they maintain the same policy. That other administrations did prior to the last one.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "President Trump to sign executive order targeting foreign work visas",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/president-trump-sign-executive-order-targeting-foreign-work-46858255"
}