{
    "authors": [
        "Abc News",
        "More Kelly"
    ],
    "date_download": "2018-07-04 19:30:18+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Sparks were flying before the Fourth of July for two plane passengers whose connection went viral on Twitter.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FLiving%2Fwoman-switched-seats-passenger-tweets-play-play-potential%2Fstory%3Fid%3D56363510.json",
    "image_url": "https://s.abcnews.com/images/GMA/plane-10-ht-er-180704_hpMain_v4x3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One woman's play-by-play of a potential love connection has lit up like a firework this Fourth of July.\nRosey Blair first took to Twitter early Tuesday morning when she said she switched seats on a flight to Dallas with a fellow female passenger.\n\"Last night on a flight home, my boyfriend and I asked a woman to switch seats with me so we could sit together,\" Blair wrote in the tweet. \"We made a joke that maybe her new seat partner would be the love of her life and well, now I present you with this thread.\"\nLast night on a flight home, my boyfriend and I asked a woman to switch seats with me so we could sit together. We made a joke that maybe her new seat partner would be the love of her life and well, now I present you with this thread. — Rosey Blair (@roseybeeme) July 3, 2018\nHer Twitter thread detailed every move made between the seat-mates (and potential soul-mates).\nBlair shared a series of photos with captions detailing everything from what they discussed to slight elbow movements to the food they shared mid-flight. The images were originally posted to her Instagram story.\nShe said she heard both the unnamed man and woman say \"they're both personal trainers,\" and later added that the man used to play professional soccer.\nBoth of them appeared to be single according to Blair, who wrote that there were \"no wedding rings in sight,\" giving her and her own husband hope for a potential match.\nThe series of Tweets has garnered nearly 240,000 retweets and over 590,000 likes as of the time of this story's publication.\nOther users followed the Twitter thread closely and began replying photos to Blair, confirming to her how invested they were in finding out more details.\nUpon landing in Dallas, Blair took a photo of the pair walking closely together at the baggage claim area.\nBlair said her boyfriend, who was also on the flight, found the fellow passengers' Instagram accounts and confirmed they were single, based in Dallas and now following each other on social media.\nLater Wednesday night, Blair shared a video after contacting one half of the couple on Instagram, Euan Holden. Blair said that he gave her permission to share his handle.\nHe said we could spill the beans!!! ?? pic.twitter.com/CHmMz91fDB — Rosey Blair (@roseybeeme) July 4, 2018\nHe was SO nice! Gave us permish for y’all to go give him some love. pic.twitter.com/Ph8WX7Xxkt — Rosey Blair (@roseybeeme) July 4, 2018\nNeither Blair nor Holden immediately responded to ABC News' request for comment.\nHolden later revealed on his own social channels that he knew he and his seat-mate were being recorded.\nHilarious... Knew you were taking pictures ?? https://t.co/dTuFA8RI1O — Euan Holden (@EuanHolden) July 4, 2018\nThere is no update on whether Holden and the unidentified woman are still talking or have plans to see one another again.\nHe did, however, update his Twitter bio with the following: \"Newly nicknamed 'Plane Bae.'\"",
    "source_domain": "abcnews.go.com",
    "title": "Woman who switched seats with another passenger tweets play-by-play of potential love connection",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Living/woman-switched-seats-passenger-tweets-play-play-potential/story?id=56363510"
}