{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 20:37:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "SpaceX launching recycled rocket, supply capsule for NASA",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fspacex-launching-recycled-rocket-supply-capsule-nasa-51722167.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_0d6ceb69a7a54efda59ed26ff8f66cf3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Space Age hand-me-downs are soaring to a whole new level.\nOn Tuesday, SpaceX plans to launch its first recycled rocket for NASA. The unmanned Falcon 9 — last used in June — will carry up a Dragon capsule that's also flown on a previous space station supply run.\nNASA's International Space Station manager, Kirk Shireman, said the risk of launching a recycled rocket is about the same as for a brand new one. He expects to be just as anxious as he always is at every launch.\n\"It's still a dangerous business,\" he told reporters Monday. Although NASA's best rocket experts conducted an extensive review of the recycled and meticulously inspected booster, there is never \"zero risk,\" he pointed out.\nThe private SpaceX has launched recycled rockets three times before, on commercial satellite deliveries. And back in June, SpaceX launched a previously flown Dragon to the space station. This latest Dragon to fly — loaded with nearly 5,000 pounds of food, gear and experiments, and likely some Christmas presents — first flew in 2015.\nWhile the notion of reusable rockets is hardly new — NASA's now retired space shuttles reused main engines and booster segments — SpaceX is intent on driving down launch costs by salvaging its boosters and other components, and reflying them again and again.\n\"This is the beginning of rapid and reliable reusability,\" said Jessica Jensen, a SpaceX manager. \"We want to be able to send thousands of people into space, not just tens, and so reusability is a very key part of that, and we're excited because tomorrow is just one step closer to that.\"\nAs before, the first-stage booster will attempt to land back at Cape Canaveral Air Force Station.\nThis will be the first launch in more than a year from Launch Complex 40. The pad was ruined when a SpaceX rocket exploded during testing in September 2016.\nIn a $50 million rebuild, SpaceX made the pad more robust, burying support equipment and fuel lines under concrete and steel.\n———\nOnline:\nSpaceX: http://www.spacex.com/",
    "source_domain": "abcnews.go.com",
    "title": "SpaceX launching recycled rocket, supply capsule for NASA",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/spacex-launching-recycled-rocket-supply-capsule-nasa-51722167"
}