{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:11:30+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fearnings-reports-lift-stocks-10-year-yield-hits-54690509.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_1e7a5f26d19040cf91fb6d546622aeee_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. stocks are higher Tuesday morning as investors applaud strong first-quarter results from companies including machinery maker Caterpillar, appliance maker Whirlpool and Fifth Third Bancorp. Smaller companies made big gains in an optimistic sign for the U.S. economy. Bond yields continue to rise and the 10-year Treasury note reached 3 percent for the first time in more than four years. Alphabet, Google's parent company, slid after it reported greater revenue but also an increase in spending.\nKEEPING SCORE: The S&P 500 index gained 4 points, or 0.2 percent, to 2,675 as of 9:55 a.m. Eastern time. The Dow Jones industrial average rose 43 points, or 0.2 percent, to 24,492. The Nasdaq composite added 13 points, or 0.2 percent, to 7,141. The Russell 2000 index of smaller-company stocks rose 8 points, or 0.5 percent, to 1,570.\nMACHINE POWER: Caterpillar said the strong global economy helped its sales of construction and energy industry machinery and it raised its forecasts for the year. It also said prices rose and its stock jumped 3.3 percent to $159. Appliance maker Whirlpool also surpassed expectations and rose 5 percent to $157.80. Aircraft maker United Technologies rallied 1.5 percent to $125.29 after its report and competitor Boeing gained 1.7 percent to $344.59. Westinghouse Air Brake Technologies picked up 2.4 percent to $90.15.\nMISPRINT: Alphabet slid 2.6 percent to $1,045.78 after the company said ad revenue climbed, but expenses also rose. Google's parent company benefited from strong digital ad sales as well as an accounting change.\nDrugmaker Biogen reported weaker sales than analysts expected and its stock gave up 2.3 percent to $253.34 while scientific equipment maker Waters said sales to industrial customers decreased. The stock plunged 7.9 percent to $193.\nBONDS: Bond prices kept slipping. The yield on the 10-year Treasury note rose to 3 percent before it slipped to 2.99 percent. It finished at 2.98 percent on Monday.\nThe yield on the 10-year note is a benchmark for many kinds of interest rates including mortgages, and it's been climbing because investors expect greater economic growth and faster inflation. It hadn't reached 3 percent since early January of 2014.\nSince the global financial crisis in 2008-09, a combination of low inflation expectations and a bond-buying program by the Federal Reserve have helped keep bond yields low, but they have climbed this year as inflation has picked up and the Fed raised interest rates. With the Fed no longer buying bonds and investors expecting greater inflation, analysts say higher yields could make bonds more attractive.\nCURRENCIES: The dollar rose to 109.13 yen from 108.65 yen. The euro rose to $1.2230 from $1.2205.\nENERGY: Benchmark U.S. crude oil gained 19 cents to $68.83 a barrel in New York. Brent crude, used to price international oils, gained 7 cents to $74.78 per barrel in London.\nOVERSEAS: Germany's DAX lost 0.3 percent while the French CAC 40 dipped 0.2 percent. Britain's FTSE 100 rose 0.2 percent. Japan's benchmark Nikkei 225 rose 0.9 percent, helped by the weaker yen. The Kospi in South Korea lost 0.4 percent and Hong Kong's Hang Seng added 1.4 percent.\n————\nAP Markets Writer Marley Jay can be reached at http://twitter.com/MarleyJayAP . His work can be found at https://apnews.com/search/marley%20jay",
    "source_domain": "abcnews.go.com",
    "title": "Earnings reports lift stocks; 10-year yield hits 3 percent",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/earnings-reports-lift-stocks-10-year-yield-hits-54690509"
}