{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:04:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Trump sons Eric, Donald Jr. to attend 'closed' Dubai event",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ftrump-sons-eric-donald-jr-attend-closed-dubai-45504167.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_ccc747a9fcdf4393a809ece4656d7a9a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump's two sons in charge of his global business empire will attend a closed-door event this coming weekend to mark the opening of the Trump International Golf Club in Dubai, organizers said Wednesday.\nThe ceremony in the Mideast city-state home to the world's tallest building marks the first major event abroad that Eric and Donald Jr. will attend together since their father's inauguration.\nIt also comes as questions still swirl about how the Trump Organization's many international business interests will affect the administration of America's 45th president.\nAlready, a liberal-funded watchdog group has filed a lawsuit alleging his business violates the so-called emolument act of the U.S. Constitution.\nMeanwhile, news reports have described Trump and Japanese Prime Minister Shinzo Abe huddling with staff over a North Korea ballistic missile launch in front of diners and waiters at his Florida resort this past weekend.\nThe 18-hole Dubai golf course is part of a larger villa and apartment building project by DAMAC Properties, a Dubai-based developer owned by billionaire Hussain Sajwani. Recently renamed DAMAC Hills, the project surrounds the golf club managed by the Trump Organization.\nOne of the Trump Organization's subsidiaries received from $1 million to $5 million from DAMAC, according to a U.S. Federal Election Committee report submitted in May. Sajwani and his family also attended a New Year's Eve celebration at Trump's Mar-a-Lago club in Florida, while Trump days later told journalists that DAMAC had offered the Trump Organization $2 billion in deals.\nThe Dubai golf course marks Trump's first successful venture in the Arab world. Another Trump-managed golf course is planned for another even larger DAMAC project under development and the developer has been putting up billboards around Dubai advertising the newly opened course.\nTrump's two sons, who took over management of the Trump Organization after their father stepped aside, had been anticipated to attend the ceremonial opening of the Dubai course. The Trump Organization earlier referred questions about the event to DAMAC.\nDAMAC spokesman Niall McLoughlin told The Associated Press on Wednesday that the ceremony Saturday would be a \"closed event.\" He declined to elaborate.\nIt's unclear what security precautions will be taken for the visit, as experts already have warned the Trump brand abroad now faces a global terror risk .\nBoth Eric and Donald Jr. receive Secret Service protection as immediate family members of the president. The U.S. Embassy in Abu Dhabi has declined to comment about the trip, while Dubai police did not immediately respond to a request for comment.\nThe Dubai visit comes as the Trump Organization finds its footing after its patriarch entered the White House.\nBefore Trump's Jan. 20 inauguration, his son Eric visited the Trump Tower Punta del Este in Uruguay to check on the tower's progress and personally greet buyers. A Trump hotel in Vancouver, British Columbia, is also expected to soon host Trump's sons.\n———\nFollow Jon Gambrell on Twitter at www.twitter.com/jongambrellap . His work can be found at http://apne.ws/2galNpz .",
    "source_domain": "abcnews.go.com",
    "title": "Trump sons Eric, Donald Jr. to attend 'closed' Dubai event",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/trump-sons-eric-donald-jr-attend-closed-dubai-45504167"
}