{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:11:37+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-sales-homes-shot-percent-march-54690077.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/us-sales-homes-shot-percent-march-54690077",
    "language": "en",
    "localpath": null,
    "maintext": "Sales of new U.S. homes jumped 4 percent in March, propelled by a surge of buying in the West.\nThe Commerce Department said Tuesday that sales last month were at a seasonally adjusted annual rate of 694,000. The two prior months had their sales revised upward with the annual rate being 667,000 in February and 644,000 in January. For the first three months of 2018, sales are running 10.3 percent higher than a year ago.\nHomebuyers are snapping up newly built houses as the economic outlook has continued to improve in recent months. Nor have the gains been derailed so far by 30-year mortgage rates climbing to their highest averages since early 2014.\nStill, the solid sales growth for new homes also shows that many would-be buyers can't find existing homes that are available to purchase. Listings for existing homes sank to the lowest levels on record for March, the National Association of Realtors reported on Monday.\nNew homes tend to cost more than older properties. The median sales price of a new home rose 4.8 percent from a year ago to $337,200, a nearly $87,000 premium on the median cost of an existing home.\nPrices for a new home are increasingly concentrated at higher price points. In 2016, 53 percent of new homes cost more than $300,000. That figure climbed to 60 percent for new homes sold in March.\nThe March increase was driven almost entirely by a 28.3 percent leap in sales in the West. New-home purchases rose slightly in the South, fell in the Midwest and plunged in the Northeast. The new home sales report can be volatile on a monthly basis, causing the numbers to be revised later.",
    "source_domain": "abcnews.go.com",
    "title": "US sales of new homes shot up 4 percent in March",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-sales-homes-shot-percent-march-54690077"
}