{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:22:39+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-security-council-members-demand-syria-action-53861394.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_4adc36c902bf410e953c6596e3c0a39a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the conflict in Syria (all times local):\n1 a.m.\nEight Security Council nations say it's \"imperative\" that the U.N. body Council \"immediately pursue decisive action\" to achieve a cease-fire in Syria if U.N. member states, especially Russia and its ally Syria, don't implement a resolution demanding a cessation of hostilities.\nA letter sent to all 15 council members on Monday expresses \"profound concern\" about the lack of implementation of the Feb. 24 resolution demanding a cease-fire throughout Syria without delay to deliver humanitarian aid and evacuate the critically ill and wounded.\nIt singles out Russia and Syria as key to implementation.\nThe letter was signed by France, Kuwait, Peru, Poland, Sweden, the United Kingdom, the United States and the Netherlands.\nIt says that implementing the resolution \"could immediately save hundreds, if not thousands, of children, women and men who have suffered acutely during the past eight years of the brutal conflict in Syria.\"\n———\n12:10 a.m.\nThe U.N. human rights chief says the Syrian government's five-year siege of the Damascus suburbs of eastern Ghouta has involved \"pervasive war crimes,\" use of chemical weapons and starvation as a weapon of war.\nHigh Commissioner for Human Rights Zeid Ra'ad al-Hussein told an informal meeting of the U.N. Security Council late Monday that never before have military offensives against terrorism been used more often \"to justify the unconscionable use of force against civilians than in the last few months in Syria.\"\nRussia earlier blocked his planned address to a formal meeting of the council.\nZeid said \"unlawful methods of warfare have been used by all parties\" in Syria. But he singled out the Syrian government's claim that it makes every effort to protect civilians and dismissed it.\nIn his words, \"When you are capable of torturing and indiscriminately killing your own people, you have long forfeited your own credibility.\"\n———\n11 p.m.\nWestern nations on the U.N. Security Council and their supporters have quickly organized an informal briefing by the U.N. human rights chief on Syria after a Russian-led protest blocked him from addressing a formal council meeting.\nFrance's U.N. Ambassador Francois Delattre told reporters after a procedural vote that Russia called for prevented High Commissioner for Human Rights Zeid Ra'ad al-Hussein from addressing an open meeting in the council that he would deliver the same address at the informal meeting late Monday afternoon.\nDelattre criticized Russia for refusing any discussion of human rights in the Security Council when rights violations in Syria \"are at their very peak.\"\nRussian deputy ambassador Gennady Kuzmin had argued that human rights have nothing to do with the council's mandate of ensuring international peace and security.\nBut Sweden's U.N. Ambassador Olof Skoog insisted that \"human rights and peace and security are intimately linked.\"\nAnd Britain's deputy U.N. ambassador Jonathan Allen said Russia \"doesn't want the truth of ... the appalling human rights abuses taking place.\" But he said: \"We mustn't let them silence us.\n———\n10:10 p.m.\nThe U.N. human rights chief has been blocked from speaking to the Security Council about the situation in Syria after Russia, backed by China and others, protested that the U.N. body charged with ensuring international peace and security should not be discussing human rights.\nAt the start of Monday afternoon's council meeting that was to be addressed by High Commissioner for Human Rights Zeid Ra'ad al-Hussein, Russia demanded a procedural vote on whether the meeting should be held.\nUnder council rules, nine \"yes\" votes are required.\nAfter the issue was put to a vote, the result was 8 countries in favor, 4 against and 3 abstentions. So the meeting was canceled.\nIt was a very rare defeat on a procedural issue at an open council meeting.\nBut it reflected deep divisions at the Security Council over seven years of Syrian conflict that has involved President Bashar Assad's key ally Russia and Western nations including the U.S. and other supporters of the Syrian opposition.\n———\n10 p.m.\nTurkey's president has vowed to expand military operations across northern Syria and even into neighboring Iraq after his forces drove Kurdish fighters from the northern Syrian town of Afrin.\nPresident Recep Tayyip Erdogan said Monday that the two-month-long Afrin campaign was the \"most important phase\" of the military operation launched on Jan. 20, which is aimed at driving Syrian Kurdish forces out of areas along the border.\nTurkey views the Syrian Kurdish militiamen as terrorists because of their links to Kurdish insurgents fighting inside Turkey.\nErdogan said Turkish troops and allied Syrian forces would now press eastward, toward the town of Manbij and areas east of the Euphrates River, including Ayn al-Arab, the Arabic name for the Kurdish town of Kobani. Those areas are controlled by U.S.-backed Syrian Kurdish forces, and U.S. troops are stationed there.\n———\n8:30 p.m.\nThe U.N.'s humanitarian coordinator in Syria is appealing for help to provide aid to tens of thousands of civilians affected by the fighting outside the Syrian capital and in the northern town of Afrin.\nAli al-Za'tari says the civilians are in \"desperate need,\" and are \"tired, hungry, traumatized and afraid.\"\nGovernment forces are close to capturing the eastern Ghouta region outside Damascus, where they have waged a fierce monthlong air and ground campaign. Turkish troops and allied Syrian forces seized Afrin from Kurdish fighters on Sunday after a two-month offensive. The fighting in both places has killed hundreds of civilians and displaced tens of thousands.\nAl-Za'tari says the U.N., the Syrian Arab Red Crescent and other partners are \"fully mobilized to deliver aid on the spot,\" but require permissions and security guarantees.\nThe Syrian government has regularly blocked the delivery of aid to opposition-held areas.\n———\n8 p.m.\nSyria has condemned Turkey's capture of the northern Syrian town of Afrin from Kurdish forces.\nThe Syrian Foreign Ministry, in messages sent to the U.N. Security Council and secretary general on Monday, called on Turkey to withdraw its forces immediately from Syrian territories.\nTurkish troops and allied Syrian opposition forces seized Afrin from a Kurdish militia on Sunday after a nearly two-month military campaign.\nThe Syrian Foreign Ministry said the move was \"illegal\" and called it an invasion.\nTurkey views the Kurdish forces as terrorists because of their links to Kurdish insurgents inside Turkey. Ankara denies it is invading or occupying Syrian land, saying it is only removing militants from areas along the border.\n———\n6:30 p.m.\nSyrian President Bashar Assad's office has released videos showing the president driving himself to visit his forces at the battle for eastern Ghouta, just outside the capital, Damascus.\nThe videos, released late Sunday and early Monday, show the president calm and assured. Other drivers on the road give no indication of knowing who is behind the wheel of the Honda sedan.\nAssad's forces in eastern Ghouta appear close to clinching one of their most significant victories against rebels in seven years of civil war.\nAs he drove, he narrated his route to the camera and gave his thoughts on the battle. He said the images of civilians crossing over by the thousands to government authorities in eastern Ghouta showed that his government was still popular with his people and still possessed the \"legitimacy\" to rule.\nEastern Ghouta has been under a crippling siege and heavy bombardment for weeks, with civilians packing into underground shelters. Some 1,500 civilians have been killed in the last month.\n———\n6:15 p.m.\nThe U.S. State Department says it is \"deeply concerned\" over the humanitarian situation following Turkey's capture of the town of Afrin in northern Syria from Kurdish forces.\nSpokeswoman Heather Nauert said in a statement Monday that the offensive forced the majority of the predominantly Kurdish population of Afrin to evacuate from the town.\nShe said the U.S. calls on all parties to the conflict to allow humanitarian groups to access the displaced and develop a program for their safe and voluntary return.\nNauert said the fighting in Afrin has distracted from the fight against Islamic State militants, allowing the extremists to begin to reconstitute in some areas.\nShe said the U.S. is committed to its NATO ally Turkey and its security concerns, and is also committed to the fight against IS with its partners, the Kurdish-led Syrian Democratic Forces.\nNauert said U.S. officials have expressed their concern to Turkish officials about the situation in Afrin.\n———\n4:15 p.m.\nTurkish President Recep Tayyip Erdogan says that after victory in Syria's Afrin region, his country will expand its military operations into other Kurdish-held areas in Syria as well as to Iraq's Sinjar region.\nSpeaking at a ceremony for judicial appointments in Ankara, Erdogan said troops would target the Syrian city of Manbij, as well as Ayn al-Arab, also known as Kobani, and other towns along the border to the east of the Euphrates River. Those areas are controlled by U.S.-backed Syrian Kurdish forces and U.S. troops are stationed there.\nErdogan said Turkish troops could also cross into Iraq to drive out Kurdish militants from the region of Sinjar, if the Iraqi government is reluctant to oust militants from the area. Turkey says the region is becoming a headquarters for outlawed Kurdish rebels who have been fighting an insurgency in Turkey's southeast since 1984.\nErdogan said \"one night, we could suddenly enter Sinjar.\"\nHe insisted Turkey had no intention of \"invading\" Syria, saying it was merely clearing the border area of terrorists.\n———\n2:05 p.m.\nSyria's Kurdish militia says a British woman who had joined their ranks to fight in the northern town of Afrin has been killed in a Turkish airstrike.\nNisrin Abdullah, spokeswoman of the Kurdish female militia known as YPJ, said on Monday that Anna Campbell was killed last Thursday.\nShe is the first foreign national to die in the battle for Afrin. She is also the first British female fighter and the eighth Briton to die fighting alongside the Kurdish militia in Syria. The Press Association says Campbell was 26 years old from Lewes, East Sussex.\nMacer Gifford, a Briton who travelled with Campbell, said they arrived last May to eastern Syria, where they joined the U.S-backed Kurdish militia to fight against Islamic State militants. Gifford returned home after the fall of the city of Raqqa last summer.\nGifford told The Associated Press via Twitter that Campbell, an animal rights activist, \"was a lovely girl. Very opinionated and determined.\"\nHe also says: \"She loved the YPJ and the last I saw of her was her leaving to join them.\"\n———\n1:50 p.m.\nTurkish Deputy Prime Minister Bekir Bozdag says Turkey does not aim to invade the Syrian town of Afrin and will hand it over to \"its real owners.\"\nBozdag made the comments on Monday, a day after Turkish troops and Ankara-allied Syrian opposition forces captured Afrin.\nThe town was taken nearly two month after Turkey launched its offensive to clear Afrin and surrounding districts of a Syrian Kurdish militia that Ankara considers to be a \"terrorist\" group, allied with Turkey's outlawed Kurdish rebels.\nBozdag says\" ''We are not invaders. The aim of our offensive is to clear the region of terror.\"\nHe says the Syrian Kurdish forces retreated from Afrin because \"they were afraid ... you see this very clearly when you look at ammunition and weapons that they left behind.\"\nHe says the Kurdish fighters had left booby traps and other explosives inside Afrin.\n———\n1:35 p.m.\nThe European Union has slapped sanctions on a senior Syrian military officer and three scientists accused of links to the development and use of chemical weapons against civilians.\nEU headquarters said on Monday that the four work at the Scientific Studies and Research Center, a Syrian government agency the EU says produces chemical weapons and missiles to deliver them.\nThe center has been under EU sanctions since Dec. 2011.\nThe move brings to 261 the number of people targeted by an EU travel ban and asset freeze over the crackdown on Syrian civilians and support for the government of President Bashar Assad or associating with certain government officials.\nA further 67 entities — often companies, agencies and organizations — have had their assets frozen.\n———\n12:40 p.m.\nA senior Syrian Kurdish official says Turkey's offensive on the Syrian town of Afrin is an \"occupation\" that endangers the rest of northern Syria.\nAldar Khalil, a leading Kurdish official, on Monday condemned Turkey for the assault and for raising the Turkey's flag in a Syrian town.\nHe says Turkish President Recep Tayyip Erdogan is seeking to spread his influence in Syria as a way of restoring the Ottoman empire's former influence.\nHe says: \"The whole of northern Syria is in danger.\"\nTurkish troops and Syrian opposition fighters allied with Ankara captured Afrin on Sunday, nearly two months after Turkey began its offensive on the enclave.\nErdogan, who first launched military operations in Syria in 2016, has repeatedly said Turkey will not allow a \"terror corridor\" along its border and has vowed to push eastward in Syria after Afrin, to prevent the Kurdish militia from linking up territories it controls in eastern and western Syria.\n———\n9:50 a.m.\nThe European Union's top diplomat is criticizing Turkey over its military offensive in a northern Syrian town and is calling on Ankara to ensure that fighting eases in the conflict-torn country.\nEU foreign policy chief Federica Mogherini says: \"I am worried about this.\"\nMogherini told reporters in Brussels on Monday that international efforts in Syria are supposed to be \"aiming at de-escalating the military activities and not escalating them.\"\nShe urged Turkey, Russia and Iran to guarantee that conflict \"de-escalation zones\" are established as promised, to \"guarantee that that is what happens on the ground.\"\nTurkey's President Recep Tayyip Erdogan announced on Sunday the capture of the town of Afrin, previously controlled by the Kurdish militia known as the People's Defense Units, or YPG.\n———\n9:40 a.m.\nTurkey's state-run news agency says a booby trap bomb reportedly left by Syrian Kurdish fighters in the northern Syrian town of Afrin has killed 11 people — seven civilians and four Turkish-backed fighters.\nAnadolu Agency says the explosion occurred late on Sunday in a four-story building that Turkish-backed Syrian opposition forces were clearing for explosives.\nTurkish troops and Syrian opposition fighters allied with Ankara marched into Afrin on Sunday, nearly two months after Turkey began its offensive on the enclave to drive out a Syrian Kurdish militia. Ankara considers the militia an extension of its own insurgency.\nKurdish officials and a war monitor say some pockets of resistance remain in the town of Afrin but the Kurdish militia, known as YPG, has largely withdrawn.\n———\n9:20 a.m.\nA Syria war monitoring group says Turkish-allied militiamen are looting the northern Syrian town of Afrin after the Turkish military and allied Syrian fighters seized control of it.\nThe Britain-based Syrian Observatory for Human Rights said Monday the looting began on Sunday, after the Turkish and allied Syrian forces marched into the town center and raised their flags there — nearly two months after the offensive on the Kurdish enclave started.\nThe troops faced little resistance from the Kurdish militia, which withdrew, vowing a \"new phase\" of guerrilla tactics against Turkish troops and their allied fighters.\nThe Observatory, which monitors Syria's war through a network of activists on the ground, described extensive looting of shops, homes and cars in Afrin.\nIt's unclear what Turkey plans after the capture of Afrin.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: 8 Security Council members demand Syria action",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-security-council-members-demand-syria-action-53861394"
}