{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 05:33:35+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Man arrested in alleged stalking of Lana del Rey in Orlando",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fman-arrested-alleged-stalking-lana-del-rey-orlando%2Fstory%3Fid%3D52822119.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/lana-del-rey-performing-gty-mem-170727_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Orlando police say they foiled a suspected kidnapping attempt of singer Lana del Rey during her Friday concert.\nMichael Hunt, 43, of Riverview, Florida, according to an arrest affidavit, has an extensive criminal history and allegedly posted a series of \"social media threats to Elizabeth Woolridge Grant\" before her scheduled performance at the Amway Arena, where thousands of fans attended.\nARRESTED: Michael Hunt, for aggravated stalking & attempted kidnapping w/a weapon. After receiving a tip we deemed a credible threat, OPD got to him before he could get near singer Lana Del Rey last night at her show at Amway Center. pic.twitter.com/twVrOSxNqF — Orlando Police (@OrlandoPolice) February 3, 2018\nPolice said in a tweet that working off information provided by a tipster, they \"took investigative measures to locate Hunt\" and managed to spot and capture him on Friday evening.\nHe was \"approximately 200-feet from Amway Arena,\" where the police in the affidavit say only days before he had allegedly lodged threats on a social media account against the singer, whose real name is Elizabeth Grant.\nThe heavily redacted affidavit, dated Feb. 1, suggests that Hunt published \"different posts\" from Jan. 29 to Feb. 2, and as a result \"victim Elizabeth Grant was in fear for her safety.\"\nThe affidavit also states that there \"is a concern for public safety and Elizabeth Grant to due to comments made by Michael Hunt [sic] was considered to be self-destructive tendencies.\"\nWhen they searched him, they said Hunt had Lana del Rey concert tickets and, according to the affidavit, he pulled a 3-inch blade folding knife that the man allegedly possessed.\nHunt, according to the affidavit, has a long criminal past with as many as \"61 felony convictions from drugs to violent crimes.\"\nAfter Hunt was read his Miranda Rights, the affidavit states, he was interviewed by cops and they determined that he \"did so threat to confine and/or imprison victim Grant against her will and without lawful authority.\"\nHunt was then charged with aggravated stalking with a credible threat and attempted kidnapping with a weapon, according to an Orlando Police Department statement.\nOPD Media release on arrest of Michael Hunt, 43, who stalked, made threats against singer Lana Del Rey. Working off a tip,OPD Officers were able to stop Hunt, who was armed with a knife, before he could get to the Amway Center. pic.twitter.com/mOsfGEwJIO — Orlando Police (@OrlandoPolice) February 4, 2018\nHunt is being held without bail in the Orange County Jail, authorities confirmed.\nAttempts by ABC News' reach del Rey for comment were not immediately returned.\nABC News' Rex Sakamoto contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Man arrested in alleged stalking of Lana del Rey in Orlando",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/man-arrested-alleged-stalking-lana-del-rey-orlando/story?id=52822119"
}