{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:32:16+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fcambridge-analytica-whistleblower-arrives-capitol-hill-54691723.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_6fbf702e27c84e6b8f8c056525d22342_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "House Democrats, frustrated by what they see as GOP inaction and with an eye on midterm elections, on Tuesday held the first of what they hope to be several interviews with witnesses who have not been interrogated in the Republican-led Russia investigations.\nDemocrats on the House Judiciary and Oversight and Government Reform committees interviewed former Cambridge Analytica employee Christopher Wylie, who revealed that a data-mining firm affiliated with President Donald Trump's campaign gathered millions of Facebook profiles to influence elections.\nWylie's visit is part of a Democratic attempt to keep congressional focus on Russian meddling in the 2016 election and on whether Trump's campaign was involved. Democrats on the House Intelligence Committee plan to meet with Wylie on Wednesday. Republicans were invited to both meetings but declined to attend.\nIt was unclear if there were any new revelations in Tuesday's meeting, which lasted less than three hours and was attended by a handful of lawmakers. The Democrats said they would like to hold additional interviews, but it was unclear if any were scheduled.\nAt least one House Democrat who attended signaled a larger strategy was at play.\n\"The Republicans aren't always going to be in the majority,\" said Rep. Raja Krishnamoorthi of Illinois, a member of the Oversight panel, after he left the interview with Wylie. \"So I think we have to do our due diligence, we have to lay the groundwork for what we would actually want to do if we take back the House and we are operating in the majority in the committee.\"\nThe GOP-led House Intelligence Committee shut down its Russian meddling probe last month, concluding after dozens of interviews that they didn't see any evidence of collusion or coordination between Trump's campaign and Russia. Democrats were furious, arguing that Republicans hadn't subpoenaed many witnesses they considered essential. The Republican chairmen of the Judiciary and Oversight panels declined to investigate the election meddling at all, saying they would instead leave that to special counsel Robert Mueller.\nStill, Republicans on all three committees are investigating the Justice Department, looking into whether employees conspired against Trump in beginning its Russia investigation and whether the department's employees were biased in its investigation of Trump's 2016 opponent, Democrat Hillary Clinton.\nIn a joint statement after the Wylie interview, Democrats on the Judiciary and Oversight committees said he raised serious questions about security.\n\"We must do more to learn how foreign actors collect and weaponize our data against us, and what impact social media has on our democratic processes,\" the lawmakers said in a joint statement.\nWylie worked for the U.K.-based Cambridge Analytica from 2013 to 2015. In several interviews last month, he said the firm sought information on Facebook to build psychological profiles on a large portion of the U.S. electorate. He said the company was able to amass the database quickly with the help of an academic, Aleksander Kogan, who developed a Facebook app called \"This is Your Digital Life\" that appeared to be a personality test. Wylie has said he fears that data may have been turned over to Russians who aimed to interfere with the U.S. election.\nCambridge Analytica was backed by the conservative billionaire Robert Mercer, a hedge-fund manager who supported the Trump campaign. The firm's vice president at one point was Steve Bannon, who later became Trump's campaign chairman and White House adviser.\nLeaving the interview, Wylie declined to say what was discussed but said he hopes that Congress can investigate Cambridge Analytica and whether the firm's \"actions were compliant with American law.\"\n\"I hope so,\" he said. \"That's why I came.\"",
    "source_domain": "abcnews.go.com",
    "title": "House Democrats talk to Cambridge Analytica whistleblower",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/cambridge-analytica-whistleblower-arrives-capitol-hill-54691723"
}