{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 09:20:56+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "IS claims it's taken bin Laden's Afghan hideout of Tora Bora",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fclaims-bin-ladens-afghan-hideout-tora-bora-48049503.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_adb1f5d6be474571bb65b3964f1a1cdd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Islamic State group said its fighters have captured Osama bin Laden's infamous Tora Bora mountain hideout in eastern Afghanistan but the Taliban on Thursday dismissed the claim, saying they were still in control of the cave complex that once housed the former al-Qaida leader.\nEarlier, IS released an audio recording, saying its signature black flag was flying over the hulking mountain range. The message was broadcast on the militants' Radio Khilafat station in the Pashto language late on Wednesday.\nIt also said IS has taken over several districts and urged villagers who fled the fighting to return to their homes and stay indoors.\nA Taliban spokesman denied IS was in control, claiming instead that the Taliban had pushed IS back from some territory the rival militants had taken in the area.\nThe Tora Bora mountains hide a warren of caves in which al-Qaeda militants led by bin Laden hid from U.S. coalition forces in 2001, after the Taliban fled Kabul and before he fled to neighboring Pakistan.\nAccording to testimony from al-Qaeda captives in the U.S. prison at Guantamo Bay, Cuba, bin Laden fled from Tora Bora first to Afghanistan's northeastern Kunar province, before crossing the border into Pakistan. He was killed in a 2011 raid by U.S. Navy SEALs on his hideout in the Pakistani garrison town of Abbottabad.\nPakistan complained the raid violated its sovereignty while bin Laden's presence — barely a few miles from the Pakistani equivalent of Washington's West Point military academy — reinforced allegations by those who accused Pakistan of harboring the Taliban and al-Qaeda militants. Pakistan denies such charges, pointing to senior al-Qaida operatives it has turned over to the United States.\nMeanwhile, Taliban spokesman Zabiullah Mujahid told The Associated Press in a telephone interview that Taliban fighters pushed back the Islamic State group from areas of Tora Bora that IS had earlier captured.\nMujahid claimed that more than 30 IS fighters were killed in battle. He also added that a U.S. airstrike on Taliban positions on Wednesday that killed 11 of its fighters had benefited the Islamic State group.\nThe remoteness of the area makes it impossible to independently verify the contradictory claims.\nAfghan officials earlier said that fighting between IS and the Taliban, who had controlled Tora Bora, began on Tuesday but couldn't confirm its capture.\nWhile the United States estimates there are about 800 IS fighters in Afghanistan, mostly restricted to the eastern Nangarhar province, other estimates say their ranks also include thousands of battle-hardened Uzbek militants.\nLast week Russia announced it was reinforcing two of its bases in Central Asia, in Tajikistan and Kyrgyzstan, with its newest weapons because of fears of a \"spill-over of terrorist activities from Afghanistan\" by the Afghan IS affiliate.\n\"The (IS) group's strategy to establish an Islamic caliphate poses a threat not only to Afghanistan but also to the neighboring countries,\" Russian Defense Minister Sergei Shoigu said.\n———\nAssociated Press writer Kathy Gannon in Islamabad contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "IS claims it's taken bin Laden's Afghan hideout of Tora Bora",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/claims-bin-ladens-afghan-hideout-tora-bora-48049503"
}