{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 23:05:15+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Georgia lawmakers focus on adoption code, curbing opioids",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fgeorgia-lawmakers-focus-adoption-code-curbing-opioids-52815768.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_b9e9ce7af15846a091faa23ce173f22c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Much like last year, recent activity in the Georgia legislature has centered on revamping the state's adoption code.\nBut that's not all they have on their agenda. Combatting the opioid crisis, allowing earlier Sunday alcohol sales and addressing rising incidences of distracted driving are all measures that are being considered this session.\nHere's a look at some of the recent major activity and what's coming up when lawmakers return to the Capitol on Monday:\n———\nADOPTION LAW UPDATE\nSpeeding up the state's adoption process has been a top priority for many lawmakers this session, who saw their efforts derailed last spring over a controversial amendment that would have allowed people to cite their religious beliefs and refuse to give children to LGBT couples. On Thursday, the House unanimously passed a sweeping revamp of the adoption code, which awaits Senate debate.\nUnlike last year, no \"religious exemption\" elements are a part of the measure. The current 1990 adoption law had been written before the internet was widely used, causing current procedures to be much slower than other states' processes.\nBut even if the measure passes the Senate, the adoption issue could still be in play. Sen. William Ligon has introduced a bill to add \"religious exemption\" language to the adoption code. Ligon says the bill has significant Republican support, even though Gov. Nathan Deal and House Speaker David Ralston, R-Blue Ridge, criticized the position last year.\n———\nCOMBATING OPIOIDS\nIn previous sessions, Georgia lawmakers have addressed the \"supply side\" of the state's opioid epidemic by passing laws to curb the overprescribing of highly addictive painkillers. Now, Sen. Renee Unterman, R-Buford, wants to focus attention on helping those who struggle with addiction.\nA Senate committee on Thursday passed Unterman's proposal to hire a director of substance abuse who will lead a group to study the issue and also consider whether or not to recommend Medicaid waivers to treat opioid abuse.\n———\nSUNDAY ALCOHOL SALES\nA bill to allow Sunday alcohol sales to occur as early as 11 a.m. was approved 6-4 by a Senate committee Tuesday. Once dubbed the \"brunch bill,\" because of its focus on restaurant sales, the proposal was expanded to allow retail stores to sell alcohol at an earlier hour. The last-minute change angered Senate Majority Leader Bill Cowsert, R-Athens, who voted against the bill and expressed frustration over the widening scope of the measure.\nUnder current law, private businesses cannot sell alcohol until 12:30 p.m. on Sundays. If the bill passes, earlier sales would have to be approved in a referendum on the local level.\n———\nTHE 'LITTLE BUDGET'\nA Georgia House committee on Wednesday quickly approved Gov. Nathan Deal's proposal to add more than $300 million in state funds to address gaps that are emerging in the final months of the fiscal year, which ends June 30. The money is largely geared toward education funding. If the House and Senate pass the bill, the legislature can then begin focusing on debating the governor's budget recommendations for the upcoming fiscal year.\n———\nANONYMOUS WINNERS\nA bipartisan bill to allow Georgia lottery winners to remain anonymous passed its first hurdle Wednesday and now awaits a Senate vote.\nCurrently the Georgia Lottery Corporation is required to release certain information about winners including their name and hometown. The proposed bill would allow winners to remain anonymous only if they request it and pay up to 4 percent of their winnings to the lottery.\n———\nON THE AGENDA\nLawmakers return to the Capitol on Monday. That afternoon, a House committee will consider whether to require drivers to use hands-free cellphone technology. Proponents of the bill say distracted driving has become a scourge in Georgia and has led to a spike in accidents, fatalities and the nation's highest auto insurance premiums.\nMeasures that could be debated on the Senate floor next week include the House-backed adoption bill, as well as a proposal to require the state government to communicate only in English. Making up just over one-third in each chamber, Democrats have been vocal in their opposition to the English-only resolution. The constitutional amendment requires a two-thirds vote in each chamber and the approval of voters in an election.",
    "source_domain": "abcnews.go.com",
    "title": "Georgia lawmakers focus on adoption code, curbing opioids",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/georgia-lawmakers-focus-adoption-code-curbing-opioids-52815768"
}