{
    "authors": [
        "Abc News",
        "More Adam"
    ],
    "date_download": "2017-12-11 22:04:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The president promised to \"restore American leadership in space.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-tells-nasa-send-astronauts-back-moon-directive%2Fstory%3Fid%3D51725061.json",
    "image_url": "http://a.abcnews.com/images/Politics/trump-space-gty-rc-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As he signed a policy directive Monday intended to \"refocus the space program on human exploration and discovery,\" President Donald Trump instructed NASA to return American astronauts to the moon, alluded to an \"eventual mission to Mars\" and promised to \"restore American leadership in space.\"\nFlanked by NASA leadership and three astronauts, including former Sen. Jack Schmitt, one of the most recent men to have walked on the moon, Trump described the directive, portraying space exploration as an encapsulation of America's \"pioneering spirit.\"\n\"Today, the same spirit beckons us to begin new journeys of exploration and discovery, to lift our eyes all of the way up to the heavens and once again imagine the possibilities waiting in those big, beautiful stars if we dare to dream big and that's what our country is doing again,\" he said. \"We're dreaming big.\"\nEchoing astronaut Neil Armstrong's first words upon stepping foot on the moon's surface in 1969, the president called the directive -- which codifies instructions that NASA \"return American astronauts to the moon\" as \"national policy,\" according to Vice President Mike Pence -- a \"giant step\" toward an \"inspiring future.\"\nBoth Trump and Pence further argued that investment in the space program would lead to increased job creation, innovation and military applications.\nIn a release noting highlights of the administration's space policy, the White House said Trump would \"create incentives for private industry\" to assist in pursuing its goals of exploration and the development of new technology.",
    "source_domain": "abcnews.go.com",
    "title": "Trump tells NASA to send astronauts back to the moon in new directive",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-tells-nasa-send-astronauts-back-moon-directive/story?id=51725061"
}