{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:10:50+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Amna Nawaz talks to LearnVest's Stephany Kirkpatrick to get the best tax-saving tips ahead of Tax Day.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2Fvideo%2Fspring-cleaning-finances-46845466.json",
    "image_url": "http://a.abcnews.com/images/Business/170417_gostream_finances_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for A spring cleaning for your finances\nHey guys I'm on the to not live in New York while tax day is upon us he had a rough time. You're not certain how the to get ready for next year and also just get your finances in order. Here to walk a few holidays Stephanie Kirk Patrick the vice president of product and financial advice strategy at bat and an expert how riveting the great with Keogh financial advice strategy as it is a strategy you have to announce he's got to have a plan have to work specifically for you and your household. We're gonna personally. It we should point out URS CFP the two certified financial planner and an eight I asked an accredited investment fiduciary but in other words you know. And that's important an independent I its interest about bio and I think that's really critical so let's talk about some tests were dealing with the fallout from the taxi and I think I'll advocate that may have been disastrous for some folks. You've got tips for people to get ready for next year the first going paperless seems half the X ray but people don't. The times that we there's something about the basic Audi of paper that a lot of cluster of apartment so do yourself a favor and start setting up online access answers during key documents things that are important that you retain your every here. And shred the rest doubts about her copy around. Don't risk having that Al cabinet summary Q and when he needed. Make late eazy. Well citizen beginning financial. Cleaning a personal and it ultimately depends on your income schedule. Your school schedule and different benefits and captured employer or otherwise to unity the specific things that work for you at every time so you're some examples open enrollment. If your Saturday contributing to fox the spending account is a great way to decrease taxable income he had used those dollars for everyday expenses medical bills. Penalties have over the counter medication. Now each about fines up at a slightly different type in here typically enough off. You can schedule things like fat US special things like borrowing pay increase. Certain companies what you do it every paycheck sometimes only on techniques a year that's about it on the calendar but kind of heat your. And how to that you don't forget about adjournment people actually make an accident just let you schedule your doctors applied in daily life I reminder popping up and found and it's time to do acts that I could thirty minutes of my calendar to get fat diet. Keep ticket that it think he receipts what is it you eat what you said. Still hey you know keep keep keep Kennedy thinks that you know you're gonna either need to do you reimbursements content so for me. You know any travel expenses. Or anything that you might be getting reimbursed for the owner of property and you're gonna take tax deduction. On any expenses. And that having incoming email on that property. So you have to repair every few Hedrick a commissioner on a rental property that might make sense in our everyday lives intensity things that will be tax deductible. If you're filing an itemized tax return him. See Ricky track and medical expenses and keep track of bills for home office expenditures even your self employed in particular. Should keep your really care sidetrack a lot of proceeds sells last to come to this tax even if you're lucky to be getting a refund this year. High heat on that it is a great question fair where big believers are in past spend a little have a little fun I'm to take 10%. Where the three times bigger small paper for everybody I'm take 10% decent and ash. Take your kids I took something treat yourself when he went for trip that you're planning to take whatever it is you an idea. Ticker meaning 90% and her jewels. And think about the Q3. Increase retirement savings river when the tax benefit for most especially if it's pretax dollars. I'm but it's a great boon to what we know what's coming in the future. Number two emergency savings how many times he had a moment and you look for the cash and it's not fair is a great way to fill the coffers quickly. Other tax benefits he can see for would be can't see you soon a lot of states states. I'm you'll find attacks that action at the local level or at the sea level and you can see 32 weeks on here we're thinking a lot about. Can't even I don't actually got to ratchet and disagree but integrated Internet age and also get a tax benefit absolutely. Do you plan again for next year and general financial tips because these help you with your taxes and that life. In general this passing the creation of an ice older because an estimate about our hurt so much about putting ice contacts in your cell right Batiste in place full detail with Jack. Certain contact with him and that can be called in case emergency rate human case of emergencies only helpful. They can actually stop emergence. Had to show. I would financial staff think about all the big. Insurance policies life insurance car insurance homeowners. Umbrella policies. There'll probably from different company they're all probably. For different thing. And you are probably the person who knows where are at an even. Where credit card bills paid we need your mortgaged. Things that if you pass it for centered time that short somebody else might now. Associate he's he had to households patents for Hendrick consolidate and one person. Usually. Douglas of the things that's happening in the house and the other person just trust that it's going to give a couple of people access to Ike's document. I recommended digital copy about her copy just in case yet Tennessee. Locked drawer and yet so it's safe seats in the house or it sounds old fashioned deposit boxes but for murder bank's excellent thing and for the right kind of documents and you probably copy and copy your passport. Q. Brahimi she goes back to. You like other people of it's. We spent much time thinking about how to prepare by greatly insurance are seeing her retirement. Just a regular checking account actually doctor Evelyn that. But he can go to how recently tactic. Have you had kids if you buy and beneficiaries are married or divorce has something changed. The question is usually. Done by and that we recommend doing it right you're just quick check. Maginnis is back here and calendar schedule it set thirty minutes outside today have a cup of coffee. The patent review our beneficiaries and automatic scene and Seoul Korea a but most people. I don't know why that a lot of people don't and it's. So couple weeks easily start it picture inflated and where Reid irregular paychecks. Change your pop it. If you're saving fifty or 500 or 5000 dollars a month for something. That's going and automatically systematically. Touching absolutely. Absolutely 98 separate bank account they had my checking account think America and you have my high yield savings account summer I'll go look for the ones the pain in the past three. And look at online inks that African border costly typically are the best option for accuracy. And an out of sight out of mind. But that quickly actually. For humanity. And I think it's harder just because it requires twenty minutes of independent minute but it. Just organizing in general but your wallet in particular you think people need to tidy up their wallets what do I lose every day can quality enormous because of her bitter about it so what do we need an Aqua. Let me make public commitment because I care a lot of moms staffer on your statement baggage Cuddy my downsized and while it may take out to credit cards and just in case values and American Express. Please take that's a have a back occurred at about my data card. I don't take a little bit of cash drivers like some health insurance card that's it that's it the basics. Pat sits a small Eiffel Pakistani man attempts at my quarters straight. But it that is you can do a lot of things about the cash. And eight assists in deep Rex crates of personally wanted to simplify the number credit her Jennifer I for me and once feared her closing at least one card except for your orbits where your credit history remains. Oh that's key to keep filling it up along he's the one problem gets to simplify that while you can keep credit cards home. That are meaty for specific things like international travel over mountain baton but if you lose your wallet. They're 5610. To connect partner units are Kurds. Who've gone. Who it's gone on its financial literacy. And why we celebrate. It. What do we need to that we used and it's great study about how people talk about finding it money and talk about the what do you know let out a very personal. You have to talk to someone you trust so if you're looking for her. You know trust a precaution financial service speaks in her people on the streets of the connection and what you ask. Patti you know if this is the right person to greet questions or start looking them up on lines continue I'm checks in finger and broke her track you can look at their statistics. A look at their credentials and you can fines for safety towns and professionalism. That which are so ultimately looking forest demon personal connection. I'm you want to connect with some money can be honest which we seek financing any victory I need to know everything get financially naked that's it there. I don't have a deep tells us how fact and at a place where you feel that you're not can be touched consumers can talk to you and we he panders and because there's a lot of lingo in terms. It's also partner pat downing family if you have kids there to greet opportunity Gottesman in and what are taxes. Where they come from what's going on your household financially and usher simply think so that young kids can get started earlier. You know 46% of Americans are talking their kids PCs with about money the first acts. All pretty remember when I think about it. The topics I besides taxes as a concept isn't tough for kids it's not something heart than to get their heads around I think it has the tight your project so let's take a couple of easy ways yes the basics and they mean understand. For about even money transfer to talk about and come right and explain that. Taxes are part of how we earn our income they're part of how we pay for certain things that house tax or property tax or income tax or gift tax and there's many other kinds rate. Sales tax tends to be the thing that kids can. If you associate with something in the air like they're probably not open yet to be earning money at your how to talk but when you're behind their bare without it. Where they're getting old Allen right and fair pay. To that and they understand at least would attack you. And it looks pretty opportunities in every day life. Don't sit on the table and try to explain it just about the fire hydrant the police officer on the corner a fire department. Where does our money go school paper things that they're very familiar with. That's your tax dollars are used in the east into the desert dry pero to me connection yet. And what about with your your spouse your partner someone if you aren't on the same page. Is currently on the same pitch there is it but again I think he would not everyone starts fair and not every went in there perfectly. But what is important is being what's the down and talk to each other be obsessed. San that in the tyrant like me specialists that I would include one. Got things aren't up. And atmospheric. One day. I don't think that Christ or don't start with that statement I want I feel like you know skip their purse and you normally. What would you like or hit a compliment I've noticed that you're very cat that evening at a time as guide what do you think regular. Start from the face of humbled and it tends development that's just good relationship that I think it probably. Seven acre back when it that there waiting to keep in mind I would stay organized. Top city house and appreciate the fact that you had. Control taking advantage of being attacked many dollars. I think a lot of we're expecting a lot. You can't they enjoy and information I feel like it's they're really fun topic in ten months and to be a share certificate. Thank you for being my president looking at a they've got it in economically it's not important or organize your wallet they hear from more on the that the act.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "A spring cleaning for your finances",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/video/spring-cleaning-finances-46845466"
}