{
    "authors": [
        "Abc News",
        "Eric Noll",
        "Esther Castillejo",
        "More Enjoli"
    ],
    "date_download": "2018-02-03 13:57:38+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "These Made in America companies are helping the Super Bowl and the festivities around it get off to a great and warm start.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmade-america-takes-super-bowl-lii%2Fstory%3Fid%3D52772563.json",
    "image_url": "http://abcnews.go.com/Sports/made-america-takes-super-bowl-lii/story?id=52772563",
    "language": "en",
    "localpath": null,
    "maintext": "There's just 48 hours before the New England Patriots and Philadelphia Eagles square off at Super Bowl LII in Minneapolis, Minnesota, but for these U.S. workers, whose companies are helping get game day and the festivities around it off the ground, every day is a winner.\nSportsfield Specialties\nThe company produces goal posts and other sporting goods, and has been around since 1998. The company employs about 100 people, who weld, shape and paint about 1,000 goal posts a year in Delhi, New York. Sportsfield Specialties also has 50 workers in Salisbury, North Carolina, at its netting and wall-pad manufacturing facility.\nThis will be the seventh time its goal posts will be in the Super Bowl and the materials for the goal posts come from all over the U.S.\nTurf Nation\nTurf Nation is located in Dalton, Georgia, and makes synthetic turf systems. According to Turf Nation, 14 of the 32 NFL franchises play or practice on a turf system produced by the company. And on Sunday, the company will celebrate its fourth NFL Super Bowl in the last six years.\n\"All components of a Turf Nation synthetic turf system are proudly manufactured in the U.S.A. and each surface is custom-designed to a team's or school's specific needs,\" Turf Nation said in a news release. \"All synthetic turf surfaces are field-tested by an independent laboratory prior to shipping.\"\nTurf Nation employs more than 80 workers around the U.S. and makes its turf system out of the same material used in plastic bottles and garbage bags. Last year, the company produced more than 10 million square feet of turf.\nTurf Nation employs more than 80 workers around the U.S. and makes its turf system out of the same material used in plastic bottles and garbage bags. Last year, the company produced more than 10 million square feet of turf.\nWeatherTech\nThe workers at WeatherTech, which makes vehicle accessories such as floor mats and window deflectors, are hard at work this year for their fifth consecutive Super Bowl ad.\nThe ad shows employees building a brand-new factory in Boolingbrook, Illinois, right outside Chicago. WeatherTech told ABC News that the company now employs nearly 2,000 people.\nLove Your Melon\nAnd finally, as fans touch down in Minneapolis this week for the big game, 10,000 volunteers will be around town greeting them. Love Your Melon's purple hats will help keep many of them warm.\nThe company in Minneapolis employs 200 workers, who have collectively stitched more than 1 million hats a year.\n\"It gives everyone here at home a good sense of pride and the ability to say, 'Hey, I made this,'\" production manager Kelsey Nelsen said.\nHalf of every Love Your Melon sale goes to cancer research and support programs as well. Workers also visit hospitals across the U.S., donating hats and their time to children fighting cancer.\n\"It's keeping jobs right here in our country and we're just really proud of that,\" Linsey Johnson said.",
    "source_domain": "abcnews.go.com",
    "title": "Made in America takes on Super Bowl LII",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/made-america-takes-super-bowl-lii/story?id=52772563"
}