{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-05-30 16:55:32+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Here’s one side effect Roseanne Barr may not have expected from linking her racist tweet to Ambien: snark from the drug’s manufacturer.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fambien-maker-sanofi-aventis-blasts-roseanne-barr-racism%2Fstory%3Fid%3D55532053.json",
    "image_url": "https://s.abcnews.com/images/US/ambien-gty-er-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Here’s one side effect Roseanne Barr may not have expected from linking her racist tweet to Ambien: snark from the drug’s manufacturer.\nInterested in Roseanne? Add Roseanne as an interest to stay up to date on the latest Roseanne news, video, and analysis from ABC News. Add Interest\nDisney’s ABC canceled the comedian’s eponymous sitcom Tuesday after she posted a tweet comparing a onetime adviser for former President Barack Obama to an ape, later apologizing in multiple tweets that included a reference to her apparent use of the prescription sleep aid.\nIn one of the now-deleted tweets that Barr posted in the wake of her show's cancelation, she wrote that \"it was 2 in the morning and I was ambien tweeting,\" while in another she wrote that she was \"not giving excuses for what I did(tweeted) but I've done weird stuff while on ambien- cracked eggs on the wall at 2am etc.\"\nABC via Getty Images\nThe patent for Ambien, formally known as zolpidem, is held by French pharmaceutical company Sanofi-Aventis, which had something to say about Roseanne’s tying the drug to the scandal.\n\"People of all races, religions and nationalities work at Sanofi every day to improve the lives of people around the world. While all pharmaceutical treatments have side effects, racism is not a known side effect of any Sanofi medication,\" the company wrote in a tweet.\nPeople of all races, religions and nationalities work at Sanofi every day to improve the lives of people around the world. While all pharmaceutical treatments have side effects, racism is not a known side effect of any Sanofi medication. — Sanofi US (@SanofiUS) May 30, 2018\nDizziness is listed as a possible side effect, as well as daytime drowsiness, according to WebMD. Memory loss, mood and behavioral changes including depression hallucinations, confusion and aggressive behavior are also listed among the unlikely but possible side effects.\nABC News is a division of the Walt Disney Co.",
    "source_domain": "abcnews.go.com",
    "title": "Ambien maker Sanofi-Aventis blasts Roseanne Barr: 'Racism is not a known side effect'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/ambien-maker-sanofi-aventis-blasts-roseanne-barr-racism/story?id=55532053"
}