{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:58:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Pacers' Paul George to Lance Stephenson after loss: 'Body language has to improve'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fpacers-paul-george-lance-stephenson-loss-body-language%2Fstory%3Fid%3D46855207.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170418_NBA_Paul_George_on_Lance_Stephenson_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CLEVELAND -- After another excruciating loss in which the Indiana Pacers nearly came all the way back from a late double-digit deficit before succumbing to the Cleveland Cavaliers, Paul George had blunt criticism for more of his teammates.\nIn the Pacers' Game 1 loss to the Cavs, it was CJ Miles whom George called out for missing a potential game-winning jumper. That led George to declare, \"In situations like that, I got to get the last shot. I was asking for it. CJ took it upon himself.\"\nFollowing Indiana's 117-111 loss Monday to fall down 0-2 in their first-round series with the Cavs, George aimed at both Lance Stephenson and Myles Turner.\nStephenson -- signed to a three-year deal late in the regular season and a major reason Indiana is in the postseason in the first place, with the Pacers going 6-1 after he was added to the team -- had a plus/minus of minus-7 in five minutes in the third quarter when Cleveland took control of the game.\n\"He's got to learn to control himself and be in the moment,\" George said. \"Lance, in our locker room, is looked upon as a leader. His body language has to improve -- just for the team. We all know that Lance is an emotional guy. A lot of it is his heart and his competitiveness. That emotion comes out of him. He's got to channel that toward making effort plays on the court and doing whatever he needs for us to succeed.\"\nWith the Pacers going small in the third quarter, Cleveland targeted Kevin Love in the post against the combustible Stephenson. Love scored time and time again, with Stephenson picking up three fouls and at one point slamming the ball to the floor in frustration following a whistle against him.\nPacers coach Nate McMillan blamed Indiana's team defense for Love's going off.\n\"I think we put Paul on Kyrie [Irving], and Lance went to Love,\" McMillan said. \"They do a great job of recognizing matchups and taking advantage of it. I thought that was huge. Defensively, we just didn't play that right. The reason for it was just trying to get control of Kyrie by putting [a] bigger defender on him. We had to try to deny entry to anyone who was in the post, but we really did a bad job of allowing Love to catch it. We didn't work to deny or front that post shot.\"\nStill, Stephenson's final line was impressive, as he finished with 13 points, two rebounds, four assists and two steals in 26 minutes. He had 16 points, seven rebounds and three assists in 27 minutes in Game 1.\nGeorge also wanted to see more out of Turner, the Pacers' second-year center, who finished with six points on 3-for-10 shooting, five rebounds and three blocks in Game 2 after averaging 14.5 points, 7.3 rebounds and 2.1 blocks per game in the regular season.\n\"We just need him to challenge Tristan [Thompson], keep him off the boards,\" George said of the 21-year-old Turner. \"He needs to make himself available down low in the post. He needs to know at this point he has to take it to the next level. We'll continue to work with him.\n\"I've been in his ear all the way up until this point -- you know, that next step. And growth for him. In this league, you've got to find it. He's still young. He's still learning, so it's a good thing. We're going to work with him.\"\nGeorge led Indiana in points (32), rebounds (8) and assists (7) on Monday, which brought his series averages to 30.5 points, 6.5 rebounds and 7.0 assists while he shot 48.7 percent from the field and 55.6 percent from 3.",
    "source_domain": "abcnews.go.com",
    "title": "Pacers' Paul George to Lance Stephenson after loss: 'Body language has to improve'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/pacers-paul-george-lance-stephenson-loss-body-language/story?id=46855207"
}