{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 15:13:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Vietnam fires senior Communist Party official for misconduct",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fvietnam-fires-senior-communist-party-official-corruption-50323237.json",
    "image_url": "http://abcnews.go.com/International/wireStory/vietnam-fires-senior-communist-party-official-corruption-50323237",
    "language": "en",
    "localpath": null,
    "maintext": "Vietnam's ruling Communist Party has fired the party boss of the central city of Danang, the site of next month's Asia Pacific summit, which U.S. President Donald Trump is expected to attend.\nThe government said in a statement Friday that the party's elite Central Committee dismissed Nguyen Xuan Anh as city party secretary and removed him from the Central Committee for serious violations of party rules and failing to set an example as a senior party official.\n\"The violations, mistakes of comrade Nguyen Xuan Anh are serious, negatively impacted the prestige of the party's organization and individuals, causing anger among the cadres, party members and the people,\" it said.\nThe party's inspection committee said last month that Anh had violated party rules and used a car and two houses belonging to private businesses, and disciplinary measures against him were needed. The committee also issued a warning to city Mayor Huynh Duc Tho for mismanagement.\nAt age 39, Anh was one of the two youngest people elected to the 180-member Central Committee at a party congress last year and was appointed party secretary of Danang, a dynamic city which is popular among tourists for its white sand beaches and is near the ancient town of Hoi An and Cham temple ruins.\nDanang will host the 21-nation Asia Pacific Economic Cooperation summit in the second week of November, which Trump, Russian President Vladimir Putin and Chinese President Xi Jinping are expected to attend.\nMinister Mai Tien Dung, head of the Government Office, told state media earlier this week that the disciplinary measures against Danang's two top leaders would not affect the hosting of APEC, the country's most important international gathering this year.\nIn May, the party fired Dinh La Thang as party chief of the southern commercial hub of Ho Chi Minh City and removed him from the all-powerful Politburo for mismanagement during his time as chairman of the board of state energy giant PetroVietnam. Thang, however, retained his central committee membership and was appointed deputy head of the party's economic committee.\nThe party has stepped up its anti-corruption drive, jailing or arresting dozens of senior officials and executives.",
    "source_domain": "abcnews.go.com",
    "title": "Vietnam fires senior Communist Party official for misconduct",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/vietnam-fires-senior-communist-party-official-corruption-50323237"
}