{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 13:23:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "10 Things to Know for Today",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2F10-things-today-44509305.json",
    "image_url": "http://abcnews.go.com/US/wireStory/10-things-today-44509305",
    "language": "en",
    "localpath": null,
    "maintext": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:\n1. ISLAMIC STATE GROUP CLAIMS ATTACK ON ISTANBUL NIGHTCLUB\nIt is reportedly carried out in \"revenge for God's religion and in response to the orders\" of IS leader Abu Bakr al-Baghdadi.\n2. FOR WHOM THE 1980S STILL HOLD RELEVANCE\nMany of Donald Trump's cultural touchstones — those he'd frequently namedrop at campaign rallies and on Twitter — were at their peak in the 1980s.\n3. OBAMA IN CLOSING STRETCH OF PRESIDENCY\nHis final days in office will be consumed by a bid to protect his health care law, a farewell speech and the ongoing handover of power to Trump.\n4. MEDICARE LAUNCHES REVAMP FOR HEART ATTACKS, HIP FRACTURES\nThe goal of new approaches is to encourage coordination that promotes quality and contains costs.\n5. WHERE CHILDREN STARVE AS WAR DRAGS ON\nYemen's children are dying of malnutrition as a conflict and a blockade imposed by a Saudi-led coalition cause food prices to soar in the Arab world's poorest nation.\n6. WHO SEEKS TO PULL POT SHOPS OUT OF BANKING LIMBO\nMassachusetts U.S. Sen. Elizabeth Warren is leading an effort to make sure vendors working with marijuana businesses don't have their banking services taken away.\n7. ARMLESS SYRIAN BOY THRIVES IN THE U.S.\nAhmad Alkhalaf finds a new life in Massachusetts but isn't sure whether he'll be reunited with his family anytime soon.\n8. CHINA STARTS 2017 ENGULFED BY SMOG\nAuthorities in Beijing and other cities across the nation delay dozens of flights and close highways.\n9. DICK CLARK PRODUCTIONS REJECTS MARIAH CAREY'S SABOTAGE CLAIM\nThe productions firm is hitting back against the singer's claim it sabotaged her live performance on its \"New Year's Rockin' Eve\" special, saying that's \"absurd.\"\n10. KELLY, MCCOY, BAALKE LATEST TO FEEL THE NFL AX\nMore moves could be coming, too. Is Chuck Pagano safe in Indianapolis? Might the Saints do something with Sean Payton?",
    "source_domain": "abcnews.go.com",
    "title": "10 Things to Know for Today",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/10-things-today-44509305"
}