{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 10:49:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Britain's prime minister to seek early election on June 8",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fuk-election-talk-builds-ahead-surprise-statement-46856816.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_f94ad9efd9034333932bb3a0a1f40911_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In a shock announcement, Prime Minister Theresa May on Tuesday called for an early general election to be held June 8 to seek a strong mandate as she negotiates Britain's exit from the European Union.\nStanding outside 10 Downing Street, May said she would ask the House of Commons on Wednesday to back her call for an election, three years before the next scheduled date in May 2020.\nShe said that since Britons voted to leave the EU in June, the country had come together, but politicians had not. She said the political divisions \"risk our ability to make a success of Brexit.\"\nAt present, May's governing Conservatives have 330 seats in the 650-seat House of Commons. May said that \"our opponents believe that because the government's majority is so small, our resolve will weaken and that they can force us to change course\" on leaving the EU.\n\"They are wrong,\" she said. \"They underestimate our determination to get the job done and I am not prepared to let them endanger the security of millions of working people across the country.\"\nUnder Britain's Fixed-Term Parliaments Act, elections are held every five years, but the prime minister can call a snap election if two-thirds of lawmakers vote for it.\nThe leader of the main opposition Labour Party, Jeremy Corbyn, has previously said he would back such a call.\nMay took office in July after predecessor David Cameron stepped down following his failed attempt to get voters to back remaining in the EU. Since then she has ruled out calling an early election to get her own mandate. But she said Tuesday she had \"reluctantly\" changed her mind.\nPolls give May's Conservatives a double-digit lead on Labour, which is divided under left-wing leader Corbyn.\nThe pound rose 0.1 percent against the U.S. dollar after the announcement, to 1.257, recovering from a 0.4 percent drop an hour earlier.",
    "source_domain": "abcnews.go.com",
    "title": "Britain's prime minister to seek early election on June 8",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/uk-election-talk-builds-ahead-surprise-statement-46856816"
}