{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:04:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcalifornians-request-plastic-straws-eateries-55548590.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_e5df954a507049bc88c9642eb2f59edb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sit-down restaurants in California may soon stop automatically providing disposable plastic straws with drinks unless customers request them.\nThe state Assembly advanced a bill Wednesday that would require dine-in restaurants provide single-use plastic straws only upon request.\nPlastic straws contribute to the buildup of trash in the oceans, a major environmental and public health problem, Assemblyman Ian Calderon said. Fish and whales ingest plastic particulate, which can kill them or cause plastic to enter the human food supply when marine animals that have eaten plastic are consumed by people, he said. The Whittier Democrat described his bill as a \"small step, but in the right direction.\"\nAssemblyman Matthew Harper opposed the bill, saying it will make it harder for restaurants to do business in California. The Huntington Beach Republican said instead of passing a law regulating restaurants, the Legislature should impose harsher punishments for people who litter.\nRestaurants would be warned for first and second violations and fined $25 per day for subsequent violations, with an annual fine limit of $300.\nThe bill, AB1884, passed 45-17. It still requires approval from the state Senate and governor before it can become law.",
    "source_domain": "abcnews.go.com",
    "title": "Californians may have to request plastic straws at eateries",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/wireStory/californians-request-plastic-straws-eateries-55548590"
}