{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:28:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fsmallville-actress-granted-bail-nxivm-case-54700831.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/WireAP_a449966e46e3430290d9d3f1250752d2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Allison Mack, the TV actress who starred in The CW network's \"Smallville,\" was bailed out of jail on Tuesday and met with a chaotic scene outside a courthouse where she's charged with helping recruit women as sex slaves for the leader of a self-improvement group in upstate New York.\nA federal judge in Brooklyn agreed to release Mack, who was arrested last week, on $5 million bond and place her under home detention in California. She'll be living with her parents at their home in Los Alamitos as she awaits trial.\nMack, 35, appeared in tan jail smocks for a brief court appearance. She only spoke to answer \"yes\" when the judge asked her if she understood the bail conditions.\nAmong those conditions: No contact with current or former members of the secretive group known as NXIVM. She'll also be subject to electronic monitoring and restrictions on computer and cellphone use.\nBy the time Mack left the courthouse more than two hours later, she had switched into a jean jacket, gray slacks and sneakers. She stared straight ahead in silence as she and her lawyers fought through a media scrum to a waiting car, with at least three photographers tripping over each other and toppling to the sidewalk along the way.\nThe actress played Chloe Sullivan, a teenage friend of Superman, on \"Smallville.\" Since that series ended in 2011, she has played only minor roles.\nProsecutors said she helped recruit women for NXIVM leader Keith Raniere by telling them that they were joining a purported female mentorship group, prosecutors said. Instead, the victims \"were exploited, both sexually and for their labor,\" and even branded with Raniere's initials, prosecutors said.\nFederal authorities raided a residence near Albany where NXIVM was headquartered in March. The organization also ran programs in Mexico.\nRaniere, 57, was arrested in Mexico, brought to the U.S. on March 26 and is being held without bail in Brooklyn on sex-trafficking charges.\nAt the time of Raniere's capture, Mack was living with him at a luxury villa in Puerto Vallarta, according to court papers.",
    "source_domain": "abcnews.go.com",
    "title": "'Smallville' actress granted bail in alleged sex cult case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/smallville-actress-granted-bail-nxivm-case-54700831"
}