{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:20:55+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Fudoka-azubuike-return-jayhawks-bypass-nba-draft%2Fstory%3Fid%3D55536770.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kansas big man Udoka Azubuike will withdraw from the NBA draft and return for his junior season with the Jayhawks, the school announced Wednesday.\nThe 7-foot center, who averaged 13.0 points and 7.0 rebounds last season, was considered a likely second-round pick by most NBA executives.\n\"I received good feedback from many sources around the NBA over the last month but in the end, after discussing with my family and coaches, we decided it would be in my best interest to return to Kansas for my junior year,\" Azubuike said.\nHis return helps bolster a Jayhawks team that should enter next season as a Final Four contender despite losing its top three scorers -- Devonte Graham, Svi Mykhailiuk and Malik Newman -- and four of its top five players.\nKansas adds transfers Dedric Lawson and K.J. Lawson, as well as a stellar freshman class led by McDonald's All American guards Devon Dotson and Quentin Grimes.\n\"We're all very excited about Udoka making the decision to return for his junior year,\" Kansas coach Bill Self said. \"We supported him declaring and investigating, which I think was a smart move. It was certainly a move that was handled exactly as the rule was intended.\n\"He wanted to find out more information on what the NBA franchises thought of him, and he was able to accomplish that in many ways. The feedback that he got and that we received was that he's definitely improved, and NBA personnel think very favorably of him.\"\nThe Jayhawks also bring back Marcus Garrett, Silvio De Sousa and Mitch Lightfoot from last year's team.",
    "source_domain": "abcnews.go.com",
    "title": "Udoka Azubuike to return to Jayhawks, bypass NBA draft",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/udoka-azubuike-return-jayhawks-bypass-nba-draft/story?id=55536770"
}