{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:53:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The Latest: 2 of 3 men slain at race track shot twice",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-police-seek-witnesses-race-track-killings-49203517.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_938d330a95c14bc8acb180cc2c8da7f9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the shooting at a southern Wisconsin race track that left three men dead (all times local):\n1:45 p.m.\nThe sheriff heading the investigation into the slayings of three Illinois men at a southern Wisconsin race track says a gunman shot two of the victims, followed the third as he tried to run away and shot him, then returned to the other two and shot them a second time.\nAt a news conference outside the Great Lakes Dragaway near Union Grove, Kenosha County Sheriff David Beth said Monday the man who killed the three Sunday night is still at large.\nBeth says the three victims are gang members from in and around Aurora, Illinois. Beth says he doesn't yet know what motivated the shooting, which were done point blank at close range in a concession area in the parking lot of the raceway where some 15,000 people had gathered for a car show and drag race.\nThe sheriff says a pistol was used in the shooting, which has not been recovered.\nUnion Grove is about 25 miles (40 kilometers) south of Milwaukee.\n———\n11:50 a.m.\nThe sheriff heading the investigation into the fatal shooting of three Illinois men at a southern Wisconsin race track says detectives are being stymied by a lack of cooperation from family members and others involved in the case.\nKenosha County Sheriff David Beth, speaking on WTMJ-AM Monday, says that's making it more difficult to find the person responsible for the slayings. Beth says the shooter approached the men near a food vendor in the parking lot of the Great Lakes Dragaway Sunday about 7 p.m., identified them as the people that he was looking for, then shot them each at point blank range and took off running.\nAs many as 5,000 people were attending Larry's Fun Fest at the raceway when the shots were fired. Authorities have not identified the victims, but say they are known gang members from in and around Aurora, Illinois.\nThe sheriff planned a news conference for 1 p.m. Monday.\n———\n8:50 a.m.\nSheriff's officials investigating the fatal shooting of three Illinois men at a southern Wisconsin race track say the slayings may have been gang related.\nKenosha County sheriff's Sgt. Mark Malecki said Monday that the victims were known gang members from the Aurora area. He says the man shot them at point-blank range at the Great Lakes Dragaway near Union Grove Sunday night.\nMalecki says investigators are looking into the possibility that the shooter is from a rival gang.\nThe shootings happened near a concession stand in a parking lot about 7 p.m. As many as 5,000 people had gathered at the speedway for Larry's Fun Fest, a car show and drag race.\nTwo of the men died at the scene and the third died on the way to the hospital.\nUnion Grove is about 25 miles (40 kilometers) south of Milwaukee.\n———\n7 a.m.\nSheriff's officials are encouraging anyone who witnessed the fatal shooting of three men at a southern Wisconsin race track to contact authorities.\nKenosha County Sheriff David Beth says there may be witnesses who initially hesitated to talk to deputies at the Great Lakes Dragaway in Union Grove Sunday night, but now may be willing to share information.\nAuthorities say the man who shot the three men at point-blank range is still at large. Beth says the shooting happened in a parking lot concession area about 7 p.m. Two men died at the scene, and the third died en route to a hospital. The sheriff says at least two of the men were from Aurora, Illinois.\nUnion Grove is about 25 miles (40 kilometers) south of Milwaukee.\n———\n12:41 a.m.\nA Wisconsin sheriff says three men were shot and killed during an auto racing event.\nKenosha County Sheriff David Beth says authorities responded to the Great Lakes Dragaway in Union Grove around 7 p.m. Sunday after receiving reports about shots being fired.\nBeth says the three men were shot by another man at point-blank range near a food vendor. No suspects have been arrested.\nTwo men died at the scene, and the third died while being transported to a hospital. The sheriff says at least two of the men were from Aurora, Illinois.\nThe sheriff's office estimated that more than 5,000 people were at the raceway for an event known as \"Larry's Fun Fest.\"\nUnion Grove is about 25 miles (40 kilometers) south of Milwaukee.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: 2 of 3 men slain at race track shot twice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-police-seek-witnesses-race-track-killings-49203517"
}