{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:11:41+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Roku Inc. today announced that The Roku Channel will be the launch destination for ABC News Live, a new 24/7 live and linear news stream from anchor partner ABC News.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2Froku-set-launch-destination-abc-news-live%2Fstory%3Fid%3D54691274.json",
    "image_url": "http://abcnews.go.com/Business/roku-set-launch-destination-abc-news-live/story?id=54691274",
    "language": "en",
    "localpath": null,
    "maintext": "Roku Inc. today announced that The Roku Channel will be the launch destination for ABC News Live, a new 24/7 live and linear news stream from anchor partner ABC News.\nIt will utilize the worldwide resources of ABC News and their people in the field to deliver news in a modern package, and take users live, on location to show – not tell them – what’s happening in the world.\n“We built The Roku Channel so it’s easy to navigate, offers great content and brings real value to our customers,” said Rob Holmes, Vice President of Programming, Roku.\n“Today, we’re working with some of the industry’s most forward-looking news organizations such as ABC News, Cheddar, People TV, and others, to deliver yet another customer-requested feature to The Roku Channel – live and linear news. ABC News has been at the forefront of producing and delivering live news for OTT viewing and we're excited to have them on-board as one of our anchor news partners.”\nJames Goldston, ABC News division president, sent the following memo to staff on Tuesday:\nTeam,\nI have terrific news to share. Today we’re announcing an exciting new partnership with Roku, the fastest-growing over-the-top service, to deliver live news 24/7 to their viewers nationwide. It’s a big step into our future.\nColby Smith and his team have spent the last 3½ years experimenting with how best to deliver news to audiences on new platforms, delivering thousands of livestreams from every event and breaking news story imaginable.\nAfter analyzing the mountains of data, we’ve seen time and again viewers want to be shown what’s happening right now, up close and on location whenever possible, live, every minute of every day.\nThe result is a 24/7 livestream we’re calling ABC News Live, powered by the unmatched worldwide resources of ABC News and our brilliant journalists in the field to deliver the most compelling events happening around the world.\nFrom breaking news and confirmation hearings to midterm campaign rallies, student walkouts and the royal wedding, ABC News will be there, live. You’ll also see new programs being introduced over time like The Briefing Room, which airs live immediately after the daily White House press briefing, for more context and to be on the ground with our exceptional team of journalists.\nABC News Live will help us connect with our viewers in a whole new way. It will also change how we approach news gathering and reporting around the world.\nWe will be looking to every one of you in the News Division to help support and grow this important new initiative. This is just the first step, but I view this as the beginning of a journey that will redefine what ABC News means to our audience. By matching our world class reporting with groundbreaking technology, we will make our journalism and storytelling even more vital and powerful.\nDavid Reiter will lead our ABC News Live daily news programming as we gear up for the public launch on Roku in May. Katie Nelson will oversee our livestream strategy. Thanks to the tireless work of Cat McKenzie, Josh Ascher, Ryan Amelio and countless others, we’ve already built an excellent foundation. Now we’re counting on all of you to take us even further.\nPlease join me in congratulating the team.\nJames",
    "source_domain": "abcnews.go.com",
    "title": "Roku set to be the launch destination for ABC News Live",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/roku-set-launch-destination-abc-news-live/story?id=54691274"
}