{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 03:18:26+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpeople-disappearing-northern-mexico-border-city-55534011.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_6230980cadf64741b4af1d512c588503_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jessica Molina has not seen or heard from her husband since March, when Mexican marines broke through their door in Nuevo Laredo and took him and a friend away.\nMolina, a U.S. citizen, said Wednesday that her 41-year-old Mexican husband, Jose Daniel Trejo Garcia, is a mechanic with an established business in Laredo, Texas, where they live. They were only in Nuevo Laredo because she had recently had surgery in Monterrey and was returning to have stitches removed.\nThe office of the United Nations High Commissioner for Human Rights on Wednesday called on the Mexican government to \"take urgent measures to stop the wave of forced disappearances in Nuevo Laredo and surrounding areas\" and said \"there are strong indications\" that they were committed \"by a federal security force.\"\nThe U.N. office documented the disappearance of 23 people since the start of February in Nuevo Laredo and said there could be many more. While it did not name those missing, Trejo Garcia is among those counted by the non-governmental Nuevo Laredo Human Rights Committee.\n\"We have documented 56 forced disappearances from Jan. 20 to May 21,\" said Raymundo Ramos, president of that group. \"The majority are attributed to personnel from special operations of the navy.\"\nMexico's National Human Rights Commission said it had received complaints concerning the disappearance of 31 people since February, seven of them under 18, and was investigating those cases.\nNeither Mexico's navy, which has contributed marines to the country's fight against drug violence, nor the Interior Department, which is in charge of domestic security, immediately responded to requests for comment.\nTensions were high in Nuevo Laredo when Trejo disappeared on March 27.\nOn March 25, marines had been ambushed three times by gunmen. One marine was killed and several wounded. During the third clash, a helicopter was called in. A family's car driving through a shootout was hit and a mother and two of her children were killed. The father and one boy were wounded, but survived.\nThe navy initially denied responsibility, but after an expert concluded the fatal shots came from above, it admitted its helicopter accidentally killed the civilians.\nMolina said the marines who interrogated her and her husband at 1:30 a.m. on March 27 asked if they knew about what had happened in the helicopter incident. The couple explained why they were in Nuevo Laredo. Her husband showed them the business cards for his auto repair shop, but they took him away without any search warrant or arrest order, she said.\n\"They were aiming at our heads the whole time,\" she said. \"They can deny what happened, but what I saw were well-trained, uniformed personnel.\"\nThe next morning she filed a report with the Attorney General's Office and the National Human Rights Commission. She went to the marine base, but they denied knowing anything about the incident.\nNow Molina has joined with other families to search for hidden graves along the dirt roads surrounding Nuevo Laredo. This week they were accompanied by Federal Police for the first time, she said.\nAmong the cases documented by the U.N., were the disappearances of 21 males and two females, including at least five minors.\nAccording to statements to U.N. investigators, the disappearances typically occur at night while the victims are walking along or driving on roads. Sometimes their burned and bullet-riddled vehicles are found on roadsides.\n\"Many of these people would have been detained arbitrarily and disappeared while going about their daily lives,\" said U.N. High Commissioner for Human Rights Zeid Ra'ad Al Hussein. \"It is particularly horrific that at least five of the victims were minors, three of them very young, only 14 years old. These crimes, perpetrated during four months in only one municipality, are outrageous.\"\nAccording to federal data, there have been more than 6,000 registered disappearances in Tamaulipas since 2006, more than any other state. Earlier this month, protesters demanding government action about disappearances blocked a major commercial bridge connecting Nuevo Laredo with Texas.\nLast week, Molina and other families met with a captain from the navy who promised to give them access to the marines' base and help them in their search, but there has not been any follow-up, she said. The navy is the primary security presence in Nuevo Laredo where the Northeast cartel, an offshoot of the Zetas, dominates.\n\"If the navy is here to protect us, what are they doing to avoid these disappearances?\" Molina said. \"How can this be happening in spite of their presence here?\"\n——\nAssociated Press writer Maria Verza contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "UN says people disappearing in northern Mexico border city",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/people-disappearing-northern-mexico-border-city-55534011"
}