{
    "authors": [
        "Abc News",
        "Marcus Moore",
        "More Meghan",
        "More Marcus"
    ],
    "date_download": "2018-03-20 00:01:12+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "A fourth blast happened on Sunday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Finvestigators-crack-austin-serial-bomber-case%2Fstory%3Fid%3D53849563.json",
    "image_url": "https://s.abcnews.com/images/Video/austin-bomb-expolsion-roku-pol-mem-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The desperate search for the suspect or suspects who have put Austin residents on edge with a series of explosives is now likely focused on the few clues police have on hand.\nInterested in Austin Explosions? Add Austin Explosions as an interest to stay up to date on the latest Austin Explosions news, video, and analysis from ABC News. Add Interest\nFred Milanowski, a special agent in charge for the Bureau of Alcohol, Tobacco, Firearms and Explosives who is on the ground in Austin, told ABC News that officials are looking at “a couple of people of interest” but added they are still actively calling for the public’s help.\nThe most obvious avenue for investigation at this point is examining the remnants of the four devices that have exploded in Austin over a 17-day span. The explosions have killed two people and injured four others.\n“Every bomber leaves a signature because they tend to make their devices the same way every time 'cause once they’ve perfected one they don’t want to take a chance of accidentally detonating something,” Milanowski told ABC News.\nBut since the first three blasts stemmed from package bombs and officials believe the fourth explosive, which went off on Sunday night, was detonated by a tripwire, it could suggest that the bombmaker or bombmakers are changing their style.\n“That’s why this one does concern us because it’s got a little more sophisticated with this tripwire,” Milanowski said.\n“From preliminarily what we’ve seen in there, there’s reason to believe that the same individual that built those built the other one,” he said.\nJohn Cohen, a former acting Homeland Security under secretary and now an ABC News consultant, said that the leftovers from the physical bombs will play a key role in more ways than one. For example, there could be DNA left on a portion of the bomb, which authorities will then run through any number of records repositories, like criminal or military records as well as fingerprints from certain background checks or travel records like TSA PreCheck, that could match the bomb to a name.\n“Even if they find DNA or fingerprints but they're not in those repositories, it won’t help them identify the person, but it will help them connect the individual events to the same person,” Cohen said.\nThe level of sophistication in the bombs and the ability to make different types of bombs as seen in the switch to a tripwire could also be an avenue in and of itself.\nSteve Gomez, a former FBI special agent in charge and current ABC News consultant, stressed the level of craftsmanship on display in the bombs so far and the level of preparation that the bomber or bombers had to commit before detonating the blasts.\n“Whoever is the suspect or suspects, they are very sophisticated when it comes to bombmaking and explosives, so that’s the first line of investigations that they pursue,” Gomez said, noting that “anyone in the area that has some kind of explosives-making experience” is likely going to be considered.\nGomez said it’s also clear that the suspect or suspects are “utilizing a lot of planning because so far there have been no videos that have come up with a potential suspect, which indicates that the bomber is probably doing surveillance of the locations where the bombs are going to be planted.”\n“It’s fairly easy to determine if somebody has visible cameras or the doorbell cameras -- those are fairly easy to detect -- so that might be part of the surveillance that the bomber is conducting,” Gomez said.",
    "source_domain": "abcnews.go.com",
    "title": "What investigators are looking for to crack the Austin 'serial bomber' case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/investigators-crack-austin-serial-bomber-case/story?id=53849563"
}