{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 09:00:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Rep. Steve Scalise, R-Louisiana, the House majority whip, is in critical condition after the shooting in Alexandria, Virginia.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fgunman-opens-fire-congressional-baseball-practice-48049504.json",
    "image_url": "http://a.abcnews.com/images/Nightline/170615_ntl_virginia_shooting_1239_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Gunman opens fire at congressional baseball practice\nWe begin here tonight with the latest developments in the shooting of a Republican congressman and others at a baseball practice outside of Washington. They were gearing up for the annual matchup between the GOP and the Democrats, a tradition more than a century old. And one of the last remaining realms of bipartisanship in D.C. But today a vicious attack. Today, two American institutions literally under fire. Our national pastime, and our elected officials. A barrage of gunfire at a baseball field right outside Washington, D.C. As Republican members of congress practiced for their annual game against the Democrats. Law enforcement officers shouting at the suspect. 66-year-old James T. Hodgkinson, who had opened fire on the players, apparently deliberately targeting the GOP. Six injured including congressman Steve Scalise, the third-ranking Republican in the house of representatives, now in critical condition. The suspect now dead, had a long and public history of anti-Trump and anti-republican rhetoric. The questions tonight, what exactly was his motive? And why now? The attack began shortly after 7:00 A.M. In the del ray area of alexanderd Alexandria, Virginia, eight miles from capitol hill. At least 20 members of congress along with their families and others were gathered at the Eugene Simpson stadium prepping for the charity match tomorrow night. I was taking groundballs at third base, Jeff Duncan at short, Steve Scalise at second -- Reporter: The congressman said the man later identified as Hodgkinson approached about players on the field. An individual came up to us, are those Republicans or Democrats? It's a little odd, 7:00 in the morning, why would you be out there? Reporter: Shortly thereafter shots rang out. I thought it was a construction site that dropped a very large piece of metal. Reporter: Hodgkinson allegedly opening fire using a rifle and a handgun from behind the third base dugout. Hey, is that guy okay out there? The guy's been shot, is he okay? We didn't exactly know where the shots were coming from, but it was loud. It was constant. You just wonder when it's going to stop. I saw the gunman come around the back stop, ask he had a clear line of fire into the dugout. Reporter: Within three mites, Alexandria police officers arrived at the scene. Do you need a second helicopter? We have another one for the second helicopter. There's also a victim down in the baseball field. Reporter: Louisiana congressman Scalise, who had been at second base, was hit and started crawling, wounded, into the outfield. We wanted to get to him, but couldn't with the gunshots overhead. And after about ten minutes -- then another staffer was shot in the leg, dove into our dugout, applied a tourniquet to try to stanch the bleeding. We were sitting ducks. We had nothing to fight back with but bats. Reporter: Two capitol police officers, crystal Griner and David Bailey, part of Scalise's security detail, along with multiple law enforcement agencies, engaged in gunfire with the shooter. Do you have suspect information for us? The suspect is in custody. Reporter: Scalise's position as majority whip requires that he have 24-hour capitol police coverage. If he hadn't been at the practice, those police officers wouldn't have been there either. Had Scalise not been there, I think it would have been a massacre today. There could have easily -- been 25 deaths or more today. Reporter: With the gunman disarmed, Scalise's colleagues, congressman Jeff flake and congressman Brad wenstrop, Iraq war veteran and doctor, immediately ran to his side and gantry yaunlging. Did what I did in Iraq, cut down their clothes, look for a wound, major sure you stop bleeding. Reporter: Congressman Scalise was transferred to the hospital where he underwent surge are you for a gunshot wound. The suspect was transferred to the hospital where he later died. The D.C. Medical examiner has issued the cause of death as multiple gunshot wounds to the torso. Reporter: James Hodgkinson was last known to reside in Bellville, Illinois, where he was unemployed. Police today raced to his home in a search for answers. One of the keys today is, was there a trigger? They're also going to be looking for, is he connected to anybody else that wants to do some version what was he did today? Reporter: His social media accounts were filled with anti-Trump sentiment. Calling the president a traitor and saying trump has destroyed our democracy, it's time to destroy trump and co. He joined anti-republican Facebook groups including one called terminate the Republican party. Two years ago he commented on this anti-scalise cartoon saying, here is a Republican who should lose his job. He was an ardent supporter of Bernie Sanders, who today confirmed that Hodgkinson volunteered for his presidential campaign. I have just been informed that the alleged shooter at the Republican baseball practice this morning is someone who apparently volunteered on my presidential campaign. I am sickened by this despicable act. And let me be as clear as I can be. Violence of any kind is unacceptbble in our society. And I condemn this action in the strongest possible terms. Reporter: Hodgkinson had a history of run-ins with the law. In 2006, police responded to a domestic incident in which Hodgkinson was accused of hitting a woman and also hitting a neighbor in the face with a shotgun. But the misdemeanor charges were later dropped. This past March, police were called to his home after neighbors reported that dozens of shots were fired. He may have been shooting at some tarts there in the trees. But then he stepped out from his building there. And I could see him pointing the rifle across this field. As far as you can see down there. Reporter: But police determined that he had a valid firearms owner identification card, and that no law was violated. Hodgkinson's wife says her husband left Illinois for Alexandria, Virginia, two months ago. According to law enforcement he was living out of his van. In recent months Hodgkinson was a regular at pork barrel barbecue bar eight blocks from the shooting site. Bartenders say he was odd. Struck me as a very -- introverted person. Not exactly warm person to have a conversation with. Reporter: In the first mass shooting he has addressed since taking office, president trump today called for solidarity. We may have our differences. But we do well in times like these to remember that everyone who serves in our nation's capital is here because, above all, they love our country. Reporter: Unlike his predecessor, trump did not call for new gun safety measures. Tonight president trump and the first lady paid a visit to the hospital where congressman Scalise is being treated for a single gunshot to the hip that damaged internal organs and caused severe internal bleeding. The shooting comes in the midst of an era of extreme partisanship in our country. But in the wake of the shooting -- The mood on cap HOL hill is somber and a bit surreal. We've seen lawmakers returning to their offices still in their baseball union Fors. Reporter: Democrats at their own baseball practice came together in prayer for their Republican colleagues. And at a noon gathering of congress, house speaker Paul Ryan delivering this statement of unity. An attack on one of us is an attack on all of us. Reporter: Minority leader Nancy Pelosi expressing a rare moment of agreement with her Republican colleague. You'll hear me say something you've never heard me say before. I identify myself with the remarks of the speaker. Reporter: Tonight, congressman Joe war tobarton, together with his sons both at the baseball field, is attending a dinner at the democratic club that his colleagues across the aisle are hosting for the Republican team. Past accidents of violence toward members of congress have also sparked calls for unity. Is anybody injured? Did you say Gabrielle giffords is hit? She's hit. I do believe she's breathing. There's multiple people shot. Reporter: 2011, representative Gabrielle giffords was shot at point-blank range in the head during a meeting with her constituents in a supermarket parking lot in Tucson, Arizona. Despite calls for increased civility in our political discourse that came in the aftermath, the spirit did not last. And indeed today it took just hours after the attack for the familiar debate about gun violence to be reawakened with the democratic governor of Virginia weighing in. I have long advocated, this is not what today is about, but there are too many guns on the street. Reporter: Texas congressman Roger Williams, a Republican who was injured during today's attack, was unwavering in his pro-gun stance. I'm for the second amendment. I'm from Texas. Reporter: One point of agreement tonight, the annual congressional baseball game will go on as planned tomorrow night. Knowing Steve Scalise as we all do, he is likely really frustrated that he's not going to be able to play in the baseball game. We will use this occasion as one that bring us together and not separates us further. This is America, the greatest country in the world. If you punch us, we will punch back. And we're going to play baseball tomorrow.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Gunman opens fire at congressional baseball practice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/gunman-opens-fire-congressional-baseball-practice-48049504"
}