{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:38:14+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Maureen Dowd wrote the actress told her that Weinstein pushed her down and tried to expose himself.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fuma-thurman-speaks-harvey-weinstein-ny-times-columnist-52819911.json",
    "image_url": "http://a.abcnews.com/images/WNT/180203_wn_reshef1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Uma Thurman speaks out against Harvey Weinstein to NY Times columnist\nBack now with a major star breaking her silence. Uma Thurman, the well-known actress who worked so closely with Hollywood mogul Harvey Weinstein on pivotal, popular films, now adding her list to the growing number of actresses accusing him of sexual assault. Here's erielle reshef. Reporter: Tonight, Hollywood star uma Thurman says she is finally ready to speak out against disgraced movie mogul Harvey Weinstein. You and I have unfinished business. Reporter: For months Thurman hinting she would join the chorus, accusing Weinstein of sexual harassment and assault. When I'm ready, I'll say what I have to say. Reporter: The actress and producer first working together in their 1994 hit \"Pulp fiction.\" \"New York Times\" columnist Maureen dowd reporting that Thurman tells her when the two were in Paris, Weinstein held a meeting in his bathrobe and tried to lure her into a steam room. Shortly after in London, dowd reports that Thurman claims, \"He pushed me down. He tried to shove himself on me. He tried to expose himself.\" And that Thurman says she told Weinstein the next day, \"If you do what you did to me to other people you will lose your career, your reputation and your family.\" In a statement, Weinstein, who's now in rehab in Arizona, calls the incident an \"Awkward pass\" that he immediately apologized for, but says Thurman's \"Claims about being physically assaulted are untrue.\" Thurman continued to work with Weinstein on some of her biggest hits including \"Kill bill.\" I roared and I rampaged and I got bloody satisfaction. Reporter: But she tells dowd she tolerated him only in supervised environments. Thurman says her biggest regret was staying silent for so long. As for Weinstein, he continues to deny any allegations of nonconsensual sex. His attorneys say they're considering legal action against Thurman. And when we come back --\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Uma Thurman speaks out against Harvey Weinstein to NY Times columnist",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/uma-thurman-speaks-harvey-weinstein-ny-times-columnist-52819911"
}