{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:43:56+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "FANTASY PLAYS: The Puzzles and Pleasant Surprises of Season",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ffantasy-plays-puzzles-pleasant-surprises-season-44513117.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/fantasy-plays-puzzles-pleasant-surprises-season-44513117",
    "language": "en",
    "localpath": null,
    "maintext": "The 2016 fantasy football season isn't fully in the books — there are several playoff-based games you can play, if that happens to be your thing — but the season-long hunt for a title is now officially done until next summer.\nWe began as doe-eyed innocents back in August, shouting to anyone who would listen about the zero-RB theory and arguing Ezekiel Elliott's first-round status. We end the year scratching our heads about several stars and wondering what a world with no Chip Kelly in the NFL will look like (he was fired by the 49ers Sunday after a 2-14 season).\nAs is tradition, with the season now behind us, we take a look back at the players, coaches, and teams that befuddled, surprised, and generally stood out in 2016.\nTHE WEEKLY ENIGMA THAT WAS TODD GURLEY\nRams running back Todd Gurley was everything a fantasy player could want coming into 2016: he had the backfield to himself, he was coming off a 1,106 rushing yard, 10-touchdown season, and he was a full season removed from a brutal college knee injury that delayed his 2015 NFL debut.\nGurley managed 278 rushing attempts in 2016 and upped his role in the receiving game, with 58 targets (compared to 26 in 2015). He also finished the year with 1,212 total yards from scrimmage. But the rest of this numbers were harsh, especially considering how they came in.\nGurley had 885 rushing yards on the season and just two games with more than 75 rushing yards. The constant hope each week that this could be the game crushed his owners, and probably sent most of them to sub-.500 records and missed playoff bids. Throw just six touchdowns into the mix, and this was a lost fantasy season for Gurley and his owners.\nGurley, though, is one of the most talented players in the league. A new coach, coupled with offensive upgrades to take pressure off him, could spell a surprise year for Gurley in 2017.\nTHE WEEKLY ENIGMA THAT WAS ALLEN ROBINSON\nJaguars wide receiver Allen Robinson was another frustrating fantasy entity in 2016, and finished the season with 883 receiving yards, just two short of Gurley's rushing total. And Robinson offered a similar weekly degree of hope for his owners because he was so involved in the passing game, eventually finishing the season seventh among wide receivers in targets, with 151. Unfortunately, Robinson converted just 73 of those targets into receptions.\nThe silver lining here — maybe — is that Robinson had two very good games to end the season under interim coach Doug Marrone, with 14 receptions for 229 yards off 24 targets (producing two of his top three receiving yard totals on the season). If Marrone and offensive coordinator Nathaniel Hackett return, Robinson could be in line for a nice bounce-back season in 2017.\nBELIEVE IN THE BROWNS (FOR 2017)!\nIt's tough to make a case for a team that went 1-15 and finished 30th in the NFL in offensive yards, but keep an eye on the Browns in 2017. Their coach, Hue Jackson, is one of the greatest offensive minds in the NFL, and the roster is stacked with explosive talent — Terrelle Pryor, Corey Coleman, Duke Johnson, Isaiah Crowell, and Gary Barnidge, among others.\nPryor, in particular, put together one of the more surprising seasons in recent memory, finishing 2016 with 1,007 receiving yards and four touchdowns on 140 targets.\nYES, EZEKIEL ELLIOTT WAS AWESOME, BUT.\nChicago's Jordan Howard had a better yard-per-carry average (5.2) than Elliott (5.1). It's splitting hairs, but Howard was working in an offense that was nowhere near that of the Cowboys. His 1,313 rushing yards on the season were second-most in the league, he fumbled just once on 252 rushing attempts, and while his 50 targets didn't put him at the top of the running back heap, they were 10 more than Elliott's 40.\nAnd this is made all the more impressive knowing Howard didn't even get his first start until Week 4.\nFUN FACTS TO WRAP UP THE SEASON!\n— After eight seasons in the NFL, Rams wideout Kenny Britt got his first 1,000 yard campaign, finishing the season with 1,002 yards and emerging as one of the few bright spots for the team.\n— Vikings receiver Adam Thielen had 967 receiving yards on the season, more than DeAndre Hopkins (954), Kelvin Benjamin (941), or Willie Snead (895).\n— Aaron Rodgers last threw an interception on Nov. 13.\n— Davante Adams finished the season with 997 receiving yards, just three away from a 1,000-yard campaign. Melvin Gordon finished with 997 rushing yards in a season cut short by injury.\n———\nThis column was provided to The Associated Press by the Fantasy Sports Network, http://FNTSY.com",
    "source_domain": "abcnews.go.com",
    "title": "FANTASY PLAYS: The Puzzles and Pleasant Surprises of Season",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/fantasy-plays-puzzles-pleasant-surprises-season-44513117"
}