{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 09:29:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Could gene editing help avoid disease? Maybe",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fgene-editing-avoid-disease-45503450.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/gene-editing-avoid-disease-45503450",
    "language": "en",
    "localpath": null,
    "maintext": "Don't expect designer babies any time soon — but a major new ethics report leaves open the possibility of one day altering human heredity to fight genetic diseases, with stringent oversight, using new tools that precisely edit genes inside living cells.\nWhat's called genome editing already is transforming biological research, and being used to develop treatments for patients struggling with a range of diseases.\nThe science is nowhere near ready for a huge next step that raises ethical questions — altering sperm, eggs or embryos so that babies don't inherit a disease that runs in the family, says a report Tuesday from the National Academy of Sciences and National Academy of Medicine.\nBut if scientists learn how to safely pass alterations of the genetic code to future generations, the panel said \"germline\" editing could be attempted under strict criteria, including that it targets a serious disease with no reasonable alternative and is conducted under rigorous oversight.\n\"Caution is absolutely needed, but being cautious does not mean prohibition,\" said bioethicist R. Alta Charo of the University of Wisconsin-Madison.\n\"This committee is not saying we will or should do germline — heritable — editing. What we are saying is that we can identify a set of strict conditions under which it would be permissible to do it,\" Charo added. \"But we are far, far away from being ready to try.\"\nGenome editing should not go beyond healing the sick and enhance traits such as physical strength, what's commonly called \"designer babies,\" the panel stressed.\nBut the public should get involved in these debates now, to say what might one day be acceptable.\nThe long-awaited report offers advice — the prestigious academies cannot set policy. But it is considered a step toward creating international norms for responsible development of this powerful technology. The U.S. National Academies and its counterparts in Britain and China have been holding international meetings with the hope of doing just that.\n\"Genome editing is a new tool for gene therapy and it has tremendous promise,\" Charo said. But, she added, it has to be pursued in a way that promotes well-being and is responsible, respectful and fair.\nGenome editing is essentially a biological version of cut-and-paste software, allowing scientists to turn genes on or off, repair or modify them inside living cells. There are a few older methods but one with the wonky name CRISPR-Cas9 is so much faster, cheaper and simpler to use that it has spurred an explosion of research.\nUnder development are ways to treat a range of diseases from sickle cell and hemophilia to cancer. In lab experiments using human cells or animals engineered with humanlike\ne disorders, scientists are unraveling how gene defects fuel disease — and are even trying to grow transplantable human organs inside pigs.\nThat kind of research is very promising, is adequately regulated today and should continue at full speed, the National Academies panel concluded.\nWhen it comes to the more sci fi-sounding uses, it's quite possible scientists will learn how to perform germline editing in five to 10 years, said panel co-chair Richard Hynes of the Massachusetts Institute of Technology. Safety is one reason for caution, he said, as scientists will have to learn whether editing one gene has unwanted downstream effects.\nSome critics argue that families plagued by inherited diseases already have other alternatives — adopt, use donated eggs, or undergo in vitro fertilization and discard resulting embryos that inherit the bad gene. But Charo noted that sometimes parents carry two copies of a lethal gene, guaranteeing any children inherit it. Others oppose the discarding of embryos for religious reasons.\nFor some families, \"you can see there would be strong arguments for doing it\" if the other criteria are met, said Robin Lovell-Badge of Britain's Francis Crick Institute.\nSome countries prohibit any germline editing research. Others, such as Britain, allow laboratory research with genome editing in embryos, not for pregnancy but to understand human development.\nIn the U.S., scientists can perform laboratory embryo research only with private, not government, funding. Any attempt at pregnancy would require permission from the Food and Drug Administration, which is currently prohibited from using federal funds to review any such request.\n\"The bottom line is there is no planetary government with enforcement power,\" Charo noted Tuesday.",
    "source_domain": "abcnews.go.com",
    "title": "Could gene editing help avoid disease? Maybe",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/gene-editing-avoid-disease-45503450"
}