{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2017-01-02 20:11:07+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Search Resumes for Missing Plane Carrying CEO and Family",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fsearch-resumes-plane-disappeared-lake-erie-ceo-family%2Fstory%3Fid%3D44511248.json",
    "image_url": "http://a.abcnews.com/images/US/ap-missing-plane-er-170102_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Search efforts today resumed by water, air and shoreline for a plane that disappeared four days ago near Cleveland carrying three adults, including a CEO, and three children, officials said.\nA bag from the plane was recovered Sunday near the Shoreby Club harbor, which is along the coast about 6 miles north of Cleveland Burke Lakefront Airport, city officials said.\nOther debris has been collected, but has not yet been verified as part of the plane, the city said.\nThe plane went missing Thursday night over Lake Erie after taking off from Cleveland's Burke Lakefront Airport en route to Ohio State University Airport in Columbus, officials said.\nSuperior Beverage Group president and CEO John Fleming was piloting the plane, according to The Associated Press. He was aboard with family and friends, the Ohio-based beer and wine distributor said in a statement.\n\"As we all await the results of the search and rescue efforts, our hearts are with John, his wife, their sons, and close friends on board, as well as with their loved ones and everyone in the Superior Beverage family,” company Executive Vice President Joseph McHenry said in a Friday statement.\n“This is a difficult day for us, and we appreciate the concern and thoughtfulness extended by so many.\"\nThe weather conditions were favorable for today's search, Cleveland officials said this morning, with mostly calm waters and light winds. The search is focusing on a grid near the shoreline that's about 2.5 miles from east to west and 2 miles north to south.\n\"We want to remind everyone that this is an active investigation,\" Cleveland Chief of Police Calvin Williams said. \"If you see something that could be debris from the plane, we are asking people to avoid touching it, and to call the Division of Police immediately.\"",
    "source_domain": "abcnews.go.com",
    "title": "Search Resumes for Plane That Disappeared Over Lake Erie With CEO and Family",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/search-resumes-plane-disappeared-lake-erie-ceo-family/story?id=44511248"
}