{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2018-05-31 07:26:55+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "\"It doesn't bring me personal joy, this is not really what it is about,\" Burke said, reacting to Weinstein's indictment.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fmetoo-founder-tells-trevor-noah-harvey-weinstein-indictment%2Fstory%3Fid%3D55552211.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/tarana-burke-gma-abc-mem-171019_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Activist and #MeToo founder Tarana Burke said she was hopeful when the Manhattan District Attorney’s Office indicted movie producer Harvey Weinstein on Wednesday, but added that it isn't \"really a moment to celebrate.\"\nInterested in Harvey Weinstein? Add Harvey Weinstein as an interest to stay up to date on the latest Harvey Weinstein news, video, and analysis from ABC News. Add Interest\n\"It doesn't bring me personal joy, this is not really what it is about,\" Burke said Wednesday night on \"The Daily Show.\" \"This is not really a moment to like celebrate how the mighty have fallen. But it is cathartic for the survivors, it is a moment for them to have a sense of relief, for some of them.\"\nSpeaking in an interview with Trevor Noah, Burke said Weinstein's forthcoming trial could be tenuous.\nSarah Morris/Getty Images, FILE\n\"It will mark the beginning of them [the victims] having to be dragged through a trial process where his attorneys are going to try their best to diminish them and to make them seem like they were complicit,\" she said.\nBurke also pushed back against claims that the #MeToo movement had become more about \"taking down powerful men\" than supporting victims of sexual assault.\n\"It's not about taking down powerful men, and it is not a woman's movement either -- that's another sort of misconception,\" she said. \"It's movement for survivors.\"\n\"Our goal was really to work with black and brown girls in the south, who are survivors of sexual violence, and to speak healing into their lives,\" she added.\nWeinstein, 66, was arrested, processed and charged with rape, criminal sex act, sex abuse and sexual misconduct last week for incidents involving two separate women, according to police.\nThe Associated Press\nThe Associated Press\nHe has been accused by dozens of women of sexual misconduct and has been investigated by multiple agencies, including the the New York Attorney General's Office, the Los Angeles Police Department and authorities in the U.K.\nWeinstein has denied all allegations of nonconsensual sex. His attorney, Benjamin Brafman, has signaled that he plans to plead not guilty at the forthcoming arraignment.\nBurke, one of \"the silence breakers\" to receive Time Magazine's Person of the Year title for 2017, said the disgraced movie mogul's arrest should serve as a cautionary tale for men in power and everyday people alike who walk the thin line between unacceptable and criminal behavior.\nThe #MeToo movement \"grew from working with young girls to grown women, who realized, 'Oh, we're survivors of sexual violence and there are others like us,'\" Burke said, \"and it has really been focused on what survivors need to start a healing progress.\"\n\"That’s really what the heart of our movement has been about,\" she added. \"We are working to end sexual violence.\"",
    "source_domain": "abcnews.go.com",
    "title": "#MeToo founder tells Trevor Noah: Harvey Weinstein indictment isn't 'moment to celebrate'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/metoo-founder-tells-trevor-noah-harvey-weinstein-indictment/story?id=55552211"
}