{
    "authors": [
        "Abc News",
        "Jeffrey Cook",
        "More Benjamin",
        "More Jeffrey"
    ],
    "date_download": "2018-05-31 02:00:04+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The FBI is now looking into the matter.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Funruly-passenger-forces-delta-flight-diversion%2Fstory%3Fid%3D55547603.json",
    "image_url": "https://s.abcnews.com/images/US/delta-airlines-boeing-737-gty-mt-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Delta Air Lines flight was diverted to Tulsa, Oklahoma, Wednesday after a man became unruly during the flight, the airline confirmed to ABC News.\nDelta flight 1156 from Portland to Atlanta landed “without incident” and the passenger was detained at Tulsa International Airport, according to Delta.\n“All in all, it was a crazy flight,” Lisa Zimmerman, who was also on the plane, told ABC News\nZimmerman said the passenger, who she saw dancing and singing while boarding, “started singing really loudly” again in the middle of the flight. When a flight attendant touched the man’s shoulder in an attempt to get his attention, Zimmerman said, “He flipped. He threw off his headphones and said, ‘Touch me again and you’ll regret it.’”\nThe flight I’m on just had to emergency land in Tulsa so the police could escort a man off the plane. (It’s a crazy story) As a witness to the whole situation, I have to say that @Delta did a great job handling it. Good job, @Delta ! Also, love the amount of leg room! ??????? — Lisa Zimmerman (@Leese_Zimmerman) May 30, 2018\nU.S. Attorney R. Trent Shores said in a statement that federal air marshals on the flight “successfully de-escalated and the controlled the situation.” The matter is now being investigated by the FBI, and the U.S. attorney’s office will determine whether the passenger violated federal law, Shores said.",
    "source_domain": "abcnews.go.com",
    "title": "Unruly passenger forces Delta flight diversion",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/unruly-passenger-forces-delta-flight-diversion/story?id=55547603"
}