{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:22:32+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Jesse Duplantis defends the need for new wings, claiming \"Jesus wouldn't be riding a donkey\" if he was on Earth today.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fevangelist-makes-54m-sales-pitch-followers-private-jet-55535512.json",
    "image_url": "https://s.abcnews.com/images/US/180530_wnn_pastor_jet_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Evangelist makes $54M sales pitch to followers for private jet\nJust imagine the pitch from this particular pastor. Kind of get a new jet. Anybody testify. Club chair at butternut the bank or hate that it appears there's that there is a pastor is making that pitch. All right well televangelists Jesse do practice has asked his flock to chip in for the plane which would be his fourth by the way. The price tag on the falcon seven X jet is 54. Million dollars. Hey that's in less than he says spreading the gospel around the world isn't cheap now and then Jesus himself. Would need some. Extra travel help testify. It was Ottawa kick goal with this yes technical one stop easy pocket that would one stop. I can plot a lot cheaper because I have home field wall. That's was a blessing of the lord but this really I have to stop and that you pay those exorbitant prices but jet fuel all over the world this has paid cash. This was paid cash this was paid cash. And it knew when will be paid cash also. I don't on the plane this belongs to the ministry. If Jesus tariffs Chicago by the way of the great the next person that's what take this measure will use that are really believe. Strategies it was physically on there today he wouldn't be rat but okay. Thing about equipment he'd be in an airplane preaching the gospel all over the world. Yet. Should you sell me. Yeah you read it and I haven't jet collided ready let's let's crowd funded. The plant this is a preacher of the prosperity gospel its premises god shows favored by rewarding its flock. With riches here on earth I went congregants hand over their money to pastors it is seen as an investment. She first had not op Ed mean he. It was good sales driving like you invest in my private plane and I'll let you rattle along every now and that's.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Evangelist makes $54M sales pitch to followers for private jet",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/video/evangelist-makes-54m-sales-pitch-followers-private-jet-55535512"
}