{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:28:28+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The American Cancer Society released new guidelines for rectal cancer screening.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2Fvideo%2Fguidelines-colonoscopy-screenings-lower-age-45-50-55542574.json",
    "image_url": "https://s.abcnews.com/images/Health/180530_nwo_med_minute_colon_cancer_screenings_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for New guidelines for colonoscopy screenings lower age to 45 from 50\nColon cancer is the second leading cause of cancer related deaths behind lung cancer. The current guidelines recommends that those at average risk for colon cancer have their first colonoscopy at the age of fifty. That has worked well with the risk of colon cancer in those over 65. Now down by 13. The unexpected problem. Younger adults from 1990 forward to 2014. The rate of new colon and rectal cancer increased by 51%. In those under 55. Using a statistic based model researchers have determined that you ideal time to begin screening. It's a time that could add the most overall light years and use all available screening tests colonoscopy school testing and CT call and I'll Griffey. The model shell that starting colonoscopy earlier at the age of 45. Increased life yours by six point 2% compared to be getting at fifty as we do now. The tests should still be repeated every ten years a must otherwise medically indicated. There were no other changes made to other screening tests. This new guideline could be as effective against colon cancer for the young as it was for those who are older. Sort hearing your mid forties don't be alarmed at this is mentioned that your next doctor's visits and as it isn't drink enough yourself. With this medical minute I'm Stephanie Ramos ABC news.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "New guidelines for colonoscopy screenings lower age to 45 from 50",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/video/guidelines-colonoscopy-screenings-lower-age-45-50-55542574"
}