{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:46:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Teammates agree with Leonard Fournette: NFL not bad after SEC",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fteammates-agree-leonard-fournette-nfl-bad-sec%2Fstory%3Fid%3D49212862.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170811_NFL_woody_on_fournette_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "JACKSONVILLE, Fla. -- Rookie running back Leonard Fournette caused a stir last week when he said the transition from college to the NFL was \"really easy\" because he played in the Southeastern Conference.\nAs outlandish as that sounds, several of his Jacksonville Jaguars teammates say he's right.\n\"I feel like he was kind of right,\" said third-year running back T.J. Yeldon, who played three seasons at Alabama. \"Playing in the SEC, the game speeds up. It's faster. It's kind of like the NFL. The NFL is a tad bit faster.\n\"I get where he's coming from with that comment.\"\nRookie offensive tackle Cam Robinson also played at Alabama, and while the offensive line is a different world than running back, he said his games against LSU, Auburn, Florida and the rest of the SEC have made a huge difference for him.\n\"I feel like what he was trying to say was the speed of the game we played in college, just the talent game in and game out that you're going against, is so elite that the game is played at a fast pace,\" Robinson said. \"So I think he was just meaning that when it came to the actual pace of the game that what we faced at college did a god job preparing us for what we see at this level right now.\"\nUnlike Yeldon and Robinson, running back Corey Grant wasn't drafted and didn't step into a starting role as a rookie. He signed with the Jaguars in 2015 as an undrafted free agent and got on the field as a kick returner and carried the ball just six times for 2 yards.\nEven so, he said playing at both Alabama and Auburn -- he left Tuscaloosa, Alabama, after one season -- helped ease the transition.\n\"I kind of feel the same way [as Fournette],\" Grant said. \"Coming from the SEC, it's really a hard-nosed league. Pac-10, all those others conferences and stuff, they're good and they're physical and everything, but it's just something about coming out of the SEC. You see a lot of guys who come out of the SEC [and] when they get into the league they kind of have success. I'm not going to say more success, but the majority are successful.\n\"And you know just playing against that caliber of talent in the SEC and then coming into the NFL it, kind of just translated right over.\"\nFournette made his comment after the Jaguars' 31-24 victory over New England in the preseason opener in which he rushed for 31 yards and a touchdown on nine carries. He converted a fourth-and-1 with an 8-yard run and scored on a 1-yard touchdown run against a Patriots team that held 40 of their 90 players out of the game, including the entire starting lineup on both sides of the ball.\n\"It's a lot slower than I really thought,\" Fournette told NFL Media. \"That's how I've been since I first got into the NFL. A lot of people were like, 'It's going to be fast.' But by me playing the SEC, that kind of helped me a lot. I think to me it was really easy.\"\nTo be fair, Fournette made a similar comment after an early training-camp practice, saying the game slowed down for him once the team put on full pads: \"It's easier now.\"\nGrant said that's what Fournette probably should have said last week: The transition hasn't been as tough as he was warned it would be. Using the word \"easy\" was what caused the uproar -- although it may actually be the case for Fournette, who rushed for 3,830 yards and 40 touchdowns in three seasons at LSU.\n\"I mean, it could be easy for him,\" Grant said. \"He's a different breed. He's a very high-caliber player and since he's been here and being in meetings with him, he's surprised me as a rookie. This is just my third year but you have guys come and out all the time and he's one guy that really stood out to me. He knew protections, different cuts, runs, identifying defenses.\n\"That's a credit to him and credit to LSU developing players to be ready for the league once they get here.\"",
    "source_domain": "abcnews.go.com",
    "title": "Teammates agree with Leonard Fournette: NFL not bad after SEC",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/teammates-agree-leonard-fournette-nfl-bad-sec/story?id=49212862"
}