{
    "authors": [
        "Abc News",
        "More M.L."
    ],
    "date_download": "2018-07-04 22:23:00+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "A Northern California wildfire that threatens nearly 1,000 homes and buildings and a Utah fire that started Sunday has grown to about 47 square miles.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FNews%2Ffireworks-banned-wildfires-rage-west%2Fstory%3Fid%3D56362202.json",
    "image_url": "https://s.abcnews.com/images/US/california-wildfires-1-ap-thg-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Searing temperatures and drought conditions throughout much of the American West has caused many communities to ban traditional Fourth of July fireworks displays.\nThe heatwave across much of the West, where wide swaths have been charred by wildfires and the mercury has risen to triple digits in some places like California and Arizona, caused local officials to nix Independence Day fireworks.\nIn Colorado, 40 percent of the state's towns and communities canceled fireworks displays.\nSeven communities in Arizona canceled their displays as well.\nOfficials in Winters, California cited \"poor quality and smoke covering the town\" as the central reasons to skip the fireworks there.\nHugh Carey/AP\nAnd in Parowan, Utah, law enforcement officials put a ban in place of \"ALL fireworks.\"\nToday, Parowan City announced online that they were also canceling the fireworks show \"due to the extremely dry conditions this year.\"\nDespite the news of the cancellations, not all the skies will go dark all. Some communities who are going fireworks-free, are trying out a less combustible alternative: drones.\nIntel made a hit during the Winter Olympics in South Korea when they put on display a choreographed series of drones.\nInitially, Travis Air Force Base outside San Francisco, which lies an hour south of the Yolo and Napa county fires exploding there that has forced many residents to evacuate, opted for the Intel drone works this year.\nBut due to the wind speeds, the drones were also grounded for at least one day.\n\"The drone show scheduled for July 4, 2018, at Travis Air Force Base has been canceled and rescheduled,\" a statement by the military base confirmed.\nJosh Edelson/AFP/Getty Images\nIt added the drones would take flight instead on July 5 \"pending adequate weather conditions.\"\nIn a separate statement Intel acknowledged that it had to cancel the drone alternative due to the conditions.\n\"We decided to cancel the performance today as a result of high winds that would have interfered with drone flight. Our drones can fly in winds up to 18 miles per hour, but the forecast calls for winds over 30 mph for the time frame we were planning to fly. We emphasize safety in our drone performances, including in our operations, the design of the drones, and the use of systems like geofencing and auto-land contingencies,\" read the statement.\nAspen, Colorado, and a group of Arizona towns will also be experimenting with drone shows.\nColorado firefighters are working to put out six wildfires, all being called \"Spring Fire,\" which have been ravaging 123 square miles of terrain.\nThe bone-dry, blustery conditions caused by drought across the West were expected to persist through the end of July in California, Utah, Idaho, Nevada, Oregon and Washington, U.S. fire officials said. Southwest states like Arizona, New Mexico and Colorado are expecting downpours to quell the fire risk, the National Interagency Fire Center reported.\nNoah Berger/AP\nWildfires in Northern California are endangering around 1,000 homes and structures.\nPredicted cool temperatures offer some hope that some 2,500 residents, who have been forced from their homes for days, could return.\nState officials are concerned about the shifting wind conditions and heavy, thick brush that can fuel the fires could make containment difficult.\nBlazes in three rural counties, including Napa and Yolo, tore through almost 73,000 acres and is only 15 percent contained, fire officials confirmed.\nJosh Edelson/AFP/Getty Images\nTo battle them, firefighters have utilized a mix of aircraft, bulldozers and backfires.\nSince Sunday, wildfires in Utah has ravaged 47 square miles and destroyed 20 to 30 structures that include homes and cabins in high altitude mountainsides, Gov. Gary Herbert said.\nAs many as 200 to 300 homes have been evacuated and remain threatened by wind-fueled fires raging near a fishing reservoir southeast of Salt Lake City.\nAnd in New Mexico, three national forests have yet to see a blaze breakout, but shuttered for the holday because of the threat of wildfire.\nABC News' Max Golembo, Bonnie Mclean and The Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Fireworks banned as wildfires rage across the West",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/News/fireworks-banned-wildfires-rage-west/story?id=56362202"
}