{
    "authors": [
        "Abc News",
        "More Morgan"
    ],
    "date_download": "2018-02-03 18:35:09+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "A New York City teacher's lesson on slavery in America has sparked outrage after she allegedly singled out black students and told them to lie face-down on the floor.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fteacher-allegedly-black-students-lie-floor-slavery-lesson%2Fstory%3Fid%3D52816180.json",
    "image_url": "http://abcnews.go.com/US/teacher-allegedly-black-students-lie-floor-slavery-lesson/story?id=52816180",
    "language": "en",
    "localpath": null,
    "maintext": "A New York City middle school teacher's lesson on slavery in America has sparked outrage after she allegedly singled out black students and told them to lie face-down on the classroom floor.\nStudents and a staff member at a middle school in the Bronx told the New York Daily News that social studies teacher Patricia Cummings was giving a lesson to several 7th-grade classes about the Middle Passage, the harrowing journey of millions of Africans who were kidnapped and shipped to America as part of the Atlantic slave trade.\nCummings, who is reportedly white, allegedly had black students lie on the floor. At one point, the New York Daily News reports, she allegedly stepped on the back of at least one of the students and said, \"How does it feel? See how it feels to be a slave?\"\nThe student body at the William W. Niles School, M.S. 118, is 60 percent Hispanic, 21 percent black, 16 percent Asian and 3 percent white, according to the latest statistics from the New York City Department of Education.\nCummings has since been reassigned away from students and an investigation into the alleged incident is underway, according to New York City Department of Education spokesperson Toya Holness.\n\"While the investigation has not been completed, these are deeply disturbing allegations, and the alleged behavior has no place in our schools or in society. She has been reassigned away from students and we're providing the school with additional supports,\" Holness told ABC News in a statement Saturday.\nThe New York City Department of Education is deploying additional counselors and school-climate specialists to the school to support students and staff as needed, department officials told ABC News. The school's principal is meeting with students and families and the superintendent has visited the school to support the community. The school also sent a letter home with students to their families, the officials said.\nM.S. 118 principal Giulia Cox did not immediately respond to ABC News' request for comment Saturday.",
    "source_domain": "abcnews.go.com",
    "title": "A teacher allegedly had black students lie on floor for slavery lesson, sparking outrage",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/teacher-allegedly-black-students-lie-floor-slavery-lesson/story?id=52816180"
}