{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 14:25:57+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsyrian-troops-target-tunnels-trenches-damascus-54684321.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_d1f1788dcfdf4d5b8c945f88820a9761_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Syrian government launched a new operation Tuesday targeting tunnels used by the Islamic State group in the capital, state TV said, while shelling by the extremists on a government-held neighborhood left at least four dead.\nThe TV said the aim of the operation is to destroy trenches and tunnels in the Hajar al-Aswad neighborhood and the nearby Palestinian refugee camp of Yarmouk, which is also mostly controlled by the extremists.\nIS fighters in Hajar al-Aswad fired a shell on the nearby government-held neighborhood of Nahr Aisha, killing four people and wounding 15, state TV said. The Britain-based Syrian Observatory for Human Rights said the shelling killed five and wounded 17.\nA group of journalists taken to the adjacent neighborhood of Qadam on Tuesday witnessed intense shelling and airstrikes on IS positons in the camp and Hajar al-Aswad. The crackle of gunfire echoed from the heavily damaged area.\nThe area in southern Damascus is the last part of the capital not controlled by President Bashar Assad's forces. Other insurgents in the area, including an al-Qaida-linked group, have said they would relocate to rebel-held regions in northern Syria.\n\"The operation will continue until its goal is achieved,\" a Syrian military officer told reporters in Qadam, speaking on condition of anonymity under regulations.\nHe said the army is also working on separating IS-held areas in Hajar al-Aswad and Yarmouk from the nearby rebel-held suburbs of Beit Sahem, Babila and Yalda.\nTuesday's fighting focused on the Joura area in Hajar al-Aswad, from where thick smoke rose up into the sky.\nThe Observatory, an opposition-linked war monitoring group, said since the fighting began on Thursday, 15 troops and pro-government gunmen and 19 IS fighters have been killed. It said dozens were wounded on both sides.\nThe head of the U.N. agency for Palestinian refugees, UNRWA, said in a statement that it is deeply concerned for the fate of thousands of civilians, including Palestinian refugees, after days of fighting in Yarmouk, a built-up residential area.\nUNRWA's commissioner-general, Pierre Krahenbuhl, said the agency estimates there were about 6,000 Palestinian refugees in Yarmouk and about 6,000 in the surrounding areas, before the latest round of fighting began on Thursday.\n\"The humanitarian situation has long been very harsh and is rapidly deteriorating further, with supplies of food and medicine running low,\" Krahenbuhl said. \"There is no running water and very little electricity. Health care options are limited and there are no doctors remaining in the area.\"\nHe said UNRWA is prepared to open temporary shelters and provide relief and humanitarian assistance.\n———\nMroue reported from Beirut.",
    "source_domain": "abcnews.go.com",
    "title": "Syrian troops target IS tunnels, trenches in Damascus",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/syrian-troops-target-tunnels-trenches-damascus-54684321"
}