{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 11:15:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Pick 6: Rhule, Herman among new coaches facing scrutiny",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fpick-rhule-herman-coaches-facing-scrutiny-45502974.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/pick-rhule-herman-coaches-facing-scrutiny-45502974",
    "language": "en",
    "localpath": null,
    "maintext": "Setting expectations for Baylor in Year One under coach Matt Rhule is complicated.\nBaylor is still navigating the fallout of a scandal that led to the firing of coach Art Briles and the departures of an athletic director and school president. There is at least a possibility NCAA sanctions could follow.\nThe Bears are coming off a troubled 7-6 season under a lame-duck coaching staff, but from 2011-2015 they had four double-digit victory seasons and won two Big 12 titles. The Bears have the resources and infrastructure to remain a Big 12 contender, but it is no given they won't backslide to the bad ol' days.\nTheoretically, Rhule will be given some leeway by Baylor fans in 2017 to implement his systems and build his culture. The Bears are not void of talent, and they should benefit from a nonconference schedule that is not overly taxing. Still, it is hard to say what a successful first season at Baylor looks like for Rhule.\nHe will enter next season as one of the most scrutinized of 21 FBS head coaches starting new jobs.\nSix more new head coaches who will get little to no grace period:\nTom Herman, Texas\nThe Longhorns are coming off three straight losing seasons under Charlie Strong, but there is no talk of rebuilding in Austin. The narrative at Texas is Strong recruited well enough that his successor is taking over a team with enough talent to make a quick turnaround. Considering Herman walked into a similar situation at Houston in 2015 and went 13-1, good luck trying to temper expectations at Texas.\nMajor Applewhite, Houston\nHouston promoted Herman's offensive coordinator to keep a good thing going. Herman leaves behind one of the most talented rosters in the American Athletic Conference and a former five-star recruit quarterback in Texas A&M transfer Kyle Allen. Applewhite is a first-time head coach, competing in the toughest division of any Group of Five conference. Still, if the Cougars regress, fingers will point at him.\nCharlie Strong, USF\nSee a trend here? From Herman to his replacement to his predecessor. Strong has spent most of his professional career in Florida, so he was a natural fit with the Bulls. He inherits a team that went 11-2 last season, finished ranked 19th in the nation and returns one of the best quarterbacks in the country (Quinton Flowers). Anything less than another AAC title run for the Bulls will reflect poorly on Strong, who is trying to prove his struggles at Texas — not his successes at Louisville — were an anomaly.\nLane Kiffin, FAU\nThe Owls are coming off three straight 3-9 seasons, so there is no reason for high expectations. But you might have noticed that their new coach draws a lot of attention. Kiffin will be more closely followed than any Group of Five coach both for the product FAU puts on the field and how he acts off it.\nWillie Taggart, Oregon\nOregon just fired a coach (Mark Helfrich) two seasons removed from a national title game appearance. Patience is not in high supply around Eugene these days. Taggart has some rebuilding to do, but with Washington on the rise and USC's arrow pointing up, the Ducks need to show signs of progress fast or risk being relegated to the second-tier of the Pac-12 for a while.\nMike Sanford, Western Kentucky\nA first-time head coach, the youngest in FBS at 34, taking over a program at its peak. The Hilltoppers have not had a losing season since 2010 and went 23-5 with consecutive Conference USA titles the last two years under Jeff Brohm, now at Purdue.\nThere is nowhere to go but down, and some regression seems almost inevitable. Sanford will be learning on the job and he will need to be a quick study.\n———\nFollow Ralph D. Russo at www.Twitter.com/ralphDrussoAP\n———\nMore college football coverage at http://collegefootball.ap.org/",
    "source_domain": "abcnews.go.com",
    "title": "Pick 6: Rhule, Herman among new coaches facing scrutiny",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/pick-rhule-herman-coaches-facing-scrutiny-45502974"
}