{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:21:05+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Vice President Mike Pence discussed strategy to work with Japan and South Korea to \"achieve a peaceful resolution in the Korean peninsula,\" but the deputy North Korea UN Ambassador said \"the thermonuclear war may break out at any moment.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fnorth-korea-ready-us-attack-pence-heads-japan-46857319.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_gutman_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for North Korea says it's 'ready' for US attack as Pence heads to Japan\nWe are following lots of other important stories. President trump heading to Wisconsin where he's going to sign an executive order on buy American, hire American and sending tweets in a bid to stop a Democrat running in a special election in Georgia. The votes happening today. Overseas tensions are reaching a boiling point with North Korea. They promise weekly missile tests as vice president pence continues his tour of the region. Right to ABC's Matt Gutman in Seoul, South Korea, for all the latest, Matt. Reporter: Good morning, robin. We've been hearing more saber rattling with North Korea vowing those additional missile test, but everybody in the region still on tenterhooks awaiting the much anticipated nuclear test, that as vice president Mike pence in the region this morning saying all options are on the table including economic and diplomatic pressure. Overnight, vice president Mike pence in Japan reassuring U.S. Allies that Asia and warning North Korea that all options are still on the table. We will not rest and we will not relent until we achieve the objective of a denuclearized Korean peninsula. Reporter: With tensions between the U.S. And North Korea reaching a new boiling point, president trump offering three simple words to the country on Monday. Got to be behave. Reporter: North Korea on the defense. Its deputy U.N. Ambassador blaming the U.S. For putting the Korean peninsula on the brink of nuclear warfare essentially warning the hermit state would fight to the day. The thermonuclear war may break out any moment on the peninsula. Reporter: And defiantly battling a message back to president trump in an interview with the bbc saying if anything the country will only increase its missile tests. Our nuclear weapons protect us from that threat. We will be conducting more missile tests on a weekly, monthly and yearly basis, that as new details emerge on that failed missile test on Saturday. U.S. Officials say it was a medium or possibly short-range missile that blew up seconds after launch. It flew only about 34 miles before spinning out of control into the sea of Japan. While the range of this type of immigrant is unclear, north Korea is developing one that could travel over 2,000 miles within range of Guam and even longer range missiles, one of them could be capable of traveling over 7,000 miles able to hit the U.S. Mainland. Despite North Korea's latest provocations the white house saying the president likely won't be drawing red lines in the stand telling Fox News what his strategies are. I don't want to say what I'm thinking or doing. I'm not like other administrations. Reporter: Short of war some of the things that are being talked about limiting the already crippled exports of North Korea and grounding its national airline, all that tension already rippling across the pacific and Hawaii. Lawmakers are dusting off emergency plans. They would have only 20 minutes to prepare in case of a possible attack there. George. A lot of tension, Matt Gutman, thanks very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "North Korea says it's 'ready' for US attack as Pence heads to Japan",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/north-korea-ready-us-attack-pence-heads-japan-46857319"
}