{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2018-04-24 19:32:33+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "First lady Melania Trump's white ensemble stole the show Tuesday as she stepped out during President Donald Trump's first official State Visit of his presidency.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FStyle%2Fmelania-trumps-hat-steals-show-official-state-visit%2Fstory%3Fid%3D54691946.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/trump-macron-rt-jpo-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "First lady Melania Trump's white ensemble caught attention Tuesday as she stepped out during President Donald Trump's first official state visit of his presidency.\nMelania's suit jacket is from the Michael Kors Collection, the office of the FLOTUS confirmed to ABC News today. The jacket appears to be Kors' double crepe-sablé draped blazer, priced at $2,195, from the designer's Spring 2018 collection. The wide-brimmed hat was designed by Hervé Pierre.\nMichael Kors\nThe first lady was also sporting a pair of Christian Louboutin heels in Washington this morning.\nCommenters on Twitter praised Melania's fashion moment, some referencing Beyonce's look from the artist's 2016 music video, \"Formation.\"\nIt seems people are getting some serious Beyoncé 'Formation' vibes from Melania's hat this morning, but I can't see why tho. pic.twitter.com/KAlKon0fk2 — Minstra (@ViceRoyMinstra) April 24, 2018\nJoshua Roberts/Reuters\nThe Trumps were joined at the White House by the president of France, Emmanuel Macron, and his wife, Brigitte, who also wore white.\nTrumps, Macrons wave to the crowd from the White House balcony. https://t.co/XEHxGUnPUc pic.twitter.com/ydsNoWprdD — ABC News (@ABC) April 24, 2018\nABC News' Meridith McGraw contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Melania Trump's hat steals the show during first official state visit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Style/melania-trumps-hat-steals-show-official-state-visit/story?id=54691946"
}