{
    "authors": [
        "Abc News",
        "More Serena"
    ],
    "date_download": "2017-01-02 12:40:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Obama to Give His Farewell Speech in Chicago",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fobama-give-farewell-speech-chicago%2Fstory%3Fid%3D44506776.json",
    "image_url": "http://a.abcnews.com/images/Politics/RD-obama-ml-161229_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Obama is preparing to give his farewell speech from his home city of Chicago.\n\"I'll go home to Chicago to say my grateful farewell to you, even if you can't be there in person,\" he said in an email announcing the Tuesday, January 10 speech.\nHe said his farewell speech, like a peaceful transfer of power, follows the precedent set by George Washington in 1796.\n\"I'm just beginning to write my remarks. But I'm thinking about them as a chance to say thank you for this amazing journey, to celebrate the ways you've changed this country for the better these past eight years, and to offer some thoughts on where we all go from here,\" he wrote.\nThe email follows a series of tweets Sunday, in which he reflected on the past eight years.\nIt’s been the privilege of my life to serve as your President. I look forward to standing with you as a citizen. Happy New Year everybody. — President Obama (@POTUS) January 1, 2017\nHe said in his email that while there has been a \"fair share of challenges\" since 2009 we've \"come through them stronger.\"\n\"That's because we have never let go of a belief that has guided us ever since our founding -- our conviction that, together, we can change this country for the better,\" he said. \"So I hope you'll join me one last time. Because, for me, it's always been about you.\"",
    "source_domain": "abcnews.go.com",
    "title": "Obama to Give His Farewell Speech in Chicago",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/obama-give-farewell-speech-chicago/story?id=44506776"
}