{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:38:17+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Authorities said Douglas Haig did not have a license to make and sell the ammunition.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fman-allegedly-sold-ammunition-vegas-shooter-arrested-52819818.json",
    "image_url": "http://a.abcnews.com/images/WNT/180203_wn_bankert_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for A man who allegedly sold ammunition to the Vegas shooter has been arrested\nNext, a new arrest tied to the Las Vegas massacre. Douglas haig facing charges involving armor-piercing ammunition that he alleged manufactured and sold to Stephen paddock. He admitted to selling more than 700 rounds in the weeks before paddock killed 58 people. From his suite. ABC's Adrienne Bankert how police tied him to paddock and what he said about the shooter. I'm the guy who sold ammunition to paddock. Tonight, the man who admitted to selling bullets to Stephen paddock, is under arrest. Douglas haig now charged with conspiracy to manufacture and sell armor-piercing bullets. Those bullets heavily regulated because they cut right through the officer's vest. None of the ammunition that Doug sold to Mr. Paddock was used at all in the tragedy that occurred in Las Vegas. Reporter: In September, just 12 days before the tragic Vegas shooting, haig said paddock bought 720 rounds of high-caliber tracer ammunition at his Arizona home. He says this transaction was legal. He pulled up, very well-dressed. Very well groomed. Very polite. Reporter: Wasn't legal was selling that armor-piercing. Also, his fingerprints on two unused cartridges. Paddock would slaughter 58 people at that Las Vegas music festival. More than 500 injured. Many still recovering like these women. Our new Normal is starting to form four months later. And so, we're trying. Reporter: This week, they received news of the arrest just before attending their first live concert before the massacre. One more note from the federal documents, when paddock bought that ammo he put haig put on gloves beforehandling the boxes. Now, to a deadly encounter between a police officer and a car chase suspect, the pursuit\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "A man who allegedly sold ammunition to the Vegas shooter has been arrested",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/man-allegedly-sold-ammunition-vegas-shooter-arrested-52819818"
}