{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 00:10:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Business Highlights",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbusiness-highlights-45496993.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/business-highlights-45496993",
    "language": "en",
    "localpath": null,
    "maintext": "___\n2 big insurance breakups on Valentine's Day\nCigna says it is ending Anthem's proposed, $48-billion acquisition bid and seeking billions in damages from the Blue Cross-Blue Shield insurer. The announcement comes hours after another major insurer, Aetna Inc., said it was abandoning its planned, $34-billion purchase of Medicare Advantage provider Humana Inc.\n———\nYellen: Expect Fed to resume raising rates in coming months\nWASHINGTON (AP) — Federal Reserve Chair Janet Yellen pointed Tuesday to a solid U.S. job market and economy and suggested that the Fed will resume raising interest rates in the next few months. But with many uncertainties surrounding President Donald Trump's proposals, Yellen said the Fed still wants to keep assessing the economy.\n———\nJumping bank stocks push US indexes higher; bond yields rise\nNEW YORK (AP) — U.S. stock indexes climbed further into record territory, led by a push higher for banks. Bond yields rose after Federal Reserve Chair Janet Yellen said the central bank is still on track to raise interest rates gradually.\n———\nWith Trump's win in China, will Trump toilets get flushed?\nSHANGHAI (AP) — China is expected to give President Trump valuable rights to his brand for construction services this week. Chinese authorities denied him that benefit for a decade, but after Trump declared his candidacy his fortunes changed. Ethics lawyers say Trump's foreign trademarks are a conflict of interest that may violate the Constitution. Meanwhile, makers of Trump-brand luxury toilets in Shenzhen are contemplating a new legal adversary: the president of the United States.\n———\nJumping bank stocks push US indexes higher; bond yields rise\nNEW YORK (AP) — U.S. stock indexes climbed further into record territory, led by a push higher for banks. Bond yields rose after Federal Reserve Chair Janet Yellen said the central bank is still on track to raise interest rates gradually.\n———\nLeaders of American Airlines pilots' union blast CEO\nDALLAS (AP) — Support from labor unions was critical when Doug Parker's US Airways forced a merger with American, but now the CEO of the world's biggest airline is under fire from unions unhappy about pay that lags rates at rival Delta. Leaders of the pilots' union say they have lost confidence in the ability of Parker and senior executives to lead the airline. Flight attendants picketed Tuesday at company headquarters and three big airports.\n———\nUS says canceled flights declining, fewer bags getting lost\nThe government says airlines are getting better at avoiding canceled flights, losing bags and bumping passengers. The Transportation Department also says 2016 was one of the best years for on-time arrivals.\n———\nBuffett's firm invests heavily in Apple, airline stocks\nOMAHA, Neb. (AP) — Warren Buffett's company nearly quadrupled its investment in Apple to over 57 million shares during the last three months of last year. Berkshire Hathaway Inc. filed a quarterly update on its U.S. stock portfolio with the Securities and Exchange Commission on Tuesday.\n———\nJudge gives OK to deal for smaller set of cheating VWs\nSAN FRANCISCO (AP) — A judge in San Francisco granted initial approval to a deal worth at least $1.2 billion that aims to compensate owners of roughly 78,000 Volkswagens with 3-liter engines that were rigged to cheat on emissions tests. The company previously agreed to spend up to $10 billion buying back or repairing Volkswagens and Audis with 2-liter diesel engines. U.S. District Judge Charles Breyer congratulated attorneys on both sides before granting preliminary approval to the smaller deal on Tuesday\n———\nMerck Alzheimer's drug fails in 1 study; another continues\nMerck & Co. says it will stop its study of an experimental Alzheimer's drug in people with mild or moderate symptoms because interim results showed \"virtually no chance\" of any benefit\n———\nPSA Group exploring takeover of GM's European unit Opel\nFRANKFURT, Germany (AP) — France's PSA Group, maker of Peugeot and Citroen cars, says it's exploring \"a potential acquisition\" of Opel, the money-losing European business of General Motors Co. PSA Group and GM are already involved in several joint projects in Europe.\n———\nThe Dow Jones industrial average rose 92.25 points, or 0.5 percent, to 20,504.41. The Standard & Poor's 500 index rose 9.33 points, or 0.4 percent, to 2,337.58 for its sixth straight day of gains. The Nasdaq composite rose 18.62, or 0.3 percent, to 5,782.57.\nBenchmark U.S. crude oil rose 27 cents to settle at $53.20 per barrel. Brent crude, the international standard, rose 38 cents to $55.97 a gallon in London. Natural gas fell 4 cents to $2.91 per 1,000 cubic feet, heating oil rose a penny to $1.64 per gallon and wholesale gasoline was close to flat at $1.55 a gallon.",
    "source_domain": "abcnews.go.com",
    "title": "Business Highlights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/business-highlights-45496993"
}