{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:28:14+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fstudy-california-gun-deaths-declined-2000-2015-54703875.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_03dfdb3394854675bcbf2ecb83a1d03e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Gun deaths have fallen in California over a 16-year period ending in 2015, driven largely by a decline in gang violence and black homicides a recent and rare scientific study of firearm violence has found.\nResearchers at the University of California, Davis published their findings in the May issue of the journal Annals of Epidemiology after reviewing 50,921 firearm deaths recorded in California between 2000 and 2015. The University provided the study results on Monday.\nThe report found 24,922 firearm homicides during that period and 23,682 suicides by gun. Researchers say the number of firearm homicides dropped from 4.19 per 100,000 people in 2000 to a low of 3.13 per 100,000 in 2014 before ticking up slightly in 2015.\nResearcher Veronica Pear attributed the decline in gun homicides to a reduction of gang violence, particularly in Los Angeles County.\nThe study also showed a big drop in the number of black men being killed by guns.\nPear said the number of gun homicides of black men dropped 32 percent from the peak in 2005 at 47 per 100,000 people to 31 per 100,000 in 2015. The homicide rate for Hispanic men was 6.7 per 100,000 in 2015, a 38 percent decline from its peak of 10.8 per 100,000 in 2005.\nThe homicide rate of White and Asian men held steady throughout the period at roughly the same level of roughly 3 homicides per 100,000 annualy.\nPear said she hopes the new research will be used by others studying the cause and effects of gun violence.\n\"We also hope it can serve as a template for researchers in other states to create similar profiles,\" she said.\nFor the last 30 years, the federal government has largely abandoned gun-violence studies after the National Rifle Association prevailed on Congress to significantly restrict funding for the Centers for Disease Control and Prevent to do the research. The NRA said it does not oppose gun research but is against research that it calls biased, flimsy or aimed at advocacy.\nA few private foundations and California have recently stepped up funding of gun violence studies. California became the first state to publicly support the research when lawmakers voted to fund U.C. Davis' Violence Prevention Research Program with $5 million over five years.\nThe Kaiser Permanente health care consortium announced earlier this month it would spend $2 million to study gun violence among its 12 million members.",
    "source_domain": "abcnews.go.com",
    "title": "Study: California gun deaths declined between 2000 and 2015",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/study-california-gun-deaths-declined-2000-2015-54703875"
}