{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:19:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "British cybersecurity expert expected in court on US charges",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fbritish-cybersecurity-expert-expected-court-us-charges-49203055.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/british-cybersecurity-expert-expected-court-us-charges-49203055",
    "language": "en",
    "localpath": null,
    "maintext": "A British cybersecurity researcher credited with helping curb a recent worldwide ransomware attack is expected in court Monday to hear federal charges accusing him of creating malicious software to steal banking information three years ago.\nMarcus Hutchins could enter a plea during the hearing in Wisconsin federal court, where prosecutors charged him and an unnamed co-defendant with conspiring to commit computer fraud in the state and elsewhere. Authorities arrested the 23-year-old man on Aug. 2 at McCarran International Airport in Las Vegas, where he was going to board a flight to his home in Ilfracombe, England. He had been in Las Vegas for a cybersecurity convention.\nHutchins is free on $30,000 bail, but with strict conditions. He must wear an ankle monitor and stay at a halfway house or under house arrest in Las Vegas until his Monday hearing. A judge also ordered him to surrender his passport and barred him from using any device with access to the internet.\nHutchins' attorney, Adrian Lobo, has not responded to several phone messages from The Associated Press over the last week.\nThe legal troubles Hutchins faces are a dramatic turnaround from the status of cybercrime-fighting hero he enjoyed four months ago when he found a \"kill switch\" to slow the outbreak of the WannaCry virus. It crippled computers worldwide, encrypting files and making them inaccessible unless people paid a ransom ranging from $300 to $600.\nProsecutors allege that before Hutchins won acclaim he created and distributed a malicious software called Kronos to steal banking passwords from unsuspecting computer users. In addition to computer fraud, the indictment lists five other charges, including attempting to intercept electronic communications and trying to access a computer without authorization.\nThe indictment says the crimes happened between July 2014 and July 2015, but the court document doesn't offer any details about the number of victims. Prosecutors have not said why the case was filed in Wisconsin. The name of Hutchins' co-defendant is redacted from the indictment.\nHutchins faces decades in prison if convicted on all the charges.",
    "source_domain": "abcnews.go.com",
    "title": "British cybersecurity expert expected in court on US charges",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/british-cybersecurity-expert-expected-court-us-charges-49203055"
}