{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:03:36+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Fcorrection-film-tomb-raider-fitness-story-53860781.json",
    "image_url": "http://abcnews.go.com/Lifestyle/wireStory/correction-film-tomb-raider-fitness-story-53860781",
    "language": "en",
    "localpath": null,
    "maintext": "In a story March 16 about Alicia Vikander's preparations for the new \"Tomb Raider\" film, The Associated Press reported erroneously that trainer and nutritionist Magnus Lygdback worked with Gal Gadot on \"Wonder Woman.\" He is training Gadot for the upcoming sequel, but did not work with the actress on the original film.\nA corrected version of the story is below:\nBeing Lara Croft takes months of training, plates of protein\nIt took months of training and endless plates of protein to transform former ballerina Alicia Vikander into musclebound badass Lara Croft in the new \"Tomb Raider\" film\nBY SANDY COHEN\nAP Entertainment Writer\nLOS ANGELES (AP) — It took months of training and endless plates of protein to transform former ballerina Alicia Vikander into musclebound action hero Lara Croft for the new \"Tomb Raider\" film.\nThe 29-year-old Oscar winner spent seven months working with Swedish trainer and nutritionist Magnus Lygdback, who also helped Ben Affleck get into superhero shape for \"Justice League\" and is helping Gal Gadot train for the upcoming \"Wonder Woman\" sequel.\nLygdback and his team of fitness professionals hosted a boot camp in Los Angeles recently to demonstrate Vikander's \"Tomb Raider\" training regimen.\n\"Physically, anyone can train to be a superhero,\" Lygdback said.\nDiet is paramount, even more than physical training, he said. He directs his clients to eat every three hours and avoid sugar and \"fast carbs\" like white rice and flour.\n\"You'll see a big change, mentally and physically, just by changing the nutrition,\" he said.\nVikander spent seven months preparing to become Croft. The first three were just about diet, Lygdback said. His clean-eating plan includes lots of protein and vegetables. A sampling at the \"Tomb Raider\" boot camp featured broccoli blossoms and seared steak. He says 17 out of 20 meals should be on point, with three splurge meals in the mix.\n\"I love desserts. I love chocolate. I love a glass of Barolo on a Saturday night,\" said Lygdback, whose Hercules-shaped form appears to have zero body fat.\nFour months ahead of filming, Vikander began working daily with Lygdback for hour-long sessions incorporating martial arts, weight training and movement education to give her a greater command of her body.\nThe process didn't just pack muscle onto Vikander's slender frame.\n\"Magnus really helped me transform for the role,\" she said. \"And gain a sense of empowerment.\"\n\"Tomb Raider\" opens Friday.\n———\nAP Entertainment Writer Sandy Cohen is at www.twitter.com/YouKnowSandy .",
    "source_domain": "abcnews.go.com",
    "title": "Correction: Film-Tomb Raider-Fitness story",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/correction-film-tomb-raider-fitness-story-53860781"
}