{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 16:41:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "This Week: Fed meeting, jobless claims, Costco earnings",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fweek-fed-meeting-jobless-claims-costco-earnings-51718620.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/week-fed-meeting-jobless-claims-costco-earnings-51718620",
    "language": "en",
    "localpath": null,
    "maintext": "A look at some of the key business events and economic indicators upcoming this week:\nRate hike?\nInvestors believe the Federal Reserve will raise interest rates at a two-day meeting that wraps up Wednesday. At its last meeting in November the panel decided to keep the Fed's benchmark interest rate unchanged in a low range of 1 percent to 1.25 percent. With the economy on solid footing, the Fed is expected to raise rates for the third time this year.\nEye on jobs\nOn Thursday the Labor Department releases data on the number of initial jobless claims last week. Initial claims, a proxy for layoffs, fell to 236,000 two weeks ago. Economists forecast the number rose slightly last week. In October initial jobless claims fell to a four-decade low of 223,000.\nDec. 9 est. 238,000\nDec. 1 236,000\nNov. 24 238,000\nNov. 17 240,000\nNov. 10 252,000\nNov. 3 239,000\nCostco earnings\nIssaquah, Washington-based Costco Wholesale reports its first-quarter earnings on Thursday. Costco's shares slumped nearly 7.5 percent in October after it said its gross margins shrank in the fourth quarter. The stock has rallied about 20 percent since then, reaching an all-time high. Analysts surveyed by FactSet expect Costco to report earnings per share rose to $1.33, up from $1.17 a year earlier.",
    "source_domain": "abcnews.go.com",
    "title": "This Week: Fed meeting, jobless claims, Costco earnings",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/week-fed-meeting-jobless-claims-costco-earnings-51718620"
}