{
    "authors": [
        "Abc News",
        "More Hakyung"
    ],
    "date_download": "2018-07-04 14:38:15+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The two Koreas are getting together to determine 100 families for reunions.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Ftime-running-south-koreans-hoping-reunite-family-north%2Fstory%3Fid%3D56339952.json",
    "image_url": "https://s.abcnews.com/images/International/Korea-Reunions-ap-8-er-180703_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kim Kyung Jae was 19 years old when he fled south to take shelter as the Korean War broke out in 1950, leaving behind a younger sister he hasn't seen since.\nHis decision to flee is one he says he's regretted ever since.\nNow 87, Kim Kyung Jae knows his opportunities for a reunion are limited.\nKorea Pool Photo/AP,FILE\nAfter more than 60 years of separation, he found out last week a lottery precipitated by the thawing relationship between North and South Korea will not provide his chance.\nThe two governments announced they will allow a precious few 100 separated families to reunite at Mount Kumgang in North Korea next month. The reunions will come over a one-week period starting on Aug. 20. The chance of a reunion is small: 56,890 people in the South applied to see loved ones in the North. The list was eventually whittled down to 250 people, as announced by South Korea's Red Cross.\nThe North's Red Cross exchanged its own list of 200 people on Tuesday and the final 100 families scheduled to meet at the August reunion will be decided based on availability.\nThe tens of thousands in South Korea who didn’t make the list of candidates, people like Kim Kyung Jae, found out last Monday they were out of luck.\nKim Kyung Jae, who leads a civilian organization that tries to connect separated families in North Korea through handwritten letters, doesn't know if he will ever see his sister again.\n\"I hold little hope for the opportunity,\" Kim, who turned 87 years old this January, told ABC News. \"We, separated family members, say getting picked for the reunion at Mount Kumgang is harder than winning the lottery. I cannot explain how grateful I will be if I’m given the chance.\"\nNo one expected the division of the two Koreas to last over 60 years. When they lost their family members in the ravages of war, many thought it would be a temporary separation.\nKim Byung Sam, a high schooler at the time, recalled United Nations soldiers guiding the townspeople to vacate his town for just one week. That one week turned out to be an eternity.\n\"Villagers did not care to fix their windows or doors, because they believed in going back to their hometown up North,\" said Park Hyung Sook, who came to the South with her parents as a child.\nPark was only 3 years old when her family took refuge in a small fishing village in the South. Her parents, who spent their later years longing for their hometown and relatives in North, died of old age.\nFor the separated families, time is literally running out.\nMore than 20 percent of those alive are already over 90 years old. Separated family members in their 80s account for 41.4 percent, while those in their 70s form 22.4 percent of the total 56,890 separated, according to South Korea’s Unification Ministry.\nYonhap/EPA/REX/Shutterstock\nKim Jin Sub, 83, has given up hope he will meet his relatives in North Korea.\n\"I wish to step on my hometown soil for one last time,\" Kim Jin Sub told ABC News. \"Most of my memory of relatives has faded already. I’m barely holding onto my dim recollection of my town, the waters, trees and the atmosphere.\"\nKorea Pool Photo/AP,FILE\nThe first family reunion for separated families took place in August 2000, following the first inter-Korean summit by then-South Korean president Kim Dae-jung and late North Korean leader Kim Jong Il. A total of 20 reunion events have taken place since.\nIf the next family reunion goes as planned, it will happen two years and 10 months since the last reunion in October 2015.\n\"I want to meet my younger sister and brother in my hometown just like the old days,\" Kim Byung Sam said. \"It is not long till I die. What else can I pray for?\"\nABC News' Jaesang Lee contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Time running out for South Koreans hoping to reunite with family in the North",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/time-running-south-koreans-hoping-reunite-family-north/story?id=56339952"
}