{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:47:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Bodies found amid search for 2 missing Indiana teens",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fbodies-found-amid-search-missing-indiana-teens-45495604.json",
    "image_url": "http://abcnews.go.com/US/wireStory/bodies-found-amid-search-missing-indiana-teens-45495604",
    "language": "en",
    "localpath": null,
    "maintext": "Authorities suspect foul play after two bodies were found along a northern Indiana creek amid a search for two missing 13-year-old girls, police said Tuesday.\nThe bodies were found along Deer Creek about 1 mile east of Delphi, Indiana State Police Sgt. Kim Riley told a news conference.\n\"We are investigating this as a crime scene,\" Riley said. \"We suspect foul play.\"\nRiley said authorities haven't yet positively identified the bodies. He declined to comment on any injuries they might have suffered or to discuss the ages of the victims, but he said the search for the two missing girls had been scaled back significantly.\nRiley says the bodies were found Tuesday on the edge of the creek about three-quarters of a mile from an abandoned railroad bridge where the two girls, Liberty German and Abigail Williams, had been dropped off to go hiking Monday. They were reported missing hours later after they did not appear at a predetermined meeting place.\nSearch parties scoured the base of the bridge, known locally as the Monon High Bridge, and surrounding trails Monday night, but darkness made it nearly impossible, Carroll County Sheriff Tobe Leazenby said.\nRiley declined to disclose who found the bodies.\nDelphi Police Chief Steve Mullins said the discovery of the bodies and search for the girls has shocked the community about 60 miles northwest of Indianapolis.\n\"I know it's had a terrible effect on our people and we are grieved this sort of thing would happen here in our community,\" Mullins told the news conference.",
    "source_domain": "abcnews.go.com",
    "title": "Bodies found amid search for 2 missing Indiana teens",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/bodies-found-amid-search-missing-indiana-teens-45495604"
}