{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 10:02:13+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Yellen lands new job at Brookings Institution",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fyellen-lands-job-brookings-institution-52797421.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_7fd730649a17448998ca92f5bb14bf09_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Federal Reserve Chair Janet Yellen, the first woman to head the nation's central bank, got a boisterous send-off from Fed staff, but she isn't taking any time off. After her last day at the Fed on Friday, she will start a new job Monday at the Brookings Institution.\nThe Washington think tank announced that Yellen will be joining the institution's Hutchins Center on Fiscal and Monetary Policy as a distinguished fellow in residence. One of her colleagues will be her predecessor, former Chairman Ben Bernanke, who joined Brookings in 2014 when he stepped down from the Fed.\nIn an interview on her last day, Yellen said for the first time publicly that she was disappointed that President Donald Trump did not nominate her for a second term. She is the first Fed leader not to be given the chance to serve a second term in four decades.\n\"I would have liked to serve an additional term and I did make that clear\" when she interviewed with Trump, Yellen said in an interview broadcast by PBS. \"So I would say I was disappointed not to be re-appointed.\"\nBut Yellen said that she was grateful for the Fed career she did have which covered not only a four-year term as Fed chair but also serving as Fed vice chair for four years before that and also service as president of the Fed's San Francisco regional bank.\n\"I really have had a seat at the table through tumultuous times including the financial crisis and the recovery and its wake and I am very satisfied with the career that I have had.\"\nIn a tweet Friday, Bernanke said, \"I congratulate Janet on her outstanding public service and look forward to being her colleague at the Brookings Institution.\"\nTrump decided against offering her a second term and instead tapped Fed board member Jerome Powell. Powell will be sworn in Monday.\nHundreds of Fed staffers gathered Thursday to celebrate Yellen's Fed tenure, welcoming her with prolonged applause when she appeared in the Fed's giant atrium, according to participants at the staff gathering. Yellen told the staff that they would be in good hands under Powell's leadership.\nIn his remarks, Powell praised Yellen as the most qualified person to hold the job of Fed chair in the central bank's history.\nPowell, who has served on the Fed board with Yellen since 2012, ended his remarks by popping the collar of his suit jacket. He joined other Fed staffers and others online have used the #PopYourCollar hashtag on social media in recent days in tribute to Yellen's trademark wardrobe style of wearing her collars turned up.",
    "source_domain": "abcnews.go.com",
    "title": "Yellen lands new job at Brookings Institution",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/yellen-lands-job-brookings-institution-52797421"
}