{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:25:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Syria envoy says Geneva talks to focus on transition",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fkazakhstan-postpones-syria-talks-day-45505276.json",
    "image_url": "http://abcnews.go.com/International/wireStory/kazakhstan-postpones-syria-talks-day-45505276",
    "language": "en",
    "localpath": null,
    "maintext": "The U.N. envoy to Syria says negotiating a political transition for the war-torn country will be the sole item on the agenda for upcoming talks between the government and opposition in Geneva.\nStaffan De Mistura emphatically rejected any change to the agenda, saying it would open a \"Pandora's box\" of stalling and time-wasting.\n\"Geneva will not be about the procedure, but about the future,\" he told reporters in joint press conference with Italian Foreign Minister Angelino Alfano, in Rome.\nThe envoy said the agenda is fixed in U.N. Security Council Resolution 2254, which mandates a new form of governance for Syria, a new constitution, and new elections. The resolution was adopted unanimously by the Security Council in 2015.\nThe Syrian government has previously rejected such formulations, complicating efforts aimed at ending the conflict. The government holds the upper hand in Syria more than a year after a sweeping Russian intervention turned the tide of the nearly six-year war in its favor.\nThe envoy urged the opposition to present a unified front at Geneva, in order to deprive the government of the \"alibi\" that it doesn't know who the opposition is.\nThe Geneva talks, slated for Feb. 23, are expected to bring together representatives from President Bashar Assad's government with exiled opposition figures and rebels fighting inside Syria.\nBut some of Syria's rebels say they won't begin negotiating a political settlement with the government until measures are taken to bolster a flagging cease-fire and address urgent humanitarian concerns.\nMohammad Alloush, a rebel leader who is representing the opposition at talks this week in Kazakhstan, said he will insist on discussing the Dec. 30 cease-fire. The talks in the Kazakh capital, Astana, are intended to pave the way for next week's revival of the Geneva process, which has been on hold since last April.\nThe Kazakhstan talks are brokered by Russia and Turkey, which back opposing sides in the war and have taken the lead with peace efforts since December. The Syrian government delegation met with the Russian delegation in Astana on Wednesday, Syrian state TV reported.\nRussia and Iran, close allies of President Bashar Assad, and Turkey, which backs the rebels, previously pledged to enforce the cease-fire, but both sides have alleged repeated violations. A round of talks in Astana last month ended inconclusively.\nThe rebels say they are awaiting a reply from Russia to a list of requests concerning the observation and enforcement of the cease-fire.\n\"The paper we presented on 23 January is the basis for talks today,\" Alloush told the AP by phone on his way to Astana.\nThe Kazakhstan talks were supposed to begin Wednesday but were postponed by one day. The Kazakh Foreign Ministry did not give a reason for the delay. The Geneva talks are scheduled for Feb. 23.\nSyria's Foreign Ministry meanwhile rejected a Human Rights Watch report accusing government forces of mounting at least eight chemical attacks using chlorine gas on opposition-held residential areas during the final months in last year's battle for the northern city of Aleppo. The report was published on Monday.\n———\nAssociated Press cameraman Gianfranco Stara in Rome and AP writer Albert Aji in Damascus, Syria contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Syria envoy says Geneva talks to focus on transition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/kazakhstan-postpones-syria-talks-day-45505276"
}