{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:11:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The Office of Government Ethics is calling on the White House to investigate actions of counselor to the president, Kellyanne Conway, after she appeared on television and promoted the apparel and accessories brand owned by Ivanka Trump.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fgovernment-ethics-office-asks-white-house-investigate-conway-45505346.json",
    "image_url": "http://a.abcnews.com/images/Politics/170215_atm_chaffetz_probe_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Government Ethics Office asks White House to investigate Conway\nAmid growing questions about the trumped teens ties to Russia from senate Republicans. Deep concern. Obviously there's. Administration that is significant disarray. As far as. National security is concerned. Top Republicans like senate majority leader Mitch McConnell say it's quote highly likely the senate will investigate Michael flames conversations with Russian officials but some Republicans. I'm more reluctant that seems to have resolved itself with the White House thinking. Some decisive action. Congressman Jason she fits the chair of the house oversight committee vigorously led the investigation into Hillary Clinton's emails but says he has no plans to investigate flames ties to Russia. We've been asked him for months of basic oversight but our chairman Jason chases. Has not lifted one finger. Changed its is however investigating whether White House counselor Kellyanne Conway cross the line by promoting me Barca trumps brand on television I fully admitted to scale back in the pre commercial here and go quiet everybody this as chief its demands answers into these pictures the president and the Japanese prime minister at mar Alando huddling with advisors after learning in North Korea launched a missile club members witnessing it all summer posting pictures on FaceBook raising security questions. The a look at Mara lot go you'll look at Kellyanne Connolly and they bond them ran but not at the trump teams ties to Russia. At this point I am. Holding out all my options Mary Bruce ABC news Washington.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Government Ethics Office asks White House to investigate Conway",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/government-ethics-office-asks-white-house-investigate-conway-45505346"
}