{
    "authors": [
        "Abc News",
        "More Katie"
    ],
    "date_download": "2018-07-04 09:46:35+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The Duchess of Sussex has worn neutral colors to five recent public engagements.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FShop%2Fduchess-meghan-steps-pink-cream-shades-shop%2Fstory%3Fid%3D56211591.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/markle-zp-ml-180629_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Meghan Markle made a bold splash into Britain’s royal family when she wed Prince Harry in May.\nNow that she is a royal, she is choosing to go neutral when it comes to her fashion choices.\nNeil Hall/Pool via EPA/Shutterstock\nThe Duchess of Sussex, 36, has worn shades of either cream or blush at each of her five public engagements since her May 19 wedding.\nFor her very first post-wedding appearance, Meghan wore a rose wool-crepe dress by Goat.\nDominic Lipinski/Pool via Reuters\nAt her first Trooping the Colour appearance, Meghan went bold in an off-the-shoulder suit by Carolina Herrera, but the color of the suit was pale pink.\nMax Mumby/Indigo/Getty Images\nFor the Queen’s Young Leader Awards at Buckingham Palace, Meghan again wore a light pink dress by Prada.\nJohn Stillwell/Pool Photo via AP\nShe chose a cream Givenchy dress for her first joint engagement with Queen Elizabeth and a cream shirt dress, also by Givenchy, for the Royal Ascot.\nJeff J Mitchell/Getty Images\nMax Mumby/Indigo/Getty Images\nThe pink and cream style choices -- which some fashion watchers have speculated are part of a new fashion strategy for the Duchess -- are also perfect for summer.\nHere are five dresses to try in Meghan's signature shades.\nThese products were curated by our “GMA” editorial team. “GMA” has affiliate partnerships, so we will get a small share of revenue from your purchases through these links. All product prices are determined by the retailer and subject to change. By visiting these websites, you will leave GoodMorningAmerica.com and any information you share with the retailer will be governed by their website’s terms and conditions and privacy policies.\nPopover midi dress by Vince Camuto\nNordstrom\nAvailable at Nordstrom.com.\nBell-sleeve crepe shift dress by Eliza J\nNordstrom\nAvailable at Nordstrom.com.\nLace detail crepe sheath dress by Maggy London\nNordstrom\nAvailable at Nordstrom.com.\nWrap dress by Lost Ink\nNordstrom\nAvailable at Nordstrom.com.\nRuffle trim midi dress by BP\nNordstrom\nAvailable at Nordstrom.com.",
    "source_domain": "abcnews.go.com",
    "title": "Duchess Meghan steps out in pink, cream shades: Shop the look",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Shop/duchess-meghan-steps-pink-cream-shades-shop/story?id=56211591"
}