{
    "authors": [
        "Abc News",
        "Katie Kindelan",
        "More Carolyn",
        "More Katie"
    ],
    "date_download": "2018-05-30 15:20:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Harry, 33, and Markle, 36, wed on May 19 at St. George's Chapel.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fprince-harry-meghan-markles-honeymoon%2Fstory%3Fid%3D55527645.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/harry-meghan-rt-ml-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Prince Harry and Meghan Markle are now on their honeymoon, but exactly where remains a mystery.\nInterested in Royal Family? Add Royal Family as an interest to stay up to date on the latest Royal Family news, video, and analysis from ABC News. Add Interest\nMost speculation has the couple, now the Duke and Duchess of Sussex, spending private time in Africa, a place of significance for Meghan and Harry.\n\"It’s believed they are spending some time in Africa, possibly Namibia, and potentially [taking] another trip after that as part of the honeymoon,\" said Roya Nikkhah, an ABC News royal contributor.\nNeil Hall/Pool via EPA/Shutterstock\nIt was Africa where Harry, 33, whisked Meghan, 36, away just around four weeks after the couple first met on a blind date in London last July.\n\"I managed to persuade her to come and join me in Botswana and we camped out with each other under the stars,\" Harry said in his post-engagement interview with Markle last November. \"She came and joined me for five days out there, which was absolutely fantastic.\"\nHe continued, \"So then we were really by ourselves, which I think was crucial to me to make sure we had a chance to get to know each other.\"\nHarry also included Botswana in Meghan's engagement ring. The main stone in Meghan's ring is sourced from Botswana, while the diamonds surrounding it are from the jewelry collection of Harry's mother, the late Princess Diana.\nHarry shared last year that Botswana will always have sentimental value to him.\n\"I first came in 1997, straight after my mum died,\" he said. \"My dad told my brother and me we were going to Africa to get away from it all.\"\nBenoit Tessier/Reuters\n\"This is where I feel more like myself than anywhere else in the world,\" Harry continued. \"I have this intense sense of complete relaxation and normality here.\"\nHarry and Meghan have kept a private schedule since making their first post-wedding appearance at a Buckingham Palace garden party for Prince Charles on May 22.\nIan Vogler/Pool via Reuters\nThe duke and duchess were married on May 19 at St. George's Chapel in front of around 600 guests and a worldwide television audience of millions.\nThe couple's next public appearance is expected to be for Queen Elizabeth's official birthday celebration, Trooping the Colour, on June 9.\nThe day will be a milestone for Meghan: Her first appearance on the balcony of Buckingham Palace as a member of Britain's royal family.\nAlexi Lubomirski/Kensington Palace via AP\nHarry and Meghan's first major tour as husband and wife will be in October as part of Harry’s new role as Commonwealth Youth Ambassador.\nThey are expected to travel to Australia, New Zealand, Fiji and Tonga.\nIn Australia, Meghan and Harry will visit Sydney for the 2018 Invictus Games, the Paralympic-style sporting event Harry founded for service men and women.",
    "source_domain": "abcnews.go.com",
    "title": "Prince Harry and Meghan Markle's honeymoon: Where could they be?",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/prince-harry-meghan-markles-honeymoon/story?id=55527645"
}