{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 07:55:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Taylor Swift hopes verdict inspires assault victims",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Ftaylor-swift-hopes-inspire-assault-victims-trial-49221571.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_365c63f0a97d409fa0f437b97d1fe263_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Immediately after a jury determined that Taylor Swift had been groped by a radio station host before a concert in Denver, the singer-songwriter turned to one of her closest allies — her mother — and later said she hoped the verdict would inspire other victims of sexual assault.\nSwift hugged her crying mother after the six-woman, two-man jury said in U.S. District Court on Monday that former Denver DJ David Mueller had groped the pop star during a photo op four years ago. Per Swift's request, jurors awarded her $1 in damages — a sum her attorney, Douglas Baldridge, called \"a single symbolic dollar, the value of which is immeasurable to all women in this situation.\"\nSwift released a statement thanking her attorneys \"for fighting for me and anyone who feels silenced by a sexual assault.\"\n\"My hope is to help those whose voices should also be heard,\" she said, promising to make unspecified donations to groups that help victims of sexual assault.\nNancy Leong, a law professor at the University of Denver, said the verdict is important because \"we are getting to the point in society that women are believed in court. For many decades and centuries, that was not the case.\"\nLeong, who also teaches in the university's gender studies program, said the verdict will inspire more victims of sexual assault to come forward.\n\"The fact that she was believed will allow women to understand that they will not automatically be disbelieved, and I think that's a good thing,\" Leong said.\nSwift and her mother initially tried to keep the accusation quiet by reporting the incident to Mueller's bosses and not the police.\nBut it inevitably became public when Mueller sued Swift for up to $3 million, claiming the allegation cost him his $150,000-a-year job at country station KYGO-FM, where he was a morning host.\n\"I've been trying to clear my name for four years,\" he said after the verdict in explaining why he took Swift to court. \"Civil court is the only option I had. This is the only way that I could be heard.\"\nSwift countersued for assault and battery, and during an hour of testimony blasted a low-key characterization by Mueller's attorney, Gabriel McFarland, of what happened. While Mueller testified he never grabbed Swift, she insisted she was groped.\n\"He stayed attached to my bare ass-cheek as I lurched away from him,\" Swift testified.\n\"It was a definite grab. A very long grab,\" she added.\nMueller emphatically denied reaching under the pop star's skirt or otherwise touching her inappropriately, insisting he touched only her ribs and may have brushed the outside of her skirt as they awkwardly posed for the picture.\nThat photo was virtually the only evidence besides the testimony.\nIn the image shown to jurors during opening statements but not publicly released, Mueller's hand is behind Swift, just below her waist. Both are smiling. Mueller's then-girlfriend is standing on the other side of Swift.\nSwift testified that after she was groped, she numbly told Mueller and his girlfriend, \"Thank you for coming,\" and moved on to photos with others waiting in line because she did not want to disappoint them.\nBut she said she immediately went to her photographer after the meet-and-greet ended and found the photo of her with Mueller, telling the photographer what happened.\nSwift's mother, Andrea Swift, testified that she asked radio liaison Frank Bell to call Mueller's employers. They did not call the police to avoid further traumatizing her daughter, she said.\n\"We absolutely wanted to keep it private. But we didn't want him to get away with it,\" Andrea Swift testified.\nBell said he emailed the photo to Robert Call, KYGO's general manager, for use in Call's investigation of Mueller. He said he didn't ask that Mueller be fired but that \"appropriate action be taken.\"\nJurors rejected Mueller's claims that Andrea Swift and Bell cost him his job.\nOn Friday, U.S. District Judge William Martinez dismissed similar claims against Taylor Swift, ruling Mueller's team failed to offer evidence that the then-23-year-old superstar did anything more than report the incident to her team, including her mother.\n———\nAssociated Press writer Thomas Peipert contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Taylor Swift hopes verdict inspires assault victims",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/taylor-swift-hopes-inspire-assault-victims-trial-49221571"
}