{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 07:04:53+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "US Sen. Warren Seeks to Pull Pot Shops out of Banking Limbo",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fus-sen-warren-seeks-pull-pot-shops-banking-44507131.json",
    "image_url": "http://abcnews.go.com/US/wireStory/us-sen-warren-seeks-pull-pot-shops-banking-44507131",
    "language": "en",
    "localpath": null,
    "maintext": "As marijuana shops sprout in states that have legalized the drug, they face a critical stumbling block — lack of access to the kind of routine banking services other businesses take for granted.\nU.S. Sen. Elizabeth Warren, a Massachusetts Democrat, is leading an effort to make sure vendors working with legal marijuana businesses, from chemists who test marijuana for harmful substances to firms that provide security, don't have their banking services taken away.\nIt's part of a wider effort by Warren and others to bring the burgeoning $7 billion marijuana industry in from a fiscal limbo she said forces many shops to rely solely on cash, making them tempting targets for criminals.\nAfter voters in Warren's home state approved a November ballot question to legalize the recreational use of pot, she joined nine other senators in sending a letter to a key federal regulator, the Financial Crimes Enforcement Network, calling on it to issue additional guidance to help banks provide services to marijuana shop vendors.\nTwenty-eight states have legalized marijuana for medicinal or recreational use.\nWarren, a member of the Senate Banking Committee, said there are benefits to letting marijuana-based businesses move away from a cash-only model.\n\"You make sure that people are really paying their taxes. You know that the money is not being diverted to some kind of criminal enterprise,\" Warren said recently. \"And it's just a plain old safety issue. You don't want people walking in with guns and masks and saying, 'Give me all your cash.'\"\nA spokesman for the Financial Crimes Enforcement Network said the agency is reviewing the letter.\nThere has been some movement to accommodate the banking needs of marijuana businesses.\nTwo years ago, the U.S. Department of the Treasury gave banks permission to do business with legal marijuana entities under some conditions. Since then, the number of banks and credit unions willing to handle pot money rose from 51 in 2014 to 301 in 2016.\nWarren, however, said fewer than 3 percent of the nation's 11,954 federally regulated banks and credit unions are serving the cannabis industry.\nTaylor West, deputy director of the National Cannabis Industry Association, a trade organization for 1,100 marijuana businesses nationwide, said access to banking remains a top concern.\n\"What the industry needs is a sustainable solution that services the entire industry instead of tinkering around the edges,\" Taylor said. \"You don't have to be fully in favor of legalized marijuana to know that it helps no one to force these businesses outside the banking system.\"\nSam Kamin, a professor at the University of Denver Sturm College of Law who studies marijuana regulation, said there's only so much states can do on their own.\n\"The stumbling block over and over again is the federal illegality,\" he said.\nThe federal government lumps marijuana into the same class of drugs as heroin, LSD and peyote. Democratic President Barack Obama's administration has essentially turned a blind eye to state laws legalizing the drug, and supporters of legalizing marijuana hope Republican President-elect Donald Trump will follow suit.\nTrump officials did not respond to a request for comment. During the presidential campaign, Trump said states should be allowed to legalize marijuana and has expressed support for medicinal use. But he also has sounded more skeptical about recreational use, and his pick for attorney general, Alabama U.S. Sen. Jeff Sessions, is a stern critic.\nSome people in the marijuana industry say the banking challenges are merely growing pains for an industry evolving from mom-and-pop outlets.\nNicholas Vita, CEO of Columbia Care, one of the nation's largest providers of medical marijuana products, said it's up to marijuana businesses to make sure their financial house is in order.\n\"It's not just as simple as asking the banks to open their doors,\" Vita said. \"The industry also needs to develop a set of standards that are acceptable to the banks.\"",
    "source_domain": "abcnews.go.com",
    "title": "US Sen. Warren Seeks to Pull Pot Shops out of Banking Limbo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/us-sen-warren-seeks-pull-pot-shops-banking-44507131"
}