{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 00:18:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "The Latest: Search called off for bears in Alaska mauling",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-search-called-off-bears-alaska-mauling-48046040.json",
    "image_url": "http://abcnews.go.com/International/wireStory/latest-search-called-off-bears-alaska-mauling-48046040",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on three juveniles being injured in bear mauling near Anchorage (all times local):\n3:45 p.m.\nThree juveniles were mauled Wednesday after coming across a grizzly bear and her two cubs while they were hiking in a heavily wooded area just north of Alaska's largest city.\nAnchorage authorities said four young people were hiking in the woods around the Eagle River campground when three of them were injured after running into the bears. Police say three juveniles were taken to a hospital with non-life-threatening injuries. The other youth wasn't injured.\nKen Marsh is the spokesman for the Alaska Department of Fish and Game. He says it's possible this group just surprised the bears, and the mother reacted \"defensively, pretty much in brown bear fashion.\"\nThe search for the bears has been called off. Officials will put up signs warning people of bear activity in the area.\n———\n1:57 p.m.\nThree hikers have been injured following a run-in with a bear at a campground near Alaska's largest city.\nAnchorage authorities say four young people were hiking in the woods around the Eagle River campground when three of them were injured by a grizzly bear with two cubs. They were taken to a hospital with non-life-threatening injuries.\nAnchorage police said in a news release say that while responding officers were searching for the hikers they were charged by the bear and shot at it. The bear's status was not immediately known.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Search called off for bears in Alaska mauling",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-search-called-off-bears-alaska-mauling-48046040"
}