{
    "authors": [
        "Abc News",
        "More Ali"
    ],
    "date_download": "2018-05-31 01:05:51+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Trump lawyer Rudy Giuliani said special counsel Bob Mueller would be \"doing a Comey' if he does not file a report on his investigation by September.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fgiuliani-mueller-comey-release-report-september%2Fstory%3Fid%3D55544999.json",
    "image_url": "https://s.abcnews.com/images/Politics/rudy-giuliani-rx-ss-as-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rudy Giuliani, a member of President Donald Trump’s personal legal team, told reporters Wednesday that special counsel Robert Mueller would be “doing a Comey” – in other words, he suggested, meddling in an election – if he does not file a report on his special counsel investigation by September.\nInterested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\n“If he doesn't file his report by September 1, mid-September, he's clearly doing a Comey,” Giuliani said. He later clarified that he didn’t necessarily mean Mueller should wrap up the special counsel probe of Russian interference in the 2016 election and possible collusion with the Trump campaign by that time. Rather, Giuliani said he meant Mueller should make public what, if anything, the counsel has learned about President Trump.\nGiuliani expanded on what he meant by “doing a Comey” at a reporter’s prompting.\n“Meddling in the election. Doing Hillary in July, doing Hillary again in late October and then pulling back on the investigation a weekend before the election? Horrible,” he said, speaking during an event promoting sports on the White House South Lawn, as a band played “We Are The Champions” and children shouted and screamed in the background.\nIn July 2016, then-FBI director James Comey took the unusual step of holding a news conference to announce that he would not recommend charges against then-Democratic presidential nominee Hillary Clinton following an investigation into her email practices, which began sometime in 2015. Comey then reopened the investigation on October 28 after the FBI discovered new emails. Two days before Election Day on Nov. 8, Comey said the newly-discovered emails did not change his conclusion from the previous year, and the investigation was closed again.\nThe former New York city mayor said that “interview or no interview” [with Trump], the special counsel should release at least a provisional report by then, suggesting there has still been no decision made on whether the president should sit with the special counsel or not.\nEarlier Wednesday, Trump had tweeted that he wishes he hadn’t nominated Jeff Sessions to serve as his Attorney General because Sessions, a Trump campaign ally, recused himself from the Russia investigation.\nhttps://twitter.com/realDonaldTrump/status/1001807216297627648\nHe quoted House Oversight Committee Chairman Trey Gowdy in a tweet, \"....There are lots of really good lawyers in the country, he could have picked somebody else!” Then Trump added, \"And I wish I did!\n....There are lots of really good lawyers in the country, he could have picked somebody else!” And I wish I did! — Donald J. Trump (@realDonaldTrump) May 30, 2018\nGiuliani did say that he thought Sessions was still capable of doing his job leading the Justice Department despite Trump’s critiques.\n“I think if he wasn't, he'd leave,” he told reporters.\nAsked whether Trump might fire Mueller, Giuliani said he didn’t think so. “Mueller… is creating his own problems,” he said.\nRegarding Comey’s actions, Giuliani said an impending report by DOJ inspector general Michael Horowitz about Clinton-related leaks from the FBI will “explain a lot of it,” but that he didn’t know when that report would be released.\nHorowitz began his investigation about a week before the election, looking at the FBI’s handling of the Clinton email investigation including Comey’s announcement and the possibility that agents leaked information about her family’s charitable organization, the Clinton Foundation.\nHorowitz told congressional leaders earlier this month that a draft copy of his report has been made available to the DOJ and FBI, and he is expected to brief members of Congress once the report is released.",
    "source_domain": "abcnews.go.com",
    "title": "Giuliani says Mueller would be 'doing a Comey' if he doesn't release report by September",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/giuliani-mueller-comey-release-report-september/story?id=55544999"
}