{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 03:57:02+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Montgomery gets 1st win, Yanks beat White Sox for 8th in row",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fmontgomery-1st-win-yanks-beat-white-sox-8th-46852991.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_8fd258d148ac484e93bca5d1ea563894_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jordan Montgomery took a shutout into the seventh inning for his first major league win, Matt Holliday homered in his return to the lineup and the New York Yankees romped to their eighth consecutive victory by beating the Chicago White Sox 7-4 on Monday night.\nHolliday put the Yankees ahead with a titanic three-run shot in a five-run third inning, and Aaron Judge added a two-run homer that chased Derek Holland (1-2) with the score 7-0 in the fifth. New York has rebounded from a 1-4 start with its longest winning streak since a 10-game run in June 2012.\nMaking his second career start, Montgomery (1-0) immediately found himself in a first-inning jam. But the 24-year-old lefty calmly pitched his way out of it by retiring cleanup hitter Jose Abreu and streaking Avisail Garcia with runners at second and third.\nGarcia began the night leading the majors with a .465 batting average.\nThe 6-foot-6 Montgomery scattered four hits over the first six innings, but never got another out. He gave up consecutive singles to start the seventh and then a three-run homer to Yolmer Sanchez that ended the pitcher's night.\nMontgomery jogged off the mound to cheers, and Adam Warren took over. Warren worked into the ninth before Chicago cut it to 7-4 on Kevan Smith's run-scoring double of the wall in right-center.\nAroldis Chapman came on and gave up a single that put runners at the corners, but the closer got Tyler Saladino to ground into a game-ending double play for his fourth save — the fourth double play turned by the Yankees.\nWarren retired 22 straight batters to begin the season before issuing a two-out walk to Saladino in the seventh.\nStarlin Castro had three hits for New York, and Judge drove in three runs. Castro and Chase Headley hit successive doubles after Holliday's homer into the bleachers beyond the left-center bullpen, estimated at 459 feet. The veteran slugger missed the previous two games with lower back stiffness.\nJudge added a run-scoring infield single to complete the third-inning outburst for New York, which has won its first seven home games for the first time since 1998.\nHolland was tagged for seven runs — six earned — and 10 hits in 4 2/3 innings while falling to 1-7 against the Yankees.\nChicago, which had won four of five, dropped to 7-21 at the current Yankee Stadium.\nBIRD ON THE BENCH\nDespite breaking out of his slump Sunday night with a huge game at the plate, Yankees 1B Greg Bird was left on the bench in favor of Chris Carter. Still, manager Joe Girardi insisted the team views Bird as an everyday player. \"Holland's really tough on left-handers,\" Girardi explained. \"So we got as many righties as we could today.\" LF Brett Gardner also was rested as Girardi stacked his lineup with eight right-handed hitters underneath leadoff man Jacoby Ellsbury. Bird struck out as a pinch hitter in the eighth.\nTRAINER'S ROOM\nWhite Sox: 3B Todd Frazier sat out his second consecutive game because of an illness manager Rick Renteria described as a \"flu-like stomach irritation.\" Renteria said Frazier was feeling better, though, and finally able to keep food down. Frazier has had a hard time shaking the bug, which caused him to miss two games last week. He returned Saturday but left that game early with recurring symptoms. ... Bench coach Joe McEwing, known for his boundless enthusiasm, went to the mound to remove Holland in an animated pitching change. McEwing took on the task because Renteria was hobbled by knee inflammation.\nYankees: SS Didi Gregorius (right shoulder strain) could play in a simulated game in the next few days. He is expected to begin a minor league rehab assignment soon.\nON THE MOVE\nNew York traded Triple-A pitcher Johnny Barbato to the Pittsburgh Pirates for $150,000 or a player to be named. The right-hander made 13 major league relief appearances last year.\nUP NEXT\nRHP Luis Severino (1-0) looks to extend New York's winning streak Tuesday night when he faces RHP Miguel Gonzalez (1-0) in the second game of the series. The 23-year-old Severino set a career high with 11 strikeouts last time out against Tampa Bay, ending a string of 13 winless starts that dated to a victory over the White Sox in September 2015.\n———\nMore AP baseball coverage: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "Montgomery gets 1st win, Yanks beat White Sox for 8th in row",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/montgomery-1st-win-yanks-beat-white-sox-8th-46852991"
}