{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 01:11:46+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The alleged driver is charged with 10 counts of murder and 13 counts of attempted murder.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fvictims-van-attack-predominantly-women-police-54705788.json",
    "image_url": "https://s.abcnews.com/images/WNT/180424_wn_llamas_635_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Victims of van 'attack' predominantly women: Police\nWe turn next here to the deadly van attack in Toronto. The driver appearing to intentionally strike victims on the sidewalks and the streets there. The crime scene nearly a mile and a half long. And tonight, what investigators are now learning about the driver's possible motive. ABC's chief national correspondent Tom llamas in Toronto again tonight. Reporter: The chilling new video, a van turned killing machine, barrelling down the Toronto sidewalk, plowing into pedestrians. And tonight, as investigators scour the scene, a troubling portrait emerging of the man behind the wheel -- 25-year-old alek Minassian. The accused is alleged to have posted a cryptic message on Facebook, minutes before he began driving the rented van. Reporter: That message including these words -- \"All hail supreme gentleman Elliott Rodger!\" Rodger killed six people in a 2014 rampage near Santa Barbara. He recorded selfie videos lashing out at women. Can you at least say if the suspect was frustrated with his relationships with women? Again, because that's part of the evidence that's going to be part of our investigation. Reporter: Police say the injured victims were predominantly women, ranging from their 20s to their 80s. Vasiola biboli almost became one of them herself. You were walking on the street, and your friend literally had to pull you out of the way of the van? I just remember just being pulled away into the direction and then he accelerated and hit the lady and all I can envision is that vivid image of the lady being on top of his hood and then being thrown to the ground. And then he ran over her as he plowed to the crowd. Reporter: Minassian now charged with ten counts of murder and 13 counts of attempted murder. Outside court, his father, emotional. He didn't say much, but the look on his face said it all. You were crying in court, sir. Can you tell us what you're feeling right now, please? I'm sorry. Reporter: And tonight, we're learning more about the traffic officer who stopped the rampage, constable Kenny lam. During that standoff, Minassian saying he had a gun, making threatening gestures. I have a gun in my pocket. I don't care. Get down. I have a gun in my pocket. Reporter: But constable lam, a 12-year veteran of the police force, managed to bring Minassian down and cuff him without firing a single shot. And Tom llamas with us again tonight from Toronto. You were in court today when the suspect was charged, and you're learning he did a short stint in the Canadian military? Reporter: That's right, David. We've just learned tonight that Minassian was in the Canadian military last year for only six days during troop recruitment training, but then he quit. Today, we did see him in court. He walked in with a white jail jumpsuit, sat there stonefaced. The only emotion in that courtroom came from his father. I saw him wiping away tears as his son was led away. David? Tom llamas with us again tonight. Thank you, Tom.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Victims of van 'attack' predominantly women: Police",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/victims-van-attack-predominantly-women-police-54705788"
}