{
    "authors": [
        "Abc News",
        "More Conor"
    ],
    "date_download": "2018-05-30 16:55:29+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Secretary of State Mike Pompeo is set to meet with a top North Korean official as the Trump administration races to prepare for its June 12 summit.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fpompeo-meet-top-north-korean-official-summit-plans%2Fstory%3Fid%3D55532123.json",
    "image_url": "https://s.abcnews.com/images/Politics/pompeo-nk-01-ap-jrl-180524_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Secretary of State Mike Pompeo is set to meet with a top North Korean official as the Trump administration races to prepare for its June 12 summit between President Trump and Kim Jong Un.\nInterested in North Korea? Add North Korea as an interest to stay up to date on the latest North Korea news, video, and analysis from ABC News. Add Interest\nLess than a week after the president “canceled” the summit in a dramatic letter, there’s been a flurry of activity between the two countries to make it happen again. There was never an official “back on” message, but Trump tweeted Tuesday that his letter got a “solid response.”\nThe point person for U.S. preparations, Pompeo will meet Kim Yong Chol, a top adviser to Kim Jong Un and Vice Chairman of the Central Committee. It’s the third meeting between the two men, after Pompeo’s two trips to Pyongyang in as many months.\nChol is the regime’s former spy chief and reportedly behind some of its most malicious behavior, including assassination attempts in South Korea, the sinking of a South Korean Navy ship, and the Sony hack. He is currently under U.S. sanctions, so the U.S. had to grant him a special waiver to travel to New York.\nJ. Scott Applewhite/AP\nHe is the highest-ranking North Korean official to visit the U.S. in nearly two decades, after the Clinton administration’s diplomatic efforts in its final months. Chol departed from Beijing Wednesday morning, where he met top officials from China, North Korea’s closest ally and key economic partner.\nThe administration has not said where or when Pompeo and Kim will meet, other than that Pompeo will travel to New York on Wednesday and Thursday. Kim is expected to arrive Wednesday afternoon as well.\nIt’s also unclear who requested the meeting and at what stage in talks it takes place, whether its finalizing logistics, agreeing to an agenda, or something else. State Department spokesperson Heather Nauert wouldn’t say, other than that the U.S. looks forward to the discussions and the two men have had \"very deep conversations where they've talked about a lot of detail about what the United States' expectations are” in their prior meetings.\nDespite Trump’s letter, which blasted North Korea for its “xxxx angry rhetoric” [need quote] and called off the meeting, the administration is moving full steam ahead with planning. Nauert told reporters Tuesday there had been \"a tremendous amount of progress over the past few days alone” as two other U.S. teams have been meeting with North Koreans in Singapore and at the Demilitarized Zone between North and South Korea.\nWhite House Deputy Chief of Staff Joe Haginis is leading the “pre-advance” team in Singapore, focused on coordinating the summit’s logistics, according to White House Press Secretary Sarah Sanders, and the team at the DMZ includes the National Security Council’s Director for Korea Allison Hooker, Assistant Secretary of Defense for Asian and Pacific Security Affairs Randy Schriver, and Sung Kim, the current U.S. ambassador to the Philippines and former State Department Special Representative for North Korean Policy.\nWhile it’s a tall order to coordinate the summit with less than two weeks to go, June 12 “is what we're planning for,” Nauert said, “but we'll see what happens.”",
    "source_domain": "abcnews.go.com",
    "title": "Pompeo to meet top North Korean official as summit plans continue",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/pompeo-meet-top-north-korean-official-summit-plans/story?id=55532123"
}