{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 23:16:02+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsuffragist-1st-woman-statue-uk-parliament-54684973.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_051e890086e540f891b66fb0a8223046_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A bronze statue of women's rights campaigner Millicent Fawcett was unveiled Tuesday outside Britain's Parliament — the first woman to be commemorated there alongside statues of 11 men including Nelson Mandela, Abraham Lincoln and Winston Churchill.\nFawcett was president of the National Union of Women's Suffrage Societies and a key campaigner in the movement that secured British women over 30 the right to vote in 1918. She lived to see women get the same voting rights as men 10 years later, dying in 1929 aged 82.\nThe statue by artist Gillian Wearing shows the campaigner holding a banner proclaiming \"Courage calls to courage everywhere,\" a phrase from one of her speeches.\nThe statue was erected in Parliament Square after a petition was started by feminist activist Caroline Criado Perez, who previously led a successful campaign for Jane Austen to be depicted on a British banknote.\nAt an unveiling ceremony attended by senior lawmakers, Prime Minister Theresa May said that \"I would not be standing here today as prime minister ... were it not for one truly great woman: Dame Millicent Garret Fawcett.\"\n\"History has many authors. In our own small way we each help to shape the world in which we live,\" May said.\n\"But few of us can claim to have made an impact as significant and lasting as Dame Millicent, and it is right and proper that, today, she takes her place at the heart of our democracy.\"",
    "source_domain": "abcnews.go.com",
    "title": "Suffragist first woman to get statue outside UK Parliament",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/suffragist-1st-woman-statue-uk-parliament-54684973"
}