{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:14:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "After US strikes, Trump's Syria plan starts coming into view",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fus-strikes-trumps-syria-plan-starts-coming-view-46848710.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_d16c0010eff14f70850e6d15faab1541_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Can threatening war crimes charges persuade Syrian President Bashar Assad to leave power? What about guaranteeing his safety in exile? These long-shot proposals are at the center of the Trump administration's new effort to resolve Syria's six-year civil war.\nThough still evolving, President Donald Trump's plans for Syria have come into clearer view since he ordered cruise missiles fired on a Syrian air base to punish Assad for a chemical weapons attack. The strategy breaks down into three basic phases: defeating the Islamic State group, restoring stability in Syria region-by-region and securing a political transition in which Assad ultimately steps down.\nThe approach is little different than one that failed under the Obama administration, and arguably faces greater challenges.\nAssad has violently resisted all attempts to end his rule, fueling a conflict that has killed as many as a half-million people. The opposition fighting Assad is far weaker after a series of battlefield defeats. And any U.S. plan for Assad will need the cooperation of key Syria ally Russia. Trump last week said U.S.-Russian relations \"may be at an all-time low.\"\nStill, several U.S. officials said Trump's national security team is using this month's instability in Syria to try to refocus conversations with Moscow.\nTrump's cruise missile response to Syria's chemical weapons attack bolstered U.S. arguments that Russia is backing a potential war criminal in Assad, and restored America's ability to threaten military action if more atrocities occur. The officials said they hoped instead to rejuvenate cooperation with Russia on Syria, which could help begin repairing fractured ties between Washington and Moscow.\nTrump's emerging plan includes these elements, according to several U.S. officials who weren't authorized to discuss internal policy considerations and demanded anonymity:\nPHASE ONE: DEFEAT THE ISLAMIC STATE GROUP\nTrump's airstrikes marked the first U.S. attack against Assad's forces, but there's no appetite for using America's military to depose Assad. Trump's national security adviser, H.R. McMaster, said Sunday the U.S. wasn't planning to send in more ground troops.\n\"Our priority remains the defeat of ISIS,\" Defense Secretary Jim Mattis said last week, using another acronym for the militant group.\nThe group has lost much of the territory it held in Iraq and Syria. The major exception is Raqqa, the group's self-declared capital in Syria, which the U.S. and allied rebel groups are preparing to attack in coming weeks.\nPHASE TWO: STABILIZATION\nAfter IS is defeated or its threat neutralized, the administration will try to broker regional cease-fires between Assad's government and rebels. Such truces have rarely held.\nThe Trump administration has spoken about \"interim zones of stability.\" These would be different than the \"safe zones\" the Obama administration considered but never opted for because they would have required a U.S. military presence to enforce, potentially putting American aircraft in conflict with Syria's air force.\nUnder Trump's plan, the Assad government would be party to the stability zones and U.S. or Arab aircraft could ostensibly patrol them without clashing with Syrian warplanes.\nWith security restored, the administration hopes local leaders who were forced to flee can return and lead local governments. They could help restore basic services and police Syria. The basic idea would be Sunni forces policing predominantly Sunni areas, Kurdish forces policing Kurdish areas and so on.\nAt the national level, the aim is to set up a transitional authority to govern Syria temporarily. U.N.-sponsored peace talks have striven and failed for years to establish such an authority.\nPHASE THREE: TRANSITION\nThough Trump officials have made conflicting public statements about Assad's future, the emerging plan envisions a peaceful transfer of power. Assad's departure could occur in various ways.\nOne possibility foresees elections held under a new constitution, with Assad barred from running.\nA grimmer possibility involves Assad going the way of former dictators Moammar Gadhafi in Libya or Saddam Hussein in Iraq, who were killed after being deposed.\nA third option aims to use the threat of war crimes charges as leverage. While the administration believes Syria's government is culpable, the key is connecting the war crimes to Assad himself.\nSuccessfully prosecuting Assad would be difficult for legal and geopolitical reasons.\nBeyond Russia, Assad is supported by Iran. And the Trump administration hasn't said anything yet about working with Tehran to promote peace in Syria.\nStill, it believes the threat of a war crimes investigation and an offer of safe exile somewhere outside Syria, possibly Iran or Russia, could be potentially persuasive.\nSecretary of State Rex Tillerson told President Vladimir Putin and Russia's foreign minister last week in Moscow that such an offer and Assad's voluntary departure is the administration's preferred path, officials said.\n\"The longer time goes by, it's possible that the case will be made,\" Tillerson said during a news conference. \"And there are certain individuals who are working to make that case.\"\nPOST-TRANSITION\nDespite differences, Trump officials insist Russia's involvement is critical to resolving the war, given the influence it gained in Syria after helping Assad retake Syria's largest cities.\nIt seeks Russian support by guaranteeing Russian access to the Tartus naval base and Latakia air base in any post-Assad scenario. Yet it's unclear how the U.S. could make such an assurance given the uncertainty of who would be running Syria at that point.\nTillerson conveyed the outlines of this plan to Putin and Russian officials in Moscow, officials said, while requesting Russia to clarify its essential interests. He didn't seek an immediate response, telling Russia to think it through. It's unclear when Russia will respond, the officials said.",
    "source_domain": "abcnews.go.com",
    "title": "After US strikes, Trump's Syria plan starts coming into view",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/us-strikes-trumps-syria-plan-starts-coming-view-46848710"
}