{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 22:07:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Trump wants to send man back to moon, on to Mars",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Ftrump-send-man-back-moon-mars-51724277.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_2434ef73b90842c0b195ab5047b0c876_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump wants to send man back to the moon — and on to Mars.\nTrump signed a policy directive Monday instructing the National Aeronautics and Space Administration to \"refocus America's space program on human exploration and discovery.\"\nThe move, Trump said, \"marks an important step in returning American astronauts to the moon for the first time since 1972 for long-time exploration.\"\n\"This time we will not only plant our flag and leave our footprint,\" he said, \"we will establish a foundation for an eventual mission to Mars, and perhaps someday, to many worlds beyond.\"\nPast presidents, including George H.W. Bush and George W. Bush, have also proposed returning to the moon and missions to Mars, Budget constraints derailed their plans.\nTrump was joined at the White House by several current and former astronauts, including Buzz Aldrin, the second man to walk on the moon, and former U.S. Sen. and Apollo 17 astronaut Harrison \"Jack\" Schmitt, the next-to-last person on the moon.\n\"Today we pledge that he will not be the last, and I suspect we'll be finding other places to land in addition to the moon,\" Trump said.\nNo human has been on the moon since Apollo 17 in December 1972. Only 12 men have set foot on the moon, all have been Americans.\nUnder the directive, the government is also expected to work closely with other nations and private industry.",
    "source_domain": "abcnews.go.com",
    "title": "Trump wants to send man back to moon, on to Mars",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/trump-send-man-back-moon-mars-51724277"
}