{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 18:01:29+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "\"The View\" co-hosts discuss flight records obtained by Bloomberg that dispute Pres. Trump's claim to Comey that he did not stay overnight in Moscow in 2013.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Fflight-records-contradict-trump-claims-moscow-visit-report-54696872.json",
    "image_url": "https://s.abcnews.com/images/theview/180424_view_dossier_1105_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Flight records contradict Trump claims on Moscow visit: Report\nThey got a White House insisted. To James Connolly that he wasn't even in Russian when the alleged hotel room amp a solid capital with. But. Bloomberg reports spent. Flight logs matched with social media post. Put him in Moscow during that period which was the night of what the miss universe pageant. It's 1813 member White House hasn't commented what it stopped. I mean you'd think he'd been tweeting about this all know and they knew who I. Crazy media hysterical people talking about me I was nowhere really well enough but pop up. Anyone gotten thoughts about it. But the big thing was that he didn't spend the night there because he wants to make sure the people don't believe that the PP tape exists but it could happen here I couldn't see tape I didn't get my anything they like that I I don't I don't think CNN hi Terry I'm Tom you're dating off tidbit but I I think that it. You know if if it logs show that he was there for 46 hours clearly he spent the night it in Moscow and I just don't understand how you lie about something that is so easily verifiable. You took a plane. So there are always like plain logs like yeah you know but why would you lie about how long you. Stay there if you didn't have something to hot let's of the people tapes exact. Seeing it. All right so as studied at priming an iMac Enron would donate we week battle. This morning meeting until we have a video or indictments all hypothetical we don't know what happen in a dossier parts that aren't verified and they are not good ends. I agree I Hawaiian never profited this juncture in my life Kennedy got everyone in this room probably collectively green food and Americans we are talking about. Prostitutes urinating in an affinity with our Prez then and it's just like. I had these moments and I'm sure LBJ we're like. This is a normal and it's crazy yeah it's not about how crazy I Albania. Did I let Larry I'm alleged peeping take my favorite. Do you was that. He won in coming to investigate the dossier even there there was only 1% chance because but this quote has me in stitches so Komi said if there's even 1% chicks aren't trump said if there's even 1% chance. My wife thinks that's true that's terrible call you were calls. And I remember thinking how your wife think there's a 1% chance or with prostitutes peeing on each other in Moscow I'm a flawed human being but there is literally. You're at camp and let my wife can't think that was a heck yeah. And I. So now who do you believe because police says you know there was. They're they have has been some evidence that he was in Moscow and trump says no no no no no no no but value of the law as he was there to. PP tapes like there's a little some men just doing little just. That's not a day the sound true and true are you know.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Flight records contradict Trump claims on Moscow visit: Report",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/flight-records-contradict-trump-claims-moscow-visit-report-54696872"
}