{
    "authors": [
        "Abc News",
        "More Veronica"
    ],
    "date_download": "2017-04-18 12:57:03+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The Note: Georgia on Trump's mind",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fnote-georgia-trumps-mind%2Fstory%3Fid%3D46859806.json",
    "image_url": "http://a.abcnews.com/images/Politics/AP-easter-egg-roll7-ml-170417_4x3_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "TRUMP’S FIRST 100 DAYS with ABC’s RICK KLEIN and VERONICA STRACQUALURSI\nDay No. 89\nTHE BIG STORY: It’s the biggest political test of the Trump era, and both sides got a fight that they may have been quite ready for. The stakes in Georgia on Tuesday, with the special House election to replace HHS Secretary Tom Price, may be greater than Democrats anticipated, given the difficulty that any candidate would have in clearing 50 percent in an 18-person field. Jon Ossoff could well come close, but falling short will be cast (indeed, is already being cast by President Trump) as missing out on what could be Democrats’ best chance to steal a red-state seat early in the Trump era. Over on the other side, Republicans have seen their long-simmering civil war continue. Eleven Republican candidates have been clamoring for attention and outside groups have been firing on individual candidates – and possibly boosting Ossoff with one particular silly ad that used footage of him playing “Star Wars” characters in college. Trump’s closing robocall message in the district – to “vote Republican” because Nancy Pelosi and Ossoff would “raise your taxes, destroy your health care, and flood our country with illegal immigrants” -- lays out the stakes as starkly as both parties might wish.\nTHE BURIED STORY: “I don’t want to telegraph what I’m doing or what I’m thinking,” President Trump told Fox News regarding North Korea. Yet it seems we know quite a bit about the president’s mindset when it comes to North Korea, whatever it actually means when Vice President Mike Pence declared an end to the “era of strategic patience.” This looks like a slow-motion march to war, with two sides that won’t stand for being underestimated. The statement by a North Korean official to the BBC, promising “weekly, monthly, and yearly” missile tests, suggests these will be tense times until they become overtly dangerous times. The North Koreans do not want to be ignored, and neither does the American president. Even if quiet days slip by, Kim Jong Un and Donald Trump are testing each other, privately and publicly, in ways that could go badly fast.\nTHE SHINY STORY: Trump friends and Trump foes are learning to focus on what he does, not what he says. But what he says and what he doesn’t do are showing signs of spilling over into what he wants to get done. On this Tax Day, it’s now beyond obvious that the president intends to never release his tax returns. (“We’ll have to get back to you on that,” White House press secretary Sean Spicer told ABC’s Jonathan Karl Monday, when asked that question directly.) That stance is uniting Democrats behind efforts to stymie tax reform, as The New York Times reports. The president’s own past actions are also impacting perceptions of the “Buy American, Hire American” initiative Trump is rolling out Tuesday in Wisconsin. Stories are rightfully resurfacing about foreign workers and visa programs in use at Mar-a-Lago and Trump wineries. Ditto China, with The Associated Press reporting that Ivanka Trump’s business won new trademarks even while she joined her father in welcoming China’s president at Mar-a-Lago. A president for whom business is personal is finding his personal business more relevant than he’d ever hoped.\nTLDR: The stakes are high in the Georgia special election today as the election results could be seen as a referendum on President Trump and his policies.\nPHOTO OF THE DAY: President Trump blows a whistle to start an egg roll race during the 139th White House Easter Egg Roll, the first of his administration. “I’ve seen those kids, and they're highly, highly competitive,” Trump said in his welcoming remarks. (Credit: Susan Walsh/AP Photo)\nSusan Walsh/AP Photo\nNOTABLES\n--TRUMP TO SIGN EXECUTIVE ORDER TARGETING FOREIGN WORK VISAS: President Donald Trump is set to sign an executive order titled “Buy American, Hire American” Tuesday morning in Kenosha, Wisconsin, calling on agencies to overhaul the H-1B visa program. The order calls on the Department of Labor, the Department of Justice, the Department of Homeland Security and the State Department to “take prompt action to crack down on fraud and abuse” within the U.S. immigration system to \"protect workers.\" The order aligns with Trump's promise as a candidate to review visa programs to prioritize the goal of \"buy American, hire American,\" even as the president's own company, the Trump Organization, has often opted to take an alternate route. ABC’s KATHERINE FAULDERS has more: http://abcn.ws/2pwmXNc\n--TRUMP SAYS NORTH KOREA HAS 'GOTTA BEHAVE': President Donald Trump weighed in on the tense situation with North Korea on the sidelines of the annual White House Easter Egg Roll Monday, ABC’s MEGHAN KENEALLY, MARY BRUCE and NICKI ROSSOLL note. When asked for his message to North Korea after its failed missile launch on Sunday, Trump responded, \"They gotta behave.\" Later, when ABC News pressed Trump on his next move on the Korean Peninsula, he said, \"You'll see.\" http://abcn.ws/2oFRbyQ\n--SPICER DEFENDS WHITE HOUSE POLICY ON VISITOR LOGS: White House press secretary Sean Spicer defended the Trump administration's decision to not voluntarily release records of White House visitors to the public and described the Obama administration's online posting of those logs as a \"faux\" effort. ABC’s ADAM KELSEY has more: http://abcn.ws/2oFd8wr\nSPEED READ\nTRUMP CONGRATULATES TURKEY'S ERDOGAN AFTER CONTESTED REFERENDUM. President Donald Trump called Turkish President Recep Tayyip Erdogan to congratulate him on his controversial referendum victory, the Turkish Presidential Palace confirmed to ABC News on Monday, ABC’s ENGIN BAS and JOSHUA HOYOS report. The Turkish referendum is due to eliminate the prime minister's office and give the country's president sweeping powers and nearly complete control of the government -- authority not originally granted under the country's constitution. At the White House Monday, Press Secretary Sean Spicer deflected follow-up questions about Erdogan's accumulation of power, saying that the people of Turkey \"have a right to have elections and their people participated in that.\" http://abcn.ws/2pbNEtL\nTRUMP COULD RELEASE HIS TAXES BUT PROBABLY WON'T, EXPERTS SAY. President Donald Trump like other Americans is supposed to file his taxes by Tuesday’s deadline, but that doesn’t mean the public will get to see his elusive returns. Trump was the first presidential candidate in more than 40 years to refuse to release his tax returns, and there's no indication he will do so as president. Two days after thousands of people protested around the country to demand that Trump release his taxes, White House press secretary Sean Spicer said in Monday's press briefing that the president will not be releasing his 2016 returns, saying – without explanation – that the 2016 returns are “under the same audit that existed.” ABC’s MEGHAN KENEALLY has more: http://abcn.ws/2ooLmm0\nEXAMINING THE TRUMP ADMINISTRATION'S STANCE ON THE WH VISITOR LOG. The Trump administration announced on Friday that it would reverse that Obama-era policy on releasing White House visitor logs because of \"grave national security and privacy concerns.\" These records will not be released until five years after the president's term ends pursuant to the Presidential Records Act, with some logs remaining secret for up to 12 years. Visitor logs of certain executive agencies, such as the OMB, might be obtained sooner through FOIA requests. Legal experts told ABC News that Trump's stated policy on visitor logs appears to follow both the law and settled practice prior to the Obama administration, ABC’s LAUREN PEARLE reports. http://abcn.ws/2ojGmQo\nIMMIGRATION-RELATED ARRESTS BY ICE INCREASE UNDER PRESIDENT TRUMP. Immigration-related arrests were up nearly 33 percent in the first months of Donald Trump's presidency compared to the same time period last year, according to new data released by U.S. Immigration and Customs Enforcement (ICE). ICE made 21,362 arrests from Jan. 20 through March 13 of this year, up from 16,104 arrests during the same window in 2016. Immigration arrests of non-criminals more than doubled since last year from 2,278 in 2016 to 5,441 this year. ABC’s GENEVA SANDS has more: http://abcn.ws/2pbwP1V\nUS SUPREME COURT STOPS EXECUTION OF ARKANSAS DEATH ROW INMATE. The Supreme Court on Tuesday denied a request by the state of Arkansas to carry out the execution of a death row inmate who was scheduled to die before midnight. The court delivered its ruling early Tuesday morning denying a request to vacate a stay of execution for convicted murderer Don Davis, ABC’s KARMA ALLEN reports. If carried out, the execution would have been the state’s first in nearly 12 years. http://abcn.ws/2oHdsMX\nWHAT'S AT STAKE IN NORTH KOREA? North Korea’s failed missile test this weekend is just the latest in a string of tests by the country that has stoked fears around the world. There had been growing concern all week that Kim Jong Un’s government would attempt some form of missile or nuclear test this weekend as it celebrated the 105th birthday of its late founder, Kim Il Sung. So while the missile test did not come as a grand surprise, it serves a reminder of the growing threat that North Korea poses to U.S. interests in East Asia and the possible threat that it could pose to the U.S. homeland in the not-too-distant future. ABC’s PAUL BLAKE has what you need to know: http://abcn.ws/2nW0qMU\nIN CASE YOU MISSED IT\nTRUMP FAMILY HOSTS THEIR 1ST WHITE HOUSE EGG ROLL. Yesterday’s annual White House Easter Egg Roll brought a day of celebration for a busy first family. President Donald Trump and first lady Melania Trump welcomed an estimated 21,000 guests for the 139th Easter Egg Roll. \"We're going to come out and join you, enjoy your company for a roll -- a great Easter Egg Roll. I don't know if we're going to be successful...I’ve seen those kids, and they're highly, highly competitive,\" President Trump said. ABC’s RILEY BEGGIN and VERONICA STRACQUALURSI have more: http://abcn.ws/2p9iEuu\nMELANIA TRUMP INTRODUCES KIDS TO 'PARTY ANIMALS' AT EASTER EVENT. The Trump family’s first year of hosting the annual White House Easter Egg Roll showcased first lady Melania Trump as storyteller. The first lady told the group of children that the book “Party Animals,” written in 2010 by Kathie Lee Gifford, “shows that we are all different, but we are all alike.” ABC’s BRIAN CANOVA has more: http://abcn.ws/2pudK86\nWHAT WE’RE READING\n“IVANKA'S BIZ PROSPERS AS POLITICS MIXES WITH BUSINESS,” by The Associated Press’ Erika Kinetz and Anne D’Innocenzio: “On April 6, Ivanka Trump's company won provisional approval from the Chinese government for three new trademarks, giving it monopoly rights to sell Ivanka brand jewelry, bags and spa services in the world's second-largest economy. That night, the first daughter and her husband, Jared Kushner, sat next to the president of China and his wife for a steak and Dover sole dinner at Mar-a-Lago.” http://abcn.ws/2nXSI4R\n“TRUMP IS TARNISHING REPUBLICANS,” a USAToday Op-Ed by Jesse Ferguson: “For a political party that often seems to be Lost in Space, Republicans should be hearing “Danger, Will Robinson!” alarms. We need look no further than the special election in Kansas’s Fourth Congressional District to see the warning signs: a Republican won by 7 points in a seat that Trump won by 27 points only six months ago. That’s a 20-point swing.Trump pushes Republicans to walk the plank for him on issue after issue, from health care repeal to budget cuts and much more, even if it hurts his own voters. And he expects them to defend him in self-inflicted scandal after scandal — so much that they are coming dangerously close to being seen as accomplices in Trump’s sustained effort to hide his tax returns and ties to Russia. If that happens, they can wave goodbye to their control of Congress.” http://usat.ly/2oR7b1s\nIN THE NOTE’S INBOX -- On Tuesday, the progressive group Allied Progress will file suit in the U.S. District Court for the D.C. to obtain correspondence between the Consumer Financial Protection Bureau and Senate offices regarding a Obama-era rule that protects prepaid credit card holders from predatory practices. The lawsuit follows yesterday’s Atlanta Journal-Constitution story detailing the legislation Sen. David Perdue (R-GA) is fast-tracking that would benefit Netspend, a company whose PAC has given Perdue $17,500 in campaign donations since the 2014 election cycle.\nWHO’S TWEETING?\n@thehill: NEW REPORT: Clinton apologized to Obama after election loss http://hill.cm/VhzNSoN\n@amychozick: \"'Shattered' creates a picture of a shockingly inept campaign hobbled by hubris and unforced errors...\" http://nyti.ms/2puPgyA\n@JenniferJJacobs: Trump Organization’s revenue likely to rise at slower rate during presidential term, Eric Trump told @PeterGrantwsj\n@joshledermanAP: Breaking overnight: LONDON (AP) - British Prime Minister Theresa May announces she will seek early election on June 8\n@spettypi: Trump: what am I going to do? Start a trade war with China while in the middle of him working on a bigger problem, frankly, w NK? @FoxNews\n@juliehdavis: Fox intvw Q: Did we sabotage the N Korea strike? Trump: I don't want to comment on it",
    "source_domain": "abcnews.go.com",
    "title": "The Note: Georgia on Trump's mind",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/note-georgia-trumps-mind/story?id=46859806"
}