{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 00:28:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "AP Analysis: Rio de Janeiro Olympics cost $13.1 billion",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fap-analysis-rio-de-janeiro-olympics-cost-131-48042510.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/ap-analysis-rio-de-janeiro-olympics-cost-131-48042510",
    "language": "en",
    "localpath": null,
    "maintext": "An analysis by The Associated Press shows that the cost of putting on last year's Rio de Janeiro Olympics was $13.1 billion, paid for with a mix of public and private money.\nOfficials of Brazil's Public Authority for Olympic Legacy said at a news conference Wednesday, the cost for \"sports-related venues\" was 7.23 billion reals ($2.06 billion). In addition, the Rio organizing committee previously said the cost of running the Games at 9 billion reals ($2.8 billion).\nThe Olympic legacy body did not account for other Olympic-related costs. But the AP obtained them in emailed statements from city, state and federal agencies.\nThose costs were 26.385 billion reals ($8.2 billion) for, among other things, a subway line, a doping laboratory, a renovated port and cleanup of polluted Guanabara Bay.\nThe doping laboratory was paid for by the federal government and cost 163.7 million reals ($50 million). A delay-plagued subway line project that was built to connect fans to Olympic Park had a price tag of 9.7 billion reals ($2.98 billion). According to a state auditor's report cited in August, the railway was overbilled by 25 percent.\nAnother legacy project, the renovation of Porto Maravilha, a run-down historic area in Rio, cost the city 10 billion reals ($4.2 billion).\n\"Should a country with such inequality as Brazil have hosted such an event with this level of investment,\" federal prosecutor Leandro Mitidieri said. He said it would be difficult to use the Olympic venues in a way that would generate enough income to cover maintenance expenses.\n\"It is a challenge and we can see the difficulties,\" he said. \"We recognize the difficulties.\"\nOfficials presented the report at the Olympic Park in suburban Barra da Tijuca, which now consists of mostly vacant venues. Last month a federal prosecutor said many of the venues were \"white elephants\" that were built with \"no planning.\"\nThe Rio Olympics, which opened 10 months ago, were plagued by countless financial and organizational problems, and were hosted as Brazil sank into its deepest recession since the 1930s.\nThe state of Rio de Janeiro has been months late paying teachers, hospital workers, and pensions. The state also reported record-breaking crime in 2016 in almost all categories from homicides to robbery.\nThe problems around the Rio Games — and the aftermath — have called into question the wisdom of cities building new venues every few years to accommodate an event that lasts just over two weeks.\nPaulo Marcio, the head of the Public Authority for Olympic Legacy, talked vaguely about plans to use the venues. The Olympic Park has staged mainly small national or local events.\nHe did not offer any cost or income figures with most of the Olympic arenas now being operated by Brazil's federal government. A plan to auction off the venues to private operators failed when only one bidder was reported to be interested.\n\"I think that in a short period of time I will be able to deliver this legacy, and we have already been successful,\" he said.",
    "source_domain": "abcnews.go.com",
    "title": "AP Analysis: Rio de Janeiro Olympics cost $13.1 billion",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/ap-analysis-rio-de-janeiro-olympics-cost-131-48042510"
}