{
    "authors": [
        "Abc News",
        "Jack Date",
        "Justin Fishel",
        "Adam Kelsey",
        "More Devin",
        "More Jack",
        "More Justin",
        "More Adam"
    ],
    "date_download": "2017-06-15 01:21:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Report: Justice Dept. special counsel investigating Trump for obstruction of justice",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Freport-justice-dept-special-counsel-investigating-trump-obstruction%2Fstory%3Fid%3D48045225.json",
    "image_url": "http://a.abcnews.com/images/Politics/AP-mueller-01-as-170519_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Justice Department special counsel Robert Mueller is investigating whether President Donald Trump attempted to obstruct justice in the probe of Russian interference in last year's presidential election, according to a story by The Washington Post.\nABC News has not independently confirmed the report, which cites U.S. officials. Reached by ABC News, special counsel spokesman Peter Carr offered no comment.\nIn response to the story, a spokesman for Trump's attorney Marc Kasowitz issued a statement only addressing what he referred to as a \"leak\" from the FBI.\n“The FBI leak of information regarding the President is outrageous, inexcusable and illegal.”\nThe special counsel does not operate under the purview of the FBI, but took over the investigation previously led by the agency.\nFormer FBI Director James Comey suggested in testimony before the Senate Intelligence committee last week that Mueller would consider whether a crime was committed when Trump allegedly told him \"I hope you can let this go,\" referring to the investigation into ex-national security adviser Michael Flynn.\n“I don’t think it’s for me to say whether the conversation I had with the president was an effort to obstruct,” Comey said. “I took it as a very disturbing thing, very concerning, but that’s a conclusion I’m sure the special counsel will work towards, to try and understand what the intention was there, and whether that’s an offense.”\nThe president denies that he asked Comey to drop the Flynn probe, part of his version of the events involving the former director that he said last week he'd be \"100 percent\" willing to recount under oath.\nTrump has been emphatic in denying any connection to the 2016 election meddling that the U.S. intelligence community says Russia was behind.\nThe president said that he was assured on three occasions by Comey that he was not personally under investigation when Comey's dismissal was announced last month. In testimony before the Senate Intelligence committee last week, Comey affirmed that he previously told Trump he was not personally being investigated in the FBI's counter-intelligence probe.\nScrutiny over Trump's response to the Russia probe and his interactions with his FBI director would mark a new phase in the investigation.\nThe investigation into obstruction of justice \"began days after Comey was fired on May 9,\" the Washington Post story notes.\nIn a letter to Comey informing him of his termination, Trump wrote that he was acting on the recommendation of Attorney General Jeff Sessions and Deputy Attorney General Rod Rosenstein, but days later expressed that the decision was his own and that he was thinking about the Russia investigation when it was made.\nOn Monday, a friend of Trump's, Newsmax CEO Chris Ruddy, claimed that Trump was \"considering, perhaps, terminating the special counsel\" -- an action that would ultimately have to be made by Rosenstein. The White House pushed back against tthat assertion, with Principal Deputy Press Secretary Sarah Huckabee Sanders saying that Trump \"has no intention to do so.\"\nRosenstein told the Senate Appropriations Committee Tuesday that Mueller would have \"the full degree of independence that he needs to conduct that investigation appropriately\" and that he would not follow an order to fire the special counsel \"unless I believe those are lawful and appropriate orders.\"",
    "source_domain": "abcnews.go.com",
    "title": "Report: Justice Dept. special counsel investigating Trump for obstruction of justice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/report-justice-dept-special-counsel-investigating-trump-obstruction/story?id=48045225"
}