{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 22:58:29+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Jesse Duplantis believes the new jet will allow his ministry to travel globally to spread the gospel without having to refuel.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fjesus-wheel-televangelist-asks-followers-buy-54m-jet%2Fstory%3Fid%3D55536279.json",
    "image_url": "https://s.abcnews.com/images/US/jesse-duplantis-04-as-ht-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Televangelist Jesse Duplantis recently asked his followers to help pay for a $54 million private jet because Jesus Christ “wouldn’t be riding a donkey.”\n“I want you to believe in me for a Falcon 7X,\" Duplantis said in his weekly video address, \"This Week with Jesse.\" \"Pray about becoming a partner to it.\"\nJesse Duplantis Ministries/Twitter\nDuplantis believes the new jet will allow his ministry to travel globally to spread the gospel without having to refuel. If successful, the costly purchase will be the fourth jetliner the ministry will own.\n“We’re believing God for a brand new Falcon 7X, so we can go anywhere in the world in one stop,” Duplantis said in the video message. “Now people say, ‘My lord, can’t you go with this one?’ Yes, but I can’t go in one stop. If I can do it for one stop, I can fly it for a lot cheaper because I have my own fuel farm. And that’s what’s a blessing of the lord.”\nPeople took to social media to express their discontent over Duplantis’ request.\nHow about raising $54 million to give to the poor and help those in need instead of a 4th private jet? God doesnt favor rich over the poor. — Ryan (@Ecoguy4431) May 30, 2018\nThis is not the first time a minister has asked for a new private jet.\nIn 2015, televangelist Creflo Dollar asked his followers to help his ministry purchase a $65 million jet. That same year, Kenneth Copeland's ministry successfully purchased a Gulfstream V jet worth millions.\n“Glory to God! It’s Ours!” the Kenneth Copeland Ministry website posted. “The Gulfstream V is in our hands!”\nMoreover, Copeland’s television program “Believer’s Voice of Victory”, held a segment with Duplantis to discuss the difference between commercial airplanes and a private jets to spread the gospel. The ministers argued that flying on a commercial plane would be similar to flying with “a bunch of demons.”\nDuring the segment, Duplantis mentions a time when he had to unbuckle his seat belt to be able to speak to God.\nJesse Duplantis Ministries/Twitter\n“You couldn’t have done that over an airline,” Copeland said. “Stand up and say, ‘What did you say, Lord?’”\nDuplantis did not immediately respond for comment.\nThe National Association of Evangelicals president Leith Anderson questioned the effectiveness of passing the offering plate in this manner saying, “I keep thinking how much good $54 million would bless the poor instead.”",
    "source_domain": "abcnews.go.com",
    "title": "Would Jesus take the wheel? Televangelist asks followers to help him buy a $54M jet plane because God 'wouldn't be riding a donkey'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/jesus-wheel-televangelist-asks-followers-buy-54m-jet/story?id=55536279"
}