{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 05:06:04+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Source: Sought-after Sean Payton talking future with Saints GM Mickey Loomis",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fsource-sought-sean-payton-talking-future-saints-gm%2Fstory%3Fid%3D44506778.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0101/dm_170101_nfl_shelly_on_chip_firing/dm_170101_nfl_shelly_on_chip_firing_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "ATLANTA -- Sean Payton met with New Orleans Saints general manager Mickey Loomis to discuss his coaching future following Sunday's season finale, a source told ESPN. Those talks are expected to continue into the week as they try to determine whether Payton will keep coaching in New Orleans or Loomis will be willing to explore a trade with another team.\nNOLA.com reported that the Los Angeles Rams are expected to ask permission to speak with Payton this week and that Loomis would be open to a possible deal.\nThe Rams have so far been concentrating on available coaching candidates, but Payton could emerge as a candidate, a source told ESPN.\nPayton refused to discuss reports about his coaching future following Sunday's 38-32 loss at Atlanta, saying only, \"Next question.\"\nSaints quarterback Drew Brees laughed off questions about the reports that Payton could leave and suggested that he believes they are \"completely made up, to be honest with you\" since they have come up so often in the past but never to fruition.\nSuch reports were even stronger and more prevalent throughout last season before Payton ultimately decided to stay in New Orleans and re-up with a five-year contract worth more than $9 million per season. The San Francisco 49ers and Indianapolis Colts emerged as potential suitors, but the interest level wasn't strong enough to sway away Payton.\nHowever, the Rams could prove to be the X-factor if the mutual interest is sincere -- a huge-market team with a ready-made defense and a young quarterback in Jared Goff that Payton liked during the pre-draft process last year.\nOne element the Rams are lacking is draft picks, since they sent their 2017 first- and third-rounders to Tennessee when they traded up for Goff last year. So it will be interesting to see what the Saints would require in exchange for Payton -- and if the Rams are willing to pay that price.\nAlthough Loomis and Saints owner Tom Benson might be willing to explore a mutually beneficial trade, this is not a case in which the Saints are eager to push Payton out the door and start over from scratch.\nA source told ESPN last week that the Saints are happy with the direction the young team has been taking this season, despite a third straight 7-9 finish. The source refuted a NFL Network report that morale is lower in New Orleans this season than it was last year, saying it's quite the opposite.\nIf Payton does leave, it will apparently come as a surprise to his players.\n\"I mean, I have no reason to believe otherwise. Sean Payton's our head coach,\" Brees said. \"And honestly, I don't know where you guys are getting this stuff. I guess there's speculation, whatever. I guess anybody can just write whatever they want, and all of a sudden, people think that it's fact or there's some truth to it.\n\"I think it's completely made up, to be honest with you. Coach Payton's our head coach, and that's that.\"\nVeteran offensive tackle Zach Strief got a little terse while complaining about the use of unnamed sources that proved to be wrong in years' past.\n\"First of all, none of us [players] talk about that right now. And second of all, I've said it five times this week, I'm kind of tired of saying it, I'm not commenting on a source without knowing who that source is,\" Strief said. \"Of course [Payton] is not gonna answer [questions on the subject]. Why would he answer that? You give credence to it forever, and it just keeps coming. It's gonna happen every year we're 7-9. It just comes with the territory. There's no need to address it.\n\"I'm sure the younger guys do [wonder], because I think you'd like to believe things you hear and read in the media. ... I'm sorry, I just ... I understand why that happens, that's what we're gonna write about this time of year. A bunch of teams writing about playoffs, a bunch of teams writing about their coaches getting fired. It is what it is, there's just no reason to talk about it.\"\nRunning back Mark Ingram, meanwhile, took a more optimistic approach to talks of his dismissal.\n\"I mean, there's been rumors about Coach Payton forever, about him leaving. So I don't believe that he's going anywhere,\" Ingram said. \"I feel like even though it was our third season at 7-9, I think there's a lot to look up to, a lot of bright spots on our team. And the team is extremely close, and we're young, and we just continue to thrive together.\n\"So I feel like, let's just keep this unit together. And Coach Payton and Drew and just, I feel like we're family. So I don't feel like we're gonna be broken up.\"",
    "source_domain": "abcnews.go.com",
    "title": "Source: Sought-after Sean Payton talking future with Saints GM Mickey Loomis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/source-sought-sean-payton-talking-future-saints-gm/story?id=44506778"
}