{
    "authors": [
        "Abc News",
        "More David"
    ],
    "date_download": "2018-02-03 09:57:31+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "FBI investigating 4 Honolulu officers for allegedly forcing suspect's mouth on urinal",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Ffbi-investigating-honolulu-officers-allegedly-forcing-suspects-mouth%2Fstory%3Fid%3D52813827.json",
    "image_url": "http://a.abcnews.com/images/US/ap_hnl_dc_020318_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The FBI is investigating four Honolulu Police Department officers who allegedly forced a suspect to place his mouth on a urinal in a public restroom, officials announced Friday.\nPolice Chief Susan Ballard said the officers were responding last Sunday afternoon to a 911 call about a person trespassing at a public restroom in the Keeaumoku area of Honolulu, ABC affiliate KITV reported.\nBallard said an officer reported the alleged urinal incident, leading to an internal investigation. The victim was also located by police.\nThe Honolulu Police Department then referred the case to the FBI.\n\"If true, these allegations violate the core value of what HPD stands form,\" Ballard said. \"Our officers are sworn to uphold the rights of all persons and I expect every officer to treat every member of the public fairly and with respect. Personally I'm appalled.\"\nROBYN BECK/AFP/Getty Images\nHonolulu Mayor Kirk Caldwell said in a statement Friday, \"Police Chief Susan Ballard has done the absolutely right thing by referring the alleged misconduct by four Honolulu police officers to the Federal Bureau of Investigation for further review. Although these officers are presumed innocent, we need an independent agency to investigate exactly what occurred and whether these officers engaged in civil rights abuses.\"\nCaldwell continued, \"Chief Ballard has promised to transform the Honolulu Police Department from a warrior mentality to a guardian mentality, and this is an approach to community policing that I wholeheartedly support.\"\nMayor Kirk Caldwell issued the following statement in regards to alleged misconduct by four Honolulu police officers: pic.twitter.com/yavCYtQYEz — Mayor Kirk Caldwell (@MayorKirkHNL) February 3, 2018\nThe officers, who have between three and 16 years years of service, have been placed on restricted duty.",
    "source_domain": "abcnews.go.com",
    "title": "FBI investigating 4 Honolulu police officers for allegedly forcing suspect's mouth on public urinal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/fbi-investigating-honolulu-officers-allegedly-forcing-suspects-mouth/story?id=52813827"
}