{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 03:30:53+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Fkevin-love-improving-concussion-protocol-ahead-game%2Fstory%3Fid%3D55550528.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "OAKLAND, Calif. -- For the second time in the last four years, the Cleveland Cavaliers enter the NBA Finals against the Golden State Warriors without All-Star Kevin Love as a lock to play in Game 1.\nLove was still in the league's concussion protocol as of Wednesday afternoon when the Cavs arrived at Finals media day, preventing the forward from speaking to reporters, but he did participate in shooting drills with his teammates during the open portion of Cleveland's practice session. He missed the entire 2015 Finals after suffering a dislocated shoulder earlier in the playoffs.\nWhen asked if Love would be able to play in Game 1 on Thursday (9 p.m. ET, ABC), Cavs coach Tyronn Lue said, \"I hope so.\"\n\"I'm still not sure,\" Lue added. \"He's going to go do some things today and see how he feels. But he is in the protocol still, so we'll see how he feels.\"\nA Cavs spokesman told ESPN that Love has made progress through the protocol process after entering it four days ago, a consequence of a head-to-head collision with Boston Celtics rookie Jayson Tatum in Game 6 of the Eastern Conference finals.\nThe spokesman said there is a chance Love completes additional steps to advance through the protocol on Wednesday.\nPrior to Game 7 of the conference finals on Sunday, Love told ESPN that he would not miss Game 1 of the Finals should the Cavs advance, however, that decision is out of his hands as the Cavs' medical staff has to clear him, under the direction of league-approved standards for concussion recovery.\nJeff Green filled in admirably in Love's absence, averaging 16.5 points, 5.5 rebounds and 1.5 blocks in the Cavs' wins in Games 6 and 7 over Boston, however Lue said that should Love be cleared to play, he will return to the starting lineup.\n\"I don't even think about that, whether I'm starting or not,\" Green said Wednesday. \"I don't even think that far [ahead]. I just think about what I need to do to impact this series, to impact the game, to help my team. I mean, I think that's up to T-Lue and what's going to happen with Kev, I haven't asked about it.\n\"I know he looks great. So, whether it's starting or coming off the bench, I'm not concerned with that. My concern is how can I impact this series to help my team win a championship.\"\nLove is averaging 13.9 points on 38.8 percent shooting, 10.0 rebounds and 1.6 assists per game during the 2018 postseason. In two regular-season matchups with Golden State this year, he averaged 24.0 points and 12.5 rebounds.",
    "source_domain": "abcnews.go.com",
    "title": "Kevin Love improving, but still in concussion protocol ahead of Game 1",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/kevin-love-improving-concussion-protocol-ahead-game/story?id=55550528"
}