{
    "authors": [
        "Abc News",
        "More Justin"
    ],
    "date_download": "2018-05-31 06:37:28+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "The upcoming Melissa McCarthy film was sued over its tagline.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fmelissa-mccarthys-happytime-murders-beats-sesame-street-court%2Fstory%3Fid%3D55552510.json",
    "image_url": "https://s.abcnews.com/images/US/seseame-1-ht-er-180529_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "According to a U.S. district judge, \"The Happytime Murders\" indeed is \"No sesame. All street.\"\nIn New York on Wednesday Judge Vernon Broderick ruled that the upcoming Melissa McCarthy film can use that tagline, for which STX Production had been sued by the makers of \"Sesame Street,\" according to the Associated Press.\nSesame Workshop sued STX last week, arguing in court documents obtained by ABC News that the trailer depicted \"explicit, profane, drug-using, misogynistic, violent, copulating, and even ejaculating puppets\" and that \"The Happytime Murders\" could tarnish its brand.\nSesame Workshop also argued parents or children could be confused that the company supported the R-rated film.\nBroderick said in court that Sesame Workshop didn't demonstrate moviegoers were confused or that sponsors had complained, according to the AP.\n\"We fluffing love Sesame Street and we're obviously very pleased that the ruling reinforced what STX's intention was from the very beginning -- to honor the heritage of The Jim Henson Company's previous award-winning creations while drawing a clear distinction between any Muppets or Sesame Street characters and the new world Brian Henson and team created,\" STX said in statement.",
    "source_domain": "abcnews.go.com",
    "title": "Melissa McCarthy's 'The Happytime Murders' beats 'Sesame Street' in court",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/melissa-mccarthys-happytime-murders-beats-sesame-street-court/story?id=55552510"
}