{
    "authors": [
        "Abc News",
        "More David"
    ],
    "date_download": "2018-02-03 13:57:35+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Rihanna, Macron join forces again to improve education in developing countries",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Frihanna-emmanuel-macron-join-forces-improve-education-developing%2Fstory%3Fid%3D52814553.json",
    "image_url": "http://a.abcnews.com/images/Politics/gy_rihanna5_dc_020318.jpg_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "She's a Barbadian-born Grammy Award-winning superstar, he's a European political powerhouse and the leader of France's Fifth Republic.\nTogether, Rihanna and Emmanuel Macron are determined to improve education in developing nations, and they brought that mission Friday to a financing conference of the Global Partnership for Education (GPE) in the African nation of Senegal, attended by African heads of state and World Bank president Jim Yong Kim.\nThe Associated Press\n\"This is a fight that we are never going to stop fighting until every boy and every girl has access to education,\" Rihanna, GPE's global ambassador, told the crowd.\nRihanna's Clara Lionel Foundation also globally promotes education, as well as the arts.\nPHILIPPE WOJAZER/AFP/Getty Images\nJEAN-CLAUDE COUTAUSSE/AFP/Getty Images\nAccording to GPE, about 264 million children worldwide are not attending school.\nMacron, who co-hosted the conference, said, \"Supporting education is not a choice we can make or not make, it is a necessity.\"\nThe purpose of the conference is to raise hundreds of millions of dollars for education in the poorest of nations. Macron said France will donate 200 million euros ($248 million) to the fund, and urged the other world leaders there to donate toward the fund's 3.1 billion euro overall goal. Macron praised Senegal for spending 7 percent of its GDP on education.\nMacron said education is \"the only single response\" to the extremism threatening West Africa.\nJEAN-CLAUDE COUTAUSSE/AFP/Getty Images\nThe pair's attendance at the conference follows Rihanna's visit to Paris in July, when Macron hosted the singer at his presidential palace and the pair discussed their plans to raised the bar on education in developing nations. The meeting occurred after Rihanna challenged Macron on Twitter to join her in her efforts to boost education in poor countries, particularly war-torn regions.\nWhen I commit, I deliver. @Rihanna, France will always side with those fighting for a better education. #FundEducation pic.twitter.com/9MLGWp2eaS — Emmanuel Macron (@EmmanuelMacron) February 2, 2018\n\"When I commit, I deliver. @Rihanna,\" Macron tweeted Friday, along with a video of the pair discussing \"putting pressure\" on governments and the private sector. \"France will always side with those fighting for a better education. #FundEducation.\"",
    "source_domain": "abcnews.go.com",
    "title": "Rihanna, Emmanuel Macron join forces again to improve education in developing countries",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/rihanna-emmanuel-macron-join-forces-improve-education-developing/story?id=52814553"
}