{
    "authors": [
        "Abc News",
        "More Lena"
    ],
    "date_download": "2017-08-14 19:47:02+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "It's the worst cholera outbreak in the world.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fwar-torn-yemen-now-wracked-cholera-thousands-dead%2Fstory%3Fid%3D49206246.json",
    "image_url": "http://a.abcnews.com/images/International/cholera-children-yemen-gty-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As she sat silently in the back seat of the car with her hands around her bowed head, Lena Rabasi listened to her father’s voice while he drove: \"God willing, we’ll get there, God willing you’ll get better.’\"\nLena, 15, didn’t know if she could believe those words. The drive to the hospital felt too long. She was dizzy, had diarrhea, and felt a penetrating pain in her stomach – her mother next to her had the same symptoms.\n“I was scared we wouldn’t be able to get treatment and would die. I knew from our symptoms that we had cholera,” Lena told ABC News via phone from her home in Yemen. “I was scared of the hospital because it was the first time I was going to a hospital. I was scared of needles. I was trying to imagine the doctors because I didn’t know what they would be like.”\nYemen is home to the largest outbreak of cholera in the world, with the total number of suspected cases reaching 500,000 and nearly 2,000 people dying from the disease since April, the World Health Organization said. Every day, an estimated 5,000 more are falling ill.\nThe U.N. calls the epidemic a “man-made catastrophe” caused by more than two years of devastating war between a Saudi-led military coalition and Iran-backed Houthi fighters.\nCholera, a waterborne disease, is relatively easy to treat.\nAlmost all people in Yemen sick with suspected cholera who can access health services are surviving. But nearly 15 million people in the country are unable to get basic health care while almost 16 million don’t have access to clean water because of damage to infrastructure from the conflict.\nLena and her family were able to rent a car and drive to a health center supported by Save the Children for treatment, but many others never reach the hospital.\n“And if people are lucky and find a hospital the most simple medicine and equipment will be missing,\" Anas Shahari, Save the Children’s communications manager in Yemen's capital of Sanaa, told ABC News.\n\"Most hospitals have no oxygen supplies and medicine. Sometimes the sick sleep on the ground in the hallways,” said Shahari, who has visited hospitals in the country.\nShahari said she has seen children receiving treatment in tents, some sitting in chairs because no beds were available. In other cases, patients sleep under trees with their IVs hanging in the branches, he said.\nThe health system in the war-torn country is collapsing, with more than half of all health facilities closed. Even the ones that are open don’t have enough medicine and equipment and 30,000 health workers have not been paid salaries in nearly a year, according to the World Health Organization.\nAs a result, millions of people have to travel far to reach any hospital, and many can’t afford the transportation to get there.\n“Many people have to borrow money from friends or sell their belongings to afford the transportation to the hospital,” Shahari said. “Others have sold their cows just for the treatment.”\nAt one hospital, Shahari met a mother and child with cholera who were almost unconscious when they arrived because they were so dehydrated. The family lived six hours away from the hospital in Sanaa and one child died on the way. Shahari didn’t meet the father – he had just heard that his mother had died and had to return for her funeral. The mother had stayed behind although she also had cholera symptoms.\nShahari said he also met one of the first cholera cases in Sanaa: A girl who suffered kidney failure due to dehydration from the cholera. At the time she had no place to go that specialized in cholera. Shahari said he met her father, mother, two sisters, aunt and two other children – a 2-year old and a 1-year-old – from the same family who all had contracted the disease.\nShahari doesn’t know what happened to the girl and her family.\nThe crisis is hitting the elderly and children the hardest. About 30 percent of those who have died are over the age of 60 while more than 41 percent of those with suspected cases and a quarter of those who have died are children, according to the U.N.\nMore than 1 million malnourished children aged under 5 in Yemen are living in areas with high levels of cholera at risk of contracting the disease, and one child is being infected with cholera every 35 seconds, says Save the Children.\n\"Yemen’s health workers are operating in impossible conditions. Thousands of people are sick, but there are not enough hospitals, not enough medicines, not enough clean water. These doctors and nurses are the backbone of the health response – without them we can do nothing in Yemen. They must be paid their wages so that they can continue to save lives,\" said Tedros Adhanom Ghebreyesus, director-general of the World Health Organization.\nThe cholera outbreak in Yemen has worsened what was already one of the world’s worst humanitarian crises. The country is on the brink of famine, with over 60 percent of the population not knowing where their next meal will come from. Around 2 million Yemeni children are acutely malnourished, according to the U.N.\nLike many other Yemenis, Lena's family doesn’t have nutritious food – the family's diet consists mainly of bread and sometimes beans. They don’t have water at home and have to buy water that isn’t sanitized. Lena’s parents currently have no income which means that paying for medicine and transportation is not easy. But the family managed to rent a car and then buy medicine that Lena and her mother needed to get better after they got sick in June.\nDays later Lena’s 8-year-old brother contracted the disease too. He had diarrhea, felt dizzy and suffered from pain in his stomach just like his sister and mother had. So the family rented a car again and took him to the treatment center.\n“I was very worried for him,” said Lena. “He was crying from the pain in his stomach.”\nHer brother recovered, but the family wasn’t free from the disease for long. Lena said she got cholera again last week. She was treated, but still feels frail and scared.\n“I still feel weak from the disease,” said Lena. “I’m scared that I’ll be sick again because I'm tired of disease.”",
    "source_domain": "abcnews.go.com",
    "title": "War-torn Yemen now wracked by cholera, with thousands dead and 500,000 sick",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/war-torn-yemen-now-wracked-cholera-thousands-dead/story?id=49206246"
}