{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:23:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "32 NFL players who need a change of scenery",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2F32-nfl-players-change-scenery%2Fstory%3Fid%3D45498382.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170209_NFL_Greeny_on_Cutler_Jets_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "NFL Nation reporters pick a player who needs a change of scenery for all 32 NFL teams.\nAFC EAST\nQuarterback Tyrod Taylor\nI'll go with Taylor, whose relationship with the Bills was clearly strained after the front office decided to deactivate him for the season finale. Taylor believed the decision showed a lack of faith in him as the starting quarterback, which will be confirmed if the Bills release Taylor before $30 million of his contract becomes guaranteed on March 11. Taylor could be successful for another NFL team, but it does not appear the Bills view him as their long-term answer at the position. -- Mike Rodak\nDefensive end Mario Williams\nIt's been only one year, but the former Pro Bowl defensive end was a bust in Miami from the beginning. Williams never quite fit in and had a career-low 1.5 sacks. Look for Williams to be a cap casualty for Miami after the team signed him to a two-year contract last offseason. -- James Walker\nCornerback Cyrus Jones\nThere is nothing that says the Patriots' top draft pick from 2016 (No. 60 overall) can't turn it around, and from that standpoint, it is way, way, way too early to give up on him. But this was as rough a rookie season as a top draft pick has had in coach Bill Belichick's 17-year tenure, and in a year when there isn't a standout candidate for Patriots player who needs to move on this offseason, Jones gets the nod because of his first-year struggles that led to him being inactive for five of the final six games and four other games during the middle of the season. Ball-security problems as a returner, as well as questionable judgment, were issues for Jones. -- Mike Reiss\nDefensive end Sheldon Richardson\nRichardson is a talented player, but his four seasons in New York have been marred by two league suspensions (total: five games) and a lack of maturity in his own locker room. He needs a fresh start. So do the Jets, who considered trading him last October at the deadline. Chances are the Jets will restart trade talks later this month. He has one year and $8.1 million left on his contract. -- Rich Cimini\nAFC NORTH\nLinebacker Elvis Dumervil\nDumervil just turned 33 and missed eight games in 2016 because of Achilles surgery. The Ravens could save $6 million by releasing him and letting him prove he has more left in the tank with another team. -- ESPN staff\nCornerback Adam Jones\nAlthough he has been with the Bengals since turning his career around in 2010, he'll also be 34 next season and is scheduled to make $7.5 million in salary and bonuses. Cornerbacks rarely continue to play at a high level past their mid-30s, and Jones, who was recently arrested, has a history of off-the-field issues and could fall under the league's personal conduct policy, potentially resulting in a suspension this season. The Bengals might consider re-signing Dre Kirkpatrick, 27, instead and moving on with 2016 first-rounder William Jackson III. -- Katherine Terrell\nQuarterback Robert Griffin III\nGriffin gave everything he had to make it work in Cleveland, but injury derailed his season. Though he returned and led the Browns to their final win, he was concussed in that game. To ask a quarterback who can't stay healthy to carry a franchise is asking too much. Griffin would do well to join a team where he's not the focal point and can merely be one part of the whole in trying to restore his career. -- Pat McManamon\nWide receiver Markus Wheaton\nThe Steelers' depth chart doesn't feature many maligned parts -- no, Antonio Brown isn't getting shipped out of town -- but Wheaton is one unrestricted free agent who should sign elsewhere to get his value back up. Wheaton was once the Steelers' No. 2 receiver before a nagging shoulder injury eventually required corrective labrum surgery. Wheaton finished the season with four catches, and with Martavis Bryant returning on the outside and Eli Rogers entrenched in the slot, Wheaton can establish his own identity for a team that needs him more. Wheaton has adequate speed and caught 97 passes with seven touchdowns in 2014-15. -- Jeremy Fowler\nAFC SOUTH\nQuarterback Brock Osweiler\nThough it may be unrealistic for the Texans to find a team willing to trade for Osweiler and take on his contract, he's the Texan most likely to move on this offseason. Osweiler struggled in his first season in Houston, throwing more interceptions (16) than touchdowns (15) during the regular season, and he was benched in Week 15 for Tom Savage. Osweiler had huge expectations to live up to in Houston after signing a four-year, $72 million contract during the offseason, but so far he has not been able to do so. If guaranteed money wasn't a factor, Osweiler would likely not be on the team next season. -- Sarah Barshop\nDefensive lineman Arthur Jones\nThe Colts keep giving Jones chances, but it's not working out for the two parties because of his inability to stay healthy. Jones has appeared in only 17 games in three seasons with the Colts because of an assortment of injuries. He took a pay cut to remain with the team last offseason, and he rewarded the Colts by being suspended for four games for using performance-enhancing drugs and playing in just half of the games in 2016. Cutting ties with Jones will also save the Colts about $5.1 million in salary-cap space. -- Mike Wells\nDefensive end Jared Odrick\nOdrick played well in 2015 (he led the Jaguars with 5.5 sacks) but injuries limited him to just six games in 2016. He'd like to play some 3-technique defensive tackle, but the Jaguars have a glut of talent there with Malik Jackson, Sen'Derrick Marks, Sheldon Day and Michael Bennett. He has some different ideas regarding rehab and preparing his body, and that causes some minor friction with the team. There's a chance he'll be gone anyway because he's due a $2 million roster bonus and has $3.5 million of his salary guaranteed on the fifth day of the 2017 league year. -- Mike DiRocco\nWide receiver Kendall Wright\nWright will be a free agent and said as the Titans wrapped up their season what everyone has thought for some time: He's not going to get a contract offer to remain in Tennessee. He's a skilled pass-catcher who can be an effective slot receiver in the right situation. He needs to stay healthy, bond with coaches and a quarterback, and work to stay on his feet and get what he can on every play without going backward. He could flourish in a new setting, but it won't mean the Titans made a mistake in moving on. -- Paul Kuharsky\nAFC WEST\nNose tackle Sylvester Williams\nWilliams was the Broncos' first-round pick in the 2013 draft. He has been a hardworking, rotational player who played much of the time on early downs in the base defense. At his best, he was a starter in an elite defense overall. But he was never quite the impact player the Broncos had hoped for, and last season they didn't pick up the fifth-year option in Williams' deal. There were some hard feelings, and Williams is now poised to be an unrestricted free agent. And while Denver will always bring back players at the right price, Williams figures to move on, as the Broncos have made their feelings pretty clear. -- Jeff Legwold\nWide receiver De'Anthony Thomas\nThe Chiefs drafted Thomas in 2014 to be their kick returner and offensive gadget player who could be a problem for opponents because he's fast. Then last year, the Chiefs drafted Tyreek Hill to do those same things, and he does them a lot better than Thomas. Thomas' impact in his three seasons with the Chiefs has been minimal. Since Thomas no longer has much of a role with the Chiefs, they should either find a team to trade him to or give him his release. -- Adam Teicher\nLos Angeles Chargers\nLinebacker Manti Te'o\nWhile I believe he would be a good fit in new defensive coordinator Gus Bradley's scheme, I could understand if Te'o wanted to take a look at his options. The Notre Dame product has missed 26 games over four NFL seasons with the Chargers due to various injuries. An unrestricted free agent, Te'o may want to explore a fresh start with another organization. -- Eric D. Williams\nCornerback D.J. Hayden\nThe Raiders' first-round draft pick from 2013 just has not panned out. Hayden had high expectations entering his contract year last summer, with the cornerback saying he expected a pick-six or two and he was embracing the move to the slot. But for the first time in his career, Hayden did not register an interception, while his 34 tackles and six passes defended were his fewest since his rookie season. Sure, Hayden played in 11 games, starting two -- his season ended prematurely and on injured reserve because of a hamstring injury -- and he became a more sure-handed tackler. But Hayden has not become a game-changer that Oakland thought it was getting when it drafted him at No. 12 overall with future Pro Bowl corners like Desmond Trufant and Xavier Rhodes still on the board. Going somewhere -- to his hometown Houston Texans, perhaps? -- where first-round expectations are nullified might be best for all parties. -- Paul Gutierrez\nNFC EAST\nCornerback Morris Claiborne\nBoth sides tried to make it work, but Claiborne's health prevented him from being the player the Cowboys hoped he could be when they moved up to No. 6 in the 2012 draft to take him. He missed nine games in 2016 because of a groin injury after the best start of his career. He was flashing the ability many thought he had coming out of LSU. He was the Cowboys' best cornerback. But then he got hurt. While there is an admiration for the loyalty he has shown the Cowboys and that they have shown him, it's better to make a clean break and see what else is out there on both ends. -- Todd Archer\nQuarterback Ryan Nassib\nThe Giants traded up to grab him in the fourth round of the 2013 draft. Nassib never really received his chance to play or compete for a starting job with the indestructible Eli Manning in front of him. After an unconvincing preseason last year and elbow surgery in December, Nassib could benefit from a fresh start after he failed to win over the Giants organization in his four years as Manning's caddie. The only way for him to prove himself will be to do so in real games. He will get that opportunity only elsewhere. It's time to move on. -- Jordan Raanan\nLinebacker Mychal Kendricks\nThe 26-year-old has a world of talent but was used sparingly in 2016 under new defensive coordinator Jim Schwartz. Look for him to be moved to a team that values athletic linebackers who can be deployed in the blitz game. -- Tim McManus\nNose tackle Kedric Golston\nThis is a tough one because Golston has been a terrific Redskin for a while. But he'll be 34 in May and is coming off a season-ending hamstring injury in Week 2. Golston is a terrific leader and a sane and inspirational voice in the meeting room, but the Redskins need to get serious about upgrading their front with younger players. Perhaps they could keep him around for the spring, allowing him to show any younger players the right approach. But for the defense to improve, they need to restock the front. -- John Keim\nNFC NORTH\nQuarterback Jay Cutler\nCutler's time in Chicago is over. Both sides are ready for a clean break after the veteran quarterback appeared in just five games in 2016. Cutler holds every significant passing record in franchise history, but tossed 109 interceptions in 102 career games with the Bears. Since Cutler arrived in 2009, the Bears reached the playoffs one time (2010). Cutler wasn't the entire problem -- and at times played very well -- but he never lived up to expectations. Not even close. -- Jeff Dickerson\nDefensive end Devin Taylor\nThe free agent-to-be had a real opportunity to have a breakout season in 2016, his first as a full-time starter opposite Ezekiel Ansah. It just never really panned out, though. He still had some success rushing the passer but wasn't an edge-setter against the run and did not make the impact the Lions had likely hoped for last season. He recently switched agents, too, signing with Drew Rosenhaus. So that could mean he's looking for the best possible deal and trying to get paid. He has a unique skill set and could blossom somewhere else, but it just doesn't seem to be working in Detroit. -- Michael Rothstein\nTight end Richard Rodgers\nRodgers will always be remembered as the player who caught Aaron Rodgers' Hail Mary to beat Detroit in 2015. But the former third-round pick hasn't done much since. When the Packers signed Jared Cook last offseason, he immediately moved ahead of Rodgers on the tight end depth chart. The Packers are expected to bring back Cook, which would further limit Rodgers' role. -- Rob Demovsky\nWide receiver Jarius Wright\nHe received a contract extension before the 2015 season, but caught only 11 passes for 67 yards and was active for just seven games as he fell out of favor in the Vikings' offense. The Vikings had receivers who could play multiple positions as well as on special teams, and the emergence of Adam Thielen in particular helped push Wright to the margins of the offense. The Vikings will have a decision to make on Thielen, who's a restricted free agent, but they'll likely push to keep him, which means the 27-year-old Wright could again find himself on the outside looking in. He has a cap figure of $3.16 million for 2017, but only $800,000 of that is guaranteed. He could be moving on this spring, and a fresh start might be the best thing for him. -- Ben Goessling\nNFC SOUTH\nQuarterback Matt Schaub\nSchaub told me last week he wants an opportunity to start in the NFL once again. The chances of him doing so in Atlanta are slim to none, with reigning MVP Matt Ryan going nowhere for \"many, many, many\" years, as general manager Thomas Dimitroff put it. ESPN's Adam Schefter previously reported Schaub could be headed to San Francisco to reunite with new 49ers head coach and former Falcons offensive coordinator Kyle Shanahan. Schaub, 35, could help Shanahan buy some time before finding the franchise QB of the future. -- Vaughn McClure\nLeft tackle Mike Remmers\nRemmers did an admirable job moving from right to left tackle for the final 13 games after Michael Oher was diagnosed with a concussion. He also gave up nine sacks and 49 quarterback pressures and was penalized 15 times. This is where it gets dicey. The Panthers want to upgrade their talent at tackle, particularly with uncertainty around Oher's condition. Adding Minnesota tackle Matt Kalil, the brother of Carolina center Ryan Kalil, makes sense. If Oher comes back, then he could move to the right side, where Daryl Williams failed to make the position his after replacing Remmers. Paying Remmers a high salary that he likely will demand would put a lot of salary-cap space at one position, particularly if another team is willing to offer Remmers left-tackle money. Much here depends on Oher's improvement over the next few months. -- David Newton\nLinebacker Stephone Anthony\nA first-round pick and full-time starter in 2015, Anthony suffered a stunning drop-off in 2016, barely seeing the field. Coach Sean Payton was very candid about Anthony's struggles with simple reads like run vs. pass. The Saints tried moving him from middle linebacker to strongside linebacker, but it didn't take. Anthony played better in a one-game cameo at middle linebacker late in the season. And the Saints switch linebackers coach this year to Mike Nolan. But if Anthony doesn't make big strides this summer, his future in New Orleans will be in doubt. -- Mike Triplett\nQuarterback Mike Glennon\nGlennon is set to become an unrestricted free agent and will want an opportunity to challenge for a starting quarterback spot. Considering there is always a market for veteran starting quarterbacks, he's got 18 starts under his belt and his 2-1 touchdown-to-interception ratio is actually better than a slew of NFL starters, he should get a shot. He's best suited for an offense that likes to push the ball downfield, and with the right supporting cast, he could be a serviceable starter. Does he have the \"it\" factor to win games though? If you ask talent evaluators and coaches around the league that question, you'll get mixed responses. -- Jenna Laine\nNFC WEST\nSafety D.J. Swearinger\nHe turned in one of the best statistical seasons of his career in 2016 but put his versatility on display while playing free safety late in the season. The Cardinals gave Swearinger a shot at career redemption, and Swearinger changed the perception of him around the league. Now it's time for him to find a team where he can be an every-down safety, which he wasn't in Arizona and may not be in 2017, depending on how well Tyvon Branch and Tyrann Mathieu return from injury and if the Cardinals re-sign Tony Jefferson. This is the offseason Swearinger can find a long-term home for himself. -- Josh Weinfuss\nWide receiver Kenny Britt\nThe veteran receiver is coming off his first 1,000-yard-receiving season, which was also the Rams' first since 2007, and will now be an unrestricted free agent. Chances are that the Rams, now under the direction of the offensive-minded Sean McVay, will move on. They'll prioritize other targets in free agency, perhaps the likes of DeSean Jackson, Pierre Garcon, Kenny Stills and the real prize, Alshon Jeffery. Britt may be better off moving on, too. He's an eight-year veteran, coming off his third season with the Rams, and may want to pair with a more established quarterback than Jared Goff. -- Alden Gonzalez\nQuarterback Colin Kaepernick\nKaepernick is expected to opt out of his contract, and although he has reached out to general manager John Lynch about meeting and discussing his future, it's probably best for both sides to part ways. Coach Kyle Shanahan's offense requires an accurate quarterback, and although Kaepernick had his best season since 2013 last year, Shanahan will probably want someone who checks that box better than Kaepernick. From Kaepernick's perspective, a fresh start might allow him to find a scheme that would put his mobility to better use. -- Nick Wagoner\nKicker Steven Hauschka\nHe has been with the Seahawks for six years but is set to be an unrestricted free agent, and the team signed Blair Walsh on Thursday. Hauschka has missed 10 extra point attempts the past two seasons, and coach Pete Carroll often pointed out that his low kicks were part of the problem. Hauschka still has a strong leg (he hit nine of 11 field goals from 40 yards or longer in 2016) and was good on kickoffs. But he will likely want to get paid as a top-10 kicker. The Seahawks should let another team pay that, allow Walsh to compete with a rookie and use the financial savings elsewhere on the roster. -- Sheil Kapadia",
    "source_domain": "abcnews.go.com",
    "title": "32 NFL players who need a change of scenery",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/32-nfl-players-change-scenery/story?id=45498382"
}