{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:21:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "List of nominees for 75th Golden Globe Awards",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Flist-nominees-75th-golden-globe-awards-51716489.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_93aaee798a0e4a5cbc6e65e5f8eb9cad_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Nominees for the 75th annual Golden Globe Awards, announced Thursday in Beverly Hills, California, by the Hollywood Foreign Press Association:\nMOTION PICTURES\n——Picture, Drama: \"Call Me By Your Name,\" ''Dunkirk,\" ''The Post,\" The Shape of Water\" and \"Three Billboards Outside Ebbing, Missouri.\"\n—Picture, Musical or Comedy: \"The Disaster Artist,\" ''Get Out,\" ''The Greatest Showman,\" ''Lady Bird\" and \"I, Tonya.\"\n—Director: Guillermo Del Toro, \"The Shape of Water,\" Martin McDonagh, \"Three Billboards Outside Ebbing, Missouri,\" Christopher Nolan, \"Dunkirk,\" Ridley Scott, \"All the Money in the World,\" Steven Spielberg, \"The Post.\"\n—— Actress, Drama: Jessica Chastain, \"Molly's Game,\" Sally Hawkins, \"The Shape of Water,\" France McDormand, \"Three Billboards Outside Ebbing, Missiouri,\" Meryl Streep, \"The Post,\" ''Michelle Williams, \"All the Money in the World.\"\n——Actor, Drama: Timothee Chalamet, \"Call Me by Your Name,\" Daniel Day-Lewis, \"Phantom Thread,\" Tom Hanks, \"The Post,\" Gary Oldman, \"Darkest Hour.\"\n—Actress, Musical or Comedy: Judi Dench, \"Victoria & Abdul,\" Helen Mirren, \"The Leisure Seeker,\" Margot Robbie, \"I, Tonya,\" Saoirse Ronan, \"Lady Bird,\" Emma Stone,\" Battle of the Sexes.\"\n—Actor, Musical or Comedy: Steve Carell, \"Battle of the Sexes,\" Ansel Elgort, \"Baby Driver,\" James Franco, \"The Disaster Artist,\" Hugh Jackman, \"The Greatest Showman,\" Daniel Kaluuya, \"Get Out.\"\n—Foreign Language: \"Fantastic Woman,\" ''First They Killed My Father,\" \"In the Fade,\" ''Loveless\" and \"The Square.\"\n—Animated Film: \"The Boss Baby,\" ''The Breadwinner,\" ''Coco,\" ''Ferdinand,\" ''Loving Vincent.\"\n—Supporting Actress: Mary J. Blige, \"Mudbound,\" Hong Chau, \"Downsizing,\" Allison Janney, \"I, Tonya,\" Laurie Metcalf, \"Lady Bird,\" ''Octavia Spencer, \"The Shape of Water.\"\n—Supporting Actor: Willem Dafoe, \"The Florida Project,\" Armie Hammer, \"Call Me by Your Name,\" Richard Jenkins, \"The Shape of Water,\" Christopher Plummer, \"All the Money in the World,\" Sam Rockwell, \"Three Billboards Outside Ebbing, Missouri.\"\nTELEVISION\n—Series, Drama: \"The Crown,\" ''The Handmaid's Tale,\" ''This Is Us,\" ''Stranger Things\" and \"Game of Thrones.\"\n—Series, Musical or Comedy: \"black-ish,\" ''The Marvelous Mrs. Maisel,\" ''Master of None,\" ''Smilf\" and \"Will & Grace.\"\n—Movie or Limited Series: \"Big Little Lies,\" ''Fargo,\" ''Feud: Bette and Joan,\" ''The Sinner\" and \"Top of the Lake: China Girl.\"\n—Actor, Movie or Limited Series: Robert De Niro, \"The Wizard of Lies.\" Jude Law, \"The Young Pope,\" Kyle MacLachlan, \"Twin Peaks,\" Ewan McGregor, \"Fargo,\" Geoffrey Rush, \"Genius,\"\n—Actress, Musical or Comedy: Pamela Adlon, \"Better Things\"; Alison Brie, \"Glow\"; Rachel Brosnahan, \"The Marvelous Mrs. Maisel\"; Issa Rae, \"Insecure\" and Frankie Shaw, \"Smilf.\"\n—Actor, Movie or Limited Series: Anthony Anderson, \"black-ish\"; Aziz Ansari, \"Master of None\"; Kevin Bacon, \"I Love Dick\"; William H. Macy, \"Shameless\" and Eric McCormack, \"Will & Grace.\"",
    "source_domain": "abcnews.go.com",
    "title": "List of nominees for 75th Golden Globe Awards",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/list-nominees-75th-golden-globe-awards-51716489"
}