{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 20:24:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "\"He holds his cards close to his vest,\" said press secretary Sean Spicer.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fwhite-house-trump-drawing-red-lines-north-korea-46848445.json",
    "image_url": "http://a.abcnews.com/images/Politics/170417_vod_orig_white_house_logs_spicer_MIX_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for White House says Trump won't be 'drawing red lines' on North Korea\nI think. As was noted on Friday we are following the same policy that every administration from giving it time issues with respect to. This or thought we will comply with of the federal records act in the presidential records act. As stated by law. People. Let's I think it's not a question of objecting it's about following the law. Were following the law as. Both the presidential records act and the federal records acts are prescribed so it's the same policy that every administration had. Up until the Obama administration and frankly that the faux. Attempt at the Obama administration put out where they would scrub. They didn't want put out. Didn't serve anyone while the president wants to make sure that people income in the same waiting go to members of congress office. Provide information and each Allison and there's people who want to be able to come. How that conversation with with members of the administration same way that they would do with members of congress going to their office he take this opportunity to line up. To get. Because I think I'm I'm trying to explain it you I think. That we recognize there's a privacy aspect to allowing citizens to come expressed their views and that's why we maintain the same policy. They every other administration did coming up here prior to the last one in the last one frankly was. A follow level of doing that because when you go through and subscriber of one scene out that you don't want him one right now. That really is is not an honest attempt to doing it we're gonna follow the law to waive it every administration has followed up until last one.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "White House says Trump won't be 'drawing red lines' on North Korea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/white-house-trump-drawing-red-lines-north-korea-46848445"
}