{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:41:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Packers attracting most Super Bowl bets in Vegas; big money on Pats",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fpackers-attracting-super-bowl-bets-vegas-big-money%2Fstory%3Fid%3D44511611.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170102_nfl_packers_nation_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The New England Patriots are the clear-cut favorites to win the Super Bowl heading into the playoffs, but bettors have been siding with the Green Bay Packers all season.\nThe Patriots are listed at 7-5 to win the Super Bowl at the Westgate SuperBook, followed by the Dallas Cowboys at 7-2. The Pittsburgh Steelers and Packers are each 8-1.\nDespite an up-and-down season, more bets have been placed on the Packers to win the Super Bowl than any other team at multiple Las Vegas sportsbooks. Green Bay hosts the New York Giants on Sunday in the wild-card round.\nThe Packers opened at 10-1 to win Super Bowl LI and saw their odds drift all the way to 80-1 after a midseason four-game losing streak. But Green Bay closed out the regular season with six straight wins, including Sunday's 31-24 victory over the Detroit Lions that clinched the NFC North division title and a playoff game at Lambeau Field.\nWhile Aaron Rodgers and the Packers have attracted the most bets, the larger action has been on Tom Brady and the Patriots. More money has been bet on New England to win the Super Bowl than any other team at multiple books.\nAmong the playoff teams, the Patriots have attracted 30 percent of the money bet on William Hill's odds to win the Super Bowl, including a $40,000 bet at 170 and a $30,000 bet at 250 that were placed in December. Those bets would net $68,000 and $75,000 respectively, if Brady leads New England to a fifth Super Bowl title.\nThe Kansas City Chiefs and Atlanta Falcons are each 10-1, followed by the Seattle Seahawks at 12-1 and Giants at 20-1. The Houston Texans, Miami Dolphins and Oakland Raiders are each 80-1, and the Lions, at 100-1, are the biggest Super Bowl long shots among the playoff teams at the SuperBook.",
    "source_domain": "abcnews.go.com",
    "title": "Packers attracting most Super Bowl bets in Vegas; big money on Pats",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/packers-attracting-super-bowl-bets-vegas-big-money/story?id=44511611"
}