{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:28:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fconspirator-prison-term-massive-health-fraud-scheme-55542258.json",
    "image_url": "https://abcnews.go.com/Health/wireStory/conspirator-prison-term-massive-health-fraud-scheme-55542258",
    "language": "en",
    "localpath": null,
    "maintext": "One of the principal figures in a large-scale health care fraud scheme in New Jersey was sentenced Wednesday to nearly two years in prison.\nCraig Nordman had pleaded guilty to conspiracy to bribe doctors and money laundering and faced a maximum combined sentence of 25 years, but he received a 21-month sentence in exchange for his cooperation with prosecutors.\nSince charges were announced in 2013, more than 50 people, including more than three dozen doctors, have pleaded guilty in the scheme involving Biodiagnostic Laboratory Services. The Parsippany, New Jersey-based blood testing lab used a variety of methods to bribe doctors to send patients' blood samples to be tested — and often for tests that weren't necessary.\nThe U.S. attorney's office estimated the company made more than $100 million through the scheme and defrauded Medicare out of tens of millions of dollars.\nAnother company associate, Cliff Antell, 43, also received a 21-month sentence Wednesday.\nNordman's testimony last year helped convict physician Bernard Greenspan. During Greenspan's trial, Nordman testified he had a high school diploma and had been installing security systems when his cousins, David and Scott Nicoll, hired him to work at BLS so he could be on the company's health care insurance.\nHe eventually joined the Nicolls' scheme, in which doctors were bribed with gifts, inflated rental agreements for their office space and bogus consulting agreements. One doctor was paid $50,000 per month at one point.\nNordman, 39, testified he bribed approximately 14 doctors, including Greenspan, with checks from a limited liability corporation formed specifically to further the bribery conspiracy.\nHe also testified he would sit in Greenspan's office for an hour once a month to give the appearance there was an actual consulting agreement.\nThe Nicolls also have pleaded guilty and are to be sentenced in two weeks. Authorities have said David Nicoll used BLS's profits on a $300,000 Ferrari, $392,000 on tickets to sporting events and $154,000 at a gentlemen's club and restaurant.",
    "source_domain": "abcnews.go.com",
    "title": "Conspirator gets prison term in massive health fraud scheme",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/wireStory/conspirator-prison-term-massive-health-fraud-scheme-55542258"
}