{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 20:25:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Plus, Jennifer Hudson opens up about kissing Adam Sandler while filming \"Sandy Wexler.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fgma-hot-list-jordan-patch-shares-latest-news-46848147.json",
    "image_url": "http://a.abcnews.com/images/GMA/140717_gma_hotlist_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'GMA' Hot List: Jordan Patch shares the latest news on April the giraffe's calf\n62 hot list from GMA today. Viral sensation captivated millions well why would that birth over the weekend helping baby wholesale right there and how she doing how she's doing how's that doing they're doing absolutely great mama had a perfect delivery perfect birthday she's been a phenomenal mother thus far very protective just so we touch his 600 time what has just met. To you and everybody there and a grander scale as that we've taken the deep conversation of the silent extinction giraffes. From a very small conversation to a worldwide conversations. Adam Sandler show last weekend with the singing your praises the life were olive oil inlet that absolute best I've never heard somebody say Jay good morning. Fans. An impact Adam. Paula there was a kissing scene in the movie and he told us that you're the son David who set oh yeah. Reaction arms that stands like mummy worry kidding him I want to give them an Adam keep the site. So dad do you have to like kissed her in the movie not like bode well. How did you do what's not okay. Us and that's the GMA hot list from today we'll see you in the morning on GMA.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'GMA' Hot List: Jordan Patch shares the latest news on April the giraffe's calf",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/gma-hot-list-jordan-patch-shares-latest-news-46848147"
}