{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 13:52:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "An article in The Washington Post shared tips on what to do if you're not watching a popular TV show or movie, plus the \"GMA\" anchors discuss the backlash against this summer's trend of \"beach spreading.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fhow-to-cope-not-game-of-thrones-fan-49198677.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_breakfast_full_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for How to cope if you're not a 'Game of Thrones' fan\nI have a good bet that a lot of people it offers a going to be talking about game thrown this morning that fair to say Apple's. What are they don't watch that show the Washington pulled him wrote about how not a fan are coping. Not the season in full swing what do you do we have a thing the most popular TV show or movie. Do you fake give. Now they all our do you. Well at least mildly not violent not just got style hockey it may yet have no idea what you're talking about yeah. The film is much like what what kind of up a person if you're in office to talk about them so you've never seen but you can't hit it was good have a lot like that seen a lot of or else he can get away with in the news business is that on this question you've eligible what do you think of when that happens you know and in cellular one an embarrassing being alive I learned I. Just like I have to argue that in Fayette let's. Drones a lot of the first three seasons I could would. Devices could keep I mean I could keep up at the time and again look at what to do week to Mexico Kenseth now right and tracking his dad going to be back. Right yeah. Yeah does admit that I have had been what did you like I have more Kathy Hilton or we're not I'm not a non fans. I just haven't quite yet but it's not just about gay liberal but had they ever did anything that you you kind of assault law Lawler. I didn't just see lot of about you said that he and I were talking earlier in it was like bookings the lot of people would with fake it would La La land it was all get into the main. No I said that I wouldn't fake it would just go see the movie that can agree but that would just go sit and always have. Don't put that have been big in the past where I've seen it yeah that was great and as you move on did just to get it over with the to get it over with the move. I understand what we should move on cannot get. We're going to be this weekend regime and anybody it speaks. But yet you did. So I'm have you noticed this phenomenon that's happening you've probably heard of man's writing where where there were stories that we didn't where Chad I've literally. I studied cousin yeah like I was somewhere where I just remember where people just sort of spread out well now I guess this is spread to the beaches and and they're calling it the the phenomenon beach reading where people are literally. Like packing up their homes. And going to the beach. But at the hands like there's an umbrella while I'm doing multiple blankets even though they may only be three people are setting up. You know fibers explained it's just so that they have some space. That is be spreading. And I'm some towns in New Jersey are saying girl you need you need to stop. Yeah now you can you're welcome to our beaches but. That's fine there are a little bit yeah. I don't lineup but it was like to Kippur so. Yeah no beats were. Critics say they'll be spreading so what can what can you do it already limiting you can you must have a towel lot of people are a towel reviewed cooler so. I think that's OK yes media radio out all by yourself yeah. He got Italians mentioned in the south post article about mart New Jersey. Eight legacy long BC's and I already hobbies. Rules in place and the merit Dahmer says the tends to have a lot of space and a very crowded beach some of them have side that prohibit the lifeguards from being able to see. The swimmers that would be a problem so this have fretted. Tenth that are more than three feet high and 3-D why do you need something bigger than the understand your ten W staying home it doesn't let. I haven't issuing a vacationing in a hotel and the pool and someone takes up all laid you know that your dad thought of Michael calm while always. This is worse job one. And then they still three in the afternoon and I'll be honest with you all know look good too much about -- for somebody remembered. I have young children. Hi there that they wouldn't that you guys. I'm.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "How to cope if you're not a 'Game of Thrones' fan",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/how-to-cope-not-game-of-thrones-fan-49198677"
}