{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2018-05-30 21:26:18+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "There have been more than 20 explosions since April.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fpennsylvania-authorities-discover-source-mysterious-booms-middle-night%2Fstory%3Fid%3D55538540.json",
    "image_url": "https://s.abcnews.com/images/US/180524_atm_mystery_booms_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Authorities have discovered the source of the mysterious booms heard rocking a Pennsylvania neighborhood last week, ABC Philadelphia station WPVI reported.\nThe loud sounds -- which have been heard in Bucks and Lehigh counties -- resulted from someone setting off explosives in the middle of the night, according to WPVI. Police have not rounded up any suspects and are asking for the public's help in identifying the person or persons responsible, WPVI reported.\nResidents in those counties, some whom live miles apart, have been reporting explosion-like sounds that apparently rattled their homes and shifted the ground beneath them since April, according to WPVI. There have now been more than 20 explosions.\nUpper Black Eddy resident Nick Zangli told WPVI that locals shoot guns and set of fireworks in the area \"for fun,\" but described the noises he heard as \"above and beyond.\"\nThe first time Zangli heard the noises was May 12 at 3:35 a.m. -- the Saturday before Mother's Day, he said.\n\"I happened to be awake and it scared the heck out of me,\" Zangli said, adding that it caused him to jump out of bed. \"It was definitely a very large explosion.\"\nWPVI\nRichland Township Police Chief Richard Ficco told WPVI last week that the reports typically come in overnight before dawn. Most of them detailed \"the ground shifting, almost shaking\" as well as moving ceiling tiles and rattling windows, Ficco said.\nZangli said another resident reported a large hole nearby along the side of Lonely Cottage Road the day after he heard the explosion for the first time.\n\"I stopped and looked at it,\" he said. \"It was obviously an explosion. It had blown debris across the road and stuff.\"\nWPVI\nHaycock Township resident Sue Crompton told WPVI that she heard a loud boom near her trailer along Old Bethlehem Road that \"actually rumbled the whole room.\"\nTwo Richland Township Police officers have also heard the noise, and one of them even saw a flash of light, the police chief said.\nThe Pennsylvania State Police, who are leading the investigation into the reports, did not immediately respond to ABC News' request for comment Wednesday.\nThe FBI and ATF are assisting state police in the investigation.",
    "source_domain": "abcnews.go.com",
    "title": "Pennsylvania authorities discover source of mysterious booms in the middle of the night",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/pennsylvania-authorities-discover-source-mysterious-booms-middle-night/story?id=55538540"
}