{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 18:57:09+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fuk-judge-holds-hearing-sick-toddler-alfie-evans-54697519.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_a37175413d504dbf93a05bccca1d714b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A British judge heard a new appeal Tuesday from the parents of a terminally ill British toddler who want to take him to Italy for treatment — something British courts have ruled isn't in the child's interest.\nThe Christian Legal Centre, which is supporting the parents of 23-month-old Alfie Evans, said lawyers would repeat a request to judge Anthony Hayden to allow the boy to be cared for at the Vatican's hospital in Rome.\nThe judge appeared to rule that out at an emergency court hearing in Manchester, but asked whether there might be \"other options\" that involved Alfie's parents taking their son home. The hearing was adjourned while the hospital considered the question.\nDoctors say Alfie is in a \"semi-vegetative state\" as a result of a degenerative neurological condition that medics have been unable to identify precisely. Doctors treating him at Alder Hey Children's Hospital say he has little brain function and further treatment is futile.\nBut his parents have refused to accept the decision and fought to prevent Alfie's life support being switched off.\nHe was taken off life support Monday after a series of court rulings blocked further medical treatment. Alfie's father Tom Evans said earlier Tuesday that Alfie survived for six hours with no assistance, and that doctors had subsequently resumed providing oxygen and hydration.\nIn court, the family's lawyer, Paul Diamond, read a statement from Tom Evans saying his son was doing \"significantly better\" than previously believed.\nEvans, 21, and Alfie's mother Kate James, 20, want to take Alfie to the Vatican's Bambino Gesu Pediatric Hospital. Doctors at Alder Hey Hospital in Liverpool, northwest England, believe that would not be in the boy'ss best interests, and British courts have agreed.\nEmotions have run high over the case, with a band of supporters known as \"Alfie's Army\" protesting regularly outside the hospital. They have blocked roads and on Monday tried to storm a door of the hospital before being pushed back by police.\nThe case has also drawn the attention of Pope Francis, who during a Sunday blessing in St. Peter's Square this month offered prayers for Alfie and others who are suffering from serious infirmities. Francis has made appeals for the boy to be kept alive, saying only God can decide who dies.\nThe head of the Vatican's Bambino Gesu Pediatric Hospital said the Italian defense ministry had a plane ready to transport Alfie to Italy if he were allowed. In an interview with Italian Radio 24, Mariella Enoc, who travelled to Liverpool to personally try to intervene on behalf of the parents, said she spoke to the Italian ambassador in London who said the plane could leave with him in a matter of minutes.\nOn Monday, the Italian foreign ministry announced it had granted Alfie Italian citizenship to facilitate his arrival and transport.\nUnder British law, it is common for courts to intervene when parents and doctors disagree on the treatment of a child. In such cases, the rights of the child take primacy over the parents' right to decide what's best for their offspring\nThe emotive case recalls the short life of another British child, Charlie Gard, who died of a rare genetic disease in July 2017 after a vicious court battle in which his parents sought treatment first in the U.S. and then Italy.\nThe case drew interventions from the pope and President Donald Trump, and became a flashpoint for debates on the rights of children and parents, the responsibilities of hospitals and the role of the state.\nAlder Hey Hospital said it wouldn't be offering a running commentary on Alfie's condition.\n\"This is our normal and agreed practice with all our patients,\" the hospital said in a statement.\n———\nAssociated Press writer Nicole Winfield in Rome contributed to this story.\n———\nA previous version of this story has been corrected to show that the father's name is Tom, not James.",
    "source_domain": "abcnews.go.com",
    "title": "UK judge holds new hearing over sick toddler Alfie Evans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/uk-judge-holds-hearing-sick-toddler-alfie-evans-54697519"
}