{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 20:23:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Bengals' Adam Jones berates reporter after offseason arrest question",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fbengals-adam-jones-berates-reporter-offseason-arrest-question%2Fstory%3Fid%3D46848029.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0417/dm_170417_ncf_tomherman_interview/dm_170417_ncf_tomherman_interview_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CINCINNATI -- Cincinnati Bengals cornerback Adam Jones went on a verbal tirade against a reporter just minutes into the team's first open interview period of the offseason on Monday.\nJones was speaking to the media for the first time since he was released from jail after an arrest in January. He spoke for only four minutes before he yelled at a reporter who'd asked whether Jones had anything to say to the fans about his arrest. Jones announced before the interview that he would not be taking any questions related to the arrest.\nJones entered alcohol-related treatment program and anger management in the offseason after his arrest on charges of harassment with a bodily substance, assault, obstructing official business and disorderly conduct. Jones' felony charge stemmed from an incident in which police say he spit on the hand of a nurse at the Cincinnati jail. He was also caught on camera cursing at a police officer and telling him \"I hope you die tomorrow.\"\nCincinnati prosecutor Joe Deters dropped the felony charge in March?and said Jones' insistence on staying in the anger management program beyond the normal limits factored into his reasoning.\n\"I know you said you were thankful for the organization. Is there anything you have to show to fans, have to prove to the fans for them to welcome you back since there were a lot of people upset with the way things went down in the offseason for you?\" Jones was asked on Monday morning.\n\"Didn't I just tell you don't ask me that?\" Jones said. \"Turn around. Go back that way. See you. Next question.\"\nJones then walked away after declaring the reporter was not allowed to ask him any more questions for the rest of the year. He walked across the locker room to the restroom before turning around and coming back to berate the reporter. Jones repeatedly cursed at the reporter and said it was a \"dumbass question.\" Bengals coach Marvin Lewis eventually entered the room to speak with Jones.\nJust a few minutes earlier, Jones answered an question from the same reporter on how he felt about the support from the Bengals organization after the arrest.\n\"Words can't express my feelings for the organization, Mr. Brown, coach Lewis, my teammates, the city of Cincinnati,\" Jones said. \"This is home for me, so I'm very eager be here and I don't take it for granted.\"\nThe Bengals declined to comment on Monday's incident.\nJones has been in off-the-field trouble several times over the course of his career, which almost came to an end after he was suspended by the NFL for the entire 2007 season because of an incident in a Las Vegas nightclub that resulted in a man being paralyzed. Jones was ordered to pay $12 million in damages to the victim for his role in the incident.\nJones has been with the Bengals since 2010 and was voted a team captain for the first time last year.",
    "source_domain": "abcnews.go.com",
    "title": "Bengals' Adam Jones berates reporter after offseason arrest question",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/bengals-adam-jones-berates-reporter-offseason-arrest-question/story?id=46848029"
}