{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2018-03-19 19:46:36+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Nixon accuses Cuomo of failing to fix the the city's subway system.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fsex-city-actress-cynthia-nixon-challenge-ny-gov%2Fstory%3Fid%3D53855489.json",
    "image_url": "https://s.abcnews.com/images/Politics/cynthia-nixon-gty-jef-180306_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“Sex and the City” actress Cynthia Nixon officially announced her primary challenge to New York's Democratic Gov. Andrew Cuomo on Monday.\nIn a video announcement, the actress states: “I love New York. I’ve never lived anywhere else.\"\nNixon also attacks Cuomo for “a string of indictments for corruption, his failure to fix the New York City subway, and his support for a backroom deal which handed Republicans control of the state Senate, resulting in the failure of numerous pieces of progressive legislation,” in her release announcing her candidacy.\nThe video, which aims to introduce her to voters, shows her at home with her wife Christine and son Charlie, and walking her son Max to school.\nIn the coming weeks, Nixon will travel across the state to hear from voters, according to an announcement from her campaign.\nHer message also echoes the outsider, progressive message other candidates have invoked this year.\n“We are sick of politicians who care more about headlines and power than they do about us. It can’t just be business as usual anymore,” she said.\nThis would be Nixon's first bid at political office but she has long been an activist on political and social issues, particularly for LGBT issues and education issues. The actress, best known for her role as the practical lawyer Miranda on HBO' \"Sex and the City,\" was born in New York.\nHer announcement video emphasizes her long ties to the city and that she is a graduate of its public schools. It emphasizes her life as a New Yorker, showing her walking the streets and taking the subway.\nI love New York, and today I'm announcing my candidacy for governor. Join us: https://t.co/9DwsxWW8xX pic.twitter.com/kYTvx6GZiD — Cynthia Nixon (@CynthiaNixon) March 19, 2018\nNixon has been an outspoken critic of Cuomo and his administration. Her bid comes as the Democratic Party looks to reconcile divides among its liberal and more moderate wings, a breach that has its roots in the 2016 election.\nCuomo, the son of legendary New York Gov. Mario Cuomo, is making his bid for a third term. He has $30.5 million in his campaign account, according to New York election records.\nThe actress is a longtime ally of the New York City Mayor Bill de Blasio. Nixon's wife, Christine Marinoni, works in de Blasio's administration as a special adviser for community partnerships in the Department of Education.\nDimitrios Kambouris/Getty Images\nHer announcement video ends with her on the train as the announcer says \"Next stop, Albany.\"\nThe gubernatorial primary is Sept. 13.",
    "source_domain": "abcnews.go.com",
    "title": "'Sex and the City' actress Cynthia Nixon to challenge N.Y. Gov. Andrew Cuomo in primary",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/sex-city-actress-cynthia-nixon-challenge-ny-gov/story?id=53855489"
}