{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 01:22:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Documents show the pop star had narcotics disguised in aspirin bottles hidden all over his home.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fsearch-warrants-unsealed-investigation-death-prince-46851907.json",
    "image_url": "http://a.abcnews.com/images/WNT/170417_wn_pilgrim3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for New search warrants unsealed in the investigation into the death of Prince\nas it was coming down. New revelations tonight from the investigation into the death of pop star prince. Newly unsealed records tonight show that he had narcotics hidden all throughout his home. As ABC's Eva pilgrim reports, one more glaring mystery. Reporter: Tonight, search warrants concerning music super star prince's death unsealed, painting a picture of the singer's opioid addiction. These court documents show investigators found a sizable amount of narcotic medications located inside paisley park. The pills, hidden in aspirin, and other over-the-counter pain relief bottles, all over the house. Some of them, found in a suitcase along with handwritten lyrics to his 1987 hit \"U got the look\" were prescribed under the name of his long time friend and drummer Kirk Johnson, including the oxycodone prescribed by Dr. Todd shulenberg after prince's plane made that emergency landing in Moline, Illinois. What's the nature of the emergency? Unresponsive passenger. Reporter: Johnson picked those drugs up from the pharmacy, but told investigators he didn't know prince was addicted, and it was the first time he had done something like that for prince. The search warrants now show that Schulenberg told investigators he put the prescription in Johnson's name for prince's privacy. David, what's still not clear is how prince got the powerful narcotic fentanyl that ultimately took his life. Investigators scoured his computer, email, and phone records looking for any clues, but found no prescriptions for fentanyl.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "New search warrants unsealed in the investigation into the death of Prince",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/search-warrants-unsealed-investigation-death-prince-46851907"
}