{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:55+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Dr. Ashton discusses what to know about the stunning new study that says HPV blood tests were more likely to detect pre-cancerous lesions.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FWellness%2Fvideo%2Fhpv-test-pap-smears-detecting-early-cervical-cancer-56361410.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_ashton_2a_0817_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for HPV test may be better than Pap smears at detecting early cervical cancer: Study\nWe want T Tur to a \"Gma\" health alert. A new stu could make the pap smear a thing O the past. Everyan said halleluj more than 1000 women will be diagnosed with cervical cancer th year and now a Massi clinical trial finds that the HPV test is better than the traditional pap smear in detecting early signs of the disease. Good morning. Tell about the study and whathis could really mean. Ts appeared in journal of the American medical association.\" A study done inanada and followed W over a fourear period and divided them into three groups. Wo screened using jus the HPV, THA the human papillomavirus test ane and women screened with tonal liquid bas pap and aafety ground the women sned just with the HPV test had a lower chance ofeveloping the precancerous lesion that we rry about passing to cervical cancer again the ce of the virus tended to trump the abnormal cells on the pap smear. Nicole wrote in to us on Twitter asking why isn't HPV testing standard during a pap if so much of the populatioas it? The good new for women listening for the most in this country already is. Womeould ask if there I autic reflex HPV testing. Notomething thetor has to say now I'll check you F HPV. It's done wi same instruments as the P. These are the instruments use a traditional pap smear. Nothing scary here, same instruments are done to do the hpest. Pap smear looks a cells and Ng look at DNA of virus which sexually -- Next time we go to the doctor do we ask for an HPV St? Yhould ask if reflex test something done when they geteened with a pap smear Beuse this is not going away. We still need more long-term follow-up and data they need to ask when my rest is back is it Normal O abnormal and ask for th specificerminology and management of abnormal pap smears is based on whether or not there's HPV there, T age of patient and that patience's pticular pap history. Anyth else women can doo lower their risk? There is and the single test advance for cercal is aside fromheap smear screg is the HPV vaccine. This ishat prove the majority O cervical cancer which is cau by this virus. So getti vaccinatedor women and mento the age of 26, very important and thensmoking, it's bad for the whole body but 'S really bad for the rvix. Gre informati as always. Gi.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "HPV test may be better than Pap smears at detecting early cervical cancer: Study",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Wellness/video/hpv-test-pap-smears-detecting-early-cervical-cancer-56361410"
}