{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 21:09:52+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Amna Nawaz talks to the social media influencer about her new book, \"When You Find Out the World Is Against You: And Other Funny Memories About Awful Moments.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fvideo%2Fauthor-kelly-oxford-talks-book-social-media-fame-46849083.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/170417_gostream_kelly00_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Author Kelly Oxford talks new book and social media fame\nIn the lied in New York while she's been called one of the funniest most creative writers out there. Kelly Oxford is here with that in this studio is a new book out called when you find out the world is against you thanks for being here thanks for having me and play whoever's and most creative writers had not heard back to marry together two different actor that was what your view one of the funniest person arguing that you to think thank do you yes. You're welcome this really well. And. Its second one my second and excited about it bill. For easy stories about my Lai see. Silence at 19 anxiety. Could your first line also only gradually in order a New York Times that there and national best can't forget about Canada don't forget it wants sorry what hooked you been very angry. And meet you after actress meet you when do you. Well when you get a New York Times best. They offer in. Now I think I would have. Five to write another book anyhow there's so much on right end I like red monk wanna answer arms now as the great but. It's translate. That language at use on Twitter. Into longer essays written narrative form that with particularity. And out there and Utley written mean Twitter was something that I just. The writer something so. I've always been on reform on performance something you can view social media or blogs. I've put together a proposal one. There Twitter payments. And the people arrested. And they eat every that are actually call you when when the writing about uniquely Twitter celebrity. And this. It is Saturday. And you know and time as the liberty and a pack. And a direct ballot flight. What matters now Twitter payments again and even writing and human that you use to block a lot to write a lot. And communicated literary name rank and had found her DREAM Act in the writing clearly really important. Call lies lies that wait that you work out there it started when I was three and learn has every right. Currently. In just like my first real motive communications and I think it's Al. The most comfortable. I'm sure a ton of praise for being able to read it right and has something to do it. Ain't into that idea but I feel you know is only tree that could only imagine how like the whole family sitting around it watching me the newspaper affected me mentally. Now are writing that sentence that was just how she instantly it just keep doing its threats. Yes you. And North Korea Italy had been that they then again. It tell me about your audience that it's part of its use he stressed that he went to great there's no filter in writing which is let me say so powerful. But is there a little bit it's sort of like self perpetuating mechanism and it where people respond a lot to certain kind of thing and then you feel like to keep doing it well could I have. I am a naturally. Laugh out. Instigating type of person. And so I can't help scientists. Baughman you know we're doing do you really it is quite yet. Always and it was always. Really difficult for me you know growing up because you want your peers but he wants to be like everybody anyone do the same things we all want to sleep overs and Alan by the same. So because now the Friday delaying yet. And I was nine. And then people. Why isn't she what did you all. Several books though. I ended up embracing sort of Anwar and annoying annoying part of myself which has worked out pretty acampora. I think. A once popular online it felt really safe to just say and be I want it to be and then through doing that I realized how well being yourself. Is the only thing that sets you apart from anybody else and you find sort of your tribe and then everybody Allen feels good an okay. That. Can relate to you sell. So I'd just be myself now Clinton and eBay in giant and anybody can paint then yes it's all of that congress yet again. City year's super prolific on Twitter about and is to grant to go. Your holy acts enemy they talk about the government has the show actually talked about everything from your relationship hats to you updated day to parenting. Is this one votes the Bulent hiding your car. From your kids. I'm Lester when and it's I think. I'm Heidi well I didn't saying yeah that people can not revealing a thing about my life and a lot of people could relate yet as I wasn't even that lives two weeks ago. I was. Hiding in my car eating invented so how your kids react when they sees stuff like about it they don't care do they not know that humid I was. You know link they announced that S. They'd follow my career what I do as much as I followed my parent's career Atlantic thank you justice say. Well I mean I'm just when your kid you're managed. Your parents do want to get out of school Wednesday. To go to. Your parents and their parents or whatever it that feeling anxious that it's so stockpiled all kids says just little. Around things and out there they're not into that at all now and not like what am a car. And I take my is and I can't get busy talking to their friends like I have a count. Their moms and and I asked how boring kidnap me. It there at least Wentz though much of your life. Is out there right and years moments about what happens if your kid and personal stories and you're weary and I eighties and those things. If any party keeps something cracked it just oh yeah that myself I mean it's private I would say. But we're working free. This question all the time and don't really know the line is I think it's just instinctual what I share. I probably share. A lot of my life but maybe like 35% which alive town and the rest of it's just fine and quiet. It is. Not out there are. Did talk a lot about how you handle your anxiety and stress is also something a lot of people. Can you share on degree answers your journey we've searching healing crystals that way and yet that talking about that we're now. I've just mean crystals brand like my last gaffes. Cigarette was just like. He thumb pain pain and I'm need to turn into a critically. I write about crystals for in style it means they knew I was on asserts. And I think. Anything you can use itself com. Are now self care. Is what really helps with anxiety knowing expecting an even have it in the first thing because the more you fight it. The more terrifying it becomes. Then why are you start feeling anxious about things you. Propelling you buy it now which make that wait hours. So I think first that is just expecting that you're anxious person. Near an island with anxiety and you're gonna see things happen and you know also. In the positives and it is you're going to be the first indifferent to find a problem and problem solve. So there's a lot of different ways go after hearing aid how to match wits that voice that you asked you to public persona now. In other parts of the work that you do now that I hear it even harder to control helped kind of split I think out because. How normal lives again having anxiety which means not like anything but it. Feels bad talk about its. The most helpful thing. The right idea and just found in my pocket you know they had no idea this crystal is in my pockets as mold site which is like I'm sane right. But it's a very prayer. Then what is an exciting at the protection. Like at psychic being in a protector. I know it's one of the most powerful crystals beaches Spencer Pratt. And he wears them all the way necklace around its. Deal with apple and IQ I have three in my day union. He's gonna take the man is unique stories carry it with me and I happen Oliver house they're really pretty yet and placebo or not they're. Pretty. But. They're pretty with an. I ask you about the last chapter the stock because it is incredibly powerful. And a lot of people who were familiar with your work before it became in the last year when you start it. But not okay cash. And he tweeted about the very first time you with the victim of sexual. You only twelve years on it right and an older gentleman. Grabbed you in the genitals mind. And you write about it so powerfully in so much everywhere and so hilarious way and it is so sarcastic and funny that you chose to make. The last chapter focused just on July. Think it ties in with the rests of the book and just. You know sharing a and all of the different times I'd been assaulted and com throughout my life and after started in the not okay cashed AA realized how prevalent. Sexual assault really is what they should have known before because every single one of my friends has been either raped or sexually assaulted so it shouldn't have been such a shock to me that. You know millions of women said that this happened since you within one date period come but I think that sharing unit at the end. It was just another part of just like releasing and anxiety about things these are things that I never talked about before and all the stories in the book are really funny some are a little less funny. But all of them have to deal with anxiety. And how we live and I think that'll that most women. Live with anxiety and live with. The fear of sexual assault or. You know and rape. And I think it's important to talk about and again normalize. Things that are normal and unfortunately sexual assault is very normal. That's the crazy thing is everyone knows the statistics writes for college campus says no you know one and when in 31 in four and American women over all the numbers are just alarming. But what you did by asking people to share their stories with was picked deet tails and an eight bit and and and personal stories. To its it will sit like for you mentioned literally millions of women's race he shared their own stories after you first figures out there like feeder and in the. Why they didn't hiding get out of bed her two days I just sat there reading them and trying to figure out a way. To make sure other people could read them too because they were all being. Sent to me again so I just I think they did anybody else seen all of the is so I really am retreated a lot of them. I like a lot of them and then had people look through my name my likes. And thankfully you know the New York Times picked it up. When you know on these news shows to discuss it so it did become a bigger conversation. But it was really hard I mean I went out for dinner two days after. Post in the first week. And my friends were and a really good mood you know sort of bummed out in the early let's go this is a really positive thing that you didn't think about bucket with scroll through. My Twitter feed at every time I would update at. Every second that we're still like five new stories and news stories company news stories Ford stars it was just constantly. Women sharing yeah come which was very overwhelming. It brings me to the sort of the larger question here which is you have this amazing voice. Right and you have this incredible platform yen and if there's some sort of like mission. Behind what it is he'd like to accomplish its eighty solely evolving yeah. Ole I think I'm just gonna keep doing what I'm doing now and if anything pops up today. Feel. I should contribute to you or I want to start and I well. Policy against every day's a new day on Twitter thing. NI LA Vista. Yet. Do you obviously you're cute on Twitter how do you pick that your gonna follow. Well now I am. It's mostly. New friends or. Friends and friends. Do you have favorites yet people like you can become so many people's favorite don't have any you know it looked like I have to Packers today. Having favorite I have. But this scene at the core group of people that I follow. All tweet every single day solely on a get my fill of basically like every and it's just like Twitter group more than one person that I speak. Do you follow art art Tweeter in chief. Our president. No I did until he became president and that way. Yes of course that is bold move of course an idea of course that you quit taking the Twitter questions earlier at a bunch for so coming and you would take worried. Degree in line for if you actually seizing that app. Kelly Oxford hash tags so let's to this effort and would you ever do an episode of drunk history. It said so. What would you want to reed's house. He was gas. How are back today. I would act you look at me what I wanna go to I would either I would issues. Oprah. Story of Oprah's lie okay or rises story of like McDonald's. But rethink its. I would either an island I would get I would probably throw up because I'm not a very good drunk. And I would tell while. Back. To it there and that haven't about the work that you do what his writing the clinic on an everyday basis for you with all the other things going. It daily practice yeah I write every single day because so many different jobs that's yet to hear writer good but. It involves a lot of can be. And progress of nations with the Indians. I LA. Like like him and hands. Fund at. Mountain climb to other maintained its look at what is the state now it's not flavorful. It's just like that my Dominican somebody on. Called on it it'll stink. Island player atlas. Yet candy crest the nation and then setting at time on it is a really big deal to get in the work so that they have to meet that you can't or have yet we have got to me I've got to be able to finish what I haven't for me at least gantlet twenty pages Gunner by eight is done by 3 o'clock that's mostly light that the united Aniston. Ohio and that might let it only took me half an hour white and it that they irony candy for two hours at that candidate that the I. Last question. This person actually lamented I missed my chance to ask Oxford. But she didn't actually. Here she is answering your question where she got the thinks she's seen eating my friend and god has this great website. Called and oh. BA. DO dot com and they sell all of that let paint. Clean it up there are an unsolved arson if this month. Don't. It. Love it. Didn't pick apart the Booker now you love it on and I don't have a favorite that you I don't think it ethic and a favorite moms national. Moms now. I Oxford thanks Patrick and I thank you some other US's fun at. If the book when you find out the world is against duke it now Hewlett and egg and even black. The attack an act back. It.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Author Kelly Oxford talks new book and social media fame",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/video/author-kelly-oxford-talks-book-social-media-fame-46849083"
}