{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 08:14:59+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fasian-shares-track-wall-street-rebound-italy-fears-55553481.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_69ae855fd04b4817b15c5e7746ca5b18_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Asian shares rose Thursday after U.S. stocks recovered most of their sharp losses from a day earlier as jitters over Italy's political situation subsided.\nKEEPING SCORE: Japan's Nikkei 225 index gained 0.8 percent to 22,201.82 and Hong Kong's Hang Seng index jumped 1.1 percent to 30,385.50. The Shanghai Composite index rebounded 1.8 percent to 3,095.47 and Australia's S&P ASX 200 climbed 0.5 percent to 6,011.90. South Korea's Kospi advanced 0.6 percent to 2,423.01. Shares rose in Taiwan and were mostly higher in Southeast Asia.\nWALL STREET: Banks and energy companies surged Wednesday as investors reversed course on hopes that Italy will be able to avoid a new round of elections. Stocks had plunged the previous day as investors expected the Italian gridlock would be resolved with new elections that could have turned into a yes-or-no referendum deciding whether Italy would continue to use the euro. The S&P 500 index jumped 1.3 percent to 2,724.01 and the Dow Jones industrial average also climbed 1.3 percent to 24,667.78. The Nasdaq composite gained 0.9 percent to 7,462.45. The Russell 2000 index surged 1.5 percent, closing at a record high of 1,647.99. Italy's FTSE MIB stock index climbed 2.1 percent after a 2.7 percent drop a day earlier. Prices for Italian government bonds also rose, sending yields down following a huge surge the day before.\nCHINA MANUFACTURING: Chinese factory activity grew at its fastest rate in eight months on stronger demand, a survey showed Thursday, in a positive sign for the world's No. 2 economy despite trade tensions with the U.S. The official purchasing managers' index, or PMI, rose to 51.9 in May from 51.4 the previous month. Readings above 50 indicate expansion, while lower numbers indicate contraction on the index's 100-point scale.\nANALYST'S VIEWPOINT: \"Today's strong set of official PMIs tell a reassuring story about current growth momentum. However, we will have to wait for more reliable indicators to be published in order to get a clearer picture of the health of China's economy,\" Julian Evans-Pritchard of Capital Economics said in a commentary.\nCHINA TRADE: China's government said Thursday it reserves the right to retaliate if Washington goes ahead with proposed investment controls Beijing said violate global trade rules. The Commerce Ministry's comment came as the two sides prepared for weekend talks in Beijing on American complaints about China's trade surplus and Beijing's promise to buy more American goods.\nCURRENCIES: The euro rose to $1.1689 from $1.1664. The dollar fell to 108.66 yen from 108.89 yen.\nENERGY: U.S. crude oil slipped 25 cents to $67.96 per barrel in electronic trading on the New York Mercantile Exchange. It jumped 2.2 percent on Wednesday to $68.21 per barrel in New York. Brent crude, used to price international oils, lost 43 cents to $77.29 per barrel. It added 2.8 percent to $77.50 a barrel in London. Oil prices fell 7.6 percent in five days following reports OPEC countries and Russia might start producing more oil soon.\n———\nAP Markets Writer Marley Jay contributed to this report. He can be reached at http://twitter.com/MarleyJayAP . His work can be found at https://apnews.com/search/marley%20jay",
    "source_domain": "abcnews.go.com",
    "title": "Asian shares track Wall Street rebound, as Italy fears fade",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/asian-shares-track-wall-street-rebound-italy-fears-55553481"
}