{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:47:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "He always hit 'em far; now Stanton is hitting 'em fast",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fhit-em-now-stanton-hitting-em-fast-49211227.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_653f1f1632124d3d842a9025d6ce68ec_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Given Giancarlo Stanton's recent home run binge, Derek Jeter may decide baseball's biggest contract is a bargain.\nStanton signed a record $325 million, 13-year deal in 2014 with the Miami Marlins, and they still owe him about $300 million — an eye-popping number even to a former All-Star shortstop for the New York Yankees.\nJeter's investment group agreed last week to buy the Marlins from Jeffrey Loria, and given the franchise's history of low revenue and attendance, there's already speculation the incoming regime may deem Stanton unaffordable.\nBut lately, he looks like a keeper at any price. Stanton's knack for moonshots has long made him the sport's most prodigious slugger, and now he's also the most prolific.\nHe began the week leading the majors with 42 home runs, including 21 in the past 33 games. He would finish the season with 71 homers if he continues his pace of the past five weeks.\n\"It has been amazing to watch,\" manager Don Mattingly said.\n\"You know you're watching something special,\" teammate Javy Guerra said. \"It's very weird to see a guy come to the plate, and you think he could homer every time. It's a lot of fun to be a fan.\"\nStanton homered for the fourth game in a row Sunday against the Colorado Rockies to tie Gary Sheffield's franchise record for homers in a season, set in 1996. The home run was the 250th for Stanton in 3,407 at-bats, and by that measure, only four players reached the milestone faster — Harmon Killebrew, Ralph Kiner, Babe Ruth and Ryan Howard.\n\"Crazy,\" said Stanton, 27. \"Those are guys you glorified and put on a pedestal as gods as a kid, and you're right there on the same plane as them now. So it's something special.\"\nThis year is special for Stanton because he has remained healthy, missing only two games. It's the first time since 2011 he has avoided an injury that sidelined him for a lengthy stint.\nWorst was a season-ending beaning in September 2014. Stanton led the National League in home runs and RBIs when his face was fractured by a fastball from Mike Fiers of the Milwaukee Brewers.\nThe aftermath left Stanton prone to swings and misses on outside breaking pitches. But lately his timing has been excellent, and he began the week batting .281 with the lowest strikeout rate of his career.\nHe credits a new closed stance.\n\"I'm not pulling off the ball, and I've been more on time and ready to go on off-speed pitches, heaters, everything,\" he said. \"I watched film over and over until my eyes hurt to figure it out.\n\"Every year I've had seven or eight different stances, and it's really because I haven't felt comfortable throughout a whole season to keep one. So it's a constant grind — how do I feel right every day? This was one I hadn't tried yet, and it has been pretty good.\"\nPretty good? The stance often leads to a home run trot accompanied by a grin. On Sunday, Stanton even threw in a quick dance step rounding third base.\n\"I think he likes hitting homers,\" Mattingly said with a chuckle. \"He smiles a lot when he's hitting homers.\"\nStanton said he's having more fun than at any time in his career, even with his team out of the playoff race as usual. This will be the 14th consecutive season the Marlins have missed the postseason, and given their injury-ravaged pitching staff, Stanton harbors no illusions of a miracle run.\n\"We've got arms going down like flies,\" he said.\nMarlins fans are counting on Jeter to change the team's fortunes. Stanton? He's already tired of questions about the new ownership, and about his future.\nTeam management expects to close on the $1.2 billion sale in early October, so it may be awhile before Jeter can provide any answers.\n\"It still has months to process,\" Stanton said with a sigh. \"So we'll just wait it out.\"\nHe knows he'll be making $25 million next year somewhere.\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "He always hit 'em far; now Stanton is hitting 'em fast",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/hit-em-now-stanton-hitting-em-fast-49211227"
}