{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 06:44:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Asian stocks rise after Koreas, US make diplomatic overtures",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fasian-stocks-rise-koreas-us-make-diplomatic-overtures-49221318.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/asian-stocks-rise-koreas-us-make-diplomatic-overtures-49221318",
    "language": "en",
    "localpath": null,
    "maintext": "Asian shares rose Tuesday as both Koreas and the U.S. appeared to indicate a willingness to defuse the crisis over North Korea's nuclear program. A rally on Wall Street, on the back of strong technology shares, also helped.\nKEEPING SCORE: Japan's benchmark Nikkei 225 gained 1.3 percent to 19,789.13 in morning trading. Australia's S&P/ASX 200 added 0.5 percent to 5,757.50. South Korea's markets were closed for a national holiday. Hong Kong's Hang Seng added 0.2 percent to 27,308.04, while the Shanghai Composite was up 0.2 percent at 3,242.26.\nNORTH KOREA: North Korea said Tuesday leader Kim Jong Un was briefed on his military's plans to launch missiles into waters near Guam. But the comments also appeared to signal a path to defuse the deepening crisis with Washington, holding out the possibility that friction could ease if the U.S. made some gesture that Pyongyang considered a move to back away from previous \"extremely dangerous reckless actions.\"\nWALL STREET: The S&P 500 jumped 24.52 points, or 1 percent, to 2,465.84. The Dow Jones industrial average gained 135.39 points, or 0.6 percent, to 21,993.71. The Nasdaq composite added 83.68 points, or 1.3 percent, to 6,340.23.\nTHE QUOTE: \"The markets continue to recover from last week's disorder as U.S. equities orchestrated a splendid showing recouping some of the sharp losses from last Friday, as investor confidence returns with the de-escalation of North Korea tension,\" says Stephen Innes, head of trading for Asia at OANDA.\nENERGY: U.S. crude oil added 2 cents to $47.61 a barrel. It lost $1.23 to $47.59 a barrel in New York Monday. Brent crude, the international standard, rose 4 cents to $50.77 a barrel in London.\nCURRENCIES: The dollar rose to 110.40 yen from 109.57 yen late Monday in Asia. The euro fell to $1.1756 from $1.1816.\n———\nThis story has been corrected to say South Korean markets were closed Tuesday.\n———\nYuri Kageyama on Twitter at https://twitter.com/yurikageyama\nHer work can be found at https://www.apnews.com/search/yuri%20kageyama",
    "source_domain": "abcnews.go.com",
    "title": "Asian stocks rise after Koreas, US make diplomatic overtures",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/asian-stocks-rise-koreas-us-make-diplomatic-overtures-49221318"
}