{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 14:07:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Israel: No talks with Palestinian inmates on hunger strike",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpalestinian-prisoners-hunger-strike-leader-solitary-46856235.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_13737f89e6e5483dbe875635127242d8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Israel will not negotiate with hundreds of Palestinian prisoners who launched a hunger strike to press for better conditions, a government minister said Tuesday, adding that the organizer of the protest has been placed in solitary confinement.\nIf sustained, the strike led by Marwan Barghouti, a Palestinian leader jailed during the second Palestinian uprising, would be the largest in recent years.\nIt could heighten Israeli-Palestinian tensions at a time of renewed U.S. attempts to restart stalled peace negotiations. Israeli rule over the West Bank and east Jerusalem, territories captured during the 1967 war and claimed by the Palestinians as part of a future state, reaches the half-century mark in June.\nThe Palestinian prisoners seek better conditions, including more contact with relatives, and an end to Israel's practice of detentions without trials.\nIsraeli officials said some 1,100 prisoners joined the strike Monday.\nPalestinian officials and activists put the number of hunger strikers at 1,300 and 1,500, respectively, saying it is difficult to get updates from inside the prisons.\nThey said some 6,500 Palestinians are currently in Israeli lockups. Israel calls them security prisoners — held for offenses ranging from stone throwing and membership in outlawed groups to carrying out attacks that killed or wounded Israelis. Several hundred are being detained without charges.\nBarghouti, the strike leader, is a prominent figure in the Fatah movement of Western-backed Palestinian President Mahmoud Abbas. Polls suggest that Barghouti, 58, is the most popular choice among Palestinians to succeed the 82-year-old Abbas.\nBarghouti, a leader of the 2000 Palestinian uprising, is serving five life terms after being convicted by an Israeli court of directing two shooting attacks and a bombing that killed five people, including three Israelis. Barghouti, who disputed the court's jurisdiction and didn't mount a defense, has been in prison since 2002.\nIn an opinion piece published this week in The New York Times, Barghouti alleged that Palestinian prisoners and detainees in Israel \"have suffered from torture, inhumane and degrading treatment, and medical negligence.\" He said he organized the hunger strike to fight back, after exhausting all other options.\nIsraeli Minister of Public Security Gilad Erdan said Tuesday that he believes the strike is politically motivated and that the prisoners have no legitimate complaints.\n\"These are terrorists and incarcerated murderers who are getting exactly what the international law requires,\" he told Israel's Army Radio. \"My policy is that you can't negotiate with prisoners such as these... There is no reason to give them additional conditions in addition to what they already receive.\"\nHe said Israel has established field hospitals outside the prisons to respond to any immediate medical needs.\nErdan said Barghouti was transferred to another prison in northern Israel and was placed in solitary confinement.\n\"It doesn't have to do with publishing the article (in the New York Times) but rather that he is instigating mutiny and leading the hunger strike and that is a severe violation of the rules of the prison,\" he said.\nIssa Qarakeh, a Palestinian government official dealing with prisoners, said most of those who joined the hunger strike were Fatah supporters. He said about 170 prisoners from Fatah rivals Hamas and Islamic Jihad also participated.",
    "source_domain": "abcnews.go.com",
    "title": "Israel: No talks with Palestinian inmates on hunger strike",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/palestinian-prisoners-hunger-strike-leader-solitary-46856235"
}