{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:51:01+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Man Wounded in Istanbul Attack Played Dead",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Freport-delaware-man-wounded-istanbul-attack-played-dead-44510755.json",
    "image_url": "http://a.abcnews.com/images/US/HT-jacob-raak-jef-170102_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Delaware man wounded in an attack at a New Year's Eve celebration in Istanbul says he survived the attack by playing dead.\nWilliam Jacob Raak told NBC News he survived the attack by playing dead and staying silent and motionless, even after being shot.\n\"When he shot me I didn't move — I just let him shoot me,\" he told NBC. \"I was shot when I was already on the ground. He was shooting people that he had already shot.\"\nRaak, 35, is a small business owner from Greenville. The State Department said Monday that Raak was the only U.S. citizen injured in the attack, which occurred at a popular nightclub in Turkey's largest city.\nWCAU-TV ( http://bit.ly/2i0RQ8g ) reports that Raak called his brother, Michael, around 7:30 p.m. EST on New Year's Eve to say he'd been shot in the leg. Michael Raak told NBC10 his brother was visiting friends in Istanbul.\nIstanbul Gov. Vasip Sahin has said the attacker, armed with a long-barreled weapon, killed a policeman and a civilian outside the Reina club before entering and firing at people partying inside. At least 39 people, mostly foreigners, were killed.\nThe Islamic State group on Monday claimed responsibility for the attack. Turkish police meanwhile detained eight people in connection to the attack but were still hunting for the gunman who disappeared amid the chaos of the attack.",
    "source_domain": "abcnews.go.com",
    "title": "Man Wounded in Istanbul Attack Played Dead",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/report-delaware-man-wounded-istanbul-attack-played-dead-44510755"
}