{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:22:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The U.S. attorney general tells \"GMA\" the latest on the civil rights investigation and responds to criticisms against President Trump for not condemning white supremacists in his remarks after the deadly protests.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fjeff-sessions-speaks-doj-investigation-charlottesville-attack-49201717.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_sessions_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Jeff Sessions speaks out on DOJ investigation into Charlottesville attack\nJoining us is attorney general Jeff sessions. Mr. Attorney general, thanks for being here this morning. Thank you. We did learn overnight that the vice president has now condemned the violence in charlottesville saying we have no tolerance for hate and violence from white supremacists, neo-nazis or the kkk. These dangerous fringe group, he says, has no place in America. When will we hear president trump actually single out those groups by name? He said that yesterday, his spokesman did and his initial statement on this roundly and unequivocally condemned hatred and violence and bigotry. He called on our people to work together and in community and in love and affection and not in hatred and violence. I'm sure he'll talk again, maybe today, on this very subject. He cares about it deeply. He as his attorney general, I understand exactly what I'm expected to do. It's what I will do and that is to vindicate the rule of law. You did say that the president did speak out over the weekend but he did not single out these groups by name. It was an unnamed white house official who said that. I do want to ask you, part of his reaction was that there was hatred on many sides. On many sides he added a second time. There was immediate reaction from those puzzled. This was a white nationalist rally. What sides was he talking about here? Racism, white supremacy is totally unacceptable. I think the president talked about the problems in America in that first statement had been going on a long time. He said before Donald Trump before Barack Obama, a long time. I think that's the kind of thing he was referring to. But he was talking to the -- but he was -- He was unequivocal -- He was talking to the nation about a white nationalist rally. He was talking to the nation about a white nationalist rally and in dog so he talked about the hatred on many sides. He explicitly condemned the kind of ideology behind these movements of naziism, white supremacy, the kkk, that is his unequivocal position. He totally opposes those kind of values and his statement yesterday again affirmed that and I think you'll hear that again today. As you know, attorney general, it's not just reporters like me, there are a growing number of Republicans that says the president needs to be doing more, Marco Rubio, orrin hatch, do you agree this was domestic terror? It does meet the definition of it in our statute. We are pursuing it when the department of just cyst in every way that we can make a case. You can be sure we will charge and advance the investigation toward the most serious charges that can be brought because this is an unequivocally unacceptable and evil attack that cannot be accepted in America. So absolutely that is a factor that we'll be looking at. You have said the president will speak out again on this and there was senator Cory Gardner of Colorado who said this -- Call this white supremeicism, this white nationalism evil and let the country hear it, let the world hear it. It's something that needs to come from the oval office and this white house needs to do it today. A Republican senator from Colorado. Is that coming now from the president? Well, the president, I suspect, will be talking to the country again soon. Maybe today. I plan to meet with him today and the FBI today will be meeting with him to brief him on the case. He takes it exceedingly seriously and there's no doubt about it. He opposes these kind of radical racist bigotry that these organizations espouse. You talk about this as an opportunity to come together on this front. This is a president as you know who is known for his blunt talk. For a week now we've been reporting on the war of words with North Korea. Many Americans could likely quote that line, his warning of fire and fury. He was so clear on North Korea and even as a candidate he said this -- To solve a problem you have to be able to state what the problem is or at least say the name. Will he say the name of these groups? Well, he will say what he believes is appropriate. I think he probably will. His spokesman already said that yesterday. I fully expect him to say it again. The initial statement he gave was within just a few hours of the event occurring and I believe it was very strong and a clear condemnation of racial bigotry and hatred and white supremacy was certainly included in bigotry and hatred so I think the president will be there. He is a strong leader. He's an outspoken leader. He expresses himself in clear and blunt terms and the American people elected him. I think that was one of the things they liked about him. And I think he'll be honest and direct with the American people as soon as he talks to them again. We are. We are thinking about those two families of the state trooper and that mother of that young woman who was killed this morning. Mr. Attorney general, thank you for being here. Thank you, David. Cannot forget those family was are in mourning here this morning. But, again, you said it and even Jeff sessions said it. The president has always been very clear and very blunt. He has not been to this point and it's just inexcusable to many he hasn't. The question is if and when.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Jeff Sessions speaks out on DOJ investigation into Charlottesville attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/jeff-sessions-speaks-doj-investigation-charlottesville-attack-49201717"
}