{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:52:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "The Latest: Hawaii bill on commercial fishing advances",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-hawaii-bill-commercial-fishing-advances-45495001.json",
    "image_url": "http://abcnews.go.com/International/wireStory/latest-hawaii-bill-commercial-fishing-advances-45495001",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on a bill to increase oversight over the Hawaii fishing industry (all times local):\n12:20 p.m.\nA Hawaii committee has advanced a bill that seeks to provide more oversight of the commercial fishing industry after an Associated Press investigation found hundreds of foreign fishermen confined to boats and some living in subpar conditions.\nThe proposal advanced Tuesday would require fishing boat owners who want a commercial license to provide a copy of employment contracts with every fisherman on board before the state grants a license.\nRep. Kaniela Ing says that without access to employment contracts, there's no way to check whether fishermen are getting what they were promised, even if what they agreed to is horrendous.\nJim Cook of the Hawaii Longline Association says people agree to unfair contracts every day. He questions whether it's the state's responsibility to interfere in business between an individual and a company.\n———\n9 a.m.\nHawaii lawmakers are calling for more oversight of the commercial fishing industry after an Associated Press investigation found hundreds of foreign fishermen confined to boats and some living in subpar conditions.\nA bill would require fishing boat owners who want a commercial license to provide to the state a copy of the employment contracts with every fisherman before the license is granted.\nThe fishing industry is pushing back, saying it's already highly regulated by the federal government. The industry also initiated a universal contract to be signed by crew members and boat owners.\nRep. Kaniela Ing says the universal contract and the idea of the industry policing itself are not enough.\nIng's bill is being heard in the House Committee on Ocean, Marine Resources and Hawaiian Affairs on Tuesday.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Hawaii bill on commercial fishing advances",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-hawaii-bill-commercial-fishing-advances-45495001"
}