{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 13:54:49+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "The president-elect says he will reveal more details on allegations that Russians hacked into computer systems of U.S. political entities.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Ftrump-continues-question-us-intelligence-russian-hacking-44509611.json",
    "image_url": "http://a.abcnews.com/images/GMA/170102_gma_bruce4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump Continues to Question U.S. Intelligence on Russian Hacking\nWe move now to the latest in the trump transition. Less than three weeks from inauguration, the president-elect is promising to release new information on the election hacking that U.S. Intelligence pins on Russia. Trump continues to question the findings saying he knows things others don't. Mary Bruce is at the white house with the story. Good morning, Mary. Reporter: Good morning, George. After ringing in the new year at his annual Florida bash the president-elect is back home in New York where he's expected to receive a briefing from intelligence officials on the Russian hacking. Trump is still skeptical and this morning that cliffhanger, trump now promising there's more to come. A new year, a new pushback from Donald Trump. I know a lot about hacking and hacking is a very hard thing to prove so it could be somebody else. Reporter: The president-elect still doubting U.S. Intelligence and questioning if Russia interfered in the U.S. Election. I want them to be sure. I think it's unfair if they don't know. Reporter: 17 U.S. Intelligence agencies concluded Russia was behind the hacking, but trump suggests there's more to the story. I also know things that other people don't know, and so they cannot be sure of the situation. What do you know that other people don't know? You'll find out on Tuesday or Wednesday. Reporter: But on this week, the top Democrat on the house intelligence committee told our Jonathan Karl the evidence is iron clad. It's very solid, indeed overwhelming. If he's going to have any credibility as president, he needs to stop talking this way. Reporter: President Obama has already counter punched, closing two lavish Russian diplomatic retreats in the U.S. And evicting dozens of Russian diplomats and their families. Almost 100 people in all. Overnight their plane touching down in Moscow. Trump has said it's time to move on. I think we ought to get on with our lives. Reporter: But now his team is questioning the white house's motivation and asking if the punishment fits the crime. There is a question about whether there's a political retribution here, whether it's -- versus a diplomatic response. Reporter: Even some Republicans say it wasn't tough enough. We will be working for much tougher sanctions against Russia. They attacked the United States of America. Reporter: But trump says there's only one way for sure to protect from cyber attacks. Write it out and have it delivered by courier, the old-fashioned way, because I'll tell you what, no computer is safe. Reporter: And now there are new concerns that the Russians may have also been targeting the American electrical system, a code linked to the Russians was found on a laptop associated with a Vermont utility. But there are no signs that the hackers penetrated the power grid itself. George?\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump Continues to Question U.S. Intelligence on Russian Hacking",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/trump-continues-question-us-intelligence-russian-hacking-44509611"
}