{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 09:29:12+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmoscow-awaits-russian-diplomats-ordered-leave-britain-53868131.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_177444cad0134619b4631267f8225a25_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Moscow is awaiting nearly two dozen Russian diplomats ordered to leave Britain as part of a standoff over a nerve agent attack on British soil.\nThe 23 diplomats are expected to leave British territory Tuesday, the Russian Foreign Ministry told The Associated Press.\nThe diplomats were given a week to leave Britain, an order which prompted Russia to retaliate with its own expulsion of 23 British diplomats. The British diplomats are expected to leave Moscow in the coming days.\nTensions between the two countries have ratcheted higher since the March 4 poisoning of ex-Russian spy Sergei Skripal and his daughter Yulia in the British city of Salisbury. They remain in critical condition.\nRussia denies involvement, but Western powers see it as a sign of increasingly aggressive Russian meddling abroad.\nBritain's National Security Council is meeting Tuesday to consider possible further measures.\nBritish Prime Minister Theresa May and other European Union leaders are due to discuss the poisoning at a summit Thursday. The EU on Monday condemned the poisoning and called on Russia to \"address urgently\" British questions over the Novichok nerve agent program.\nThe Russian Foreign Ministry called Britain's accusations \"speculative and baseless.\"\nIn a statement, it accused Britain and other EU member states of continuing development of similar nerve agents and said Britain's government is stirring up \"media hysteria\" around the case to distract Britons from the government's troubles in negotiating the country's exit from the EU.\nRussia insists it gave up all its chemical weapons under international oversight.\nThe British military and police are continuing to search for clues around Salisbury into what happened. International chemical weapons experts are due to take samples of the nerve agent used, which Britain says is the Soviet-developed Novichok.\nBritish police investigators say it may take \"months\" to complete the widening inquiry. The focus is on the movement of the Skripals in the hours before they were found unconscious.",
    "source_domain": "abcnews.go.com",
    "title": "Moscow awaits Russian diplomats ordered to leave Britain",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/moscow-awaits-russian-diplomats-ordered-leave-britain-53868131"
}