{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 22:44:35+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Flatest-mississippi-governor-lauds-abortion-restrictions-53859848.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/latest-mississippi-governor-lauds-abortion-restrictions-53859848",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on a Mississippi law banning most abortions after 15 weeks (all times local):\n5 p.m.\nOpponents of a new Mississippi law banning most abortions after 15 weeks of gestation have filed a lawsuit.\nThe state's only abortion clinic and one of the physicians who practices there filed the federal suit Monday in Jackson, an hour after Gov. Phil Bryant signed the measure into law.\nIn a lawsuit handled by the Center of Reproductive Rights, the Jackson Women's Health Organization says the measure is unconstitutional and should immediately be struck down.\nThe suit says the clinic performed 78 abortions in 2017 when the fetus was identified as being 15 weeks or older. That's out of about 2,500 abortions performed statewide, mostly at the clinic.\nThe lawsuit challenges House Bill 1510, saying federal courts have ruled women have the right to an abortion before a fetus can live on its own outside the womb. The Mississippi measure is specifically designed to challenge those rulings, trying to get courts to rule states can restrict abortion before viability.\n4:30 p.m.\nMississippi's governor says that by enacting a law that bans most abortions after 15 weeks of gestation, the state is \"saving more of the unborn than any state in America, and what better thing can we do?\"\nRepublican Gov. Phil Bryant made the comments while he signed the law Monday in a closed ceremony, according to a video his office posted to social media.\nHouse Speaker Philip Gunn was present for Bryant's signing. He told The Associated Press he is proud Mississippi is taking steps to protect \"the most vulnerable of human life:\" the unborn. House Bill 1510 became law immediately upon Bryant's signature.\nLt. Gov. Tate Reeves said in an emailed statement that the law is a major step toward accomplishing Mississippi's goal to protect the lives of the unborn. Echoing a phrase Bryant often uses, Reeves added that he is committed to making the state \"the safest place in America for an unborn child.\"\n3:50 p.m.\nMississippi's governor has signed the nation's tightest abortion restrictions into law.\nRepublican Gov. Phil Bryant signed House Bill 1510 on Monday afternoon. It becomes law immediately and bans most abortions after 15 weeks of gestation. Bryant has frequently said he wants Mississippi to be the \"safest place in America for an unborn child.\"\nThe law's only exceptions are if a fetus has health problems making it \"incompatible with life\" outside of the womb at full term, or if a pregnant woman's life or a \"major bodily function\" is threatened by pregnancy. Pregnancies resulting from rape and incest aren't exempted.\nAbortion rights advocates are calling the law unconstitutional because it limits abortion before fetuses can live outside the womb. The owner of Mississippi's only abortion clinic opposes the law and has pledged to sue.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Mississippi abortion clinic sues to stop law",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/latest-mississippi-governor-lauds-abortion-restrictions-53859848"
}