{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 21:17:56+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Russell Westbrook, Paul George work out together in LA",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Frussell-westbrook-paul-george-work-la%2Fstory%3Fid%3D49214592.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0813/dm_170813_MLB_Coley_Harvey_on_Harpers_injury/dm_170813_MLB_Coley_Harvey_on_Harpers_injury_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Russell Westbrook and Paul George are beginning the process of building chemistry on the court as the new duo had their first workout as Oklahoma City Thunder teammates on Monday in Los Angeles, sources told ESPN.com.\nAt a gym on campus at UCLA, George and Westbrook went through drills and conditioning together, along with a few Thunder players, including Jerami Grant, Kyle Singler, Semaj Christon and Doug McDermott.\nThis was the second workout this summer organized by Westbrook, though George was unable to attend the first, as he was in Europe on a pre-planned vacation.\nBefore becoming teammates with a blockbuster trade hours before free agency opened, George and Westbrook were said to be only casual acquaintances primarily as opponents and teammates for USA Basketball. After the trade, Westbrook and George spoke on the phone the night it happened, then spent time together in person for a few hours the day before George was officially introduced in Oklahoma City.\nMost of the front office and coaching staff was in Los Angeles on Sunday, including general manager Sam Presti and coach Billy Donovan, for George's celebrity fishing tournament. Westbrook was also at the event showing support for his new teammate.",
    "source_domain": "abcnews.go.com",
    "title": "Russell Westbrook, Paul George work out together in LA",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/russell-westbrook-paul-george-work-la/story?id=49214592"
}