{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:15:06+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Johnson Knee Injury Not Serious, No Surgery Required",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjohnson-knee-injury-surgery-required-44514589.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/johnson-knee-injury-surgery-required-44514589",
    "language": "en",
    "localpath": null,
    "maintext": "In what coach Bruce Arians called \"great news,\" Arizona Cardinals running back David Johnson's knee injury is not serious and will not require surgery.\nAn MRI showed Johnson has a left MCL sprain that would require six to eight weeks of rest and rehabilitation.\nJohnson, speaking to reporters on Monday, said he knew a few moments after the injury Sunday in Los Angeles that it wasn't serious.\n\"It felt strong even in walking,\" he said. \"I think I was just scared at first, the initial contact. But after I calmed down a little bit, got in the locker room, I was fine.\"\nJohnson was taken to the locker room on a cart and returned to watch the game in street clothes from the sideline, his left knee in a brace.\nJohnson said he has seen the gruesome video of the injury, where in a crowd of tacklers his lower leg was stepped on, causing his knee to bend in an unnatural direction.\n\"After seeing that video, with everything that happened, I'm definitely blessed with the result,\" he said.\nOnce Monday's MRI confirmed what he suspected, he said he felt \"tremendous relief that there's no significant injury.\"\nThe injury will cause him to miss what would have been his first Pro Bowl, but that means the second year running back will not have to worry about rushing home for the birth of his first child, which is due at the same time.\nThe injury ended his NFL record string of at least 100 yards from scrimmage in each of the first 15 games of a season. He also fell short in his bid to be the third player to have 1,000 yards rushing and 1,000 yards receiving in the same season. Johnson ended up with 1,239 yards rushing and 879 receiving.\nEven though he was injured in the first quarter of Sunday's 44-6 victory over the Rams, Johnson already had caught three passes for 38 yards and thought he would have had a good chance to reach the 1,000 mark if he had played the entire game.\nJohnson led the NFL in yards from scrimmage with 2,118 (1,230 rushing, 879 receiving) and touchdowns (21). He led all running backs with 80 receptions and was second in rushing touchdowns with 16, two fewer than New England's LeGarrette Blount.\nJohnson's string of 15 100 yards from scrimmage games to start the season broke the record of 13 set by Edgerrin James in 2005. His 15 consecutive games with 100 yards from scrimmage tied the NFL mark set by Barry Sanders in 1997.\nJohnson is the seventh player in NFL history to lead the league in yards from scrimmage and touchdowns.\n\"I feel like I've grown a lot, even from each game,\" the 2015 third-round draft pick out of Northern Iowa said \"Game by game, play by play, I feel like I was growing and learning and getting better, getting more comfortable with our offense and the NFL.\"\nHe blamed himself for not reaching the 1,000-yard receiving mark.\n\"Mental errors killed me some of the games,\" Johnson said. \"I probably would have had a thousand yards receiving if not some of those routes early in the season that I messed up on.\"\n———\nFor more NFL coverage: www.pro32.ap.org and http://twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Johnson Knee Injury Not Serious, No Surgery Required",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/johnson-knee-injury-surgery-required-44514589"
}