{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 03:33:38+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fstanford-reaches-11th-straight-sweet-16-beats-fgcu-53865006.json",
    "image_url": "https://s.abcnews.com/images/Sports/WireAP_d66540e49c5541f49bc7a3d104e98ee8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Alanna Smith scored 28 points with four 3-pointers, Brittany McPhee added 17 points and nine rebounds and No. 4 seed Stanford is headed back to the Lexington Regional for a third straight March after beating scrappy 12th-seeded Florida Gulf Coast 90-70 on Monday night.\nFreshman Kiana Williams shined on the big stage for the second time in three days with 12 points and six assists for the Cardinal (24-10), on to the Sweet 16 for the 11th straight season.\nFlorida Gulf Coast (31-5) set the single-season 3-point record with 431, breaking Sacramento State's mark of 424 from 2014-15, but didn't have the depth or talent to keep up against a taller Stanford team that made it hard for the Eagles to do their signature move: drive and dish.\nStanford will take on No. 1 Louisville — the first matchup between the power programs — on Friday in the regional semifinals. Playing previously in Lexington, the Cardinal lost to Washington in the 2016 Elite Eight then advanced to the Final Four from that regional last season.\nChina Dow found her shooting touch following intermission and hit the tying and breaking 3s in the third quarter as FGCU set the 3-point mark after the Eagles made nine in the first half.\nDow finished with 23 points all in the second half and six 3-pointers as the Eagles ran up their remarkable 3-point total for the season.\nYet do-everything Dow didn't have the kind of steady game she produced in a first-round win against fifth-seeded Missouri. She missed her first five field-goal tries, and four 3s, before she connected from deep with 7:39 left in the third for her first points of the night. She hit again from 3 at the 6:16 mark of the third for the single-season record.\nThe Eagles, without a single 6-footer on the roster, won 11 of their final 12 games and 21 of 23.\nStanford shot 12 for 17 in the first quarter to take a 33-17 lead but went 3 of 11 for only 10 points in the second as their halftime lead was cut to 43-35.\nBIG PICTURE\nFlorida Gulf Coast: FGCU scored its first 12 points all on 3s. ... The Eagles, with their RainingThrees hashtag, finished another special season. They were in the NCAA Tournament for the fifth time in seven years with Division I postseason eligibility and won an NCAA game for the first time since beating Oklahoma State in 2015.\nStanford: The Cardinal are 36-4 in NCAA games at home in Maples Pavilion. ... Hall of Fame coach Tara VanDerveer and her team defeated FGCU as the Hall of Fame coach won her milestone 900th career game at Puerto Vallarta, Mexico, in November 2013.\nA SPECIAL RING\nThis NCAA tournament is especially memorable for Val Whiting, who played on the only two Stanford national champion teams in 1990 and '92.\nIn late January, Whiting received her '90 championship ring back from a complete stranger — Julie Mayer Pedilini in Pennsylvania — after it had been lost for 20 years.\n\"Fab Four has been restored,\" Whiting posted on Twitter with a photo of her rings. \"I not only found a lost treasure but now have a new friend.\"\nPedelini was searching through her late father-in-law's things when she found the ring, which had a basketball and Whiting's initials. A quick Google search produced Whiting's linked in page, with a photo of the identical 1992 ring. So, Pedelini reached out and Whiting soon responded.\n\"Sometimes things happen for reasons we don't know,\" Pedilini said in a Facebook post about her discovery at her mother-in-law's home in Delaware, where Whiting had once lived. \"It is kind of nice when those are nice things.\"\nWhiting and her ex-husband had once been in a near-fatal car accident and she believes the ring might have been in that car and later found.\nOnly recently did Whiting get back her '92 ring she had loaned to Villanova's Adrianna Hahn \"as inspiration.\"\n\"She was entering her freshman year and I said, 'take it as something to aspire to,'\" Whiting recalled in an email to The AP.\n\"I'm very grateful to have all my rings now and yes,\" Whiting said, \"March Madness hammers that feeling home.\"\n———\nMore AP college basketball: https://collegebasketball.ap.orghttps://twitter.com/AP—Top25 and https://www.podcastone.com/ap-sports-special-events",
    "source_domain": "abcnews.go.com",
    "title": "Stanford reaches 11th straight Sweet 16, beats FGCU",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/stanford-reaches-11th-straight-sweet-16-beats-fgcu-53865006"
}