{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 08:07:47+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "ICYMI in NFL Week 17: Rodgers, Pack Soar; Cousins, Skins Out",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ficymi-nfl-week-17-rodgers-pack-soar-cousins-44507956.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/icymi-nfl-week-17-rodgers-pack-soar-cousins-44507956",
    "language": "en",
    "localpath": null,
    "maintext": "There they were on a late November afternoon, seemingly headed in opposite directions: Aaron Rodgers and the Green Bay Packers were 4-6 and losers of four games in a row; Kirk Cousins and the Washington Redskins were 6-3-1 and winners of six of eight.\nRight after the Packers were beaten by the Redskins by 18 points in Week 11, Rodgers insisted, bereft of much supporting evidence, \"I'm very optimistic.\"\nTurned out he knew what he was talking about.\nAnd Cousins declared, \"It's great to be playing the way we're playing.\"\nTurned out it didn't last.\nSince then? The Packers (10-6) reeled off six consecutive victories, with Rodgers throwing 15 TD passes and zero interceptions, capped by a 31-24 win at the Detroit Lions on Sunday night to win the NFC North. The Redskins (8-7-1) lost four of their last six games, capped by an inexplicably listless 19-10 defeat against the visiting, nothing-at-stake-for-them New York Giants to blow a playoff berth.\n\"Just have to find a way to get it done. That's what good teams do,\" Washington defensive end Chris Baker said in a quiet locker room. \"We just weren't good enough this year.\"\nWith so much at stake, the Redskins were flat as can be against the Giants, who already were locked into the NFC's No. 5 seed. Washington looked like the team with nothing to play for, trailing 10-0 at halftime. After tying it at 10-all, then falling behind 13-10, the Redskins let their last real chance slip away when Cousins was intercepted by Dominique Rodgers-Cromartie for the second time.\n\"I'm going to go into this offseason with a hunger that has always been there,\" Cousins vowed after throwing two picks against New York, \"but certainly, when the season ends this way, it will be there and it will be strong.\"\nThe playoffs begin next weekend without the Redskins:\n— Saturday: Raiders at Texans, Lions at Seahawks.\n— Sunday: Dolphins at Steelers, Giants at Packers.\nAwaiting the winners of those games will be the top seeds: No. 1 Patriots and No. 2 Chiefs in the AFC, No. 1 Cowboys and No. 2 Falcons in the NFC.\nIn case you missed it, here are the other top topics after the NFL season's last regular-season Sunday:\nMVP?\nRodgers could wind up as the MVP, as could Cowboys running back Ezekiel Elliott or Falcons QB Matt Ryan. But given that the main story line heading into the season involved Tom Brady's four-game \"Deflategate\" suspension, it somehow would be fitting for him to wind up with the honor. He finished off the best TD-INT rate for a season in NFL history — 28-2 — as the Patriots (14-2) beat Miami 35-14 . Plus, Brady tied Peyton Manning's career record of 51 games with three or more touchdown passes and zero interceptions.\nSEE YA\nMore coaches on the way out: Chip Kelly (San Francisco) and Mike McCoy (San Diego) were fired, while Gary Kubiak resigned because of health concerns one year after leading Denver to a Super Bowl championship. Adds those openings to earlier exits of Jeff Fisher in Los Angeles, Gus Bradley in Jacksonville, and Rex Ryan in Buffalo.\nROMO RETURNS\nPlaying in the regular season for the first time in more than a year, Tony Romo threw a TD pass in limited duty in place of the man who replaced him as Dallas' QB, Dak Prescott. The Cowboys lost 27-13 to the Eagles in a completely meaningless game, while Romo got a brief chance to show he could help in the postseason if needed.\nQB TROUBLE\nCould be quite a quarterback matchup when Oakland plays at Houston in the playoffs. That's because the Raiders, already without Derek Carr because of a broken leg, saw backup Matt McGloin hurt his shoulder injury in Sunday's 24-6 loss at the Broncos, leaving rookie Connor Cook — he of zero NFL starts — under center. And the Texans, who recently benched expensive free agent Brock Osweiler for Tom Savage, aren't sure which will play next week. Savage started Houston's 24-17 loss at Tennessee, left to be evaluated for a concussion after a QB sneak, returned after being cleared, then was held out again in the second half.\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL\n———\nFollow Howard Fendrich on Twitter: http://twitter.com/HowardFendrich",
    "source_domain": "abcnews.go.com",
    "title": "ICYMI in NFL Week 17: Rodgers, Pack Soar; Cousins, Skins Out",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/icymi-nfl-week-17-rodgers-pack-soar-cousins-44507956"
}