{
    "authors": [
        "Abc News",
        "More Enjoli"
    ],
    "date_download": "2017-06-14 23:56:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Rep. Chuck Fleischmann spoke to ABC News anchor David Muir about the shooting at a GOP congressional baseball team practice in Virginia.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Flawmaker-injured-congressional-baseball-practice-shooting-hell-play%2Fstory%3Fid%3D48044762.json",
    "image_url": "http://a.abcnews.com/images/Politics/ABC-muir-fleischmann-jef-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Despite sustaining an injury at this morning’s shooting at a GOP congressional baseball team practice in northern Virginia, Rep. Chuck Fleischmann told ABC News that he would be joining his fellow lawmakers to play in Thursday's annual charity game.\n\"We're all Americans. We all love this country and I hope that out of this tragedy, we can actually bring together some unity, some common ground,\" the Tennessee Republican told ABC News anchor David Muir.\nFive people, including the gunman, who was killed, and House Majority Whip Steve Scalise of Louisiana, were shot in today's incident. The lawmakers were practicing in Alexandria's Del Ray neighborhood in Virginia. Fleischmann injured his right hand as he desperately tried to avoid being shot.\nHow the harrowing shooting at a GOP congressional baseball practice in Virginia unfolded\nGOP senator recalls 'burst of gunfire' at Virginia baseball field: 'People were dropping'\nFleischmann told the \"World News Tonight\" anchor that he was preparing to leave the baseball field after practice today, when he heard \"one, single, loud pop.\"\n\"I didn't realize at first it was a gunshot,\" he said. \"Very shortly thereafter there was a barrage of shots. It was, it was sickening. It was saddening. And there were a lot of shots -- easily 30 to 50, maybe more.\"\nFleischmann said he immediately got on the ground and ended up in the dugout. That's where he and others were hurt as everyone dove into the dugout to avoid the gunfire.\nHe told Muir that he later found out that the suspect, identified by authorities later today as James T. Hodgkinson, 66, of Belleville, Illinois, had actually passed him at one point.\nAuthorities said police returned fire on Hodgkinson and he later died at a hospital from his injuries.\n\"I was very fortunate not to have been shot,\" Fleischmann said. \"The Capitol Police did a tremendous job. ... It's just a very, very sad day.\"",
    "source_domain": "abcnews.go.com",
    "title": "Lawmaker injured in congressional baseball practice shooting says he'll play in Thursday game",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/lawmaker-injured-congressional-baseball-practice-shooting-hell-play/story?id=48044762"
}