{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 20:16:14+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fback-door-ban-states-fight-trump-drill-plan-53857257.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_d0932163b91d4f6cb636525a95a0f0fa_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Some coastal states opposed to President Donald Trump's plan to allow oil and gas drilling off most of the nation's coastline are fighting back with proposed state laws designed to thwart the proposal.\nThe drilling Trump proposes would take place in federal waters offshore in an area called the Outer Continental Shelf. But states control the 3 miles of ocean closest to shore and are proposing laws designed to make it difficult, or impossible, to bring the oil or gas ashore in their areas.\nA look at the issue:\nWHAT STATES ARE DOING\nStates including New Jersey, New York, California, South Carolina and Rhode Island have introduced bills prohibiting any infrastructure related to offshore oil or gas production from being built in or crossing their state waters. Washington state is threatening such a bill. Maryland has introduced a bill imposing strict liability on anyone who causes a spill while engaged in offshore drilling or oil or gas extraction.\n\"We started thinking about how we control the first three miles of ocean, and there are state rights that we have,\" said New Jersey state Sen. Jeff Van Drew, a Democrat who represents the state's southern coast. \"Even if we don't succeed in banning it outright, we can still make it a lot more expensive to do it in this area. It's a back-door, ingenious way to block this.\"\nCalifornia Democratic state Sen. Hannah-Beth Jackson said a ban on pipelines and docks could force the industry to rely on ships that would then have to sail to the waters of a different state to bring their cargo ashore. \"What we can do is make drilling for offshore oil and gas so prohibitively expensive that it won't pencil out,\" she said.\nANY PRECEDENT?\nIn 1985, voters in Santa Cruz, California, required that any zoning changes to accommodate onshore facilities for offshore oil exploration or production must be approved by a vote of the electorate, one of 26 similar ordinances that were adopted in California. An oil and gas industry association unsuccessfully sued 13 of the communities, claiming they were interfering with lawful interstate commerce.\nOIL INDUSTRY, US RESPONSE\nAndy Radford, a senior policy adviser with the American Petroleum Institute, said it has been 30 years since the last detailed analysis of potential offshore oil and gas supplies. He said states ought to welcome offshore drilling for the revenue it can produce for them. Offshore energy production in the Atlantic Ocean alone could support 265,000 jobs and generate $22 billion a year within 20 years, he said.\n\"We should take that step forward to advance our energy future,\" he said. \"Local communities and workers benefit from energy exploration and production, in addition to these investments generating significant state revenues to fund schools, hospitals and other public services.\"\nConnie Gillette, a spokeswoman for the U.S. Bureau of Ocean Energy Management, said \"the laws, goals, and policies\" of a state adjacent to the Outer Continental Shelf are among the factors the federal government must consider in approving oil and gas leases.\nCONFLICTED IN SOUTH CAROLINA\nIn May 2017, eight months before Trump proposed the nearly nationwide expansion of offshore drilling, a South Carolina legislator introduced a bill to prohibit oil drilling infrastructure in state waters. The bill remains in committee.\nSouth Carolina's House and Senate both introduced a resolution expressing support for drilling off their state's coast and criticizing Republican Gov. Henry McMaster's request to be exempted from the plan, saying the request is \"tantamount to the state exercising excessive control of South Carolina's free market.\"\n———\nFollow Wayne Parry at http://twitter.com/WayneParryAC",
    "source_domain": "abcnews.go.com",
    "title": "Back-door ban: States fight Trump drill plan with local bans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/back-door-ban-states-fight-trump-drill-plan-53857257"
}