{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 04:31:46+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ftoronto-van-attack-suspect-felt-anger-women-54710029.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_655818b15f0e4befa45d9421f8c0e69f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A chilling Facebook message posted before a van plowed onto a crowded Toronto sidewalk has raised the possibility the suspect in the attack nursed grudges against women and it is bringing back memories of a 1989 massacre of 14 women that remains one of Canada's most traumatic acts of violence.\nA crowd gathered late Tuesday in Toronto's North York community to pay their respects to the van victims at a makeshift memorial of roses, candles and messages of condolence.\n\"I needed to come here to show that I'm not afraid of this city,\" said Meena Chowdry, wiping away tears. \"That one man's actions cannot taint an otherwise beautiful, welcoming city.\"\nEarlier in the day, the 25-year-old suspect, Alek Minassian, was charged with first degree murder in the deaths of 10 pedestrians mowed down by a rented van that he sent careening along a mile of a busy walkway. Fourteen others were injured.\nToronto Police Services Det. Sgt. Graham Gibson said at a news conference that those killed and injured were \"predominantly\" women, though he declined to discuss a possible motive.\n\"All the lanes are open with this investigation,\" said Police Chief Mark Saunders.\nAuthorities had yet to release a list of victims. Those known to have been killed include a 30-year-old woman from Toronto, Anne Marie D'Amico, who was active in volunteer work, as well as a female student at Seneca College, which Minassian attended. A Jordanian citizen and two South Koreans were also among those killed.\nThe gender issue arose because of what police called a \"cryptic\" Facebook message posted by Minassian just before the incident that suggested he was part of an online community angry over their inability to form relationships with women.\nThe now-deleted post saluted Elliot Rodger, a community college student who killed six people and wounded 13 in shooting and stabbing attacks near the University of California, Santa Barbara, in 2014.\nCalling Rodger \"the Supreme Gentleman,\" the Facebook post declared: \"The Incel Rebellion has already begun! We will overthrow all the Chads and Stacys!\"\nRodger had used the term \"incel\" — for involuntarily celibate — in online posts raging at women for rejecting him romantically. Like-minded people in internet forums sometimes use \"Chad\" and \"Stacy\" as dismissive slang for men and women with more robust sex lives.\nThe anti-women sentiment also recalled Canada's 1989 massacre at the Ecole Polytechnique, an engineering college in Montreal, when 25-year-old Marc Lepine entered a classroom, separated the men from the women, told the men to leave and opened fire, killing 14 women before killing himself. In a suicide note, he blamed feminists for ruining his life.\nSince then, there have been sporadic mass shootings in Canada, but none with a higher death toll — reinforcing the view among many Canadians that their country is less violent than the United States.\nWendy Cukier, a professor in the business school at Toronto's Ryerson University and president of Canada's Coalition for Gun Control, said Canada may avoid some types of violence because its social programs are stronger than those in many U.S. states and there is less income inequality. But the main difference, she contends, is tighter gun regulations in Canada.\n\"If you take guns out of the mix, Canada and the U.S. are identical,\" she said, citing statistics indicating the two countries have similar rates of non-firearm homicides.\nAlthough police said Monday's rampage did not appear linked to international terrorism, the use of a vehicle to kill mirrored tactics used by terrorists in France, Germany, Spain, New York City and elsewhere.\nSince 2014, there have been at least two terror-related cases in Canada of vehicles being used as weapons — they caused several injuries and one death. But overall, Canada has been spared high-casualty terror attacks.\nIts most striking incidents of violence over the past 50 years have varied widely in nature.\nIn 2014 a Canadian Muslim fatally shot a member of the honor guard at Ottawa's national war memorial, then stormed Parliament, where he was shot to death by a sergeant-at arms. Last year, a French-Canadian man fatally shot six Muslim men during evening prayers at a mosque in Quebec City. Back in 1972, 37 people died in a Montreal cafe deliberately set on fire by three men who had been refused entry.\nCanadian rapper Maestro Fresh Wes returned to the scene of the van rampage Tuesday, pausing by a newly erected memorial. Wes, who lives nearby, was strolling down Yonge Street to get a haircut when he saw a body bag on the ground.\n\"Yesterday was the most beautiful day of the year and then look what happened,\" he said. \"Toronto is a safe city but things could happen anywhere. When these things happen, you have to reflect.\"\nAlso revisiting the site was Saman Tabasinejad, a New Democrat Party politician who was canvassing in the area when the attack occurred.\n\"I saw shattered glass everywhere, a fire hydrant knocked over and then five body bags,\" she said. \"People were holding others and I saw solidarity all over, people trying to help others.\"\n\"When something like this happens, you think people are going to run away from the tragedy, but people didn't — they ran toward it to try to help others,\" she added. \"It shows that something like this could happen at the hands of one person, but so many more stand against it and show their humanity.\"\n———\nAssociated Press writer Charmaine Noronha reported this story in Toronto and AP writer David Crary reported from New York. AP writer Ben Fox in Miami contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Toronto van attack suspect may have felt anger against women",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/toronto-van-attack-suspect-felt-anger-women-54710029"
}