{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 23:12:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Business Highlights",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbusiness-highlights-49215061.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/business-highlights-49215061",
    "language": "en",
    "localpath": null,
    "maintext": "___\nTop Fed official tells AP: Bond portfolio could shrink soon\nNEW YORK (AP) — A top Federal Reserve official is suggesting that the Fed will likely announce next month that it will begin paring its bond portfolio — a step that could lead to slightly higher rates on mortgages and other long-term loans. In an interview with The Associated Press, William Dudley, president of the Federal Reserve Bank of New York, said he thinks the Fed has adequately prepared investors for a reduction in the portfolio, which swelled after the 2008 financial crisis as the Fed bought bonds to reduce long-term rates. With the economy now much healthier, the Fed is ready to begin trimming its bond holdings.\n———\nLots of questions still hang over Trump's tax plan\nWASHINGTON (AP) — President Donald Trump wants to close a frustrating 2017 with the first overhaul of the tax code in more than three decades. Yet after seven months of work, Trump's plan remains little more than a rough sketch. Despite the haziness of the blueprint, administration officials have held to their pledges that lowering tax rates would spur the creation of millions of jobs and faster economic growth.\n———\nTrump seeks probe by his trade office of China's practices\nBEDMINSTER, N.J. (AP) — President Donald Trump has asked his trade office to consider investigating China for the alleged theft of American technology and intellectual property. Trump returned to Washington during his vacation in New Jersey to sign an executive action on the probe. In remarks at the White House, he suggested that more steps would be taken against China on trade issues.\n———\nUS stocks jump as tensions with North Korea appear to ease\nNEW YORK (AP) — Technology companies, banks, and other stocks climb as investors relax somewhat after days of international tensions pulled the stock market lower last week. Equipment rental company Neff says it received a buyout offer worth $596 million and drilling technology company Tesco says it will be acquired by competitor Nabors.\n———\nTrump attacks exec for quitting council over Charlottesville\nTRENTON, N.J. (AP) — President Donald Trump lashes out on Twitter at the CEO of the nation's third-largest pharmaceutical company after he resigned from a federal advisory council. Merck CEO Kenneth Frazier, one of the few African Americans heading a Fortune 500 company, cited Trump's failure to explicitly rebuke the white nationalists who marched in Charlottesville, Virginia.\n———\nNetflix wins 'Scandal' creator Rhimes in blow to Disney, ABC\nNEW YORK (AP) — In a blow to Disney's ABC, Shonda Rhimes has signed a deal to make new shows for Netflix. Rhimes' is the creator of popular television series such as \"Scandal\" and \"Grey's Anatomy.\" She says she's looking forward to expanding her audience and \"creative identity\" with Netflix as the streaming service faces ever-growing competition for viewers from Hollywood, Silicon Valley and beyond.\n———\nTarget moves to shore up grocery, improve delivery service\nNEW YORK (AP) — Target has announced moves to address two key areas: its grocery department and faster delivery. To boost its grocery business, the company said it hired executives from rival Walmart and Cheerios maker General Mills. Target is also buying delivery logistics company Grand Junction to help it offer same-day delivery service to in-store shoppers.\n———\nSocial media harnessed to expose white nationalists at rally\nNEW YORK (AP) — People are using trying to harness the power of social media to identify and shame the white nationalists who attended last weekend's violent rally in Charlottesville, Virginia. At least one person has lost a job as a result. While online shaming is nothing new, experts disagree over just how effective it is.\n————\nOne-fifth of Americans find workplace hostile or threatening\nWASHINGTON (AP) — The American workplace is grueling, stressful and surprisingly hostile. So finds an in-depth study of 3,066 U.S. workers by the Rand Corp., Harvard Medical School and the University of California, Los Angeles. Nearly one in five workers — a share the study calls \"disturbingly high\" — say they face a hostile or threatening environment at work, which can include sexual harassment and bullying. Workers who have to face customers endure a disproportionate share of abuse.\n———\nNew life for Medicaid after GOP's health care debacle\nWASHINGTON (AP) — It doesn't equal Social Security and Medicare as a \"third rail\" program that politicians touch at their own risk, but Medicaid has gotten new life after the Republican failure to pass health overhaul legislation. The 1960s Great Society creation has long been criticized by conservatives. GOP bills would have rolled back former President Barack Obama's Medicaid expansion and imposed new overall spending limits. That combination translated to such deep cuts that it drove a wedge among Republicans.\n———\nThe S&P 500 jumped 24.52 points, or 1 percent, to 2,465.84. The Dow Jones industrial average gained 135.39 points, or 0.6 percent, to 21,993.71. The Nasdaq composite added 83.68 points, or 1.3 percent, to 6,340.23. The Russell 2000 index of smaller companies climbed 20.08 points, or 1.5 percent, to 1,394.31.\nU.S. crude oil lost $1.23, or 2.5 percent, to $47.59 a barrel in New York. Brent crude, the international standard, shed $1.37, or 2.6 percent, to $50.73 a barrel in London. Wholesale gasoline lost 4 cents to $1.58 a gallon. Heating oil fell 3 cents to $1.61 a gallon. Natural gas slid 2 cents to $2.96 per 1,000 cubic feet.",
    "source_domain": "abcnews.go.com",
    "title": "Business Highlights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/business-highlights-49215061"
}