{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:20:49+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Frays-carlos-gomez-players-targeted-drug-testing%2Fstory%3Fid%3D55535054.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tampa Bay Rays outfielder Carlos Gomez is speaking out against Major League Baseball's drug testing program, claiming there is nothing \"random\" about it.\nGomez made his comments in Spanish following a test by MLB on Tuesday, three days after he was activated from the disabled list. He told the Tampa Bay Times in separate comments Tuesday that it was the sixth or seventh time he has been tested in the first nine weeks of this season.\n\"They tell you that it's random, that they do the tests randomly and those players who go out there, go and do a drug test,\" he said in the video posted on the Twitter page of journalist Hector Gomez, which was translated by ESPN Deportes. \"Until they prove to me that it is random, I will not believe it. Because for me, it's not random. They go and choose the person they want. It's not random. If it's not that, show it to me.\n\"I have the greatest luck on my team, because they test me more than everyone else. I arrived now, three days after coming from the disabled list, and they are already testing me again.\"\nGomez, 32, has been outspoken about MLB's drug-testing program this month, telling Yahoo! Sports in a podcast interview the day after Robinson Cano was suspended that the league targets older players and Latino players for testing.\nAn MLB spokesman told Yahoo! Sports earlier this month that its drug program is run independently and that it has no say in who is tested but maintained the testing is done at random.\nCano, the Seattle Mariners' All-Star second baseman, was suspended 80 games for violating MLB's drug policy. Cano tested positive for the diuretic furosemide. Under MLB's drug policy, a player is not automatically suspended for use of a diuretic unless MLB can prove he intended to use it as a masking agent.\nHe is one of three major league players suspended this season for violating the drug policy, along with Chicago White Sox catcher Welington Castillo and Minnesota Twins shortstop Jorge Polanco. All three players are from the Dominican Republic.\nGomez, a two-time All-Star who also hails from the Dominican Republic, has never tested positive for drugs in his 12-season career.\n\"I am not afraid. Do all the tests that you want. Keep doing it to me,\" Gomez said. \"But I say it clearly, it's not random, because it's not. And I'm not going to keep quiet, because I've earned my position here.\"",
    "source_domain": "abcnews.go.com",
    "title": "Rays OF Carlos Gomez says players targeted for drug testing",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/rays-carlos-gomez-players-targeted-drug-testing/story?id=55535054"
}