{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:09:31+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Anissa Weier was ordered to a state mental health facility for up to 25 years, while Morgan will be sent to a state mental health facility for 40 years.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2F2020%2Fvideo%2Fgirls-slender-man-stabbing-case-sentenced-mental-health-52809944.json",
    "image_url": "http://a.abcnews.com/images/2020/180202_2020_act6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Girls in Slender Man stabbing case are sentenced to mental health facilities: Part 6\nReporter: It was just 24 hours ago the final sentence in a case that began with a sleepover more than three years ago. Morgan geyser is about to learn her fate. It was just weeks ago that Anissa's sentencing came first. The case is here today -- Reporter: The judge ordering her to a state mental facility for up to 25 years. Anissa will now be under state supervision until she is 37 years old. My fear is she willot really know how to interact with Normal people at Walmart, at the gas station, at pick 'N save. After spending 25 years in a mental institution. Reporter: And before Morgan's mother would learn her own daughter's fate she shares with me a letter that her daughter has now written to Payton. Dear Bella, I wish I had words that could make everything better, but I don't. So all I can say is how sorry I am. I can promise you, not a day will go by that I don't regret what I did. Stay strong, Morgan. Reporter: Just yesterday a judge deciding that Morgan will also be sent to a state mental health facility for up to 40 years. It was more than three years ago we first met Payton. Shy in front of the cameras, we did see a glimpse of her smile returning. As she shared with us her love of kittens. And of family. She's doing well in school. She has friends. She's social. Reporter: And overnight, Payton's mother sending us a message for any family dealing with the kind of pain and horror they have faced. \"If you trust in your strength and believe in your resiliency you will get through this.\" And tonight, the new images of Payton. And in just over a week, she will celebrate a milestone. Her 16th birthday. A milestone Morgan geyser will soon reach as well. Reporter: It's not where you pictured her turning 16. No. I see on social media, my friends and family who have children Morgan's age, and they'll post pictures of them driving a car, going to homecoming. You know, it's difficult. Reporter: And now after learning Morgan's fate, he mother says life for all three families has changed forever. We're leaving Reporter: Why? For a new start. I frequently drive by these places that hold horrible memories. And I just want to get us all away from that. Reporter: Away from those woods that have since been cleared to make way for a new residential development. The scene of that horror now erased, but for those three families tonight, they will never be able to erase the pain. Harvey: Wind chill's below zero\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Girls in Slender Man stabbing case are sentenced to mental health facilities: Part 6",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/2020/video/girls-slender-man-stabbing-case-sentenced-mental-health-52809944"
}