{
    "authors": [
        "Abc News",
        "Michael Rothman",
        "More Aaron",
        "More Michael"
    ],
    "date_download": "2017-04-17 16:39:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "They detail how he obtained oxycodone under a friend's name for privacy.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Funsealed-search-warrants-reveal-details-princes-drug-death%2Fstory%3Fid%3D46842785.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-Prince-MEM-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Unsealed search warrants in the death investigation of singer Prince revealed today that he was prescribed oxycodone under a friend's name, Kirk Johnson, for privacy purposes.\nThe search warrants, which were unsealed today and date back to last spring and summer, were carried out by police after Prince's death almost a year ago on April 21, 2016. Weeks later, the Midwest Medical Examiner's Office in Minnesota stated following an autopsy that the singer died from an accidental fentanyl overdose, which he \"self-administered.\"\nThe newly unsealed documents state that Prince's famed Paisley Park home and studios, where he was discovered unresponsive, were searched, along with cellphone records and emails of the artist and his team, to determine where he got the fentanyl that resulted in his death, among other drugs he was taking at the time.\nThough the warrants don't reveal the origin of the fentanyl, the new documents name Dr. Michael Todd Schulenberg as a prescriber of oxycodone for Prince and add that those scripts were in Johnson's name, not the artist himself for \"privacy\" reasons. Schulenberg has been named in previous warrants and was present when Prince's body was discovered at Paisley Park. He told police that he met with the artist twice in the weeks before his death.\nAnother revelation coming out of the new paperwork is the sheer amount of opioids Prince was taking at the time of his death.\n“There was a sizable amount of narcotic medications located inside Paisley Park,” one document stated. “Many of those areas where the pills were located would be places Prince would frequent, such as his bedroom and wardrobe/laundry room.”\nThe pills were stored, not in typical prescription bottles, but in “various other containers such as vitamin bottles,” the documents state.\nPolice interviews with the singer's associates also showed that Prince had a history of going through withdrawals.\nABC News' request for comment from Schulenberg was not immediately returned.\nLast week, ABC News spoke to the Carver County Sheriff’s Office, which said the investigation is still \"open and active\" into the artist's death.",
    "source_domain": "abcnews.go.com",
    "title": "Unsealed search warrants reveal further details of Prince's drug use before death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/unsealed-search-warrants-reveal-details-princes-drug-death/story?id=46842785"
}