{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 01:22:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Airline crews must now be booked on a flight at least an hour prior to departure to avoid bumping passengers at the last minute.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Funited-airlines-issues-rules-employees-dealing-bumped-passengers-46851866.json",
    "image_url": "http://a.abcnews.com/images/WNT/170417_wn_jarvis_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for United Airlines issues new rules to employees for dealing with bumped passengers from overbooked flights\nNext tonight new fallout for united airlines. The company issuing new rules for employees specifically when it comes to bumping passengers and after that doctor was dragged off that united plane by police, tonight a new claim involving a couple heading to their wedding. Here's ABC's chief business correspondent Rebecca Jarvis. Reporter: A week after this video forced a national debate over passenger rights -- new tales of turbulence. They said it was not their problem. Reporter: This Utah couple on their way to their wedding in Costa Rica, claiming they were kicked off a united flight this weekend for sitting in the wrong seats. United says they were removed because they repeatedly tried to move to upgraded seats without paying extra. Even though we moved to the right seats, we were still taken off the plane. Reporter: In-flight disputes under the microscope as airlines roll out new rules. Delta authorizing supervisors to offer nearly $10,000 to volunteers giving up their seats for overbooked flights, and at united they will no longer ask seated passengers to give up seats for crew members. We have learned a lot, and we will do better, and that's what I promise. Reporter: To avoid getting bumped your best bet is to skip late day flights, and remember to be decisive. Once you volunteer to give up that seat, you often can't change your mind. David, if you're in a position to take a later flight let the agent know as soon as you get to the gate. You can even name your price on the offer. Rebecca Jarvis with us. Thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "United Airlines issues new rules to employees for dealing with bumped passengers from overbooked flights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/united-airlines-issues-rules-employees-dealing-bumped-passengers-46851866"
}