{
    "authors": [
        "Abc News",
        "Alexander Mallin",
        "More Meridith",
        "More Alexander"
    ],
    "date_download": "2018-02-03 18:35:03+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Trump says Republican memo 'totally vindicates' him in Russia probe",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-released-republican-memo-totally-vindicates-russia-probe%2Fstory%3Fid%3D52816351.json",
    "image_url": "http://a.abcnews.com/images/Politics/donald-trump-gty-jt-180203_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump tweeted this morning that a controversial Republican memo alleging abuses of government surveillance powers at the FBI and Justice Department \"totally vindicates\" him in the Russia investigation.\nInterested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\nThe four-page memo was written by Republican staff of the House Intelligence Committee and released Friday -- despite \"grave concerns\" expressed by the FBI over its being made public -- after Trump declassified it and approved its release without redactions by the House committee.\nThe president's tweet Saturday morning refers to the Russia investigation as a \"Russian witch hunt\" and asserts that there was \"no collusion\" and \"no obstruction.\"\nThis memo totally vindicates “Trump” in probe. But the Russian Witch Hunt goes on and on. Their was no Collusion and there was no Obstruction (the word now used because, after one year of looking endlessly and finding NOTHING, collusion is dead). This is an American disgrace! — Donald J. Trump (@realDonaldTrump) February 3, 2018\nHis tweet comes after Republicans in Congress who supported the memo's release said it would not undermine the special counsel investigation into Russia's alleged interference in the 2016 U.S. presidential election and possible collusion by Trump associates.\n\"Nothing in the memo released today undercuts Mr. Mueller's investigation,\" Sen. Lindsey Graham, R-S.C., said Friday in a statement.\nMichael Holahan/The Augusta Chronicle via AP, FILE\nRepublican Rep. Trey Gowdy of South Carolina similarly said Friday in a tweet, \"As I have said repeatedly, I also remain 100 percent confident in Special Counsel Robert Mueller. The contents of this memo do not - in any way - discredit his investigation.\"\nMark Wilson/Getty Images, FILE\nDemocrats and Republican Sen. John McCain meanwhile slammed the release of the memo.\nRep. Adam Schiff, D-Calif., the top Democrat on the House Intelligence Committee, said the decision \"to publicly release misleading allegations against the Department of Justice and Federal Bureau of Investigation is a shameful effort to discredit these institutions, undermine the Special Counsel’s ongoing investigation, and undercut congressional probes\" related to Russia's alleged election interference.\nMatt Rourke/AP, FILE\nMcCain of Arizona said, \"The latest attacks on the FBI and Department of Justice serve no American interests – no party’s, no president’s, only [Russian President Vladimir} Putin’s. The American people deserve to know all of the facts surrounding Russia’s ongoing efforts to subvert our democracy, which is why Special Counsel Mueller’s investigation must proceed unimpeded.\"",
    "source_domain": "abcnews.go.com",
    "title": "Trump says released Republican memo 'totally vindicates' him in Russia probe",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-released-republican-memo-totally-vindicates-russia-probe/story?id=52816351"
}