{
    "authors": [
        "Abc News",
        "More Molly"
    ],
    "date_download": "2018-03-20 09:04:18+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "The race offers a window into the future of the Democratic Party",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fsitting-democrat-fights-seat-contentious-primary-battle%2Fstory%3Fid%3D53852937.json",
    "image_url": "https://s.abcnews.com/images/Politics/dan-lipinski-marie-newman-gty-jt-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In the 2018 primaries, Democrats are looking to define the direction of their party, as the progressive grassroots movement gains strength. That fight is playing out in Illinois’ 3rd Congressional District in a race between conservative incumbent Rep. Dan Lipinski and his progressive challenger, Marie Newman\nThe race has drawn national attention because it offers a window into the future of the Democratic Party, and staying power of the progressive movement. If Newman emerges as the victor and unseats Lipinski, it could be a signal that the party is less likely to accept conservative views on social issues like abortion and LGBT rights, and moving further left.\nKiichiro Sato/AP\nDemocratic leaders have also picked sides in the race, and the leaders standing behind Lipinski and Newman respectively exemplify the tension that exists in the Democratic Party between centrist and progressives—a fight that is likely to continue into the 2020 presidential election cycle.\nProgressive Sen. Bernie Sanders has thrown his weight behind Newman in a district the senator won by eight points in the 2016 Democratic primary.\nSanders’ endorsement draws a sharp contrast with House Minority Leader Nancy Pelosi’s endorsement of Lipinski.\nMEET THE CANDIDATES\nA Lipinski has represented the southwest portion of Chicago and its surrounding suburbs in Congress for the last 35 years. Rep. Dan Lipinski was first elected to Congress in 2004, after his father, Rep. William Lipinski, dropped out of the race after the primary, but before the general election, and the Democratic Party tapped the younger Lipinski to fill the empty slot.\nLipinski has served seven terms in the seat and has held positions often at odds with the majority of his party. He is a co-chair of the Pro-Life Caucus and voted against the DREAM act in 2010. He also was the only Democrat from Illinois to vote against Obamacare, and did not publically endorse President Barack Obama for a second term.\nPablo Martinez Monsivais/AP, FILE\nMarie Newman poses one of the most serious challenges Lipinski has faced while in office and is looking to capitalize on the progressive movement that began after the 2016 election. Newman — who is running for office for the first time — is campaigning on a pro-choice, pro-LGBT, healthcare-for-all agenda.\nNewman said she’s been approached to run several times over the last 10 years, but it was only after the election of President Donald Trump that she was compelled to do so.\n“I realized very clearly that this had to be done, I had to step off the sidelines,” Newman told ABC News. “The day after Trump was elected, what I realized is nobody is coming to save us, that we have to save us.”\nBIG TENT OR SINGLE ISSUE PARTY?\nAbortion has been a major issue in this campaign with groups on both sides lending their support to Newman and Lipinski.\nNewman has the support of pro-choice groups NARAL Pro-Choice America, EMILY’s List, and Planned Parenthood — who along with other groups have spent more than $1.6 million campaigning against Lipinski through the super PAC \"Citizens For A Better Illinois\".\nLipinski has also gotten a hand from Susan B. Anthony List, a pro-life organization, which deployed 70 canvassers in Illinois 3 last weekend to campaign on his behalf.\nIn a 2017 interview with the Washington Post, Minority Leader Nancy Pelosi said that she doesn’t believe abortion should be a litmus test for Democrats, and Lipinski has warned against the party becoming the ‘tea party of the left.’\n“Right now there is a battle for what the Democratic Party is going to be going forward,” Lipinski said in a recent interview with WGN Radio in Chicago.\n“[T]here are some who want to have a Tea Party of the left in the Democratic Party to match unfortunately what has happened to the Republicans. But we need to have a big tent party, we need to rally around those issues that can bring all Democrats together.”\nBut Newman doesn’t believe that the race highlights divisions within her party—rather that it highlights how out of touch Lipinski is with party values.\n“The problem is [Lipinski] is a straight-up Republican, so of course I look like I’m very left when in reality I’m just a true blue Democrat,” Newman said.\n“We are a big tent. We are a giant mosaic of lots of independent thinkers. He is not a Democrat.”\nBIG NAME ENDORSEMENTS\nDemocratic leaders are not the only endorsements at play in the race. In a rare move, two sitting representatives from Illinois, Rep. Jan Schakowsky (IL-09) and Rep. Luis Gutierrez (IL-04), broke with tradition and endorsed Newman over their colleague.\nNewman also received the first endorsements in the country from three Indivisible groups in Illinois — a progressive, grassroots organization that works at the local level to oppose President Trump’s agenda.\nBill Clark/CQ Roll Call/Getty Images\nBut Lipinski has secured endorsements from some major Unions—which could be crucial to victory. Lipinski has picked up endorsements from 27 union groups, including the endorsement of the Illinois AFL-CIO, which has the third largest union membership in the nation.\nFor her part, Newman has picked up Union endorsements from the SEIU Illinois State Council and the Illinois Federation of Teachers.\nOne endorsement not at play? The Democratic Party’s. Both the Democratic National Committee and the Democratic Congressional Campaign Committee have not publically endorsed Lipinski in the race.\nNO THREAT FROM THE RIGHT\nOne thing that is clear heading into Tuesday night is whoever wins on the Democratic side will almost certainly take the seat in November.\nNot only is the District safely blue, the only Republican running in the race is Arthur Jones, who is a Holocaust denier, and self-described \"white racialist\".\nThere has been little polling done in the race, so it’s not entirely clear where voters stand. The latest poll—conducted by NARAL Pro-Choice America, a group supporting Newman—showed the race in a virtual tie. Lipinksi led Newman 43 percent to 41 percent, which is within the margin of error.",
    "source_domain": "abcnews.go.com",
    "title": "Sitting Democrat fights to keep his seat in contentious primary battle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/sitting-democrat-fights-seat-contentious-primary-battle/story?id=53852937"
}