{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 00:55:52+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "J.J. Watt huge fan of Rockets guard Patrick Beverley",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjj-watt-huge-fan-rockets-guard-patrick-beverley-46851865.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_caff45d4b144456e897f35d34edd9b11_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When J.J. Watt attended the Houston Rockets' playoff game on Sunday night, he got a front-row view of Patrick Beverley's intensity.\nThe Houston Texans star defensive end was taken aback when Beverley walked over to his courtside seat during a timeout and simply stood in front of him and stared for several seconds.\n\"I was like: 'Pat, I don't know what you want me to do here, man. I can't really do anything,'\" Watt said. \"He's just staring me down. And my girlfriend looked at me and she was like: 'That was kind of cool and kind of awkward at the same time.' I was like: 'Yeah it was.' I didn't know what to do.\"\nWatt finally broke the stalemate by high-fiving the guard, a well-deserved acknowledgement on a night when Beverley scored a playoff career-high 21 points with 10 rebounds and slowed Russell Westbrook with his defense to help Houston rout Oklahoma City 118-87 in Game 1 of their first-round playoff series.\n\"The guy was just absolutely killing it,\" Watt said. \"His intensity is the best. I was setting there on the sidelines getting fired up, wanting to get in the game.\"\nWatt actually thought about rushing on the court for a brief moment in the third quarter on Sunday night to stand up for Beverley. It came when 7-foot Thunder center Steven Adams knocked the 6-1 Beverley to the court on a hard screen just a few feet away from Watt's seat.\n\"That dude knocks him out,\" Watt said. \"And I was like: 'OK, we may have a problem you're messing with my guy Pat.'\"\nThe Rockets were off on Monday and Beverley wasn't available for comment, but he tweeted his thanks for Watt's support by saying that he wants him back for Game 2 on Wednesday night in the same seat he had for the first game.\nWatt is known for his fiery demeanor while chasing down quarterbacks on the football field. But even he was a little surprised by Beverley's ferocity on Sunday night.\n\"He just has a way of getting you fired up,\" Watt said. \"He is like the Wolverine out there. He's fearless. I love the way that guy plays and it was just fun to watch that guy put on a show.\"\n———\nMore NBA basketball: https://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "J.J. Watt huge fan of Rockets guard Patrick Beverley",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/jj-watt-huge-fan-rockets-guard-patrick-beverley-46851865"
}