{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:13:49+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Firefighters brace for second week of California wildfires",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Ffirefighters-brace-week-california-wildfires-51712154.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_b54694f599cd4816a290a3b07dcdca57_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As Southern California enters its second week engulfed in flames, fire officials anticipate more growth and danger due to continued strong wind gusts, no rain and decades-old dry vegetation.\nA powerful flare-up on the western edge of the largest and most destructive wildfire sent residents fleeing Sunday, as wind-fanned flames ripped down hillsides toward coastal towns northwest of Los Angeles. New evacuations were ordered as the fire sent up an enormous plume near Montecito and Carpinteria, seaside areas in Santa Barbara County.\n\"The winds are kind of squirrely right now,\" said county fire spokesman Mike Eliason. \"Some places the smoke is going straight up in the air, and others it's blowing sideways. Depends on what canyon we're in.\"\nSouthern California's gusty Santa Ana winds have long contributed to some of the region's most disastrous wildfires. They blow from the inland toward the Pacific Ocean, speeding up as they squeeze through mountain passes and canyons.\nGusts of up to 40 mph (64 kph) are expected through Monday, according to the National Weather Service.\nContainment increased Sunday on other major blazes in Los Angeles, Riverside and San Diego counties. Resources from those fires were diverted to the Santa Barbara foothills to combat the 270-square-mile (699-sq. kilometer) fire that started Dec. 4 in neighboring Ventura County.\nAs of late Sunday, the Thomas Fire had destroyed 790 structures and damaged 191.\nFires are not typical in Southern California this time of year but can break out when dry vegetation and too little rain combine with the Santa Ana winds. Though the state emerged this spring from a yearslong drought, hardly any measurable rain has fallen in the region over the past six months.\n\"This is the new normal,\" Democratic Gov. Jerry Brown warned Saturday after surveying damage from the deadly Ventura fire. The governor and experts said climate change is making wildfires a year-round threat.\nHigh fire risk is expected to last into January.\nThe air thick with acrid smoke, even residents of areas not under evacuation orders took the opportunity to leave, fearing another shutdown of U.S. 101, a key coastal highway that was closed intermittently last week. Officials handed out masks to residents who stayed behind in Montecito, the wealthy hillside enclave that's home to celebrities such as Oprah Winfrey, Jeff Bridges and Rob Lowe.\n\"Our house is under threat of being burned,\" Ellen DeGeneres tweeted at midday Sunday. \"We just had to evacuate our pets. I'm praying for everyone in our community and thankful to all the incredible firefighters.\"\nOjai experienced hazardous levels of smoke at times and officials warned of unhealthy air for large swaths of the region. The South Coast Air Quality Management District urged residents to stay indoors if possible and avoid vigorous outdoor activities.\nIn San Diego, which is 130 miles (209 kilometers) to the south, the Lilac Fire was 75 percent contained. The flames erupted suddenly Thursday in the Fallbrook area, known for its avocado groves and horse stables in the rolling hills.\nThe fire swept through the San Luis Rey Downs training center, where it killed more than 40 elite thoroughbred race horses, and destroyed more than 100 homes — most of them in a retirement community. Three people were burned trying to escape the fire that continued to smolder Sunday.\nDespite the size and number of wildfires burning in the region, there has only been one confirmed death: A 70-year-old woman, who crashed her car on an evacuation route, is attributed to the fire in Santa Paula, a small city where the Thomas Fire began.\nMost of last week's fires were in places that burned in the past, including one in the ritzy Los Angeles neighborhood of Bel-Air that burned six homes and another in the city's rugged foothills above the community of Sylmar and in Santa Paula.\n———\nAssociated Press writers Elliot Spagat in Fallbrook and Brian Melley and Robert Jablon in Los Angeles contributed to this report.\n———\nFollow Weber at https://twitter.com/WeberCM .\n———\nFor complete coverage of the California wildfires, click here: https://apnews.com/tag/Wildfires.",
    "source_domain": "abcnews.go.com",
    "title": "Firefighters brace for second week of California wildfires",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/firefighters-brace-week-california-wildfires-51712154"
}