{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 16:52:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Man accused of driving into protest crowd denied bond",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fsuspect-deadly-virginia-car-ramming-due-court-49200503.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_87b3b88badfd4d70b326135171492cb8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A man accused of ramming his car into a crowd of counter-protesters at a white nationalist rally in Virginia was denied bond Monday after the public defender's office said it couldn't represent him and the judge was forced to find a local attorney to fill in.\nJames Alex Fields Jr. was not present in the courtroom but appeared via video monitor dressed in a black-and-white striped uniform. Seated, he answered questions from the judge with simple responses of \"Yes, sir\" when asked if he understood what was being explained to him. Fields also replied \"No, sir\" when asked if he had ties to the community of Charlottesville.\nJudge Robert Downer set an Aug. 25 hearing for the 20-year-old Fields, who has been charged with second-degree murder and other counts.\nDowner said the public defenders' office informed him it could not represent Fields because a relative of someone in the office was injured in Saturday's protest. He appointed local attorney Charles Weber to represent him. Weber couldn't immediately be reached by The Associated Press.\nFields is charged in the death of Heather Heyer, 32, of Charlottesville, who died after a car that police say Fields was driving slammed into a crowd of people protesting the nationalist rally Saturday. Fields was arrested shortly afterward and taken into custody.\nFields was fascinated with Nazism, idolized Adolf Hitler, and had been singled out by school officials in the 9th grade for his \"deeply held, radical\" convictions on race, a former high school teacher said Sunday. Fields also confided that he had been diagnosed with schizophrenia when he was younger and had been prescribed an anti-psychotic medication, Derek Weimer said in an interview with The Associated Press.\nIn high school, Fields was an \"average\" student, but with a keen interest in military history, Hitler, and Nazi Germany, said Weimer, who said he was Fields' social studies teacher at Randall K. Cooper high school in Union, Kentucky, in Fields' junior and senior years.\n\"Once you talked to James for a while, you would start to see that sympathy toward Nazism, that idolization of Hitler, that belief in white supremacy,\" Weimer said. \"It would start to creep out.\"\nPolice say Fields drove his silver Dodge Challenger through a crowd of protesters in Charlottesville, killing Heyer and wounding 19 other people. A Virginia State Police helicopter deployed in a large-scale police response to the violence then crashed into the woods outside of town and both troopers on board died.\nFields had been photographed hours earlier with a shield bearing the emblem of Vanguard America, one of the hate groups that took part in the \"take America back\" campaign to protest the removal of a Confederate statue. The group on Sunday denied any association with the suspect.\nMeanwhile, a message posted Saturday night on a leading neo-Nazi website called The Daily Stormer promised future events that would be \"bigger than Charlottesville.\"\nThe mayor of Charlottesville, political leaders of all political stripes, and activists and community organizers around the country planned rallies, vigils and education campaigns to combat the hate groups. They also urged President Donald Trump to forcefully denounce the organizations, some of which specifically cited Trump's election after a campaign of racially charged rhetoric as validation of their beliefs. Attorney General Jeff Sessions announced late Saturday that federal authorities would pursue a civil rights investigation into the circumstances surrounding the crash.\nWeimer recalled that school officials had singled out Fields when he was in 9th grade for his political beliefs and \"deeply held, radical\" convictions on race and Nazism.\n\"It was a known issue,\" he said.\nWeimer said Fields left school for a while, and when he came back he was quieter about politics until his senior year, when politicians started to declare their candidacy for the 2016 presidential race. Weimer said Fields was a big Trump supporter because of what he believed to be Trump's views on race. Trump's proposal to build a border wall with Mexico was particularly appealing to Fields, Weimer said. Fields also admired the Confederacy for its military prowess, he said, though they never spoke about slavery.\nAs a senior, Fields wanted to join the army, and Weimer, a former officer in the Ohio National Guard, guided him through the process of applying, he said, believing that the military would expose Fields to people of different races and backgrounds and help him dispel his white supremacist views. But Fields was ultimately turned down, which was a big blow, Weimer said. Weimer said he lost contact with Fields after he graduated and was surprised to hear reports that Fields had enlisted in the army.\n\"The Army can confirm that James Alex Fields reported for basic military training in August of 2015, said Army spokeswoman Lt. Col. Jennifer Johnson. \"He was, however, released from active duty due to a failure to meet training standards in December of 2015,\" she said.\nFields' mother, Samantha Bloom, told the AP late Saturday that she knew her son was going to Virginia for a political rally, but she had no idea it involved white supremacists.\n\"I just told him to be careful,\" she said, adding she warned him that if there were protests \"to make sure he's doing it peacefully.\"\n———\nThis story has been edited to clarify who participated in the white nationalist rally and who posted the message promising future events.",
    "source_domain": "abcnews.go.com",
    "title": "Man accused of driving into protest crowd denied bond",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/suspect-deadly-virginia-car-ramming-due-court-49200503"
}