{
    "authors": [
        "Abc News",
        "More Genevieve"
    ],
    "date_download": "2018-05-30 16:55:55+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A simple handshake can mean so much more.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fteachers-meet-greet-routine-making-manners-matter-texas%2Fstory%3Fid%3D55513728.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/kindergarten-class-texas2-ht-ml-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's a greeting many adults take for granted: a simple handshake.\nBut for one Texas kindergarten class, and one kindergartner in particular, a simple handshake is much more.\nWhen teacher Ashley Taylor posted to Facebook a video of her kindergarten class shaking the hand of that day's greeter -- a little boy names Asher -- she never imagined it would have the impact it has had.\n\"I always wonder, 'How am I going make a change in the world?' This proved to me that I will make difference through something as simple as this,\" Taylor told \"Good Morning America.\"\nAshley Taylor\n\"The school shootings have been a real eye-opener,\" she continued. \"That is what made me post that video originally. Maybe if some of those kids had felt like others were on their side, things would have happened differently. I understand there are lots of factors that play into those situations. But what if?'\"\nAsher, Taylor said, has a genetic disorder called Neurofibromatosis 1.\n\"When school started, he had very limited speech,\" Taylor explained. \"The few words that he did use were not clear. So when I recorded the video, I was so proud at how far he has come. He was able to communicate clearly to each student, greeting them by name.\"\nBut the ritual is beneficial to the entire class.\nAshley Taylor\n\"I notice that my kids are much different than their peers,\" she said. \"Just the way the interact with other kids and adults. Throughout each day, our activities require us to be speakers and listeners. We practice those same lessons during those times. Both require eye contact, clear speaking and respect.\"\n\"Every child is spoken to by name, given a firm handshake and welcomed into our room with a smile and sometimes a hug.\"\nShe said every child now \"begs\" to be the greeter.\nThere is no set greeter schedule. Instead, Taylor speaks to each of the 18 kids to see how their day is starting.\n\"That gives me an idea of who I should choose,\" she said. \"I am pretty sure this is their favorite part of the day.\"\nTaylor's kindergarten class at Keene Elementary School had their graduation on Tuesday.\n\"As the year comes to an end, I pray that each of my 'Littles' will continue the manners and respect that they have learned during their year with me,\" she told \"GMA.\"\n\"Life can be hard for kids, but it shouldn’t be at school.\"",
    "source_domain": "abcnews.go.com",
    "title": "This teacher's meet-and-greet routine is making manners matter for her Texas kindergarten class",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Family/teachers-meet-greet-routine-making-manners-matter-texas/story?id=55513728"
}