{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 06:43:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "AP PHOTOS: Editor Selections From the Past Week in Asia",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fap-photos-editor-selections-past-week-asia-44507231.json",
    "image_url": "http://abcnews.go.com/International/wireStory/ap-photos-editor-selections-past-week-asia-44507231",
    "language": "en",
    "localpath": null,
    "maintext": "After returning from a visit to Pearl Harbor last week, Japanese Defense Minister Tomomi Inada visited a Tokyo shrine that honors Japan's war dead, including convicted war criminals. Inada had accompanied Prime Minister Shinzo Abe during his visit to Pearl Harbor, where he offered condolences to those who died in the Japanese attack there in 1941.\nIn other images from the Asia-Pacific region last week, South Korean opposition politicians called for nullifying a settlement reached between Seoul and Tokyo on compensation for South Korean women forced into sexual slavery by Japan's military during World War II. The move came on the anniversary of the deal, and amid growing efforts to erase some of the key policies of impeached South Korean President Park Geun-hye.\nA powerful typhoon killed at least six people and spoiled Christmas in several provinces in the Philippines, with more than 380,000 people abandoning celebrations at home to reach emergency shelters and other safer grounds.\nSouth Korea is fighting its worst bird flu outbreak in a decade. The government said that about 26 million head of poultry would be culled, including about one-third of the country's egg-laying hens, after the H5N6 strain of avian influenza was found in farms and parks.\nChina and Sao Tome and Principe officially resumed diplomatic relations in a triumph for Beijing over rival Taiwan after the African island nation abruptly broke away from the self-ruled island earlier in December.\n———\nThis gallery was curated by Associated Press photo editor Masayo Yoshida in Tokyo.",
    "source_domain": "abcnews.go.com",
    "title": "AP PHOTOS: Editor Selections From the Past Week in Asia",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/ap-photos-editor-selections-past-week-asia-44507231"
}