{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 21:27:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Ozuna HR starts comeback as Marlins beat A's 11-6",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fozuna-hr-starts-comeback-marlins-beat-11-48040950.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_4b6abf427e9d4c5395fac71f0b6db87c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A four-run deficit no longer looms so large for the Miami Marlins.\nMarcell Ozuna homered to start a comeback Wednesday afternoon, and Miami beat the Oakland Athletics 11-6 to complete a two-game sweep.\nOzuna hit his 17th home run in the second inning after the Marlins fell behind 4-0. He added a double and finished with three RBIs to help overcome a wobbly outing by Edinson Volquez, who had a no-hitter in his most recent home start.\n\"Today I got lucky,\" Volquez said. \"They picked me up.\"\nRallies were rare for the Marlins during their 14-27 start. But they've won 13 of their past 19 games, largely because the bats came alive.\n\"There were times last month when it felt like if the other team scored first, we were in trouble,\" manager Don Mattingly said. \"Now you don't have the same feeling.\"\nTyler Moore hit his fifth homer and scored three times. Christian Yelich and Dee Gordon each had two hits and two RBIs.\n\"It has all been clicking for us the last couple of weeks,\" Yelich said. \"We got some guys hot at the same time and are putting a lot of pressure on teams. We can score runs a lot of different ways — manufacturing, or guys leaving the ballpark.\"\nRyon Healy hit a three-run homer for the Athletics (27-38), who fell to 11 games below .500 for the first time. They went 1-5 on their trip and lost their ninth consecutive road series, their longest such streak since 1986.\nOakland lost after leading by three or more runs three times on the trip. Daniel Gossett (0-1) couldn't hold the early lead in his major league debut after being called up from Triple-A Nashville, and allowed seven runs, six earned, in 3 1-3 innings.\n\"It was not exactly the way I drew it up, but I'm so fortunate to get the opportunity to play in the big leagues,\" Gossett said. \"It was everything you dream of, minus the outcome.\"\nVolquez lasted only four innings and gave up four hits, four walks and five runs, four earned. Kyle Barraclough (2-1), the first of six Miami relievers, pitched a scoreless fifth.\nINTERLEAGUE RECORD\nMiami's Ichiro Suzuki had a pinch-hit infield single in the fifth for his 365th interleague hit, breaking Derek Jeter's major league record.\n\"Amazing,\" Mattingly said. \"A lot of games, a lot of hits. You're talking about him and Derek, obviously two Hall of Fame guys. The length of their careers — that's really greatness, the guys that can be good for long periods of time.\"\nPITCHER HITTING\nGossett reached in the fourth on an infield single , his first major league hit and the first by Athletics pitchers in their past 27 at-bats over two seasons.\n\"You can close your eyes and swing, and sometimes it works,\" Gossett said.\nTRAINER'S ROOM\nOakland: RF Matt Joyce left in the third, one inning after he cut his chin colliding with first baseman Yonder Alonso pursuing a popup, which Alonso caught. Joyce received three stitches but said the injury wasn't serious.\nMiami: LHP Braxton Garrett, the Marlins' top prospect, will receive a second opinion on his sore left elbow next week from specialist Dr. James Andrews. Garrett has been diagnosed with a partial tear of the ulnar collateral ligament and could require Tommy John surgery.\nROSTER MOVE\nTo make room on the roster for Gossett, 1B-OF Matt Olson was optioned to Nashville.\nDRAFT PICK\nThe Marlins took the brother of Chicago Bears tight end Dion Sims in the 14th round of the draft. Demetrius Sims is a shortstop at Bethune-Cookman.\nUP NEXT\nMiami: The Marlins hit the road after winning for the 10th time in their past 12 home games. They visit the new ballpark in Atlanta for the first time to begin a three-game series Friday, when RHP Dan Straily (4-4, 3.89) will pitch against LHP Sean Newcomb (0-1, 0.00).\nOakland: The A's return home for a four-game series against the Yankees beginning Thursday, when RHP Sonny Gray (2-2, 4.37) will face LHP Jordan Montgomery (4-4, 3.55).\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "Ozuna HR starts comeback as Marlins beat A's 11-6",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/ozuna-hr-starts-comeback-marlins-beat-11-48040950"
}