{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 01:11:43+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fdeadliest-mass-slayings-recent-canadian-history-54700866.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_4e16fdc4052747c4b6627fd66ba4b182_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Here are some of the deadliest mass murders in recent Canadian history:\nApril 23, 2018: A man drives a white van for about a mile along a crowded Toronto sidewalk, killing 10 people and seriously injuring at least 13 others. Police arrest suspect Alek Minassian. The motive remains unclear.\nJan. 29, 2017: Six people are killed and eight injured when a man goes on a shooting rampage at a Quebec City mosque. University student Alexandre Bissonnette, who had taken far-right political positions on social media, pleads guilty.\nDec. 29, 2014: In the worst mass shooting in Edmonton, a man suspected of domestic violence shoots and kills six adults and two young children in two different homes. Phu Lam then killed himself in a restaurant where he worked.\nJune 4, 2014: A man uses a semi-automatic rifle to fatally shoot three Royal Canadian Mounted Police officers and wound two others in Moncton, New Brunswick. The attack by Justin Bourque was the deadliest attack on the RCMP since four officers were killed by a gunman in the western province of Alberta in 2005.\nApril 5, 1996: Angered by his wife's divorce action, Mark Chahal kills her and eight other members of her family in Vernon, British Columbia, before shooting himself.\nSept. 18, 1992: A bomb kills nine strike-breaking workers at the Giant Yellowknife gold mine in the Northwest Territories.\nDec. 6, 1989: A man with a semi-automatic rifle storms into an engineering classroom at the Ecole Polytechnique in Montreal, asks men to leave and then kills 14 women before turning the gun on himself. Gunman Marc Lepine says he was \"fighting against feminists\" he blamed for his troubles.\nSept. 1, 1972: An arson attack on a downtown Montreal night club kills 37 people and injures 64. Gasoline was spread on the stairway of Blue Bird Cafe and then ignited. Most of the deaths occurred in the Wagon Wheel country-western bar upstairs. Three young men from Montreal who had earlier been denied entry for drunkenness were convicted and sentenced to life in prison.\n———\nReplaces 1996 entry to correct name of shooter to Mark Chahal.",
    "source_domain": "abcnews.go.com",
    "title": "Deadliest mass slayings in recent Canadian history",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/deadliest-mass-slayings-recent-canadian-history-54700866"
}