{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 11:45:16+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "10 Things to Know for Today",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2F10-things-today-45504381.json",
    "image_url": "http://abcnews.go.com/US/wireStory/10-things-today-45504381",
    "language": "en",
    "localpath": null,
    "maintext": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about today:\n1. INVESTIGATIONS INTO RUSSIA TO CONTINUE AFTER FLYNN'S EXIT\nDemocrats contend an independent investigation is the best way to answer questions about the Trump administration's ties to Russia, a notion rebuffed by the GOP.\n2. WASHINGTON MULLS DRAMATIC SHIFT IN POLICY AS NETANYAHU GOES TO WHITE HOUSE\nThe Trump administration suggests peace between the Israelis and Palestinians may not come in the form of a two-state solution — how this might actually be possible is not made clear.\n3. ARREST MADE AFTER KIM'S HALF BROTHER KILLED\nNews of the apparent assassination of the North Korean leader's sibling ripples across Asia and Malaysian police say they have arrested a Vietnamese woman in connection with Kim Jong Nam's death.\n4. WHAT'S IN STORE FOR MATTIS IN BRUSSELS\nNATO defense ministers hold two days of talks focused on military spending, terrorism and relations with Russia.\n5. INSPECTION REPORT REVEALED CRACKS TO CALIFORNIA DAM\nAn expert says the cracks on the Oroville Dam spillway surface could let water tear through the concrete if not properly repaired.\n6. STUDY: MOST DRIVERS, NOT JUST YOUNG, ARE TAKING RISKS\nWell over half of drivers in every age group have texted behind the wheel, run a red light or driven faster than the speed limit in the last 30 days, the AAA Foundation says.\n7. BOEING VOTE TELLS NEXT CHAPTER IN SOUTHERN UNIONIZATION\nIf successful, the balloting would send a message to politicians that workers in South Carolina are demanding the same protections and benefits as their colleagues in other areas.\n8. PRODUCE AISLES IN SWEDEN GOING HIGH-TECH\nLaser beams create tattoo-like patterns — in this case the product's name, country of origin and code number — ostensibly replacing labels and plastic packaging.\n9. WHO THREE-PEATED AS SWIMSUIT QUEEN\nKate Upton again graces the cover of Sports Illustrated's annual issue, becoming only the fourth woman to do it three times.\n10. CALL THIS COMEBACK A 'RUMOR'\nRumor is crowned America's top dog when, a year after a near miss on the very same green carpet, the German shepherd came out of retirement to win best in show at Westminster.",
    "source_domain": "abcnews.go.com",
    "title": "10 Things to Know for Today",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/10-things-today-45504381"
}