{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:49:00+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Dr. Ronny Jackson's confirmation hearing Wednesday has been postponed.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrump-suggests-va-secretary-nominee-step-54699988.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_pol_trump_jackson_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump suggests his VA secretary nominee step aside\nYour nominee to run the veterans affairs administration doctor Rhonda Jackson. His run into some serious political headwinds on Capitol Hill with some serious allegations being leveled at him. I'm wondering what you know of those allegations in do you intend to stand behind. When I haven't heard of the particular allegations but I will tell you he's one of the finest people that I have Matt. And I think speaking from a Lonnie also. He's been the doctor for President Obama I believe for President Bush for me I got to know pretty well. He's a great doctor. And it was a suggestion now I know there's an experience. Problem because lack of experience but there's an experience program the veterans administration is very important to me we've done a great job with that as you know with the accountability act and many other things now were working on Joyce. It's gonna happen. They take great care of our veterans it's a very very important thing we've done a great job. But. I told. Admiral Jackson still a little while ago. I said what do you need this war this is a vicious group of people. That maligned and they do and I lived through real live through it. You people are getting record ratings because of it so congratulations. But I still woody native who is an admiral who's a great leader. And they questioned him about every little thing as you know with the success. What will hopefully soon be secretary of state Pompeo. Everybody was very surprised I heard ten minutes before the vote yesterday on committee that. He will not be approved at committee which would be the first time in many many decades that something like that would have happened with regard to his secretary of state. Except I spoke to Rand Paul and Rand Paul has. Really never let me down eight Rand Paul is a good man. And I knew things that nobody else and Rand Paul said I'm gonna change my vote and he voted and everybody was surprised. They actually got an eleven to nine vote because as you know Johnny Isaacson is vote counts. If it is in the deciding vote so it was actually lead into the ninth. With I believe an exit as there was one. Vote what what would you call that as well as president. Not present. Article present OK so was eleven to nine and that was that was a terrific thing. But they failed to stop him so now they say who's next who's next. And this. Person admiral Jackson doctor Jackson it's a wonderful man said to when he needed for. And as far as experience is concern the veterans administration. Which is approximately thirteen million people is so big you couldn't run the biggest hospital system in the world and it's. Small time compared to the veterans administration so nobody has experience. What is is a leader and a good man but I told the message you know what. You to find a person whose son's a top student at Annapolis. He's a high quality person. As to what you needed for so he'll be me it's totally his decision but he'll me making a decision.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump suggests his VA secretary nominee step aside",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trump-suggests-va-secretary-nominee-step-54699988"
}