{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:48:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Mystery of Etan Patz's disappearance ends in conviction",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fmystery-etan-patzs-disappearance-ends-conviction-45501695.json",
    "image_url": "http://abcnews.go.com/US/wireStory/mystery-etan-patzs-disappearance-ends-conviction-45501695",
    "language": "en",
    "localpath": null,
    "maintext": "It was one of New York City's most enduring mysteries: A sandy-haired, 6-year-old boy who vanished on his way to school. A fruitless search that scared a generation of parents. A family that fought for years to hold one man accountable, only to be told someone else was to blame.\nSome questions remain in the 1979 disappearance of Etan Patz, but a jury decided Tuesday that it had enough evidence to convict a former convenience store clerk of luring the boy into a basement and killing him, after a first trial ended with a hung jury.\nPedro Hernandez confessed several years ago to choking Etan, but his lawyers said that admission was the false imagining of a troubled man whose mind blurred the boundary between reality and illusion.\nDuring Hernandez's first trial in 2015, that argument won over a lone juror, who wouldn't budge and forced a mistrial. This second time around, the jury was unanimous, finding Hernandez guilty of murder and kidnapping after nine days of deliberations.\n\"We decided he has an illness ... but that didn't make him delusional,\" said juror Michael Castellon. \"We think that he could tell right from wrong. He could tell fantasy from reality.\"\nHernandez, 56, didn't react visibly as the verdict was read. Sentencing was set for Feb. 28. His lawyers said he planned to appeal.\n\"In the end, we don't believe this will resolve the story of what happened to Etan back in 1979,\" said lawyer Harvey Fishbein.\nEtan's disappearance during his morning walk to the school bus helped end an era where parents felt comfortable letting their children roam.\nHe became one of the first missing children ever pictured on milk cartons. The anniversary of his disappearance has been designated National Missing Children's Day. His parents lent their voices to a campaign to make missing children a national cause, and it fueled laws that established a national hotline and made it easier for law enforcement agencies to share information about vanished youngsters.\nFor decades, though, the investigation into what happened to him went nowhere.\nA body was never found. Unlike today's New York City, there was no network of security cameras to check for clues.\nFor years, some detectives and the Patz family thought the killer was Jose Ramos, a convicted Pennsylvania child molester who knew a woman who had sometimes walked Etan home from school.\nEtan's parents even sued Ramos, winning a wrongful death judgment by default in 2005 when he stopped cooperating with the legal proceedings — though he continued to deny having anything to do with the crime.\nStan Patz sent Ramos annual messages saying, \"What did you do to my little boy?\"\nHernandez wasn't a suspect until 2012. Amid renewed news coverage of the investigation, a brother-in-law came forward and told police that, decades earlier, Hernandez had confessed to a prayer group that he'd killed a child in New York.\nAuthorities would later learn that Hernandez had made similar remarks to a friend and his ex-wife.\nAfter police went to his home in Maple Shade, New Jersey, Hernandez confessed, saying he'd offered Etan a soda to get him into the store basement and then choked him.\n\"Something just took over me,\" Hernandez said in one of a series of recorded confessions to police and prosecutors. He said he'd wanted to tell someone, \"but I didn't know how to do it. I felt so sorry.\"\nHernandez told authorities he'd shoved Etan's body, still living, in a trash bag, then put it in a box and dumped it with some garbage.\nThe boy's body was never found, nor was any trace of his clothing, nor the tote bag loaded with toys that he'd slung over his shoulder when he left his loft. And while prosecutors presented a theory that Hernandez had killed Etan after sexually abusing him, the suspect himself never gave an explanation.\nIn the end, the confessions were enough for the jury. And they were enough for the Patz family, too.\n\"We've finally found some measure of justice for our wonderful little boy, Etan,\" said Stanley Patz, choking up, after the verdict was announced. His wife Julie, who didn't attend the trial except to testify, cried when she heard the verdict.\n\"I am truly relieved,\" Stan Patz said. \"And I'll tell you, it's about time. It's about time.\"\n———\nAssociated Press writers Larry Neumeister and Karen Matthews contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Mystery of Etan Patz's disappearance ends in conviction",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/mystery-etan-patzs-disappearance-ends-conviction-45501695"
}