{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 15:23:12+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Former emergency management employee explains his perspective on how it happened.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fman-triggered-false-missile-alarm-hawaii-speaking-time-52814774.json",
    "image_url": "http://a.abcnews.com/images/GMA/180203_gma_gonzalez_731_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for The man who triggered a false missile alarm in Hawaii is speaking out for the first time\nWe start this half hour with the man would triggered a mass panic in Hawaii now speaking out. He mistakenly sent out a warning of an impending missile attack. Good morning, Marci. He feels so terrible that in the week since he has barely been able to eat or sleep. But he tells us he does not believe the mistake was his fault. For the first time since the widespread panic sparked by that false missile warning that went out across Hawaii, the former emergency management employee who sent out the alert publicly explaining his respective on how it happened. Well, at the time I was 100% sure that it was the right decision. Reporter: Asking we hide his identity he says he had just started his shift when the emergency call came into his office, a preliminary federal investigation said the recorded message began and ended with the words exercise, exercise, exercise. But the former employee says he never heard that. In the middle of the message it said this is not a drill then at the end I didn't hear exercise either because it was just an unannounced drill, unplanned and kind of a spriz thing where, you know, the sup supervisors weren't there. He believed it was are real and followed his training saying it wasn't until moments later he realized the mistake. It was just a body blow for me. It was very, very difficult, very emotional. I felt terrible. We all did our best to try to remedy the situation. Reporter: But it took nearly 40 minutes for the alert to be retracted. The former employee blames what happened on a failure of the system that cost him his job of more than 11 years and led to death threats insisting he is not to blame. There's been problems with the procedures and the equipment and lack of training I think that the military should handle this, not the state. Reporter: A preliminary federal report says the employee who sent out the alert confused drills with real-life situations in the past which he adamantly denies, still he says he has learned a lot from this. Dan and Paula. I think a lot of people are learning a lot from this. Marci, thank you very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "The man who triggered a false missile alarm in Hawaii is speaking out for the first time",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/man-triggered-false-missile-alarm-hawaii-speaking-time-52814774"
}