{
    "authors": [
        "Abc News",
        "Allan Raible"
    ],
    "date_download": "2017-02-15 11:57:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "'Fifty Shades Darker' soundtrack may be better than the film",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Ffifty-shades-darker-soundtrack-thievery-corporation-lupe-fiasco%2Fstory%3Fid%3D45497138.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/HT-fifty-shades-darker-scene-jef-170214_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "ABCNews.com This week \"Fifty Shades Darker\" gets a star-studded soundtrack, chill-masters Thievery Corporation release their first album in four years, Lupe Fiasco releases a new set, Andrew McMahon of Something Corporate and Jack’s Mannequin fame releases a new album, singer-songwriter Jesca Hoop goes a minimalist route and Noveller gives us some semi-ambient soundscapes. It’s quite a week for new music.\nAmazon \"Fifty Shades Darker\" Original Motion Picture Soundtrack ***1/2 The soundtrack for \"Fifty Shades Darker\" may ultimately be better-received than the film itself. It’s obviously a big budget affair with top-tier acts. When you have Taylor Swift and ZAYN next to Halsey, combined with strange, effective but obviously attention-grabbing collaborative combinations like Nick Jonas and Nicki Minaj working together on the same track, it is obvious that this set is fully and intentionally targeted to be a blockbuster. Sia actually returns. She gave us \"Salted Wound\" on the first collection and here she hands in the superior \"Helium.\" Corinne Bailey Rae presents a sweet, softly sweeping version of Coldplay’s \"The Scientist\" while Jose James tackles the Gershwin classic, \"They Can’t Take That Away From Me.\" This is a collection of slick pop by design and sometimes the production touches can be a little heavy-handed. The digital auto-tune bubbles heard over the vocals on The Dream’s \"Code Blue\" sink an otherwise decent track, while the Kygo/Andrew Jackson collaboration, \"Cruise,\" also suffers from some bizarre vocal effects. That being said, mostly this collection is packed with clear high-points from Tove Lo’s \"Lies in the Dark\" and John Legend’s bluesy workout \"One Woman Man.\" Add to that Danny Elfman’s score (for which two tracks appear) and again the planned blockbuster theory gets further cemented. Joseph Angel’s \"Empty Pack of Cigarettes\" has a soulful groove and Toulouse’s \"No Running from Me\" has an oddly affecting funky backbone. The \"Fifty Shades Darker\" soundtrack offers a somewhat decent collection of erotically-tinged pop with a melancholy edge. This isn’t a perfect collection but it has some guts. As attention-getting as the movies and books are, to some the soundtrack may ultimately end up being the most rewarding wing of the franchise. Focus Tracks: \"Not Afraid Anymore\" Halsey This song plays like a perfect follow-up to her \"Badlands\" album. This is the kind of track filled with the dark intrigue that has quickly become her specialty. She may have had a momentary detour into brighter, more populist fare thanks to the Chainsmokers, but this is where Halsey is at her best. \"Lies in the Dark\" Tove Lo Tove Lo has built her career on singing about the tragedy of romance gone wrong combined with a deeply-seeded sense of eroticism, so this track is a perfect addition to this particular soundtrack. \"The Scientist\" Corinne Bailey Rae Corinne Bailey Rae’s gentle reading of this Coldplay standout gives the song some new life. \"I Don’t Wanna Live Forever (Fifty Shades Darker)\" Zayn Malik & Taylor Swift This is a bit of transparent pop-radio bait but this duet works. Part of me wonders how this song would work with just Swift but Malik brings the same kind of energy that he also brought on his solo album last year.\nAmazon Thievery Corporation’s \"The Temple of I & I\" *** Eight studio albums, a few EPs and a large handful of remix and DJ-set collections and Thievery Corporation’s Eric Hilton and Rob Garza continue to do exactly what is expected. \"The Temple of I & I\" is a decently enjoyable mix of dub, reggae and hip-hop-influenced chill music, but it offers very little you wouldn’t expect from the D.C. down-tempo masters. It sticks to the formula well, but it lacks an iconic cut on par with previous standouts \"Sweet Tides,\" \"Lebanese Blonde\" and \"Warning Shots.\" There are flecks of biting political bile on the Racquel Jones-aided tracks \"Letter to the Editor\" and \"Road Block.\" Jones deserves extra credit for name-checking George Orwell’s \"Animal Farm\" in a time when \"1984\" is climbing back up the book charts. Mr. Lif guests on both \"Ghetto Matrix\" and \"Fight to Survive,\" with better results on the latter. But these two tracks aren’t nearly as strong as Lif’s previous collaboration with the duo, \"Culture of Fear.\" Former Bitter:Sweet vocalist Shana Halligan returns after collaborating on their last album four years ago and does some nice work on \"Love Has No Heart,\" while longtime frequent guest vocalist Loulou Ghelichkhani appears on \"Time + Space.\" Elsewhere Notch adds an effective reggae energy to several tracks. \"The Temple of I & I\" feels like it is playing and coasting on the duo’s signature. As an album it finds Hilton and Garza running in place. However, the semi-instrumental meditation \"Let the Chalice Blaze\" is undeniably fresh and there are a few other brief glimpses of slight movement. Longtime fans will find elements to enjoy but while this is a good record, it could be stronger. Focus Tracks: \"Lose to Find\" (Featuring Elin Melgarejo) Elin Melgarejo has also served as a guest vocalist before and here she adds a nicely chilled track with a strong appeal. \"Let The Chalice Blaze\" This nearly instrumental cut sets the perfect tone, anchored by a strong, funky bass-line. \"Fight to Survive\" (Featuring Mr. Lif) Mr. Lif combines lyrical skill with a call to arms. This feels like a potent political anthem.\nAmazon Lupe Fiasco’s \"Drogas Light\" ** Lupe Fiasco has nearly lost his way on “Drogas Light,\" his sixth studio album. This is an uneven collection full of mostly disappointment. Much of the first half of the album is full of trap, electro and pop-influenced tracks where instead of finding real hooks, he mostly ends up repeating words over and over and over again. See the intro \"Dopamine Lit\" or \"Promise\" for examples. Fiasco has always been outspoken, so you would think during these turbulent political times he’d offer up something more substantial. He aims for something with \"Made in the U.S.A.\" but surprisingly misses his target with a rather basic flow that suffers again from his repetitive style. It doesn’t help that it kind of sounds like he’s shouting \"Me in a onesie!\" when he’s repeating the title. One issue that has always been a problem for Fiasco is his need to give many of his songs a pop core. He often leans on guest-vocalists. Ty Dolla $ign and Victoria Monet do a decent job on the chilled strip-club themed \"Kill,\" but ultimately the seven-minute groove gets a tad boring. Fiasco is utterly determined to have a pop drive to his records. On \"Pick Up the Phone\" featuring Eric Turner, he almost succeeds with this formula even if Turner’s anthemic-minded delivery seems at odds with Fiasco’s lyrically-focused flow. It works better than the pop-minded disco-funk experiment \"It’s Not Design,\" featuring Salim. Fiasco aims for the easy gimmicks to try to make his albums as marketable as possible to the pop market. It’s like he wants to be a singular, outspoken force but sells a part out where it actually counts. Lupe Fiasco would benefit from doing a straight-forward hip-hop record with the focus on pure, tight lyricism. I’ve championed this before, but again I say go back to his \"Enemy of the State: A Love Story\" mixtape and listen to the rapid-fire bars he dropped over Radiohead’s \"The National Anthem.\" I wish he’d explore that side of himself more often. You can hear hints of greatness on this album’s \"Jump,\" but other than that, this set, like more than a few of his proper releases, continues to show him wasting his potential. \"Drogas Light\" has a couple spare moments of light but mostly it comes off as the work of an MC who is woefully unaware of his own strengths. Too often Lupe Fiasco is mistaking repetition for actual substance. Focus Tracks: \"Jump\" (Featuring Gizzle) This is one of the only places where Lupe Fiasco really delivers, thanks to the combination of a semi-chaotic vocal-infused beat and the fact that he’s actually working a decent flow with full force. \"Pick Up The Phone\" (Featuring Eric Turner) Again, this track has a bit of a lopsided logic but against the odds it works even if Turner’s extremely \"un-hip-hop\" contribution.\nAmazon Andrew McMahon in the Wilderness’ \"Zombies on Broadway\" ***1/2 Andrew McMahon deserves a special place in history. More than a decade ago with his band Something Corporate he brought a unique brand of piano-led song-craft to the \"pop-punk\" world. He continued to hone his craft on albums with his outfit Jack’s Mannequin, to both critical and fan acclaim. \"Zombies on Broadway\" is McMahon’s second proper full-length as Andrew McMahon in the Wilderness, an outfit which aims to re-purpose his songwriting skills to more traditional pop fare. This album sounds like it would fit well with music played on your average top forty station. Give \"Don’t Speak for Me (True)\" a listen and you’ll hear it is an ace example of both modern-pop at its best and McMahon’s general strengths as a songwriter. He manages to not sell out his creative ideals as a writer while working firmly in the system, partly because he’s an excellent storyteller. Sure, he occasionally drifts a little too close to the sun. \"Walking in My Sleep\" gets a tad repetitive and \"Fire Escape\" gets a little too saccharine with its forced whoa-oohs, taking it a little too close to OneRepublic, Imagine Dragons and Bastille-territory. But McMahon’s intelligent lyrics and narrative style always puts him a notch (or ten) above your average pop songwriter. He is aiming for the charts, yes, but he won’t sacrifice the ability to tell a good story along the way. It’s a delicate balance. While this fits the formula, it isn’t dumbed-down. Like Tegan and Sara did with 2013’s \"Heartthrob,\" McMahon succeeds in a full-pop makeover without losing the solid songwriting core. This is definitely more pop-y in nature but it keeps that integrity that made the Something Corporate and Jack’s Mannequin records so enjoyable. If Andrew McMahon in the Wilderness’ 2014 self-titled album found McMahon dabbling in pop, \"Zombies on Broadway\" is the sound of him diving squarely into the deep end. At its essence, this is an intelligent and highly driven pop record that should definitely get a much larger mainstream audience than his past work. Focus Tracks: \"Don’t Speak for Me (True)\" This has a sonic hook that sticks with you, sort of in the vein of that sped-up vocal refrain on Justin Bieber’s \"Sorry.\" It also finds McMahon delivering a truly heartfelt track. It’s a pretty powerful ballad with a strong sense of melodic fortitude. \"Love and Great Buildings\" It is kind of strange to compare your love to an apartment building, but that’s what McMahon does here. In some ways you could imagine this song given more of a rock core and placed on a Something Corporate album. It fits a vintage mold for him. \"Brooklyn, You’re Killing Me\" This half-spoken, beat-driven song kind of sounds like his attempt at an LCD Soundsystem song while perfectly encapsulating the struggles of a west coast kid who has relocated to New York.\nAmazon Jesca Hoop’s \"Memories are Now\" **** A year after her collaborative album with Iron & Wine’s Sam Beam, Jesca Hoop makes her solo Sub Pop debut with her fourth solo record, \"Memories Are Now.\" This album isn’t quite as ear-catching as 2012’s monumental \"The House That Jack Built,\" instead focusing on a subtler, minimalist approach that requires more careful attention. No doubt, Hoop sonically scaled back on this record on purpose, considering that the battle between humanity and technology is a recurring lyrical theme on songs like the drone-centric \"Animal Kingdom Chaotic\" and \"Simon Says,\" where she sings, \"www don’t forget life before the internet when streets were run by sharks and jets and children running wild.\" This trend obviously continues on “Cut Connection.” Hoop maintains her distinct, uniquely quirky style. In all truth, her music is so singular in nature that she should be afforded the same kind of rabid fan-base as artists like Fiona Apple, Regina Spektor and Tori Amos have earned in the past. She’s a trendsetter and an obvious ground-breaker. Even her plucked, often staccato-style of guitar-playing is distinctly hers and worthy of a high level of attention. Listening to older songs like \"Bed across the Sea\" or \"Pack Animal\" will show you that this aspect of her sound is nothing new. She has her own sense of pace. This set was recorded with Blake Mills who has built his name as a producer for his work with Fiona Apple, The Alabama Shakes and others. Mills most recently helmed John Legend’s \"Darkness and Light.\" \"Memories Are Now\" is a moving, often quiet, often rhythmic and never dull set that pushes Jesca Hoop’s style forward, showcasing her natural talent with stunning effectiveness. If her more experimental side is too much for you, but you still appreciate a well-written song, the delicate \"Pegasi\" should be a slowly-blooming favorite. Jesca Hoop remains a commanding force who belongs in indie-rock’s top-tier of singer-songwriters. Focus Tracks: \"Memories are Now\" This bare-bones title-track would be an odd single for someone else but it isn’t for Hoop. This stripped-down, bass-heavy lament allows Hoop the space to harmonize with her own voice in a variety of layers. \"Pegasi\" This is Hoop working at her most straight-forward. It has a nearly classical sense of melody that has an effortless sense of beauty. Of course she would give a song like this an eye-catching title like \"Pegasi.\" \"Animal Kingdom Chaotic\" This is a call-and-response, old-school style folk-song. That is if they made old-school folk songs about the fear of drone-strikes and computers going rogue \"2001\"-style.",
    "source_domain": "abcnews.go.com",
    "title": "'Fifty Shades Darker' soundtrack, Thievery Corporation, Lupe Fiasco music reviews",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/fifty-shades-darker-soundtrack-thievery-corporation-lupe-fiasco/story?id=45497138"
}