{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:32:36+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Flatest-virginia-house-approves-medicaid-expansion-55548243.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_a7b405ce20244af29d21e7c65d4503e0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on Virginia passage of Medicaid expansion plan after years of gridlock (all times local):\n8:05 p.m.\nThe Republican-controlled Virginia General Assembly has given final approval to a state budget expanding Medicaid coverage to the state's poor.\nThe House of Delegates voted Wednesday shortly after the state Senate voted in favor of expansion. Several Republicans in both chambers joined with Democrats to support Medicaid expansion after years of partisan battle on the issue.\nThe House had previously endorsed expansion, while the Senate had held out in opposition until Wednesday.\nDemocratic Gov. Ralph Northam is expected to sign the budget in coming days. Expanding Medicaid was a key provision of then-President Barack Obama's health care overhaul.\nA tally from the Kaiser Family Foundation shows Virginia will become the 33rd state to approve Medicaid expansion.\n7:05 p.m.\nThe Virginia Senate has voted to expand Medicaid, ending years of partisan gridlock on whether to widen coverage under the health care program for poor people.\nThe Senate on Wednesday approved a state budget that would expand Medicaid eligibility to about 400,000 low-income adults.\nA tally from the Kaiser Family Foundation shows Virginia will become the 33rd state to approve Medicaid expansion. Expanding Medicaid was a key provision of the Affordable Care Act pushed by former President Barack Obama.\nVirginia Democrats have pushed unsuccessfully for years to expand it. Several state Republicans dropped their opposition this year, saying Virginia would be better off with increased federal funding for the program.\nThe budget still needs final approval House and from Democratic Gov. Ralph Northam. That's expected to happen with little difficulty.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Virginia House approves Medicaid expansion",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/wireStory/latest-virginia-house-approves-medicaid-expansion-55548243"
}