{
    "authors": [
        "Abc News",
        "Emily Shapiro",
        "More Tara",
        "More Emily"
    ],
    "date_download": "2017-12-12 01:04:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The 27-year-old suspect, Akayed Ullah, is in the hospital.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fnyc-terror-suspects-family-heartbroken-attack%2Fstory%3Fid%3D51727576.json",
    "image_url": "http://a.abcnews.com/images/US/port-authority-explosion9-gty12-ht-mem-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The family of the man accused of detonating an explosive in the New York City subway system this morning said they are \"heartbroken\" by the allegations.\nInterested in New York? Add New York as an interest to stay up to date on the latest New York news, video, and analysis from ABC News. Add Interest\nThe explosion occurred in an underground passageway near the Port Authority Bus Terminal, sending commuters scrambling to evacuate a major transit hub just blocks from Times Square. Despite the rush-hour crowds, only five people suffered minor injuries, officials said.\nThe 27-year-old suspect, Akayed Ullah, is in the hospital, badly injured in the arm and torso from the device that went off in his arms, law enforcement sources said.\nTLC\n\"We are heartbroken by the violence that was targeted at our city today, and by the allegations being made against a member of our family,\" the family said in a statement, which was read in front of the Ullah family's home in Brooklyn by Albert Fox Cahn, legal director for Council on American-Islamic Relations-New York.\n\"But we are also outraged by the behavior of law enforcement officials who have held children as small as 4 years old out in the cold and who held a teenager out of high school classes to interrogate him without a lawyer, without his parents,\" the statement continued. \"These are not the sorts of actions that we expect from our justice system, and we have every confidence that our justice system will find the truth behind this attack and that we will, in the end, be able to learn what occurred today.\"\nIt's not clear who the children and the teenager referred to in the statement are.\nMike Segar/Reuters\nUllah, originally from Bangladesh, told authorities he is self-inspired from ISIS online propaganda, sources said. Ullah told authorities no one directed him to carry out the attack and he talked about the plight of Muslims over the years, a law enforcement source said.\nxposedmagazine/Twitter\nUllah entered the United States from Bangladesh seven years ago on a family-based visa and has an address in Brooklyn, sources said. The explosive was assembled in his apartment, sources said.\nVideo of the incident, shot by a surveillance camera, shows commuters walking in the passageway when the explosion erupts. The camera screen filled with smoke as people scattered.\nChristina Bethea, 29, told ABC News she was in the passageway on her way to work next to the terminal when she heard a bang, saw smoke and ran.\n\"If I didn’t believe in God, I believe in God today,\" she said, adding that she commuted from Yonkers, New York.",
    "source_domain": "abcnews.go.com",
    "title": "NYC terror suspect's family 'heartbroken' by attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/nyc-terror-suspects-family-heartbroken-attack/story?id=51727576"
}