{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 01:22:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "N. Korea leader gets plans for missile tests near Guam",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fkorea-leader-briefed-plans-missile-tests-guam-49216706.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_df5849968a044ef5a05e1954dd36c4f3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "North Korea said Tuesday that its military presented leader Kim Jong Un with plans to launch intermediate-range missiles into waters near Guam and \"wring the windpipes of the Yankees\" by creating \"enveloping fire\" near the key U.S. military hub in the Pacific.\nThe comments, while typically belligerent, are significant because they also appeared to signal a path to defuse a deepening crisis with Washington over a weapons program that is seen as nearing the ability to accurately send a nuclear missile to the U.S. mainland.\nDuring an inspection of the army's Strategic Forces, which handles the missile program, Kim praised the military for drawing up a \"close and careful plan\" and said he would watch the \"foolish and stupid conduct of the Yankees\" a little more before deciding whether to order the missile test, the North's state-run Korean Central News Agency said. Kim appeared in photos sitting at a table with a large map marked by a straight line between what appeared to be northeastern North Korea and Guam, and passing over Japan — apparently showing the missiles' flight route.\nThe missile plans were previously announced, and Kim said North Korea would conduct the launches if the \"Yankees persist in their extremely dangerous reckless actions on the Korean Peninsula and its vicinity\" and that the United States should \"think reasonably and judge properly\" to avoid shaming itself, the news agency said.\nLobbing missiles toward Guam would be a deeply provocative act from the U.S. perspective, and a miscalculation on either side could lead to a military clash. U.S. Defense Secretary Jim Mattis said the United Sates would take out any such missile seen to be heading for American soil and declared any such North Korean attack could mean war.\nKim's comments, however, with their conditional tone, seemed to hold out the possibility that friction could ease if the United States made some sort of gesture that Pyongyang considered a move to back away from previous \"extremely dangerous reckless actions.\" This might be difficult as the United States and its ally South Korea plan next week to start annual defensive military drills that the North claims are preparation for invasion.\nOn Monday, the chairman of the U.S. Joint Chiefs of Staff met with senior South Korean military and political officials and the local media. Marine Corps Gen. Joseph Dunford also made comments that appeared to be an attempt to ease anxiety over tit-for-tat threats between President Donald Trump and North Korea while also showing a willingness to back up Trump's warnings if need be.\nDunford said the United States wants to peacefully resolve tensions with North Korea. But Washington is also ready to use the \"full range\" of its military capabilities in case of provocation, Dunford said.\nDunford is visiting South Korea, Japan and China after a week in which Trump declared the U.S. military \"locked and loaded\" and said he was ready to unleash \"fire and fury\" if North Korea continued to threaten the United States.\nThe Korean People's Army's Strategic Forces said last week that it would finalize and send to Kim for approval the plan to fire four ballistic missiles near Guam, which is about 3,200 kilometers (2,000 miles) from Pyongyang.\nThe plans are based on the Hwasong-12, a new missile the country successfully flight-tested for the first time in May. The liquid-fuel missile is designed to be fired from road mobile launchers and has been previously described by North Korea as built for attacking Alaska and Hawaii.\nThe North followed the May launch with two flight tests of its Hwasong-14 ICBM last month. Analysts said that a wide swath of the continental United States, including Los Angeles and Chicago, could be within reach of those missiles, once they're perfected.\nThe North's latest report said Kim ordered his military to be prepared to launch the missiles toward Guam at any time. If the \"planned fire of power demonstration\" is carried out because of U.S. recklessness, Kim said it will be \"the most delightful historic moment when the Hwasong artillerymen will wring the windpipes of the Yankees and point daggers at their necks,\" the North reported.\nNorth Korea is angry about new United Nations sanctions over its expanding nuclear weapons and missile program and the upcoming military drills between Washington and Seoul.\nKim said that the United States must \"make a proper option first and show it through action, as it committed provocations after introducing huge nuclear strategic equipment into the vicinity of the peninsula\" and that it \"should stop at once arrogant provocations\" against North Korea, state media said.\nSouth Korean President Moon Jae-in on Monday called for a peaceful solution to the nuclear standoff, saying that \"there must not be another war on the Korean Peninsula,\" according to his office.\nIn a meeting with top aides at the presidential Blue House, Moon said South Korea would work to safeguard peace on the peninsula in cooperation with the United States and other countries. Moon said North Korea must stop issuing menacing statements and provocations.\n———\nAP writers Hyung-jin Kim in Seoul and Bob Burns in Washington contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "N. Korea leader gets plans for missile tests near Guam",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/korea-leader-briefed-plans-missile-tests-guam-49216706"
}