{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:14:27+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "In an interview with ABC News' George Stephanopoulos, the former FBI director said Trump pushed back against allegations, saying, \"Another reason you know it's not true is I'm a germaphobe.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fcomey-trump-called-discuss-moscow-trip-mentioned-steele-54688936.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_vod_orig_comey_missuniverse_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Comey: Trump called me to discuss Moscow trip mentioned in 'Steele dossier'\nWell as feed publishes the entire. Steel dossier as you all had feared it would happen and that's when you get. Your first phone call from president yes that's right so the following week he as you said that the media publishing tire thing. And president trump called me in my office at the FBI. And he was very upset about. The leak of this material. And wanted to express his concern about it and I explained to him that it wasn't. It wasn't government material and in prepared for private parties. FBI and paid for the FBI and commissioned it. And it was all over Washington. And as you remember sir as we told you the media has this and his close to reporting it so we shouldn't think of it as a leak of of classmen information wasn't classified. And it there wasn't government information. And any launched into. I didn't ask about. This is with the process but he launched into an explanation as to how. I should know that wasn't true. And that he remembered now talking to friends who have been Wear them. That he never stayed overnight at the hotel just change clothes there went to the miss universe pageant and this is true but this is what he said. And then went right back without staying overnight. And then he said another reason you know it's not true is on the German phone there's no way I'd let people PR each other around me. And that caught me so much by surprise actually let out an audible laugh. And 'cause it was just one of those I was startled by it. And in a river thinking well should I say. That desires to any activity sir doesn't require an overnight stay and given that it was allegedly the presidential suite. At the Ritz Carlton I would imagine you could be a safe distance from the activity always things are bounce around my head. But instead of saying it it just led me to think the world go crazy I'm the director of the FBI. And I'm standing in my window. Looking out on the dark in Pennsylvania Avenue. And I remember this movement like it was yesterday. And I can see the lit in Washington monument it's rising for my management the FBI just over the from new trump hotel. And it just never thinking. Everything's gone Matt. And then having finished his explanation which hadn't asked for he hung up and it went to find my chief of staff to tellem the world brokers. And in fact he did stay overnight in Moscow. I don't know but but again. Eight I don't know those facts but he told me he did not.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Comey: Trump called me to discuss Moscow trip mentioned in 'Steele dossier'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/comey-trump-called-discuss-moscow-trip-mentioned-steele-54688936"
}