{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:44:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "The White House was informed Jan. 26 of the nature of calls between National Security Adviser Michael Flynn and Russia's ambassador.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fflynn-forced-resign-trump-administration-calls-erosion-trust-45498663.json",
    "image_url": "http://a.abcnews.com/images/WNT/170214_wn_karl_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Flynn forced to resign after what the Trump administration calls an erosion of trust\nGood evening, and it's great to have you with us here on a Tuesday night, and we begin with a major shakeup inside the trump white house. National security adviser Michael Flynn forced to resign after what the administration is calling an erosion of trust. That issue, Flynn's call with the Russian ambassador on the same day president Obama was improposing new sanctions on Russia because of their meddling in the U.S. Election. At first, Flynn denied talking about sanctions, and Mike pence went on national TV to back him up, but FBI agents listened to the calls and heard differently, and the U.S. Justice department all righted the white house the this 17 days ago. We begin with Jonathan Karl. Reporter: A surprising revelation from the white house today -- the president has known for nearly three weeks that national security advisor Michael Flynn deceived the vice president and the public about his conversations with the Russian ambassador to the U.S. Yet it wasn't until last night that the president fired him. A level of trust between the president and general Flynn had eroded to the point where he felt he had to make a change. Reporter: The story begins on December 29th, when president Obama sanctioned Russia for meddling in the election. That same day, less than two hours after sanctions were imposed, Flynn spoke with the Russian ambassador. But Flynn insisted to pence and others he did not discuss sanctions, a claim pence then repeated on national TV. Those conversations that happened to occur around the time that the United States took action to expel diplomats had nothing whatsoever to do with those sanctions. Reporter: But on January 26th, the justice department told white house counsel don mcgahn, who immediately told the president that Flynn wasn't telling the truth. Intelligence agents had been listening in on the ambassador's calls and had discovered that sanctions were discussed. Justice officials believed Russia could blackmail Flynn by threatening to expose his lie. Why would the president, if he was notified 17 days ago that Flynn has misled the vice president, other officials here, and that he was a potential threat to blackmail by the Russians -- why would he be kept on for almost three weeks? Well that's not -- that's -- assumes a lot of things that are not true. The president was informed of this, he asked the white house counsel to review the situation. The first part of it was clearly to understand the legal aspect of this. And that was simply concluded, there was no legal aspect. And then what happened, the president evaluated the trust aspect. Reporter: Flynn was not fired right away. In fact, two days after learning of his deception, the president had Flynn by his side for a phone call with Russian president Vladimir Putin. It wasn't until Friday after \"The Washington post\" broke the story Flynn had discussed sanctions that Flynn changed his story, and apologized to the vice president for misleading him. On air force one that night, the president was pressed by reporters. What do you think of reports about talking to the Russians about sanctions mean? I don't know about the reports. I haven't seen it. What story was that? Reporter: As the story escalated, radio silence from the president, who ignored questions about Flynn. Finally this late yet. General Flynn does enjoy the full confidence of the president. Reporter: About six hours later, Flynn was out. But today, more mixed messages. This morning, Conway said Flynn resigned. This afternoon press secretary Sean spicer said he was fired. The evolving and eroding level of trust as a result of this situation and a series of other questionable instances is what led the president to ask for general Flynn's resignation. Reporter: Flynn, a retired three-star general, was one of candidate Donald Trump's most influential and fervent advisers, firing up the Republican convention with his blistering attacks on Hillary Clinton. Lock her up! Lock her up! Lock her up. That's right. Yep. That's right. Lock her up. Reporter: He's been criticized for his close ties to Russia. This 2015 picture showing him sitting alongside Putin. Still, president trump has explicitly denied that anyone on his team was in touch with the Russians during the campaign. Can you still say that nobody in the trump campaign, not even general Flynn, had any contact with the Russians before the election? My understanding is that what general Flynn has now expressed is that during the transition period -- well, we were very clear that during the transition period, he did speak with the ambassador -- Reporter: I'm talking about during the campaign. I don't have any -- there's nothing that would conclude me that anything different has changed with respect to that time period. Reporter: For months, the president has raised eyebrows with his effusive praise of Vladimir Putin. Put season a killer. A lot of killers, you got a lot of killers. You think our country is so innocent? Reporter: But today, the press secretary said this -- The irony of this entire situation is that the president has been incredibly tough on Jon Karl with us there. You reported there knew for 17 days that sanctions came up with that conversation between Michael Flynn and the Russian ambassador. We saw vice president pence defend Flynn on national TV, but when did the vice president find out? Reporter: David, tonight, we have learned that nobody at the white house, not the white house counsel, not the president told vice president pence about that until the story broke late last week in \"The Washington post,\" and he read it in the newspaper. He read it himself in the paper. Jon Karl, leading us off. Thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Flynn forced to resign after what the Trump administration calls an erosion of trust",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/flynn-forced-resign-trump-administration-calls-erosion-trust-45498663"
}