{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 14:51:12+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-senator-moscow-meddle-2018-election-56362947.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_02a33fe51a774878b369d09c07796640_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\nVisiting U.S. senators on Wednesday urged Russia not to meddle in the U.S. midterm election in November if it wants to improve strained bilateral ties.\nThe senators were in Russia as part of a congressional visit taking place two weeks ahead of a summit between the nations' presidents in Helsinki.\nSen. John Thune, a South Dakota Republican, called for a \"change in behavior\" on the part of Moscow.\n\"The best way to demonstrate this as we head into the 2018 election is to show the American people and our congress and our administration that the Russians have no intention of messing or playing with the American election,\" Thune told The Associated Press in an interview.\nRichard Shelby, a senator from Alabama who heads the delegation, brought up the topic of alleged Russian interference in the 2016 U.S. presidential election.\n\"I think it's a given in the United States, in both parties, that Russia tried to meddle and probably did meddle in the election,\" Shelby told the AP.\nSenator Jerry Moran from Kansas said all Russian officials they spoke to denied that. \"It was simply a denial on their part that it occurred.\"\nShelby added, however, that despite deep disagreements, the meeting was a useful step in improving ties.\n\"We also told them that even though our relationship is strained, it would be better for the world for us to be competitors, always, rather than adversaries. But we'll have to see what happens.\"\nRussia-U.S. ties have been bitterly strained by the fighting in Ukraine, the Syrian war and allegations of election meddling.",
    "source_domain": "abcnews.go.com",
    "title": "US senator: Moscow must not meddle in the 2018 election",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/us-senator-moscow-meddle-2018-election-56362947"
}