{
    "authors": [
        "Abc News",
        "Monis Khan",
        "Osman Noor",
        "More Janet"
    ],
    "date_download": "2017-02-15 10:26:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Meet US Curling’s most improbable honorary captain: NFL star Vernon Davis",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmeet-us-curlings-improbable-honorary-captain-nfl-star%2Fstory%3Fid%3D45468254.json",
    "image_url": "http://a.abcnews.com/images/Sports/HT-vernon-davis-jef-170213_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "At 6'4 and 250 lbs, Washington Redskins tight end, Vernon Davis, is not a typical curling player or fan.\nWell, the word 'fan' may actually be an understatement. In 2010, Davis was awarded the title of \"honorary captain\" of Team USA Curling and has attended every winter Olympics since. He says he plans to attend the 2018 Games in South Korea too.\n\"I love the sport of curling because it's just you and the stone and the broom,\" Davis told ABC News and ESPN's Undefeated in a joint video interview. \"You have to have a still mind, a calm mind. Just like anything else, like when it comes to football. The mindset has to be still.\"\nAs the story goes, back in 2009, a football reporter covering the San Francisco 49'ers, for whom Davis was playing at the time, dared Davis to give the winter sport a try.\n\"I was like, 'Curling? What is that?'\" he said. \"[The reporter] was like 'Just come on out, you'll love it, you'll love it.' So I went out on the ice and I was probably on the ice for maybe an hour and a half, and I fell in love with it.\"\nA few months later, Team USA invited Davis to join them as their ceremonial captain to \"give them encouragement and support,\" Terry Davis, the director of communications for USA Curling told ABC News and ESPN’s Undefeated. \"Vernon also took part in media opportunities at both [2010 and 2014] Games to help curling gain more exposure.\"\nIn addition to bringing general awareness to the sport, the African American two-time Pro Bowler said he also hopes his role as honorary captain can help attract more African Americans to the pastime. \"Right now, I feel like a lot of African Americans don't really know too much about the game of curling. But it can be different... and that can change through promoting,\" he said.\n\"I'm an art studio major so I'm all about doing something different and just trying to see what else is out there, exploring, and just thinking outside the box and opening up my mind.\"\nThis is a joint project between ABC News and ESPN's The Undefeated.",
    "source_domain": "abcnews.go.com",
    "title": "Meet US Curling’s most improbable honorary captain: NFL star Vernon Davis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/meet-us-curlings-improbable-honorary-captain-nfl-star/story?id=45468254"
}