{
    "authors": [
        "Abc News",
        "More Kelly"
    ],
    "date_download": "2018-05-30 15:06:45+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Sutton Foster talks to \"GMA\" about adoption and being a mother.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fyounger-star-sutton-foster-shares-adorable-moment-mother%2Fstory%3Fid%3D55529704.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/ht_sutton_foster_kab_150608_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sutton Foster may play a 20-something who works in publishing on the hit TV show \"Younger,\" but the actress and singer said she relishes her real-life role as a mother.\nTV Land\n\"I was a mess in my 20's,\" Foster told \"GMA\" laughing about not wanting to relive them like her on-screen persona Liza Miller does. \"I feel like my life has only gotten better every decade.\"\nFoster, 43, and her husband, Ted Griffin, recently adopted their first child, a 15-month-old daughter named Emily Dale.\n\"We adopted her last year right before season four started,\" she explained. \"I have all this extra anxiety so I started crocheting baby blankets and made my New Year's resolution to make 10 baby blankets -- and I'll auction them off for an adoption charity so I can help other families be able to share in the joy of adoption because it's changed our lives.\"\nThe two-time Tony Award winner said her daughter also inspired some of the songs on her new album, \"Take me to the World.\"\n\"It's been a long time in the making and [it's] totally inspired by becoming a mom,\" she said. \"This is all for her, all the songs are sort of inspired by her.\"\nFoster said that one of the lullabies she created for the album prompted a precious reaction from her daughter.\n\"The very first time I played it for my daughter she looked at the speaker and looked at me and looked at the speaker [again] and looked at me and she crawled into my lap and put her forehead against my forehead, I am not kidding,\" Foster said. \"And I was like, 'What's happening?'\"\n\"I don't know if she realizes that mommy's voice comes from the speaker and I know someday she's going to be like 'don't sing, don't sing,' but not now,\" she said with a laugh.",
    "source_domain": "abcnews.go.com",
    "title": "'Younger' star Sutton Foster shares adorable moment mother-daughter moment",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/younger-star-sutton-foster-shares-adorable-moment-mother/story?id=55529704"
}