{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2018-04-24 22:36:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "\"Avengers: Infinity War\" is out later this week and on the heels of global phenomenon \"Black Panther.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Favengers-infinity-war-burning-questions-film%2Fstory%3Fid%3D54694058.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/avengers-infinity-war-04-ht-jc-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The latest film in the Marvel Cinematic Universe, \"Avengers: Infinity War,\" will be released later this week on the heels of the global blockbuster, \"Black Panther,\" adding another flick to the superhero franchise. But unlike \"Panther,\" this film is the culmination of 10 years of earlier films and there are five times as many characters to keep track of.\nHere's a quick list of basic questions most Marvel novices are asking, along with much-needed answers if you plan on checking out the film this weekend.\n1 - Who is Thanos?\nGood question, this big baddie has been teased for about five years now. Basically, he's one of the deadliest villains in the Marvel Universe and a demigod.\nIn \"Infinity Gauntlet,\" which this film is loosely based on, Thanos covets death as a partner and soulmate and goes on a quest to wipe out half the galaxy to impress her. We don't quite know his plan in this film or why precisely he wants to hatch it, but it's certainly for nefarious reasons.\n2 - What are the Infinity Stones?\nAnother excellent query. If Thanos is able to collect all six stones and unite them with his gauntlet, he'll have infinite power.\nAs we've seen in \"Guardians of the Galaxy,\" just one stone by itself can destroy planets. Imagine six united.\nMarvel Studios\n3 - What movies do I need to see before this one?\nOK, this is a tough one.\nMarvel Studios\nStart with \"Black Panther\" because it was most recently released. Also, check out earlier films like \"Iron Man,\" \"Guardians\" and the latest \"Thor,\" which is titled \"Ragnarok\" and also feeds into this one. There are 18 movies in all, and if you haven't watched yet, don't stress.\n\"GMA\" will also have full recaps for you later this week if you want to read about them in 15 minutes or less! So, check back in!\n4 - Are a lot of characters going to die?\nThat remains to be seen, but it's a safe bet.\nMarvel Studios\nIn the books, half the Marvel Universe got wiped out when Thanos got his stones. This may not happen, but with Marvel moving into its next phase, the heroes that began this journey 10 years ago like Chris Evans and Robert Downey Jr. will start passing off the torch to younger superheroes like Tom Holland and Chadwick Boseman.\nBut, yes, bring tissues.\n5 - Can we expect any romance?\nSurprisingly, that's a big yes too.\nWe've already seen in the trailers that it looks like Vision (Paul Bettany) is in a relationship with Scarlet Witch (Elizabeth Olsen).\nAlso, Black Widow (Scarlett Johansson) and Bruce Banner (Mark Ruffalo) are set to reunite and they had a thing going on in the last \"Avengers\" film.\nFinally, there's Gamora (Zoe Saldana) and Star-Lord (Chris Pratt). They've always had this \"will they, won't they\" kind of thing happening.\nEven with a Mad Titan breathing down our favorite heroes' backs, there's always time for love.\n6 - What makes an Avenger?\nThe Avengers are Earth's mightiest heroes. Basically, if they have honor and work with the government in the best interest of the people, they can be one. Oh, and the superpowers also help.\nMarvel Studios\nThe group is always changing and it's original members included Iron Man, Captain America, Black Widow, The Hulk and more.\nNew Avengers include Vision, Scarlet Witch and War Machine.\n\"Infinity War\" is out nationwide on Friday.\nABC News and Marvel are both part of parent company Disney.",
    "source_domain": "abcnews.go.com",
    "title": "'Avengers: Infinity War': 6 burning questions about the film",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/avengers-infinity-war-burning-questions-film/story?id=54694058"
}