{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 21:15:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "The Latest: US: Nobel Peace choice doesn't change US stance",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-us-nobel-peace-choice-change-us-stance-50332657.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_07302658c61d45cc82239bad3d720060_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the Nobel Peace Prize (all times local):\n9:35 p.m.\nThe United States has issued a statement saying that \"no state possessing nuclear weapons or which depends upon such weapons for its security supports\" a U.N. treaty to prohibit nuclear weapons.\nThe statement came after the 2017 Nobel Peace Prize was awarded Friday to the International Campaign to Abolish Nuclear Weapons.\nIn its statement, the U.S. said \"today's announcement does not change the U.S. position on the treaty: the United States does not support and will not sign the treaty.\"\nThe U.S. said it is \"seeing a deterioration in the overall security environment and growing nuclear capabilities of certain states. This treaty will not make the world more peaceful, will not result in the elimination of a single nuclear weapon, and will not enhance any state's security.\"\nIt said the treaty \"risks undermining existing efforts to address global proliferation and security challenges.\" It promised to work with other nations to improve international security, counter nuclear proliferation and reduce nuclear dangers.\n———\n8:50 p.m.\nU.N. Secretary-General Antonio Guterres has tweeted his congratulations to the International Campaign to Abolish Nuclear Weapons, saying: \"Now more than ever we need a world without nuclear weapons.\"\nHis spokesman Stephane Dujarric said Friday that \"events over the past months have reminded us of the catastrophic risk that nuclear weapons pose to humanity.\"\nThis was a clear reference to North Korea's increasingly sophisticated nuclear and ballistic missile tests and the threatening exchanges between U.S. President Donald Trump and the North's leader, Kim Jong Un.\nDujarric says \"at a time when nuclear anxieties are at the highest level since the Cold War, the secretary-general calls on all countries to show vision and greater commitment for a world free of nuclear weapons.\"\n———\n2:50 p.m.\nFormer Soviet Union leader Mikhail Gorbachev has hailed the awarding of the Nobel Peace Prize to a group campaigning against nuclear weapons, saying it reinforces the position that he and Ronald Reagan took at the Reykjavik summit a generation ago.\nGorbachev, who has himself campaigned against nuclear weapons since leaving office in 1991, said he was \"very worried that military doctrines again allow the use of nuclear weapons.\nHe added in a statement: \"I would like to remind about a joint statement we signed with Ronald Reagan: A nuclear war can't be won and must never be fought.\"\nAlthough the 1986 Reykjavik meeting collapsed at the last minute, it led to the 1987 Intermediate-Range Nuclear Forces treaty that banned all land-based cruise and ballistic missiles with a range between 500 and 5,500 kilometers (310 and 3,410 miles).\n———\n2:10 p.m.\nTwo days before her organization won the Nobel Peace Prize, Beatrice Fihn, sent a tweet that turned awkward: \"Donald Trump is a moron.\"\nThe executive director of the International Campaign to Abolish Nuclear Weapons told a news conference after the prize announcement that she was trying to make a joke, \"which I kind of regret now,\" based on reports that U.S. Secretary of State Rex Tillerson had said the same of Trump.\nBut, she added, \"I think that the election of President Donald Trump has made a lot of people very uncomfortable with the fact that he alone can authorize the use of nuclear weapons.\"\n———\n12:45 p.m.\nThe European Union's foreign policy chief welcomed the awarding of this year's Nobel Peace Prize to the International Campaign to Abolish Nuclear Weapons.\nFederica Mogherini said on Twitter Friday: \"We share a strong commitment to achieving the objective of a world free from nuclear weapons.\"\nTwo European Union members — France and Britain — are nuclear powers.\nMogherini and her predecessor, Catherine Ashton, were heavily involved in brokering a deal to contain Iran's nuclear program.\n———\n12:40 p.m.\nIn Japan, the only country to suffer an atomic bombing in the closing days of World War II, this year's Nobel Peace Prize resonated with many.\nSunao Tsuboi, a 92-year-old survivor of the Hiroshima bombing, said he was overjoyed to hear of the Nobel Peace award going to those who were also working toward the abolition of nuclear weapons.\nHe said that \"as long as I live, I hope to work toward a realization of a world without nuclear weapons with ICAN and many other people.\"\nTsuboi, whose ear is partly missing and his face blotched with burn marks, is co-chair of the Japan Confederation of A- and H-Bomb Sufferers Organizations, or Hidankyo, and has devoted his life to the fight to eradicate nuclear weapons, stressing that the weapon is designed simply to kill.\n———\n11:50 a.m.\nThe director of the anti-nuclear campaign that won this year's Nobel Peace Prize says that \"it sends a message to all nuclear-armed states and all states that continue to rely on nuclear weapons for security that it is unacceptable behavior.\"\nBeatrice Fihn, executive director of the Geneva-based International Campaign to Abolish Nuclear Weapons, told reporters that \"we can't threaten to indiscriminately slaughter hundreds of thousands of civilians in the name of security. That's not how you build security.\"\nFihn said that the group has received a phone call minutes before the official announcement was made that ICAN had won the prize. But she thought it was \"a prank\" and she didn't believe it until heard the name of the group during the Peace Prize announcement in Oslo.\n———\n11 a.m.\nThe International Campaign to Abolish Nuclear Weapons has won the Nobel Peace Prize.\nThe Norwegian Nobel Committee honored the Geneva-based group \"for its work to draw attention to the catastrophic humanitarian consequences of any use of nuclear weapons and for its ground-breaking efforts to achieve a treaty-based prohibition of such weapons.\"\nThe statement, read by committee chairwoman Berit Reiss-Andersen, said that \"through its inspiring and innovative support for the U.N. negotiations on a treaty banning nuclear weapons, ICAN has played a major part in bringing about what in our day and age is equivalent to an international peace congress.\"\nAsked by journalists whether the prize was essentially symbolic, given that no international measures against nuclear weapons have been reached, Reiss-Andersen said that \"what will not have an impact is being passive.\"\n———\n7 a.m.\nThe Norwegian committee that chooses the Nobel Peace Prize winner sorted through more than 300 nominations for this year's award, which recognizes both accomplishments and intentions.\nThe prize announcement comes Friday in the Norwegian capital Oslo, culminating a week in which Nobel laureates have been named in medicine, physics, chemistry and literature.\nThe Norwegian Nobel Committee does not release names of those it considers for the prize, but said 215 individuals and 103 organizations were nominated.\nObservers see the Syrian volunteer humanitarian organization White Helmets as a top contender, along with Iranian Foreign Minister Mohammad Javad Zarif and EU foreign policy chief Federica Mogherini for shepherding the deal to curb Iran's nuclear program.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: US: Nobel Peace choice doesn't change US stance",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-us-nobel-peace-choice-change-us-stance-50332657"
}