{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:20:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The 141st Westminster Kennel Club Dog Show's Best in Show went to a female German Shepherd from the Herding Group named \"Rumor.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Frumor-german-shepherd-wins-best-show-westminster-kennel-45505388.json",
    "image_url": "http://a.abcnews.com/images/US/170215_atm_westminster_winner_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Rumor the German Shepherd wins best in show at Westminster Kennel Club dog show\nPerhaps one of the best songs with rumor it is. And rumor has it and it is true rumored does have it that's the name of the nation's new top dog back at five year old German shepherd is only they set up from grade to win. Best in show for the Westminster Kennel Club show in its 140 year history kind of surprising. Considering the German shepherd is actually consistent. Consistently the second most popular breed Indian and stay after. To the labs of course and murmurs named after. You're hearing it Adele song rumor has it. Now the dog was suspected to win last year and then retired but when she came in second her owner decided to enter her. One more time and it's good thing that she did now it's up to the retirement home in Wisconsin but before that. Rumor will make an appearance at the Jimmy Times Square studio later on this morning furnish says it's time for a final hunt then and it can puppy. And the funny thing is you know DNA contemporary kiss that's always gets a number of celebrity stuff very big stars down there this is the most popular day knowing I couldn't anymore. NN that they actually remember exactly.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Rumor the German Shepherd wins best in show at Westminster Kennel Club dog show",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/rumor-german-shepherd-wins-best-show-westminster-kennel-45505388"
}