{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:28:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Flatest-yahoo-settles-sec-charges-2014-hack-54701766.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/latest-yahoo-settles-sec-charges-2014-hack-54701766",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the settlement between the company formerly known as Yahoo and government regulators over a huge 2014 data breach (all times local):\n4 p.m.\nProsecutors say two Russian intelligence agents, Dmitry Dokuchaev and Igor Sushchin, used information they stole from Yahoo to spy on Russian journalists, U.S. and Russian government officials and employees of financial services and other private businesses.\nA U.S. judge in San Francisco on Tuesday, meanwhile, pushed back a sentencing hearing for a 23-year-old Canadian man, Karim Baratov, who prosecutors say was hired by Dokuchaev to breach at least 80 email accounts obtained from the massive Yahoo hack.\nJudge Vince Chhabria questioned whether the sentence of seven years and 10 months that prosecutors were seeking for Baratov was longer than what other hackers had received for similar crimes.\nBaratov's attorneys have called for a sentence of three years and nine months.\n———\n2:15 p.m.\nThe company formerly known as Yahoo is paying a $35 million fine to resolve federal regulators' charges that the online pioneer deceived investors by failing to disclose one of the biggest data breaches in internet history.\nThe Securities and Exchange Commission announced the action Tuesday against the company, which is now called Altaba after its most valuable parts were sold to Verizon Communications for $4.48 billion last year. The Sunnyvale, California-based company neither admitted nor denied the allegations but did agree to refrain from further violations of securities laws.\nPersonal data was stolen from hundreds of millions of Yahoo users in the December 2014 breach attributed to Russian hackers. The SEC alleged that, although Yahoo senior managers and attorneys were told about the breach, the company failed to fully investigate.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Ex-Yahoo settles SEC charges over 2014 hack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/latest-yahoo-settles-sec-charges-2014-hack-54701766"
}