{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:22:16+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fconsumer-reports-recommends-buy-tesla-model-55534843.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_43fd77360ad54d99b44d28699764b210_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A wireless update of antilock braking software improved the stopping distance of Tesla's electric Model 3, prompting Consumer Reports to reverse course and give the car its \"Recommended Buy\" rating.\nThe magazine said Wednesday that the update cut 19 feet off the car's stopping distance from 60 miles per hour. A previous test — the results of which were released a little more than a week ago — found that it took 152 feet for the Model S compact car to stop from 60, the longest braking distance of any modern car the magazine has tested.\nThe improved braking raised the car's score high enough for it to receive the coveted recommendation. But Consumer Reports still has concerns over wind noise, a stiff ride, and the touch-screen controls that could distract a driver.\nAfter the first round of testing was made public, Tesla CEO Elon Musk promised to fix the problem within days. Consumer Reports says it was told by Tesla that the software helps the brakes adapt to variations in how they are used and how they respond in different environmental conditions.\nOn Twitter Wednesday, Musk wrote that he appreciates the \"high-quality critical feedback\" from Consumer Reports and said that noise and ride comfort already had been addressed. Another software update will address the controls, he wrote, without elaborating.\nMusk told the magazine last week that Tesla had already made production changes to address wind noise, the harsh ride and an uncomfortable rear seat, Consumer Reports said in a statement. Consumer Reports said it will rent another Model 3 from Tesla to check on the changes and will report back on the results. The magazine bought a Model 3 for the first test and said it doesn't normally rent test vehicles.\nThe Model 3 is Tesla's first attempt to appeal to mass-market buyers. The car that starts at $35,000 but can run as high as $78,000 has been plagued by production delays.\nTesla's software update was done either via the car's cellular connection or a wireless internet link, depending on how the owner configures the car, according to Tesla.\nJake Fisher, Consumer Reports' director of auto testing, said that in 19 years of work for the magazine he has not seen a car's track performance improve with a wireless update.\nMusk pledged in a tweet last week that the braking improvements would make the Model 3 best in its class. But Consumer Reports said the stopping distance was not class leading and the further updates may be necessary.\nThe magazine also said nearly all of the Model 3's controls are on a center touch screen direction with no gauges on the dashboard and few buttons inside the car. This forces drivers to take several steps to do simple tasks and can cause driver distraction, the magazine said.\nConsumer Reports also said it got a record 350 miles of range per charge with a long-range version of the Model 3 when it's set on a high mode to recharge batteries with energy from braking.",
    "source_domain": "abcnews.go.com",
    "title": "Consumer Reports recommends 'buy' for Tesla Model 3",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Technology/wireStory/consumer-reports-recommends-buy-tesla-model-55534843"
}