{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 23:34:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Net neutrality, or the open internet, is the idea that internet service providers (ISPs) are considered common carriers or public utilities, like electric, water and railroad companies.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2Fvideo%2Fnet-neutrality-51724358.json",
    "image_url": "http://a.abcnews.com/images/Technology/171211_vod_orig_netneutralityimage_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for What is net neutrality?\nIt's. Net neutrality explains. Net neutrality or the open Internet is the idea that Internet service providers were ISPs. Are considered common carriers are public utility that means that ISPs must provide access to all web sites and AM equally regardless of their content. Let's say you are streaming your favorite show from web site. Watching sports on web site to its. I three. Under the current regulation eyes peas are legally required to provide those sites you at the same ski. Opponents of the current regulations claiming IPs would recognize that you'd like website want them. And allow the website for the consumer to pay a premium to fast track to streaming from that site. I just pie is the chairman of the Federal Communications Commission which regulates communications by radio TV wire satellite and cable. He thinks rolling back the regulation. We'll help investment innovation and job creation. I creating more flexibility for highest peace supporters of the current regulation claim highest peace good take that information. And slowed down stream what's called throttling. Of your favorite show from website wanted. That would encourage you to watch shows on the web site two or three what you previously referred to watch sports or read the news. The SEC will vote on December 14 2017.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "What is net neutrality?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/video/net-neutrality-51724358"
}