{
    "authors": [
        "Abc News",
        "More Catherine"
    ],
    "date_download": "2017-04-18 13:49:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "\"We actually may see more suicides as a result of this television series.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2F13-reasons-faces-backlash-suicide-prevention-advocacy-groups%2Fstory%3Fid%3D46851551.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/HT-13-reasons-why1-cf-170403_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A suicide prevention advocacy group is speaking out about the new Netflix original series, \"13 Reasons Why,\" saying that the teen drama -- centered around a high school student who kills herself -- does \"more harm than any good.\"\nThe show, based on a young adult novel of the same name and co-produced by Selena Gomez, revolves around 17-year-old Hannah Baker, who takes her own life but leaves behind audio recordings for thirteen people who she says were part of the reason that she killed herself.\n\"There is a great concern that I have ... that young people are going to over-identify with Hannah in the series, and we actually may see more suicides as a result of this television series,\" Dan Reidenberg, the executive director for Suicide Awareness Voices of Education (SAVE), a non-profit group with the mission of suicide prevention, told ABC News.\n\"I’ve heard from others that are really concerned because its so sensational and so graphic that they’re worried about the copy-cat effect of suicide,\" Reidenberg added.\nSuicide is the second leading cause of death among those aged 15 to 34, according to the U.S. Centers for Disease Control and Prevention.\n\"The way things are portrayed in the media does have an effect on the way suicides can happen, this is particularly true for young people that are very vulnerable and at risk of suicide,\" Reidenberg said. \"When they're exposed to images that are really graphic, really sensational, and there is nothing balancing out for them ... that they can get help, and that treatment works, and recovery is possible ... we see them actually replaying what they’ve seen.\"\n\"The show actually doesn’t present a viable alternative to suicide, the show doesn’t talk about mental illness or depression, doesn’t name those words,\" he added. \"My thoughts about the series are that its probably done more harm than any good.\"\nSAVE partnered with another suicide prevention group, the Jed Foundation, to create a list of tips for viewing \"13 Reasons Why,\" and talking points for parents and teachers who are discussing the topic of suicide with young people.\nChild psychologist Janet Taylor said she applauds Gomez for addressing mental health issues on the show.\n\"I think we don't talk enough when things aren't going well,\" Taylor said on ABC's \"Good Morning America.\" \"I had one patient say, 'I have to be perfect because I'm so flawed.' Where did she get that?\n“We have to break the silence, talk to our parents, talk to counselors,” she added. “If you have a family history of mental illness, be aware of it, talk to your children. If your child makes a threat about wanting to hurt themselves, take it seriously.”\nProducers for the show said they actually hope the series can help those who may be struggling with thoughts of suicide.\n\"We wanted to do it in a way where it was honest, and we wanted to make something that can hopefully help people, because suicide should never, ever, be an option,\" Selena Gomez said in \"Beyond the Reasons,\" a video released by Netflix to accompanying the series.\nCo-producer Brian Yorkey added that they \"worked very hard not to be gratuitous, but we did want it to be painful to watch, because we wanted it to be very clear that there is nothing, in any way, worthwhile about suicide.\"\nJay Asher, the author of the book \"13 Reasons Why,\" added that \"suicide is an uncomfortable thing to talk about, but it happens, and so we have to talk about it.\"\n\"It's dangerous not to talk about it, because there is always room for help,\" Asher said in \"Beyond the Reasons.\"\nThe producing team adds that they consulted mental health professionals extensively in the making of the series, and provide suicide prevention resources and information on crisis hotlines in more than 35 countries on the website 13reasonswhy.info.\nDaniel Feinberg, a television critic for the Hollywood Reporter told ABC News that the show definitely \"demands conversation.\"\n\"The show is about how if we don't treat each other better, if we don’t have conversations, if we don't communicate, horrible things happen,\" Feinberg said. \"People end up feeling alone, and people end up feeling hurt, and then when people feel alone and hurt that’s when they do things like this.\"",
    "source_domain": "abcnews.go.com",
    "title": "'13 Reasons Why' faces backlash from the suicide prevention advocacy groups",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/13-reasons-faces-backlash-suicide-prevention-advocacy-groups/story?id=46851551"
}