{
    "authors": [
        "Abc News",
        "More Blair"
    ],
    "date_download": "2018-05-30 16:37:46+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "After 20-year-old Mathieu Bergeron died, his heart went to a doctor who desperately needed a transplant.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FLifestyle%2FFamily%2Fgirlfriend-hears-boyfriends-heart-now-beating-doctors-chest%2Fstory%3Fid%3D55531910.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/heart-donor-3-kgtv-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One man's heart has bonded two California families together forever.\nMathieu Bergeron, 20, died suddenly in May 2017 when he fell while riding his over-sized skateboard - known as a longboard - and fatally hit his head.\nBut out of that tragedy a miracle emerged - because Bergeron was an organ donor, and a fellow Californian named Dr. Murray Alsip desperately needed a new heart.\n\"Almost overnight, I got what appeared to be a cold,\" Dr. Alsip told ABC affiliate KGTV.\nBut that \"cold\" turned out to be a heart condition that made it difficult for Dr. Alsip to walk and, sometimes, breathe.\nThe former lifeguard and polo player realized he needed a heart transplant and fast. He described feeling like he had \"one foot in the grave\" before Bergeron's death became his hope.\n\"When I was diagnosed a million years ago, I knew the day would come,\" Dr. Alsip told KGTV. \"But when the day comes, it's just such a transformation that you can't express in words.\"\nKGTV\nSo Bergeron's heart now beats in Dr. Alsip's chest.\nThe organization Lifesharing, connected Bergeron's family and girlfriend with Alsip - first in a letter he wrote to them and ultimately face-to-face.\n\"Like when I read your letter, I was like, you're the perfect person to get it,\" Jessica Wallach, Bergeron's girlfriend, told KGTV about Alsip.\nMathieu had the biggest heart... and today his girlfriend heard it beating inside the man he saved ?? @10NewsBrian will share this emotional story on @10News at 11PM tonight #DonateLife #organdonation #hero pic.twitter.com/pbd5DGtGNl — Lifesharing (@LifesharingSD) May 30, 2018\nThey not only got to meet him, but also to raise a stethoscope to their ears and listen to Bergeron's heart beating again.\nKGTV\n\"We'd always compare because mine wasn't as strong as his, and so, it still is really strong,\" Wallach said before bursting into tears.\nBergeron's mother couldn't stop thanking Dr. Alsip for agreeing to meet with them.\nKGTV\nVisit the U.S. Department of Health and Human Services' website to find out more information on becoming an organ donor.",
    "source_domain": "abcnews.go.com",
    "title": "Girlfriend hears boyfriend's heart - now beating in doctor's chest",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Lifestyle/Family/girlfriend-hears-boyfriends-heart-now-beating-doctors-chest/story?id=55531910"
}