{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 13:44:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Parenting expert Ericka Souter shares how to prepare for a great school year.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fback-school-tips-children-parents%2Fstory%3Fid%3D49198216.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/school-gty-er-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As millions of children, and their parents, prepare for the start of a new school year, parenting expert Ericka Souter opened up about her top tips for what both can do to be physically and emotionally prepared.\nHere are her top tips for kick-starting a successful school year:\n1. Ease back into a healthy bedtime routine\nSouter, an editor of the popular parenting site Mom.me, told ABC News that she recommends easing back into the routine of waking up early for school starting at least two weeks before the actual first day of school. Souter also advises parents to wake up late sleepers a little earlier each day as summer vacation comes to an end.\nSouter explained that if children have been staying up late every night in the summer, it will not be easy going to sleep early the night before school starts.\nRoutines are key for children, especially when it comes to sleep, Souter adds. Enforcing an hour of quiet time before bed, which includes a no-electronics rule, can help children get into a healthy bedtime routine, according to Souter. She suggests reading as a good way to help children wind down without using their devices.\nSouter also recommends giving children their own alarm clock, and giving them more responsibility when it comes to going to bed on time.\n2. Start on summer homework ahead of time\nEasing back into your schoolwork can also be a great way to prepare before the start of a new school year. Souter recommends starting on a packet of summer homework well before the first day of school, and if your child's school does not give out summer homework, to buy workbooks or even use educational apps as a refresher before going back to school full-time.\n3. Keep a family calendar\nKeeping everyone's schedules straight can also be a difficult task for parents, so Souter recommends staying organized by using a shared family calendar with everyone's assignments, practices and appointments in one place. She also recommends making a morning \"to-do\" list everyday to avoid going mad if you try to keep track of everything in your head.\nHaving a central calendar that everyone shares can also reduce confusion for the whole family, Souter says. While a classic paper calendar will do, many families also opt to use a shared Google calendar.\n4. Set goals for the school year -- other than good grades\nFinally, to kickstart a successful new school year, Souter recommends setting goals other than getting good grades.\nOther goals you can set for school-age children include doing daily chores and household responsibilities, such as clearing dishes from the table, taking out the trash and brushing your teeth before school, according to Souter.\nSouter recommends using an incentive-based based program, with rewards, to encourage children to do their chores and other household responsibilities.\nSouter says she uses a Garmin Vivofit Jr. activity tracker for her son, which is similar to a FitBit except for children, and keeps track of activities and chores that children do. Parents can add points using an app when a child completes a chore, and then children can cash out the points for a reward such as extra play dates or more iPad time.",
    "source_domain": "abcnews.go.com",
    "title": "Back-to-school tips for children and parents",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/back-school-tips-children-parents/story?id=49198216"
}