{
    "authors": [
        "Abc News",
        "More Audrey"
    ],
    "date_download": "2018-04-24 18:02:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The Supreme Court case involves Texas' congressional maps.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fus-supreme-court-hears-texas-gerrymandering-case%2Fstory%3Fid%3D54677582.json",
    "image_url": "https://s.abcnews.com/images/Video/ap_supreme_court_rulings_jc_160623_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Supreme Court heard arguments Tuesday in a case involving Texas’ congressional and state legislative maps.\nInterested in Supreme Court? Add Supreme Court as an interest to stay up to date on the latest Supreme Court news, video, and analysis from ABC News. Add Interest\nThe state of Texas is asking the justices to overturn a lower federal court’s findings that the state’s congressional and statehouse maps were drawn with discriminatory intent.\nA federal three-judge panel concluded, in 2017, that mapmakers, “intentionally diluted the Latino vote” which violates the Voting Rights Act and The Fourteenth Amendment.\nSteven D. Schwinn of The John Marshall Law School helps us unpack this very complicated case.\nHow did the case get to the Supreme Court?\nThis up-and-down case had a quite circuitous route to the Court (to say the least — bear with me). It all started in 2011, when Texas adopted redistricting maps for its congressional and state legislative districts based on the 2010 Census. (Texas gained more than a whopping four million residents, mostly racial minorities, in the 2010 Census, so it had some new line-drawing to do.) Plaintiffs immediately sued in a Texas federal court, arguing that the 2011 congressional and state house maps violated the Voting Rights Act, the Fourteenth Amendment, or both. At the same time, Texas filed its own suit in a federal court in Washington, D.C., seeking “preclearance” (or permission to adopt the maps) under the Voting Rights Act. (At the time, the “preclearance\" requirement in the Voting Rights Act required Texas to get permission from the U.S. Department of Justice or a federal court before making any changes to its electoral systems.)\nThe Texas court ruled that the 2011 maps violated the Voting Rights Act and the Constitution and drew new maps for the state to use in its 2012 elections. But Texas challenged those maps in the U.S. Supreme Court. The Court remanded the case to the Texas court with instructions to defer more to the state’s 2011 maps. So the Texas court redrew its own maps to comply with the Court’s instructions. Texas used these most-recently-drawn maps in its 2012 elections. (Around the same time, the D.C. court denied preclearance for the 2011 maps, because the congressional map was based on a discriminatory purpose, and the statehouse maps had a retrogressive effect on racial minority “ability to elect” districts. Texas appealed this decision. But while the appeal was pending, the Supreme Court, in a different case entirely, rendered the preclearance requirement ineffective, and thus mooted Texas’s preclearance case.)\nThen, in 2013, Texas adopted these latest court-drawn maps as its own, with only minor changes to the state house map. The plaintiffs filed amended complaints to challenge both the 2011 and 2013 maps. The Texas court ruled that both maps violated the Voting Rights Act, the Fourteenth Amendment, or both. The court directed the Texas Attorney General to advise the court “within three business days” whether the legislature would “take up redistricting in an effort to cure these violations.” Absent legislative redistricting, the court said that it would hold “hearing[s] to consider remedial plans” in early September 2017. But the court did not formally enjoin the offending maps.\nTexas asked the Supreme Court to intervene, and it did. In September 2012, the High Court stayed the Texas court’s orders, and later set the case for oral argument.\nWhat is being challenged?\nTexas is challenging the Texas court’s ruling that the maps violate the Voting Rights Act, the Constitution, or both. In particular, Texas says that its adoption of the 2013 maps simply cannot violate the Voting Rights Act or the Constitution, because, after all, the 2013 maps were earlier ordered by the Texas court itself. (And, this reasoning goes, the Texas court wouldn’t have drawn illegal maps). The plaintiffs counter that the 2013 maps retain the same legal problems as the 2011 maps (especially because the Supreme Court ordered the Texas court to defer to the faulty 2011 maps); that the Texas court’s ruling didn’t fully cleanse those maps of the earlier illegalities; and that Texas’s adoption of the court-drawn 2013 maps was simply a litigation ploy to obtain maps that would achieve the legislature’s political objectives while immunizing the state from violations of the Voting Rights Act and the Fourteenth Amendment.\nBut before the Court even touches these merits issues, it must decide whether it has jurisdiction. Remember that the Texas court didn’t issue an injunction; instead, it simply ruled that the 2013 maps were illegal and asked the state to respond. Ordinarily, the Supreme Court would only hear an appeal of an injunction in a case like this. Without a formal injunction, it is not obvious that the Court can even hear the case.\nHow do the Fourteenth Amendment and the Voting Rights Act apply to this case?\nThese apply in two ways. First, the plaintiffs argue that the state discriminated by race in drawing certain districts in violation of the Equal Protection Clause of the Fourteenth Amendment and the Voting Rights Act. Next, they argue that the state drew certain districts in a way that was “retrogressive” to racial-minority voting strength. In particular, they argue that the state should have drawn more districts where racial minorities could elect a candidate of their choice (called an “ability-to-elect” district in Voting Rights Act parlance), and that the state’s failure to do so violates the Voting Rights Act.\nBut recall that these arguments are filtered through the Texas court-ordered maps. In other words, the Fourteenth Amendment and Voting Rights Act questions are complicated by the state’s claim that the court order cleansed the 2013 maps of any illegalities in the 2011 maps. So while the Fourteenth Amendment and the Voting Rights Act certainly apply to the case, the Court will also examine the extent to which the court order can insulate the 2013 maps from illegalities, especially when the court order deferred to the earlier 2011 maps, as ordered by the Supreme Court.\nWhat is the potential impact?\nThe case will have a direct impact on Texas elections, in both the state house and its congressional delegation, in the 2020 cycle. (The 2013 maps are in place for the 2018 elections, and unlikely to be changed.) But after that, the state will redraw its districts yet again, in response to the 2020 Census. So the case will almost surely impact only one election cycle. Still, that may be significant for the composition of state’s congressional delegation and the state house. And because it may be significant for the state house (which, along with the state senate, takes charge of redistricting), it may be significant for the next round of legislative map-drawing, to determine district lines for the decade after that.\nBeyond Texas, however, this case will likely have limited impact. That’s because the factual background here is so unusual—and unlikely to recur in other states.\nWhat is the Supreme Court's record in cases like this?\nThis case is latest in a line of cases to reach the Court dealing with the complicated intersection of racial and political gerrymandering. These cases typically involve an allegation that a state legislature engaged in illegal racial discrimination in drawing legislative districts, and a defense by the legislature that (1) it had to discriminate by race in order to preserve minority voting strength; or (2) it discriminated by politics, but not race, and its action was therefore not illegal; or some combination of (1) and (2). These cases are highly fact-specific, and it’s hard to see the trajectory of the Court’s rulings. But most recently they have favored the plaintiffs (and not the states).\nDon’t look for this case to necessarily follow any trend-line, however. Again, this case is highly unusual, and poses its own unique issue for the Court to resolve.\nWhat are the likely outcomes?\nAt this stage, it seems unlikely that the Court will rule that it lacks jurisdiction. That’s because it already issued an important ruling in the case, by staying the lower court’s order. Having involved itself once in the case, it seems unlikely that it would step back now.\nPredictions on the merits are much more difficult. We know that the four progressives on the Court would not have stayed the lower court’s order. That means that they likely lean toward the plaintiffs. The five conservatives voted to stay, however, and they likely lean toward the state. Justice Kennedy is probably the most likely to switch, so, as is often true in hotly contested cases, all eyes will be on Justice Kennedy.\nThe Court could uphold the Texas court’s ruling and order the state to respond (as the Texas court did). Or it could reverse, and allow the state to continue to use the 2013 maps. Or the Court could issue different rulings in different challenged districts.\nWhatever the Court does, however, the state will go back to the drawing table in the early 2020s, to take account of the 2020 Census.",
    "source_domain": "abcnews.go.com",
    "title": "US Supreme Court hears Texas gerrymandering case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/us-supreme-court-hears-texas-gerrymandering-case/story?id=54677582"
}