{
    "authors": [
        "Abc News",
        "More Kevin"
    ],
    "date_download": "2018-07-04 19:30:25+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "A Facebook video shows a police officer doing gymnastics, connecting with kids.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fwatch-dc-cop-gymnastics-local-kids%2Fstory%3Fid%3D56328056.json",
    "image_url": "https://s.abcnews.com/images/US/police-2-ht-edit-er-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An officer with the Washington D.C. Metropolitan Police Department used an unorthodox method to connect with local kids -- by engaging in a spirited flipping competition with them.\nOfficer Arthur Brown Jr. can be seen on a Facebook video doing acrobatics against some of the children.\nIt begins with one boy rounding off, before landing feet first from a backflip. Brown can then be seen stretching, clearing himself ample runway and performing a somersault backflip of his own, all in full uniform. Off camera, he'd handed his belt to his partner.\nArthur Brown Jr./Facebook\n\"The hardest part is trying to connect to the community,” Brown told ABC News.\nHe patrols Washington D.C.’s Seventh District, east of the Anacostia River, on a mountain bike. Stopping to shoot hoops or race bicycles down the street is just a part of community outreach.\n\"I'm not going to change who I am just because I've got a badge,\" he said.\nArthur Brown Jr./Facebook\nBefore he was a police officer, Brown worked with children as a volunteer for youth church services, and later as a barber.\nArthur Brown Jr./Facebook\n\"Kids are more open-minded than adults,\" Brown said of their role in community policing. \"They help us change adults', parents' minds.\"",
    "source_domain": "abcnews.go.com",
    "title": "Watch this D.C. cop do gymnastics with local kids",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/watch-dc-cop-gymnastics-local-kids/story?id=56328056"
}