{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 01:12:06+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Flatest-smallville-actress-leaves-brooklyn-courthouse-54704988.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/WireAP_a449966e46e3430290d9d3f1250752d2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on actress charged in NXIVM case (all times local):\n6 p.m.\nThe actress granted bail while fighting charges that she helped recruit women into a cult-like group has left a Brooklyn courthouse.\nAllison Mack, best known for playing Superman's friend, walked in silence with her lawyers to a waiting car two blocks away as photographers swarmed.\nA federal judge in Brooklyn agreed Tuesday to release Allison Mack on $5 million bond and place her under home detention in California. She'll be living with her parents.\nThe \"Smallville\" actress has pleaded not guilty to sex trafficking.\nProsecutors say she helped recruit sex slaves for leader Keith Raniere and his group called NXIVM (NEHK'-see-uhm).\n3:30 p.m.\nAn actress best known for playing a young Superman's friend has been granted bail while fighting charges that she helped recruit women into a cult-like group.\nA federal judge in Brooklyn agreed Tuesday to release Allison Mack on $5 million bond and place her under home detention in California. She'll be living with her parents.\nShe has pleaded not guilty to sex trafficking.\nProsecutors say she worked as a slave \"master\" and recruited women to a group led by a man who sold himself as a self-improvement guru to the stars.\nMack starred in The CW network's \"Smallville,\" a show about the early life of Superman that ended in 2011.\nProsecutors say she helped recruit sex slaves for leader Keith Raniere and his group called NXIVM (NEHK'-see-uhm).\nRaniere also denies wrongdoing.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: 'Smallville' actress leaves Brooklyn courthouse",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/latest-smallville-actress-leaves-brooklyn-courthouse-54704988"
}