{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 00:43:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "With championship drought over, 'That's Cub' has new meaning",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fchampionship-drought-cub-meaning-45496274.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/championship-drought-cub-meaning-45496274",
    "language": "en",
    "localpath": null,
    "maintext": "A lot has changed for the Chicago Cubs in the past year.\nRight down to team mantras.\nFor the better part of 108 years, blowing a shot at a championship was met by shrugs and a feeling of, \"That's just the Cubs.\"\nThe Cubs arrive this week at Sloan Park as World Series champions and manager Joe Maddon and Co. are grabbing onto a relatively fresh term: \"That's Cub.\" Maddon, of course, loves to find creative ways to keep the players fresh and focused during a long season.\n\"That would be Cub, 'That's Cub' to move it forward, to win a World Series and then come back the next season and you're happy and you're impressed and you love what you've done, but you have to continue to move it forward,\" Maddon said.\nCubs president of baseball operations Theo Epstein said the phrase cropped up a few years ago when today's current standouts were youngsters in the organization. It has followed players like Kris Bryant, Kyle Schwarber, Albert Almora and Javier Baez to the major leagues.\n\"'That's Cub' started four or five years ago in the minors,\" Epstein said. \"When they started realizing how good they were, and some of the things they were doing, we started saying, 'That's Cub.' It was great for morale and came to mean something positive organically. For years 'That's Cub' had a different connotation.\"\nSome players were already sporting \"That's Cub\" shirts during workouts with Courage, Urgency and Belief spelled out under the corresponding letters.\nMaddon also talked about three themes he will focus on this spring: Staying uncomfortable, authenticity and heart.\n\"It's really important to be uncomfortable,\" Maddon said. \"If you become a comfortable person, I think that subtracts growth from the equation. I think if you remain somewhat uncomfortable, you'll continue to grow. You don't become stagnant. You don't become complacent, set in your ways. On every level, I want us to remain uncomfortable. I think that's a really positive word.\"\n\"For me, I really want us to really understand the authentic part of who we are,\" he said. \"From that, be able to sustain what we've done in the past just by being us. Don't try to do anything different. There's a part of the sameness I would like to see, is the authentic part of our guys.\"\nHe mentioned Game 7 of the World Series at Cleveland. The Cubs blew a three-run lead in the eighth, with Rajai Davis hitting the tying homer off Aroldis Chapman. But they got a pep talk from Jason Heyward during a short rain delay after the ninth inning, scored two in the 10th and hung on after Cleveland got a run in the bottom half to bring home their first championship since 1908.\n\"Things went badly for a bit,\" Maddon said. \"We came back and regrouped because our guys got together in a room, void of any kind of statistical, video, analytical information — they went in there as human beings and came out unified.\n\"Everybody just wants to talk about all this other stuff. Everybody's forgetting the heartbeat. I don't want us to forget the heartbeat, ever.\"\nThe topics eventually turned toward the players — Schwarber's desire to catch, managing pitchers' workload considering the season went to Nov. 2, bullpen depth, platoons in center field with Almora and John Jay and Baez's uncertain role. But the main theme of the initial news conference with general manager Jed Hoyer, Epstein and Maddon was how things must stay the same even though things are much different now that the organization isn't labeled with 100-plus years of jokes, curses and failures.\n\"The methods are still the same,\" Maddon said. \"We weren't outcome oriented. We focus on the process to give you the best opportunity to succeed. Nothing changes in that regard. Embrace the target and everything else remains the same.\"",
    "source_domain": "abcnews.go.com",
    "title": "With championship drought over, 'That's Cub' has new meaning",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/championship-drought-cub-meaning-45496274"
}