{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 18:48:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "California police sex misconduct case fizzling in court",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcalifornia-police-sex-misconduct-case-fizzles-court-50328988.json",
    "image_url": "http://abcnews.go.com/US/wireStory/california-police-sex-misconduct-case-fizzles-court-50328988",
    "language": "en",
    "localpath": null,
    "maintext": "Charges have been dropped against a police officer and a former sheriff's deputy in a California sex abuse case involving the teenage daughter of an Oakland police dispatcher.\nThe dismissals this week marked the latest setback for prosecutors in the high-profile case involving the troubled Oakland Police Department and other agencies.\nA judge previously tossed out allegations against another former officer in the case that cost 12 law enforcement officers their jobs.\nThree other former officers have pleaded guilty to misdemeanors and paid small fines.\nIn the two latest dismissals, a judge ruled Wednesday that former deputy Ricardo Perez didn't know the teen was 17 when they engaged in consensual sex.\nProsecutors on Thursday dismissed a similar case filed against Oakland police officer Giovanni LoVerde.\n\"I had the utmost confidence that this would be the result,\" LoVerde told radio station KQED (http://bit.ly/2kqsg28). \"Unfortunately, it took a year and a half to get here. I am happy. I look forward to getting back and serving the people of Oakland.\"\nThe teen claimed she had sexual relations with nearly two dozen law enforcement officers throughout the San Francisco Bay Area while she was working as a prostitute. She said some of the encounters occurred when she was 17 but testified that she lied about her age.\nThe claims became public when an Oakland police officer committed suicide in 2015 and left a note implicating several colleagues. Oakland police Chief Sean Whent was forced to resign in June 2016 after a federal judge who oversees the department said the internal affairs investigation was botched.\nA dozen officers from five law enforcement agencies were fired or resigned for their involvement in the case.\nThe woman said she no longer works as a prostitute. The Associated Press generally doesn't identify people who say they are sexual abuse victims.\nOakland paid the woman nearly $1 million to settle her abuse claims.\n———\nInformation from: KQED-FM.",
    "source_domain": "abcnews.go.com",
    "title": "California police sex misconduct case fizzling in court",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/california-police-sex-misconduct-case-fizzles-court-50328988"
}