{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 15:30:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "US stocks jump as tensions with North Korea appear to ease",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-stocks-jump-tensions-north-korea-ease-49206411.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/us-stocks-jump-tensions-north-korea-ease-49206411",
    "language": "en",
    "localpath": null,
    "maintext": "Stocks are rallying Monday morning as the tensions between the U.S. and North Korea that flared last week appeared to ease. Technology companies and banks are making some of the largest gains as stocks bounce back from their losses with some of the biggest gains the market has seen this year. All 11 industrial groups in the Standard & Poor's 500 index are moving higher.\nKEEPING SCORE: The S&P 500 jumped 24 points, or 1 percent, to 2,466 as of 11:15 a.m. Eastern time. The Dow Jones industrial average gained 147 points, or 0.7 percent, to 22,005. The Nasdaq composite added 73 points, or 1.2 percent, to 6,329. The Russell 2000 index of smaller companies climbed 14 points, or 1.1 percent, to 1,388.\nLast week was the worst for stocks since late March, as the S&P 500 fell more than 1.4 percent. Rising tensions between the U.S. and North Korea startled investors out of the complacency that has weighed on the stock market for most of this year. That eased Monday after officials said fighting is not imminent. The top U.S. military officer said the country wants to resolve the standoff peacefully.\nThursday was the worst day for stocks since mid-May, and Monday is shaping up to be the best day since late April.\nLEADERS: Technology stocks rose in early trading. Apple added $1.88, or 1.2 percent, to $159.36 and Microsoft picked up $1.07, or 1.5 percent, to $73.57. Western Digital advanced $2.77, or 3.5 percent, to $82.67.\nChipmaker Nvidia rebounded after two days of sharp losses. It rose $6.32, or 4.1 percent, to $162.28. Competitors like Micron Technology and Analog Devices also rose.\nNEW BUYER NETS NEFF: Equipment rental company Neff said it received a buyout offer worth $25 per share, or $596 million. It did not say who made the offer, but Neff said its board has decided the new offer is superior to a bid from H&E Equipment Services that the company accepted last month. H&E Equipment has the right to match the new offer and is entitled to a breakup payment if Neff it acquired by another company. Neff climbed $3.85, or 17.6 percent, to $25.70. H&E's offer valued Neff at $21.07 a share.\nH&E Equipment lost 48 cents, or 2.2 percent, to $21.11.\nFRIENDLY NABORS: Drilling technology developer Tesco said it will be acquired by drilling contractor Nabors Industries in an all-stock deal. The companies said Tesco is being valued at $4.62 a share. Tesco added 43 cents, or 10.9 percent, to $4.33. Nabors lost 33 cents, or 4.8 percent, to $6.48.\nSTICKER SHOCK? Fiat Chrysler climbed after Automotive News reported that a Chinese car maker offered to buy the company. It did not identify that company and said Fiat Chrysler rejected the offer because it wasn't high enough, but investors hoped another bid would come. Fiat Chrysler stock gained 88 cents, or 7.6 percent, to $12.50.\nRHIMES AND REASON: Netflix signed a deal with Shonda Rhimes, the creator of popular television series such as \"Scandal\" and \"Grey's Anatomy.\" She will leave ABC and make shows for Netflix, although those shows will remain on ABC. Financial terms were not disclosed, but recently Netflix has started shelling out more money to try to get own and develop shows that more people will watch. Its stock dipped 23 cents to $171.17 Monday.\nENERGY: U.S. crude oil rose 18 cents to $49 a barrel in New York. Brent crude, the international standard, picked up 11 cents to $52.21 a barrel in London.\nBONDS: Bond prices turned lower. The yield on the 10-year Treasury note rose to 2.21 percent from 2.19 percent late Friday. That helped banks, as higher bond yields mean higher interest rates and greater profits on mortgages and other loans.\nBank of America climbed 48 cents, or 2 percent, to $24.35 and JPMorgan Chase gained $1.21, or 1.3 percent, to $92.63.\nCURRENCIES: The dollar rose to 109.45 yen from 109.04 yen. The euro fell to $1.1785 from $1.1824.\nOVERSEAS: Germany's DAX jumped 1.4 percent, as did the CAC 40 in France. In Britain, the FTSE 100 index added 0.8 percent. Hong Kong's Hang Seng index jumped 1.4 percent and the South Korean Kospi rose 0.6 percent. Japanese stocks fell sharply as investors played catch-up after an extended holiday weekend. The Nikkei ended 1 percent lower.\n———\nAP Markets Writer Marley Jay can be reached at http://twitter.com/MarleyJayAP His work can be found at https://apnews.com/search/marley%20jay",
    "source_domain": "abcnews.go.com",
    "title": "US stocks jump as tensions with North Korea appear to ease",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-stocks-jump-tensions-north-korea-ease-49206411"
}