{
    "authors": [
        "Abc News",
        "More Meena"
    ],
    "date_download": "2018-07-04 09:46:47+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "On July 4, U.S. cities celebrate nearly 14,000 of America’s newest citizens.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Ffourth-july-us-cities-celebrate-americas-newest-citizens%2Fstory%3Fid%3D56326232.json",
    "image_url": "https://s.abcnews.com/images/US/naturalization-ceremony-rt-jef-180703_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This Fourth of July, nearly 14,000 immigrants become America’s newest citizens, swearing the oath of allegiance at 27 naturalization ceremonies across the nation that coincide with the country’s 242nd birthday and the signing of the Declaration of Independence in 1776.\n“When oath ceremonies are tied to the Fourth of July, it’s a message that immigrants believe in this country. It’s a beautiful and emotional thing,” Joshua Hoyt, executive director of the National Partnership for New Americans, said. “United nations, from Albania to Yemen, are represented in the ceremonies.”\nHoyt added that NPNA believes “naturalization is good for the immigrants, their communities, and our nation,” while contributing to “higher incomes” and “social cohesion.”\nWednesday's ceremonies come on the heels of a July 2 report from NPNA claiming an 88% increase in the backlog of U.S. citizenship applications since 2015, in addition to an ongoing immigration crisis that’s drawn nationwide protest.\nThe number of people becoming citizens between June 28 and July 10 marks a slight decrease from last year, when nearly 15,000 people took the oath, according to U.S. Citizenship and Immigration Services, but a sharp increase from 2016, when about 7,000 did so during the same time period.\nCities honor new citizens on Independence Day\nCities participating in Fourth of July citizenship festivities include Philadelphia, Denver, and Tucson – each with its own tradition to celebrate America’s newest citizens.\nDrew Angerer/Getty Images\nJust 70 miles from the U.S.-Mexico border, Tucson celebrated 21 new citizens at a ceremony held Wednesday in Saguaro National Park.\nCam Juarez, a National Park Service Ranger and coordinator of the ceremony, said that the NPS partners with U.S.C.I.S. to co-host citizenship ceremonies in America’s “most special places.”\n“The notion of public lands has a history in the United States of belonging to citizens. NPS protects and preserves these lands, and the ceremony shows citizens that they have a right and responsibility to use them,” he said. “These places now belong to them, and are full of beauty and historical and cultural importance.”\nJuarez noted that as the son of Mexican immigrants, he has a personal connection to stories of citizenship.\n“When my mom, a farm worker, became a citizen, she wanted all nine of her kids to have the opportunity to go to college,” he said. “That was her vision for citizenship.”\nJuarez hopes that celebrating citizenship in a national park will help new citizens recognize the value of America’s public lands.\n“Being naturalized in a national park is a key part of American culture,” he said. \"What’s more American than taking the oath of allegiance in a national park, which is often called ‘America’s best idea?’”\nIn Philadelphia's Betsy Ross House – another historic landmark – the Daughters of the American Revolution hosted a children's naturalization ceremony.\n“Every year, we celebrate 13 children – who each represent the 13 original colonies – at our ceremony. The Children of the American Revolution read out the colonies’ names and ring a bell in the order they joined the Union as each child comes up and receives their citizenship certificate,” Patricia Coyne, a regent of the DAR chapter, told ABC News.\nCoyne said the ceremony \"brings tears to [her] eyes every time as the children of America’s first patriots welcome America’s newest children.\"\n\"They are the future of our nation,” she said, noting she believes celebrating naturalization in Philadelphia is especially significant because “our nation and the concept of citizenship began here.”\nMeanwhile, Denver will welcome 30 new U.S. citizens from 18 countries Thursday.\n“[The ceremony] reaffirms our city’s emphasis on celebrating immigrants and recognizing their hard work and journeys to become citizens,” Jamie Torres, the director of the Office of Immigrant and Refugee Affairs for the City and County of Denver, told ABC News.\nTorres noted that Denver is also launching a campaign to provide resources to permanent residents and encourage them to apply for citizenship.\n“‘We have about 30,000 eligible permanent residents who can apply for citizenship. We want to answer their questions, help them sign up, and get them excited about becoming citizens,” she said. “We’re stronger as a city when we’re doing everything we can to help our immigrant population.”\nTorres’s favorite part of naturalization ceremonies is finding a “connection” between herself and the new citizens.\n“Even if I don’t know them personally, I feel a closeness to them,” she said.\nNew citizens celebrate July 4th\nRebecca Shi will never forget the day she became a U.S. citizen. And just last Thursday, she watched her mother take the oath of allegiance after 25 years of an “arduous journey” on the road to citizenship.\nShi explained that her mother, a Chinese doctor, came to the U.S. on a visa from Shi’s father, but a court error led a judge to incorrectly rule that Shi’s mother had overstayed her visa.\n“The judge filed an order of deportation, even though my mom didn’t overstay her visa,” she told ABC News. “So my mom became undocumented, and worked in Chinese restaurants. The tips she earned put me through the University of Chicago.”\nAfter appealing to Rep. Luis Gutierrez D-Ill., Shi had the deportation order reviewed and canceled in 2013, paving the path to her mother’s citizenship.\n“My mom finally has the opportunity to fulfill her profession in the medical field, mentor the next generation of doctors, and fully reach her potential,” she said.\nDrew Angerer/Getty Images\nShi recalls her mother studying for the citizenship test “every single day for eight months” and learning English through classes at a high school and community college. But her hard work paid off.\n“She got 100% on the test,” Shi, who attended her mother’s citizenship ceremony last week in Chicago, said.\nShi, who now serves as the executive director of the Illinois Business Immigration Coalition, a group that advocates for federal immigration reform, said she believes the “stakes are higher” today for people hoping to become citizens.\n“Immigrants come here to work hard and be the best in their field, though some people call them ‘lazy.’ So, we need to fully participate in our communities. And despite the rhetoric coming from [the Trump administration], we are still a democracy,” she said.\nShi said she encourages people to apply to become citizens, study for the citizenship test, and “save up” to pay the $730 application fee.\n“People who step up decide the direction of our country. So I encourage people to become citizens, register to vote, and vote,” she said.\nAnd Wednesday, Shi’s mother partook in another kind of civic engagement: she and her daughter marched in her first Fourth of July parade as a U.S. citizen.\n“She told me to buy her American-themed accessories,” Shi said between laughs, “so she could be one of those ladies dressed in an American flag, marching in the parade.”",
    "source_domain": "abcnews.go.com",
    "title": "On Fourth of July, US cities celebrate America’s newest citizens",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/fourth-july-us-cities-celebrate-americas-newest-citizens/story?id=56326232"
}