{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:20:01+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Patinkin talks to ABC News' Jonathan Karl and Rick Klein on this week's \"Powerhouse Politics\" podcast.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fhomeland-star-mandy-patinkin-powerhouse-politics-54700869.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_gostream_powerhousepolitics_patinkin_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'Homeland' star Mandy Patinkin on 'Powerhouse Politics'\nWelcome to a special edition of powerhouse politics we are honored to be joined by many to take in one of America's greatest actors and of course the star. One of the stars of homeland holders and thank you for joining thank you so I wanted to ask you saw parts of season seven salt salt parents and and over the over the various seasons kidnapped by the pakistanis. He's been targeted by the Russians and a honey pot scheme was successful. Saul has been. Jailed by the American presidents. And taken hostage by American extremists. Bring teams colleagues. Killed in in a big terror attack the CIA and named the CIA director and fired as the CIA director. Betrayed by his closest colleagues. You. If you're a wrong. Line camera Heineman of fictional so all came Israel should only resolves Israel's overview report. They would mr. babies at a news. But in an an auction this currencies and I haven't gotten all the way through it some Nolan who. Spoilers here but so you have a president who was at war with. The intelligence community. And one before a president who some people think he's mentally unstable so much so that the only. Some commune and the president's cabin is talking about invoking the 25 amendment we win we're with the stuff. I don't know legacies writers have just imagination that are off the charts as you can never imagined anything even neared of that rail line is nothing like the justice system. It's almost like he has superhuman movie or something and so don't understand it. In the Bronx I think it I love the show on the shoulders for a lot of bad bad press sometimes. I think sauls got. You and he's got to go but we do you a lot of research you. Spent time with the real intelligence operatives. To prepare for several years earlier here than we. With Mike Hayden on this program is welts herbal. The former CIA director. A former head of the of the National Security Agency. It's about relationships. While it's quite wonderful. I met with him several times and we refer to a spike camps the writers and producers and myself come every year at Washington. And we meet in room and Georgetown. For ten to twelve hours today. Two to three hours per person. The who's who of the intelligence community comes through the door Pulitzer Prize winning writers journalists at senator. And we asked them questions but they're no different and the questions and everybody who wakes up in the world themselves every morning when you most concerned about what is the thing is that it is concerned. But I'm watching their behavior. I'm not that interest and the specifics that they're talking as much as their behavior. So if you're bringing up. Kim Jong-Il on them. Quote and then Russian interference in our elections etc. in them and they're discussing concerns of the there. Says Kim Jung and North Korea situation. As concerning to them as the Cuban missile crisis at Sutter and asking questions like that. I'm watching their temperament to see are they worried are they concerned they cop how were they a year ago. And the last year I was very. Reassured. By their home. And then their nature of not. Boy balloon note temperature rise they seemed easy. So good to talk the worst I talk to them might think. In January or February right in and seventeen right after the inauguration. So then I won't say who because I don't want to give away his name but someone. Maybe at times even in a higher position and general Hayden who who was also one of our advisors. He came to visit the set around August no no no no around October. Of this year while we were filming in Richmond Virginia and I told that story that I said you know you have given me some confidence. About. How you were react the nature of your behavior how you weren't reacting and in a heated fashion now I had seen them once before. When I just got back from Cambodia and and two of these gentlemen who just won in there is acidity and but they sat down at the moment. That the there busters when often it was a moment that call me blew the whistle. On Hillary's said that she was off the hook but essentially driller and 1 July 4 weekend remember well and I watched them get up and they couldn't sit down and there was steam coming out of there -- like a cartoon their bases were read that repeated because. Clearly they had had there. Contemporaries. Lose their. Professions and their jobs over what I without them spent specifying. I would assume far less. Then you know people not knowing how to work cell phones are technology. And and the double standard I thought drove up the went off the roof. So I've met this one gentleman later on months later and I said after the administration been didn't in the ball game about eight months and I said. Since I was compound by them by nature cause I'd seen you lose I saw that you have the ability to have a temperature rise and and and this one guy said to me. I was wrong. He said I've spent my life and unhelpful in the Oval Office. Every day. For years and years briefing president. I know the difference it takes place. Between a candidate. And a president. And I was certain when I met with you those months ago. That change that that office makes a human being would insert itself into this individuals. Who had been elected. Certain. That it would have an effect I'm that made him. And Hansen and now. I am. And that was who. The most potent moment I'd experience. Of all of the interviews. To see someone so season in that office in that room with that human being. So assured of the power of that office and a color changes he human being who's in charge of humanity. Globally. And to admit that he hadn't seen. That change. In his nature. I. That's that's a powerful moment. That is that the show it in time it's been on a lot has happened in the world life happens of those please go. Lot has happened in the in. It geopolitics a lot of happen in American politics we have a new president and in this chaotic time that we're living in right now. The show it to my mind this season has become so much more topical whether it's Russian interference whether it's the war with intelligence agencies in the military. Inside the Oval Office or whether it's C a purveyor of conspiracy theories to who gets a wide audience by by talking about. Kind of crazy off the wall ideas. How is that adjustment been for you is as part of the cast is that a conscious effort to say we need to reflect. Closer to what reality is right now this is awesome fantasy world this actually hews pretty close to the wall for living. I'm not interest and in the show when it becomes a Polaroid. Or live news sure or real when it would've equality shows real reality reality you elevate things I'm not interest and fair. We're a fictional system. A drop and I feel promise that at its best is when you create a poetic possibility or solution or option. For the world at large that those in charge aren't addressing or seen or activating for the most vulnerable among. Shall I have pleaded with the writers on and on an annual basis rotten day to day. That before our season is over because it's like a model so it's twelve chapters every season and before this season is over to please. Give a poetic possibility. Of away. A moral to the end of our story a moral that would guide a sort lead us to something more hopeful and optimistic. That is what I passport. And this year I got mine which you'll see it in the final episode of episode twelve seasons. I won't tell you where. But something has presented. Bingo thing. Thank god for that time and ours we spend it some. Hopeful optimistic positive. Alternative. Which should chest in our little art form hope TV. It goes all over the world and maybe those who watch it who aren't power who have boats who can make changes who can affect people's lives will hear those thoughts. And put them into action. So this year we did it next year in our final season I know we're going to do it because we've been all talking about that one for a long. And so. That's at swear. Sometimes. Your wish is can come true. So you know or season it's gonna go you're gonna for the finals. I can't tell you V the nuts and bolts or where the 24 got back not click click click you know on the edgier seat parliament will be. But I can tell you I'm sure I'm pretty sure that the heart of that will be. A in very positive hopeful. Possibility. That it might offer. Offs all over the world to consider. What if we went that way. And that doesn't mean happy endings. I don't redo it I don't know if if if given the state of the world and elsewhere so vulnerable and I don't know if happy ending right exists right but media best possible alternative route. And men and not referring to alternative news. Mercury it to alternative pop artifacts an alternative life. And many to think you know you're you're very very active. With refugee crises and you were just on a trip to you've gone though with the International Rescue Committee. Pretty recently this is of actually a pretty big topic here in Washington we've got a Supreme Court case coming up. And hearings just this week on the on the president's travel ban. This is not been a welcoming administration when it comes to issues of of refugees what's the message the you're hoping to bring the U hope policymakers stroll away from what you witnessed over the. The word you just used welcome. I asked this administration to reverse its policies and become a walk on more welcoming administration. Here on our country in the UK in many places in in the EU we put up walls not well. I just came back from Uganda which is really. The global leader may be also with Germany but no one this could as Uganda right now. In terms of moral ethical BA behavior toward our fellow human beings. They put up welcome not walls the elders give their land for nothing so that every refugee that comes in gets a piece of land. Lillian dial up a woman who watched her husband be tied to a tree shot in the chest her little son named. Harmony six years old bomb went off and lost him she gets placed in bitty bitty a refugee settlement in this developing country. That has 290000. People she was a they video site. A therapist you know forget the exact name. Like one Psycho analysts have pipes in south Sudan so she does that work and women senators for women of gender based violence she built for home she's pregnant with another child. She met someone else who also has fled back to the conflict so there's that conflict and in the way men behave and but. But. It sees that there they're just so full of inspiration and hope these people who were victims didn't cause the conflict so my major message. Two and hope and prayer is that those elected officials. In our country in every country in the world. If you going to run for office you must care about your constituents and not just locally but globally and you must want to do something when. So you have to up the diplomacy. Because of the individuals who were running the government's with a conflict dark can't get it together for what ever the reasons our. It's up to the global community to get it together and create pressures and systems that stop the the conflict and the violence in the hatred in the inhumanity toward human beings in the first place. That's where we have to start secondly those of us who were richer nations have to open our doors the bands for god sake. Of companies you know before the last administration left they brought in 85000. Refugees. That an Obama picked that up to a 1101000. This administration came down and not that them with 50000. It's already April less than 101000 have been admitted because of red tape complications bands etc. Chances are it won't get a book 23000. Bosnian when he eighteen. These vulnerable people won't come and people say why do you care about this what what because none of us would be standing here our country have welcome my ancestors. That's why we're here every one of us in this country. And to forget that is to forget what your briefing. And so we have to do. We have to change the diplomacy. Remember why we're here and remember our moral ethical fabric. And nature as human beings and encourage our leaders. To do something about that and if you say well I don't know what to do I'm not a news MTV Europe on an actor and TV show the richest guy on the planet what way did you vote. You. And you'll find out who in your neighborhood. Is running for office who has the moral and ethical fabric that you care about. And if you don't know that person you find someone who doesn't go to their church or synagogue or mosque. Or school and you go to that event and you give a dollar you give your time you give your attention. And you change the fabric. Of the body of of the body of people who changed laws in effect human rights all over the world. And here's lot of talk America offers building walls and take our own problems the world's problems. I mean to get on my soapbox with some news also spent time visiting refugee camps all over all over the world. You. There is a value to if you want to be narrow American self interest selfish. There is a value to America being seen. As a force for good doing good things around world for and I love you saw the documentary last days in Vietnam about the end of the Vietnam War. When all of all of our you know erstwhile allies in the south. You know had to flee the country an aunt and the United States open the doors and you go when you you talk to them that the Vietnamese and that and who came in during that time the newest. That the American. This is what makes America great that we is what makes America great Albert Einstein who started the International Rescue Committee. The thing on the wall a life lived for others is a life worthwhile. And it's the most selfish thing you can do freeze of its duty if someone else make sure that their rights are taken care. What's the alternative to send them back to the conflict. Let's steel ball game. If you're not there when they went when they knocked on your door then my grandfather used to sing Yiddish outside Atlanta and we will as always turning if you opened the wheels going to be turning and we're not going to be on the bottom some think again. And if you're not their first someone else they're not going to be there for you. That's how the world works. So that's how that's how to work so to bring it back to home and we were talking before the before we started. The cameras rolling here. About intelligence operatives. Who we've covered. Shall. Not say they all like it but it's a it's pretty popular among. Among that group and and question you posed won't put you why I mean. You've got deeply flawed human beings who were. It the stock you know their characters in in this strong. Brake pedals stakes big but it break rules that bad things and hurt people hurt people sometimes. Yes but also help people who what why why do you think that show news. Is pop Rick was saying he hates virtually every show the tries to depict journalists. Seems quite remarkable I think. I didn't post to post party. It is being is editor at seeing yourself in manners that it it seems to me talking to people that work in this world actually do the job. They watch this show in May feel there's something essentially. Honest about the portrayal. And it. So I'm newsman. Sent me Monday because it was at the beginning of the shown people we're loving it. And ice that he's I don't want to get something I don't watch. All I said. He said I think it's because of its ambiguity. I thought that was a very interesting answer because almost everything in life has this item that's that fine line. The other thing I think over time that I felt it was the family aspect of which initially. It was the Brody family that Kerry Brody family that's all carry them when this all CIA. Salters. Family the United States in the global and we. And I think. Also. Members of the community. Like this piece and particularly. Carey in Seoul. And maybe salt represented represents that little more because of his moral. Ethical nature. Because he is the ruler of moral and ethical thinking. That's said. The same individual who said to me earlier this that he was concerned about the lack of the fact that that office had on the current president who and it really frightens him because he's lived in that office. And knows the power. He said to me I was brought up by my mom and to be a good moral ethical human beings. Every decision I make as a moral ethical standard to that's how we agreed to leave that's when I fed to my children. In between the words were. And. I just got lost I'm sorry I'm to me 12 here. But why I think what why they like this show was how this you know what these. These people that live in the real world that this is the fictionalized depiction. The you know it. Brought up this man beat because. Oh because he also he also sent with the moral ethical standard of his nature and its existence from his parents. As a member of the intelligence community through his career he's had to make some opposite decisions. That can sometimes be like taking. Painful to make and how he balances and interest in that I forgot. I don't imbalances that question. Of what you have to do to protect yours country your children. And also hold onto your moral ethical fabric is not a simple. I answer it is a complex complicated solution. We're decision or choice. And a very Smart Fella can't mention it but these candidates. But it is right everybody smarter. Sent me. So what sets it at the microphone here face and we get this opportunity now to talk that apple here. Have platforms for various written what would you say to people. He'd say I'd say don't oversimplify. Don't try to oversimplify. Any thing it's a complicated system all of and respect and embrace the complexity. Of every single question and culture and nature that's it. That's the of the known it and the unknown of what's in between the lines Arthur Miller in a beautiful documentary his daughter did. Talk about Wright talked about writing plays to try to address the moment of the time he was living. And the effort in the nature of the play. The system of a play. Was for him what was in between the words he wrote the condition that he created that it. Made an opportunity. For the audience here and listen may be most of all to themselves. When they came here through the no one's there. And so. I think. It's so interesting because and my whole life. When I've worked with Steve Simon might look at the notes on this panel or twenties and napkin and he'd write words aware rhymes trying to get them in the simplest rhyme. We always try to simple a simple let's make it simple keep it simple stupid kiss kiss keep it simple stupid. And and it's come to a point because of being inundated with the kind of simplistic. Rhetoric. By our administer this current administration we come to learn is it's source. Don't take that as an excuse in a way out it's incredibly complicated. And respected. And get in there and work and change what you're not comfortable win. And if it's a moral ethical nature of it you're not comfortable with about a global decision process. In my case particularly for the most vulnerable among us refugees all over the world were locked in limbo. Do something about it and you can vote. And also of what we're getting a rapper also means trying to understand. The perspective those who disagree. Because the BBP's are hypocrisy incredibly complicate Sobel. For you give them give them respect and listen to them I also feel I always feel that homeland can be at its best. Increases what I consider cancer on a global basis which is the lost art of listen. Shoot. So before ego we gotta let you go you have one more question you you. A lot of people don't know it's what you were in this movie years ago called princess bride you remember those. They interview and it's eight and and you played a character named indigo Montoya it's. And it's kind of a beloved character I mean it's it's one of these characters it's is as was 1111 and that one of the great characters in American film it's. So questions. What three things. To annoy him until. It's all birds come. Three thing Dmitry before you want but just at least. Adults and bullet. They both look a little like history and politicize it in your paper lines and William angle. That he wrote for an. And no one close. And I begged senator crews to think. Every ultra thought. And he says you know. I mean different things reasons long. Not be so. I don't know who. Let's consider William Goldman's words and not be revenge for. And what would we do without revenge. What would we do what we didn't spend all that money on landing strips and countries the bomb countries what would we do with that money. Who could we feed and educate. What we. We we got it right there that's perfect. All parents and maybe make you very much but there's an accident at a edit and alum thank you. All right that is all for this special issue powerhouse politics. Students them.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'Homeland' star Mandy Patinkin on 'Powerhouse Politics'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/homeland-star-mandy-patinkin-powerhouse-politics-54700869"
}