{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 11:03:53+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Ionescu scores 28, No. 6 Oregon women rout No. 5 California",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fionescu-scores-28-oregon-women-rout-california-52812793.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/ionescu-scores-28-oregon-women-rout-california-52812793",
    "language": "en",
    "localpath": null,
    "maintext": "Sabrina Ionescu had 28 points and 11 assists to lead No. 6 Oregon to a 91-54 victory over No. 25 California on Friday night.\nRuthy Hebard added 18 points and 11 rebounds for the Ducks (21-3, 10-1 Pac-12), who have won 13 of their last 14 games. Ionescu's double-double was her 11th of the season and helped Oregon to its largest margin of victory in a conference game this season.\nJaelyn Brown led the Golden Bears (15-7, 6-5) with 14 points and Alaysia Styles added 12. Kristine Anigwe, California's leading scorer at 17.5 points per game, had just six to go with eight rebounds.\nAfter a sluggish first quarter, Oregon pulled away with a 10-0 run in the second to take a 46-29 lead at the break. Ionescu had 15 points in the first half.\nThe Ducks dominated inside with a 40-28 rebound margin and 20-10 edge in second-chance points.\nIonescu was 9 of 13 from the field and 4 of 7 from 3-point range as Oregon finished 34 of 66 overall for 51.5 percent. The Golden Bears shot 21 of 55 for 38.2 percent.\nBIG PICTURE\nOregon improved the nation's best home record to 14-0 after being bumped off the No. 4 line for the top seed in the Spokane Region by Notre Dame in Thursday's latest reveal by the NCAA selection committee. The Ducks are now fifth, with UConn, Mississippi State and Louisville holding the top three spots.\nCalifornia, which is trying to reach the NCAA Tournament for the sixth time in Lindsay Gottlieb's seventh season as coach, is 0-7 against top 25 teams and 0-2 against the top 10. The Golden Bears face their eighth ranked team Sunday at Oregon State.\nUP NEXT\nCalifornia: Plays at No. 16 Oregon State on Sunday.\nOregon: Hosts No. 24 Stanford on Sunday.",
    "source_domain": "abcnews.go.com",
    "title": "Ionescu scores 28, No. 6 Oregon women rout No. 5 California",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/ionescu-scores-28-oregon-women-rout-california-52812793"
}