{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 20:16:10+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-victims-families-urge-end-gun-investments-53856325.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_f2e8c5ead3004329b7cd0dd267f1cf25_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on calls for California's public pension fund to stop investing in assault-weapon retailers (all times local):\n12:25 p.m.\nCritics of a push for the nation's largest public pension fund to divest from retailers of assault weapons are calling it an ineffective strategy and a political ploy.\nCalifornia Treasurer John Chiang, a Democrat who is running for governor, has asked the California Public Employees' Retirement System board to stop investing in companies that sell assault weapons and devices like bump stocks. The board is taking public testimony Monday.\nJason Perez of the Corona Peace Officers Association says the board has a duty to maximize investments for its retiree members. The fund only has about 70 percent of the money needed to cover payments owed to its 1.8 million members.\nJoe Morgan, a teacher, says that while he supports efforts to stop gun violence, divestment isn't the way to achieve it. He says \"there's no purpose for this hearing other than politics.\"\n———\nThis item has been corrected to show Joe Morgan's first name was incorrect.\n———\n12 p.m.\nThe father of a 27-year-old woman who died in a terrorist attack in San Bernardino, California, is calling on the nation's largest public pension fund to stop investing in companies that sell assault weapons.\nRobert Velasco says action by California's public pension board can \"send a powerful message\" to lawmakers who have failed to act after mass shootings nationwide.\nVelasco is one of several relatives of San Bernardino shooting victims who are testifying before the California Public Employees' Retirement System board. The pension fund says four of the five companies it invests in that sell guns have decided to stop selling assault weapons.\nRenee Wetzel, whose husband died in the 2015 attack, is imploring the board to \"use his memory to make a change.\"\nAlso testifying are California alumni of the Florida high school where 17 people were killed last month.\n———\n8 a.m.\nCalifornia State Treasurer John Chiang is calling on the nation's largest public pension fund to stop investing in companies that sell assault-style weapons and devices that allow guns to fire more rapidly.\nChiang will speak Monday at a board meeting of the California Public Employees' Retirement System alongside family members of victims of the 2015 terror attack in San Bernardino, California, that killed 14 people.\nThe wife of a high school teacher who died in Parkland, Florida, sent a letter supporting Chiang's effort. Chiang, a Democrat, is running for governor.\nCalPERS has a combined roughly $850 in million holdings in five companies that sell such guns or devices: Dick's Sporting Goods, Walmart, Kroger, Big 5 Sporting Goods and Sportsman's Warehouse Holdings. The fund's total value is $354 billion.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Critics call bid to end gun investment political",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-victims-families-urge-end-gun-investments-53856325"
}