{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 22:42:54+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "United's 1Q profit fell 69 percent, before dragging incident",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Funiteds-1q-profit-fell-69-percent-dragging-incident-46850697.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_d2ffa8b4e291403bbd715ef06398db7e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "United Airlines' profit plunged 69 percent in the first three months of the year, and that was before the terrible publicity surrounding the dragging of a bloodied passenger off a plane.\nThe cost of fuel, labor and maintenance all rose sharply in the first quarter, helping push United's profit down to $96 million, despite higher revenue.\nThe results released Monday beat Wall Street expectations, however. United performed better by other measures — more cancellation-free days, fewer lost bags.\nThe power to raise prices was also swinging United's way. A key revenue-per-mile figure was flat, adding to evidence that a two-year decline in average fares is over. United expects the revenue-per-mile figure to rise by 1 to 3 percent in the second quarter.\nIt is unclear whether last week's incident in which Chicago airport officers dragged a 69-year-old man off a United Express plane will halt United's progress.\nCEO Oscar Munoz issued another apology Monday.\n\"It is obvious from recent experiences that we need to do a much better job serving our customers,\" Munoz said in a statement. He said the company is \"dedicated to setting the standard for customer service among U.S. airlines.\"\nWhile the April 9 United Express Flight 3411 made headlines all last week, it has had little effect on United's stock. United Continental Holdings Inc. stock fell about the same as shares of Delta, Alaska and JetBlue last week.\nAhead of its report, United led a rally in airline stocks Monday. The Chicago-based company's shares rose $1.70, or 2.5 percent, to close at $70.77. After the financial results were released, the shares gained another 73 cents in after-hours trading.\nExcluding non-repeating items, United said first-quarter profit was 41 cents per share. Wall Street expected 38 cents per share, according to a FactSet survey of 16 analysts.\nRevenue rose 3 percent to $8.42 billion, also topping forecasts. But operating costs jumped 8 percent, driven by a 28 percent increase in fuel, a 7 percent rise in labor, and a 13 percent in maintenance and repair expenses.\nAirlines are prospering from travel demand that remains relatively strong. Reduced competition — several major airports are dominated by one or two carriers — may limit United's financial fallout to the dragging incident.\nStill, Cowen and Co. analyst Helane Becker said Monday that investors should be concerned if the incident leads to more government regulation of the airlines.\nUnited has said it is examining policies including booting passengers off sold-out flights, and has promised a complete review by April 30. It has already taken some steps, including requiring that crew members flying to assignments book flights at least an hour early. Had that policy been in place on April 9, it might have averted the need to remove four passengers to make room for Republic Airline employees on their way to staff a United Express flight the next morning.\nBesides the damage to United's reputation, investors are nervous that airlines are planning to add too many flights, undercutting the recovery in prices.\nUnited will increase domestic service this summer, adding some new routes and offering more-frequent flights on others. Munoz has defended the expansion as necessary to fill gaps in United's route map that were created when the airline was shrinking.\nUnited executives planned to discuss the first-quarter results with analysts and reporters on Tuesday.\n———\nDavid Koenig can be reached at http://twitter.com/airlinewriter",
    "source_domain": "abcnews.go.com",
    "title": "United's 1Q profit fell 69 percent, before dragging incident",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/uniteds-1q-profit-fell-69-percent-dragging-incident-46850697"
}