{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 01:22:45+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "North Korean leader Kim Jong-Un was reportedly being briefed on plans to launch missiles towards Guam.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fkim-jong-briefed-guam-attacks-sources%2Fstory%3Fid%3D49216116.json",
    "image_url": "http://a.abcnews.com/images/International/kim-jong-un-north-korea-02-gty-jc-170810_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kim Jong Un was briefed today by a North Korean general on the country's plan to launch missiles toward Guam, according to South Korea's largest news agency.\n\"Dear Supreme Leader has spent a long time to review the plan to attack Guam by surrounding it and conferred with the leaders present,\" reads a translated statement by Yonhap, attributed to KCNA, the state news agency of North Korea, of the meeting Kim had with General Kim Rak Gyom.\n\"Dear Supreme Leader has spent a long time to review the plan to attack Guam by surrounding it and conferred with the leaders present,\" the statement added.\nThe war planning came during the leader's visit on Monday to the the headquarters of Strategy Division of the North Korea's People's Army. While there, Kim warned soldiers there to stand ready to strike \"at all times,\" according to the Yonhap report.\nThe order to his army was reportedly followed by more bluster.\n\"The United States, which was the first to bring numerous strategic nuclear equipment near us, should first make the right decision and show through actions if they wish to ease tensions on the Korean Peninsula and prevent a dangerous military clash,\" Kim was quoted as saying.\n\"Dear Supreme Leader said that the Americans' reckless military confrontational behavior has ended up the U.S. trapping themselves with their own hands and are spending pathetic fate by weary minutes and seconds and that Dear Supreme Leader will watch such stupid American behavior for a bit longer,” KCNA said, according to Yonhap.\nThe report claimed that it was the Americans who were the provocateurs, for their \"reckless military confrontational behavior has ended up the U.S. trapping themselves with their own hands and are spending pathetic fate by weary minutes and seconds and that Dear Supreme Leader will watch such stupid American behavior for a bit longer.”\nWhen the preparation for battle was complete, Kim decided to take a photo with his soldiers.\n\"Dear Supreme Leader took a commemorative photo with the soldiers, who welcomed the Dear Supreme Leader with utmost excitement, to whom the Dear Supreme Leader responded by waving at them,\" KCNA reported.\nPyongyang's saber rattling comes a week after the North Korean army declared it would complete an assault to launch four intermediate ballistic missiles near Guam by mid-August. And it's one day after the U.N. passed sanctions to devastate the region; China on Tuesday announced it would phase out supplying North Korea with crucial coal imports.\nKim's rhetoric on Monday came shortly after Secretary of Defense James Mattis harshly warned North Korea of considering any sort of aggression against the U.S.\n\"If they shoot at the United States, I'm assuming they've hit the United States. ... If they do that, then it's game on,\" he said.",
    "source_domain": "abcnews.go.com",
    "title": "Kim Jong Un briefed on possible Guam attacks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/kim-jong-briefed-guam-attacks-sources/story?id=49216116"
}