{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:14:30+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "President Trump thanked the French president and military for \"taking decisive action\" against Syria.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrump-welcomes-french-president-lady-white-house-54689925.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_pol_trump_macron_welcome_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump welcomes French president, first lady to the White House\nPrison grown mrs. ground. Members of the French delegation. And distinguished guests. Welcome to the White House. Mr. President Milan and I were honored. To visit your majestic country last summer now we are thrilled to host you. And re G here. In America. The wonderful friendship. We have developed. Over the last year is a testament to the enduring friendship. That binds our two nations. It is truly fit it. That we are holding our first official state visit. With the leader of America's oldest. Ally. The proud nation. Conference. Your visit Mr. President comes at a critical time for our alliance. Along with our British friends the United States and France recently took decisive action in response. To the Syrian regime's use of chemical weapons. I want to personally thank president grown. The French military in the French people for this day this partnership. They were absolutely incredible thank you very much Mr. President thank you. The long friendship between the United States and France began 241. Years ago this month. When a nineteen year old friend. Named to Lafayette. Set sail to John in America's fight for independence. He quickly won the trust of George Washington fort bravely in the battle. And helped secure the eight of France for the American clause decades later president Andrew Jackson wrote. That the memory of Lafayette. Will be second only to that of Washington. In the hearts. Of the American people. How are too great republics linked together by the time this bonds of history. Culture and guest and we are people who cherish our values protect our civilization. And recognize the image of god and every human soul. This legacy is made us who we are and given us what we hold dear the blessings of faith and freedom. The marvels of art and science the love of family and community and the defense of home. And country. President a grown people of France people of America now is the time force shrank. So let us be strong let us be united at. Let us honor our past and face our future with confidence. And with her hot. And let the United States and France and forever. In solidarity. For the noble cause. Of liberty. And peace. Thank you very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump welcomes French president, first lady to the White House",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trump-welcomes-french-president-lady-white-house-54689925"
}