{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:15:54+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Asian stock markets mixed as North Korea tensions lessen",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fasian-stock-markets-mixed-north-korea-tensions-lessen-46855206.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_9e8092ec1a0642c99818e27294054611_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Asian stocks were mixed Tuesday as tensions over the situation on the Korean Peninsula softened somewhat following U.S. Vice President Mike Pence's departure from South Korea for Japan and an expected turn to trade issues. A strong post-Easter finish on Wall Street provided upward momentum.\nKEEPING SCORE: Japan's benchmark Nikkei 225 index added 0.2 percent to 18,397.04 while South Korea's Kospi reversed early losses to edge up 0.1 percent to 2,148.09. Hong Kong's Hang Seng shed 0.9 percent to 24,039.45 and the Shanghai Composite Index edged less than 0.1 percent lower to 3,219.87. Australia's S&P/ASX 200 fell 1 percent to 5,834.10. Shares in Taiwan and Southeast Asia were higher.\nNORTH KOREA: Pyongyang's focus on developing missiles and nuclear weapons, including its latest failed missile launch, remain on investors' minds though concerns are starting to ease. North Korea's deputy U.N. ambassador, Kim In Ryong, accused the U.S. of creating \"a dangerous situation\" for a nuclear war and said that the North is ready to react if the U.S. \"dares opt for a military action.\" The comments followed Pence's warning that U.S. \"strategic patience\" is over. But Pence's arrival in Tokyo on Tuesday shifts his attention from geopolitics to economic issues.\nMARKET INSIGHT: \"It seems the focus is now firmly on future missile tests from North Korea and whether any future tests will actually be successful,\" said Chris Weston, chief market strategist at IG in Melbourne. \"From here, it would all be down to Mr. Trump and his allies and what their reaction would be, but we can believe that markets will not take kindly to this,\" Weston said, adding that the best hope now is for negotiations that could potentially include China.\nDELAYED REACTION: Hong Kong and Australian markets were getting their first chance to react to China's latest economic growth data released on Monday, when they were closed for the Easter holiday. The latest figures showed an uptick in growth for the world's No. 2 economy, paradoxically displeasing investors who predict it means less chance of financial stimulus. Australian shares were also dragged down by weakening prices for iron ore and other commodities.\nWALL STREET: Major U.S. benchmarks ended higher. The Standard & Poor's 500 index climbed 0.9 percent to close at 2,349.01. The Dow Jones industrial average rose 0.9 percent to 20,636.92. The Nasdaq composite jumped 0.9 percent to 5,856.79.\nENERGY: Oil prices stabilized. Benchmark U.S. crude futures added 1 cent to $52.66 a barrel in electronic trading on the New York Mercantile Exchange. The contract lost 53 cents, or 1 percent, to settle at $52.65 a barrel on Monday. Brent crude, used to price international oils, rose 4 cents to $55.40 per barrel in London.\nCURRENCIES: The dollar strengthened to 109.09 yen from 108.90 yen in late trading Monday. The euro was steady at $1.0643.",
    "source_domain": "abcnews.go.com",
    "title": "Asian stock markets mixed as North Korea tensions lessen",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/asian-stock-markets-mixed-north-korea-tensions-lessen-46855206"
}