{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:49:06+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Troian Bellisario, Ashley Benson, Lucy Hale, Shay Mitchell and Sasha Pieterse discuss what fans can expect in the last season of the hit show.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fstars-pretty-liars-open-final-season-46853651.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_liars_2d_0847_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for The stars of 'Pretty Little Liars' open up about the final season\ngirls because I don't want them to leave. \"Pretty little liars\" gearing up for the final episode of the series. It is starting tonight and seven years after the show began, a lot of questions. A lot of questions still unanswered. Uh-huh. It is great to have Lucy, Ashley, troian and shay here with us again. Thank you y'all. Just much respect and admiration after seven years. I mean that sincerely and you have been good to us over the years. You've been good to us. Right back at you so tell me, hmm, what does it feel like that it's coming to an end Lucy. So strange. It's really bizarre. I mean, we wrapped filming in October and -- but we still knew we had this week of press to promote so this is sort of our lat shebang like our last time being together for awhile so it's very weird and now about the time we go back to filming in our hiatus normally. Can you put it in three words, the finale. I'll treat and use a high fin, game-changing. Hey. Got it. Way to go. Romantic. Yes. And shocking is good too. Shocking. This is kind of like the love letter to the fan, a wrap-up. You guys have been so good to us. You know. So, would you like to see a little sneak peek? Here you go. We haven't seen this one yet. I haven't seen this. Let's see a bit. I still we still throw it in the fireplace, throw brandy over it and flambe it. Jenna wouldn't have been able to build it. Spencer, Mary drake is a liar. My mom will prove that when she gets home tomorrow. Since you're on a first name basis with the detective why don't we just turn this thing over to him. Well, you know how that works. If we turn this in to the police it'll blow up before we even get it into the car. He wants us to play. No way. He wants to play with us. All right. And edge of my seat. On the edge of my seat watching that. Yes. Association Ashley and Sasha, if we were to check in with your characters five years from now where would you want them to be? Goodness. I don't know. I always say that I'd want Hannah to become this huge fashion mogul and in France somewhere. Like Anna wintour. Like running her own company and magazine in Paris. And for you -- Sounds like the dream. It does. I don't know, Alison, I think she became a strong wheat woman which I loved and -- but I really like the way we endeds her character so I can't really spoil it too much but you saw that she was pregnant, right? That was kind of the last thing she pregnant. So, yeah, you do. -- Oh, my gosh. We have fear of releasing -- I got hot in my body. We're sweating. We're glad to be over. What? We all announced it. For all of this secret keeping because we've been like -- it's stressful for us. Yes. You know what, you guys are giving us an example of what it must be like behind the scenes. What was the most fun being together and when the camera wasn't rolling and just -- We laugh a lot. Yeah. Yeah. We laugh a lot. For such a serious show, it's the complete opposite off set. We're always laughing. Hard for us to keep a straight face. That was completely different, yeah. What's with the tattoos? You were a little scaredly cat about it. I was. For these girls I'd do anything but a tattoo wasn't, you know -- of course, and, yeah, I'm happy about it. Just wasn't happy in the moment. A little painful. One of your super fan, only a little time left. Your question. Did you take anything as a souvenir from set. I did actually. I took there's a poster in Ezra's old apartment and it is now hanging in my living room because I thought I would look the cartoon girl in the poster. I thought I did. I don't know if I did. It's now in my home. Yeah, yeah. I stole a bunch of Spencer's jeans. A couple swim caps and bathing suits for sure. Anybody else want to Fess. I'm getting a yellow shirt. Classic that I supposedly died in. Getting a call from Warner brother, bring it back. 13 copies. They can spare one. Well, I hope we could bring all of you back. Thank you, again, and I know -- Great things, great things for each and every one of you and just cherish this time because we certainly have and \"Pretty little liars\" tonight 8:00 P.M. Eastern on freeform. We'll be right back.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "The stars of 'Pretty Little Liars' open up about the final season",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/stars-pretty-liars-open-final-season-46853651"
}