{
    "authors": [
        "Abc News",
        "More M.L."
    ],
    "date_download": "2018-07-04 18:46:11+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "\"I love to eat and I tried to enjoy the food,\" Chestnut said of his win.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FNews%2Fjoey-jaws-chestnut-gobbles-74-hotdogs-setting-world%2Fstory%3Fid%3D56364075.json",
    "image_url": "https://s.abcnews.com/images/US/nathans-hotdog-contest-1-gty-thg-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ten minutes, 74 hotdogs and an estimated 22,200 calories later, Joey \"Jaws\" Chestnut is once again the undisputed chow champion. Today marked Chestnut's 11th win at the annual Nathan's Famous Hot Dog Eating Contest in Coney Island.\n\"Seventy-four hot dogs -- I've earned it,\" he said after the event in an interview with ESPN. Chestnut marked a new world record set using his signature style of stuffing two frankfurters down his throat at a time. \"This was a beautiful day. I love to eat and I tried to enjoy the food.\"\nFor yet another year, the favorites in both the men's and women's categories -- Chestnut, 34, and Miki Sudo, 33, -- strutted off the stage after braving the broiling heat to brandish mustard title belts and oversized checks, proving they reign supreme when it comes to speed-eating encased meat.\nEduardo Munoz Alvarez/Getty Images\nChestnut, the current hotdog-eating world record holder from Vallejo, California, downed a whopping 74 weiners, dipping the buns in super-sized plastic cups of water during the 10-minute-long contest. Judges peered below and Nathan's helpers stood by with paper plates loaded with more hotdogs.\nChestnut said he had \"a vision\" for this year's win, and seemed to be unfatigued after \"10 minutes of work.\"\n\"I'm going to keep riding the wave,\" he said of his carer on the competitive eating circuit.\nNew Jersey native Carmen Cincotti finished second by eating 64 hot dogs. Third place finisher Darron Breedon got 43 frankfurters down.\nThe Fourth of July event, considered by some to be the Super Bowl of competitive eating, also featured 74-year-old Rich \"The Locust\" LeFevre -- the oldest competitor in the contest's 101-year history.\nIn the women's competition, Sudo, a native New Yorker by way of Japan and Hawaii, accomplished her goal to \"5-pete\" the competition by gobbling 37 hot dogs and water-dipped buns in 10 minutes.\nLet the pilgrimage commence! In 3 days, I'll be attempting a 5-pete at @originalnathans @eatingcontest ?? pic.twitter.com/1MK57aRHK0 — Miki Sudo (@OMGitsMIKI) July 1, 2018\n\"I had a comfortable lead, and I left room to eat more for next year,\" Sudo told ESPN while hoisting her pink title belt.\nEduardo Munoz Alvarez/Getty Images\nEduardo Munoz Alvarez/Getty Images\nSudo's dad was in the crowd to watch her win. While her grand total was four fewer than her tally last year, it was nine more than the closest challenger, Michelle Lesco.\nThird place finisher Juliet Lee came in with just 25.",
    "source_domain": "abcnews.go.com",
    "title": "Joey 'Jaws' Chestnut gobbles 74 hotdogs, setting new world record at Nathan's contest",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/News/joey-jaws-chestnut-gobbles-74-hotdogs-setting-world/story?id=56364075"
}