{
    "authors": [
        "Abc News",
        "More Paul"
    ],
    "date_download": "2017-04-17 19:41:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "What's at stake in North Korea?",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fwhats-stake-north-korea%2Fstory%3Fid%3D46831229.json",
    "image_url": "http://a.abcnews.com/images/International/AP_north-korea-military-parade-jt-170416_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "North Korea’s failed missile test this weekend is just the latest in a string of tests by the country that has stoked fears around the world.\nThere had been growing concern all week that Kim Jong-un's government would attempt some form of missile or nuclear test this weekend as it celebrated the 105th birthday of its late founder, Kim Il-sung. So while the missile test did not come as a grand surprise, it serves a reminder of the growing threat that North Korea poses to U.S. interests in East Asia and the possible threat that it could pose to the U.S. homeland in the not-too-distant future.\nHere's what you need to know:\nBallistic abilities\nAt the moment, North Korea doesn’t have the ability to hit the U.S. mainland with its missiles. However, according to data provided by Michael Elleman, senior fellow for missile defense at the International Institute for Strategic Studies, a British research institute, North Korea is in the process of developing a missile with a range of up to 3,200 kilometers (nearly 2,000 miles) known as Musudan (or Hwasong-10).\nThat puts the Musudan within striking range of Guam, a U.S. island territory in the western Pacific that is home to more than 150,000 U.S. citizens, as well as a number of U.S. military bases.\nJeon Heon-Kyun/EPA\nIn addition, North Korea is developing other missiles with even longer ranges. Among those are the KN-08 (or Hwasong-13) and KN-14 (or Hwasong-14), both of which are believed to be Intercontinental Ballistic Missiles (ICBMs). According to the Center for Strategic and International Studies, an American think tank based in Washington, D.C., the missiles have maximum ranges of 11,500 kilometers (approximately 7,146 miles) and 10,000 kilometers (approximately 6,214 miles) respectively, which puts them within striking distance of the U.S. mainland.\nFor a missile to be considered an ICBM, it must be able to travel a minimum of 3,400 miles (or about 5,500 km).\nBut experts have cast doubt on how ready the country is to launch such missiles.\n“ICBMs that are reliable are at least four years away, and more likely five to seven,” Elleman told ABC News.\nRobert Kelly, associate professor of political science at Pusan University in South Korea, pointed out that while Hawaii and Guam are closer targets that might not require an ICBM for targeting, he is \"very doubtful North Korea missile guidance systems are good enough to get a ... missile to such a precise location,\" he wrote in an email to ABC News.\nNuclear ambitions\nMissiles are just one piece of the puzzle. North Korea's nuclear program is also a concern for the international community.\nNorth Korea has conducted five nuclear tests since 2006, two of them last year.\nWhile the nuclear program is separate from the missile tests, “the real issue is whether they could put a nuke on top of that missile. That is just unknown,” said Kelly. “If I had to speculate, I would say yes, that they could nuke Japan, but no, they could not reach Hawaii or [the continental U.S.] yet.”\n“Nuclear experts believe the North to have 12 to 20 bombs, and to expand its nuclear arsenal to 40 or 50 in the next four to five years,” Sung-Yoon Lee, professor of Korean studies at Tufts University, told ABC News in an email. “That would rival the size of the United Kingdom's nuclear arsenal.”\nFirepower at this scale would “give North Korea credible ‘second strike’ capability; that is, the North attacks first, the U.S. shoots back, and the North shoots back. A series of nuclear exchanges, in a mutual destruction,” Lee added.\nWhat is the worst-case scenario?\n“The worst-case scenario is open warfare between the two Koreas into which China and the U.S. would get dragged on opposite sides and in which nuclear weapons were used,” said Kelly, noting that he thinks this is unlikely.\nBut if it were to happen, “China has never confirmed what its status would be if war [broke] out again, and we'd like to think China would be on our side, but they've so far refused to agree to that position,” Van Jackson, associate professor in the College of Security Studies at the Asia-Pacific Center for Security Studies, told ABC News.\nBut how could the U.S. get dragged into a conflict so far away? “The American alliance arrangement with South Korea and Japan would require American involvement in the case of war, much like America’s Cold War commitment to NATO,” Kelly said.\nKim Hong-Ji/Reuters\nAnd the defense of South Korea is something that the U.S. continues to guarantee.\n\"Our commitment to this historic alliance with the courageous people of South Korea has never been stronger,\" Pence said on Sunday while visiting U.S. troops stationed in the country.\nJackson explained that the most likely way the U.S. would be dragged into the conflict would be, “because of either a North Korean first strike against either South Korea or the U.S., or a U.S. preventive attack on North Korea that leads to North Korean retaliation that then escalates.”\nBut a threat is posed even by the tests, according to Professor Victor Cha, director of Asian studies at Georgetown University.\n“A failed missile test that hit Japan could spark calls for retaliation,” Cha told ABC News, which could see the U.S. become involved.\nBeyond conflict, the development of nuclear weapons in North Korea could cause other problems.\n“A collapse of the regime could spark a loose-nukes crisis and/or proliferation of weapons to non-state actors,” said Cha. In other words, terror groups could take advantage of the situation to get their hands on nuclear materials.\nFurther development of nuclear weapons in North Korea could also encourage other countries -- even ones friendly with the U.S. -- to develop their own nuclear weapons.\n“The moment we acknowledge North Korean nuclear weapons, the global taboo against nuclear weapons becomes violated; no longer sacrosanct,” said Jackson. “Practically speaking, South Korea will eventually go nuclear itself, which in turn will place tremendous pressures on Japan and Taiwan to do so as well.”\nWhat options does President Donald Trump have?\nPutting it bluntly, Jackson said: “The United States has no good options.”\nThe U.S. could launch a strike on North Korea’s nuclear arsenal, but that is “very difficult and fraught with risk” that could lead to conflict, he added.\n“A military strike is a dangerous option given that North Korean artillery stands only seconds away from Seoul where 10 million people live and 100,000 American expats, and 27,500 U.S. troops,” said Cha.\nThe U.S. could also temper its desire to see North Korea denuclearize in an attempt to get a deal with North Korea that would modestly stabilize relations in the region, Jackson said.\nBut, “this has historically been unacceptable to South Korea and to most U.S. policy officials,” he explained.\nLee said that the U.S.’s best course of action is “to put unrelenting financial pressure” on the regime that would exclude them from the U.S. dollar system -- the backbone of the global financial system.\nAFP/Getty Images\n“Such targeted sanctions have worked against Iran, Burma, Ukraine, Congo, etc., because the target is isolated from the international financial order and its partners are presented with the stark choice of either continuing to do business with the primary target or continuing to access the U.S. financial system,” he said. “Amazingly, such target financial sanctions have never been fully employed against North Korea, which is the world's leading proliferator, money-launderer, and human rights abuser.”\nBut according to Kelly, China “has mixed feelings about really cutting North Korea off from the global economy.”\n“If North Korea were to dramatically implode, most analysts expect a wave of refugees headed toward China,” South Korea, or even Japan (via boat), explained Kelly.\nJackson agreed that refugees were a concern, saying “this is one of China's longstanding concerns that has incentivized it to urge caution and restraint in Korea.”\nThe refugee flows could be “on the same scale as Syria, but perhaps with even greater desperation,” he added.\n'No joke'\nAt the end of the day, “North Korea is no joke. With its bizarre cult of personality and backwardness, the world tends to laugh at Pyongyang,” said Lee.\n“The leadership is not crazy or suicidal, hence, an imminent war is unlikely,” Lee continued. “But North Korea is a revisionist state; that is, a state that is willing to take risks to change the international environment in its favor.”\nABC News' Luis Martinez contributed to this report from the Pentagon.",
    "source_domain": "abcnews.go.com",
    "title": "What's at stake in North Korea?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/whats-stake-north-korea/story?id=46831229"
}