{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 19:46:13+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fvideos-show-assured-assad-driving-syria-battle-53853860.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_503b2e03ce1b43c19c93a3d058c68d4b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Smoothly and confidently, Syrian President Bashar Assad merged into traffic at a large roundabout in Damascus before driving himself to the suburbs where his forces are battling rebels.\nThe traffic around him and pedestrians making their way across the busy Umayyad Square gave no indication of knowing who was behind the wheel of the Honda sedan.\nHis low-profile trip was captured in videos filmed inside the car and released by his office late Sunday and early Monday. They show the president calm and assured as his forces appear close to clinching one of their most significant victories in the civil war.\nSyrian troops are on the verge of retaking eastern Ghouta, the last major rebel bastion on the outskirts of the capital, where residents took to the streets against the Assad family's decades-long rule in the early days of the 2011 uprising.\nAs he drove, Assad, wearing sunglasses, narrated his route to the camera and gave his thoughts on the battle he was going to visit. He said the images of civilians streaming out of eastern Ghouta through a corridor manned by Syrian authorities showed that his government was still popular.\nA white pickup seen in several of the videos appeared to be his only escort.\nBefore the war, Assad was known for driving in Damascus and Aleppo, Syria's largest city, and dining out with his wife. He has maintained a steady, sophisticated propaganda machine on social media throughout the war.\nHalf of Aleppo now lies in ruins after his forces, with unsparing support from Russia and Iran, destroyed the eastern part of the city to drive out rebels in 2016. Thousands of civilians fled with them and have not been able to return.\nThe scenario is repeating itself in eastern Ghouta, where government forces are waging a fierce air and ground campaign against a collection of suburbs that have resisted returning to government rule through seven years of war.\nClose to 1,500 civilians have been killed in a month of heavy shelling and airstrikes. The government now controls 80 percent of the area held by the opposition in February.\nTens of thousands of civilians have crossed over to government-held areas as the army has advanced in recent days. It is unclear where the government will house them. The fate of thousands of men wanted for military conscription and held on suspicion of desertion or fighting for the enemy remains unknown.\n\"The painful thing, despite the pride and happiness of this visit, is to see people who have been forced out of their homes and to live rough, because of the war and the terrorists,\" said Assad as he entered eastern Ghouta. Outside the window, the landscape turned steadily to wreckage and ruin.",
    "source_domain": "abcnews.go.com",
    "title": "Videos show an assured Assad driving himself to Syria battle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/videos-show-assured-assad-driving-syria-battle-53853860"
}