{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:45:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The \"GMA\" anchors discuss a hilarious parenting story that has gone viral.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fstay-home-dad-leaves-post-house-wife-46853546.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_breakfast_dad_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Stay-at-home dad leaves Post-its around the house for his wife\nI have a question for everybody. Do you ever use these at home? Post-it notes. I live by them. What to do if you forget things. I do. Stay-at-home dad in Pennsylvania. Chris illuminati and his wife doesn't want him to forget things. He writes his wife funny messages as well and has a blog, he has 60,000 people that follow him for his like post-it parenting advice. We have some of them up here with us. He writes a lot. This one says if you're curious about my culinary skills let me just state that my kids are absolutely unfazed by a home fire alarm. I have one. The kid and I are counting down to the last day of school for very different reasons. That's a good one. Any time I see a lost toy I don't feel bad for the kid losing his mind for god. I feel bad for the parents losing their minds looking for it. Sage advice. Getting my handstand used to me I was getting into a crowded nightclub. Now it means my son and I are here to see the penguins. Like deep thoughts by a parent. We were talking about -- I don't know if you remember \"Sex and the city\" and when Carrie, her boyfriend broke up with her on that little post-it and said I can't, don't hate me. Too late. That's what I think about. Much better by text. We asked some of our audience members what they would like to post and have someone find in their home so we have Janelle from Brooklyn, New York. How are you? Good. What would you -- My message was that the dust bunny is in the corner and it's going to need feeding soon. Cute. Cute. Thanks so much. Kaitlyn, what's your message? Love your outfit but not on the floor. I understand. Lara understands. Rich from Rochester. I don't iron the clothes. I just let the dryer do it. That's a guy. Once a parent -- Delivery. Your delivery really sold it.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Stay-at-home dad leaves Post-its around the house for his wife",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/stay-home-dad-leaves-post-house-wife-46853546"
}