{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:44:15+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "\"The View\" co-hosts discuss the impact of the decision to fire McCabe.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Ffbi-deputy-director-andrew-mccabe-fired-hours-set-53853200.json",
    "image_url": "https://s.abcnews.com/images/theview/180319_view_mccabe_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Former FBI Deputy Director Andrew McCabe fired hours before he was set to retire\nOkay, Friday we wondered if Jeff sessions would fire FBI director Andrew Mccabe just two days before retirement. Do you remember that? Yeah. Well, he did. He fired him right before he retired so Mccabe could lose part of his pension. There's also a report that John Kelly, general Kelly, fired Rex tillerson when he was on the toilet. Yeah. So my question is, what is it with these mean boys? They always talk about mean girls. These are very mean boys we're talking about here. I think the Mccabe thing is very important because, yes, he -- you know, Jeff sessions did this and I guess, you know, almost ruined the pension of a 20-year government employee, 20-plus years. But if you look at president trump's tweets this weekend, it appears that he is, I guess, thinking that Mccabe and Comey and Mueller are all part of this alleged conspiracy, witch hunt, to get him. And I think we should be very concerned about that because Mccabe does have some memos about his interaction with trump. What's going on here too is that Mccabe was accused of inappropriately leaking information to \"The Wall Street journal\" regarding the Clinton foundation and says that Comey gave him clearance to do so. Comey under oath said that he never sanctioned anyone giving any information to the press or leaking out. One of these two guys is lying, so when you're talking about people guessing about what's going on in the FBI in these investigations, one way or another, someone lied under oath. I don't agree with that actually because we don't really know why Mccabe was fired because the ig's report hasn't been released. Inappropriate to allow two officials to speak to reporters. That's why he was fired. But we haven't seen it. It's speculative but that being said, if you look at what Comey said during his investigation, he said I didn't leak anything and I don't know anyone anonymously leaking anything. That is not necessarily a lie because if he gave permission to his deputy -- Then is it a leak? It's not necessarily a leak.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Former FBI Deputy Director Andrew McCabe fired hours before he was set to retire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/fbi-deputy-director-andrew-mccabe-fired-hours-set-53853200"
}