{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 16:05:15+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "France has endured extreme weather the past few days, with record rainfall and multiple bolts of lightning hitting the country.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fspectacular-video-eiffel-tower-struck-lightning-55527317.json",
    "image_url": "https://s.abcnews.com/images/International/180530_vod_orig_eiffel_lightning_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Spectacular video of Eiffel Tower struck by lightning More France has endured extreme weather the past few days, with record rainfall and multiple bolts of lightning hitting the country. Coming up in the next {{countdown}} {{countdownlbl}} Coming up next: {{nextVideo.title}} {{nextVideo.description}} Skip to this video now Related Related Extras Related Videos Video Transcript Transcript for Spectacular video of Eiffel Tower struck by lightning -- This transcript has been automatically generated and may not be 100% accurate. Now Playing: The latest details on Harry and Meghan's honeymoon\nNow Playing: Spectacular video of Eiffel Tower struck by lightning\nNow Playing: Belgian police say man in suspected terror attack was set to return to prison\nNow Playing: EU proposes to ban plastic straws, stirs, and cotton buds\nNow Playing: Family thanks man who rescued boy dangling from apartment\nNow Playing: 2 cops among 3 dead in Belgium shooting\nNow Playing: Ex-North Korean spy chief reportedly heading to US for talks\nNow Playing: Citizenship, job offered to man who scaled building to save child\nNow Playing: Man scales building to save 4-year-old boy\nNow Playing: US State Department confirms an American delegation is in North Korea\nNow Playing: Border Patrol changes story about agent who shot and killed immigrant\nNow Playing: Policeman punches young woman in the head on the Jersey Shore\nNow Playing: New details emerge from surprise meeting of Korean leaders\nNow Playing: South Korean president diffuses 'difficulties' with North Korea\nNow Playing: American citizen and his wife freed from captivity in Venezuela\nNow Playing: Defense secretary says 'possibly some good news' on Korean summit\nNow Playing: Tubas, robots and lasers: Norway festival celebrates the sonic arts\nNow Playing: South Koreans expect US-North Korea summit to take place 'eventually'\nNow Playing: Fate of the Korea Summit\nNow Playing: Explosion injures 15 at Toronto restaurant Now Playing: {{itm.title}}\n{\"id\":55527317,\"title\":\"Spectacular video of Eiffel Tower struck by lightning\",\"duration\":\"0:33\",\"description\":\"France has endured extreme weather the past few days, with record rainfall and multiple bolts of lightning hitting the country.\",\"url\":\"/GMA/video/spectacular-video-eiffel-tower-struck-lightning-55527317\",\"section\":\"GMA\",\"mediaType\":\"default\"}",
    "source_domain": "abcnews.go.com",
    "title": "Spectacular video of Eiffel Tower struck by lightning",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/video/spectacular-video-eiffel-tower-struck-lightning-55527317"
}