{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:49:52+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Mark down the dates: NBA unveils full 2017-18 schedule",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fmark-dates-nba-unveils-full-2017-18-schedule-49215765.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/mark-dates-nba-unveils-full-2017-18-schedule-49215765",
    "language": "en",
    "localpath": null,
    "maintext": "DeMarcus Cousins will make an early season trip back to Sacramento, while Gordon Hayward will wait almost all season to see Utah again.\nChris Paul's return to his old Clippers home is part of a Martin Luther King Jr. day tripleheader that includes another NBA Finals rematch, while Paul George and Jimmy Butler also learned the dates of their return games Monday when the NBA released its full 2017-18 schedule — which for the first time in history features no teams playing four games in five nights.\nThe league had unveiled its opening-week national TV games and its five-game Christmas schedule last week. Opening night is Oct. 17, the earliest the regular season has started in 37 years.\nCousins will then return to California's capital city to play for the first time since the Kings traded him to New Orleans last February when the Pelicans visit on Oct. 26 as part of a TNT doubleheader.\nFrom there, it's another five months until Hayward plays in Salt Lake City for the first time since joining the Boston Celtics as a free agent in July. The Celtics visit the Jazz on March 28 for an ESPN game.\nOther nights of note:\n— George travels back to Indiana on Dec. 13 for the first time since the Pacers surprisingly dealt him to Oklahoma City.\n— Butler, another All-Star who went East to West in the summer, takes the Timberwolves into Chicago on Feb. 9.\n— The NBA's top two picks go head-to-head for the first time Nov. 15 when Markelle Fultz and Philadelphia visit Lonzo Ball and the Lakers.\n— The All-Star Game is Feb. 18 in Los Angeles.\nThe Christmas schedule, as usual, is headlined by NBA Finals foes Golden State and Cleveland meeting for the first time since the Warriors' five-game victory in June. They will meet again on Jan. 15 on the Cavaliers' home floor.\nLater that night, Paul's Houston Rockets play the Clippers at Staples Center for the first time since acquiring the point guard to play alongside James Harden in their backcourt. The opener of the TNT tripleheader features Memphis' return to the Martin Luther King Jr. Day schedule, hosting the Lakers.\nThe regular season ends April 11.\n———\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "Mark down the dates: NBA unveils full 2017-18 schedule",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/mark-dates-nba-unveils-full-2017-18-schedule-49215765"
}