{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:38:23+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Some voters in Arizona have heard about the booming economy but say they're not feeling it.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fstocks-plunged-666-points-friday-52819910.json",
    "image_url": "http://a.abcnews.com/images/WNT/180203_wn_jarvis1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Stocks plunged 666 points Friday\nBack here at home, to the economy, and the markets' worst week in two years. Friday's Dow nose-diving, reflecting a variety of jitters. ABC's Rebecca Jarvis with more. Reporter: Tonight fear that the market free-fall will continue. Stocks plunging 666 points Friday. The worst day for the Dow since June 2016. But even with those declines the major averages still up 28% over the last year. Behind the numbers, a tale of two economies. I see the tradesmen busy here in Tucson and I know our business back in Michigan is as busy as it's ever been in 25 years. Reporter: Some Arizona voters sitting down with Tom llamas describing a booming economy, but others say they're not feeling it. I see a lot of poverty. Eporter: Since the financial crisis, stock ownership has dropped from 62% to just 54%. And while dozens of corporations has handed out raises and bonuses after the tax cuts and wages are growing at their highest pace in eight years, many employees have yet to see the benefit. It's all about wages, wages, wages. It does look like we have finally hit a turning point and breaking on through the other side. Reporter: And Tom, while the markets could very well continue this volatility in the coming days, analysts says your best bet is to stay it in the long term. To put money into that 401(k) On a regular basis. If you do you had put $1,000 in five years ago, that money today would have almost doubled.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Stocks plunged 666 points Friday",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/stocks-plunged-666-points-friday-52819910"
}