{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:59:26+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Top 5 fun facts about the Westminster best in show winner",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Ftop-fun-facts-westminster-kennel-clubs-best-show%2Fstory%3Fid%3D45506762.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/RT-dog-show-01-as-170215_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The 141st annual Westminster Kennel Club Dog Show reached its dramatic conclusion last night when Rumor, a 5-year-old German shepherd, won the coveted best in show award.\n“It was awesome. An awesome experience,” Rumor’s breeder, handler and owner, Kent Boyles, said on “Good Morning America” today.\nTimothy A. Clary/AFP/Getty Images\nComeback win:\nThe German shepherd was a favorite to win at last year’s competition but ultimately lost to C.J., a German shorthaired pointer. Rumor came out of retirement just last month to perform at Westminster.\nHow Rumor got her name\nRumor, whose full name is Lockenhaus’ Rumor Has It V Kenlyn, is named after Adele’s hit song, “Rumor Has It.”\n“Actually the kids picked it,” said Boyles. “We decided to name the litter all with R’s, so the brothers and sisters were all with R letters, and the kids came up with the ‘Rumor Has It.’”\nFavorite post-win treat\nAnd how does a best in show winner celebrate? Boyles told ABC News Rumor’s favorite post-win treat is a big, juicy New York strip steak.\nFavorite playmates\nThe Boyleses also have a Chinese crested dog, a Chihuahua and a cat at home. Rumor loves running around with them and spending time with family.\nFamily members Daniel, 8, and Maria, 17, say at home Rumor loves playing tag with their cat. #WKCDogShow pic.twitter.com/G2ihoR96zI — Westminster Dog Show (@WKCDOGS) February 15, 2017\nFirst dog from herding group to win in 20 years\nNearly 2,800 dogs across 190 breeds hailing from 49 states and 16 foreign countries competed at Madison Square Garden in New York City for the title of “top dog.” But for the first time in 20 years, it went to a dog from the herding group.\n“We haven’t had a herding dog win best in show since 1987 so it was really time, I felt, that a herding dog came out and did it,” said Gail Miller Bisher, a spokesperson for Westminster. “Rumor did it. She took it all last night.”\nRumor the German Shepherd, best in show winner at the Westminster Kennel Club dog show, is here LIVE this morning. - @WKCDOGS pic.twitter.com/pHIZPxM3HG — Good Morning America (@GMA) February 15, 2017\nAnd Rumor’s family couldn’t be more proud of their pup.\n“It’s really fun to see her run around and get best in show,” Boyles’ son, Daniel, 8, said of their beloved pet.",
    "source_domain": "abcnews.go.com",
    "title": "Top 5 fun facts about the Westminster Kennel Club best in show winner",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/top-fun-facts-westminster-kennel-clubs-best-show/story?id=45506762"
}