{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 13:52:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Parenting expert Ericka Souter shares her top tips for helping parents and children get physically and emotionally ready for this upcoming school year.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fback-school-tips-parents-children-49198676.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_souter2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Back-to-school tips for parents and children\nWe're in the mode with our new series be your best back to school edition, mom.me editor Ericka souter is here with great tips. Thanks for joining us. Yes. Now, what is the key to starting the term off right is sleeping. Getting kids back to bedtimes because summer, they've been sleeping, going to bed late, waking up late. How can we get them back on track. Ease them into it. Letting them stay up to 11 every night, the night before school starts you can't say go to bed at 7:30 or 8. Two weeks before or a week before, every day make bedtime a little earlier so they're ready when they have to, you know, go to sleep on time. You have to explain them too. It's not a punishment. They'll be annoyed. They had fun all summer. If you have a late waker, you have a kid that likes to sleep in. Start getting him up earlier and earlier every day. Routines are critical. Especially bedtime routines. Want an hour before bedtime ideally cut off electronics. No running around. Let their bodies relax. Let their mind relax. Have a little one, read a story to them. Older kid, they can read by themselves and give them an alarm clock so they can take responsibility for their bedtime and wake-up time and mom and dads are alarms forever. Another countdown to class prepares them is going to see the doctor. Oh, going to the see the doctor is key. A lot of kids want a proof of an annual physical and make sure vaccinations are up to date. Do that before school start. Getting ready emotionally. Got stuff for that. Off summer off time. How do you prepare them for what's about to come. Homework is coming. Winter is coming. I know, exactly. A lot of schools will send home summer packs where they do the work before the first day of school. If you're like me I shove that to the side and don't think about it till now. Every couple every day we do a couple of sheets to be prepared. If your did not send home a packet you can buy things from Amazon or book stores to get them back in that mode. Much needed. You're sleeping welt. You're ready to learn. You're back on track and healthy. How do you keep all those schedules straight. Oh, my gosh, well, I mean it is maddening with all of the games, recitals and all the things that families have to do it's great to have a family calendar. Now you can have something like is where you put it on or you can do a Google calendar. Mine does a Google calendar, when is this, when is that? We're all over that. Ericka souter, thank you very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Back-to-school tips for parents and children",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/back-school-tips-parents-children-49198676"
}