{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:22:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The president called neo-Nazis, white supremacists and other hate groups \"repugnant to everything we hold dear as Americans.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrumps-response-deadly-attack-charlottesville-virginia-49211351.json",
    "image_url": "http://a.abcnews.com/images/Politics/170814_vod_orig_trumponcharolettesville_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump's response to the deadly attack in Charlottesville, Virginia\nWe condemn in the strongest possible terms. This egregious display of hatred bigotry. And violence on many shots. On many sects it has no place in America what is vital now is a swift restoration. Rule of law and order and the protection of innocent lives no matter our color. Creed religion or political party we are all. Americans first we want to get this situation. Straightened out in Charlottesville. And we want to study who. And we want to see what we're doing wrong as a country where and things like this can happen. I just met with the FBI director Christopher rate. And attorney general Jeff Sessions. The Department of Justice has opened a civil rights investigation. Into the deadly car attack that killed one innocent. Americans. And wounded twenty others we condemn. In the strongest possible times. This egregious display of hatred bigotry and violence. It has. No place in America. Racism is evil. The neo Nazis white supremacists. And other hate groups that are repugnant to everything. We hope the year as Americans we are equal in the eyes of our creator and we are people under the law.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump's response to the deadly attack in Charlottesville, Virginia",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trumps-response-deadly-attack-charlottesville-virginia-49211351"
}