{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2018-04-24 16:32:34+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "\"Avengers: Infinity War\" is a Marvel movie 10 years in the making with more than 20 heroes and villains gracing the screen in this epic blockbuster!",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Favengers-infinity-war-critics%2Fstory%3Fid%3D54688430.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/infinity-war-3-ht-thg-180316_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"Avengers: Infinity War\" is a Marvel movie 10 years in the making, with more than 20 heroes and villains gracing the screen in this epic blockbuster!\nInterested in Marvel? Add Marvel as an interest to stay up to date on the latest Marvel news, video, and analysis from ABC News. Add Interest\nSo, with screenings taking place all across the country Monday night, critics and bloggers immediately took to social media to voice their opinions after seeing the flick for the first time.\nThe reviews were mostly positive, as fans of the genre were amazed at the emotion and action that came from the film, starring the likes of Robert Downey Jr., Chris Evans, Chadwick Boseman, and Scarlett Johansson.\nMarvel\nNo spoilers below!\nHere's what the critics had to say and why they are excited/crazed that they have to wait until the next \"Avengers\" film to see how everything plays out.\n#InfinityWar may be the most expensive Hollywood movie ever designed to mess with its audience. People sure are going to sit through a lot of credits! — erickohn (@erickohn) April 24, 2018\nBuy a ticket for a second viewing of #AvengersInfinityWar now. The movie delivers, it's huge, and no one in your theater is going to be able to sit quietly through this one. Expect the unexpected. pic.twitter.com/8eobaAYrSF — Jill Pantozzi ? (@JillPantozzi) April 24, 2018\nNon-spoiler AVENGERS: #INFINITYWAR emotions:, in no particular order: ??????????????????????????????????????????????????????????????????????????? Not saying ANYTHING else. — Anthony Breznican (@Breznican) April 24, 2018\nEmotionally, narratively, visually, Avengers: Infinity War a very impressive piece of entertainment and storytelling. Somehow, it left me exhausted and excited at the same time. pic.twitter.com/YPICbbNNyQ — Germain Lussier (@GermainLussier) April 24, 2018\n#AvengersInfinityWar pretty much had me laughing, screaming, or crying the entire way through. It never lets up. I sat in my chair stunned as the credits rolled, speechless and sobbing. — Joshua Yehl (@JoshuaYehl) April 24, 2018\nMarvel\nAVENGERS: INFINITY WAR: A movie version of a massive comic-book crossover, for better (fun character interactions) and worse (it's pretty much all Infinity Stone shenanigans). YMMV. #avengersinfinitywar — Matt Singer (@mattsinger) April 24, 2018\nAVENGERS: INFINITY WAR is basically CAPTAIN AMERICA: CIVIL WAR times 20, except with less hero-on-hero fighting. I think people who loved the airport fight in CIVIL WAR like I did will go nuts for this film, and people who were bored will be 20 times as bored here. #InfinityWar — Tasha Robinson (@TashaRobinson) April 24, 2018\nAVENGERS: INFINITY WAR is very weighty and juggles most of its characters with consideration. It’s the closest thing to a Paul Thomas Anderson movie you’ll find in the Marvel Cinematic Universe. I Am Shook! #Marvel #AvengersInfinityWar pic.twitter.com/YgntkXFIkv — Rudie Obias (@RudieObias) April 24, 2018\nHoly Hell. Avengers: Infinity War is the real deal. Was left breathless sitting in the theater. Real consequences, stunning moments, awesome character interaction, and some BIG and often devastating surprises. Oh, and Thanos is terrifying and amazing. Damn. pic.twitter.com/WWhsT12GTa — Eric Eisenberg (@eeisenberg) April 24, 2018\nTo be fair, some critics felt a little unsatisfied after a big cliffhanger at the end of the film.\nAVENGERS: INFINITY WAR has like ten legit \"chill down the spine\" great moments. But it's for sure the first half of a two part movie and I left a little unsatisfied/frustrated, maybe by design ... at least that's how I feel right now three hours later. — Mike Ryan (@mikeryan) April 24, 2018\n#AvengersInfinityWar: Despite some truly thrilling moments, feels like less than the sum of its parts. A definite step down after that epic run of GotGV2 / Spidey / Thor 3 / Black Panther, but what else did I expect? — Angie J. Han (@ajhan) April 24, 2018\n\"Infinity War\" hits theaters everywhere Friday.\nABC News and Marvel are both part of parent company Disney.",
    "source_domain": "abcnews.go.com",
    "title": "'Avengers: Infinity War': What critics are saying",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/avengers-infinity-war-critics/story?id=54688430"
}