{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 04:53:09+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fpolice-assemble-patchwork-clues-hunt-austin-bomber-53860698.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_a2106ab0b6814445b99990b72b02a195_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In the search for answers to a series of explosions in Texas, authorities have come ahead with a simple plea to whoever's behind the blasts: Talk to us.\nThe Austin police chief's direct appeal, complete with promises to listen to the bomber and try to understand the reasons, reflects the stubborn progress of the investigation in which there's no known motivation and the ties between the victims are opaque at best. It may also represent a ploy to coax a response that could give clues or help police prepare for what might come next.\n\"It puts law enforcement and police in a down power dynamic and instills power on the person,\" said Randall Rogan, a Wake Forest University professor who is an expert on forensic linguistic analysis and worked with the FBI on the Unabomber case. \"It gives (perpetrators) a sense of satisfaction, of pride, of accomplishment, that they are in charge.\"\nAn explosion on Sunday night was the fourth in Austin this month, and represented a stepped-up level of sophistication in the attack. Unlike the previous bombings, which involved packages left on doorsteps, the latest one was placed near a hiking trail and had a thin translucent tripwire like fishing line. Two people have died in the explosions and four others have been injured.\nHundreds of officers from multiple law enforcement agencies are on the case.\nRogan said as time passes, it's likely the person or people behind the explosions will seek more than just the thrill of the crimes themselves and will desire more recognition, something that could drive them to make contact with police or release some sort of communiqu? or manifesto. He said the new complexity of the fourth bombing might suggest it was a test for something even bigger.\n\"This is an increase and expansion of sophistication and most likely a trial run for something to come in the future,\" Rogan said.\nRobert Taylor, a former police detective who is now a criminologist at the University of Texas at Dallas, said eventually there will be a break in the case, but how long it will take remains to be seen.\n\"Something will come up somewhere. It will be a fingerprint on an envelope or DNA from saliva or a unique kind of detonator, or someone will just blab in a bar,\" he said.\nFor now, though, the police chief's plea suggests they haven't reached that point.\n\"It's a sign there's probably not a lot of physical evidence in these kind of crimes that lead and point to a specific person,\" Taylor said.\nEvery tiny piece of the bombs' remnants, though, holds the potential to unlock the mystery.\nMary Ellen O'Toole, a retired FBI agent and profiler who worked on numerous bombing cases, including the Unabomber, and now heads the forensic science program at George Mason University, said because bombs require so many components, they increase the chance that whoever built it could leave a trace of themselves behind.\n\"They're looking to see if they can determine a signature for the bomber,\" she said of investigators.\nScouring the areas where the bombs went off could uncover something — a hair, a skin fragment, a part of a fingerprint — that might lead to the perpetrator. Police will analyze every part of the devices they can recover to see what clues come from wires, tape, the skill and neatness in which they were constructed, and any other detail that might help decode who the bomber is.\n\"Even the way they bend or roll the wire,\" said Michael Bussell, a former Army ordnance disposal technician who now teaches classes on the subject for the online American Military University.\nThe Unabomber case, which launched with its first blast in 1978, provides both reasons to be hopeful and concerned about the Texas explosions.\nWhile the FBI was able to build a correct profile of the bomber as having been raised in Chicago with ties to Salt Lake City and San Francisco, the big break in the case didn't come for 17 years, when he sent a 35,000-word manifesto. Even then, Ted Kaczynski was identified as the Unabomber only after his brother came forward to help authorities.\nO'Toole said it's impossible to build a nuanced profile of the killer without all the evidence, but that bombers share some characteristics. They are willing to forsake some control in their mayhem since they are leaving a device that might not reach its intended target. They enjoy the risk of it — not just the danger of building a bomb, but also of transporting it to neighborhoods where people live and they could easily be caught. And because the bombings have continued, they likely feel no remorse and are prepared to do it again.\n\"If this bomber is being motivated, in part, by the sense of power and control that he has holding the city of Austin in a state of fear, and depending how addictive that feeling is,\" she said, \"that can be a strong contributor to his doing it again and not waiting a long period of time.\"\n———\nSedensky can be reached at msedensky@ap.org or https://twitter.com/sedensky",
    "source_domain": "abcnews.go.com",
    "title": "Police assemble patchwork of clues in hunt for Austin bomber",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/police-assemble-patchwork-clues-hunt-austin-bomber-53860698"
}