{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 19:03:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Mass shootings aren't more frequent _ but they are deadlier",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fmass-shootings-frequent-deadlier-51721717.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_2e35db77647f49dd9ab82b0ac3d61a12_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It can sometimes seem as though mass shootings are occurring more frequently. Researchers who have been studying such crimes for decades say they aren't, but they have been getting deadlier.\nIn the five years since a gunman killed 20 children and six adults at a Connecticut elementary school, the nation has seen a number of massacres topping the death toll from Newtown and previous mass shootings, many of them involving rifles similar to the one used in Sandy Hook.\nBut Americans wanting to know why deadlier mass shootings are happening will get few answers. Is it is the wide availability of firearms? Is it the much-maligned \"assault weapon\" with its military style? Is it a failing mental health system?\n\"We're kind of grabbing at straws at this point in terms of trying to understand why the severity of these incidents has increased,\" said Grant Duwe, a criminologist who has been studying mass killings since the 1990s.\nThe federal government does little research on the matter, because a measure dating to the 1990s had the Centers for Disease Control and Prevention retreat from firearms research. Instead, a handful of academics, like Duwe, have toiled sometimes for decades with limited funding trying to better understand why these shootings happen and how to prevent them.\nWhile mass shootings happen with regularity, they still remain so rare that there isn't enough information to draw conclusions with any certainty.\nThe profile of mass shooters — loners, depressed individuals, people who rarely smile or those who take to the internet to rant about a perceived insult or gripe — is so broad and common that it's impossible to pinpoint who might turn that anger into violence.\n\"There are lots of people who are isolated, don't have lots of friends, who don't smile and write ugly things on the internet and blame others for their misfortunes and don't want to live anymore and talk about mass killers and maybe even admire them,\" said Northeastern University professor James Alan Fox, who began studying mass shootings in the 1980s and has written six books on the topic.\nFive years ago this week, Adam Lanza, a troubled young man in Newtown, Connecticut, shot and killed his mother in their home and then drove to Sandy Hook Elementary School with an AR-style long gun and a handgun. He fatally shot 20 children and six educators, then himself.\nIn the years since, the nation has witnessed even deadlier attacks: the Pulse nightclub shooting in Orlando in 2016 in which a gunman killed 49 people and this year's shooting in Las Vegas, where a man in a casino hotel fired on concertgoers on the ground below, killing more than 55. This year's shooting in Sutherland Springs, Texas, by an Air Force veteran who shot up a church sanctuary, killing more than two dozen, also is now among the 10 deadliest mass shootings in modern U.S. history.\nMass shootings are widely defined as one in which four or more people are killed in a public place, excluding both domestic violence and gang-related violence. The rate has remained steady at about 20 per year for the past three decades, Fox said. Still, five of the 10 deadliest have occurred since Sandy Hook, he said.\n\"Some years are worse than others, and bad years tend to be followed by not-so-bad years,\" Fox said. While two of the deadliest took place this year, \"you can't take the actions of one or two people and call it a new phenomenon. That's abberational. You can't make any pattern or trend based on that.\"\nIt's also unclear whether the higher death tolls are the result of more firearms being available or firearms being more effective. Stephen Paddock, the Las Vegas shooter, used bump stocks to allow a number of his guns to mimic fully automatic weapons, but his perch high above the outdoor concert also made the shooting more effective and deadly. That's the tactic the gunman in the 1966 University of Texas at Austin shooting used when he took to a tower overlooking the campus, shooting down for more than 90 minutes.\nIn half of the deadliest mass shootings, the perpetrator used at least one AR-style firearm. In one, the massacre at a McDonald's in San Ysidro, California, in 1984, the shooter used an Uzi submachine gun. The others were carried out with handguns, the weapon used in the majority of mass shootings.\n\"Contrary to what some folks may think, the incidence of mass public shootings has not increased since Sandy Hook or even the five years before that,\" Duwe said. \"What has changed — and this is certainly true around the time of Sandy Hook and even since then — the severity of mass public shootings has certainly increased. That is one genuine change we've seen.\"\nJillian Peterson, an assistant professor at Hamline University and a forensic psychologist who previously worked in New York crafting psychological profiles of convicted murderers facing the death penalty, recently helped launch a project designed to catalog and analyze mass shootings dating back to the 1960s. The project is being done jointly with James Densley, an associate professor of criminal justice at Metropolitan State University.\nThey have no financing and are relying on about a dozen students to gather research based on public documents and media reports.\nThe reason why someone carries out a mass shooting has been elusive, and it's a question she hopes the research will help answer. Are mass shooters of today and future bent on outdoing previous slayings by inflicting higher death tolls? That, too, is unclear. She cautions that such questions and answers continually evolve.\n\"This is ever-changing,\" Peterson said. \"Just because we understand it today, we might not understand it tomorrow. That part gets hard. This is changing as society changes.\"",
    "source_domain": "abcnews.go.com",
    "title": "Mass shootings aren't more frequent _ but they are deadlier",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/mass-shootings-frequent-deadlier-51721717"
}