{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 18:01:41+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The jail term proposed by the prime sponsors of the bill, state Sen. Bob Gardner and Rep. Paul Lundeen, is six months.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fcolorado-lawmakers-propose-jail-striking-teachers-54695016.json",
    "image_url": "https://s.abcnews.com/images/US/180424_kmgh_striking_teachers_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Colorado lawmakers propose jail for teachers on strike\nAnd yeah. Go on the strike go to jail that's how Republican state senator Bob gardeners proposed bill is punishing teachers for leaving their job. During school hours that. There employees serving and they have our children and our classrooms certain that there are expected to teach school and not to bring their political. Positions and intrusions of the cultural. Gartner says the bill has been on his mind for the last decade. But the Reese teacher strikes across the country pushed him to bring his proposal to the capitol in hopes of averting strikes from spreading to Colorado. If passed the bill would find or put a teacher in jail for up to six months the bill also allows for districts to immediately terminate the teacher without a hearing. I don't think most coloradans and most represented look at the problem and say the best solution is but didn't. The democratic candidate for governor Mike Johnston was a former teacher and an education advisor to President Obama. Says the bill is there won't solution to the State's ongoing school funding problem what we have is a school system that's one of them. Worst funded school systems in the country which means we have teachers. That have some of the lowest pay Johnson says the bill also threatens freedom of speech but Carter sees it differently. Sure that you a shirt that exposed they cannot go strikes. So all public employer. There have registry to. Gardner says punishing employees for going on strike has been done before in Colorado by a law it's considered and misdemeanor if the state employee goals on strike. As far as voicing discontent. Garner says teachers union in Colorado is vote. All I think if our teachers had such a powerful voice we would have schools were better on regret now since you posted this controversial bill on our FaceBook page. Many of you gave your opinion opposing. And ideas said adding education and make twelve dollars and fifty cents an hour as a teacher's aide until I finish my degree. I have little to no benefits and I do it because I have a passion to educate our youth. This is so sad but I could make more working in fast food.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Colorado lawmakers propose jail for teachers on strike",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/colorado-lawmakers-propose-jail-striking-teachers-54695016"
}