{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:31:54+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Dj Tiesto told \"Nightline,\" \"I never really had mega hits...but all my music is known in the subcultures, it's known in colleges or on dance festivals - everybody knows Tiesto.\"",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fim-commercial-underground-dj-55548278.json",
    "image_url": "https://s.abcnews.com/images/Nightline/180530_ntl_tiesto_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "DJ Tiesto: 'I'm a commercial underground DJ' More Dj Tiesto told \"Nightline,\" \"I never really had mega hits...but all my music is known in the subcultures, it's known in colleges or on dance festivals - everybody knows Tiesto.\" Coming up in the next {{countdown}} {{countdownlbl}} Coming up next: {{nextVideo.title}} {{nextVideo.description}} Skip to this video now Related Related Extras Related Videos Video Transcript Transcript for DJ Tiesto: 'I'm a commercial underground DJ' This transcript has been automatically generated and may not be 100% accurate. Now Playing: Music world celebrates life of influential DJ Avicii\nNow Playing: DJ Tiesto: 'I'm a commercial underground DJ'\nNow Playing: 'Roseanne' canceled after Roseanne Barr's racist tweet\nNow Playing: With 'Roseanne' cancelled, a look at companies making changes after social response\nNow Playing: Rose McGowan, other alleged victims of Weinstein react to arrest\nNow Playing: The final lap: Danica Patrick on her journey to NASCAR stardom and why she's retiring\nNow Playing: Harvey Weinstein expected to surrender to face criminal charges\nNow Playing: New NFL mandate requiring players to stand for national anthem sparks debate\nNow Playing: 9-year-old internet star Lil Tay on her controversial videos: 'It's all me'\nNow Playing: Milwaukee police release body cam footage of Sterling Brown's arrest\nNow Playing: How 'Star Wars' fans Donald Glover and Alden Ehrenreich prepped for 'Solo'\nNow Playing: Up close and personal with the Hawaii volcano spewing lava\nNow Playing: 'Dear White People': Inside the series taking on what it means to be black in America\nNow Playing: How the royal wedding might usher in a new era for the monarchy\nNow Playing: Texas school shooting survivors on what happened when alleged gunman opened fire\nNow Playing: 10 victims dead in Texas school shooting, explosives found, officials say\nNow Playing: Prince William, Prince Harry greet well-wishers ahead of royal wedding\nNow Playing: Meghan Markle's mom meets Prince Harry's immediate family for first time\nNow Playing: How Diana, Kate and Meghan created their own unique fashion statements\nNow Playing: The race to prevent the sudden death of mothers in childbirth in the U.S. Now Playing: {{itm.title}}\n{\"id\":55548278,\"title\":\"DJ Tiesto: 'I'm a commercial underground DJ'\",\"duration\":\"0:47\",\"description\":\"Dj Tiesto told \\\"Nightline,\\\" \\\"I never really had mega hits...but all my music is known in the subcultures, it's known in colleges or on dance festivals - everybody knows Tiesto.\\\" \",\"url\":\"/Nightline/video/im-commercial-underground-dj-55548278\",\"section\":\"Nightline\",\"mediaType\":\"default\"}",
    "source_domain": "abcnews.go.com",
    "title": "DJ Tiesto: 'I'm a commercial underground DJ'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Nightline/video/im-commercial-underground-dj-55548278"
}