{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 09:35:00+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fisraeli-spy-chief-netanyahu-planned-iran-strike-2011-55553336.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_f3b034c381e8453eaedfe8eec5d9cbc5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Israeli Prime Minister Benjamin Netanyahu gave the order in 2011 for the military to prepare to attack Iran within 15 days, a former Mossad chief said in remarks released on Thursday.\nTamir Pardo, who served as head of the Israeli intelligence agency from 2011 to 2016, told Israeli Keshet TV's investigative show Uvda that the order was not given \"for the sake of a drill,\" according to excerpts of the interview released ahead of the broadcast on Thursday evening.\n\"When he tells you to start the countdown process, you know that he isn't playing games with you,\" Pardo is quoted as saying. \"These things have enormous significance.\"\nThere was no immediate comment from Netanyahu's office on Pardo's claim.\nOn Wednesday, Netanyahu said Israel \"will not allow Iran to arm itself with nuclear weapons. We will continue to act against its intentions to establish itself militarily in Syria besides us, not just opposite the Golan Heights, but any place in Syria.\"\nPardo's claim comes as archenemies Israel and Iran are fighting a shadow war in Syria, which briefly threatened to burst into full-blown conflagration this month after Israel bombed Iranian positions in Syria, killing Iranian fighters after an alleged Iranian rocket barrage toward the Israeli-controlled Golan Heights.\nIn February, Israel shot down what it said was an armed Iranian drone that entered Israeli airspace. Israel responded by attacking anti-aircraft positions in Syria, and an Israeli warplane was shot down during the battle.\nIsrael has increasingly warned that it sees Iranian influence in Syria as a threat, pointing to Iran's military presence inside the country as well as that of Iranian-backed militiamen.\nNetanyahu has long been a strident critic of Iran and has accused Tehran of attempting to develop nuclear weapons and long range ballistic missiles. Ex-prime minister Ehud Barak, who served as Netanyahu's defense minister in 2011, has previously claimed Netanyahu sought to bomb Iran in 2010 and 2011, but was opposed by senior Israeli officials.\nPardo said that upon receiving the command, he sought \"clarifications about everything I could, I checked with legal advisers, I consulted with everyone I could to understand who is authorized to give the order concerning launching a war.\"\nAccording to the excerpts, Pardo said he wanted \"to be certain that if, heaven forbid, something incorrect happened, even if the mission failed, that there won't be a situation where I carried out an illegal operation.\"\nIt wasn't clear from the preview what happened after Netanyahu's purported order but Israel never carried out a strike on Iran in 2011.\nNetanyahu has recently intensified his criticism of the nuclear agreement reached between world powers and Iran in 2015. President Donald Trump withdrew the United States from that deal earlier this month.\nThere is also a concerted effort by Netanyahu's administration to convince Russia to pressure Iran to withdraw its forces from war-torn Syria.",
    "source_domain": "abcnews.go.com",
    "title": "Ex-Israeli spy chief: Netanyahu planned Iran strike in 2011",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/israeli-spy-chief-netanyahu-planned-iran-strike-2011-55553336"
}