{
    "authors": [
        "Abc News",
        "Mary Bruce",
        "More Mary"
    ],
    "date_download": "2017-02-14 23:52:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Senate committee may call on Flynn to testify amid Russia questions",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fsenate-committee-call-flynn-testify-amid-russia-questions%2Fstory%3Fid%3D45493155.json",
    "image_url": "http://abcnews.go.com/Politics/senate-committee-call-flynn-testify-amid-russia-questions/story?id=45493155",
    "language": "en",
    "localpath": null,
    "maintext": "Senate Republican leaders said Tuesday that former National Security Adviser Mike Flynn may be called to testify before the Senate Intelligence Committee as part of its investigation into Russia’s suspected involvement in the 2016 election and the Trump administration’s potential ties to the nation.\nSen. Roy Blunt, R-Missouri, a member of the Senate Intelligence Committee and part of the Republican leadership, told reporters that he thought it was likely that Flynn would, at some point, talk to the committee about “both post-election activities and any other activities that he would be aware of.”\nFlynn resigned from his post Monday amid a swirl of questions about his calls to the Russian ambassador ahead of the inauguration. He also apologized to the vice president for misleading him about the communications, an official told ABC News.\nThe chairman of the Intelligence Committee, Richard Burr, R-North Carolina, was less committal than Blunt, but said he would not rule out calling Flynn to testify.\n“We will cast a wide net to look at individuals who can provide us additional insight into what went on,” Burr told ABC News.\nThe top Democrat on the committee, Mark Warner, of Virginia, had said definitively that he wanted Flynn to testify.\nSen. Marco Rubio, R-Florida, who also serves on the committee, said he would like to see the transcripts of the Flynn calls with Russian ambassador Sergey Kislyak, in which the two discussed sanctions on Russia during the Trump team’s transition to the White House, current and former U.S. officials confirmed to ABC last week.\nTrump has maintained he has no connections with or economic ties to Russia, as he insisted in this Jan. 11 tweet.\nRussia has never tried to use leverage over me. I HAVE NOTHING TO DO WITH RUSSIA - NO DEALS, NO LOANS, NO NOTHING! — Donald J. Trump (@realDonaldTrump) January 11, 2017\nAnd while calls between Flynn and the Russian ambassador are under investigation no clear evidence of wrongdoing has been found as of yet.\nWhile Republicans mostly insisted that the investigation should be limited to those committees that have already begun Russia investigations, Democrats say that's not enough -- calling for a bipartisan committee to investigate as well.\n“It’s critical that we fully understand the extent of the Russian government’s attempts to influence our elections and government—and we need to form a bipartisan Select Committee to investigate,” Sen. Claire McCaskill, D-Missouri, said in a statement.",
    "source_domain": "abcnews.go.com",
    "title": "Senate committee may call on Flynn to testify amid Russia questions",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/senate-committee-call-flynn-testify-amid-russia-questions/story?id=45493155"
}