{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:39:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Katherine Faulders reports from the White House South Lawn on the 139th annual White House Easter Egg Roll.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fpresident-trump-participates-139th-white-house-easter-egg-46843960.json",
    "image_url": "http://a.abcnews.com/images/US/170417_gostream_faulders_roll_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for President Trump participates in 139th White House Easter Egg Roll\nAs you can see the present a nice things to us now with parsley and aligning its pump. Wishing everybody a happy Easter thinking it's seven he was gonna come down and participate in the eastern Iran is going to have a right here. You could see everybody gearing up start finish line this is the. This is the group before Porter is coming out right now which signals that president will be out here shortly he still have to come down that. From his residence. In the hearing he also said that he is going to assist me in signing cards. Two bats to military vets he and the First Lady said they were going to go over. And that side of the south on an inference is made in in a card signing nearing a probably did not. He comes here for the eastern rallies that's. When it sounded like when he set up there but again you sign with everybody and happy Easter he said there's lots of kids lots but these tickets have been distributed to lots of kids. Lots of military that's students outside of the DC area listed in the lottery so they can come. Join in on the law as well. So he he he said he jokes there's lots of competitive kids down here that are participating in this also we should seal the president does he won't roll here. Shortly he's expected to come down here at ten. Thirty so we should expect in any minute now I want to take you back over here my the president should be rolling. Welling the exact here shortly now there's. Yeah different kinds of pastel. Eggs not share of its feet in the air and this isn't White House and this year isn't cool and signing buying. The president and the First Lady constantly come on I'll are different kinds of except here and there is nearly 151000. And that. Are expected to be he wanted this White House Easter egg roll this year that is. A lot of aegs obviously rolling on this knock on his immense started this morning at 70. And there's. And our waves of there's three different wings of an hour long and started at 7:30 this morning and goes through the afternoon so. And they said the 139. Anniversary. Of this east currently it's the longest standing tradition at the White House it was his son the White House wasn't wasn't prepared. As well. You know as they happen in previous years. The White House is obviously am denied that the eggs are made by wells would turning that that said I think they could. The message to the White House that said they were still waiting on orders but it's it's all come together it's. In the event and here is all come together there's lots of different games coming to see the ball coming right now it's which indicates that the president. Will be out here shortly. And believe what undated that this sides worldly and it's not clear if these kids are waiting. To participate and the Ed Kroll. With the president. Again there's kids from different hospitals on the DC area better and that DC united soccer team is here. Obviously been ailing parents passing horse. So we'll look even I ever hear the president is outside. CBM the president and states the First Lady on its front accompanied by their son of Mary and C barren behind the First Lady here. And on since he behind. We'll have you. This. Yeah. Lou yeah. OK yeah. Yeah. Okay. It was being. We head. The. Goes through. Yemeni and I can't. But I think it. Isn't seen. Prison hang thinking on your First Lady and Ronnie trump. Coupled with those boats and NC accompanied by Bayern trump their youngest son and his family techniques on parent Tommy John junior. All came down here need not from the I think it's a couple questions that there. Couldn't quite hear from where we were and I believe he's going down now to sign. Cards I'm for veterans he said he was going to the First Lady in the president or walking honestly announcement take you down here. Again and I was mentioning in his team now an exit rolling in this eastern world. Today starting at 7:30 this morning it's still going on three imminently examine how RD time this is the largest. Event that the White House and have the longest tradition hundreds of the 139. Anniversary. Only been canceled during what I want and relatives include whether. Following an announcement calling off while pregnant out here he concedes. This mob of people here following the president of the United States in the First Lady down here. I. Not scenes. Everybody trying to get a glimpse on hand you can see him there it's evening and and I'm here what do you expect swinging out. 21000 people coming out on for the annual you can see the Bonnie over the air wing the president but rare Sunday. Not often you see am. Easter Bunny with Britain the United States. And home. Everyone's mind township -- and it seemed like he is taking photos with some kids working the rope line here. Turn. At present it. Even you haven't had even he didn't do a lot of these. Are you you've never seen one. How many of these Medina thirteen thirteen thirteen and Rosie on the southwest. Now is this patent. Right now there. You've never seen Wednesday this song and then he's going that this signed cards nightmares out. For the residents snapped. Round things you can do all the Obama Clinton and Indianapolis before aren't citizens that this kind out of the ordinary deaths in. They're going to take him. Serena married and make our way over here the president is meaning slowly he seems to be. Working the rope line people aren't here and he's coming ninety's with the Canadian geese on a buying his handling Hank you and Eric's mom and challenging and an incident happened. A parent aunt coming out. For the annual tradition here on the south on offense the president's backyard this is not that. The usual angle you see the White House plummeted and I think it's even residents. The residents they Aaron. Now we remain our way. When the president of the united a sign cards from veterans Gary let's head over there. See weekend. We catch a glimpse of pan. Tonight yeah. Yeah. Behind it. So Dave. Dancing and tennis but. And you see a couple make America great again sign up there. That he. The slowly making his way over here where we honor. This is the station wing and signing cards veterans yeah. Explaining. That they were going to come here with his in this wins on the all the kids who are here today. I daring. Learning. An. ABC news on in in the context they would be. I'm Catherine Connors. In. The south on hearings on thirty year and he's well. There is expected to meet when he 1000. This. In previous years with. Thirty pounds and I'm so if anyone avenue just a great amount of people out here and volunteers. Game and that you can see the reason that is so mom and president of the United States in the First Lady have calmed down the in ways that. Are out there on the south on on the balcony of the residents have come down now. Kids and parents I just speaking to one Easter on here says he's doing this for thirteen years she says that. In. A different that she's never seen resident come down in Inglewood guesses wrong and do. A couple of the roles like he just instantly came over here he anticipated in the well with the parsley. Parent company sun behind. The whistle a couple times and participated in two against. Two sets of them wrong over here and he he's been. Now. Some money high seas over here he and hearing about it. Sean Spicer who worked in the administration. Has its. The Easter Bunny and dressed that the Easter Bunny I'm not sure he's in there are now. I'd like to goes he and we did see him earlier not dress that's being used to running. So we'll head over here. There's actually a couple of them wandering around I'm not sure that was the one with. The president. We could see over there and Eric trump and on junior with their father as it's really hard to see because the cameras it. And the people fire mobbing him right now but he is staying out here for quite awhile he got down here around. 1030. And he's bending he really has been an earful about. 1520. Business now. So quite this night quite mom's team and this is only out it is only one with hot. And we would interview the buddy that Huntley said buddy and did hog. Where there's I'm sorry I'm sorry about that but we'll get at least I've I've Bryant. Thank you. So there's also another wave of people coming in after this is only the second wave it's been going on at 7:30 in the morning. You could see hundreds of thousands of people out here with their kids think that as the weather. Is holding up out here. Now seems that the president is slowly but surely moving over here. To sign cards at C Michael probably be at this from 100 years old so we'll take you over there. An and I think the First Lady ace day and seemingly the children's so we'll bring it we'll bring you that we as well yeah president. Yeah apparently was. I think. Yeah. It's something that's ahead as he. It. Got out. Often. And here we into the president mountains is seeking but these tables signing cards. Veterans believe the president will be a bigger certainly in the eighties and patently and it is starting to rain. Again unfortunately it's the all of these tables out here are making these part I think it's still aren't. Here White House Easter and Raleigh right your message there which the president all right. Come on this one he's making his way over here now I think in 1990 knew him. He might even be handing back and side of the rain. And. It. So we're really trying Panasonic the president and bring you back over here where he Roland you see eye to see the they're going inside because it is about the discount born here. Probably not good for hard signing here but you can see he's making his way back up here we'll head up there. And now live I mentioned that this is only been canceled for weather and prayer for warm Hawaiian word or tail. We're lucky that we're out here today. Given the fact that it is for him. About a boy. And you could see the president making his way back up here. Now this is the area where he where he made in the and wrong. I see everybody scrambling trying to get a glimpse. The president the United States he's been here for about twenty minutes night it's C and waving over there waving goodbye going back and well. And we have us on and is it seem like news. Now as I mentioned before there was some concern that this wasn't gonna come together as a as in years past the company. Who Macy's and here you can the united. Day for the president as well laying. Senate hadn't received any orders from the White House but it seems to have worked out just fine. They see their the president smiling taking photos with people giving a nice way of over there. Mom going back inside it's easy company five hours cleaning alliance competency is daughter they're Tiffany from. And the whole family really there behind him heading back in. To the residents there. Somebody throwing a make America great again hat in the there. Towards the president's. I think I believe I can't quite see him handling these signing. President heading back into the residence there I think. We leave you guys here because it is about. Few downpour again. After voters ABC news for abcnews.com ABC news topics face thank you for tuning in for the 139. Easter egg drop from the White House.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "President Trump participates in 139th White House Easter Egg Roll",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/president-trump-participates-139th-white-house-easter-egg-46843960"
}