{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 00:38:11+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "The FAA is investigating the now viral video, as these events occur more often.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fviral-video-shows-drone-flying-dangerously-close-commercial-52819876.json",
    "image_url": "http://a.abcnews.com/images/WNT/180203_wn_gonzalez1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for A viral video shows a drone flying dangerously close to a commercial jet in Las Vegas\nNext tonight, the new FAA investigation after drone footage surfaced, a drone above directly the flight path of a passenger plane. ABC's Marcie Gonzalez reports, concerns are mounting. Reporter: Tonight, the FAA investigating after this video went viral showing a drone flying dangerously close to this jet. The plane heading in for a landing in Vegas. This video would suggest that this drone operator intentionally was trying to intercept airplanes. Reporter: Close calls like this -- We almost hit like a drone. Reporter: -- Are getting more regular. With the FAA getting more than a hundred calls a month of drones getting too close to planes and helicopters. And Id'S illegal, the FAA warning drone pilots, they can't be flown 500 miles of an airport. According to a recent FAA study, because of their parts drones that collide with planes could cause even more damage than birds of the same size. They have mental pieces, they have lithium-ion hard batteries that can chew up an engine and potentially bring an airplane down. Reporter: Investigators are still looking for the person who flew that drone near that plane in Vegas. The FAA says anyone caught breaking those laws could face fines and jail time. All right, Marcie thank you. Overseas now, reports that\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "A viral video shows a drone flying dangerously close to a commercial jet in Las Vegas",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/viral-video-shows-drone-flying-dangerously-close-commercial-52819876"
}