{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2017-04-17 19:43:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Turkey's referendum could signal trouble ahead for the country, experts say",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fturkeys-referendum-signal-trouble-ahead-country-experts%2Fstory%3Fid%3D46845523.json",
    "image_url": "http://a.abcnews.com/images/International/RT-Turkey-referendum-03-rc-170417__16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Turkey's narrow approval of a historic referendum will add to the already significant powers of President Recep Tayyip Erdogan and could signal trouble ahead for the Middle Eastern nation, experts told ABC News.\nThe referendum approved Sunday included 18 constitutional amendments, including abolishing the office of prime minister, which will eliminate a critical counterbalance to Erdogan's power. The changes will take effect after the next election in 2019.\nUmit Bektas/REUTERS\nThe measure's approval will also weaken the country's parliament and give Erdogan increased authority in picking judges and ministers, according to experts who spoke to ABC News.\nStronger, but weaker too\nDespite the boost to Erdogan's power, the vote on the referendum signaled a decrease in his overall popularity in Turkey, according to Gönül Tol, founding director of The Middle East Institute’s Center for Turkish Studies in Washington, D.C.\nThe referendum won Sunday -- as confirmed by the head of Turkey's electoral board although the vote count will continue for more than a week -- with \"yes\" votes leading \"no\" votes by 51.2 percent to 48.8 percent, with over 47 million votes counted, according to the state-run Anadolu Agency.\nThat result falls well short of the 60 percent approval that Erdogan had hoped for, despite his having a massive media advantage, Tol said.\nIn addition, the president for the first time lost the support of some of the country's major cities, including his hometown of Istanbul.\nYasin Akgul/AFP/Getty Images\n\"This is actually a huge success for the \"no\" campaign,\" Tol told ABC News.\nShe also pointed out that the vote is being challenged by the opposition on grounds of alleged voter fraud.\nThe Organization for Security and Co-operation in Europe (OSCE), an observer mission that has been monitoring the vote on the Turkish referendum, alleged today that the voting process \"fell short\" of international standards.\n\"If Erdogan had won by a larger margin, it might be different,\" Tol said. \"But to have this shift toward dictatorship without strong support and with questions of foul play, it will lead to further instability. It's going to be hard for him to run a deeply divided country.\"\nThe end of what could have been\nThe referendum's approval may close off the possibility for modern democratic values to take hold in Turkey, some analysts say.\n\"The Turkish Republic has always been flawed, but it always contained the aspiration that — against the backdrop of the principles to which successive constitutions claimed fidelity — it could become a democracy. Erdogan’s new Turkey closes off that prospect,\" wrote Steven Cook, a senior fellow for Middle East and Africa Studies at the Council on Foreign Relations, in an op-ed for Foreign Policy magazine on Sunday.\nMurad Sezer/REUTERS\nCook told ABC News today that Erdogan's support came from lower- and middle-class voters who have indeed seen positive changes in their lives and were therefore willing to back his ambition for increased authority.\n\"His core constituency at this point includes many religiously pious voters,\" Cook said. \"And they are people who have seen themselves become healthier, wealthier, and have increased transportation during his rule.\"\nThe referendum win left Erdogan's secular and liberal-minded opponents in a state of flux, Cook said.\n\"I think that what you'll see from here forward are more spontaneous and leaderless bursts of protest,\" he said, referring to a wave of anti-government protests in Turkey that made headlines in 2013. \"You'll also see increased polarization among the Turkish people.\"\nThe US and Syria\nCook told ABC News that he didn't feel that the referendum meant much for America's relations with Turkey, one of its most important allies in the region, considering that the U.S. has a history of dealing with autocratic leaders. He added, however, the measure's approval raises questions about \"whether or not Turkey shares common values\" with the U.S.\nTol said, however, that Erdogan's weakened support at home opens possibilities for change.\nShe said Erdogan might be forced by the relatively weak results to reach out Turkey's Kurdish population, the country's largest non-Turkish ethnic group, which accounts for between 10 and 20 percent of the population, according to most estimates.\nXinhua/Polaris\nIf Erdogan establishes better relations with his country's Kurds, he might find more common ground with the U.S. over its relationship with Syrian Kurds, who represent a critical U.S. ally in the region, including in the fight against ISIS in Syria, experts said.\n\"That's the hope,\" said Jim Jeffrey, who served as the U.S. ambassador to Turkey from 2008 to 2010 under President Obama.\nJeffrey struck a cautiously optimistic tone about how the referendum may affect Turkish-U.S. relations, saying the weak \"yes\" vote might signal the best possible outcome.\n\"Had Erdogan lost this vote, he would have lashed out at his enemies and become consumed with trying to bring the issue back to vote,\" Jeffrey said.\n\"We need him to move beyond this issue,\" Jeffrey said.",
    "source_domain": "abcnews.go.com",
    "title": "Turkey's referendum could signal trouble ahead for the country, experts say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/turkeys-referendum-signal-trouble-ahead-country-experts/story?id=46845523"
}