{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 00:10:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Buffett's firm invests heavily in Apple, airline stocks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbuffetts-firm-invests-heavily-apple-airline-stocks-45495077.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/buffetts-firm-invests-heavily-apple-airline-stocks-45495077",
    "language": "en",
    "localpath": null,
    "maintext": "Warren Buffett's company nearly quadrupled its investment in Apple to over 57 million shares during the last three months of last year.\nBerkshire Hathaway Inc. filed a quarterly update on its U.S. stock portfolio with the Securities and Exchange Commission on Tuesday. Besides the Apple move, Berkshire also revealed a new 8 million share stake in Monsanto and added to its relatively new airline investments.\nBerkshire's Apple Inc. stake is now worth $7.7 billion, up from roughly $2 billion the previous quarter. That investment got attention when it was first disclosed last year because Buffett has always been reluctant to invest in technology companies.\nInvestors like to look at Berkshire's investments because of Buffett's remarkably successful track record, although the filing doesn't make clear who made all the investments. Berkshire officials don't generally comment on the filings and didn't respond to questions Tuesday.\nBuffett handles the biggest investments in Berkshire's portfolio, such as Coca-Cola, Wells Fargo and IBM. He has said that investments of less than $1 billion are likely to be the work of Ted Weschler or Todd Combs, who each handle about $9 billion for Berkshire.\nBuffett surprised many people last fall by disclosing new investments in American Airlines, Delta Air Lines, United Continental and Southwest because he had previously advised investors to stay away from the airline sector.\nBerkshire added to all of its airline investments. At the end of 2016, Berkshire held 45.5 million shares of American, 60 million shares of Delta, 43.2 million shares of Southwest and nearly 29 million shares of United Continental.\nBerkshire also sold off a significant portion of its Wal-Mart investment and reduced its stake in the retailer to 1.4 million shares from nearly 13 million shares at the end of September.\nBesides investments the Omaha, Nebraska-based Berkshire owns more than 90 subsidiaries, including insurance, utility and jewelry firms.",
    "source_domain": "abcnews.go.com",
    "title": "Buffett's firm invests heavily in Apple, airline stocks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/buffetts-firm-invests-heavily-apple-airline-stocks-45495077"
}