{
    "authors": [
        "Abc News",
        "More Katie"
    ],
    "date_download": "2017-08-15 00:18:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Joyce Johnston's daughter, Nicole, wore the dress first in 1981.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fbest-friends-dress-daughters-granddaughters-dress-1st-day%2Fstory%3Fid%3D49206049.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/first-day-blue-dress-allison-lilaann-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Three Florida women and their families are living out the real-life version of “The Sisterhood of the Traveling Pants” -- a book-turned-movie about best friends who share a pair of jeans -- with a dress they affectionately call “the little blue dress.\"\nThe women, Jody Gleason, Anne Reynolds and Joyce Johnston, who all live near West Palm Beach, have been best friends for more than 40 years.\nThey have shared everything in their lives, including the blue dress that has been worn by their children and grandchildren on the first day of school since the 1980s.\nJody Gleason\nThe dress was first purchased by Joyce Johnston’s mother at a Polly Flinders store in Lantana for Johnston’s daughter, Nicole, to wear on her first day of school in 1981.\n“My mother was always a snazzy dresser so she bought this dress and gave it to Nicole to wear on her first day of school,” Johnston, 67, who lives in Lantana, told ABC News of the less than $10 dress.\nWhen Nicole was done with the dress, Johnston passed it on to Gleason for her daughter, Colleen.\n“It was just a cute dress and she looked cute in it so I had Colleen wear it on her first day of school in 1987,” Gleason said, adding that Colleen, now 35, just received her doctorate and donned a doctoral robe that, by chance, had stripes the same color as the blue dress.\nGleason returned the dress to Johnston, who in turn gave it to Reynolds, who dressed her daughter Allison, now 31, in it for her first day of school in 1990.\nAnne Reynolds\nJoyce Johnston\n“We were friends that shared everything -- child care, outgrown clothes,” Reynolds said. “At this point, Colleen had worn the dress and the logical thing was to pass it down to Allison, who is a few years younger.”\nReynolds, 61, held onto the blue dress and passed it down to her granddaughter, and Allison’s niece, LilaAnne, now 10, who wore the dress in 2011.\nThe dress was then returned to Johnston, who watched as her granddaughter, and Nicole’s daughter, Katie, wore it in 2014.\n“My mother would be so proud of her dress,” Johnston said. “She would never have thought the dress would go through so many hands. She would just say, ‘How cute is that?’”\nThe blue dress has hung in Johnston’s home since Katie wore it in 2014.\nJohnston’s 11-year-old grandson, Andrew, told her if he has a daughter one day, he’ll let her wear the dress on her first day of school.\nBefore that, Reynolds has two more granddaughters who will be ready to wear the dress in a few years and Johnston’s daughter has a niece who will also soon be old enough to wear “the little blue dress\" to school.\n“They’re endearing, all these wonderful traditions,” Johnston said. “I think they’re fading in today’s families and you just have to keep them going.\n“It’s so important to look back and see where you’ve been and where you are now and what the future holds.”",
    "source_domain": "abcnews.go.com",
    "title": "Best friends dress their daughters, granddaughters in same dress on 1st day of school",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/best-friends-dress-daughters-granddaughters-dress-1st-day/story?id=49206049"
}