{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:05:39+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "His songs taught generations of children math, history and grammar rules.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fmusic-man-school-house-rock-dies-age-94-54706345.json",
    "image_url": "https://s.abcnews.com/images/WNT/180424_wn_ender6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Music man behind 'School House Rock' dies at the age of 94\nFinally tonight here, conjunction junction, what's your function? ??? Three six nine ??? He turned multiplication into music for \"School house rock.\" ??? 21, 24, 27, 30 ??? Bob Dorough's legacy, those catchy lyrics we all know. ??? Congress junction junction ??? ??? what's your function ??? Teaching generations of kids -- and adults, too -- math, history, and tricky grammar rules. As he tells it, it started with a magic number -- three. Let's pick a number. Three. That's a good number. It turns out that his boss was upset his sons could remember the words to Jimi Hendrix, but not their math. He asked him to write some songs. I sat down at the piano and I started fooling around. ?????? ??? three is a magic number ??? The song leading to a grammy-nominated album. ??? Knowledge is power ??? And of course, \"Schoolhouse rock.\" For Dorough, a song he wrote about a lucky rabbit and the number seven says it all. Of all the songs I wrote, that's sort of me. I've been very lucky. And we were lucky, too. Bob dur Rowe was 94. I'm David Muir. We'll see you tomorrow.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Music man behind 'School House Rock' dies at the age of 94",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/music-man-school-house-rock-dies-age-94-54706345"
}