{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2018-05-30 20:36:50+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "It's been just about 24 hours since Roseanne Barr's racist tweet about former Obama adviser Valerie Jarrett, which resulted in ABC cancelling her sitcom Tuesday afternoon",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fcast-staff-network-roseanne-cancellation%2Fstory%3Fid%3D55533743.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/roseanne-show-reboot-ap-jef-180322_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A full day after Roseanne Barr launched her now-infamous racist tweet about former Obama administration adviser Valerie Jarrett - which resulted the swift cancellation on Tuesday afternoon of her ABC sitcom - the dust is starting has started to settle and there are more questions than answers.\nWhat will happen to the show's writers and producers - who are now out of a job on the same day they had been scheduled to return to work on the show’s second new season?\nWhat show will the network plug into that coveted Tuesday prime time slot?\nA network representative told ABC News on Wednesday that they are \"still discussing\" what will replace the show that premiered in March to some of the highest ratings for ABC in years. The rep said there might be a decision on what’s next for the key timeslot \"by week's end.”\nWell-known television series have been cancelled over behind-the-scenes controversies before. Arkansas-based Jim Bob and Michelle Duggar's popular TLC show, \"19 Kids and Counting,\" was cancelled after sexual molestation allegations surfaced about one of the couple's sons. VH1's \"Ev and Ocho\" was cancelled after Ocho was reportedly arrested for attacking Ev.\nBut few if any shows with a national audience as large as \"Roseanne\" had have been so abruptly cancelled.\nAdam Rose/ABC via Getty Images\nThe show's writers had been scheduled to return to work on the show's new second season on the same day it was cancelled. Both a network representative and showrunner Dave Caplan have said that Tuesday was to be the first day back for the writers - so no new plotlines had been discussed yet.\nBut the reaction in the writer’s room when the tweet dropped was “universal disgust,” Caplan told The Hollywood Reporter.\n\"The day began by reading her tweet and I was immediately horrified ... I suspected there might not be any coming back from it,\" Caplan said, adding that the racist tweet stopped everyone in their tracks and no one could work.\n\"None of us were in the frame of mind to start writing the show under the circumstances,” Caplan said. “We got together as a group for the first time and there was a lot of bittersweet hellos — and a couple hours later, a lot of very difficult goodbyes.\"\nRobert Trachtenberg/ABC via Getty Images\nCaplan said the team found out about the cancellation through the media, which was verified to them by fellow showrunner Tom Werner.\n\"Everybody is still in shock at how quickly this all went down,” he said. “It's unfortunate because the writers did pass on other jobs to take this job and nobody really knows yet what kind of compensation they're going to get. Everybody is a little bit on edge about how it's going to turn out.\"\nHe continued, \"Bruce Helford, Bruce Rasmussen and I have a pilot project with Tom Werner for ABC and we'll continue working together. I know that Tom really regretted the fact that we had such a wonderful writing staff together ... and I know he'd like to continue using it in some fashion if that were possible.\"\nCaplan hasn't heard from Barr, \"nor do I expect to,\" and stressed that her tweet \"doesn't reflect anything to do with our show, which was built on trying to explore a universal humanity that everyone goes through during hard times and difficult circumstances.\"\nWith regards to the other actors themselves on the show, stars like Sara Gilbert have said they are \"disappointed in [Barr's] actions to say the least,\" but aside from other projects currently in the works, there's no word on what some of them will do next.\nA-list stars like Mindy Kaling were quick to offer options though.\n\"Laurie Metcalf and John Goodman let me write things for you,\" she tweeted Tuesday.\nGoodman also has a few films in the work, according to IMDB, including the thriller \"Captive State.\" Metcalf - nominated for an Oscar last year for \"Lady Bird\" – is the voice of a character in the animated \"Toy Story 4.\"\nLesser known names like Alicia Goranson, who played Becky, has a film, \"Buck Run,\" that is listed as completed, while Michael Fishman, who played D.J, also has a completed project titled \"Adi Shankar's Gods and Secrets.\"\nBarr has nothing listed under her profile beyond \"Roseanne.\"",
    "source_domain": "abcnews.go.com",
    "title": "What's next for the cast, staff and network after 'Roseanne' cancellation?",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/cast-staff-network-roseanne-cancellation/story?id=55533743"
}