{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:52:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Clues scarce after half brother of N. Korean leader killed",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fclues-scarce-half-brother-korean-leader-killed-45503010.json",
    "image_url": "http://abcnews.go.com/International/wireStory/clues-scarce-half-brother-korean-leader-killed-45503010",
    "language": "en",
    "localpath": null,
    "maintext": "News of the apparent assassination of North Korean leader Kim Jong Un's half brother rippled across Asia on Wednesday as Malaysian investigators scoured airport surveillance video for clues about two female suspects and rival South Korea offered up a single, shaky motive: paranoia.\nKim Jong Nam, 46, was targeted Monday at the budget terminal of Kuala Lumpur International Airport, said a senior Malaysian government official, who spoke on condition of anonymity because the case involves sensitive diplomacy.\nKim, who died on the way to a hospital, told medical workers that he had been attacked with a chemical spray, the official said.\nMalaysian officials have provided few other details about why they believe Kim died in a targeted killing. Police said an autopsy was planned to determine the cause of death.\nSince taking power in late 2011, Kim Jong Un has executed or purged a slew of high-level government officials in what the South Korean government has described as a \"reign of terror.\"\nSouth Korea's spy service said Wednesday that North Korea had been trying for five years to kill Kim. But the National Intelligence Service did not definitively say that North Korea was behind the killing, just that it was presumed to be a North Korean operation, according to lawmakers who briefed reporters about the closed door meeting with the spy officials.\nThe NIS cited Kim Jong Un's alleged \"paranoia\" about his half brother. Still, the agency has a history of botching intelligence on North Korea and has long sought to portray the country's leaders as mentally unstable.\nMultiple South Korean media reports, citing unidentified sources, said Kim Jong Nam was killed at the airport by two women believed to be North Korean agents. They fled in a taxi and were being sought by Malaysian police, the reports said.\nPolice were searching for clues in the closed circuit television footage from the airport, said Selangor police chief Abdul Samah Mat. The airport is in Selangor, near Kuala Lumpur.\nAccording to the Malaysian government official, Kim Jong Nam was in a shopping concourse and had not yet gone through security for a planned flight to Macau when the incident occurred.\nKim was estranged from his half brother, the North Korean leader. Although he had been originally tipped by some outsiders as a possible successor to his late dictator father, Kim Jong Il, others thought that was unlikely because he lived outside the country, including recently in Macau, Singapore and Malaysia.\nHe reportedly fell further out of favor when he was caught trying to enter Japan on a false passport in 2001, saying he wanted to visit Tokyo Disneyland.\nA Malaysian police statement confirmed the death of a 46-year-old North Korean man whom it identified from his travel document as Kim Chol, born in Pyongyang on June 10, 1970.\nKen Gause, who is with the CNA think tank in Washington and has studied North Korea's leadership for 30 years, said Kim Chol was a name that Kim Jong Nam had traveled under. He is believed to have been born May 10, 1971.\nWhile the most likely explanation for the killing was that Kim Jong Un was removing a potential challenger to North Korean leadership within his own family, he could also be sending a warning to North Korean officials to demonstrate the reach of the regime. It follows the defection last year of a senior diplomat from the North Korean Embassy in London who has spoken of his despair at Kim's purges.\nMark Tokola, vice president of the Korea Economic Institute in Washington and a former deputy chief of mission at the U.S. Embassy in Seoul, said it would be surprising if Kim Jong Nam was not killed on the orders of his half brother, given that North Korean agents have reportedly tried to assassinate Kim Jong Nam in the past.\n\"It seems probable that the motivation for the murder was a continuing sense of paranoia on the part of Kim Jong Un,\" Tokola wrote in a commentary Tuesday. Although there was scant evidence that Kim Jong Nam was plotting against the North Korean leader, he provided an alternative for North Koreans who would want to depose his half brother.\nAmong Kim Jong Un's executions and purgings, the most spectacular was the 2013 execution of his uncle, Jang Song Thaek, once considered the country's second-most powerful man, for what the North alleged was treason.\nGause said Kim Jong Nam had been forthright that he did not have political ambitions, although he was publicly critical of the North Korean regime and his half brother's legitimacy in the past.\nKim Jong Nam had been less outspoken since 2011, when North Korean assassins reportedly tried to shoot him in Macau, Gause said, though the details of the attempted killing are murky. South Korea also reportedly jailed a North Korean spy in 2012 who admitted to trying to organize a hit-and-run accident targeting Kim Jong Nam in China in 2010.\nDespite the attempts on his life, Kim Jong Nam had reportedly traveled to North Korea since then, so it was assumed he was no longer under threat. Kim Jong Nam may have become more vulnerable, as his defender in the North Korean hierarchy, Kim Kyong Hui — Kim Jong Un's aunt and the wife of his executed uncle — appears to have fallen from favor or died. She has not been seen in public for more than three years, Gause said.\nKim Jong Il had at least three sons with two women, as well as a daughter by a third. Kim Jong Nam was the eldest, followed by Kim Jong Chul, who is a few years older than Kim Jong Un and is known as a playboy who reportedly attended Eric Clapton concerts in London in 2015. It's unclear what positon he has in the North Korean government.\nA younger sister, Kim Yo Jong, was named a member of the Workers' Party of Korea's Central Committee during a North Korean party congress last May. She has a position in a propaganda and agitation department and is known as Kim Jong Un's gatekeeper, Gause said.\n———\nAssociated Press writers Hyung-jin Kim in Seoul, South Korea, and Matthew Pennington in Washington, D.C., contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Clues scarce after half brother of N. Korean leader killed",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/clues-scarce-half-brother-korean-leader-killed-45503010"
}