{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 01:59:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Richard Sherman opens up about trade talk, regrets, relationship with Russell Wilson",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Frichard-sherman-opens-trade-talk-regrets-relationship-russell%2Fstory%3Fid%3D48046978.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170614_nfl_sherman_sound_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "RENTON, Wash. -- Seahawks cornerback Richard Sherman said Wednesday he did not request a trade this offseason and that he has a \"fantastic\" relationship with Seattle quarterback Russell Wilson.\n\"It's just a conversation they have every year,\" Sherman said. \"I guess this year, more people knew about it. It's a conversation they have every year -- everybody's open, everybody's available. They just made sure I knew, and you guys found out. Pretty open about it. It was never a situation where anybody asked for it. It was just a conversation.\"\nThroughout the offseason, Seahawks coach Pete Carroll and general manager John Schneider said publicly on multiple occasions that Sherman was available, but they never made a deal.\nAt one point, Schneider said the reasoning for such a trade would be to free up salary cap space and get younger on defense.\nSherman was asked why he thought the team considered moving him.\n\"Because they are always open to possibilities, to hear what people have to say,\" Sherman said. \"If somebody comes with two first-rounders, I wouldn't blame them in the least, you know? I wouldn't blame them at all. It'd be another crazy trade. Who was it that got traded like that? Herschel Walker or something like that?\n\"But it's just conversation. I think we have a fantastic relationship and always have. And it's always been transparent to have those communications and not have them in a rude or discourteous way, but just professionally.\"\nA recent ESPN The Magazine article detailed division in the Seahawks locker room and a rift between Sherman and Wilson.\nSherman was asked about his relationship with the quarterback.\n\"It's fantastic,\" Sherman said. \"We're teammates. It's like a family. It's like everyone else in a family. We fight for one another, just like I'm fighting for the other 52 guys out there; I'm fighting for him, and he's fighting for us. We have a great appreciation for how tough our quarterback is and what he has played through. Last year, he played through a number of injuries, and he's not doing that just because, 'Ah man, I've got to go out there and it's a job.' He's doing that for the guys next to him, and we appreciate that, and we think he is a great quarterback.\"\nSherman did not deny that Wilson gets treated differently by the coaching staff but downplayed the idea, saying quarterbacks get treated differently on every team.\nLast season, Sherman got into shouting matches with coaches on the sideline on two different occasions. In March, Carroll said that many of the issues Sherman had last year were \"self-inflicted.\"\nSherman was asked what he thought Carroll meant and for the first time voiced some regret for the altercations.\n\"He means I hold myself to a high standard, and I'm a heart-on-the-sleeve kind of player,\" Sherman said. \"So I'm competitive as all get out. That's what he means. He means I'm competitive as anybody out there and at all times I'm competing. At all times I'm trying to win. At all times I'm trying to push the envelope and push the limits. And it has always been the case -- publicly, privately and elsewhere. So that's what he means.\n\"It's never changed, it's never wavered. At times it might have gotten kind of overblown, I might have gone over the top. But he understood where it was coming from, and so did my teammates. So like I said before, it's just the competitiveness -- it's just a competitive team. And that's why my teammates still ride with me. They're still ride or die. Just like any other family. You're going to have good times and bad times, but you show your true colors through the good and the bad. And they ride with me through the good and the bad, and I ride with them through the good and the bad, because we've been there. We're battle-tested.\"\nDuring a game in December, Sherman openly questioned Carroll and offensive coordinator Darrell Bevell for calling a pass play from the Los Angeles Rams' 1-yard line.\nAsked at the time about the incident, Sherman pointed to the Seahawks' Super Bowl XLIX loss to the New England Patriots and a similar situation that resulted in a Wilson interception at game's end.\nBut on Wednesday, he said that Super Bowl defeat no longer hangs over the team.\n\"For it to linger, most of these guys would have to be here, and the guys that are here have moved past it,\" Sherman said. \"I mean we've had Pro Bowl, All-Pro seasons since then, and we're battling. Sometimes you run into injuries like we did last year and the year before and you get derailed. Or you run into a better opponent like we did Carolina that year, and it doesn't work out. I don't think that has anything to do with a Super Bowl hangover or anything. It's just football. A hundred percent injury rate.\n\"You need some luck to get there. And unfortunately we didn't have the luck we needed, and we didn't make the plays that we need to move forward. But I don't think it has anything to do with a Super Bowl hangover. I think we still have the tools and we still have everything we need. We win it this year, and I think the questions are still the same. I think it's just, 'Oh they got one. Is the window closing?' Because you always need a story.\"",
    "source_domain": "abcnews.go.com",
    "title": "Richard Sherman opens up about trade talk, regrets, relationship with Russell Wilson",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/richard-sherman-opens-trade-talk-regrets-relationship-russell/story?id=48046978"
}