{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 17:47:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Cruise, 55, is seen limping after slamming into a wall while attempting to leap across a gap while filming the sixth installment of \"Mission Impossible\" in London.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fvideo-shows-tom-cruise-stunt-awry-49201936.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_bb2_747_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Now Playing: Tom Cruise surprises fans in Paris\nNow Playing: Tom Cruise possibly injured on set\nNow Playing: 'Live From the Couch' with the Rev. Shawn Amos\nNow Playing: The Rev. Shawn Amos performs 'We've Got to Come Together'\nNow Playing: New video shows Tom Cruise stunt gone awry\nNow Playing: 'The Flash' star Keiynan Lonsdale on his music career\nNow Playing: Keiynan Lonsdale talks new season of 'The Flash'\nNow Playing: The cast of the hip-hop drama 'Patti Cake$' opens up live on 'GMA'\nNow Playing: Willie Nelson cuts show short, cites Utah's high altitude\nNow Playing: 'Bachelor in Paradise' preview: Alexis Waters makes a huge splash\nNow Playing: Cat celebrities and fans attend Cat-Con in Pasadena\nNow Playing: NFL star Ezekiel Elliott sits out preseason game\nNow Playing: Ron Howard shares behind-the-scenes 'Star Wars' secrets\nNow Playing: Key witness testifies in Taylor Swift groping trial\nNow Playing: NFL suspends Cowboy Ezekiel Elliott for 6 games\nNow Playing: What Would You Do: Mother Can't Afford To Give Her Son A Promised Toy Reward\nNow Playing: What Would You Do: Waitress pays more attention to phone than diners\nNow Playing: What Would You Do: Child disrupts nail salon patrons\nNow Playing: What Would You Do: Friends push girl to drink to excess",
    "source_domain": "abcnews.go.com",
    "title": "New video shows Tom Cruise stunt gone awry",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/video-shows-tom-cruise-stunt-awry-49201936"
}