{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 10:59:34+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Complex questions accompany diplomatic options on NKorea",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcomplex-questions-accompany-diplomatic-choices-nkorea-51712460.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_9c7bb69aff8847e68f588412d04f71ce_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When President Donald Trump's U.N. ambassador recently urged the world to sever diplomatic ties with North Korea, she was sketchy on the details: Should all embassies close? How about those providing the U.S. intelligence from the largely inscrutable country? And what of Sweden, which helps with imprisoned Americans?\nNikki Haley's recent call to action underscores the challenge for the United States as it tries to advance a nonmilitary strategy for resolving the nuclear standoff with North Korea. Isolating the reclusive, totalitarian state has been a central component of the U.S. plan, even though Washington says it remains open to talks.\nLike international economic penalties, the Trump administration believes the diplomatic isolation serves two purposes.\nIt's designed to punish North Korean leader Kim Jong Un for developing an atomic arsenal of bombs and intercontinental missiles that potentially could deliver nuclear warheads anywhere in the United States. U.S. officials also contend that freezing out North Korea could drive Kim's government to seek negotiations.\n\"We do know they care a lot about their international reputation,\" said Mark Tokola, a former No. 2 at the U.S. Embassy in South Korea.\nTrump's team has chalked up some successes in narrowing the North's diplomatic reach. Mexico, Peru, Italy, Spain, and Kuwait have expelled North Korean ambassadors from their countries. Haley said Portugal and the United Arab Emirates have suspended diplomatic relations. Others have cut trade and security ties.\nBut North Korea isn't and won't be completely isolated.\nLast month, China, whose once-close relationship with North Korea has been strained by its adoption of tough U.N. sanctions, sent its highest level envoy to Pyongyang in two years. North Korea also recently welcomed a Russian parliamentary delegation, in a sign of increasing contacts between the former Cold War partners. And the North just hosted the most senior U.N. official to visit in years: Jeffrey Feltman, the undersecretary-general for political affairs.\nEven before he departed, experts played down expectations that Feltman, formerly a senior American diplomat, could offer a breakthrough as the standoff over the North's nuclear weapons threatens to spiral into war. Feltman carried no message from Washington, State Department spokesman Heather Nauert said.\nYet Feltman's visit, which included an audience with Kim's foreign minister, added to questions about how effectively the U.S. can isolate North Korea. Feltman left Pyongyang on Saturday after four days of talks with the North Korean Foreign Ministry. \"I have to brief the secretary-general first,\" he said when asked for details of his trip.\nAlso unresolved is whether Trump and his top advisers have a game plan for the second half of a strategy they've called \"maximum pressure and engagement.\" If North Korea signals a willingness to negotiate, now that Kim has declared that he has \"realized the great historic cause of completing the state nuclear force,\" how will the U.S. respond?\n\"This is probably as good a time as any to try to pivot to engagement,\" said Suzanne DiMaggio at the New America think tank, who has been involved in several rounds of unofficial talks with North Korean officials. She said the administration has focused almost completely on pressure.\nKim's declaration followed North Korea's test last month of its most powerful intercontinental missile yet, which led Haley, at an emergency U.N. Security Council meeting, to speak of a world \"closer to war.\" At the same time, she pushed for others to cut trade and diplomatic ties with Pyongyang.\nU.S. officials say doing so would stop North Korea from abusing diplomatic privileges that allow it to raise revenues or conduct illegal business in support of its nuclear and missile programs. It's also intended to exploit North Korean sensitivity to its international standing.\nBut the U.S. has given mixed messages on what form concretely the isolation should take.\nHaley called on all governments to sever ties. Other U.S. officials say the emphasis is on getting North Korean diplomats expelled from overseas postings, not on closing foreign embassies in Pyongyang. To date, no embassies have shut down in the North Korean capital as a result of the U.S. campaign.\nAccording to research by the Washington-based East-West Center and the National Committee on North Korea, North Korea maintains diplomatic relations with 167 countries. It has embassies in 47 foreign capitals. Twenty-four countries have embassies in Pyongyang, and those include American rivals and friends.\n\"If the U.S. is really serious about depriving North Korea of diplomatic relations, it must start with its own closest ally, Great Britain,\" said Artyom Lukin, a North Korea expert at Far Eastern Federal University in Vladivostok, Russia.\nSince the U.S. has no diplomatic presence of its own in North Korea — the two sides remain technically in a state of war — it relies to some extent on Britain, Germany and other partners to stay abreast of what's happening there. Most critically, it needs Sweden, its protecting power, to assist three currently detained Americans in North Korea, on the rare occasions when Kim's government allows consular access.\nAny isolation campaign will have only marginal diplomatic and economic effect without the participation of North Korea's most powerful partners, China and Russia. Both support more dialogue with the North, not more diplomatic sanctions.\nEven if only smaller countries follow America's advice, the U.S. could lose potential go-betweens, such as Vietnam and Mongolia, which have constructive relations with the U.S. and North Korea.\n\"If they left, I would be worried I was losing a source of information and a more neutral voice that the North Koreans might actually listen to,\" said Frank Jannuzi, a former Senate staff specialist on Asia.\n———\nOnline:\nState Department on North Korea: https://www.state.gov/p/eap/ci/kn/",
    "source_domain": "abcnews.go.com",
    "title": "Complex questions accompany diplomatic options on NKorea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/complex-questions-accompany-diplomatic-choices-nkorea-51712460"
}