{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 09:17:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Peter Mattei: Onegin 1 of 'my trickiest parts to establish'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fpeter-mattei-onegin-trickiest-parts-establish-46842271.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_1890f88bbbf44268a629a75f9182454f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Peter Mattei has been portraying the title character in \"Eugene Onegin\" for more than a decade, but he still finds him \"one of my trickiest parts to establish.\"\n\"Something with him is like an old portrait,\" the Swedish baritone said in an interview at the Metropolitan Opera, where he is currently performing the role. \"You look at it and you wonder, 'Who is this guy?' And so much of it is about the way he looks, the way he presents himself. He doesn't give much away.\"\nTchaikovsky's opera, adapted from a novel in verse by Alexander Pushkin, tells of a bored and cynical gentleman who rejects the advances of the love-struck Tatyana, only to realize years later that he has missed his one chance for happiness.\nMattei said Onegin's hard-to-pin-down character is part of what makes him interesting to play in different versions. The Met's production, created by Deborah Warner, will be broadcast live in HD to movie theaters worldwide on Saturday.\n\"When I see a movie, I sometimes see an actor on the screen and I say, 'That could be Onegin,'\" Mattei said. \"Or someone like maybe Bob Dylan could be a good Onegin. Because after so many years of public life, he is mysteriously unknown somehow. And when he comes into a room, I think he would create some kind of unsureness in people he meets.\"\nADVISE AND REPENT\nWhen Tatyana impulsively sends Onegin a love letter, he returns it and lectures her on the need to be more discreet. The encounter leaves Tatyana shattered, but Mattei doesn't think Onegin is being deliberately cruel.\n\"He's a bit annoyed why she put him in this situation,\" he said. \"But then the letter comes and he has this responsibility. He tries to be kind to her and give her good advice. But that's not always easy. If you have children ... you might realize many years later that it might have been better not to give the good advice. You don't know the fruit.\"\nIn the opera's dramatic final scene, the tables are turned when Onegin throws off his aloof demeanor and begs Tatyana to run off with him. But, now married, she remains faithful to her husband. \"You have to sing it like a boy,\" Mattei said. \"He is a boy again. He is feeling those love feelings. It's passionate and full of torment also.\"\nPETER AND ANNA, TOGETHER AGAIN\nThis is the third time Mattei has appeared at the Met opposite Russian diva Anna Netrebko, who is portraying the role of Tatyana. They were first onstage together in Mozart's \"Don Giovanni\" in 2003, with Mattei singing the title role of the serial seducer and Netrebko as his latest prey, the peasant girl Zerlina. The next year they returned in Puccini's \"La Boheme\" in the supporting roles of the painter Marcello and his flirtatious girlfriend, Musetta.\nBoth appeared in this production of \"Onegin\" when it was new in 2013, but they were in separate casts. The current revival was designed to feature Russian baritone Dmitri Hvorostovsky in the title role, but he had to withdraw because he is battling a brain tumor.\nWHERE TO SEE IT\nThe HD broadcast of \"Eugene Onegin,\" conducted by Robin Ticciati and also starring tenor Alexey Dolgov as Lenski and bass Stefan Kocan as Prince Gremin, will be shown starting at 12:55 p.m. Eastern on Saturday. A list of theaters can be found at the Met's website: www.metopera.org/hd .\nIn the U.S., it will be repeated on Wednesday, April 26, at 6:30 p.m. local time.",
    "source_domain": "abcnews.go.com",
    "title": "Peter Mattei: Onegin 1 of 'my trickiest parts to establish'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/peter-mattei-onegin-trickiest-parts-establish-46842271"
}