{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 18:38:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Text of AP's interview with NY Fed President William Dudley",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ftext-aps-interview-ny-fed-president-william-dudley-49210641.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_61b69c4ef569403d87285ff0c22ca736_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Below is the text of an interview The Associated Press conducted Monday with William Dudley, president of the Federal Reserve Bank of New York:\nQ: I guess if we could just start with kind of your outlook for the economy, in particular the idea that at the beginning of the year, some economists were boosting their forecast, just because they felt that President Trump was going to -- his economic program would give a boost to 2017 and 2018. Could you tell us, are you lowering it now, that his program is -- your own personal forecast -- are you lowering it given that his economic program is at the moment stalled? Any comments?\nWILLIAM DUDLEY: My outlook for the economy hasn't changed materially since the beginning of the year. Continue to look for growths around 2%, slightly above trend, growth sufficient to continue to tighten the labor market. I did not raise my growth forecast after the Election because of the prospect of fiscal stimulus because I felt that there was a lot of uncertainty about how big it would be, what its composition would be, and when it would actually take effect.\nSo, I always viewed it as a risk to the forecast. In other words, an upside risk to the forecast, but I never put it into my baseline forecast.\nI think we're still on the same trajectory we've been on for several years. Above trend growth, gradually tightening labor market, inflation -- somewhat below our objective -- but we do expect as the labor market continues to tighten, to see firmer wage gains and that will ultimately filter into inflation moving up towards our 2% objective.\nQ: What do you see as the evidence for the labor market tightening?\nDUDLEY: Well, I think you can see it just directly in the unemployment rate, 4.3%, that's the lowest unemployment rate we've had in many years. If you look at some of the broader measures of unemployment, they have also come down to levels that we reached prior to the great recession. So, a pretty broad range of evidence that suggests the labor market is quite a bit tighter than it's been in many years. Which is a good thing.\nQ: Sure. In an appearance last week you said that the inflation that you look at might not get back up to 2% for 6 to 10 months, just given ... Given that outlook, why be thinking of raising rates at all?\nDUDLEY: Well, the reason why inflation won't get up to 2% very quickly on a year-over-year basis is because we've had these very low inflation readings over the last 4 or 5 months. So it's going to take time for those to sort of drop out of the year-over-year calculation.\nBut I think if you look at inflation sequentially, in other words what's inflation likely to actually do over the next 6 months, I'm expecting somewhat higher readings than what we've had over the last 6 months.\nNow the reason why I think you'd want to continue to gradually remove monetary policy accommodation, even with inflation somewhat below target, is that 1) monetary policy is still accommodative, so the level of short-term rates is pretty low, and 2) and this is probably even more important, financial conditions have been easing rather than tightening. So despite the fact that we've raised short-term interest rates, financial conditions are easier today than they were a year ago.\nThe stock market's up, credit spreads have narrowed, the dollar has weakened, and those have more than offset the effects of somewhat higher short-term rates and the very modest increases that we've seen in longer-term yields.\nQ: The markets right now are putting about a 50-50 odds of even a rate hike as late as December. Is it likely that 2 may be it for this year?\nDUDLEY: I think it depends on how the economic forecast evolves. If it evolves in line with my expectations, I would expect -- I would be in favor of doing another rate hike later this year.\nQ: Speaking a little more broadly about the issue of inflation, as you know of course there's a school of thought that says that we are in an environment where low inflation may persist far longer than anybody expects. One, it's not just domestically but globally as well.\nNobody knows, of course, whether that's correct or not. But we obviously do see very, very low inflation globally. Forecasts, including the Fed's own forecasts of inflation going back 2, 3, 4 years have consistently proved below what turned out to be reality.\nHow do you wrestle, or how do you reconcile the Fed's plans or policymaking with the idea that we may be in a long-term environment. Or, an environment of long-term persistently low inflation, and that perhaps the Fed should walk away from a 2% target? Or adjust it, or just in some ways, come to grips with the reality, or the potential reality, that we're in a very, very low inflation environment going forward for a long time?\nDUDLEY: Well, I think there's a fundamental question about whether are we in a new regime or is it just going to take some time for the inflation to move higher? There are long lags between getting to a tight labor market and that actually showing up in higher wages, and those wages then pushing into inflation.\nSo, I think the jury's out of whether there is sort of structural, secular changes in place that are holding inflation lower on a sustained basis.\nI mean one can identify some reasons for thinking that that could continue the ability for consumers and businesses to see what the prices of goods and services are broadly across a wide range of people selling goods and services is very, very good.\nThe distribution methods of how goods and services are provided have changed pretty dramatically. So this -- and I think that's probably eroding pricing power and brand loyalty. It's possible that that could be putting downward pressure on inflation.\nBut if that's the case, that's not really a bad thing. That means we can actually allow the economy to operate at a higher level potentially of resource utilization.\nIf it's true that inflation is going to be lower on a secular basis, that should allow us to continue to let the economy run a little bit longer. And continue to have above-trend job gains and to see the unemployment rate even move a little bit lower.\nSo, I think the jury is out, whether this lags or is just going to take some time for it to show through, or whether we're in a different regime.\nI think the next 4 to 6 months I think are going to be important to see whether the readings that we've had over the last few months are mainly due to one-off factors, such as the big decline that we've seen in cellphone prices, or whether there's something more fundamental going on.\nQ: Would you entertain at least the possibility that the Fed might at some point just have to suspend its rate increases, just to deal with the reality that rates remain persistently low?\nDUDLEY: I think that if the economy continues to grow above trend, and the labor market continues to tighten, I do think we'll get to the point where that will lead to higher wages and that will show up in terms of higher inflation.\nNow, the question is at what level of the unemployment rate will that all take place? So, if there are these secular forces that are pushing inflation lower, perhaps we can actually go to a somewhat lower unemployment rate. I would actually view -- rather than people wringing their hands that this is so awful that inflation is low, it actually might be a good thing because it could allow you to run the economy at a little bit higher level of resource utilization, which I think ... people get employed, they get job skills, they'd be able to build their human capital over time. (00:07:29) The productive capacity of the U.S. economy would be greater -- all those things would be good things.\nWhat we have to do, though, to discern is, what we see on inflation, is this temporary or is this something that's going to be more persistent?\nQ: You feel the jury is out on that?\nDUDLEY: I think the jury is out on that.\nQ: Given this nine-year period of very low rates, it has spawned talk about asset bubbles. Stock prices are record levels. Bond prices are up. Alan Greenspan said the bond market is going to collapse as you raise rates. Are you concerned about asset bubbles?\nDUDLEY: Well, I mean obviously, we need to continue to always look at the financial system to see whether there are misaligned asset prices that are misaligned relative to the fundamentals because if the asset prices were to move sharply, that would presumably create quite a bit of stress on the financial system.\nThen the question is could the financial system withstand that stress? So, this is something we do look at on a regular basis.\nMy own view is that -- I'm not particularly concerned about where our asset prices are today for a couple of reasons. The main one is that I think that the asset prices are pretty consistent with what we're seeing in terms of the actual performance of the economy.\nThe economy has been evolving in a very low volatility way, 2% growth a year, pretty steady. Inflation has stayed low. There is not much volatility in the economy, and I think that's translated to low volatility in financial asset markets, and that's actually helped lift valuations.\nNow obviously this means that if the economic outlook changed, if we got a lot more volatility in terms of the economy, then that could potentially prove problematic for financial markets.\nBut right now, it seems to me like the financial statements are behaving in a way that's consistent with the economic environment that we're seeing. If the financial statements were behaving in a way inconsistent with the economic environment that we've been seeing, I'd be much more concerned.\nQ: Of course speaking just to that question here, there is some concern that the Fed's accommodative rates, although they've come up somewhat, it's still so accommodative that -- and bond yields are so low, that obviously investors are pouring more and more money into equities because that's where the returns are.\nAnd so the concern is that those equity prices don't necessarily just reflect the economic fundamentals, but of course, reflect people. As bubbles form, people put things in assets they feel are going to continue to keep going up because the other options are not as appealing. Is that a concern?\nDUDLEY: I think we're going to continue to review what we're seeing in terms of asset prices. The other positive, too, I think though is that if asset prices go down, what's the consequence of that for the stability of the financial system? Well, I think the financial system is a much, much stronger place today than it was prior to the financial crisis and the Great Recession. Banks have more capital, they have more liquidity while we've corrected I think some of the structural weaknesses in the financial system.\nI don't think it's reasonable to think that the Federal Reserve is somehow going to manage financial asset prices so that they are completely stable over time. They are going to go up and down, depending on the economic environment.\nWhat we have to be cautious of is making sure that the financial system is robust, so that if there is weakness in financial asset prices, it doesn't contribute to a great stress in the financial system, which then spills into the real economy, to try to avoid what happened during the Great Recession.\nQ: There's a widely-held view in financial markets that come September, the Fed will announce that it's starting to trim its balance sheet. Is that view correct?\nDUDLEY: Well, we obviously have to have the FOMC meeting to make that decision at the next FOMC meeting. But, I don't think the expectations of market participants are unreasonable. In June, following the June FOMC meeting, we laid out a plan in terms of how we would actually do our balance sheet normalization. How we would allow Treasury and agency mortgage-backed securities to gradually run off our portfolio over time.\nAnd so the plan is out there. It's been I think generally well-received, and fully anticipated. People expect it to take place. In the last FOMC statement, we said that we expected this to happen relatively soon. So, I expect it to happen relatively soon.\nQ: And how -- just in a process -- the announcement would come in September, you've got things like the debt ceiling, all of that. Would you expect the actual implementation in October, or would that be delayed? How would that process work?\nDUDLEY: First of all, we haven't made any decision yet about whether we're actually going to start in September. So, if we were to start in September, does a debt limit ceiling discussion -- debate -- create difficulties for us? I would say not really, in the sense that the debt that we hold counts against the debt limit, just like the debt held by the private sector.\nIn some ways, we're really not part of the -- it doesn't affect -- whether we start or don't start doesn't have really any effect about when the debt limit will actually be binding.\nAnd second of all, we can obviously announce the start of the program but delay the actual start date. So I think that -- I don't think the debt limit will have big impact on our decision about whether to start or not start the balance sheet normalization process.\nQ: On the issue of the balance sheet, you've suggested that reduction in the balance sheet can affect asset prices differently from an increase in the Funds Rate. Could you speak a little bit about what kind of consequences people can expect -- ordinary people, ordinary businesses -- from the gradual reduction of the balance sheet?\nDUDLEY: Well, first of all, we need to be somewhat humble about what we know about this because we've never done this before. And that's why I think we've been very, very careful in terms of how we've gradually rolled this out, so that people can see how we're planning to do this.\nIt's one of the reasons why the reinvestment process, phasing that down, is going to happen very gradually, that we're not just going to stop abruptly because we want to make sure that the adjustments are small, the model is gentle, and don't have a big consequence for financial statements.\nSo far I would say that the market reaction has been extraordinarily mild. As expectations have gone from relatively low probability that we're going to start this to a very high probability that we're going to start this relatively soon. And so that makes me more confident that when we start, it's not going to have a big consequence for financial statements.\nFinally what I would expect is over time, as the Federal Reserve allows its portfolio to run down, that means the private sector has to absorb somewhat larger amount of Treasury securities and agency mortgage-backed securities, that will probably put some modest upward pressure on long-term yields.\nBut I wouldn't expect it to be very large for a number of reasons. One, it's already anticipated that this is going to happen. And 2) the balance sheet is going to shrink, but we're not going back to where we were in 2007, when the balance sheet was 800 billion.\nSo, the shrinkage of the balance sheet is going to be a lot smaller than the increase in the balance sheet that happened before.\nQ: ... mortgage rates or business loans. You feel like the economy can absorb that?\nDUDLEY: Yes, yes. I mean right now, long-term rates are very, very low. If you had asked me a few years ago could the U.S. economy get to a 4.3% unemployment rate and the Federal Reserve was gradually tightening monetary policy, and 10-year Treasury yields would be 2-1/4%, I would have been quite surprised. (LAUGHTER)\nQ: On the balance sheet, Chair Yellen has talked a little bit in her testimony about where it could end up. It's not going to go back to 800 billion, pre-Crisis. Where do you think it might end up?\nDUDLEY: Well, I think that's quite uncertain still because the Federal Reserve has really not made any final decisions about what kind of operating framework we want to have over the longer-term. You can have an operating framework, there's really sort of two broad choices, one where there's just a tiny amount of reserves in the banking system.\nThat's what we used prior to the financial crisis. Or a regime, which is called a floor system, where there is quite a bit more reserves in the banking system so the balance sheet would be larger as a consequence.\nThe first thing is we have to make that decision, are we going to go back to the old regime where it's just a small amount of reserves in the banking system, or are we going to actually continue with a floor system?\nMy own personal view as someone who actually ran the Open Market Desk during the Financial Crisis is I very much favor retaining a floor system, so that would imply more excess reserves in the banking system, and a somewhat bigger balance sheet.\nSo, that's the first issue.\nThe second issue is we really don't know how much excess reserves we need in the banking system for a floor system to operate efficiently without a lot of day-to-day intervention. Presumably, if we move to a floor system over the longer-term, we're going to want to have enough excess reserves in the banking system, so we don't have to intervene on a day-by-day basis.\nIf you have to intervene on a day-by-day basis, you're sort of undermining the whole advantage of operating a floor system.\nSo, I think at the end of the day, we're going to sort of learn about how much reserves we're going to need in the -- we're going to make a decision about whether it's going to be a floor system or a recorder system. And then if we decide on a floor system, we're going to learn about how much excess reserves we actually need.\nMy own view is, if I had to say today, we're probably going to see a balance sheet five years from now that's probably in the order of 2-1/2 to 3-1/2 trillion rather than the 4-1/2 trillion dollar balance sheet.\nBut that's just a rough guess. It depends on a lot of different factors, like how fast does currency grow over the next 5 years.\nSo, I think the main point I would want to make about the size of the balance sheet, we're not going back to 800 billion. That's really the thing to underscore. But there's quite a bit of uncertainty about where we're going to actually end up at this point.\nQ: You feel good though in this process, that we're not going to have a repeat of 2013, a Taper Tantrum, where we -- ?\nDUDLEY: Well, I hope so. I mean we've been trying to do this in a way -- being very sensitive to that experience. So making sure that we're gradually educating people about how this balance sheet normalization process works. We're doing it -- we're phasing down the reinvestment at a gradual pace. So the First Quarter when we actually implement this program, only 6 billion of Treasury securities will run off each month. Only 4 billion of agency mortgage-backed securities. And then it gradually phases up over the next three quarters.\nSo, all these things are done in part to make sure that there's not a large financial statement reaction, and the fact that so far as we've rolled this out, the markets have responded quite benignly makes me confident that we can avoid the kind of Taper Tantrum that we saw in 2013.\nQ: We're at a point now looking at a major amount of change in the makeup of the Federal Reserve Board, and also the Regional Presidents for that matter. A lot of new faces coming on.\nIs there a concern that with that much changeover -- I mean you've got three openings now. You could have two more next year possibly. You've got four Regional Fed Presidents who've been there less than 2 years, and likely more. Can the Federal Reserve system -- how is it going to handle all of this change?\nDUDLEY: It's not something that I have a great concern about because the mission doesn't change. So Congress has set for the Federal Reserve the dual mandate, responsibilities of maximum sustainable employment in the context of price stability. And we define price stability as 2% inflation.\nSo anybody coming onto the Fed -- the mission, that's the mission. And that doesn't change.\nThe second thing I would say is that the committee really does have a very strong consensus currently, in terms of what it wants to do going forward. The fact that the addendum to the balance sheet -- to the normalization plans -- was supported by every FOMC participant suggests that there's really strong support for the direction that the Federal Reserve is moving.\nAnd lastly, I expect that the new people will be very capable people, and I think they're going to make decisions in a way, very consistent with what we've been doing in recent years.\nSo this is not something that I'm concerned about it.\nQ: More specifically, President Trump of course has ... the 5 board members he could be appointing within now to the next 10 to 12 months. Given the President's style of seeming to prefer loyalty among appointees that he makes to all sorts of federal positions, does it concern you that the Fed's independence, especially the Board's, could be imperiled in any way by the people he puts in there, and the expectations he has for them?\nDUDLEY: Well, first of all, the Federal Reserve is ultimately a creature of Congress, and Congress sets the mandate for the Fed, and I think the Fed needs then to be evaluated vis-a-vis that mandate.\nAnd so I think anybody coming in is going to feel this is my job, to try to achieve these dual mandate objectives.\nThe second thing I would say is the Trump Administration has been very hands-off in terms of the Fed. So, I think they've been very respectful of the monetary policy, not to politicize the monetary policy process. And that's continuing a very long tradition that's been place for going back, really, 25 years to the Clinton Administration, when Bob Rubin was the head of the National Economic Council in the Clinton Administration.\nI think we've actually seen a very consistent process of how the administration treats the Fed that's very -- I don't see any meaningful change from what we saw under the Obama Administration or prior administrations.\nQ: The Republicans in Congress though have really been pushing in monetary policy a rules-based system. Some of the candidates -- John Taylor -- has rules. Will that change how you set monetary policy? Would you have those kinds of folks coming on?\nDUDLEY: Well, you know, it's a committee, and so there's lots of people on the committee. We'll have to see how it all evolves. My own view is, I've been very clear on record that I'm not in favor of a mechanical use of a monetary policy rule.\nI think monetary policy rules are useful, as guides, as an input to the monetary policy-setting process. But mechanically using a monetary policy rule I think could lead to pretty significant mistakes in terms of monetary policy.\nAnd the example I like to use is what was the Taylor rule calling for in September 2008, when we met in terms of monetary policy? Well, it was saying that the Federal Funds Rate needed to rise significantly in the Fourth Quarter of 2008, which obviously would have been a disaster because the economy was in free-fall.\nThe problem with these mechanical rules is they don't really incorporate all the information that's relevant to the monetary policy setting process.\nSo, at the September 2008 meeting, Lehman Brothers had just failed. Clearly, this was going to have pretty significant effects on the financial system as we saw. And the U.S. economy was entering a pretty deep recession. This was not the time to be raising interest rates. So, I think the rules are fine as a guide to policy, as an input of policy, and if you look at the documents that accompanied the FOMC meetings that are part of the historical record, you'll see that various monetary policy rules are part of our deliberations. Just don't force us to use them mechanically.\nQ: In the area of bank regulation, President Trump was very critical of Dodd-Frank. Republicans in Congress are trying to change it. Do you expect more changes there in how the Fed regulates the banks?\nDUDLEY: I think that we -- there are some changes to Dodd-Frank that would be completely appropriate. I've been on record, and other Fed officials have been on record, as arguing for relief for smaller banking institutions. Smaller banking institutions don't create systemic risks to the financial system, so I think they can be treated differently than large banking institutions.\nSo, that's certainly something that I think could be done. I think the Volcker Rule could probably be implemented in a way that made it less of a burden for banking firms. The Volcker Rule actually applies to very small banks, which makes very little sense to me.\nBut it's important also not to throw the baby out with the bathwater. The increase in capital requirements and liquidity requirements I think was very important. We need to keep that. The stress test that the Federal Reserve conducts on banks in order to stress their capital levels, I think is very, very important to retain.\nI think that some of the things in the Dodd-Frank Act, like the ability to resolve large systemic institutions without that threatening the rest of the financial system, very, very important that we retain that.\nThere is legislation that's been proposed in the House that would eliminate Title 2 of the Dodd-Frank Act. This is the Title that basically says that the FDIC can convert the firm to a new company by converting debt into equity. If you get rid of that, you need something in its place.\nMy view is that if a large firm were to get into difficulty and fail, you need 2 things. You need to be able to resolve it over a weekend and you need a source of liquidity on Monday morning because people will run from that institution.\nIf you don't have that, you will have a financial crisis that spreads, that has significant contagion. So, you can fix Dodd-Frank in a lot of ways. But it's really important to have the ability to resolve large institutions over the weekend and have a source of liquidity so that when businesses and households run from that troubled institution, there's a source of funding so that entity can be recapitalized and continue to go on.\nQ: On a personal level, Gary Cohn has been mentioned as potentially a Fed Chair if Yellen were not to be reappointed or declined. Did you work with Gary Cohn at Goldman Sachs? What is your impression of him as a potential Federal Reserve Chair?\nDUDLEY: I don't want to evaluate the various candidates for the Federal Reserve, except to say that I think Gary is a reasonable candidate. He knows a lot about financial markets. He knows lots about the financial system. I don't think you have to have a PhD in Economics, which I have, to be a Chair of the Fed or Governor or a President of one of the Federal Reserve Banks.\nI think it's important to have a committee that has diversity. That has different backgrounds and perspectives. So I think Gary's a reasonable candidate.\nQ: Any others you want to -- ?\nDUDLEY: No.\n(LAUGHTER)\nQ: -- names you'd mention -- any -- ?\nDUDLEY: No, no thanks.\nQ: Not going to go there. One of the things that has been discussed is the income inequality. It's gotten to be such a problem. Should the Fed accept some responsibility for the widening in income inequality, just by how they've handled rates and the fact that the wealthy who own stocks and other assets have benefited very well?\nDUDLEY: Well, I think monetary policy really isn't a tool that's well-suited to address issues of income inequality or income mobility. There's a whole other set of tools I think that can address those type of issues. Tax policy, education policy, access to opportunities. I just think it's sort of outside the Fed's purview.\nObviously, we care deeply about income inequality and income mobility, and I've been talking about it on a regular basis.\nI actually think that the income mobility issue is probably just as important -- or maybe even more important -- than the income inequality issue because I can understand why someone just starting out in their career gets paid less than someone who has a lot more experience and brings a lot more value to a firm.\nI understand that kind of income inequality. What I find a lot harder to justify is the fact that a lot of research has shown that where you're born, literally the physical location of where you're born, affects your ability to move up the income mobility scale over time, which seems extraordinarily unfair to me.\nSo, we've been putting a lot of emphasis at the bank on really trying to understand the issues of income mobility and trying to raise this issue in terms of people's consciousness. And try to develop more of a dialogue about what we could actually do about it, which I think is job training, it's access to opportunities.\nSome of the cities that we travel to around the Second District, there are jobs available in the suburbs, and the people in the inner city can't get to those jobs. So, sometimes it's just things simple like transportation. The ability of people to take advantage of those opportunities.\nI think that not providing people with opportunities I think is bad.\nQ: Who's to blame for this then?\nDUDLEY: I think we've just -- I think there hasn't been enough focus on the consequences of globalization, which I think have left people behind. And I think there hasn't been enough focus on trying to improve the opportunities for all Americans, not just some Americans.\nSo, that's what I'd like to see happen in the coming years.\nQ: We're in an unusual policy mix at the moment. You've got North Korea. Very big threat there. A variety of issues going on. Is this a hard time for Fed policymakers in particular, just because of the seeming gridlock in Washington and the heightened rhetoric that's out and about?\nDUDLEY: I don't think this is a particularly tough time. I certainly would rather be here than back in 2007, 2008. If you look at where we are, the economy is growing above trend, the unemployment rate is at 4.3%. Inflation is a little bit below our target, but not a lot below our target, so we're not missing our inflation objective by a huge margin.\nIf you look at what economists call the so-called Misery Index, the sum of inflation plus unemployment, we're probably at one of the best places we've been at for the last 50 years.\nSo, if we could just stay here -- (LAUGHS) -- and emulate Australia which is in their 26th year of economic expansion, that would be great.\nI think this is a good place to be, and I'm hoping that we can just act in a way to sustain this economic expansion so it can benefit a broader set of Americans.\nQ: We're in the third longest, now in our 9th year -- 10 years has been the maximum. When does the next recession happen?\nDUDLEY: I don't think that economic expansions die from old age. I think they die because either the economy is hit with a very adverse shock. Oftentimes those are very difficult to anticipate. Or because inflation gets out of hand and the Federal Reserve has to tighten monetary policy to keep inflation under control.\nClearly, we don't have that latter problem right now. The Fed has no reason in my view to act aggressively to tighten monetary policy. If you look at what we've done, we've been very, very gentle in terms of how we've been removing monetary policy accommodation.\nAnd as long as inflation stays low, I think that's going to continue. So, certainly, there is very little risk to the expansion coming from the Fed.\nYou could also look at the economy. It seems to be in pretty good balance. The household sector I think is well-supported by rising wages and strong job growth and a good balance sheet.\nI think that the international outlook has improved, and the dollar has weakened, and I think that provides support to business fixed investment spending and the country's trade performance.\nSo, yes, it's a pretty long-lived expansion but I don't really see things on the horizon. Knock on wood.\n(AUDIO LOST BRIEFLY - (00:32:43))\n-- recession is imminent.\nQ: You see no bubbles of any assets? Because that ultimately is what --\nDUDLEY: I mean that's too strong. I mean I think there are areas where you could sort of say, boy, asset prices might be somewhat overvalued in certain areas. But this is totally different than -- not 2007. The housing market was up dramatically. It's a hugely big market in terms of dollar value.\nSo when that started to unwind, the amount of stress that it put on the financial system was severe, and we had a much more fragile financial system at the time.\nI think we're in a very different place than we were then.\nQ: Just getting from 2% to 5%, 4%, 3% --\nDUDLEY: For growth?\nQ: GDP growth, yes.\nDUDLEY: Well, productivity growth is the key driver. I mean Real GDP growth is really the sum of how much labor input you have, plus how much productivity is increasing per an hour worked. So the way to get growth -- in the labor force, growth rate is really driven by demographics and immigration policy.\nSo, the labor force is not growing that fast. The only way you're going to get to a higher growth rate is by raising the productivity growth rate. And we'll see. Obviously, to the extent that you have some regulatory relief, that will probably push you in the right direction. It's possible that there could be new technological discoveries and dissemination of those technologies that can raise productivity growth over time.\nBut it's really productivity growth that we need to be focused on if we're going to try to get to a higher sustainable Real GDP growth rate.\nQ: So, at the moment, no change in the Fed long term forecast?\nDUDLEY: Well, I mean we've had a period of years where productivity growth has disappointed. The last year it's a little bit better. We're above 1% over the last four quarters, so we'll see.\nI mean this is very difficult to forecast. Obviously I would hope for higher productivity growth rather than lower productivity growth because that would boost people's standards of livings. Their real incomes would rise over time.\nSo, I'm in favor of Congress and the Administration, and state and local governments, doing things that raise productivity growth. Part of it's giving people better job skills, better opportunities. Removing unnecessary regulatory burden, when that's appropriate.\nIf we can do those things, probably we can get productivity up a bit. But I think we have to be realistic about how little we know about our ability to forecast productivity on a going-forward basis.\nQ: Thank you very much.",
    "source_domain": "abcnews.go.com",
    "title": "Text of AP's interview with NY Fed President William Dudley",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/text-aps-interview-ny-fed-president-william-dudley-49210641"
}