{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 15:23:18+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "A man who was identified in court documents as a \"person of interest\" after the Las Vegas massacre is now charged in connection with the massacre",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fcharges-suspect-sold-ammo-las-vegas-shooter-52814771.json",
    "image_url": "http://a.abcnews.com/images/GMA/180203_gma_ramos4_711_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Charges against suspect who sold ammo to Las Vegas shooter\nit. A man identified in court documents as a person of interest after the Las Vegas massacre S now charged in connection with that massacre. This morning he is speaking out about his contact with the gunman, Stephen paddock. ABC's Stephanie Ramos joins us now with more from Washington. Stephanie, good morning to you. Reporter: Good morning. It's been about four months since the Las Vegas massacre and we're now getting some insight as to who sold the mass killer some of the ammo found in his hotel room. I'm the guy that sold ammunition to Stephen paddock. Reporter: Overnight an ammunition seller charged in connection with the Las Vegas massacre. 55-year-old Douglas haig says he sold ammunition to Stephen paddock in the weeks before he shot and killed 58 people at an outdoor music festival. At no time did I see anything suspicious or odd. Reporter: According to court documents haig admitted to selling about 700 rounds of tracer bullets to paddock. He said he was going to go out to the desert and put on a light show either with or for his friends. Reporter: Early on in the investigation authorities say they discovered a shipping box among paddock's possessions with haig's name on it. Investigators say they also found haig's fingerprints on armor piercing bullets which were found in paddock's Vegas hotel room. The complaint alleges haig did not have a license to manufacture or sell that type of ammo. No contribution to what paddock did. I had no way to see in his mind. The product I sold him had absolutely nothing to do with what he did. I'm a vendor. Reporter: Court documents also show authorities served a warrant on his home on October 19th and seized over 100 items including more armor piercing bullets. Haig's attorney says haig was contacted by law enforcement within 24 hours of the shooting and he's been fully cooperative. Dan, Paula. Stephanie, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Charges against suspect who sold ammo to Las Vegas shooter",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/charges-suspect-sold-ammo-las-vegas-shooter-52814771"
}