{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:50:55+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "The Latest: Judge Closes Roof Competency Hearing to Public",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-judge-closes-roof-competency-hearing-public-44511245.json",
    "image_url": "http://abcnews.go.com/US/wireStory/latest-judge-closes-roof-competency-hearing-public-44511245",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the next trial phase of the man facing a possible death sentence for slaying nine people during Bible study (all times local):\n9:30 a.m.\nA federal judge has shut out the public from a second hearing on the competency of a man charged with killing nine black people during Bible study at a South Carolina church.\nU.S. District Judge Richard Gergel ruled Monday that Dylann Roof's right to a fair trial could be hampered if jurors mulling his sentence learned the contents of the hearing.\nJay Bender, an attorney for The Associated Press and other media outlets, argued against the closure. Bender said closing the hearing to the public would be keeping the community from an important part of the legal process.\nGergel said he would have had to sequester the jury if he opened up the hearing. The judge said he didn't think jurors would intentionally seek out information about the result but might come by it inadvertently, a risk he couldn't take. Gergel said he'd release a transcript of the hearing after a verdict is reached in the case.\nJurors are set to begin hearing evidence Tuesday as to why prosecutors feel he should be put to death for killing nine people at Emanuel AME Church in June 2015.\n———\n3:30 a.m.\nThe same jury that last month unanimously found Dylann Roof guilty in the slayings of nine black parishioners at a South Carolina church is returning to court to begin contemplating his punishment.\nThe sentencing phase of Roof's trial begins Tuesday in Charleston. He could face the death penalty.\nWith Roof representing himself, the process is sure to be unconventional. The 22-year-old said he plans to call no witnesses or introduce any evidence.\nProsecutors plan to call up to 38 people related to the nine people killed and three who survived the June 2015 slaughter during Bible study at Emanuel AME Church.\nEven if Roof is sentenced to death, it's highly unlikely he'd be executed anytime soon. The federal government hasn't carried out a death sentence since 2003.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Judge Closes Roof Competency Hearing to Public",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-judge-closes-roof-competency-hearing-public-44511245"
}