{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 21:45:52+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Wisconsin Wins Cotton Bowl 24-16, Only Western Michigan Loss",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fwisconsin-wins-cotton-bowl-24-16-western-michigan-44516237.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/wisconsin-wins-cotton-bowl-24-16-western-michigan-44516237",
    "language": "en",
    "localpath": null,
    "maintext": "Wisconsin tight end Troy Fumagalli made a leaping 8-yard touchdown catch in the fourth quarter and the Badgers won 24-16 in the Cotton Bowl on Monday to deny Western Michigan an undefeated season.\nThe TD catch by Fumagalli with 14 minutes left, in the back of the end zone between two defenders, came three plays after a rare interception thrown by Zach Terrell and made it 24-10.\nWith their \"Row The Boat\" mentality inspired by young head coach P.J. Fleck, the Broncos (13-1) made it from one win during his first season in Kalamazoo three years ago to the last FBS team other than No. 1 Alabama this season with a chance to be undefeated.\nBut Wisconsin (11-3), which finished with 11 wins for the fourth time in seven seasons, was clearly bigger and stronger — especially up front. The Big Ten Badgers set the tone early, with rushing touchdowns on their first two drives to take a 14-0 lead against the Group of Five team.\nFumagalli had several other highlight catches, including a one-handed 20-yard grab on the Badgers' opening drive, and a 26-yard catch to convert third-and-8 after Western Michigan scored in the fourth quarter.\nTerrell combined with All-America receiver Corey Davis for 51 career touchdowns, tying the FBS record on an 11-yarder on fourth down with 3:27 left. Even with cornerback Sojourn Shelton's arms wrapped around him in the back of the end zone, Davis broke free to make the catch.\nWestern Michigan's senior quarterback had 33 touchdowns and only four interceptions this season, the last pick by Wisconsin linebacker T.J. Edwards.\nTAKEAWAY\nWestern Michigan: The Broncos never backed down and Fleck has set a solid foundation for them to keep rowing forward, even with the loss of guys like Davis and Terrell, who were part of that one-win season in 2013. Western Michigan had only 280 total yards, 217 below its season average.\nWisconsin: The only losses this season for the Badgers were to Big Ten foes Michigan, Ohio State and Penn State — all who also played in New Year's Six games. Freshman quarterback Alex Hornibrook, who started nine games before a concussion forced him to miss the Big Ten championship game, was 2-of-2 passing. He threw the TD pass to Fumagalli, who finished with six catches for 83 yards.\nUP NEXT\nWestern Michigan knows it has to continue play Power Five teams to have chances for more New Year's Six games, and maybe eventually a playoff appearance. The Broncos open next season Sept. 2 at USC, a week before they play Michigan State, another Big Ten opponent.\nWisconsin always gets a chance to prove itself in the Big Ten. So the Badgers can ease into its season, and will Sept. 1 at home against Utah State.\n———\nMore AP college football coverage: www.collegefootball.ap.org and http://www.twitter.com/AP—Top25",
    "source_domain": "abcnews.go.com",
    "title": "Wisconsin Wins Cotton Bowl 24-16, Only Western Michigan Loss",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/wisconsin-wins-cotton-bowl-24-16-western-michigan-44516237"
}