{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:48:03+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "US housing starts fell in March; still stronger than in 2016",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-housing-starts-fell-march-stronger-2016-46860002.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_c58f5197e5704870aab53127bcb26174_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. builders broke ground on fewer homes in March, but the pace of construction so far this year remains stronger than in 2016.\nHousing starts fell 6.8 percent last month to a seasonally adjusted annual rate of 1.22 million, the Commerce Department said Tuesday. The setback came after strong gains in a warmer-than-usual February. Groundbreakings on new homes are still 8.1 percent higher through the first three months of this year compared with 2016.\nMore Americans are seeking homes as job security has improved with low unemployment. But even with a wave of construction, a dwindling supply of new and existing homes across much of the country has threatened to become a major drag on the housing market.\nJennifer Lee, a senior economist at BMO Capital Markets, suggested that the March decline was likely temporary.\n\"Is it the start of a trend? Likely not, given the strong demand for housing and the low levels of inventory to choose from,\" Lee said.\nDespite a winter storm last month, housing starts increased in the Northeast largely because of apartment construction. The pace of groundbreakings tumbled in the Midwest, South and West.\nThe March decline was likely due in part to an unseasonably temperate January and February, which allowed builders to begin construction earlier.\n\"Much warmer-than-usual weather in the first two months of the year pulled starts forward into those months, and March — with more normal temperatures — saw the payback with declines in both single- and multifamily construction,\" said David Berson, chief economist at Nationwide Mutual Insurance.\nDuring the first three months of this year, construction of buildings with at least five units — mainly apartment complexes — has climbed 14.1 percent. Single-family housing starts have risen 5.9 percent.\nMore properties will likely begin construction in the coming months. Building permits, an indicator of future construction, rose 3.6 percent in March to an annual rate of 1.26 million.\nU.S. homebuilders expect rising sales, though they have become somewhat less optimistic. The National Association of Home Builders/Wells Fargo builder sentiment index released Monday dipped to 68 this month from 71 in March. Readings above 50 indicate more builders view sales conditions as favorable rather than poor. The index has been above 60 since September.\nBut strengthening demand and builder sentiment have yet to generate enough construction to sufficiently boost the availability of homes. That trend could temper sales growth and weaken affordability, in part because the shortage of homes has pushed up prices.\nThere were 266,000 new homes for sale last month, up nearly 10 percent from a year earlier. But sales of new homes rose 13 percent over the past year.\nPurchases of existing homes have also increased. Yet sales listings of existing homes dropped 6.4 percent over the past year to 1.75 million properties in February, a figure only slightly higher than in January when listings were at an all-time low.",
    "source_domain": "abcnews.go.com",
    "title": "US housing starts fell in March; still stronger than in 2016",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-housing-starts-fell-march-stronger-2016-46860002"
}