{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 02:02:25+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Inside a FEMA distribution center as Puerto Rico braces for hurricane season.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Ffema-prepares-start-hurricane-season-55549435.json",
    "image_url": "https://s.abcnews.com/images/US/180530_vod_fema_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for FEMA prepares for the start of hurricane season\nPicture of can do here in Puerto Rico as we approach the start. Of the hurricane season we are inside this warehouse this huge distribution center from phenom here were rebuilt when they got to. Hundreds of supplies on one side here you have. Boxes and boxes crates of sports on the other side yet all this water being told they have about two. Here's a quarter. 800000. Meals ready to go there also be supplies stuff like he's speaking with the officials they city just Aris. Much better she. This time around compared to last year. FEMA says last year they had about 46 employees working on the ground here Puerto Rico now they have some 3000. Also lesser pitchers have won office now there's 67. They also hope that there's a level of preparedness from the people you're on the island first they want to make sure that people who live here have already been through it. Have enough supplies food water medicine battery so quick that's less than ten days so that they want to use. At this stuff. Until it's absolutely. Necessary the start of hurricane season is on June 1 people here. Obviously have lived through it after hurricane Maria eight months ago booking numbers to see anything quite like this again 99%. Of the population. Now has electricity. Its power grid goes I'm being told it's still the most delicate sensitive part of the island. If another storm that stronger U nor a little weaker comes by this way again hits has that similar impact. It'll knock it all down again. Hopefully that doesn't happen so this is a look inside distribution center in Puerto Rico the city this team has set up. After road here again they're hoping that they never have to use. And this book much more coverage from here importer. Undertook end of ABC news sent one quarter.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "FEMA prepares for the start of hurricane season",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/video/fema-prepares-start-hurricane-season-55549435"
}