{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:33:42+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The explosive possibly detonated in a passageway underneath Port Authority, sources said. Port Authority is a major transportation hub one block from Times Square where buses and trains operate from the west side of Midtown Manhattan.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fpipe-bomb-explodes-major-bus-terminal-nyc-suspect-51716822.json",
    "image_url": "http://a.abcnews.com/images/US/171211_abc_spec_rep_nyc_explosion_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Possible pipe bomb explodes below major bus terminal in NYC, suspect in custody\nThis is an ABC news special. Now reported. George Stephanopoulos. And we want to bring you latest right now on that explosion at the Port Authority here in New York earlier at the height of rush hour of course the Port Authority that is alive. Look right now at the scene the largest the busiest bus terminal in the United States. According to police sources one man. Set off the explosion he is now in custody badly injured another. Person in the journal also injured. If the terminal has been close right novel want to go right to ABC's GOP because he's on the scene. Hey Georgia white and look at this right now you have all of these officers here you have all of these ambulances and fire trucks the bomb squad is here on the scene. No doubt so many people were here so if only another person was injured and the suspect. That is truly a miracle George because we're talking about so many people coming through this terminal and not just for the buses but also for the subway system but we know that there were evacuating the major subway lines. Here in New York City now the working theory right now the suspicion. Is that this pipe bomb apparently could have detonated earlier than intended. Because it was underground. Going through all of this passageways were not too many people. War and so that's the good news here is that this could have been so much worse had a detonated where was supposed to but but right now that is just the suspicion that is just something that they're working on George. Try to confirm but right now so many people in this area right now police say out that this seems. To be contained never the information is just coming in the suspect what we know about the suspect to suspect from Bangladesh has been in this country about seven years was living. In Brooklyn apparently wearing a pipe bomb on his person when it went offices GO seem to indicate. A little prematurely. Lot more to be learned though right now I want to bring go to our senior justice correspondent Pierre Thomas for more on that anyone claimed responsibility right now. Any other information coming in to federal officials. No one has claimed responsibility George black and tell you there's. Attorney general Homeland Security officials top law enforcement officials in this country have been briefed. They're waiting additional information George there have been great concern with the upcoming holiday season that you could see an event like this. Two officials I spoke to or just. So thankful in Georgia so far it appears to be contain what limited him injuries George but this. Has major implications for the upcoming holiday seasons clearly some what swung someone was trying to hurt or. Kill as many people as they could. Everyone will be let Audrey and her former FBI special agent Brad Garrett for more on this that well what may have been saving grace here Brad. Is that it was a relatively crude weapon. Right this is going to be amateur hour George he probably learned on line had to build a pipe bomb. That there were the tricky part obviously is a timer. That obviously didn't work out well for him. And sister city had an honest person. OK well that's what we have right now an explosion at the Port Authority here in New York City at the height of rush hour you can hear the emergency vehicles. Outside withstand the story all morning long here on Jimmy and ABC news. This has been a special. From the EB.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Possible pipe bomb explodes below major bus terminal in NYC, suspect in custody",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/pipe-bomb-explodes-major-bus-terminal-nyc-suspect-51716822"
}