{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 06:23:46+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "High-tech US plants offer jobs even as the laid-off struggle",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fhigh-tech-us-plants-offer-jobs-laid-off-49220545.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_95f4ef7fa4c248d2b83d809c55cb4e29_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Herbie Mays is 3M proud, and it shows — in the 3M shirt he wears; in the 3M ring he earned after three decades at the company's plant in suburban Cincinnati; in the way he shows off a card from a 3M supervisor, praising Mays as \"a GREAT employee.\"\nBut it's all nostalgia.\nMays' last day at 3M was in March. Bent on cutting costs and refocusing its portfolio, the company decided to close the plant that made bandages, knee braces and other health care supplies and move work to its plant in Mexico.\nAt 62, Mays is unemployed and wants to work, though on the face of it he has plenty of opportunities: Barely 10 miles from Mays' ranch-style brick home in this blue-collar city, GE Aviation has been expanding — and hiring.\nIn the state-of-the-art laboratory in a World War II-era building the size of 27 football fields, workers use breakthrough technology to build jet engines that run on less fuel at higher temperatures. Bright flashes flare out as GE workers run tests with a robotic arm that can withstand 2,000 degrees (1,090 Celsius).\nThe open jobs there are among 30,000 manufacturing positions available positions open across Ohio. But Mays, like many of Ohio's unemployed, lacks the in-demand skills.\n\"If you don't keep up with the times,\" he said, \"you're out of luck.\"\nThis is the paradox of American manufacturing jobs in 2017. Donald Trump won the presidency in great measure because he pledged to stop American jobs and manufacturing from going overseas, winning Rust Belt votes from Mays and other blue-collar voters.\nIt's true that many jobs have gone overseas, to lower-wage workers.\nBut at the same time, American manufacturers have actually added nearly a million jobs in the past seven years. Labor statistics show nearly 390,000 such jobs open.\nThe problem? Many of these are not the same jobs that for decades sustained the working class. More and more factory jobs now demand education, technical know-how or specialized skills. And many of the workers set adrift from low-tech factories lack such qualifications.\nFactories will need to fill 2 million jobs over the next decade, according to a forecast by Deloitte Consulting and the American Manufacturing Institute. Workers are needed to run, operate and troubleshoot computer-directed machinery, including robots, and to maintain complex websites\nLast year, software developer was the second-most-common job advertised by manufacturing companies, behind only sales, according to data provided by Burning Glass Technologies, a company that analyzes labor market data.\nYet the United States for now remains a follower, not a leader, of the trend. Workers in many European and Asian countries are more likely to be working with robots than U.S. workers, studies show. In such countries as Japan and Denmark, robotics and advanced automation have created solid jobs while increasing efficiencies for manufacturers.\nTrump continues to make promises about adding U.S. manufacturing jobs. In blue-collar Youngstown, Ohio, he talked about passing by big factories whose jobs \"have left Ohio\" on his way to a July 25 rally, then told people not to sell their homes because the jobs are \"coming back. They're all coming back.\"\nBut Sen. Rob Portman, an Ohio Republican and a former U.S. trade representative, conceded in an interview: \"We're not going to see the kind of manufacturing renaissance that we all want in this country unless we focus on skills training.\"\nLabor Secretary Alexander Acosta, in a visit to a Detroit factory in June, acknowledged the need to address the skills gap by developing advanced computing skills. And when Trump visited Pewaukee, Wisconsin, in June, he touted the value of training while doing.\n\"Apprenticeships teach striving Americans the skills they need to operate incredible machines,\" Trump said. \"This is not the old days. This is new and computerized and complicated.\"\nOf the 146 million jobs in the United States, only about 0.35 percent were filled by active apprentices in 2016. Filling millions of open jobs through apprenticeships would require a substantial increase in government resources. So far, the Trump administration has called for more funding but hasn't made any progress securing the funding from Congress.\nApprenticeships are much more common at some European companies, notably German firms. At Germany-based Stihl Inc.'s plant in Virginia Beach, Virginia, for example, A.J. Scherman is learning to be a \"mechatronics technician.\" Mechatronics combines electrical and mechanical engineering as well as computer skills.\nStihl makes chain saws, leaf blowers and weed trimmers at the factory. Once he's completed his final year in Stihl's four-year apprenticeship program, Scherman will read diagnostic software on computer screens attached to each robot to repair and upgrade them. If necessary, he'll hook up a laptop to program changes.\nScherman, 37, is also earning a college degree as part of the apprenticeship. Thanks to financial aid from Stihl, he'll finish with zero debt.\nSkip Johnson, Stihl's apprenticeship coordinator, said it's critically important to bring bright students into the plant, where they can see that the grime and dust they associate with factories are giving way to clean operations using futuristic technology.\n\"They just come in here, and they're wide-eyed,\" Johnson said.\nU.S. manufacturing workers, excluding managers, make an average of $44,000 a year, according to government data. That's just 2.8 percent higher, adjusted for inflation, than a decade ago after years of shifting of jobs overseas or to nonunion states. And it compares with a much higher 8 percent gain for the labor force as a whole over the past decade.\nBut a typical mechatronics engineer with a four-year degree can earn $97,000 a year; a typical software developer makes just over $100,000.\nFesto Didactic, the education arm of Germany-based Festo, last year launched two-year mechatronics apprenticeship programs in Ohio with Sinclair Community College, and is already expanding its U.S. apprenticeship offerings. At Festo's plant in Mason, workers monitor a robotic distribution system that self-adjusts its work flow to prevent backups.\n\"This kind of factory has nothing to do with the factory we knew in the 1960s or 1980 or even 2000,\" said Yannick Schilly, who heads global supply for Festo's North American business.\nBut there's not much demand locally these days for the kind of repetitive tasks done in those factories by workers such as Herbie Mays.\nHe acknowledged that there are \"plenty of jobs out here.\n\"What you have to do is get training or education.\"\n———\nRugaber reported from Virginia Beach and Washington, D.C. Contributing to this report were Associated Press business writer Yuri Kageyama in Tokyo, AP writer Jan M. Olsen in Kalundborg, Denmark; AP videojournalist Mike Householder in Detroit, and AP photographer John Minchillo in Cincinnati. Follow Dan Sewell at http://twitter.com/dansewell .\nThis is part of the first installment of Future of Work, an Associated Press series that will explore how workplaces across the U.S. and the world are being transformed by technology and global pressures. As more employers move, shrink or revamp their work sites, many employees are struggling to adapt. At the same time, workers with in-demand skills or knowledge are benefiting. Advanced training, education or know-how is becoming a required ticket to the 21st-century workplace.",
    "source_domain": "abcnews.go.com",
    "title": "High-tech US plants offer jobs even as the laid-off struggle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/high-tech-us-plants-offer-jobs-laid-off-49220545"
}