{
    "authors": [
        "Abc News",
        "More Stephanie"
    ],
    "date_download": "2018-04-25 00:06:03+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Democrats say the law requires EPA to use \"the best available science.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fpruitt-epa-stop-basing-rules-calls-secret-science%2Fstory%3Fid%3D54698926.json",
    "image_url": "https://s.abcnews.com/images/Politics/pruitt-rt-er-180409_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Environmental Protection Agency Administrator Scott Pruitt announced a new rule Tuesday that would limit what kind of science the EPA can consider in writing new environmental rules.\nInterested in Trump Administration? Add Trump Administration as an interest to stay up to date on the latest Trump Administration news, video, and analysis from ABC News. Add Interest\nPruitt said the rule would ban the EPA from relying on what he called \"secret science,\" research that didn't make the raw data behind it available to the general public, saying the new proposal makes the process more transparent.\nBut seven Senate Democrats on the committee with oversight of EPA wrote to Pruitt saying that the new rule could violate laws that require agencies to use \"the best available science.\"\nThe new rule announced has a similar goal as legislation pushed by the chairman of the House Science Committee, Rep. Lamar Smith, R-Texas, nicknamed the HONEST Act. Pruitt thanked Smith at the short event announcing the rule at the EPA on Tuesday.\n\"This is really a great day, it's a banner day,\" Pruitt said.\nHe said in the announcement that making public data available will allow outside groups or members of the public to try to replicate results cited in studies used to write new rules.\n“The era of secret science at EPA is coming to an end,” Pruitt said in a statement. “The ability to test, authenticate, and reproduce scientific findings is vital for the integrity of the rulemaking process. Americans deserve to assess the legitimacy of the science underpinning EPA decisions that may impact their lives.”\nBut critics of the policy, including former EPA administrator Gina McCarthy, say the new rule could undermine rules intended to protect public health because the studies used to support those rules rely on private health data.\n\"Don’t be fooled by this talk of transparency. [Pruitt] and some conservative members of Congress are setting up a nonexistent problem in order to prevent the E.P.A. from using the best available science,\" McCarthy wrote in a New York Times op-ed with the former head of the EPA's air office.\nIn that op-ed McCarthy also wrote that, if implemented, the rule could undermine rules intended to protect health at other agencies because they also rely on studies that use public health data that is not publicly available.\nAlmost 1,000 scientists signed on to a letter urging Pruitt to abandon the proposal. That letter, posted by the Union of Concerned Scientists, says that the proposal weaponizes the idea of \"transparency\" to allow political interference in decisionmaking that is supposed to be based on scientific evidence.\nSmith said that personal information could be redacted, despite arguments from what he called \"alarmist environmental groups.\"\nThe EPA says that its policy will be similar to rules put in place by scientific journals like Science and Nature that require that researchers make data available to readers or for other scientists. If the data contains sensitive information like health-related data the proposed rule says that the agency could restrict access or require an application before a member of the public can view it.\nTuesday's event was live streamed on the EPA's website but reporters were not in the room.\nThe rule will be posted to the Federal Register for 30 days of public comment.",
    "source_domain": "abcnews.go.com",
    "title": "Pruitt wants EPA to stop basing rules on what he calls 'secret science'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/pruitt-epa-stop-basing-rules-calls-secret-science/story?id=54698926"
}