{
    "authors": [
        "Abc News",
        "Benjamin Siegel",
        "More Trish",
        "More Benjamin"
    ],
    "date_download": "2018-03-20 09:21:42+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Congress wants scrutiny of safeguards meant to protect user data.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fcongress-turns-heat-facebook-allegations-data-harvesting%2Fstory%3Fid%3D53861995.json",
    "image_url": "https://s.abcnews.com/images/Technology/ap_facebook_billion_users_wg_150827_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Congress is ratcheting up political pressure on Facebook after reports that a political data analytics firm employed by President Donald Trump’s 2016 campaign received personal data and information from up to 50 million profiles on the popular social networking site.\nLawmakers involved in congressional investigations into Russian election interference have renewed interest in the platform, calling for top company leaders to testify on Capitol Hill and more scrutiny of safeguards meant to protect user data.\n“I think it’s time for the CEO, Mr. [Mark] Zuckerberg, and other top officials to come and testify and not tell part of the story, but tell the whole story of their involvement -- not only with the Trump campaign but their ability to have their platform misused by the Russians,” Sen. Mark Warner, D-Va., the top Democrat on the Senate Intelligence Committee, told ABC News.\n“These tech platforms .... need to be more forthcoming or Washington is going to start imposing rules and regulations that may not fit,” he warned.\nSens. Amy Klobuchar, D-Minn., and John Kennedy, R-La., members of the Senate Judiciary Committee, wrote to chairman Chuck Grassley requesting a hearing with social media company CEO’s, including Zuckerberg.\nOn Saturday, The New York Times and The Observer of London reported that the data firm, Cambridge Analytica, mined data from millions of Facebook users -- largely without permission -- through an app created by a Russian-American psychologist, with the goal of using the data to create voter profiles and craft political messages.\nFacebook did not publicly acknowledge the possible data breach until the report surfaced over the weekend, and did not notify users that their information had been obtained by a third party.\nCambridge Analytica has denied improperly obtaining any data, said they destroyed the unauthorized data as soon as they learned of it and said none of the information was used in its work 2016 presidential campaign work.\nOn Monday, Facebook announced that it had hired a digital forensics firm, Stroz Friedberg, to audit Cambridge Analytica and sweep the firm’s servers and systems to confirm that the tranche of Facebook data had been destroyed after acknowledging reports that the data may still exist.\n“We are moving aggressively to determine the accuracy of these claims. We remain committed to vigorously enforcing our policies to protect people’s information,” the company said in a statement.\nFacebook has turned over records to investigators with special counsel Robert Mueller’s team and the company has said it is cooperating.\nAP\nRep. Adam Schiff, D-Calif., the top Democrat on the House Intelligence Committee, has invited Christopher Wylie, the former Cambridge Analytica contractor who first spoke with The Times and The Observer, to appear for an interview with his staff. He said Democrats have also invited the Russian-American researcher Alexandr Kogan, to appear for an interview.\nCambridge Analytica provided documents to the House Intelligence Committee about its work with the Trump campaign last year. The panel also interviewed CEO Alexander Nix over video conference from a Washington law office instead of in person at the Capitol, a move that frustrated committee Democrats. Nix was questioned about the firm’s work with the Trump campaign.\n“We need to bring [Nix] back. I also think we need to bring in the other witnesses from Cambridge Analytica that we had asked the majority to previously [agree to],” Schiff said, referencing Democrats’ calls for interviews with other Cambridge Analytica executives and GOP donor Rebekah Mercer, whose father Robert helped create the political data firm.\nPhoto Illustration by Jaap Arriens/NurPhoto via Getty Images\nFacebook has already faced scrutiny and calls for regulation in Washington amid investigations into Russian efforts to disrupt the election using fake news and political ads disseminated on the platform and other social media sites.\nLawmakers, including Warner and Klobuchar, have called for tighter regulations of online political ads and greater disclosure requirements, which Facebook and other tech companies have resisted.\nThe company has also worked to improve its image in Washington in recent months: Chief operating officer Sheryl Sandberg traveled to Washington last fall to meet with congressional leaders in October amid the House and Senate Intelligence Committee investigations into Russian election meddling.",
    "source_domain": "abcnews.go.com",
    "title": "Congress turns up heat on Facebook after allegations of data harvesting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/congress-turns-heat-facebook-allegations-data-harvesting/story?id=53861995"
}