{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:39:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-10 00:00:00",
    "description": "Romania: Protests of laws viewed as lax on graft renewed",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fromania-protests-laws-viewed-lax-graft-renewed-51703751.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_e7afbb235a254f8ea1ccfabd2df3d21f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "More than 10,000 people on Sunday participated in another round of protests against Romanian legislation that critics say would make it harder to punish high-level corruption.\nThe main protest outside government offices in Bucharest brought out thousands on Sunday and riot police closed roads due to the large numbers. There also were anti-government demonstrations in the cities of Cluj and Iasi. Protesters blew whistles and chanted, \"Justice, not corruption,\" and called for early elections.\nRuxandra Slavoaca, a retired geological engineer who was at the protest in Bucharest with her husband, accused the left-wing ruling coalition of \"making corruption official.\" She added that ordinary people had \"the right to dignity, respect and prosperity.\"\nFormer Prime Minister Dacian Ciolos and opposition leaders also took part in the protest.\nRomania's Parliament is in the process of approving a series of laws that protesters argue would bring the justice system under greater political control.\nU.S. Ambassador Hans G. Klemm said Sunday that if Parliament backtracked from current anti-corruption laws, Romania could be at risk of Russia seeking to undermine the country's stability. Romania, a European Union member, has cool relations with Russia.\nThousands of Romanian magistrates, the European Commission and President Klaus Iohannis have criticized the proposals.\nA number of senior politicians from the ruling coalition are facing corruption-related charges from probes they claim are politically motivated.",
    "source_domain": "abcnews.go.com",
    "title": "Romania: Protests of laws viewed as lax on graft renewed",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/romania-protests-laws-viewed-lax-graft-renewed-51703751"
}