{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 06:51:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Researcher finds Georgia voter records exposed on internet",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fresearcher-finds-georgia-voter-records-exposed-internet-48048895.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_3f71188815944d9babdc4edd7376ea95_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A security researcher disclosed a gaping security hole at the outfit that manages Georgia's election technology, days before the state holds a closely watched congressional runoff vote on June 20.\nThe security failure left the state's 6.7 million voter records and other sensitive files exposed to hackers, and may have been left unpatched for seven months. The revealed files might have allowed attackers to plant malware and possibly rig votes or wreak chaos with voter rolls during elections.\nGeorgia is especially vulnerable to such disruption, as the entire state relies on antiquated touchscreen voting machines that provide no hardcopy record of votes, making it all but impossible to tell if anyone has manipulated the tallies.\nThe true dimensions of the failure were first reported Wednesday by Politico Magazine . The affected Center for Election Systems referred all questions to its host, Kennesaw State University, which declined comment. In March, the university had mischaracterized the flaw's discovery as a security breach.\nLogan Lamb, a 29-year-old Atlanta-based private security researcher formerly with Oak Ridge National Laboratory, made the discovery last August. He told The Associated Press he decided to go public after the publication last week of a classified National Security Agency report describing a sophisticated scheme, allegedly by Russian military intelligence, to infiltrate local U.S. elections systems using phishing emails.\nThe NSA report offered the most detailed account yet of an attempt by foreign agents to probe the rickety and poorly funded U.S. elections system. The Department of Homeland Security had previously reported attempts last year to gain unauthorized access to voter registration databases in 20 states — one of which, in Illinois, succeeded, though the state says no harm resulted.\nIt also emboldened Lamb to come forward with his findings. Lamb discovered the security hole — a misconfigured server — one day as he did a search of the Kennesaw State election-systems website. There, he found a directory open to the internet that contained not just the state voter database, but PDF files with instructions and passwords used by poll workers to sign into a central server used on Election Day, said Lamb.\n\"It was an open invitation to anybody pretending to even know a little bit about computers to get into the system,\" said Marilyn Marks, an election-transparency activist whose Colorado-based foundation participated in a failed lawsuit that sought to bar the use of paperless voting machines in next week's election.\nThe directory of files \"was already indexed by Google,\" Lamb said in an interview — meaning that anyone could have found it with the right search. Lamb said he notified the center's director, Merle King, who assured him the hole would be patched and who asked to keep his discovery to himself.\nPolitico reported that the center never notified the secretary of state's office, which oversees elections and contracts with Kennesaw State to manage the technology part. The Associated Press left a phone message and sent email to King seeking comment but he did not immediately respond.\nLamb said he decided not to disclose the problem at the time — mostly because he \"didn't want to needlessly escalate things\" prior to the Nov. 8 general election. But in March, a security colleague Lamb had told about the flaw, checked out the center's website and discovered that the vulnerabilities had only been partially fixed.\n\"We were both pretty floored,\" said Lamb.\nThe researcher, Chris Grayson, said he, too, was able to access the same voter record database and other sensitive files in a publicly accessible directory. Grayson contacted a friend who is a professor at Kennesaw State. Two days later, the FBI was called in to investigate.\nIt did not bring charges against either researcher, finding no evidence of illegal entry . \"At the end of the day we were doing what we thought was in the best interest of the republic — informing the parties that needed to be privy to this sort of issue,\" said Grayson.\nThe special election next Tuesday will fill the seat vacated by Republican Tom Price after he was named Health and Human Services Secretary. It has attracted national attention, including that of President Donald Trump, for whom it could be a bellwether.\nFirst-time candidate Jon Ossoff is a Democrat with a national security background. His GOP opponent is former Georgia Secretary of State Karen Handel.",
    "source_domain": "abcnews.go.com",
    "title": "Researcher finds Georgia voter records exposed on internet",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/researcher-finds-georgia-voter-records-exposed-internet-48048895"
}