{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 17:33:20+00:00",
    "date_modify": null,
    "date_publish": "2018-07-03 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Frhode-island-liberals-blast-dems-backing-trump-supporter-56345235.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_0977cdb141f044d88f04a6eb24385a6b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rhode Island Democrats are in an uproar after the party endorsed a Donald Trump-voting male candidate over a sitting female lawmaker known for championing liberal causes, in a district and a state that voted overwhelmingly for Hillary Clinton.\nThe decision to endorse Michael Earnheart over Providence state Rep. Moira Walsh unleashed the frustration of many liberal women who say concerns about issues including abortion rights and sexual harassment are not being addressed by the state's Democratic leaders. The chairwoman of the party's women's caucus called last week's endorsement unacceptable and said Tuesday they were demanding an explanation.\nState Rep. Joe McNamara, the party's chairman, told The Associated Press he didn't know Earnheart supported Trump when they endorsed him, saying it was \"difficult to do a complete history\" of the candidate. He said he believed Earnheart no longer supports Trump, although said \"we didn't get into it when we spoke with him.\"\nHe blamed Walsh for not seeking the endorsement.\n\"It's not rocket science,\" he said.\nWalsh, 27. disputed that and said the party told her it was not endorsing anyone. She said she and other liberal women were being targeted by House Speaker Nicholas Mattiello, who controls Rhode Island's Democratic party.\nRather than listen to women about issues important to them, she said, \"their solution has been instead, 'Why don't we get rid of these women, and they won't ask for this stuff anymore.'\"\nEarnheart, 31, declined an interview but answered some questions by email, confirming he voted for Trump. He called Walsh at the \"fringe\" of the General Assembly.\nMattiello's spokesman did not immediately return a message seeking comment.\nSulina Mohanty, chairwoman of the women's caucus, said she believes party leadership is blatantly disrespecting women and fearful that they will have to cede power to newly energized women.\n\"There are women stepping up at all levels, from running for office, to speaking at hearings. I know so many women who were at the statehouse multiple times a week this session,\" she said.\nMohanty said the leadership failed to pass legislation women were most focused on, including bills involving sexual harassment, guns in schools and pay equity.\nMattiello angered many people in May when, in a radio interview , he dismissed calls to codify abortion rights in the state in case Roe v. Wade is overturned. He called the concern \"not founded in reality.\"\nThen came the endorsements, which included not only Earnheart but a former Providence lawmaker endorsed by local Democrats even though he has a history of being charged with crimes including sexual assault and perjury. He has denied wrongdoing.\nThe state chapter of the National Organization for Women last week said women are ignored in the state's political environment.\n\"It is no surprise that men believe they can treat women criminally, and still be considered democratic leaders,\" they said.\nWalsh and her supporters say Earnheart is out of step with the district, which has a large immigrant population.\nThey point to a photograph of Earnheart holding a Make America Great Again sign at a Trump rally last year and to his now-deleted feed. He recently retweeted conservative figures such as Donald Trump Jr. and pizzagate conspiracy theorist Mike Cernovich. In May, he posted that \"illegal aliens are self-entitled lawbreakers and thieves, stealing jobs and government benefits meant for our own people.\"\nEarnheart didn't address criticism about his Twitter feed, but said he went to the rally \"to hear opposing viewpoints from each side.\"\nHe did not answer whether he still supports Trump.",
    "source_domain": "abcnews.go.com",
    "title": "Rhode Island liberals blast Dems for backing Trump supporter",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/wireStory/rhode-island-liberals-blast-dems-backing-trump-supporter-56345235"
}