{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 22:08:52+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Storms Push Across South, Damaging Buildings, Cutting Power",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fstorms-push-south-damaging-buildings-cutting-power-44516134.json",
    "image_url": "http://abcnews.go.com/US/wireStory/storms-push-south-damaging-buildings-cutting-power-44516134",
    "language": "en",
    "localpath": null,
    "maintext": "A line of severe thunderstorms moved out of Texas and across the South on Monday, bringing flash flooding, power outages and wind damage.\nWind damage was reported in a band across central Louisiana and into southern Mississippi, although no injuries or deaths were immediately reported.\nSome wind damage was also reported in Houston and throughout East Texas in the morning. Though Arkansas had also been included in warnings, there was only a stray report of hail in Jackson County in the northeast part of the state.\nNational Weather Service forecasters said that at least some of the damage may have been caused by tornadoes.\n\"It was obviously wind damage,\" said Johnathan Brazzell of the Weather Service's Lake Charles, Louisiana, office. \"Whether it was straight-line winds or tornadoes, that will have to be determined through a field survey.\"\nLouisiana utilities reported more than 45,000 customers without power early Monday afternoon, while Mississippi utilities reported power was out to more than 23,000 customers.\nFreddie Zeigler, a meteorologist in the Weather Service's New Orleans office, said heavy winds were preceding the squall line, possibly contributing to power outages. A gust of 52 mph was reported at McComb, Mississippi, about 1 p.m. Monday.\nIt was the second episode of heavy rain within days for some areas, especially along the Gulf Coast. Although flood warnings were posted for many areas, Brazzell said it appeared flooding would be \"minor,\" with few impacts to structures.\nThe Storm Prediction Center in Norman, Oklahoma, said that 6.9 million people in large parts Louisiana, Mississippi and south Alabama are at the highest risk of storms Monday. The area included several large cities such as New Orleans; Jackson, Mississippi; and Mobile, Alabama.",
    "source_domain": "abcnews.go.com",
    "title": "Storms Push Across South, Damaging Buildings, Cutting Power",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/storms-push-south-damaging-buildings-cutting-power-44516134"
}