{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:53:50+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "After 60-loss season, Nets not looking to rush the rebuild",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2F60-loss-season-nets-rush-rebuild-46846135.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/60-loss-season-nets-rush-rebuild-46846135",
    "language": "en",
    "localpath": null,
    "maintext": "The Brooklyn Nets own two first-round draft picks, though not the one that has a 25 percent chance of being No. 1 overall.\nThey have money to spend in free agency, if they want to go that route.\nSo there are ways to upgrade the worst team in the NBA.\nThey just won't rush it.\n\"Listen, I know we have big strides to make and 20 wins, not enough. It's not good enough for any of us, but I do think we're going to reap the benefits of going through this struggle,\" coach Kenny Atkinson said Monday.\nThe Nets finished 20-62 in their first season under Atkinson, getting most of those victories during the final two months of the season. It was expected to be a rough season and it was, as they undertake a rebuilding process under general manager Sean Marks after years of sometimes reckless spending that never brought them close to a championship.\nThey won't get near one anytime soon, either. Marks used the work \"strategically\" about a half-dozen times Monday in his season-ending news conference to describe the way he will build the team.\nThe easiest chance for an immediate score in a promising draft is long gone, because the Nets have to swap picks with Boston as they continuing paying for the trade that landed them Paul Pierce and Kevin Garnett. So the Celtics will have no worse than the No. 4 pick in the draft.\nBut the Nets do have the Celtics' pick and acquired Washington's during the season, giving them two selections later in the first round.\n\"I like having two picks, that's for sure,\" Marks said. \"I think it just gives us another swing at it.\"\nBeyond that, the Nets could try to sign a veteran star to become the headliner of the team, but that doesn't sound like the plan.\n\"I think we've got to really evaluate the roster and if you go after one of the top-tier guys, you obviously would hope to get them — you hope to get all your targets that you go for — but does that really make you better? Does it get you to 30 wins, 35 wins?\" Marks said.\n\"The objective here is for us to be in the playoffs. When that comes, we'll have to wait and see, but you don't want to go and sign free agents and next thing your payroll is capped out and so forth and you're a 25-win team.\"\nNets executives are bound this week for Europe, where they will meet with Russian owner Mikhail Prokhorov and do some scouting. The makeup of the roster for next season seems wide open beyond point guard Jeremy Lin, with center Brook Lopez perennial trade bait even as he adapted his game well this season to fit Atkinson's offense.\nProkhorov, who once longed to win a championship within five years, now seems on board with a gradual rebuild.\nIt took time to get the Nets into the situation they're in, and they're prepared to take time to get out.\n\"Obviously the losses weren't easy but I did understand, I think we understood what we're getting into and I know in the long run that the adversity that we had to face, it's almost like you deserve to face that,\" Atkinson said.\n\"So I kind of like that process and looking back on it, having to fight through some tough times, I think that's going to make us better in the long run. But I know it's one foot in front of the other.\"",
    "source_domain": "abcnews.go.com",
    "title": "After 60-loss season, Nets not looking to rush the rebuild",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/60-loss-season-nets-rush-rebuild-46846135"
}