{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:57:57+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Arizona man who sold ammo to Las Vegas shooter is charged",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fammo-dealer-las-vegas-gunman-raised-suspicions-52800910.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_2a0d884f7c5e418ea9d61dc43c721fda_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An Arizona man who sold ammunition to the gunman who carried out the deadliest mass shooting in modern U.S. history was charged Friday with manufacturing armor-piercing bullets, according to court documents.\nUnfired armor-piercing bullets found inside the Las Vegas hotel room where Stephen Paddock launched the Oct. 1 attack had the fingerprints of ammunition dealer Douglas Haig, according to a criminal complaint filed in federal court in Phoenix. It says Haig didn't have a license to manufacture armor-piercing ammunition.\nHaig has acknowledged selling 720 rounds of tracer ammunition to Paddock in the weeks before the shooting that killed 58 people. Tracer bullets contain a pyrotechnic charge that illuminates the path of fired bullets so shooters can see whether their aim is correct.\nThe criminal charge involves another type of ammunition — armor-piercing bullets.\nThe documents don't say if any ammunition tied to Paddock was used in the attack. Las Vegas police wouldn't say whether armor-piercing bullets were used in the shooting but referred to a preliminary report saying some rifle magazines were loaded with armor-piercing ammunition.\nHaig, a 55-year-old aerospace engineer who sold ammunition as a hobby for about 25 years, was charged 35 minutes before holding a news conference where he said he didn't notice anything suspicious when he sold the tracer rounds to Paddock.\nHaig told investigators that when Paddock bought the ammunition at his home in suburban Phoenix, Paddock went to his car to get gloves and put them on before taking the box from Haig, the complaint said.\n\"I had no contribution to what Paddock did,\" Haig told reporters earlier Friday, adding that there was nothing unusual about the type or quantity of ammunition the shooter bought. \"I had no way to see into his mind.\"\nA phone message left for Haig's attorney, Marc Victor, wasn't immediately returned.\nThe two armor-piercing bullets found in Paddock's hotel room with Haig's fingerprints had an \"incendiary capsule\" on their noses, the documents said. A forensic analysis of those two bullets had tool marks consistent with the equipment in Haig's backyard workshop, according to the complaint.\nIt also alleges that FBI agents searching Haig's home on Oct. 19 found armor-piercing ammunition.\nThe complaint said Haig sold such bullets in more than 100 instances to customers across the United States, including Nevada, Texas, Virginia, Wyoming and South Carolina.\nHe appeared in court Friday and was released under the condition he not possess guns or ammunition. If convicted, he could face up to five years in prison and a fine as high as $250,000.\nHaig and his business partner, whose name wasn't provided, sold 40 to 50 rounds of incendiary rounds to Paddock in late August at a Las Vegas gun show, according to the complaint.\nThe next month, Haig said he met Paddock at a Phoenix gun show and that he was well-dressed and polite.\nHe didn't have the quantity of tracer ammunition on hand that Paddock was seeking, so Paddock contacted him several days later and lined up a sale at Haig's home.\nHaig said he was shocked and sickened when a federal agent informed him of the massacre 11 hours after it unfolded.\nHaig's lawyer said they held the news conference in a bid to protect his reputation after he was revealed earlier this week to be a \"person of interest\" in the investigation. Haig's identity emerged by mistake after his name was not redacted in court documents.\nA law enforcement official previously told The Associated Press that investigators don't believe Haig had any involvement or knowledge of the planned attack when he sold ammunition to Paddock. The official wasn't authorized to discuss an ongoing investigation and spoke on condition of anonymity.\nHaig arose in the investigation when a box with his name and address was found in the Mandalay Bay hotel suite where Paddock opened fire on a music festival below.\nHe gave the box to Paddock to carry the 720 rounds of tracer ammunition from the sale.\nHaig said Paddock told him that \"he was going to go out to the desert to put on a light show, either with or for his friends. I can't remember whether he used the word 'with' or 'for.' But he said that he was going out at night to shoot it with friends.\"\nHaig, who has closed his ammunition business, said he has received unwanted media attention and death threats since his name was released.\nThe FBI didn't immediately respond to a request for comment. The U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives referred questions to the U.S. attorney's office in Las Vegas, which declined to comment.\n———\nAssociated Press writers Michael Balsamo in Los Angeles and Regina Garcia Cano in Las Vegas contributed to this report.\n———\nFollow Jacques Billeaud at www.twitter.com/jacquesbilleaud . His work can be found at https://www.apnews.com/search/jacques%20billeaud .",
    "source_domain": "abcnews.go.com",
    "title": "Arizona man who sold ammo to Las Vegas shooter is charged",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/ammo-dealer-las-vegas-gunman-raised-suspicions-52800910"
}