{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2017-08-14 16:06:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Charlottesville attack suspect denied bail",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fcharlottesville-attack-suspect-denied-bail%2Fstory%3Fid%3D49204733.json",
    "image_url": "http://a.abcnews.com/images/US/charlottesville-protest-driver-mugshot-ht-jef-170812_v12x5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The man who allegedly drove into a group of people who were protesting a white nationalist rally in Charlottesville, Virginia, Saturday, killing a woman and injuring several others, was denied bail this morning as he secures an attorney.\nJames Alex Fields Jr., 20, is charged with second-degree murder, three counts of malicious wounding and one count related to leaving the scene.\nFields, who attended his arraignment via closed-circuit video, had recently moved to Ohio from where he grew up in Kentucky, The Associated Press reported. He apparently has no ties to Charlottesville.\nHe received today a court-appointed attorney who could ask for another bond hearing before Fields' next scheduled court hearing Aug. 25.\nThe Saturday crash that killed Heather Heyer took place at a Unite the Right rally spurred on by Charlottesville's plan to remove a Confederate statue from a local park.\nThe rally was attended by neo-Nazis, skinheads and Ku Klux Klan members, and the white nationalists were met with hundreds of counterprotesters, which led to street brawls and violent clashes.\nFields is accused of driving into the counterprotesters.\nA former high school classmate of the suspect told ABC News that Fields had proclaimed himself a neo-Nazi and white supremacist.\nFields' mother, Samantha Bloom, told The Associated Press she knew her son was attending a rally, but she thought it was a rally for President Donald Trump, not for white nationalists.\n\"I don't really talk to him about his political views,\" she said.\nABC News' Eva Pilgrim, Andy Fies and Janet Weinstein contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Charlottesville attack suspect denied bail",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/charlottesville-attack-suspect-denied-bail/story?id=49204733"
}