{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 04:46:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Today in History",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-50339090.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-50339090",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Saturday, Oct. 7, the 280th day of 2017. There are 85 days left in the year.\nToday's Highlight in History:\nOn Oct. 7, 1977, the Queen double-A single \"We Are the Champions\" (by lead singer Freddie Mercury) and \"We Will Rock You\" (by lead guitarist Brian May) was released in the United Kingdom by EMI Records.\nOn this date:\nIn 1765, the Stamp Act Congress convened in New York to draw up colonial grievances against England.\nIn 1849, author Edgar Allan Poe died in Baltimore at age 40.\nIn 1858, the fifth debate between Illinois senatorial candidates Abraham Lincoln and Stephen Douglas took place in Galesburg.\nIn 1916, in the most lopsided victory in college football history, Georgia Tech defeated Cumberland University 222-0 in Atlanta.\nIn 1929, former Interior Secretary Albert B. Fall, one of the main figures of the Teapot Dome scandal, went on trial, charged with accepting a bribe from oil tycoon Edward L. Doheny. (Fall was found guilty and served nine months in prison; Doheny was acquitted at his own trial of offering the bribe Fall was convicted of taking.)\nIn 1949, the Republic of East Germany was formed.\nIn 1954, Marian Anderson became the first black singer hired by the Metropolitan Opera Company in New York.\nIn 1960, Democratic presidential candidate John F. Kennedy and Republican opponent Richard Nixon held their second televised debate, this one in Washington, D.C.\nIn 1982, the Andrew Lloyd Webber-Tim Rice musical \"Cats\" opened on Broadway. (The show ended its original run on Sept. 10, 2000, after a then-record 7,485 performances.)\nIn 1985, Palestinian gunmen hijacked the Italian cruise ship Achille Lauro (ah-KEE'-leh LOW'-roh) in the Mediterranean. (The hijackers killed Leon Klinghoffer, a Jewish-American tourist, before surrendering on Oct. 9.)\nIn 1991, University of Oklahoma law professor Anita Hill publicly accused Supreme Court nominee Clarence Thomas of making sexually inappropriate comments when she worked for him; Thomas denied Hill's allegations.\nIn 1992, trade representatives of the United States, Canada and Mexico initialed the North American Free Trade Agreement during a ceremony in San Antonio, Texas, in the presence of President George H.W. Bush, Canadian Prime Minister Brian Mulroney (muhl-ROO'-nee) and Mexican President Carlos Salinas de Gortari.\nTen years ago: A 20-year-old off-duty sheriff's deputy went on a shooting rampage in Crandon, Wisconsin, killing six people, including his ex-girlfriend, before taking his own life as police closed in. Nine skydivers and a pilot were killed when their Cessna Caravan 208 crashed in Washington's Cascade Range. In a race run in scorching heat that left one man dead because of a heart condition, Kenya's Patrick Ivuti won the Chicago Marathon by a fraction of a second; another 250 runners were taken to hospitals because of heat-related ailments.\nFive years ago: Venezuelan President Hugo Chavez won re-election for the third time. (Chavez died in March 2013 at age 58 after a two-year battle with cancer; he was succeeded by Vice President Nicolas Maduro.)\nOne year ago: The U.S. accused Russia of hacking American political sites and email accounts in an effort to interfere with the upcoming presidential election and also directly accused Russia of war crimes in Syria; Moscow dismissed the allegations. Colombian President Juan Manuel Santos was named winner of the Nobel Peace Prize, receiving a big boost in his efforts to save an agreement seeking to end his country's half-century conflict.\nToday's Birthdays: Retired South African Archbishop and Nobel Peace laureate Desmond Tutu is 86. Author Thomas Keneally is 82. Comedian Joy Behar is 75. Former National Security Council aide Lt. Col. Oliver North (ret.) is 74. Rock musician Kevin Godley (10cc) is 72. Actress Jill Larson is 70. Country singer Kieran Kane is 68. Singer John Mellencamp is 66. Rock musician Ricky Phillips is 66. Russian President Vladimir Putin is 65. Actress Mary Badham (Film: \"To Kill a Mockingbird\") is 65. Rock musician Tico Torres (Bon Jovi) is 64. Actress Christopher Norris is 62. Cellist Yo-Yo Ma is 62. Gospel singer Michael W. Smith is 60. Olympic gold medal ice dancer Jayne Torvill is 60. Actor Dylan Baker is 59. Recording executive and TV personality Simon Cowell is 58. Rock musician Charlie Marinkovich (Iron Butterfly) is 58. Country singer Dale Watson is 55. Pop singer Ann Curless (Expose) is 54. Rhythm-and-blues singer Toni Braxton is 50. Rock singer-musician Thom Yorke (Radiohead) is 49. Rock musician-dancer Leeroy Thornhill is 48. Actress Nicole Ari Parker is 47. Actress Allison Munn is 43. Rock singer-musician Damian Kulash (KOO'-lahsh) is 42. Singer Taylor Hicks is 41. Actor Omar Benson Miller is 39. Neo-soul singer Nathaniel Rateliff (Nathaniel Rateliff & the Night Sweats) is 39. Actor Shawn Ashmore is 38. Actor Jake McLaughlin is 35. Electronic musician Flying Lotus (AKA Stephen Ellison) is 34. MLB player Evan Longoria is 32. Actress Holland Roden is 31. Actress Amber Stevens is 31. Actress Lulu Wilson is 12.\nThought for Today: \"An egotist is a person of low taste — more interested in himself than in me.\" — Ambrose Bierce, American author-journalist (1842-1914?).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-50339090"
}