{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:14:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Calexit backers drop 1 California secession bid, try again",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcalexit-backers-withdraw-2018-california-independence-bid-46850956.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_98e6d410135f4016be67d2d44704d78b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Supporters of one long-shot bid to make California an independent nation ended their effort on Monday, while another group said it will launch a new campaign for a statewide vote next year.\nThe drive to make the nation's most populous state its own country, with what would be the world's sixth-largest economy, has drawn extra interest after last year's election of Republican Donald Trump as president.\nBut the Yes California Independence Campaign faltered after its president, Louis Marinelli, revealed ties to Russia. Marinelli said in a lengthy message to supporters Monday that he is seeking permanent residence in Russia because of his \"frustration, disappointment and disillusionment with the United States.\"\nThe secretary of state's office confirmed that Marcus Ruiz Evans, the group's vice president, withdrew the California Nationhood ballot measure.\nEvans said he was leaving the Yes California group and joining the California Freedom Coalition, which he described as a grassroots organizing effort that evolved since last year's election.\nThe coalition plans to file its own ballot measure in coming weeks, without the baggage of Marinelli's Russian ties, said Steve Gonzales, the new group's secretary-treasurer and board member.\n\"It prevented Yes California from getting any serious money, I can tell you that,\" Gonzales said, noting that he is a native Californian who has never been to Russia. The group will accept no foreign money, and contributions from other states must be cleared by the coalition's board, he said.\nThe coalition would need to collect more than 585,000 signatures to qualify a ballot measure declaring California's independence for the November 2018 ballot. The measure is still being written, Gonzales said.\nCongress and 38 states would have had to agree to change the U.S. Constitution to permit California to actually secede.\nMarinelli said Yes California had fewer than 97,500 registered supporters. About 8,500 signed up as volunteers, but only about 1,200 had contributed money.\nPrior to Trump's election, the group had fewer than 100 volunteers, Marinelli said, and the group received a social media boost with Trump's election.\nMarinelli and Evans said California's overwhelming support of Democratic nominee Hillary Clinton and measures legalizing recreational marijuana and reducing crime penalties showed how far California voters were removed from the rest of the nation.\nThey also equated the movement to last year's decision by the United Kingdom to leave the European Union, dubbed Brexit. California, with its 39 million residents, is often compared to a nation.\nTheir withdrawn ballot measure would have allowed voters to repeal a part of the state Constitution saying that California is an inseparable part of the United States next year, but left the question of whether California should become a separate country to a future ballot.\nBoth Marinelli and Evans claimed credit for starting the Calexit campaign.\nMarinelli cited his struggle with U.S. officials since 2012 over his wife's immigration status. He praised California officials for their attempts to shield immigrant residents from deportation and said his wife now has her green card.\nWhen California one day becomes independent, Marinelli wrote, \"I shall look forward with great satisfaction to return to California and to live once again under our bear flag.\"",
    "source_domain": "abcnews.go.com",
    "title": "Calexit backers drop 1 California secession bid, try again",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/calexit-backers-withdraw-2018-california-independence-bid-46850956"
}