{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:17:50+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "\"The View\" co-hosts discuss the continuing interest in the president's tax returns.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fpresident-trump-tweets-response-protesters-demanding-taxes-46846301.json",
    "image_url": "http://a.abcnews.com/images/Politics/170417_view_trump_taxes0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for President Trump tweets response to protesters demanding to see his taxes\nThem laugh has had a very interesting Easter. His started the holiday with some tweaks reminding people he won the election. And I blame him yeah yeah is claiming that the protesters who want to see is tax returns were paying to march. There were protests and a 150 cities and even out in space. So. I'm a bad all of these people have been paying out all of these people that. It. What really got me was you know. He ran on this faith based its campaign. And Easter Sunday resurrection Sunday is the most holy religious day of the Christian faith. And the fact that rather than tweeting about new beginnings and hopeful miss and that the risen lord he's tweeting about. Taxes and protests in North Korea I wonder what. The evangelicals. That supported an 80% and I wonder about the Catholic Spain eight I think it was a 60% of white Catholics have voted form. How they felt the about back as I found it so disrespectful. And I like yeah. Today. Asked during. Because there are a lot of things going on that they kept giving in the past so I'm sure that maybe did not just a pricey used to eating and even Jesus rested on the seventh got on these does not. Conte asked Sunday to understand that people have a right to protest what regardless of what the issue is of people of a problem they want to hand over tax returns whenever the issue is. He needs to just he's the president of the United States he needs to ignore it he needs to respect their right to protest and needs to get to the work of what he's couples and newly released his insurance if the economy. Any. To release his taxes he says you know I won the election move not. Not really want to see them what what I think Donald. If you think I'm blows my mind is that he doesn't think people could actually just be interested on their own and the more you withhold something aboard a curiosity gross. The same think happened. And get him with Hillary counseled I think I wanna see my seat at the morsel says he's not gonna reveal these he shouldn't be surprised the number of people wanting to see these tax returns is growing if even only president that has ever not Sammy. They've been I think since Kana daily adding that it. Who knew if he got this barn he doesn't want to will be spending would make sense for him to just stop talking about it maybe he needs. You know when people talk about tax returns you don't want to release them whenever I think you should be you don't want to release. Talk health insurance talk about a plan and what can't count. Can't. Say it enough you remember he was supply to discover. You know I mean it's home. Our nation.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "President Trump tweets response to protesters demanding to see his taxes",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/president-trump-tweets-response-protesters-demanding-taxes-46846301"
}