{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2017-04-17 20:24:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Trump could release his taxes but probably won't, experts say",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-release-taxes-wont-experts%2Fstory%3Fid%3D46844045.json",
    "image_url": "http://a.abcnews.com/images/Politics/GTY-Donald-Trump-MEM-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump like other Americans is supposed to file his taxes by Tuesday’s deadline, but that doesn’t mean the public will get to see his elusive returns.\nTrump was the first presidential candidate in more than 40 years to refuse to release his tax returns, and there's no indication he will do so as president.\nTwo days after thousands of people protested around the country to demand that Trump release his taxes, White House press secretary Sean Spicer said in today's press briefing that the president will not be releasing his 2016 returns, saying – without explanation – that the 2016 returns are “under the same audit that existed.”\n“They are [under audit]. I think it’s been covered before. It was the same thing that was discussed during the campaign trail,” Spicer said .\nAsked by ABC News Chief White House Correspondent Jonathan Karl if Trump plans to ever release his tax returns, Spicer responded that he would get back to him with an answer.\nTrump was under no legal requirement to release his returns as a candidate, and experts said the same is true for him as president.\n\"I know of no law that requires President Trump to disclose his tax returns and I have seen no action that indicates he will do so,\" Kenneth Gross, an expert on laws on political activity, told ABC News.\nThat view was echoed by journalist and author David Cay Johnston, whose books include \"The Making of Donald Trump.\"\nTrump could release all of his tax returns but will \"never\" do so, said Johnston, the founder of DCreport.org, a nonprofit news service.\n“There is no law of any kind that prevents the president from releasing all of his tax returns as, for example, Bill and Hillary Clinton have since the 1970s,” Johnston told ABC News today. “Based on my experience -- my nearly 30 years of experience with Trump -- he will never voluntarily release his tax returns,” he said.\nJohnston was the reporter who obtained what are purportedly the first two pages of Trump's 2005 federal tax return and made them public in March.\nHe said Congress could force the issue.\n“Congress can make these returns public,” Johnston said, pointing to the Joint Committee on Taxation as the vehicle that could take action. “They have experts, they can get these returns, they can hold hearings on them.”\nTrump's taxes and IRS audits\nTrump claimed during the presidential campaign that he could not release his tax returns because they were being audited by the IRS.\nIn a letter released by Trump's presidential campaign in March 2016, two of the then-candidate's lawyers wrote that his personal tax returns had \"been under continuous examination by the Internal Revenue Service since 2002, consistent with the IRS's practice for large and complex businesses ... Examinations for returns for the 2009 year and forward are ongoing,\" the letter said.\nThe letter went on to say that the audits for the years 2002 through 2008 had been closed. Despite that admission, Trump and his team continued to say that his taxes were under audit throughout the campaign.\nTrump could still release his returns if they are under audit, regardless of which years may still be under IRS review, , according to the IRS.\n\"Nothing prevents individuals from sharing their own tax information,\" the IRS told ABC News, speaking generally because it said federal privacy rules prohibit it from discussing any individual's tax matters.\nWhen asked specifically about Trump's various years of returns, the tax agency responded, \"The IRS stresses that audits of tax returns are based on the information contained on the taxpayer’s return and the underlying tax law – nothing else. The audit process is handled by career, nonpartisan civil servants, and we have processes in place to safeguard the exam process.\" the statement reads.\nBeyond Trump's past tax returns, the law requires an IRS audit of every president and vice president's tax returns beginning for the year in which they are inaugurated, which means the automatic audit would apply to Trump's 2017 taxes, to be filed next year, not to his 2016 taxes, due Tuesday.\n\"The requirement for mandatory audits of the tax returns of the president and vice president dates back to the Watergate era in the 1970s,\" the IRS said in a statement to ABC News.\n'People didn't care'\nSome states have considered requiring future presidential candidates to release their tax returns to get on the election ballot, but none have moved yet to do that.\n\"No state has passed such a law, and it is not clear such a law would pass judicial scrutiny,” Gross, the expert on political law, said.\nTrump’s White House team has meanwhile suggested that the president has no plans to release his returns even when any audits end.\nWhen White House press secretary Sean Spicer was asked during a March 31 press briefing if Trump would be releasing his returns for fiscal year 2016, Spicer said he didn’t know.\nPreviously, on Jan. 22, two days after the inauguration, counselor to the president Kellyanne Conway told ABC News that about a petition circulating at the time on the issue, \"The White House response is that he’s not going to release his tax returns.\"\n\"We litigated this all through the election. People didn’t care. They voted for him, and let me make this very clear: most Americans are, are very focused on what their tax returns will look like while President Trump is in office, not what his look like,\" she said.\nAn ABC News/Washington Post poll from around that time found that 74 percent of Americans said President Trump should release his tax returns, including 49 percent of his supporters, 94 percent of those who had supported his campaign rival, Hillary Clinton, and 83 percent of those who preferred either another candidate or none.",
    "source_domain": "abcnews.go.com",
    "title": "Trump could release his taxes but probably won't, experts say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-release-taxes-wont-experts/story?id=46844045"
}