{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 15:59:15+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-st-louis-prosecutor-explain-greitens-case-55531560.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_04719079787a47f68e72e041914f3e06_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the resignation of Missouri Gov. Eric Greitens (all times local):\n10:40 a.m.\nThe prosecutor's office in St. Louis will drop a felony charge of computer data tampering against Missouri Gov. Eric Greitens, now that the Republican governor has announced his resignation.\nSt. Louis Circuit Attorney Kim Gardner announced the decision Wednesday, a day after Greitens' surprise announcement that he would step down effective Friday afternoon.\nThe charge, filed in April following an investigation by the Missouri attorney general's office, accused Greitens of using a donor list from the veterans charity he founded, The Mission Continues, for his 2016 gubernatorial campaign.\nGreitens also was indicted on felony invasion of privacy in February in St. Louis, stemming from an extramarital affair in 2015. The case was dismissed earlier this month and a special prosecutor in Jackson County is still considering whether to refile the charge.\n———\nThis story has been corrected to reflect the charity's name as The Mission Continues.\n———\n9 a.m.\nSt. Louis Circuit Attorney Kim Gardner is planning to explain the resolution of criminal charges against Missouri Gov. Eric Greitens.\nGardner's news conference is scheduled for 10:30 a.m. Wednesday.\nShe said Tuesday that her office has reached a \"fair and just resolution\" on charges of tampering with a computer against Greitens.\nGreitens announced the same day that he is resigning as governor, effective Friday.\nA felony indictment in February accused Greitens of taking an unauthorized and compromising photo of a St. Louis woman during an extramarital affair in 2015.\nThe charge was dropped earlier this month, but Jackson County prosecutor Jean Peters Baker was appointed special prosecutor to consider whether to refile it.\nBaker said in a statement that the investigation is ongoing.\n———\n8:30 a.m.\nOn a dreary overcast day, Missouri Gov. Eric Greitens stood in a light rain near the Governor's Mansion and recounted his grueling training as a Navy SEAL officer to suggest he would never quit fighting allegations of sexual misconduct and campaign finance violations.\nLess than two weeks later, Greitens announced Tuesday that he is quitting with his mission incomplete.\nGreitens' departure will become official at 5 p.m. Friday — marking a stunning political defeat for the 44-year-old, self-made warrior-philosopher who had aspirations of someday becoming president.\nFor those fellow Republicans who had strenuously urged his resignation, Greitens' exit provides the divided party a chance to reunify at the start of a summer campaign season in which it's seeking to unseat Democratic U.S. Sen. Claire McCaskill.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: St. Louis prosecutor drops Greitens felony",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/wireStory/latest-st-louis-prosecutor-explain-greitens-case-55531560"
}