{
    "authors": [
        "Abc News",
        "Dylan Wells",
        "Saisha Talwar"
    ],
    "date_download": "2017-08-14 22:44:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Following bipartisan criticism of his response to the unrest in Charlottesville, the president publicly condemned white supremacists and other hate groups by name.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Flawmakers-slam-trump-delay-denouncing-hate-groups%2Fstory%3Fid%3D49213053.json",
    "image_url": "http://a.abcnews.com/images/Politics/donald-trump2-charlottesville-pol-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Following bipartisan criticism of his response to the unrest in Charlottesville, Virginia, the president publicly condemned white supremacists and other hate groups by name for the first time since violence broke out.\n“Racism is evil,” Trump said on Monday. \"Those who cause violence in its name are criminals and thugs, including the [Ku Klux Klan], neo-Nazis, white supremacists, and other hate groups that are repugnant to everything we hold dear as Americans.\"\n“As I said on Saturday, we condemn in the strongest possible terms this egregious display of hatred, bigotry, and violence. It has no place in America,” Trump added.\nTrump condemned the specific hate groups two days after a rally organized by white supremacists in Charlottesville turned deadly. Heather Heyer, 32, died after a man intentionally drove into a crowd of counter-protesters and 35 more people were injured. James Alex Fields Jr., an alleged Nazi sympathizer, has been charged with second-degree murder, three counts of malicious wounding and one count related to leaving the scene.\nBut while Trump addressed the situation in Charlottesville during a briefing on Saturday, calling for “the swift restoration of law,” he failed to mention the hate groups by name, instead condemning \"violence on many sides.\"\nSusan Bro, Heyer's mother, thanked the president for his words of “comfort and for denouncing those who promote violence and hatred” after his address on Monday.\nA significant number of lawmakers criticized Trump's delay in condemning those groups.\n\"It shouldn’t take the President of the United States two days to summon the basic decency to condemn murder and violence by Nazis and white supremacists,\" House Minority Leader Nancy Pelosi said in a statement.\n“If the President is sincere about rejecting white supremacists, he should remove all doubt by firing Steve Bannon and the other alt-right white supremacist sympathizers in the White House,” Pelosi added.\nSen. Lindsey Graham kept his response short, tweeting, “Well done Mr. President,” following Trump’s comments on Monday.\nA spokesperson for Sen. James Lankford, R-Okla., said the senator “applauds the president for clearly communicating the evilness of racism and clearly calling out the KKK, neo-Nazis, and white supremacists.”\nBut Sen. Kamala Harris, D-Calif., criticized Trump's initial response and delay in condemning the specific groups involved.\nIt’s easy to tweet that hate has no place in America. — Kamala Harris (@SenKamalaHarris) August 14, 2017\nSen. Mark Warner, D-Va. and the state's former governor, took on a different stance, telling MSNBC that Trump “sounded presidential” but he “wished he would have said those words on Saturday.”\n\"But I will give the president the benefit today. He said those words and now, we have to make sure his Department of Justice acts on those words. We fully pursue not only this one individual [James Alex Fields Jr.] ... but the DOJ will also go after these hate groups across the country because they’ll be back,\" Warner told MSNBC.\nRep. Jackie Speier, D-Calif., said she found it puzzling how Trump “didn't hesitate to attack” Merck CEO Kenneth Frazier over his resignation but “balks at calling out avowed white supremacists” for what they stand for.\nTrump has accused Frazier of focusing on “lower rip-off drug prices” on Monday, just hours after Frazier resigned from the president’s American Manufacturing Council in what he described as a stand “against intolerance and extremism.”\nOdd how @POTUS doesn’t hesitate for a second to attack CEO of #Merck, yet balks at calling out avowed white supremacists for what they are. — Jackie Speier (@RepSpeier) August 14, 2017\nRep. Don Beyer, D-Va., criticized the president shortly after his speech on Twitter: “Donald Trump's decision to support Arpaio *during* the Charlottesville crisis, as he refused to condemn white supremacy, speaks volumes.”\nDonald Trump's decision to support Arpaio *during* the Charlottesville crisis, as he refused to condemn white supremacy, speaks volumes. 4/4 — Rep. Don Beyer (@RepDonBeyer) August 14, 2017\nBeyer is referencing Sheriff Joe Arpaio, who was found guilty of criminal contempt for refusing a state judge’s order to stop targeting people he believed were undocumented immigrants during traffic patrols. The president told Fox News Sunday that he is “seriously considering” a pardon for the sheriff.\nBeyer also pointed out that it took two full days of bipartisan criticism and “pleading by aides” as well as senior officials like Lt. Gen. H.R. McMaster, Attorney General Jeff Sessions and his own daughter, Ivanka, for Trump to “issue this basic condemnation.”\nDonald Trump's decision to support Arpaio *during* the Charlottesville crisis, as he refused to condemn white supremacy, speaks volumes. 4/4 — Rep. Don Beyer (@RepDonBeyer) August 14, 2017\nRep. Mike Quigley, D-Illinois, said while he was pleased Trump \"had finally identified this hate,\" he added that such comments should have come 47 hours ago and that “words only mean so much.” Quigley added that America was “watching and waiting.”\nIt's never too late to do the right thing. Public denouncement should've come 47 hrs ago, but I’m pleased Trump finally identified this hate — Mike Quigley (@RepMikeQuigley) August 14, 2017\nHowever, words only mean so much. They must be put into practice every single day through actions. American people are watching & waiting. — Mike Quigley (@RepMikeQuigley) August 14, 2017\nSen. Angus King, an independent from Maine, said he hoped Trump’s words “would begin to unite what white supremacists and bigotry in VA aimed to divide.”\nRacism in all forms is wrong. Let's hope the President's words begin to unite what white supremacists and bigotry in VA aimed to divide. — Senator Angus King (@SenAngusKing) August 14, 2017\nSen. Richard Blumenthal, D-Conn., also responded to the president’s brief remarks, calling it “inexcusable” that Trump waiting so long.\n\"Denouncing white supremacists, KKK, & neo-Nazis should have been instinctive & instant. Trump's failure shows lack of moral leadership,” Blumenthal said in his first tweet, adding “delay greatly dilutes the message.”\nDenouncing white supremacists, KKK, & neo-Nazis should have been instinctive & instant. Trump's failure shows lack of moral leadership. — Richard Blumenthal (@SenBlumenthal) August 14, 2017\nWaiting 2 days to condemn hate groups and racism is inexcusable. Delay greatly dilutes the message. — Richard Blumenthal (@SenBlumenthal) August 14, 2017\nChair of the Democratic National Committee Tom Perez also criticized Trump's delay, writing: “History won’t forget that when the streets of Charlottesville echoed with evil, Donald Trump responded with silence.”\nHistory won’t forget that when the streets of Charlottesville echoed with evil, Donald Trump responded with silence. — Tom Perez (@TomPerez) August 14, 2017\nFor his part, Rep. David Cicilline, D-Rhode Island, tweeted: “It shouldn’t take 72 hours for the President to condemn Nazis marching in the street.”",
    "source_domain": "abcnews.go.com",
    "title": "Lawmakers slam Trump for delay in denouncing hate groups by name",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/lawmakers-slam-trump-delay-denouncing-hate-groups/story?id=49213053"
}