{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 17:33:14+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "This year’s event will be hosted by Full House actor John Stamos and will include performances by The Beach Boys, Pentatonix and The Temptations.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Famericas-largest-birthday-party-inside-capitol-fourth%2Fstory%3Fid%3D56326161.json",
    "image_url": "https://s.abcnews.com/images/US/national-mall-fireworks-gty-hb-180627_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A day before families break out their grills and the sky is illuminated with pyrotechnic grandeur, the largest birthday party for America is being set up for thousands to watch.\nInterested in 4th of July? Add 4th of July as an interest to stay up to date on the latest 4th of July news, video, and analysis from ABC News. Add Interest\n“It’s so awesome to celebrate this country and what it means to us individually and to come together as a huge massive crowd and just have a good time,” said Mitch Grassi, tenor vocalist of Pentatonix.\nA production team of more than 400 members gathered at the National Mall on Tuesday to prepare for one of the largest televised events on July 4. Through the rain, oppressive heat and bright sunshine, the production team and talent rehearsed for the show that has been in planning since last July.\nIn addition to the thousands of people that will watch in person and at home, troops will be able to watch the event at military bases around the world.\n“We are blessed to not only put this out nationally,” said Michael Colbert, executive producer of the event. “But we send it out around the world to all of our troops on the American Forces network. We’re so blessed to celebrate our freedom but freedom isn't free.”\nA Capitol Fourth will further honor the troops with a performance by Opera singer Renée Lynn Fleming who will perform “You’ll Never Walk Alone” while 50 troops and their families will join her on stage.\n“I don’t think there will be a dry eye in the place,” Colbert said.\nThis year’s event will be hosted by Full House actor John Stamos and will include performances by Andy Grammer, The Beach Boys, Jimmy Buffett, Pentatonix, The Temptations and the National Symphony Orchestra to name a few.\nPentatonix will perform their single \"Sing\" and debut a new mashup.\n“The fact that we’ll be able to entertain them while they’re serving our country and bring joy to them and their families is honestly an honor and I have family that’s in the military so it definitely means a lot to me,” said Scott Hoying, baritone vocalist of Pentatonix.\n.@PTXofficial on @GMA this morning and now here in Washington D.C. rehearsing for their @July4thPBS concert tomorrow pic.twitter.com/hGKJFN0RRp — Geneva Sands (@Geneva_Sands) July 3, 2018\nLuke Barr and Geneva Sands contributed to this story.",
    "source_domain": "abcnews.go.com",
    "title": "America's largest birthday party: An inside look at 'A Capitol Fourth'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/americas-largest-birthday-party-inside-capitol-fourth/story?id=56326161"
}