{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 09:45:53+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "The Latest: 38 of 39 Istanbul Nightclub Victims Identified",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-islamic-state-claims-istanbul-nightclub-attack-44508500.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_8f7c8397f6ab4385bc92285fa61a30aa_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the Istanbul nightclub attack (all times local):\n12:20 p.m.\nTurkey's state news agency says 38 of the 39 victims of the New Year's attack on an Istanbul nightclub have been identified.\nThe Anadolu news agency, citing unidentified Turkish justice ministry officials, says 11 those killed by a gunman who escaped were Turkish nationals and one was a Turkish-Belgium dual citizen.\nThe report says seven victims were from Saudi Arabia; three were from Lebanon and Iraq each; two nationals were from Tunisia, India, Morocco and Jordan each. Kuwait, Canada, Israel, Syria and Russia each lost one citizen.\nSixty-nine people were also wounded. Anadolu says one victim remains unidentified.\nRelatives of the victims and embassy personal were seen walking into an Istanbul morgue to take the bodies of the deceased.\nTurkish officials haven't released the names of those identified.\n———\n12 p.m.\nTurkey's state-run news agency says more than 100 Islamic State targets in Syria have been hit by Turkey and Russia in separate operations, a day after a deadly attack at a popular Istanbul nightclub during New Year's celebrations claimed by the group.\nCiting the Turkish Chief of General Staff's office, Anadolu Agency said Turkish jets struck eight IS group targets while tanks and artillery fired upon 103 targets near Al Bab, killing 22 extremists while destroying many structures.\nAnadolu added that Russian jets also attacked IS targets in Dayr Kak, eight kilometers (five miles) to the southwest of Al Bab.\nTurkey sent troops into neighboring northern Syria in August to clear a border area of IS militants and curb territorial advances by Syrian Kurdish forces.\n———\n11:45 a.m.\nThe Islamic State group has claimed responsibility for the Istanbul shooting that killed 39 people and wounded scores of others.\nThe IS-linked Aamaq News Agency said the New Year's attack was carried by a \"heroic soldier of the caliphate who attacked the most famous nightclub where Christians were celebrating their pagan feast.\"\nIt said the man opened fire from an automatic rifle in \"revenge for God's religion and in response to the orders\" of IS leader Abu Bakr al-Baghdadi.\nThe group described Turkey as \"the servant of the cross.\"\n———\n10:10 a.m.\nTurkish media reports say that authorities believe that the Islamic State group is behind the attack on a popular Istanbul nightclub during New Year's celebrations.\nHurriyet and Karar newspaper reports Monday cited unnamed security officials saying that authorities have determined that the gunman who killed 39 people comes from a Central Asian nation and is believed to be either from Uzbekistan or Kyrgyzstan.\nPolice had also established similarities with the high-casualty attack at Ataturk Airport in June and was investigating whether the same IS cell carried out both attacks.\nThe gunman, who is still at large, killed a policeman and another man outside the Reina club in the early hours of 2017 before firing at people partying inside.\nNearly two-thirds of the dead were foreigners, many from the Middle East.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: 38 of 39 Istanbul Nightclub Victims Identified",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-islamic-state-claims-istanbul-nightclub-attack-44508500"
}