{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 21:16:44+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-agent-trial-mexican-teen-cross-border-killing-53857469.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_3e76477337f8494fae11ad5ea98e331c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A U.S. border Patrol agent accused of shooting across the border into Mexico and killing a teenager five years ago will go on trial Tuesday on a charge of second-degree murder in a rare Justice Department prosecution of a fatal cross-border shooting.\nThe agent, Lonnie Swartz, is accused of killing 16-year-old Jose Antonio Elena Rodriguez, who was on the street in Nogales, in the Mexican state of Sonora, just across the border from Nogales, Arizona. An autopsy showed the unarmed teen was hit 10 times, mostly from behind.\nThe trial in U.S. District Court in Tucson comes amid President Donald Trump's immigration crackdown and his pledge to build a \"big, beautiful wall\" along the 2,000-mile (3,200-kilometer) U.S.-Mexico boundary.\nSwartz opened fire at about 11:30 p.m. on Oct. 10, 2012 through the metal poles of a 20-foot (6-meter) fence that sits on a 25-foot (about 7.6-meter) embankment above Mexico's Calle Internacional, a street lined with homes and small businesses.\nThe killing shocked the two communities of Nogales. About 20,000 people live on the Arizona side and about 300,000 live on the Mexico side, but the two communities linked by family members, trade and culture have long been referred to locally as \"Ambos Nogales\" — \"Both Nogales\" in Spanish.\nSwartz's defense lawyers have said Elena Rodriguez threw rocks just before he was shot as an attempt to create a distraction for a drug smuggling attempt and that the officer was justified in using lethal force. They want jurors to visit the site at night to experience the area after dark.\nWitnesses from the Mexico side of the border said they did not see the teen throw rocks and his relatives have denied he was helping drug smugglers, saying he was walking home after playing basketball.\nThe U.S. Attorney's Office has said it won't dispute that the boy was throwing rocks, but it's unknown if he had any link to drug smugglers and the point is irrelevant because an unreasonable amount of force was used.\nSwartz pleaded not guilty after being indicted by a federal grand jury in 2015 and is currently on administrative leave and free on his own recognizance. The Border Patrol has not said if he is continuing to receive his salary.\nDefense attorney Sean Chapman last week (March 15) declined to comment while the trial is ongoing and a spokesman for the agents' union, the National Border Patrol Council, did not respond to multiple requests for comment.\nThe case is expected to last more than a month and activists who support immigrants have said they will protest outside the court.\n\"For so long, prosecutors have been reluctant to charge Border Patrol agents with violent crimes,\" said John Fife, a retired Presbyterian minister who was active in the sanctuary movement that sheltered citizens of Central American countries who came to the U.S. in the 1980s fleeing civil war. \"Now we will see if they can be held accountable.\"\nThe Border Patrol came under close scrutiny during the Obama administration for allegations of excessive use of force. Customs and Border Protection, its parent agency, reported 55 incidents in which employees used firearms from Oct. 1, 2011 to Sept. 30, 2012. The number of incidents fell to 17 for the period from Oct. 1, 2016 to Sept. 30, 2017.\nLee Gelernt, a New York-based lawyer with the American Civil Liberties Union, said he believes Swartz will be the first border agent prosecuted by the Department of Justice in a fatal shooting across the international line.\nGelernt is handling a parallel civil case, now before the 9th Circuit Court of Appeals in San Francisco, which the teen's mother filed against Swartz seeking monetary damages.\nThe civil case argues that Elena Rodriguez was protected by U.S. constitutional guarantees for due process when he was shot dead in Mexico because the two communities of Nogales are part of a unique cross-border community.",
    "source_domain": "abcnews.go.com",
    "title": "US agent goes on trial in Mexican teen cross-border killing",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/us-agent-trial-mexican-teen-cross-border-killing-53857469"
}