{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:27:35+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Ravens owner Steve Bisciotti considered firing coach John Harbaugh after season",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fravens-owner-steve-bisciotti-considered-firing-coach-john%2Fstory%3Fid%3D52806885.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_ss_20180202_162913868_983633_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "OWINGS MILLS, Md. - Baltimore Ravens owner Steve Bisciotti acknowledged that he thought about firing coach John Harbaugh after the team failed to make the playoffs for a third straight season.\n\"It was certainly a consideration, but not one that I was inclined to make this year,\" Bisciotti said at Friday's annual \"State of the Ravens\" news conference.\nThis marked the first time Bisciotti has publicly revealed that he considered parting ways with Harbaugh, who finished his 10th season as the Baltimore head coach.\nHired in 2008 to replace Brian Billick, Harbaugh guided the Ravens to the playoffs in each of his first five seasons, including a Super Bowl title in 2012. Since that championship, Harbaugh is 40-40 with one postseason appearance in five years.\nBisciotti refused to give Harbaugh a playoff-or-bust edict heading into next season.\n\"He's under as much pressure than probably he's ever been in his life, and I expect him to keep his chin up and take his positivity and his talents and make the most of the season,\" Bisciotti said. \"I may as well replace him now if I tell him to make the playoffs or you're out of town next year. That's not the way we run business here.\"\nBisciotti gave Harbaugh a one-year extension before the season. Harbaugh, the longest-tenured coach in Ravens history, is signed through the 2019 season.\nBaltimore finished 9-7 this season and was knocked out of the playoff race in the season finale, when it allowed a winning touchdown to the Cincinnati Bengals on fourth-and-12.\n\"Certainly, it was a thought,\" Bisciotti said when asked whether he had wrestled with the decision to bring back Harbaugh after this season. \"I was very proud of the way John kept fighting, held the team together when we were losing in the middle of the year. Joe [Flacco, quarterback] was obviously producing at substandard with his back injury and after the first couple of weeks, obviously, we were very encouraged by our defense and thought that could hold us together. We didn't perform very well in the middle of the year. I was proud of the way we fought back as a team.\"",
    "source_domain": "abcnews.go.com",
    "title": "Ravens owner Steve Bisciotti considered firing coach John Harbaugh after season",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/ravens-owner-steve-bisciotti-considered-firing-coach-john/story?id=52806885"
}