{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 14:08:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Bernie Sanders kicks off cross-country tour, wants change",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fbernie-sanders-kicks-off-cross-country-tour-change-46852103.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_33d22e9be4934ed79038e801d25cc0c0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Independent U.S. Sen. Bernie Sanders gained roars of approval from a friendly crowd on Monday as he called for a radical transformation of the Democratic Party into a grassroots movement founded on the tenets of his unsuccessful Democratic presidential campaign: fighting against the billionaire class and rigged economic and political systems.\nSanders, of Vermont, and Democratic National Committee Chairman Tom Perez, who faced some boos as he spoke, launched a cross-country tour together in Maine, where Sanders won the Democratic presidential caucuses. The tour will take them from Maine to eight other states, including Florida, Arizona, Montana and Nevada.\nSanders, who ran as a Democrat against Hillary Clinton but returned to the Senate as an independent, said the Democratic Party must stop ignoring half the nation's states and take on corporate greed on behalf of the working class. Perez urged attendees to resist Republican President Donald Trump by winning seats in Congress, statehouses and school boards.\n\"That's what we will do: Fight like hell with you,\" Perez said.\nA crowd of roughly 1,200 filled the State Theatre, with the loudest cheers for Sanders and jeers at mentions of the \"1 percent\" and Trump's executive orders and proposed budget cuts.\n\"Our vision for the future of this country is a very different vision than yours,\" Sanders said, as he called for living wages, protecting Planned Parenthood and fighting income inequality.\nHe also said he's introducing legislation to create a single-payer health care system.\nSome in the crowd also booed at the first mention of the Democratic National Committee. Perez's predecessor, Debbie Wasserman Schultz, resigned after Sanders' campaign pounced on leaked emails that they said showed party officials had favored Clinton during the primaries.\nSome attendees said it's time to unite and reform the Democratic Party, while others said they're skeptical of the political establishment and big money in politics.\nSean Potter, a Sanders supporter and musician from Falmouth, said he was curious to hear from Sanders, whom he noted \"kind of got shafted by\" the Democratic Party.\nSander's appearance comes as Democratic parties nationwide are trying to appeal to the working class in states including Maine, where a resurgent Republican Party in the last decade has gained ground in rural communities roiled by the closing of paper mills and sluggish economic growth.\nSanders drew thousands to a rally at the civic center in Portland in July 2015, showing he was more than a fringe candidate. In the end, he earned nearly two-thirds of the ballots cast in Maine's Democratic presidential caucuses to beat Clinton. Clinton, though, won the party's presidential nomination.\nSanders also did well in rural areas that supported Republican candidate Ted Cruz, a U.S. senator from Texas, in the primary and Trump in the November election.\nTroy Jackson, a logger from the northern Maine town of Allagash and the Maine Democratic Senate leader, said it's time that Democrats to work harder for those communities.\n\"Where I'm from, people live their lives far removed from the powerful elites that seem to hold their destinies in their hands,\" he said.\nJackson also said he's \"heard from a lot of pundits that the average American feels powerless.\"\n\"We know it's rigged,\" he said.\nElissa Moore drove two hours to the rally from Dover-Foxcroft, where she voted for Clinton but has remained a \"big fan\" of Sanders. She's increasingly become involved with politics since Trump's inauguration and worries that gay, lesbian, bisexual and transgender people will suffer under his administration.\n\"Republicans picked up on something, whether it was racism or small-town America not feeling respected or understood,\" said Moore, a mother and occupational therapist. \"Democrats have the reputation of being elitist. That offended people when they went to vote.\"\nTrump has denounced racism and has promised to \"make America great again.\"",
    "source_domain": "abcnews.go.com",
    "title": "Bernie Sanders kicks off cross-country tour, wants change",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/bernie-sanders-kicks-off-cross-country-tour-change-46852103"
}