{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 20:49:49+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fus-supreme-court-justice-receives-lifetime-award-israel-56369379.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_d2e30d3fe61143259236037c99f477c0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. Supreme Court Justice Ruth Bader Ginsburg received a lifetime achievement award Wednesday from a prominent Jewish organization in Israel.\nGinsburg cited Holocaust diarist Anne Frank among others in a speech at a ceremony in Tel Aviv that touched on her fight for women's rights and quoted from Jewish traditions and history.\nGinsburg, 85, has served on the Supreme Court since 1993. She was the second female justice and often cites her Jewish heritage as a source for her love of learning and sensitivity to the plight of oppressed minorities.\n\"When I became active in the movement to open doors to women, enabling them to enter occupations once closed to them — lawyering and judging, bartending, policing, and firefighting, for example — I was heartened by the words of a girl of my generation,\" Ginsburg said, referring to Anne Frank, who questioned gender inequality in her writings.\nGinsburg quoted from a statement she gave years ago when she was asked about how her Jewish heritage fits together with her occupation as a judge.\n\"I am a judge, born raised and proud of being a Jew. The demand for justice, for peace, for enlightenment runs through the entirety of Jewish history and Jewish tradition,\" she said. \"I hope that in all the years I continue to have the good fortune to serving on the bench of the Supreme Court of the United States I will have the strength and courage to remain steadfast in service of that demand.\"\nThe Genesis Prize Foundation pointed to Ginsburg's \"groundbreaking legal work in the field of civil liberties and women's rights\" when it announced the winner in November. The foundation sponsors the annual Genesis Prize — an award informally known as the Jewish Nobel.\nThe prize recognizes Jewish achievement and contributions to humanity. Previous recipients include former New York City Mayor Michael Bloomberg, actor Michael Douglas, violinist Itzhak Perlman and sculptor Anish Kapoor.\nActress Natalie Portman snubbed the event earlier this year, saying she did not want her attendance to be seen as an endorsement of Israeli Prime Minister Benjamin Netanyahu.\nThe Genesis Prize was inaugurated in 2014 and is run in partnership between the Israeli prime minister's office, the private Genesis Prize Foundation and the chairman's office of the Jewish Agency, a nonprofit group with close ties to the Israeli government. It is funded by a $100 million endowment established by the foundation.\nOn Thursday, Ginsburg is set to attend a screening in Jerusalem of \"RBG,\" a documentary about Ginsburg that adds to the cultural phenomenon created by the 2015 book, \"Notorious RBG: The Life and Times of Ruth Bader Ginsburg.\" The film's story traces her legal work advancing rights for women leading up to her 1993 elevation to the top court, and her role as a justice since.",
    "source_domain": "abcnews.go.com",
    "title": "US Supreme Court Justice receives lifetime award in Israel",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/us-supreme-court-justice-receives-lifetime-award-israel-56369379"
}