{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:15:29+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "For GOP, a dimmed zeal for investigations in Trump era",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fgop-dimmed-zeal-investigations-trump-era-45503555.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/gop-dimmed-zeal-investigations-trump-era-45503555",
    "language": "en",
    "localpath": null,
    "maintext": "The Republicans' ardor for investigations and oversight, on display throughout the Obama administration, has cooled off considerably with Donald Trump in the White House.\nEach day seems to bring a new headache or near-crisis from Trump, the latest being the departure of his national security adviser under questionable circumstances involving Russia.\nYet if there is a line too far, at which point Republicans will feel duty-bound to call for an independent investigation of their president or his administration, Trump hasn't crossed it yet.\nDemocrats are clamoring for a full-scale probe of the resignation of National Security Adviser Michael Flynn, including demanding to know what Trump knew, and when, about Flynn's pre-inauguration conversations with a Russian ambassador about U.S. sanctions. White House press secretary Sean Spicer disclosed that Trump was told in late January that Flynn had misled Vice President Mike Pence about those conversations.\nRather than go along with Democrats' call for an independent outside investigation, Senate Republicans insisted Tuesday that the Intelligence Committee could look at the circumstances as part of an existing probe into Russia's interference in the presidential election.\n\"The Intelligence Committee is already looking at Russian involvement in our election and they have broad jurisdiction over the intel community writ large and they can look at whatever they choose to,\" said Senate Majority Leader Mitch McConnell, R-Ky., adding that \"it's highly likely they'd want to take a look at this episode as well.\"\nThe intelligence panel's chairman, Sen. Richard Burr of North Carolina, told reporters that \"aggressive\" oversight would continue \"privately. We don't do that in public.\"\nHouse Republicans were even less interested, with some shrugging off Democrats' calls for an investigation entirely. Rep. Devin Nunes of California, chairman of the House Intelligence Committee, said that the \"real crime\" is how Flynn's phone conversations were leaked, echoing a complaint Trump himself made over Twitter.\n\"I think the situation has taken care of itself\" in light of Flynn's resignation, House Oversight Committee Chairman Jason Chaffetz, R-Utah, told reporters. That's a far different stance toward potential wrongdoing by the executive branch than Chaffetz took last year, when House Republicans issued more than 70 letters and subpoenas aimed at investigating Democrat Hillary Clinton over a period of less than three months after the FBI announced criminal charges weren't warranted related to her use of a private email server as secretary of state.\nChaffetz did turn his attention to a different Trump administration matter later Tuesday, sending a letter to the White House seeking information about Trump's discussion of a North Korea missile launch while dining al fresco with the Japanese prime minister at a resort in Florida.\nSen. Rand Paul, R-Ky., went so far as to counsel publicly against spending too much time investigating the White House, saying that doing so could only be counterproductive at a moment when the GOP faces a daunting legislative agenda on Capitol Hill.\n\"I just don't think it's useful to be doing investigation after investigation, particularly of your own party,\" Paul said in an appearance on Fox News Radio's \"Kilmeade and Friends.\" ''We'll never even get started with doing the things we need to do like repealing Obamacare if we're spending our whole time having Republicans investigate Republicans. I think it makes no sense.\"\nThe relatively hands-off stance of the GOP toward the Trump White House angers Democrats, who are powerless to do much except fume from the minority in both chambers of Congress.\n\"Do you hear the silence? This is the sound of House Republicans conducting no oversight of President Trump. Zero,\" Rep. Elijah Cummings of Maryland, top Democrat on the Oversight Committee, complained at a news conference Tuesday. \"That is what it sounds like when they abdicate their duty under the Constitution. We've been asking for months for basic oversight.\"\nThe GOP's lack of enthusiasm about investigating the Trump White House comes as Capitol Hill Republicans struggle to come to terms with a new administration that has been engulfed in upheaval after upheaval. Republicans are trying to focus on their agenda despite the distractions. And for now, they appear to have concluded, going easy on Trump is the best way to achieve their goals, including confirming a Supreme Court justice and passing a new health care law and other legislation they want the president to sign.\n\"We know full well that there are issues that are going to come up on a daily basis that we're going to get asked about and have to respond to,\" said Sen. John Thune of South Dakota, the No. 3 Senate Republican, \"but we're interested in repealing and replacing Obamacare, reforming the tax code, reducing the regulatory burden on businesses, confirming a Supreme Court justice, getting these Cabinet nominees through — that's what our agenda is right now.\"",
    "source_domain": "abcnews.go.com",
    "title": "For GOP, a dimmed zeal for investigations in Trump era",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/gop-dimmed-zeal-investigations-trump-era-45503555"
}