{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 07:53:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "AP FACT CHECK: GOP questions on bump stocks ignore details",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fap-fact-check-gop-questions-bump-stocks-ignore-50339800.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_f220d90ffb7a458f96a7c3ebb9bb77e2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's not every day — or every year or every decade — you see Republicans raising questions about whether Democrats were tough enough on gun control when they were in power.\nSuch is the case now as political debate stirs over a regulatory decision approving the use of \"bump stocks\" like those possessed by the Las Vegas gunman.\nSome Republicans are gingerly asking whether the Obama administration was on the ball when it approved the device in 2010. Gingerly, perhaps, because both parties are in some ways complicit in allowing the device to become available to killers even as they seem willing to join now in restricting or banning them.\nA product that can make a semi-automatic weapon fire almost as rapidly as a machine gun was clearly under the radar of political Washington until the massacre of 58 people by a man whose astonishing personal arsenal included bump stocks. Lawmakers in both parties are saying they hadn't heard of the device until this week or known much about it. \"A lot of us are coming up to speed (on) just what this is,\" said House Speaker Paul Ryan.\nHere's a sampling of the rhetoric:\nKELLYANNE CONWAY, adviser to President Donald Trump: \"It was President Obama's ATF, the Bureau of Alcohol, Tobacco and Firearms, in 2010 that decided not to regulate this device. ... That should be part of the conversation.\" — to CNN on Thursday\nRYAN, on that agency's decision: \"Was it a regulatory misstep by ATF some number of years ago?\" — news conference Thursday\nREP. KEVIN McCARTHY, House majority leader: \"I do not know why the ATF actually approved this under Barack Obama.\" — to Fox News on Thursday\nTHE FACTS: Yes, approval of the device was an Obama-era decision.\nBut there's more. Republicans by and large did not support Democratic legislation that would have restricted bump stocks. Such a provision was contained in a 2013 bill pushed by Democratic Sen. Dianne Feinstein of California.\nThere's still more, though. The provision was in a bill that had little hope of GOP support because it sought to restore a ban on certain semi-automatic weapons, a non-starter for many in the GOP.\nLegislation often contains pieces that might win bipartisan support if they were not entangled in sweeping measures unpalatable to the other side.\nSo, in essence, neither party in Congress had the foresight to take a clean run against bump stocks and similar devices before they were put to such lethal use.\nIn a June 2010 letter, the Bureau of Alcohol, Tobacco, Firearms and Explosives told the manufacturer that it considered the device to be outside its regulatory jurisdiction, thereby posing no obstacle to its marketing. The bureau noted that the device was intended to help people whose hands have limited mobility and that it had no automatically functioning parts. Constant forward pressure with the non-shooting hand and constant rearward pressure with the shooting hand were required for it to work, the letter said.\nEDITOR'S NOTE _ A look at the veracity of claims by political figures",
    "source_domain": "abcnews.go.com",
    "title": "AP FACT CHECK: GOP questions on bump stocks ignore details",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/ap-fact-check-gop-questions-bump-stocks-ignore-50339800"
}