{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 08:40:02+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fmissing-woman-dementia-found-dead-calif-hospital-55552910.json",
    "image_url": "https://abcnews.go.com/US/wireStory/missing-woman-dementia-found-dead-calif-hospital-55552910",
    "language": "en",
    "localpath": null,
    "maintext": "A woman who was found dead Wednesday in a stairwell of a power plant at Zuckerberg San Francisco General Hospital had dementia and vanished from a nearby mental health facility 10 days ago, her daughter said.\nA staff member found the body at about 1 p.m. The county medical examiner's office identified the woman as Ruby Andersen, 75.\nAn autopsy was pending.\n\"I don't know how she died,\" her daughter, Charlene Roberts, told KRON-TV . \"Did she have a stroke or fell? I don't know what happened.\"\nRoberts, who gave her mother's age as 76, said the woman had dementia and two hearing aids and went missing on May 20 from a mental health facility.\n\"We almost hired a private investigator\" to look for her, Roberts said.\nHospital spokeswoman Rachael Kagan said the woman was not a patient at San Francisco General but noted that there were other facilities on the same campus operated by the San Francisco Department of Public Health. They include the 47-bed Mental Health Rehabilitation Center.\nAndersen was found in a stairwell that usually is locked and only accessible to maintenance workers, Kagan said.\n\"We are very concerned how this could have happened,\" she said.\nPolice, public health and sheriff's investigators were working on the case.\nFive years ago, the body of a missing patient was found in a stairwell at the same hospital, more than two weeks after a patient disappeared from her room.\nAn autopsy determined that 57-year-old Lynne Spalding had been dead for several days before her body was found in a stairwell that was supposed to be routinely checked by security.\nThe Sheriff's Department, which is responsible for the hospital's security, paid Spalding's family $3 million to settle a legal claim.",
    "source_domain": "abcnews.go.com",
    "title": "Missing woman with dementia found dead near Calif. hospital",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/wireStory/missing-woman-dementia-found-dead-calif-hospital-55552910"
}