{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:48:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Russian event urges new look at Syria's 'liberated' Aleppo",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frussian-event-urges-syrias-liberated-aleppo-48039233.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_a6584995746d45f0b81eb06f2a9644b2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Some 25,000 Christians have returned to eastern Aleppo, Russia's ambassador in Geneva told a conference organized by his country to highlight the devastated Syrian city's steps toward returning to normal six months after rebel fighters were ousted by Russian-backed troops. The international Red Cross went even further, estimating that some 80,000 people total have returned.\nThe Russian conference, \"Aleppo: A city free from terror. New life, new hopes,\" took place Wednesday on the sidelines of the U.N. Human Rights Council just as the International Committee for the Red Cross across the street released a new report with a decidedly different theme: \"I saw my city die\" — referring to Aleppo as well as Iraq's Mosul and Taiz in Yemen.\nThe Russian event, where panelists variously decried propaganda, fake news and the alleged slant of \"mainstream media\" in the West about Syria, exemplified a painstaking Russian effort to generate another narrative about the country's war that has left at least 400,000 people dead and driven over 12 million people from their homes. The ICRC event more broadly pointed to how urban areas have increasingly become the locus of deadly wars and fighting in the world's most intractable recent conflicts.\nThe Syrian government of President Bashar Assad, which counts Russia as perhaps its biggest military and diplomatic backer, stands accused by the United Nations and human rights organizations and witnesses of systematically bombing hospitals in eastern Aleppo during its massive bombing campaign, killing dozens of medics over the years.\nAt its presentation, Russia highlighted the medical relief that its own military teams have been helping provide on the ground in Aleppo.\nAmbassador Alexey Borodavkin cited the return figures from local Christian leaders, but didn't specify where they had come from or why other religious groups went unmentioned. Syria's ambassador in Geneva, Hussam Aala, insisted \"many more\" than that had returned to eastern Aleppo from other parts of Syria, but he did not elaborate.\nIngy Sedky, spokeswoman for ICRC Syria, said her organization estimated some 80,000 had returned — many of whom had fled to the western side of the city that has long been in government control.\nThe Russian event aimed, in their view, to set the record straight about Aleppo and appeal for greater support from Western nations. Speakers said the West had once been very vocal about helping the people of Aleppo but have grown quieter since Syrian troops backed by Russian and Iranian forces recaptured all of Aleppo.\n\"In fact, this event is very important because it is coming at a time where those who were making noise only a few months ago about the situation in Aleppo and the suffering of people in Aleppo are totally ignoring now - deliberately ignoring - the needs of the people of Aleppo,\" Aala said from the audience, praising Russia's role.\nBorodavkin insisted that the \"terrorists\" — such as al-Qaida's Syria affi'aliate and its allies — were the ones who destroyed homes, businesses and hospitals in Aleppo: \"It was not the Russian and Syrian air force who did that.\"\nRussian air power was instrumental in helping President Bashar Assad's forces to regain the city.\nThe ambassador refused to answer on the record when asked about allegations by some diplomats and others that the Russian presentation in Geneva smacked of propaganda itself.\nDuring the two-hour presentation on U.N. premises, Russian organizers arranged a video uplink with several people in eastern Aleppo — set before its rubble-strewn Old City — including the regional governor and Omran Daqneesh, a young boy who became an emblem of violence in Aleppo last year, and his father.\nThe presentation included images of Russian medics helping the injured and video shot by unmanned aircraft of the evacuation of eastern Aleppo under an internationally-brokered accord late last year.\nAs the boy waved to the camera, Russian diplomat and conference mediator Maria Khodynskaya quipped: \"Yes, Omran was a little bit bored but, anyway, he's too small to understand what propaganda is.\"\n.",
    "source_domain": "abcnews.go.com",
    "title": "Russian event urges new look at Syria's 'liberated' Aleppo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/russian-event-urges-syrias-liberated-aleppo-48039233"
}