{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:27:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Red Panda's stolen unicycle being replaced by Warriors",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fred-pandas-stolen-unicycle-replaced-warriors%2Fstory%3Fid%3D52805319.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180202_NBA_WARRIORS_THE_JUMP_ON_RED_PANDA_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Golden State Warriors are trying to fix one of the most popular halftime acts in the NBA and college basketball.\nOn Friday, the franchise announced that it would replace the stolen unicycle of Red Panda Acrobat, the viral halftime show created by Rong Niu.\nLast month, the customized, $25,000 unicycle Niu had used for nearly 30 years was stolen from a San Francisco airport, per KTVU.com. Local authorities released photos of a man who appeared to walk away with the luggage carrying Niu's 7-foot bike. Her agent, Pat Figley, offered a $2,000 reward for its return.\nWarriors president Rick Welts announced Friday, however, that his team would replace the bike.\nFigley said she's appreciative of the Warriors' gesture.?\nShe's been using a backup unicycle, but she's not completely comfortable with it because it's not one she'd ever used in performances until her customized bike was stolen.\n\"It's incredible that they're doing that,\" Figley said to ESPN.com about the Warriors' gesture. \"Their generosity is amazing. It just blew me away. And it lifted her spirits.\"\nFigley said that Niu is still hoping someone will return her original unicycle but that she's excited to get a new bike from the Warriors. The process will take time, however, because few companies make the unicycles she uses.\n\"It's like a custom-made suit,\" Figley said. \"Not off rack.\"\nIn the show, Niu steers her unicycle with one foot while tossing and stacking bowls on her head with the other foot. She's widely recognized as one of the most memorable halftime acts at NBA and college basketball games. She participated in \"America's Got Talent\" in 2013 but withdrew from the show to deal with her father's illness. She has been featured on Marshawn Lynch's Facebook reality show, and athletes sometimes leave the locker room to catch her act. Cleveland Cavaliers owner Dan Gilbert was infuriated when he learned Niu's unicycle had been stolen.\nWith the backup, Niu has not been able to perform her customary magic. In Tuesday night's North Carolina-Clemson game, she dropped several bowls and seemed out of sync. She is scheduled to perform Friday at the Yale-Princeton game.\nIn 2015, Niu told ESPN.com she has practiced her craft since she was 7 years old and attended a Chinese school for acrobats. She still practices every day, and she's conscious of her popularity.\nDuring one halftime moment she'd rather forget, she fell while performing at a Cavaliers game. Her pedals had been damaged at the airport, and she wasn't aware until she tried to maneuver the bike.\nHer lasting memory from that night? Wondering whether she had disappointed LeBron James, who actually missed the performance while he was in the locker room with his team at halftime.\n\"It's still upsetting,\" Niu said then. \"LeBron was there. I was so upset.\"",
    "source_domain": "abcnews.go.com",
    "title": "Red Panda's stolen unicycle being replaced by Warriors",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/red-pandas-stolen-unicycle-replaced-warriors/story?id=52805319"
}