{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:12:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fjohn-oliver-spoofs-pence-picture-book-bunny-53852007.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/WireAP_c61f94df8dea4ea3b80b7711a0fed58b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "John Oliver has trolled his way to the top.\nThe HBO host's spoof of a new picture book by the wife and daughter of Vice President Mike Pence was No. 1 on Amazon.com and out of stock as of midday Monday.\n\"Marlon Bundo's Day in the Life of a Vice President\" is a tribute to the Pence family's beloved rabbit. It was written by the vice president's daughter, Charlotte Pence, and illustrated by his wife, Karen Pence. Oliver's book, which he announced over the weekend, is called \"Last Week Tonight with John Oliver Presents a Day in the Life of Marlon Bundo.\" The story is the same, almost: This Marlon Bundo has fallen for a male bunny.\n\"There are a few small differences between the two books,\" Oliver said on his show, noting Pence's opposition to gay marriage and other LGBTQ rights. \"This is a sweet story about Marlon Bundo falling in love.\"\nPublished by Chronicle Books, the parody was written by \"Last Week\" contributor Jill Twiss and illustrated by EG Keller. Proceeds are being donated to The Trevor Project, a suicide hotline for LGBTQ youth, and AIDS United.\nIt's not the only current best-seller inspired by the Trump administration. No. 2 on Amazon was James Comey's \"A Higher Loyalty,\" the upcoming memoir by the FBI director fired last year by President Donald Trump. At No. 3 on Monday was \"Russian Roulette,\" in which Michael Isikoff and David Corn investigate Trump's alleged ties to Russia.\nThe Pence book, meanwhile is a best-seller, too, ranked No. 11 on Amazon.",
    "source_domain": "abcnews.go.com",
    "title": "John Oliver spoofs Pence picture book about bunny",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/john-oliver-spoofs-pence-picture-book-bunny-53852007"
}