{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:10:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "On Friday, Angelo Colon-Ortiz, 31, of Worcester, was arrested in connection with the killing after his DNA matched samples from Marcotte's hands, said Worcester County District Attorney Joseph Early Jr.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fstate-trooper-dna-helped-catch-mass-joggers-alleged-46845408.json",
    "image_url": "http://a.abcnews.com/images/US/170417_wabc_jogger_killer_caught_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for How state trooper, DNA helped catch Mass. jogger's alleged killer 8 months later\nA man wanted for the murder of a Google employee from New York is in custody Vanessa mark cut. Was killed while jogging near her mother's home in Massachusetts Eyewitness News anchor camera's auto has details about the break in the case. We got. The man police believe brutally attacked and assaulted 27 year old Vanessa Marc Ott is behind bars being held on ten million dollars bail he never lost base pay. It Tuesday. Last August Markota Google employee went for a jog in broad daylight near her mother's home in Massachusetts and never return not a day goes by. That we don't reflect on the enormity. Of law and now eight months later police arresting 31 year old Angela colon Ortiz. In connection with her death after a vigilant state trooper spotted him and a dark SUB matching one scene on the day that she was killed. Do believe he was working in the year and had been the sometime authorities say it was mark potter self who gave investigators the critical clue they needed. Putting up a fight. Getting her assailants DNA under her fingernails. Police say Cologne Ortiz gave them a voluntary DNA sample and it was a match that was heard determined by her rapids. That we obtain the DNA. Of her kill. A loving caring and intelligent young woman. Who had her whole life ahead of her in her brief 27 years she had already achieve the much but we know. She had much more to do Kendra shot or channel seven Eyewitness News.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "How state trooper, DNA helped catch Mass. jogger's alleged killer 8 months later",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/state-trooper-dna-helped-catch-mass-joggers-alleged-46845408"
}