{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 20:11:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The Latest: Putin says Jerusalem move may end peace process",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-putin-jerusalem-move-end-peace-process-51723560.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_4ec8627887894c2a95659b358581b668_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on Russian President Vladimir Putin's trip to Syria, Egypt and Turkey: (all times local):\n10:15 p.m.\nRussian President Vladimir Putin has criticized the U.S. administration's recognition of Jerusalem as Israel's capital, warning that it could destabilize the region and derail the Middle East peace process.\nSpeaking Monday after a hectic day that took him from a Russian base in Syria to Cairo to Ankara, Putin said the Trump administration's move \"doesn't help the Mideast settlement and, just the opposite, destabilizes the already difficult situation in the region.\"\nThe Russian leader added that it may \"finish prospects for the Palestinian-Israeli peace process.\"\nHe added that Moscow believes the status of Jerusalem can only be settled through talks between the Palestinians and Israel in line with United Nations resolutions.\n———\n8:15 p.m.\nRussian President Vladimir Putin has arrived in Ankara to meet his Turkish counterpart, following visits to Syria and Egypt.\nPutin and President Recep Tayyip Erdogan are meeting Monday evening to discuss developments in Syria and the Middle East, as well as bilateral relations, according to the Turkish president's office.\nPutin and Erdogan met several times this year and regularly talk on the telephone as they and Iran work to broker a solution in Syria.\nRelations between the two countries were tense after Turkey shot down a Russian fighter jet for violating its airspace in 2015. But the two have since restored bilateral relations.\nPutin and Erdogan are expected to hold a joint news conference after their meeting.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Putin says Jerusalem move may end peace process",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-putin-jerusalem-move-end-peace-process-51723560"
}