{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 22:31:05+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmike-pouncey-agrees-year-15m-deal-chargers%2Fstory%3Fid%3D53859584.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0319/dm_180319_NBA_CAVS_WOJ_ON_LUE/dm_180319_NBA_CAVS_WOJ_ON_LUE_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "COSTA MESA, Calif. -- The Los Angeles Chargers brought in the team's biggest target in free agency this week, agreeing to terms on a two-year deal with former Miami Dolphins center Mike Pouncey, the team announced on Monday.\nA source told ESPN NFL Insider Adam Schefter that the deal is worth $15 million, including $10 million fully guaranteed.\nReleased by the Dolphins last week because he refused to take a pay cut, the 28-year-old Pouncey consummated a deal with the Chargers after an in-house visit on Monday.\nWith Pouncey signed through the 2020 season as part of a five-year contract extension with the Dolphins in 2015, Miami saved $7 million on its salary cap with his release.\nA three-time Pro Bowler, Pouncey started 93 games in seven seasons with the Dolphins but played in all 16 games last season for the first time since 2012.\nThe Chargers could use help up front on their offensive line and have not found a long-term replacement at center since Nick Hardwick retired after the 2014 season.\nSpencer Pulley started all 16 games last season in his first year as a starter, but the Vanderbilt product's performance was uneven.\nWith Pouncey in the fold, the Chargers have a projected starting offensive line of Russell Okung at left tackle, Dan Feeney at left guard, Pouncey at center, Forrest Lamp at right guard and Joe Barksdale at right tackle.\nKnown for his strength as a run-blocker, Pouncey should improve a running game that averaged 3.81 yards per carry last season, No. 26 in the NFL.\nPouncey, who was a Dolphins team captain last season, also was one of the central figures in the locker room bullying scandal involving former Dolphins offensive lineman Jonathan Martin.\nNFL investigator Ted Wells' 144-page report into the incidents found that Pouncey and teammate John Jerry followed Richie Incognito's lead in bullying Martin.\nPouncey's twin brother, Maurkice, is the starting center for the Pittsburgh Steelers.",
    "source_domain": "abcnews.go.com",
    "title": "Mike Pouncey agrees to 2-year, $15M deal with Chargers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/mike-pouncey-agrees-year-15m-deal-chargers/story?id=53859584"
}