{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 19:30:48+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Factivists-protest-planned-west-bank-demolition-56361683.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_a82f3b8999e348869e1918d67c58959a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Israeli police scuffled with activists protesting the planned demolition of a Bedouin hamlet in the West Bank on Wednesday amid international opposition to the razing of the site.\nPolice spokesman Micky Rosenfeld said 11 people were arrested in the \"disturbance\" including several for throwing stones at officers in Khan al-Ahmar. He said three officers were injured, including one evacuated to a hospital for treatment.\nMustafa Barghouti, a Palestinian legislator, said four protesters were injured.\n\"This is a vicious, barbaric attack on peaceful demonstrators and they are trying to demolish Khan Al-Ahmar,\" he said.\nIsrael says the structures that make up the Khan al-Ahmar encampment of corrugated shacks and tents were illegally built and pose a threat to residents because of their proximity to a highway.\nPolice could be seen dragging a handcuffed woman and pushing a Bedouin man. A construction vehicle flattened earth near the site.\nThe Bedouin village outside the Kfar Adumim settlement, is set to be demolished at an unknown date after Israel's Supreme Court approved the move in May.\nIsrael agreed to resettle the residents in an area some 12 kilometers (seven miles) away.\nIsrael captured the territory in the 1967 Mideast war.\nCritics say it is nearly impossible to get a building permit from Israel and that the village's demolition and the removal of its 180 or so residents is a ploy to clear the way for new Israeli settlements.\nThe village is located in the 60 percent of the West Bank known as Area C, which remains under exclusive Israeli control and is home to dozens of Israeli settlements. Israel places severe restrictions on Palestinian development there and home demolitions are not unusual.\nAs part of interim peace deals in the 1990s, the West Bank was carved up into autonomous and semi-autonomous Palestinian areas, known as Areas A and B, and Area C, which is home to some 400,000 Israeli settlers.\nThe Palestinians say that Area C, home to an estimated 150,000 to 200,000 Palestinians, is crucial to the economic development of their future state.\nThe U.N.'s main human rights body on Tuesday called on Israel to abandon the demolition plans.\nThe French Foreign Ministry condemned the looming demolition saying it undermines \"the viability of a two state solution\" to the conflict.",
    "source_domain": "abcnews.go.com",
    "title": "Activists protest planned West Bank demolition",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/activists-protest-planned-west-bank-demolition-56361683"
}