{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:49:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Houston's Reader ready to step in for Wilfork",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fhoustons-reader-ready-step-wilfork-49215291.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/houstons-reader-ready-step-wilfork-49215291",
    "language": "en",
    "localpath": null,
    "maintext": "Filling Vince Wilfork's shoes is daunting.\nThe good news for the Houston Texans and D.J. Reader is that he spent his rookie season being groomed for this job by the nose tackle before he retired this month.\nGetting to spend a season with Wilfork was a thrill for Reader, who watched him growing up and throughout his career at Clemson. The pair spent hours together on and off the field last year in Wilfork's second season in Houston after he played for the New England Patriots for 11 seasons.\n\"It helped a lot especially just how to handle double teams and learning a little bit about how to be a pro and things like that,\" Reader said.\nReader isn't intimidated by moving into Wilfork's spot and actually takes pride in the fact that he's now starting in the place that the player he always idolized once held.\n\"It feels good for sure,\" he said. \"Can't really worry about (comparisons to) him, I just go out there and practice hard and play hard.\"\nCoach Bill O'Brien saw the benefits of the relationship between Wilfork and Reader and knows that he'll continue to learn this season from other veterans on the defensive line such as superstar defensive end J.J. Watt.\n\"With Vince retiring and not being here, we've still got J.J. in there (as) a great mentor for D.J. and we've got some guys in there that do a great job just working together,\" O'Brien said. \"It was good to have that experience with Vince last year and now he's having that experience with Watt this year, which is great.\"\nThe Texans need Reader to take a step forward this season to man the middle of a line featuring Watt and 2014 top overall pick Jadeveon Clowney.\nReader appeared in each game last season and made seven starts while Wilfork was dealing with injuries. He finished with 22 tackles and one sack in his first season after the Texans drafted him in the fifth round following a Clemson career where he played 46 games and had 145 tackles.\nHe's impressed in camp so far with O'Brien raving about his work in practice.\n\"He's an excellent player, excellent young player,\" O'Brien said. \"Tough, strong, plays low to the ground, very smart, good teammate. He's got all the qualities that you're looking for in a good player.\"\nThe 6-foot-3, 335-pound Reader believes he's a much different player than he was a year ago. Part of his improvement comes from a mindset of pushing himself to his limits.\n\"It's about being in every play, playing with effort and technique every single play. Just not stopping,\" he said. \"No matter how tired you get you've still got one more rep in you. I think that's important.\"\nHe believes things will be a bit easier this season now that he's grasped the idea that he's simply one piece of what should be a really good defense and that he doesn't have to try and do too much.\n\"I'm not out there just searching for plays like you are when you're young, just trying to get on film and stuff,\" he said. \"I trust the defense and I know now that if I do my job everything will shake out.\"\nAnd even though Wilfork has retired, Reader knows that if he needs anything he's only a phone call or a text away.\n\"I still want him to be around,\" Reader said.\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Houston's Reader ready to step in for Wilfork",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/houstons-reader-ready-step-wilfork-49215291"
}