{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2018-03-19 20:57:11+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Bryson Suber couldn't hold back his tears as his mother, Tearra, wed his father.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fyear-boy-breaks-tears-watching-mother-walk-aisle%2Fstory%3Fid%3D53849525.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/bryson-suber-wedding-5-ht-jt-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One 6-year-old boy was overcome with so much emotion while watching his mother walk down the aisle to wed his father that he was captured sobbing in a now-viral, heartwarming photo.\nBryson Suber served as the ring bearer for the September 4, 2016, wedding of his parents, Tearra and Bryant Suber, who were high school sweethearts.\nAs he watched his mother walk down the aisle inside Pinnacle Golf Course in Grove City, Ohio, he couldn't hold back his tears.\n@wanderingwoo/wanderingwoo.com\nTearra, 30, told ABC News she initially \"did not notice Bryson right away.\"\n@wanderingwoo/wanderingwoo.com\n\"When I got to the end of the aisle -- as you can imagine -- I was completely overwhelmed with emotions as soon as I hit the end of that aisle,\" she said.\nThe mother of two added that even her father, who walked her down the aisle, had to whisper in her ear to calm her emotions.\n@wanderingwoo/wanderingwoo.com\n\"It wasn't until halfway down the aisle that I noticed Bryson,\" she said. \"It completely took me back. The magnitude of that day and that moment meant a lot to us.\"\nPhotographer Paul Woo told ABC News in a statement that it was \"difficult\" to capture Bryson's heartwarming moment.\n\"I was secretly bawling behind the camera and had to prioritize this moment over the bride coming down the aisle,\" he explained. \"Yes, I got both photos, but I knew this moment was the moment.\"\n@wanderingwoo/wanderingwoo.com\nTearra said she wasn't surprised by her eldest son's reaction as \"he's a mommy's boy so he's very much connected to me spiritually.\"\nShe said her wedding was made even more special now that Bryson's photo has gone viral recently.\n\"It was literally one of the most magical days that I've experienced,\" Tearra added. \"And there’s no way I would’ve done it without them there.\"",
    "source_domain": "abcnews.go.com",
    "title": "6-year-old boy breaks down into tears watching his mother walk down the aisle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Family/year-boy-breaks-tears-watching-mother-walk-aisle/story?id=53849525"
}