{
    "authors": [
        "Abc News",
        "More Dr."
    ],
    "date_download": "2018-03-20 01:52:47+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Heart disease is America’s No. 1 killer, according to the CDC.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2Fracial-gap-heart-health-due-declining-health-white%2Fstory%3Fid%3D53860034.json",
    "image_url": "https://s.abcnews.com/images/Health/pulse-gty-er-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A new study out of UCLA has shown that health disparities between black and white Americans have decreased because overall heart health for white Americans has declined.\nResearchers looked at health records 40,876 adults -- white Americans, African-Americans, and Mexican-Americans -- and sorted them as having either “optimal,” “suboptimal” or “poor” cardiovascular health, using a standardized classification system. The study was published in Annals of Internal Medicine.\nThe researchers noted that between 1988 and 1994, the number of black Americans ages 25 to 44 in \"optimal\" health was 22 percent lower than in white Americans. For black Americans ages 65 and older, it was 8 percent lower than white Americans in the same period. Those numbers have changed -- but those in good heart health went down for both racial groups, according to the study.\nErik Isakson/Getty Images\nBetween 2011 and 2014, only 10.6 percent of white Americans and 3.8 percent of black Americans had their heart health rated “optimal.” (The findings from this study, by the way, were not connected to the patient’s overall long-term health.)\nThe conclusion: Cardiovascular health has declined in general in the U.S., and the “gap” between the heart health of different racial groups is smaller, but likely due to poorer scores for white Americans.\nThe study used a system called LS7 (“Life’s Simple 7”) to generate health categories. LS7 uses information from body mass index, blood pressure, total cholesterol, blood sugar, physical activity, diet healthfulness and smoking status, to generate an overall index of heart health.\nSTOCK/Getty Images\nThe researchers also studied each racial group over time. They noted that over almost 30 years, no more than 15 percent of black Americans or 40 percent of white Americans were ever in “optimal” cardiovascular health.\nThe group also analyzed Mexican-Americans, both those born in the United States and those born elsewhere. Regardless of where they were born, no more than 25 percent were considered to be in \"optimal\" cardiovascular health at any time. However, a smaller analysis of their data showed that foreign-born Mexican-Americans were at lower risk for obesity, high blood pressure, cholesterol and diabetes.\nDifferences between white Americans and other groups were most pronounced in high body mass index, poor levels of HbA1c (a measure that tracks blood sugar) and physical activity. There were few differences across race/ethnicity for scores on blood pressure, cholesterol, diet and smoking.\n\"The good news is that the LS7 health factors and behaviors are simple to understand and provide the opportunity for everyone -- patients, providers, payers, policymakers, and public health practitioners -- to take action,\" wrote George A. Mensah, MD, of the Center for Translation Research and Implementation Science at the National Heart, Lung, and Blood Institute in Bethesda, Maryland, in an editorial on the study.\nHeart disease is America’s No. 1 killer, according to the Centers for Disease Control and Prevention, and this study may allow doctors to further guide their patients into better heart health and overall outcomes.\nDr. John Byun is a radiation oncology resident based at the Rutgers Cancer Institute of New Jersey and a resident in the ABC News Medical Unit.",
    "source_domain": "abcnews.go.com",
    "title": "Racial gap in heart health down due to declining health of white Americans: Study",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/racial-gap-heart-health-due-declining-health-white/story?id=53860034"
}