{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:57:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Love all around: Davis Love IV makes pro debut at US Open",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Flove-davis-love-iv-makes-pro-debut-us-48043752.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_dc6ba3b939704b5bb150fa61d17a53e9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An excited Davis Love IV bolted out the car door after arriving at Erin Hills and went instinctively to pick up his bag when he was stopped by his caddie.\n\"He goes, 'Whoa, whoa, whoa. This is my job this week,'\" Love said in recounting the words of his father, PGA Tour veteran and major championship winner Davis Love III.\nIt's a role reversal for the Love family on Father's Day weekend. What a way for the younger Love to make his professional debut — at the U.S. Open, with his dear old dad on the bag.\n\"He's played 23 U.S. Opens,\" said the younger Love, who goes by \"Dru.\" ''He's seen every single possible thing you can ever see on a golf course, so that was pretty much a no-brainer for me.\"\nThe older Love won the PGA Championship in 1997 at Winged Foot. He is a two-time Ryder Cup captain who will be inducted into the World Golf Hall of Fame this fall.\nDru Love is just getting started. He just finished at Alabama and turned pro, having learned on Sunday that he qualified for his U.S. Open as an alternate from the Georgia sectional qualifier.\n\"I would say the only thing that's holding me back is my lack of experience. I went to Alabama for five years and played one healthy season of golf,\" Dru Love said. \"My dad jokes that I'm 23 years old but I'm 19 in golf.\"\nWhile the older Love has caddied previously for Dru, father and son have both said the arrangement felt a little odd during their first few days at Erin.\n\"For the first two days it felt weird having him do the things that I'm usually doing for him, you know, handing him a golf ball or cleaning a club,\" Dru Love said.\nDru Love has won tournaments with his father on the bag, though as an amateur.\n\"I've played with a bunch of 19- and 20-year-olds,\" the elder Love said this week as he watched his son tee off during a practice round with Ryder Cup captain Jim Furyk. \"But it makes me feel old that he's playing.\"\nLove III has been slowed by a bad back this year. The 53-year-old pro did not plan to try to qualify for the U.S. Open until he caddied for his son in an earlier qualifying round. Love missed out by eight shots after trying to qualify in Columbus, Ohio.\nBut the elder Love's experience will come in handy at a long course like Erin Hills, which is making its major championship debut.\n\"Patience, and routine, and staying calm, and not trying to get ahead of yourself, one shot at a time. He reminds me of that,\" Dru Love said.\nGolf is a family business. His grandfather, Davis Love Jr., was a teaching pro and played in six U.S. Opens.\nThis will be the first time that Love III will be wearing shorts at a major. So far, it has slowed him down while getting his son golf balls on the range.\n\"It takes him about 25 minutes because everyone stops and is talking to him,\" Dru Love joked. \"Saying 'Oh, it's the first time we've ever seen your legs' and this and that.\"\n———\nMore AP golf: apnews.com/tag/apf-Golf\n———\nFollow Genaro Armas at http://twitter.com/GArmasAP",
    "source_domain": "abcnews.go.com",
    "title": "Love all around: Davis Love IV makes pro debut at US Open",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/love-davis-love-iv-makes-pro-debut-us-48043752"
}