{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 16:03:35+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The 27-year-old suspect, Akayed Ullah, was badly injured in the arm and torso from the explosion that went off in his arms, sources said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fexplosive-detonates-nyc-transit-hub-attempted-terrorist-attack-51718197.json",
    "image_url": "http://a.abcnews.com/images/US/171211_vod_orig_nypd_presser_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Explosive detonates below NYC transit hub in 'attempted terrorist attack'\nApproximately seven joining the below ground walkway. Which connects the ID line at 42 women a day avenue. With VI RT line at fort two point seven. And as the shuttle at Times Square and 12 and three train. Police were called to her reported explosion responding units fell and injured 27 year old male we've identified him as I Kidd love. KK KYED. New LLK Hage he had burns and wounds to his body. We're very investigation at the scene indicates this bill was wearing an improvised. Low tech explosive device attached to his body. He intentionally detonated that device. Looks like there are three other people in the immediate area all sustained minor injuries but again I Grossman talked about that. The subject was placed in custody and transported to Bellevue hospital. Immediate police response to the scene included members of the transit bureau emergency service division bomb squad. Counterterrorism. MTA police state troopers in the FBI's joint terrorist task force. In addition the NYPD strategic prescribed group critical response demand. Resigned the key transportation hubs in other locations throughout the city has diversionary measure. Is this incident was captured on transit system video. For further review and interview witnesses under way for a background investigation into eyed kid who loved being conducted by the joint terrorist task force. We're asking anyone who may have any information about these individual currency it called a terror hotline nets 88. NYC safe. Just as the governor said as the mayor said we are New Yorkers who don't live in fear. If you see something that doesn't look right Kevin obligation to come forward call 911. Flagged down a cop gives a chance to investment.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Explosive detonates below NYC transit hub in 'attempted terrorist attack'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/explosive-detonates-nyc-transit-hub-attempted-terrorist-attack-51718197"
}