{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2017-04-18 12:15:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Cleveland Facebook murder suspect visited gun range recently: Report",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fcleveland-facebook-killer-visited-gun-range-recently-report%2Fstory%3Fid%3D46856676.json",
    "image_url": "http://a.abcnews.com/images/US/RT-Steve-Stephens-ml-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The owner of an Ohio gun range said Steve Stephens visited his facility just months before the Cleveland man allegedly posted a video of himself fatally shooting an elderly man, according to a report. Blake Frederick, owner of Sherwin Shooting Sports gun range in Eastlake, Ohio, said Stephens visited his range often, ABC affiliate WEWS in Cleveland reported.\nStephens posted a video on Facebook in 2016 showing him shooting targets at the gun range, with the caption \"rapid shots,\" according to WEWS.\nStephens, who had a concealed carry permit, is at the center of a nationwide manhunt. He is suspected of killing Robert Godwin Sr., 74, on Sunday and uploading a video of the murder to Facebook, according to police in Cleveland.\nThe Associated Press\nThe social media platform also released the following timeline of events, according to its records:\n11:09 a.m. PDT — First video, of intent to murder, uploaded. Not reported to Facebook.\n11:11 a.m. PDT — Second video, of shooting, uploaded.\n11:22 a.m. PDT — Suspect confesses to murder while using Live, is live for 5 minutes.\n11:27 a.m. PDT — Live ends, and Live video is first reported shortly after.\n12:59 p.m. PDT — Video of shooting is first reported.\n1:22 p.m. PDT — Suspect’s account disabled; all videos no longer visible to public.\nA Facebook executive on Monday said the company is reviewing some of its practices in light of the incident.\n\"It was a horrific crime — one that has no place on Facebook, and goes against our policies and everything we stand for,\" Facebook VP of Global Operations Justin Osofsky said in a blog post late Monday. \"As a result of this terrible series of events, we are reviewing our reporting flows to be sure people can report videos and other material that violates our standards as easily and quickly as possible.\"\nStephens claimed to have committed multiple homicides, according to police, but no additional victims have been found.\nFriends and family members of the victim gathered on Monday near the spot where Godwin died to remember him.\nThe Associated Press\nAngela Smalls, who said Godwin is the father of two of her children, spoke at the event and pleaded for Stephens to turn himself in.\n\"He took my kids’ father from them and you’re still breathing out here? My babies are hurting,\" a tearful Smalls told the crowd, according to WEWS. \"Let them get some peace. Just turn yourself in, please.\"\nTanya Robinson, a longtime resident of the community who also attended the event, said she felt unsafe with Stephens on the loose.\n\"Until he’s caught, we are not safe. We don’t know where he’s at,\" Robinson told WEWS Monday. Police said Stephens should be considered armed and dangerous, and a reward of up to $50,000 is being offered for information leading to his arrest.",
    "source_domain": "abcnews.go.com",
    "title": "Cleveland Facebook murder suspect visited gun range recently: Report",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/cleveland-facebook-killer-visited-gun-range-recently-report/story?id=46856676"
}