{
    "authors": [
        "Abc News",
        "More Amanda"
    ],
    "date_download": "2018-03-19 22:31:21+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "A student was found dead in Bermuda, local police said in a press conference.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fmissing-philadelphia-student-found-dead-bermuda-police%2Fstory%3Fid%3D53859049.json",
    "image_url": "https://s.abcnews.com/images/International/mark-dombroski-ap-jt-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A missing Pennsylvania student has been found dead in Bermuda, local police said in a press conference Monday.\nMark Dombroski, 19, was last seen early Sunday morning at a bar, a representative from Bermuda Police Services said.\nDombroski’s body was found “in a moat” at Fort Prospect in Devonshire, Bermuda, acting Assistant Commissioner of Police James Howard said.\n“Foul play is not ruled out right now,” Howard, said. “The forensic officers are there. They’re assessing the scene, assessing the body.”\nGoogle Maps\nHoward would not confirm who found Dombroski’s body, but did say officers were on the scene. He also said the body was found close to police headquarters but not on police property.\nDombroski was on the island to compete with Saint Joseph’s University’s rugby team in a competition, the university confirmed to ABC News.\n\"We extend our deepest sympathies to the Dombroski family along with Mark’s teammates, classmates and friends,” the university said in a statement. “Saint Joseph’s students in need of counseling or ministry have been informed of available services. The circumstances of Mark’s death are still under investigation by the [Bermuda Police Services].”\nPrior to his disappearance, Dombroski was at the Dog House, a bar on Front Street in Devonshire, Howard said.\nSJU Rugby Team\nOfficials used CCTV footage to track his movements after leaving the bar.\nWhen asked if Dombroski got into an argument at the bar and refused taxi money from friends, Superintendent Sean Field-Lament said it was too early in the investigation to comment.\nDombroski's mother, Lisa Dombroski, said at the press conference Monday that she had reviewed the security footage and it looked like her son “was not feeling well” from a shoulder injury he sustained in the rugby competition. She added that it looked like “he wanted to get going” and go back to the hotel.\nSJU Rugby Team\nOfficials said the incident is still under investigation.",
    "source_domain": "abcnews.go.com",
    "title": "Missing Philadelphia student found dead in Bermuda: Police",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/missing-philadelphia-student-found-dead-bermuda-police/story?id=53859049"
}