{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 04:31:40+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fphilippines-australian-nun-30-days-leave-country-54709527.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_1873ca6a9aae49a39ad26f6bc01e75d5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Philippines on Wednesday cancelled an Australian nun's missionary visa for engaging in political activity and gave her 30 days to leave the country, though she said she still hoped she could explain her mission and have the decision reconsidered.\nPhilippine President Rodrigo Duterte had ordered an investigation into 71-year-old Sister Patricia Fox as an \"undesirable\" foreigner.\nThe Bureau of Immigration's board of commissioners had canceled Fox's visa and ordered her to leave due to \"her involvement in partisan political activities,\" Immigration Commissioner Jaime Morente said in a statement.\n\"She (Fox) was found to have engaged in activities that are not allowed under the terms and conditions of her visa,\" Morente said.\nFox's visa \"granted her only the privilege to engage in missionary work and not in political activities,\" he added.\nFox is a coordinator of a Philippine congregation of Roman Catholic nuns called Notre Dame de Sion and has lived in the Philippines for almost 30 years.\nFox said she was surprised by the decision that she only heard of through the media.\n\"I was surprised as I had thought the process was that I would have 10 days to put in a counter affidavit to answer the charges,\" Fox said in a statement.\n\"I am very sad that the decision at present is that I leave the Philippines,\" she added.\nShe still held out hope that the authorities would change their minds.\n\"As a Christian, believing that our mission is to bring God's Kingdom to the here and now, I couldn't help but to get involved both with projects, such as training in organic farming, to uplift the livelihood of the farmers, but also to advocate with them for their rights to land, livelihood, peace, justice and security, all universal human rights which the church sees as integral to her mission,\" Fox said.\n\"It seems this is what has brought me into conflict with the Philippine government,\" Fox added. \"I am still hoping for a chance to explain how I see my mission as a religious sister and maybe the decision can be reconsidered.\"\nShe said on Monday that she was taken from her house last week and detained at the Bureau of Immigration in Manila for almost 24 hours.\n\"They ordered an investigation for disorderly conduct. I was laughing, saying I have a disorderly room, but I don't know about disorderly conduct,\" Fox told Australian Broadcasting Corp.\n\"For me, it is part of my mission as a Catholic sister to stand beside those whose human rights have been violated, who are asking for help,\" she added.\nFox had taken part in rallies demanding the release of political prisoners and urging Philippine authorities to respect human rights.",
    "source_domain": "abcnews.go.com",
    "title": "Philippines gives Australian nun 30 days to leave country",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/philippines-australian-nun-30-days-leave-country-54709527"
}