{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:15:03+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Lane Kiffin begins his second act as a head coach. Is he ready?",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Flane-kiffin-begins-act-head-coach-ready%2Fstory%3Fid%3D44514936.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r124284_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Editor's note: This story was originally published after Lane Kiffin took the Florida Atlantic head coaching job.\nTUSCALOOSA, Ala. -- Lane Kiffin knows the rap as well as he knows the holes in most of the defenses he's faced over the years.\nIt goes something like this: son of an NFL coaching legend. Born on third base with head-coaching opportunities falling at his feet before a lot of people have their student loans paid off. Maddeningly immature. Maddeningly brilliant. Not real interested in doing things the conventional way. Brimming with the kind of in-your-face confidence that can be both obnoxious and genius.\n\"I know what the narrative is out there, [but] it's not that I've tried to be that guy who stirs things up,\" Kiffin told ESPN.com earlier this year. \"I guess it just comes naturally.\"\nSo does being one of the brightest offensive minds in the game. One SEC athletic director calls Kiffin a \"football savant\" and one of those coaches who just always seems to be a step ahead any time he's calling plays or planning for an opponent.\n\"There's a reason he had all those opportunities at such a young age,\" said the athletic director, wishing to remain anonymous. \"I don't think anybody has ever questioned his X's and O's ability, his ability to recruit or his ability to coach.\n\"My question would be: Could I trust him? I could live with all the other stuff, but does he have the right character to lead a program? I think he's probably matured, but I couldn't say for sure. I would guess there are a lot of other ADs out there, guys who would like to hire him, wrestling with that same question.\"\nIt's a question that has dogged Kiffin ever since he was fired on the LAX tarmac by then-USC athletic director Pat Haden five games into the 2013 season. After all, Kiffin was the Oakland Raiders' head coach at 31, Tennessee's head coach at 33 and USC's head coach at 34. He lasted less than a combined six seasons at the three stops, though he left Tennessee after just one season to take the USC job, where he inherited severe NCAA sanctions.\nNow, after three seasons of helping Nick Saban add to his championship hardware at Alabama -- and going back to school, so to speak, under one of college football's all-time great coaches -- the shades-wearing, Bitmoji-tweeting Kiffin gets another shot at running his own shop. He's agreed to become Florida Atlantic's next head coach, sources told ESPN.com. Kiffin was also a finalist for the Houston head-coaching job, but the Cougars stayed in-house and hired offensive coordinator Major Applewhite last week.\nIt's true that schools weren't beating down Kiffin's door with head-coaching opportunities, and had it not been for the Conference USA Owls, he probably would have been shut out for a third straight year. In a lot of ways, he was stuck in head-coaching purgatory. Most football people were sure of his ability to recruit, develop players and get a team ready for games. But just as many administrators and presidents weren't so sure about his ability to wear all of the hats it takes to manage a program. Saban believes Kiffin is ready and answered \"absolutely\" when asked after Alabama's SEC championship rout of Florida if Kiffin was equipped to take that step -- again. Earlier this year, Saban echoed to ESPN.com what others had already suggested, that maybe too much came too soon for Kiffin, who's now 41.\n\"The thing you've got to remember about Lane is that his first head-coaching job came before a lot of guys get their first coordinator job,\" Saban said. \"I think back to some of the mistakes I made as a younger head coach. Experience is the greatest teacher, and sometimes we all need to be knocked down a little bit before we get it right.\"\nThe whole Kiffin-Saban pairing is still hard for many to digest. On the surface, they're about as much alike as the wishbone offense and the spread. But Saban was secure enough and wise enough to bring Kiffin in to help fine-tune the Crimson Tide's offense. And Kiffin was brazen enough to challenge Saban -- and even fight with him on occasion -- to steer the offense in a direction nobody would have dreamed of five years ago.\nAlabama is spreading teams out, using tempo (the same tempo Saban once railed against) and running the quarterback, all while still pounding people when needed and generating the kind of balance on offense all teams crave. During Kiffin's three seasons in Tuscaloosa, the Tide have won three straight SEC championships with three starting quarterbacks and three first-time starters, including true freshman Jalen Hurts this season.\n\"Lane has made them much more difficult to defend,\" Ole Miss coach Hugh Freeze said. \"They've always been able to line up and beat you because they're just better. But you watch them now, and they're doing things and you're getting looks that you never got from them in the past. You didn't have to worry about them going empty backfield and trying to get a tailback running a [pass route] on a linebacker or them trying to get their quarterback on the edge in a run-pass option.\n\"You've got a lot of worries now defensively when you face Alabama.\"\nVanderbilt coach Derek Mason was previously the defensive coordinator at Stanford and matched wits against Kiffin when he was the USC head coach. The thing Mason always admired about Kiffin was that he had all of the creativity in his repertoire but that he never got away from his core belief of running the football and being physical.\n\"I love what Lane does offensively. He was always the hardest guy for me to defend in the Pac-12 because he made you defend everything,\" Mason said. \"He can make one personnel set look like something else. He's always going to know how to use his tight ends, always going to have a dominant No. 1 at receiver and a flurry of running backs he uses in different ways.\n\"What everybody's doing in this conference now, Lane was doing six years ago. It's not new football.\"\nKiffin jokes it was worth some of the \"ass-chewings\" he absorbed from Saban to open up the Alabama offense and try some new things. To be fair, Saban was all for adapting on offense as the college game has continued to evolve, but Kiffin has a way of pushing the envelope.\nLance Barnett, the father of former Alabama quarterback Blake Barnett, said the tug-of-war between Kiffin and Saban made for some interesting theater.\n\"It was a little bit of oil and water there with Nick and Lane, but kudos to them both for making it work,\" said Barnett, whose son plans to transfer to Arizona State. \"Lane's a free-flowing kind of guy and loves to push people's buttons, and Blake said Lane was great at pushing Nick's buttons. He said it was almost comical at times, but they've been good for each other. You see Lane's influence on the offense because they're not running any of the plays Blake studied for the last year and a half. Lane has taken Jalen's strengths and built around them, and that's what good coaches do.\n\"But over and above everything else, Blake was most impressed with Lane's feel for the game. His ability to assess what was happening on the field and change the offense on the fly and create favorable matchups was phenomenal.\"\nKiffin hasn't just pushed Saban's buttons during his time in Tuscaloosa. He has a penchant for pushing everybody's buttons, to the point that many of his colleagues on the Alabama staff never expected him to make it very long with Saban.\nOne coach who worked alongside Kiffin on the Alabama staff said the offensive coordinator almost seemed to revel in being a rebel, but that was also a big part of his success.\n\"Some people couldn't stand him, but he's smart, and I mean real smart,\" the coach said. \"One of the reasons he is such a good playcaller is that he has no fear of consequences, in football and in life.\n\"Success has come very easy for him, but so has failure.\"\nKiffin is the first to admit that he probably should have asked more questions and listened more during his previous head-coaching stops.\n\"I'd been around Pete [Carroll] and saw how he did it, and that was great,\" Kiffin said. \"But coming to Alabama and being under Coach Saban gave me an even different perspective. Every head coach has his own style, things they believe in, and now I've seen it done by two of the best in the game with two completely different styles. There's no question in my mind that I'm better-equipped to be a head coach.\"\nNew LSU head coach Ed Orgeron has known Kiffin for 15 years and still remembers Carroll bringing the young coach aboard the USC staff in 2001 after meeting Kiffin when he was a graduate assistant at Colorado State.\n\"He's always been smart, very aware of everything around him, and the last thing you want to do is make him mad,\" said Orgeron, who worked with Kiffin at both USC and Tennessee. \"Lane gets devious if you screw with him. He won't let you know, but he's coming after your ass.\"\nOrgeron's plan was to bring Kiffin to LSU as offensive coordinator if Kiffin were unable to get a head coaching gig. Probably one of the worst-kept secrets in Tuscaloosa was that Kiffin, one way or the other, wasn't going to be back at Alabama after this season. As someone close to the situation said, \"There's a window in every relationship, and for both Saban and Kiffin, that window was just about closed.\"\nWhile Kiffin has been known to ruffle feathers, be it Urban Meyer's or Steve Spurrier's, he's generally been a hit among the players he's coached and the support staffs he's worked with.\nHis sense of humor is legendary (and biting) to those who know him best. He was asked during the Olympics last summer whether he saw Jamaican sprinter Usain Bolt's most recent race and what he would be able to do with Bolt's incredible speed in his offense. Kiffin cracked: \"I didn't even know the Olympics were going on. I coach football at Alabama.\"\nOne of his best stunts came during his first season at Alabama in 2014, when he made his first trip back to Knoxville, Tennessee. The Alabama team was staying at the Airport Hilton Hotel, which is just outside of Knoxville in Alcoa. Kiffin called one of his buddies still working at Tennessee and asked to be picked up out in front of the hotel later Friday night and to have a hat and sunglasses as a disguise -- they were hitting the town in Knoxville.\nKiffin's buddy at Tennessee still chuckles: \"That's Lane. He was joking. At least, I think he was joking.\"\nThere were no Kiffin sightings that night in Knoxville. He did his damage that next evening in Neyland Stadium, when Alabama beat Tennessee 34-20 and rolled up 469 yards of offense, including a school-record 224 receiving yards and two touchdowns by receiver Amari Cooper.\nThat's another calling card of Kiffin's. He has a basketball mentality as a playcaller. If somebody's hot, he's going to keep feeding that player.\n\"Coach Kiffin doesn't make it too complicated,\" Cooper said. \"He knows who he wants to get the ball to and how he wants to get the ball to them. As a player, you love that. You know if you're delivering, he's going to keep coming back to you, and it's going to be a little different every time.\"\nOne former assistant coach said Kiffin was at his best with the players.\n\"He has an uncanny ability to lead players and to game plan and draw up X's and O's in a way that they get it. He does not lead adults very well,\" the coach said.\nHis turbulent 14-month stay at Tennessee is proof. Kiffin did a fabulous job of revitalizing quarterback Jonathan Crompton, who went from a liability to being taken in the fifth round of the NFL draft. The Vols also played well on the field and nearly upset Alabama that season.\nBut as a manager of the program, Kiffin created his share of unwanted drama, whether it was flippantly racking up NCAA secondary violations, incorrectly accusing Meyer of breaking NCAA rules or being accused, himself, of telling receiver Alshon Jeffery during the recruiting process that Jeffery would end up pumping gas for a living if he went to South Carolina. Kiffin later denied saying that to Jeffery. Even rapper Lil Wayne dropped Kiffin's name in one of his songs with the infamous, \"Smoke weed. Talk s--- like Lane Kiffin.\"\nKiffin's response at the time to being referenced in a rap song was classic.\n\"It's nice to see we're getting a little street cred,\" he joked.\nThat mischievous side of Kiffin hasn't completely gone away in Tuscaloosa. Who can forget Kiffin tweeting a picture of his son, Knox, doing Cam Newton's signature dab after Alabama beat Auburn last season at Jordan-Hare Stadium with Newton in the house?\n\"It's that kind of stuff that drives [Saban] crazy, but it's also part of the give-and-take with Lane,\" one former Alabama staff member said. \"He's always doing or saying something like that. It's almost like he can't help himself. But then you get in the games, and he's a big reason you're winning.\"\nMultiple athletic directors told ESPN.com for this story that Kiffin would probably be better off in a bigger city where he blended in, as opposed to being in a smaller college town where his every move was recorded and scrutinized.\n\"It may just be because Nick has put the clamps on him, but I don't think he's seen as the brash, immature guy that he once was,\" one athletic director told ESPN.com. \"He just has to be smart. He really probably needs to go somewhere other than the SEC, at least this next job. He probably needs to be somewhere that doesn't care quite as much about football and the personalities that go along with it.\n\"There are markets where you can find that and markets where I think he would go in and clean up.\"\nWe'll find out soon enough whether the fourth time is indeed a head-coaching charm for Kiffin, who's just ready for another opportunity.\n\"I'm probably guilty of getting in my own way too many times, making it harder on myself,\" Kiffin said earlier this year. \"I can't change what's behind me but look forward to what's ahead.\"\nAnd, yes, he's ready to do it his way again, but his way in a refined sense. Consider it life after 40 because life before 40 -- at least as a head coach -- left us all hanging.",
    "source_domain": "abcnews.go.com",
    "title": "Lane Kiffin begins his second act as a head coach. Is he ready?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/lane-kiffin-begins-act-head-coach-ready/story?id=44514936"
}