{
    "authors": [
        "Abc News",
        "More Benjamin"
    ],
    "date_download": "2017-08-14 19:46:48+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Trump says he's seriously considering pardoning former Sheriff Joe Arpaio",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-pardoning-sheriff-joe-arpaio%2Fstory%3Fid%3D49210963.json",
    "image_url": "http://a.abcnews.com/images/Politics/joe-arpaio-donald-trump-01-ap-jc-170801_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump may soon issue a pardon for former Sheriff Joe Arpaio.\n“I am seriously considering a pardon for Sheriff Arpaio,” Trump said Sunday in an interview with Fox News from his Trump National Golf Club in Bedminster, New Jersey, where he is on a working vacation.\nTrump told Fox News he could issue the pardon - his first as president - in the next few days, if he decides to do so.\nArpaio, the former sheriff of Arizona’s Maricopa County and a vocal Trump supporter during the 2016 presidential campaign, spoke at the Republican National Convention in Cleveland last summer on Trump’s behalf.\nEarlier this month he was found guilty of criminal contempt for ignoring a court order to stop detaining suspected illegal immigrants. He faces up to six months in prison.\nHe recently told The Associated Press he wasn’t seeking a pardon from Trump.\n\"I was with him since day one, and I am with him until the end. I don't ask him for anything. He can throw me into the swamp and cover me up in garbage, and I'd still support him,\" Arpaio said in an interview.\nArpaio has been a lightning rod in the national immigration debate for decades and has been praised by immigration hawks for his crackdown on illegal immigration. Activists, however, have criticized Arpaio for conditions in the open-air jail he managed outside of Phoenix known as Tent City.\nShould Trump decide to pardon Arpaio in the near future, he'd be exercising his presidential power earlier than his two most recent predecessors. President George W. Bush didn't issue a pardon until December 2002, and President Barack Obama granted his first pardons in December 2010.",
    "source_domain": "abcnews.go.com",
    "title": "Trump says he's seriously considering pardoning former Sheriff Joe Arpaio",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-pardoning-sheriff-joe-arpaio/story?id=49210963"
}