{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 13:43:16+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Al-Qaida-linked fighters launch new attack in central Syria",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmonitors-15-killed-missile-strike-eastern-syria-city-50319469.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_83f8962040a54362bd74ee42ed667530_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Al-Qaida-linked fighters on Friday attacked a key central Syrian village at the crossroads between areas under government control and those controlled by insurgent groups, opposition activists said.\nIn eastern Syria, meanwhile, 15 civilians, including children, were killed when a missile slammed into a government-held neighborhood in the city of Deir el-Zour on Thursday evening.\nThe attack on the village of Abu Dali in central Hama province was led by al-Qaida-linked Hay'at Tahrir al Sham — Arabic for Levant Liberation Committee and also known as HTS. It came two weeks after insurgents attacked a nearby area where three Russian soldiers were wounded.\nEarlier this week, Russia's military claimed the leader of the al-Qaida-linked group was wounded in a Russian airstrike and had fallen into a coma. The military offered no evidence on the purported condition of Abu Mohammed al-Golani.\nThe al-Qaida-linked group subsequently denied al-Golani was hurt, insisting he is in excellent health and going about his duties as usual.\nAl-Qaida-linked fighters have been gaining more influence in the northwestern province of Idlib and northern parts of Hama province where they have launched attacks on rival militant groups, as well as areas controlled by the government.\nThe village of Abu Dali had been spared much of the violence and had functioned as a local business hub between rebel-run areas and those under President Bashar Assad's forces.\nThe Britain-based Syrian Observatory for Human Rights said al-Qaida fighters captured several village tribesmen following the attack in the early hours of Friday. The HTS-linked Ibaa news agency did not mention the attack but said Russian warplanes were bombing areas the group controls in northern Syria.\nViolence in eastern Syria has escalated significantly in recent weeks as Syrian troops with the help of Russian air cover are closing in on Mayadeen, a new Islamic State group stronghold after IS came under attacks in the cities of Raqqa and Deir el-Zour.\nThe government-controlled Syrian Central Military Media said troops are marching south from Deir el-Zour toward Mayadeen under the cover of airstrikes.\nThe DeirEzzor 24 monitoring group said the missile in the airstrike on Thursday evening that killed 15 had hit near a school in the Qusour neighborhood. Three children and three women were among those killed, the group said Friday, blaming IS for the attack. The school and a nearby residential building were destroyed.\nThe Observatory also reported the incident, putting the number of civilians killed at 13. Both the Observatory and DeirEzzor 24 also reported that an airstrike hit the village of Mehkan, just south of Mayadeen, and said it killed several families.\nSyrian troops have broken a nearly three-year siege on parts of Deir el-Zour last month and are fighting to liberate from IS remaining parts of the city.\nIn Russia, the military said one of its helicopters had made an emergency landing in Syria, but its crew was unhurt.\nAccording to the Defense Ministry, the Mi-28 helicopter gunship landed in Hama province on Friday due to a technical malfunction. The two crewmen were not injured and were flown back to base. The ministry said the helicopter was not fired upon.\nThe ministry's statement followed a claim by IS-linked Aamaq news agency, which said that a Russian helicopter was downed south of Shiekh Hilal village in Hama.\nAlso on Friday, the Russian military accused the United States of turning a blind eye and effectively providing cover to the Islamic State group's operations in an area in Syria that is under U.S. control.\nThe Defense Ministry's spokesman, Maj. Gen. Igor Konashenkov, said IS militants have used the area around the town of Tanf near Syria's border with Jordan — where U.S. military instructors are also stationed — to launch attacks against the Syrian army.\nThe area has become a \"black hole,\" posing a threat to Syrian army's offensive against the IS in eastern Der el-Zour province, he added.\nThe Russian accusations likely reflect rising tensions as U.S.-backed Syrian forces and the Russian-backed Syrian army — both of which are battling IS — race for control of oil and gas-rich areas of eastern Syria.\n———\nAssociated Press writer Vladimir Isachenkov in Moscow contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Al-Qaida-linked fighters launch new attack in central Syria",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/monitors-15-killed-missile-strike-eastern-syria-city-50319469"
}