{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 14:07:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Hundreds of Palestinians held by Israel launch hunger strike",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fhundreds-palestinians-held-israel-launch-hunger-strike-46838785.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_13737f89e6e5483dbe875635127242d8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hundreds of Palestinians in Israeli prisons launched a hunger strike Monday, in what their leader behind bars called a new step in the Palestinians' \"long walk to freedom.\"\nActivists said more than 1,500 of about 6,500 Palestinians held by Israel as so-called security prisoners joined the open-ended protest and that it was the largest such strike in five years. The hunger strikers' immediate demands included better conditions, including more contact with relatives, and an end to Israel's practice of detentions without trial.\nIn the West Bank and Gaza, thousands staged solidarity marches Monday to mark Prisoners' Day in the Palestinian areas.\nThe hunger strike was led by Marwan Barghouti, a prominent figure in Palestinian President Mahmoud Abbas' Fatah movement. Over the years, polls have indicated that Barghouti is the most popular choice among Palestinians to succeed the 82-year-old Abbas who has failed to groom a political heir.\nBarghouti was arrested in 2002 during the violent Palestinian uprising and convicted on multiple counts of murder. Israel charged him with directing suicide bombings against its citizens and he was sentenced to five life terms.\nBarghouti is one of the best-known among thousands of Palestinians jailed for charges ranging from stone-throwing and membership in groups outlawed by Israel, to attacks that wounded or killed Israelis.\nIn an op-ed published in The New York Times, Barghouti wrote that Israeli prisons have become the \"cradle of a lasting movement for Palestinian self-determination.\"\n\"This new hunger strike will demonstrate once more that the prisoners' movement is the compass that guides our struggle, the struggle for Freedom and Dignity, the name we have chosen for this new step in our long walk to freedom,\" he wrote.\nIn what appeared to be a punitive measure, Israel's prison service said Barghouti had been transferred to a different prison.\nIsrael media reported that Barghouti had violated the conditions of his incarceration by communicating with the newspaper and that he had likely smuggled the text out through his lawyer.\nPrison Service spokesman Assaf Librati refused to elaborate on Barghouti's role.\n\"The strike is a decision of the prisoners. We are containing the situation and monitoring its developments,\" he said.\nThe hunger strike was launched as the approaching half-century mark of Israeli rule over Palestinians appeared to generate renewed interest in the long-running conflict, which in recent years was often overshadowed by war and turmoil elsewhere in the region.\nIsrael captured the West Bank, Gaza Strip and east Jerusalem in the June 1967 Mideast war.\nAbbas and his supporters seek a Palestinian state, roughly in the pre-1967 lines. The Islamic militant group Hamas, which seized Gaza from Abbas in 2007, has called for an Islamic state in historic Palestine, including in what is now Israel. Hamas recently suggested it would support a smaller Palestine state, without specifying if this would be a stepping stone to Israel's destruction.\nIn Gaza City, about 2,000 people turned out for a march, raising flags of different Palestinian factions.\nMilitants from Hamas surrounded cages on truck flatbeds depicting cells. One cage held two Palestinians in Israeli prison uniform. The other cage bore the pictures of two Israeli soldiers killed in the 2014 war between Israel and Hamas, and the pictures of two Israeli civilians who disappeared after entering Gaza. Hamas is believed to hold the two civilians and the remains of the soldiers.\n\"Your soldiers will not see the light unless the price is paid,\" read a banner on the truck.\nIsmail Radwan, a Hamas official who participated in the march, reiterated Hamas' demand for a prisoner swap with Israel. In 2011, Israel swapped more than 1,000 Palestinian prisoners for an Israeli soldier who had been held by Hamas for five years.\nIn the West Bank town of Ramallah, Barghouti's wife, Fadwa, joined about 1,500 marchers.\n\"This massive strike sends a strong message to the Israelis, after 50 years of occupation, suppression and oppression, that the prisoners ... will lead their people from behind bars,\" she said.\nQadoura Fares, who runs the Prisoners' Club advocacy group, said over 1,500 prisoners joined the strike and that more were expected to follow.\nIn 2012, hundreds participated in a large-scale strike that lasted 28 days, said Fares. In 2014, dozens of detainees who were being held without trial or charges staged a two-month-long hunger strike to demand their release.\n———\nAssociated Press writers Fares Akram in Gaza City, Gaza Strip, and Karin Laub in Amman, Jordan, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Hundreds of Palestinians held by Israel launch hunger strike",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/hundreds-palestinians-held-israel-launch-hunger-strike-46838785"
}