{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 16:20:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Arctic voyage finds global warming impact on ice, animals",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Farctic-voyage-finds-global-warming-impact-ice-animals-49199786.json",
    "image_url": "http://abcnews.go.com/International/wireStory/arctic-voyage-finds-global-warming-impact-ice-animals-49199786",
    "language": "en",
    "localpath": null,
    "maintext": "The email arrived in mid-June, seeking to explode any notion that global warming might turn our Arctic expedition into a summer cruise.\n\"The most important piece of clothing to pack is good, sturdy and warm boots. There is going to be snow and ice on the deck of the icebreaker,\" it read.\nThe Associated Press was joining international researchers on a month-long, 10,000 kilometer (6,200-mile) journey to document the impact of climate change on the forbidding ice and frigid waters of the Far North. But once the ship entered the fabled Northwest Passage between the Atlantic and the Pacific, there would be nowhere to stop for supplies and no help for hundreds of miles. So in went the boots: Global warming or not, it was best to come prepared.\nIf parts of the planet are becoming like a furnace because of global warming, then the Arctic is best described as the world's air-conditioning unit. The frozen north plays a crucial role in cooling the rest of the planet while reflecting some of the sun's heat back into space.\nBut it, too, is beginning to overheat. Last year was the hottest on record in the Arctic. And for several decades, satellite pictures have shown a dramatic decline in Arctic sea ice that is already affecting the lives of humans and animals in the region, from Inuit communities to polar bears.\nScientists say sea ice will largely vanish from the Arctic during the summer within the coming decades. Experts predict that the impact of the melting ice will be felt across the northern hemisphere as far as Florida or France.\n\"Things are changing in the Arctic, and that is changing things everywhere else,\" said David 'Duke' Snider, the seasoned mariner responsible for navigating the Finnish icebreaker MSV Nordica.\nResearchers on the trip sought a first-hand view of the effects of global warming already seen from space. The ship departed Vancouver in early July and arrived in Nuuk, Greenland on July 29th, the earliest transit ever of a region that isn't usually navigable until later in the year because of ice.\nTwelve days after the ship had left Vancouver, the ice appeared out of nowhere.\nAt first, lone floes bobbed on the waves like mangled lumps of Styrofoam. By the time Nordica reached Point Barrow, on Alaska's northernmost tip, the sea was swarming with ice.\nSnider recalled that when he started guiding ships through Arctic waters more than 30 years ago, the ice pack in mid-July would have stretched 50 miles farther southwest. Back then, a ship also would have encountered much thicker, blueish ice that had survived several summer melts, becoming hard as concrete in the process, he said. He likened this year's ice to a sea of porridge with a few hard chunks.\nThe outdoor thermometer indicated a temperature of 47 degrees Fahrenheit (8.3 Celsius), but in the never-setting sun of an Arctic summer it felt more like 60 F. Days blurred into nights. Even in their bunks, those on board heard the constant churning of ice as the ship plowed through the debris rolling beneath the hull, thundering like hail on a tin roof.\nAs the icebreaker entered Victoria Strait, deep inside the Northwest Passage, we looked for a shadow moving in the distance or a flash of pale yellow in the expanse of white that would signal the presence of the world's largest land predator.\nAt last, a cry went out: \"Nanuq, nanuq!\"\nMaatiusi Manning, an Inuit sailor, had spotted what everyone on board was hoping to see — the first polar bear.\nThe 1,000-pound predators are at the top of a food chain that's being pummeled by global warming because of the immediate impact vanishing sea ice has on a range of animals and plants that depend on it.\n\"If we continue losing ice, we're going to lose species with it,\" said Paula von Weller, a field biologist who was on the trip.\nNo Arctic creature has become more associated with climate change than the polar bear, the poster child of Arctic wildlife. The U.S. Fish and Wildlife Service estimated in January that about 26,000 specimens remain in the wild, and warned that melting sea ice is robbing the bear of its natural hunting ground for seals and other prey.\nWhile some polar bears are expected to follow the retreating ice northward, others will head south, where they will come into greater contact with humans — encounters that are unlikely to end well for the bears.\nSome of the animals highly associated with the ice are not going to be able to adapt in a reasonable amount of time to keep up with climate change, Weller said.\n\"The walrus, for example, may spend more time on the mainland. They're very prone to disturbance so that's not a good place for walrus to be,\" said von Weller.\nResearch published four years ago rang alarms bells about the future of the red king crab — a big earner for Alaska's fishing industry — because rising levels of carbon dioxide, a driver of global warming, are making oceans more acidic. Algae that cling to the underside of sea ice are also losing their habitat. If they vanish, copepods, a type of zooplankton that eats algae, will lose their source of food, and the tiny crustaceans in turn are prey for fish, whales and birds.\nMeanwhile, as waters warm, orca are traveling further north in search of food. Some wildlife experts predict they will become the main seal predator in the coming decades, replacing polar bears.\nHumans are also increasingly venturing into the Arctic in search of untapped deposits of minerals and fossil fuels, and the potential for oil spills is a major cause for concern among environmentalists. The Inuit people in the Clyde River community of Baffin Island also fear that the loud underwater noise caused by seismic blasts of oil companies could disorient marine mammals such as whales and affect the reproductive cycles of fish and shrimp stocks.\nHowever, some say the absence of sea ice for longer periods each summer is not all bad: Boats can supply villages and mines for longer periods of the year.\nNordica reached Nuuk, the capital of Greenland, after 24 days.\nAnd in the end, we did get a taste of the warming Arctic: Those heavy, fur-lined boots never got used.\n———\nFollow Frank Jordans on Twitter at http://www.twitter.com/wirereporter\n———\nLearn more about the Arctic and read dispatches sent by a team of AP journalists as they traveled through the Arctic Circle's fabled Northwest Passage last month: https://www.apnews.com/tag/NewArctic .",
    "source_domain": "abcnews.go.com",
    "title": "Arctic voyage finds global warming impact on ice, animals",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/arctic-voyage-finds-global-warming-impact-ice-animals-49199786"
}