{
    "authors": [
        "Abc News",
        "More Blair"
    ],
    "date_download": "2017-04-17 18:12:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "A soccer field in New Zealand turned into a playground for spiders on Sunday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fcreepy-cobweb-coats-zealand-soccer-field%2Fstory%3Fid%3D46846541.json",
    "image_url": "http://a.abcnews.com/images/International/170417_abc_social_cobwebs_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's something that might give those with arachnophobia the heebie-jeebies.\nA soccer field in New Zealand turned into a playground for spiders on Sunday.\nA massive spider web spanned more than 32 yards in the suburb of Papamoa.\nThe field was flooded during Cyclone Cook last week, which may explain the increased spider presence.\n“There was a bright glistening coming from the top of the mound [and] it looked almost like the hill was sparkling, but we were unsure why,\" Tauranga resident Tracey Maris told Storyful. “So my 10-year-old daughter and I raced up to look and were shocked to learn it was all spider web. Kind of yuck, but really beautiful at the same time. I was amazed being up on top of the mound seeing how far it stretched for.\"\nMaris said she thought she saw bugs trapped in the web until she realized it was just tons of tiny spiders.\n\"I screamed pretty loudly at my discovery,\" Maris continued to tell Storyful. \"My stepson stood inside it and then had spiders crawling over him. The web was really sticky and clung to all of us.\"\nMaris said the web was mostly gone Monday morning.\nCanterbury Museum spider expert Cor Vink told the New Zealand Herald spiders often create huge cobwebs after flooding as they seek higher ground.\nA similar phenomenon was observed in Northland in 2014 and in Tasmania in 2016.",
    "source_domain": "abcnews.go.com",
    "title": "Creepy cobweb coats New Zealand soccer field",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/creepy-cobweb-coats-zealand-soccer-field/story?id=46846541"
}