{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 08:45:46+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "UN court lays down Costa Rica, Nicaragua maritime borders",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fcourt-nicaragua-pay-costa-rica-environmental-costs-52788785.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_7a43b4ce96ac4bf0ad9ed72940c765be_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The International Court of Justice laid down definitive maritime boundaries Friday between Costa Rica and Nicaragua in the Caribbean Sea and Pacific Ocean and a small land boundary in a remote, disputed wetland.\nAs part of the complex ruling, the United Nations' highest judicial organ ruled that a Nicaraguan military base on part of the disputed coastline close to the mouth of the San Juan River is on Costa Rican territory and must be removed.\nRuling in two cases filed by Costa Rica, the 16-judge U.N. panel took into account the two countries' coastlines and some islands in drawing what it called \"equitable\" maritime borders that carved up the continental shelf underneath the Caribbean and Pacific.\nSuch rulings can affect issues including fishing rights and exploration for resources like oil.\nEarlier, the court ordered Nicaragua to compensate Costa Rica for damage Nicaragua caused with unlawful construction work near the mouth of the San Juan River, the court's first foray into assessing costs for environmental damage.\nThe order by the United Nations' principal judicial organ followed a December 2015 ruling that Nicaragua violated Costa Rica's sovereignty by establishing a military camp and digging channels near the river, part of a long-running border dispute in the remote region on the shores of the Caribbean Sea.\nIn total, Nicaragua was ordered to pay just over $378,890 for environmental damage and other costs incurred by Costa Rica— a small fraction of the $6.7 million sought by San Jose.\nThat \"represents a great defeat for Costa Rica and its ambitions, and a vindication of Nicaragua's position,\" President Daniel Ortega's government said in a statement.\nNicaraguan vice president, government spokeswoman and first lady Rosario Murillo said the findings \"leave us with ample natural patrimony both in the Caribbean and in the Pacific.\"\nCosta Rican Foreign Minister Manuel Gonzalez said the court did not take into account environmental recovery projected over 50 years in areas where trees more than two centuries old were logged, but added that his country would abide by the ruling.\n\"This should be one of the last chapters of that painful page of our bilateral history,\" Gonzalez said in a statement.\nDecisions by the court based in The Hague, Netherlands, are final and legally binding.\n———\nAssociated Press writers Javier Cordoba in San Jose, Costa Rica, and Luis Manuel Galeano in Managua, Nicaragua, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "UN court lays down Costa Rica, Nicaragua maritime borders",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/court-nicaragua-pay-costa-rica-environmental-costs-52788785"
}