{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 23:00:56+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The video shows a Wildwood police officer wrestling a woman to the ground.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fjersey-police-release-bodycam-video-showing-violent-arrest-55545286.json",
    "image_url": "https://s.abcnews.com/images/US/180530_wabc_new_jersey_beach_bodycam_arrest_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for New Jersey police release bodycam video showing violent arrest\nWe have just obtained the police. Body cam video from the violent arrest of a woman who was at the beach in wildwood last weekend. Is this blockbuster video or is it is more confusing I was his board Jim Dolan in the newsroom with a brand new video chip. At a police just released this body cam video from that incident over the weekend on Saturday from wildwood New Jersey where are twenty year old woman. Who was forcibly arrested when the video starts here. They have decided tour after the police have decided to rest are for an open container you see she's not cooperating there in this new video you do not see either horror. But second the police officers which is what they claim nor do you see down punching her which bars sol cam video. Shows later. But you see the violent arrest of a twenty year old woman she's the police that she just wants to wait until her aunt arrives at the beach that the odd is on the way. They decide to arrest her anyway it is a violent incident on the beach that many people saw people who were on the beach lovely day on Saturday in wildwood New Jersey. You see is air she is now. In custody she was not cooperating early on in that video. Odd but again if they were tried to arrest her for what they claim is an open container she says she was not. But drinking she was with several friends there that is the body cavity others more that was released we're gonna go through that video. And Dodd showed to you at 6 o'clock with up a little more perspective but that is new video just released. A few moments and all of a violent arrest on the beach in wildwood New Jersey over the weekend a three officers involved have been reassigned at least. Temporarily.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "New Jersey police release bodycam video showing violent arrest",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/video/jersey-police-release-bodycam-video-showing-violent-arrest-55545286"
}