{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:26:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "USGA adds video stations, chief referee to speed up Open rulings",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fusga-adds-video-stations-chief-referee-speed-open%2Fstory%3Fid%3D48043941.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0614/dm_170614_mlb_judge_trout_for_mvp/dm_170614_mlb_judge_trout_for_mvp_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "ERIN, Wis. - The United States Golf Association has taken several steps to avoid the rules controversy that marred last year's U.S. Open at Oakmont won by Dustin Johnson, including setting up four on-course video locations to assist in speeding up rulings.\nAlso, for the first time, the U.S. Open that begins Thursday at Erin Hills will have a chief referee, Thomas Pagel, who is \"empowered to make instantaneous decisions,'' according to John Bodenhamer, the USGA's managing director of rules, competitions and equipment standards.\nPagel is part of a five-person rules committee and is the USGA's senior director of rules and amateur status.\n\"Through our work over the last 12 months, we have learned a great deal,'' Bodenhamer said. \"And our focus over those months has primarily been three things. First, to expedite our ruling process in ensure that we're more timely in our rulings. To be decisive in our decision making. And to more effectively community communicate to the players and all of you.\"\n?The enhanced use of technology entails four video review locations along with various rules officials having the use of tablets, helping rules officials move more quickly to make decisions.\nThe USGA has also transitioned to a stationary referee model instead of assigning walking referees to each group. There will be two referees stationed at each of the non-par 3 holes.\nThe USGA's Mike Davis also addressed criticism that came from players Rory McIlroy and Jordan Spieth in response to officials cutting back the fescue rough on several holes.\nMcIlroy, especially, was surprised that the USGA would do that, given the unusually wide fairways at Erin Hills.\n\"We make a decision to modify a golf course, whether it's green speeds, rough, directions we're mowing, how much water we're applying or not applying .. . it's not as if we don't listen to feedback from players,'' said Davis, the executive director of the USGA. \"But I will tell you in this case, it had absolutely zero to do with what the players were saying. We looked at some spots and we said this is simply not going to play properly.''",
    "source_domain": "abcnews.go.com",
    "title": "USGA adds video stations, chief referee to speed up Open rulings",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/usga-adds-video-stations-chief-referee-speed-open/story?id=48043941"
}