{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:10:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Russia's Putin makes stop at Russian military base in Syria",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frussias-putin-stops-russian-military-base-syria-51713149.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_5995c57ecb324852a13a19e536b21629_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Declaring a victory in Syria, Russian President Vladimir Putin on Monday visited a Russian military air base in the country and announced a partial pullout of Russian forces from the Mideast nation.\nPutin's surprise visit marked his first trip to Syria, drawing a symbolic line under the campaign that has shored up President Bashar Assad's government. It was also the first visit by a foreign head of state to war-ravaged Syria since its bloodletting started nearly seven years ago.\nPutin's brief stop at the Hemeimeem air base in Syria's coastal province of Latakia while on route to Egypt came days after the Russian president declared his bid to run for re-election in the March 18 vote, helping encourage the feelings of pride about Russia's revived global clout and prestige.\nIt also followed the Russian announcement last week that the Syrian army, with the help of Russian airstrikes, routed the Islamic State group in eastern Syria and fully restored control over the country's border with Iraq.\nIn a televised speech to the Russian troops at the base, the Russian leader hailed their \"excellent\" performance in Syria.\n\"You have shown the best qualities of a Russian soldier — courage, valor, team spirit, decisiveness and excellent skills,\" said. \"The Motherland is proud of you.\"\nRussia launched its air campaign in Syria at the end of September 2015, when Assad's government was teetering on the brink of collapse, and quickly changed the course of the conflict in his favor. Russian officials say troops in Syria were there mainly to fight \"terrorists\" including militants of the Islamic State group and al-Qaida affiliates, but they also heavily targeted other rebel factions opposed to Assad, allowing his troops to claw back significant territory over the past two years.\nPutin has hosted Assad twice in the past six years, including a surprise Nov. 21 visit that Assad undertook to the Black Sea resort of Sochi.\nRussian television stations showed Putin walking off the plane at the air base, embracing and shaking hands with Assad. The two then visited a military operations room at the base.\nThe Hemeimeem base, located in a region that is the heartland of Assad's Alawite minority, has served as the main foothold for the Russian military campaign in Syria.\n\"Here in Syria, far away from our borders, you helped the Syrian people to preserve their state and fend off attacks by terrorists,\" Putin said, facing the troops lined up on the tarmac. \"You have dealt a devastating blow to those who blatantly threatened our country. We will never forget about the victims who fell in the fight against terror both here and in Russia.\"\nIn his speech, Putin also said that he had ordered the military to withdraw a \"significant part\" of the Russian contingent in Syria.\n\"Friends, the Motherland is waiting for you,\" Putin said. \"You are coming back home with victory!\"\nHe added that \"if the terrorists again raise their heads, we will deal such blows to them they have never seen.\"\nPutin, however, said the Russian military will maintain its presence at Hemeimeem and the naval facility in Tartus.\nGen. Sergei Surovikin, the Russian military commander in Syria, reported to Putin that the military will pull out 23 warplanes, two helicopter gunships, special forces units, military police and field engineers.\nSurovikin said that the remaining forces will be sufficient to \"successfully fulfill the tasks\" to stabilize the situation in Syria. He wouldn't say how many troops and weapons would stay behind.\nSyria has allowed Russia to use Hemeimeem air base indefinitely without cost. Moscow also has signed a deal with Syria to use the Tartus base for 49 years, which could be extended if both parties agree.\nThe Russian military plans to modernize the air base and expand its runways to allow it to host more warplanes. It also intends to expand the Tartus facility significantly to make it a full-scale naval base capable of hosting warships, including cruiser-sized vessels.\nAfter seeing troops march to the tunes of military marches, Putin drove up to the Russian warplanes parked on the runway and talked to the pilots, who said they will flew back home later in the day.\nSyrian TV said Assad thanked Putin for his troops' \"effective contribution\" to the fight against terrorism in Syria, which he said the Syrian people \"will never forget.\"\n\"Syria has been saved as a sovereign, independent state, refugees are coming home and conditions have been created for a political settlement under the United Nations' auspices,\" Putin said.\n———\nAssociated Press writer Albert Aji in Damascus, Syria, contributed reporting.",
    "source_domain": "abcnews.go.com",
    "title": "Russia's Putin makes stop at Russian military base in Syria",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/russias-putin-stops-russian-military-base-syria-51713149"
}