{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 08:15:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "California aims to quash immigration detention growth",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcalifornia-aims-quash-immigration-detention-growth-48047859.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_6fda6984bf3d4800a666a7886e434d6b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "California is aiming to quash the growth of immigration detention in the state under a proposed budget measure to push back against the Trump administration's plans to boost deportations.\nThe state's $125 billion budget — which is set to be approved Thursday — has a related measure to prevent local governments from signing contracts with federal authorities for immigration detention facilities or expanding existing contracts. It would also have the state attorney general review conditions at immigration detention facilities in California.\n\"I think we send a very clear message in this budget that California is going in the opposite direction of Trump's administration,\" said Sen. Ricardo Lara, a Democrat.\nThe budget was negotiated by Gov. Jerry Brown and Democratic legislative leaders. A message was left for the state Senate's Republican caucus.\nImmigration and Customs Enforcement declined to comment on pending legislation.\nThe proposal is the latest in a series of moves by California lawmakers aimed at protecting immigrants in the country illegally from President Donald Trump's efforts to ramp up immigration enforcement.\nState lawmakers are also weighing proposals to provide lawyers for immigrants in deportation proceedings and limit communication between local police and federal immigration agents.\nThomas Homan, ICE's acting director, told U.S. lawmakers earlier this week that more detention space is needed to carry out additional deportations. The Trump administration expects next year to house about 51,000 immigrant detainees on a given day, up from nearly 40,000, he said.\nCurrently, there are nine immigration detention facilities in California. All but one — the Otay Mesa Detention Center near the U.S.-Mexico border — contract through local government agencies to house about 3,800 people, according to ICE.\nMany detainees in California are legally required to be held while their cases churn through immigration court, said Virginia Kice, an ICE spokeswoman.\nImmigration authorities are not required to house detainees where they live and have been known to transfer immigrants across state lines when bed space is tight.\nIn recent years, immigrant advocates raised concerns about conditions in detention facilities, including one in Orange County where an internal government watchdog cited reports of spoiled food and moldy showers.\nWhile California is looking to push back against immigration detention, some debt-strapped counties in Texas are hoping to refill empty jails with immigrant detainees.\nImmigrant advocates in California said they hoped the measure might inspire other states to follow suit.\n\"While California can't end immigration detention on its own, California can lead,\" said Christina Fialho, executive director of Community Initiatives for Visiting Immigrants in Confinement.\n———\nAssociated Press writer Jonathan J. Cooper in Sacramento contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "California aims to quash immigration detention growth",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/california-aims-quash-immigration-detention-growth-48047859"
}