{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 21:46:06+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Broncos request interview with Kyle Shanahan, son of former Denver coach",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fbroncos-request-interview-kyle-shanahan-son-denver-coach%2Fstory%3Fid%3D44515237.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0102/dm_170102_ncf_matich_saban_kiffin/dm_170102_ncf_matich_saban_kiffin_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "ENGLEWOOD, Colo. -- The Denver Broncos opened their coaching search just moments after a tearful goodbye from Gary Kubiak as the organization formally requested permission to interview Atlanta Falcons offensive coordinator Kyle Shanahan.\nShanahan, whose father, Mike, won back-to-back Super Bowls in 1997 and 1998 during a 14-year tenure as Broncos coach, currently calls plays for the NFL's highest-scoring offense. The Falcons, who open the postseason Jan. 14 after a bye, have scored 33.8 points per game this season and are the only team in the league to average more than 30 points per game.\nThe 37-year-old also fits the profile of what John Elway, Broncos executive vice president of football operations and general manager, has said he is looking for in a Kubiak replacement.\nAsked to describe a candidate who might fit the job and the expectations that come with it, Elway said: \"There's a lot of young guys out there who look like they have a lot of potential, very bright young guys. Hopefully we can get one of those.''\nBy league rule, because the Falcons earned a playoff bye, the Broncos and other teams could interview Shanahan in Atlanta this week.\nThe Broncos are also expected to look at Miami Dolphins defensive coordinator Vance Joseph, Buffalo Bills interim coach Anthony Lynn, Seattle Seahawks offensive coordinator Darrell Bevell and Detroit Lions defensive coordinator Teryl Austin.\nJoseph interviewed for the Broncos' head-coaching job in 2015, and team officials were so intrigued by his potential that they tried to bring him in as the defensive coordinator after Kubiak was hired. At the time, the Cincinnati Bengals wouldn't grant permission for Joseph to leave.\nAustin was also scheduled to interview with the Broncos that year, but he took his name out of consideration after Kubiak was interviewed. Lynn is a former Broncos assistant coach and player.\n\"There are some quality candidates out there,'' Elway said Monday. \"... It's obviously a position we want to fill as quickly as we can, but we also want to go through the process, the detailed process. ... We'd like to get it done, but we'd also like to get the right guy.''\nBroncos defensive coordinator Wade Phillips is among the team's assistant coaches whose contracts are up. Elway said the new head coach would be allowed to choose which coaches would be retained but added, \"Hopefully he'll retain a lot of them.''",
    "source_domain": "abcnews.go.com",
    "title": "Broncos request interview with Kyle Shanahan, son of former Denver coach",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/broncos-request-interview-kyle-shanahan-son-denver-coach/story?id=44515237"
}