{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:36:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fdolphins-cheerleader-alleges-religion-gender-discrimination%2Fstory%3Fid%3D54703412.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0424/dm_180424_Yates_on_Julio_Jones1143/dm_180424_Yates_on_Julio_Jones1143_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A former Miami Dolphins cheerleader has a filed a complaint against the NFL and the team, alleging she was discriminated against because of her religion and gender.\nIn the complaint with the Florida Commission on Human Relations, Kristan Ann Ware says she was subjected to a hostile work environment. Ware, who ended her three seasons as a cheerleader for Miami in 2017, says in the complaint that she was held to different standards than football players regarding social media, outward expression of faith, and references to Christianity and her religious beliefs.\nOne example, according to the complaint, was in April 2016, when Ware says she posted a picture of her baptism on social media. Ware says she was questioned about it by the team's cheerleading officials, who also asked her about her decision to forgo sex before marriage. The officials asked her to stop discussing her virginity, according to the complaint.\n\"The NFL and all NFL member clubs support fair employment practices,\" NFL spokesman Brian McCarthy said in a statement to media outlets. \"Everyone who works in the NFL, including cheerleaders, has the right to work in a positive and respectful environment that is free from any and all forms of harassment and discrimination and fully complies with state and federal laws.\"\nIn a statement, the Dolphins said:?\"We are seriously committed to providing a positive work environment for everyone associated with the organization. We hold every member of our organization to the same standards and do not discriminate as it relates to gender, race and religious beliefs.\"\nWare's action comes after a former New Orleans Saints cheerleader, Bailey Davis, filed a complaint with the Equal Employment Opportunity Commission last month and requested arbitration hearings with the Saints and the NFL. Davis says she was fired over what her attorney described as \"antiquated\" and \"blatantly discriminatory\" social media and fraternization policies that are different for female cheerleaders and male players.\nWare and Bailey are represented by the same attorney, Sara Blackwell.\n\"If it wasn't for Bailey speaking out, I would have never been able to find Sara,\" Ware told The Washington Post. \"If it wasn't for God healing me and using my pain for his purpose, I would have never been courageous enough to tell my story. Right now is the perfect time to tell my story.\"",
    "source_domain": "abcnews.go.com",
    "title": "Ex-Dolphins cheerleader alleges religion and gender discrimination",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/dolphins-cheerleader-alleges-religion-gender-discrimination/story?id=54703412"
}