{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 07:48:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Appealing for calm, China says US wants talks on North Korea",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fchina-us-diplomatic-solution-korea-standoff-46854532.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_780308e02e1844bdac6dc90ad3fae796_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chinese Foreign Minister Wang Yi made a new appeal for calm on the Korean Peninsula on Tuesday and said he believes the United States would prefer a diplomatic resolution to the standoff.\nWang told reporters that although U.S. officials have made clear that a military strike remains on the table, he believes that Washington would still prefer to de-escalate tensions through multi-sided talks.\nWang's comments came amid a mounting war of words between Washington and Pyongyang. After U.S. Vice President Mike Pence visited the demilitarized zone in South Korea on Monday and warned that \"all options are on the table,\" a senior North Korean official responded by accusing the United States of bringing the countries to the brink of thermonuclear war.\n\"We know the situation is tense,\" Wang said. \"The more tense things are, the more calm we need to be to find the opportunities and possibilities for dialogue.\"\nChina has called for a return to multi-sided talks that ended in a stalemate in 2009, during the rule of North Korea's previous leader, Kim Jong Il.\nSince entering office, President Donald Trump, like his predecessor, Barack Obama, has pressed China to use its political and economic leverage over North Korea, its once-close ally.\nChina has recently shown \"tangible indications\" that it is cooperating with the U.S. to turn up the pressure on Pyongyang, a senior State Department official said Monday.\nAustralia's prime minister also urged China to do more, saying Beijing has the \"greatest obligation and responsibility\" to de-escalate the threat from North Korea.\n\"The Chinese often express frustration with North Korea, and disappointment. But the fact is that they have the overwhelming leverage over the North Korea regime,\" Prime Minister Malcolm Turnbull told reporters Tuesday in Canberra, Australia's capital. \"So the eyes of the world are now on Beijing. Beijing has to step up and bring this reckless threat to the peace and stability of our region to an end.\"\nThe recent surge in tensions on the Korean Peninsula finds Beijing on the outs with both North and South Korea, while many critics have yet to be convinced by its insistence that its influence with Pyongyang has been exaggerated.\nNorth Korea has repeatedly ignored China's calls for denuclearization and other steps to calm tensions on the peninsula, and relations between the two are believed to have sunk to their lowest level in years. China remains North Korea's chief source of fuel and food imports, but Pyongyang seems to have calculated that Beijing's fears of a collapse of Kim Jong Un's hard-line communist regime override any such snubs.\nIn a sign of Beijing's hardening attitude, the Global Times, a state-run tabloid, said in an editorial on Monday that China could enforce \"stricter measures\" against North Korea, including a ban on oil exports, or join a U.S.-led effort to block the North's access to international financial markets.\nWang, the foreign minister, declined on Tuesday to comment on the piece, saying Global Times editorials do not reflect official foreign policy.\nMeanwhile, China's once-thriving relationship with South Korea has hit the rocks over Beijing's strenuous objections to Seoul's deploying of an advanced U.S. anti-missile system. Beijing says the system threatens its own security by allowing the U.S. to monitor flights and other activity in northeastern China. Beijing has retaliated against South Korean businesses, while its military has threatened to take unspecified action in response.\nChina's top negotiator for North Korea's nuclear program, Wu Dawei, held talks on the missile shield and North Korea's recent actions during a visit to Seoul last week. However, North Korea didn't respond to Wu's request to visit Pyongyang, according to South Korea's Yonhap news agency.\n———\nAssociated Press writer Kristen Gelineau in Sydney contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Appealing for calm, China says US wants talks on North Korea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/china-us-diplomatic-solution-korea-standoff-46854532"
}