{
    "authors": [
        "Abc News",
        "More Allison"
    ],
    "date_download": "2018-04-24 22:51:36+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Special Counsel Robert Mueller’s office has rebuffed two attempts by former Trump campaign chairman Paul Manafort over evidence seized last summer by FBI.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fprosecutors-rebuff-manaforts-arguments-evidence-seized-storage-locker%2Fstory%3Fid%3D54704536.json",
    "image_url": "https://s.abcnews.com/images/Politics/manafort-rt-er-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Special Counsel Robert Mueller’s office has rebuffed two attempts by former Trump campaign chairman Paul Manafort to argue that evidence seized last summer by FBI agents from his home and nearby storage locker was unlawfully obtained.\nInterested in Russia Investigation? Add Russia Investigation as an interest to stay up to date on the latest Russia Investigation news, video, and analysis from ABC News. Add Interest\nIn a filing late Monday night, Mueller’s team rejected Manafort’s claims that search warrants used to raid his home were “unconstitutionally overbroad,” arguing that evidence seized during both searches should, in fact, be permissible for use in an upcoming trial against Manafort.\nIn May, initial access to the storage locker was gained after an employee of Manafort’s, who was listed as the occupant of the lease, willingly allowed investigators to enter the unit. Prosecutors obtained a warrant the next day.\nThen in July, federal agents executed a search warrant and seized documents and records from Manafort’s home during an early morning raid when they awoke a sleeping Manafort and his wife by knocking on their bedroom door.\nManafort was listed as one of the people allowed to access the unit, alongside former campaign-aide Rick Gates and the unnamed Manafort employee.\nGates pleaded guilty to two felony charges in February and admitted to helping Manafort syphon millions of dollars into overseas accounts. As part of his deal, Gates is now cooperating with the Mueller probe.\nAlex Brandon/AP\nAmong other pieces of evidence seized during the searches of Manafort’s home and storage locker were digital materials from iPods and iPads, receipts, documents and several binders from a box labeled “Ukraine Binders”, according to the court filing.\nManafort’s dealings with Ukraine and Ukrainian business associates have served as the basis for many of the charges leveled against him, including tax fraud, money laundering, failing to register as a foreign agent and conspiring against the United States. Prosecutors have alleged that Manafort was acting as a lobbyist for the government in Ukraine without registering to do such work.\nManafort is the most senior Trump campaign adviser to face charges from the special prosecutor, though none of the charges brought against Manafort have been linked directly to his time with the Trump campaign.\nIn court last week Manafort’s team argued that charges related to his political dealings in Ukraine are beyond Mueller’s mandate.\nBut federal prosecutors argued that Manafort’s Ukrainian business ties fall within the special counsel’s purview, as he could have used those ties as a “back-channel” to contacts in Russia.\nCharles Dharapak/AP, FILE\nDespite Gates’ guilty plea, Manafort has maintained his innocence in the special counsel’s probe, which includes cases in federal courts in DC as well as in Virginia, where Manafort faces another 18-count indictment.\nManafort remains under house arrest, wearing two ankle braclets, while his legal team continues to negotiate collateral on his $10 million dollar bail. The courts have rejected the use of several of Manafort’s properties largely because some of the charges against him involve bank fraud related to a mortgage on one of his properties.\nManafort will next appear in federal court in Virginia on Friday, May 4.",
    "source_domain": "abcnews.go.com",
    "title": "Prosecutors rebuff Manafort's arguments over evidence seized from storage locker, home",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/prosecutors-rebuff-manaforts-arguments-evidence-seized-storage-locker/story?id=54704536"
}