{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 19:09:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The Latest: Southern California fires causing unhealthy air",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTravel%2FwireStory%2Flatest-southern-california-fires-causing-unhealthy-air-51722792.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_5e2942ae5a9b4befae3afafb189ca671_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on California wildfires (all times local):\n10:50 a.m.\nAuthorities have issued new alerts about unhealthy air from smoke and ash sent up by a growing Southern California wildfire.\nRichard Sanchez, a manager at Jeannine's American Bakery Restaurant in the foothill enclave of Montecito, says customers are coming in Monday wearing masks. He says smoke is so thick that visibility is down to a few feet and a layer of ash is coating the streets.\nRegulators are warning people in parts of Santa Barbara, Ventura and Los Angeles counties to stay indoors, avoid vigorous outdoor activities and not do anything to stir up ash.\nEven residents of Montecito and neighboring Carpinteria who aren't under evacuation orders have opted to leave because of the thick blanket of smoke.\n———\n7:45 a.m.\nA growing Southern California wildfire is threatening the wealthy seaside enclave of Montecito, where celebrities have evacuated estates perched on hillsides below heavy flames.\nSmoke shrouded Rob Lowe's home and the actor wore a mask as he livestreamed his family leaving on Sunday. Lowe thanked fans on Instagram for their thoughts and expressed gratitude for firefighters, saying \"we need you!\"\nTalk show host Ellen DeGeneres said on Twitter that neighbors were helping each other and their animals get to safety. She said she was proud to be a part of the small, exclusive community in Santa Barbara County northwest of Los Angeles.\nRetired tennis star Jimmy Connors tweeted that his property was in danger.\nMany residents of Montecito and neighboring Carpinteria not under evacuation orders have opted to leave because of heavy smoke and ash blowing through.\n———\n5:30 a.m.\nCrews aided by calm overnight winds kept a wall of flames from descending from mountains into coastal towns after a huge Southern California wildfire exploded in size over the weekend.\nThousands remain under evacuation orders Monday as the fire churns west through foothill areas of Carpinteria and Montecito, Santa Barbara County seaside towns about 75 miles (120 kilometers) northwest of Los Angeles. Much of the fire's new growth occurred on the eastern and northern fronts into unoccupied areas of Los Padres National Forest.\nThe fire, which had already destroyed more than 750 buildings, burned six more in Carpinteria on Sunday. It's just 10 percent contained after burning nearly 360 square miles (930 square kilometers).\nOfficials say the blaze, which broke out a week ago in neighboring Ventura County, is now the 5th largest in California history.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Southern California fires causing unhealthy air",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Travel/wireStory/latest-southern-california-fires-causing-unhealthy-air-51722792"
}