{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:28:02+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fwaffle-house-gunmans-troubles-began-years-attack-54703414.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_328b76641bdd478e90140d765963c0ad_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Travis Reinking's erratic behavior began years before police say he showed up without pants at a Waffle House restaurant and killed four people with an assault-style rifle.\nThe onetime construction crane operator bounced between states and suffered from delusions, sometimes talking about plans to marry singer Taylor Swift, friends and relatives told police. He was arrested outside the White House last year after asking to speak to President Donald Trump, and his bizarre actions seemed to intensify in recent days with a car theft.\nNow Reinking is charged in Tennessee with four counts of criminal homicide. He's been jailed without bond.\n\"He's a good kid that went off the handle for some reason,\" said Dave Warren, who once worked with Reinking in Colorado.\nFormer co-workers at Rocky Mountain Crane in Salida, Colorado, told police after the shooting that Reinking as complex.\nHe didn't drink or do drugs, according to a police report describing the interviews, and he was known as intelligent, polite and an excellent equipment operator. He didn't like the government or the National Rifle Association, and he talked about being a \"sovereign citizen,\" although the meaning of the phrase wasn't clear.\nWhat seemed to drive Reinking more than anything was an obsession with Swift, the report said.\nReinking told police — once in Tazewell County, Illinois, in 2016, and again in Colorado last year — that Swift was stalking him. He was infatuated with her and supposedly purchased a $14,000 ring and drove to California to try to meet her, authorities said.\nBut co-workers also knew Reinking as openly gay, according to the interview notes.\nKen and Darlene Sustrich, the owners of the crane service where Reinking worked for six months, recalled a time when he and other members of a crew were returning to Salida after completing a job. As they passed through the town of Last Chance, Colorado, Reinking quit on the spot.\n\"He misconstrued that was his last chance,\" Ken Sustrich said. \"He got super-paranoid, and he quit that day. He said, 'This is my last chance.'\"\nReinking's intelligence impressed them. He would sometimes talk about astrophysics, Darlene Sustrich said.\nIn his last few days at the crane service, he began showing signs of paranoia.\n\"You could see something was off with him, but nothing violent,\" Darline Sustrich said. Then came a call from the FBI, saying Reinking had tried to jump the White House fence.\n\"We told them, 'Hang onto him if you can. Help him if you can,'\" she said.\nKen Sustrich told police that he reached out to Reinking's father with concerns about his son's mental health. He said the father replied that he was aware of the issues and \"had been recently trying to rekindle his relationship with Travis,\" the police report said.\nBack in Illinois last June, a sheriff's report showed, the younger Reinking barged into a community swimming pool and jumped in wearing only underwear and a pink woman's coat. That same day, an employee at his family's business, J&J Cranes, said he emerged from an apartment above the office wearing a pink dress, clutching a rifle and yelling profanities, according to a report.\nThe sheriff's department called his father, who was out of state. He told officers that he had taken four guns away when his son was \"having problems\" but later returned them.\nPolice suggested that Jeff Reinking \"lock the guns back up until Travis gets mental help,\" officer Randy Davis wrote in a report. The father agreed to do so.\nWhen he was arrested at the White House, Reinking was not armed, but Illinois state police revoked his state firearms card at the FBI's request. Four guns, including the AR-15 used in the Waffle House shooting, were transferred to his father, a procedure allowed under Illinois law. The father said he later returned the guns to his son again, police said.\nSigns of paranoid delusions continued: In August, Reinking told police he wanted to file a report about 20 to 30 people tapping into his computer and phone and people \"barking like dogs\" outside his residence, according to a report.\nIt isn't clear why Reinking moved recently to the Nashville area from Morton, Illinois, and if it had anything to do with being near Swift. The performer has a home in Nashville, though it's not her only residence.\nA representative of Swift did not return a message seeking comment, nor did the public defender appointed to represent Reinking, who has not entered a plea.\nNashville police say they were not aware of Reinking's past fixation with Swift, but authorities in Music City say they are all too familiar with people being preoccupied with the superstar.\n\"You wouldn't believe how many people are obsessed with Taylor Swift,\" Nashville Police Chief Steve Anderson said.\nReinking apparently kept a low profile until recent days.\nAlerted to the theft of a BMW from a car dealer last week, officers decided against a risky chase knowing the car had a GPS device and could be located. Police found the vehicle outside Reinking's apartment, but they did not figure out until after the attack that Reinking had apparently taken it.\n———\nFoody reported from Denver, Colorado. Reeves reported from Birmingham, Alabama. Associated Press writers Dan Elliott in Salida, Colorado; Ed White in Detroit; John Raby in Charleston, West Virginia; Kristin Hall in Nashville; and Michael Kunzelman in Baton Rouge, Louisiana, also contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Waffle House gunman's troubles began years before attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/waffle-house-gunmans-troubles-began-years-attack-54703414"
}