{
    "authors": [
        "Abc News",
        "Dakshayani Shankar",
        "More Elizabeth"
    ],
    "date_download": "2017-08-15 00:18:49+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Defense Secretary Mattis: 'We'll take out' North Korean missiles to Guam",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fdefense-secretary-mattis-north-korean-missiles-guam%2Fstory%3Fid%3D49216303.json",
    "image_url": "http://a.abcnews.com/images/Politics/james-mattis-gty-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Amid heightening rhetoric over an attack on the U.S. island territory of Guam, Secretary of Defense James Mattis told reporters Monday that his department will know “within moments” where a North Korean missile is headed, were it to be launched.\n\"We'll know if it's going towards Guam within moments,\" he said, adding later, \"We know swiftly after it's launched where it's going to land.\"\nMattis also cautioned that “we'll take it out” if the missile is located heading to the U.S. territory off the coast of Philippines.\nHowever, Mattis said that President Donald Trump would be the one to decide America’s response if the missile is found to have been launched into Guam's surroundings waters.\n\"Well, then it becomes an issue that we take up however the president chooses,\" he responded.\nMattis chose stronger words for the hostile North Korean regime during the press gaggle Monday in comparison to his words last week during an event in California.\nMattis said that if North Korean leader Kim Jong-un’s army fired a missile at the U.S, it would “escalate into war very quickly,” and that if it hit U.S. cities, it would be “game on.” But the retired U.S. Marine Corps general stressed that the Defense Department will do its “best to make sure it doesn’t hit the U.S.”\nWhen asked to clarify his comments on an escalation of war, Mattis said, \"War is up to the president, perhaps up to Congress. The bottom line is that we will defend the country from an attack. For us, that's war. That's a war-time situation.\"\nMattis also pointed out that making the decision to go to war can’t be done in “advance,” given a “host of things going on,” especially since there are “allies that [they] have to consult with.”\nOn August 10, Mattis told reporters that a potential nuclear incident \"would be catastrophic\" and warned that the “tragedy of war is well-known.” Mattis looked to be opting for a more diplomatic route during the Defense Innovation Unit Experimental (DIUx) event in California, saying that he wanted to “stay right here now” in the “American effort [that] is diplomatically led.”\n\"It’s [North Korea's] aligning the United Nations in very serious sanctions, and I would just tell you that it did not happen by accident,\" Mattis said, of the 15-0 unanimous U.N. Security Council vote to impose economic sanctions on North Korea and stop its missile production.\nHowever, Mattis changed his tune on Monday, saying “welcome to reality” for the young troops who would be going into a wartime situation, adding that this doesn’t mean war is being declared yet.\nMattis referenced the political satire Dr. Strangelove, a film that satirized the Cold War fears of a nuclear conflict between the Soviet Union and the U.S., saying he’s not trying to “do things like that.”\nMattis released a harsher statement immediately following Trump’s initial “fire and fury” comments last week and North Korea’s threat to send four intermediate range missiles to Guam. The war veteran said “it must be noted that the combined allied militaries now possess the most precise, rehearsed and robust defensive...capabilities on Earth,” adding that any arms race would be “grossly overmatched by ours.”\nMattis has continuously warned North Korea of “the consequences” the rogue nation could bear in his slew of statements, despite calling for actions in a “diplomatically effective manner.”\nThe secretary said he regularly speaks with former secretaries of defense and state, as well as former national security advisers.\n\"Korea looms large in those discussions with all those predecessors,\" he said.\nMattis’ comments Monday come on the heels of North Korea’s warning Saturday that the Trump administration “better talk and act properly” if it doesn’t want to meet its “tragic doom.”\n“The U.S. has done all sorts of wrongs to the DPRK… but now it finds itself in an ever worsening dilemma, being thrown into the grip of extreme security unrest by the DPRK. This is tragicomedy of its own making,” North Korea said in a statement distributed through state-run media.\nTrump spoke with a key leader in the conflict, China’s President Xi JinPing, on Saturday to reiterate both nation’s commitments to “denuclearization of the Korean peninsula.”",
    "source_domain": "abcnews.go.com",
    "title": "Defense Secretary Mattis: 'We'll take out' North Korean missiles to Guam",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/defense-secretary-mattis-north-korean-missiles-guam/story?id=49216303"
}