{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 06:22:35+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "'El Chapo' seeking new lawyers in US drug trafficking case",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fel-chapo-seeking-lawyers-us-drug-trafficking-case-49199717.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_f7f15a53856a421082d2cebeb4cad817_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Mexican drug lord and escape artist Joaquin \"El Chapo\" Guzman wants to hire new lawyers in his U.S. drug trafficking case, but there's questions about how they'll get paid.\nGuzman is set to appear Monday in federal court in Brooklyn where a judge is expected to address questions about whether he can replace his public defense lawyers with private ones.\nHis current legal team has asked for assurances from prosecutors that if he hires the private lawyers, the government won't later seek forfeiture of any legal fees based on arguments the money came from his estimated $14 billion in drug profits.\nProsecutors have argued that taxpayers shouldn't have to pay for his defense. But they also said in a letter to the court last week that the government will not \"grant a blanket prospective assurance\" that it won't go after money spent on a private defense.\nOne of the private lawyers seeking to represent Guzman successfully defended John \"Junior\" Gotti, son of the notorious organized crime family boss, at a 2005 trial. The younger Gotti walked free after an acquittal on a securities fraud count and a mistrial on more serious racketeering counts.\nIn phone interviews with The Associated Press last week, the lawyer, Jeffrey Lichtman, said he's more concerned about getting the court to sign off on the change of lawyers than about legal fees.\n\"I'm going into the case regardless,\" Lichtman said.\nAs for his impressions of Guzman, \"He is charming, funny, highly intelligent. I enjoyed getting to know him. ... I don't judge someone by what I read in the papers.\"\nMexico extradicted Guzman in January to the U.S., where he pleaded not guilty to charges that his drug trafficking operation, the Sinaloa cartel, laundered billions of dollars and oversaw a ruthless campaign of murders and kidnappings.\nThe defense has claimed that he's being held in inhumane and overly restrictive conditions at a high-security jail in Manhattan known for housing alleged mobsters and terrorists.\nThe government has argued that his strict jail conditions are appropriate for someone who escaped from prison twice in Mexico, including once through a mile-long (1.6-kilometer-long) tunnel dug to the shower in his cell. Prosecutors said that even while he was behind bars in Mexico, Guzman used coded messages, bribes and other means to control his Sinaloa cartel and orchestrate his breakouts.\n———\nAP reporter Claudia Torrens in New York contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "'El Chapo' seeking new lawyers in US drug trafficking case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/el-chapo-seeking-lawyers-us-drug-trafficking-case-49199717"
}