{
    "authors": [
        "Abc News",
        "More Veronica"
    ],
    "date_download": "2017-02-15 13:28:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The Note: Flynn's Out, But Questions Remain",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fnote-flynns-questions-remain%2Fstory%3Fid%3D45506379.json",
    "image_url": "http://abcnews.go.com/Politics/note-flynns-questions-remain/story?id=45506379",
    "language": "en",
    "localpath": null,
    "maintext": "Trump’s First 100 Days with ABC’s RICK KLEIN and SHUSHANNAH WALSHE\nDay No. 27\nTHE BIG STORY: “Evolving and eroding level of trust.” That’s the official White House line on what cost Michael Flynn his job as National Security Adviser. It’s also an apt phrase to describe the White House itself, in terms of its relationship with the press, the public, and Congress, for starters. Even leaving aside “alternative facts” for a moment, consider the Flynn affair itself: shifting explanations for what he said, and what he said about what he said. There’s even new acknowledgements that President Trump knew three weeks ago that Flynn had misled his vice president but didn’t act on it until Monday night. Now comes a New York Times report that Trump campaign officials and associates “had repeated contacts with senior Russian intelligence officials” during the campaign. And the public is supposed to just believe the president’s casual denial that nothing like this happened? The Flynn matter has exposed rivalries and weaknesses inside the White House. It has also woken congressional watchdogs from their post-election slumber – for good reason.\nTHE SLEEPER STORY: At first glance, President Trump’s most substantive Twitter response to the events of the last few days seems like an attempt to deflect: “The real story here is why there are so many illegal leaks coming out of Washington?” Yes, that’s easier to address than the substance of what’s emerging – until we get into leak investigations. But doesn’t the president have a point? The public is learning an inordinate if not unprecedented amount of information about highly sensitive and classified information – the existence and even substance of secret (and secretly surveilled) phone conversations, details of active FBI and intelligence investigations, preliminary drafts of White House proposals. The president is right that there appears to be an effort, from deep inside the federal bureaucracy, to undermine him by exposing the inner workings of the new administration. You can argue that Trump deserves some of it, based on either his policies or his declarations against the intelligence community. (Don’t forget the “Nazi Germany” comment, because you know intelligence pros don’t.) But a scary consequence of these last few weeks could be a permanent presidential mistrust of intelligence and law-enforcement officials – a dangerous road for the president to be on.\nTHE SHINY STORY: It’s hard to imagine the news environment where the visit of the Israeli prime minister is a sideshow, a kind of distraction that the White House actually hopes gets coverage on Wednesday. But with the Russians rattling national-security cages, and testing by the Iranians and North Koreans of the new administration, Middle East peace is actually kind of a respite. The White House is sending word that it might not insist on a two-state solution; “maybe, maybe not” is diplo-speak, nowadays, apparently. Bibi and Donald get to project strength and togetherness – until or unless they get a real question or two.\nTLDR: The latest stunning development in the relationship between the president and his aides and Russia came last night in a New York Times report revealing that Trump campaign officials and associates “had repeated contacts with senior Russian intelligence officials” during the campaign. It just reveals more questions about that relationship, communications, and much more. Questions that will keep getting asked.\nPHOTO OF THE DAY: It was just hours after Gen. Michael Flynn was forced to resign after misleading him and hours before it was revealed he didn't know about concerns about Flynn's truthfulness to him for two weeks, but none of that stopped the vice president from doing an errand procrastinating husbands were tasked with all over the country: getting last minute Valentine's Day flowers for their wives. Check out the photo of his trip to his neighborhood Whole Foods. (Credit: Greta Brawner on Twitter)\nWhile grocery shopping for our family, hubby sees @VP shopping for his Valentine @WholeFoods. Hope my husband follows the Veep's lead... pic.twitter.com/ihXlfXu4wx — Greta Brawner (@gretabrawner) February 14, 2017\nTHIS MORNING’S TRUMP TWEETS:\n6:40 AM: The fake news media is going crazy with their conspiracy theories and blind hatred. @MSNBC & @CNN are unwatchable. @foxandfriends is great! 7:08 AM: This Russian connection non-sense is merely an attempt to cover-up the many mistakes made in Hillary Clinton's losing campaign. 7:19 AM: Information is being illegally given to the failing @nytimes & @washingtonpost by the intelligence community (NSA and FBI?). Just like Russia. 7:28 AM: Thank you to Eli Lake of The Bloomberg View - \"The NSA & FBI...should not interfere in our politics...and is\" Very serious situation for USA. 7:42 AM: Crimea was TAKEN by Russia during the Obama Administration. Was Obama too soft on Russia?\nNOTABLES\n--TRUMP ASSOCIATES COMMUNICATED WITH SUSPECTED RUSSIAN INTELLIGENCE OFFICIALS AHEAD OF ELECTION, SOURCES SAY: U.S. authorities were concerned with and probing communications between associates of President Donald Trump and suspected Russian intelligence officials in the leadup to the 2016 presidential election, sources familiar with the matter confirm to ABC News. The news comes just a day after Trump's national security adviser, Michael Flynn, resigned amid questions about conversations he had with the Russian ambassador during the transition and continuing inquiries about the administration's relationship with Russia, ABC’s ADAM KELSEY notes. http://abcn.ws/2l6z7ug\n--VP MIKE PENCE KEPT OUT OF THE LOOP FOR 2 WEEKS: When the Department of Justice notified President Donald Trump and White House staff in January about concerns over National Security Adviser Michael Flynn’s contact with the Russian ambassador, Vice President Mike Pence was kept out of the loop, only learning about the matter last week through media reports, according to Pence’s press secretary. Pence was made aware that he received \"incomplete\" information from Flynn only after reading a report about the circumstances in the Washington Post last Thursday and asking about the situation, report ABC’s MEGHAN KENEALLY and ADAM KELSEY. http://abcn.ws/2ldF8Iq\n--FBI INTERVIEWED FLYNN ABOUT HIS TALKS WITH RUSSIAN AMBASSADOR: In the days following the inauguration of President Donald Trump, the Federal Bureau of Investigation interviewed then-National Security Adviser Michael Flynn to discuss his conversations with the Russian ambassador to the U.S., according to multiple government officials. ABC News has previously reported that Flynn’s communications with Russia, including with its ambassador, Sergey Kislyak, have been examined as part of a broad counterintelligence investigation into contacts between the Trump team and Russians. This is the first confirmation that the FBI spoke with Flynn directly. ABC’s CECILIA VEGA, MIKE LEVINE and ADAM KELSEY have more: http://abcn.ws/2lO2lOH\n--DID TRUMP CAMPAIGN HAVE CONTACT WITH RUSSIA? ABC’s Jonathan Karl tweeted yesterday: “Today I asked @PressSec about contacts between the Trump campaign and Russia. He stood by earlier denials. Or I think he did. You tell me.” Here’s the exchange between Sean Spicer and Karl: ABC'S JONATHAN KARL: Back in January, the President said that nobody in his campaign had been in touch with the Russians. Now, today, can you still say that nobody in the Trump campaign, not even General Flynn, had any contact with the Russians before the election? SEAN SPICER: My understanding is that what Gen. Flynn has now expressed is that during the transition period- well we were very clear that during the transition period, he did speak with the ambassador- KARL: I’m talking about during the campaign. SPICER: I don’t have any - there’s nothing that would conclude me that anything different has changed with respect to that time period. WATCH: http://abcn.ws/2lOTg8d\n--TODAY AT THE THE WHITE HOUSE: President Trump hosts a listening session with the Retail Industry Leaders Association and member company CEOs. Then at 12:00 p.m., Trump holds a joint press conference with Israeli Prime Minister Benjamin Netanyahu. After the press conference, Trump and Netanyahu will meet privately, followed by a working lunch. Trump also has a scheduled call with President Mauricio Macri of Argentina. In the evening, the Trumps host Senator Marco Rubio and Mrs. Rubio for dinner.\n--FOUR THEMES TO WATCH AS TRUMP HOSTS NETANYAHU: Israeli Prime Minister Benjamin Netanyahu will meet face-to-face with President Trump on Wednesday, setting the tone for what both leaders hope to be the dawn of a new era for the U.S.-Israel relationship. Analysts say that the meeting will hope to project a public theme of unity between the two governments on topics including Iran, Israeli settlements and the fate of the peace process. ABC’s MOLLY HUNTER has more: http://abcn.ws/2liRL4D\nSPEED READ with ABC’s ADAM KELSEY\nANALYSIS: MICHAEL FLYNN RESIGNATION RAISES DARK QUESTIONS SURROUNDING TRUMP AND RUSSIA. There are Washington resignations that end stories. Then there is the resignation of National Security Adviser Michael Flynn. Flynn’s abrupt departure reveals a national security team in disarray at a time when President Trump is being tested by friends and foes alike. With demands for answers and investigations only increasing, the story goes significantly deeper than questions of who is in charge and who knew what and when, writes ABC’s RICK KLEIN. http://abcn.ws/2lgAfhl\nUS WILL NOT INSIST ON TWO-STATE SOLUTION IN MIDDLE EAST: WHITE HOUSE OFFICIAL. In what would be a major shift from the policy position held by the Obama administration, a White House official said Thursday night that the United States will not “impose” a two-state solution in the Middle East in an attempt to settle the long-running Israeli-Palestinian conflict, ABC’s ADAM KELSEY notes. \"Maybe, maybe not,\" said the official when asked at a White House briefing whether peace equaled a two-state solution. \"It's something the two sides have to agree to. It's not for us to impose that vision. But I think we'll find out more about that tomorrow.\" http://abcn.ws/2lOrRT7\nSENATE COMMITTEE MAY CALL ON FLYNN TO TESTIFY AMID RUSSIA QUESTIONS. Senate Republican leaders said Tuesday that former National Security Adviser Mike Flynn may be called to testify before the Senate Intelligence Committee as part of its investigation into Russia’s suspected involvement in the 2016 election and the Trump administration’s potential ties to the nation, ABC’s ALI ROGIN and MARY BRUCE report. Sen. Roy Blunt, R-Missouri, a member of the Senate Intelligence Committee and part of the Republican leadership, told reporters that he thought it was likely that Flynn would, at some point, talk to the committee. http://abcn.ws/2lhg4ji\nOFFICE OF GOVERNMENT ETHICS ASKS WHITE HOUSE TO INVESTIGATE KELLYANNE CONWAY. The Office of Government Ethics is calling on the White House to investigate the actions of counselor to the president, Kellyanne Conway, less than a week after she appeared on television and promoted the apparel and accessories brand owned by Ivanka Trump -- saying there's \"strong reason to believe that Ms. Conway has violated the Standards of Conduct.\" Walter M. Shaub, Jr., the director of the OGE, sent a letter Monday to Stefan Passantino, the designated agency ethics official at the White House, recommending that an inquiry be made and asking the administration to “consider taking disciplinary action against her.” ABC’s ADAM KELSEY has more: http://abcn.ws/2kHR9SB\nCHAFFETZ TO INVESTIGATE MAR-A-LAGO BUT NOT FLYNN'S TIES WITH RUSSIA YET. House Oversight and Government Reform chairman Jason Chaffetz says he will not immediately investigate former National Security Advisor Michael Flynn’s interactions with Russia, but may consider launching an inquiry in the future. “[Flynn] can’t mislead people, and that seems to have resolved itself with the White House taking some decisive action,” Chaffetz, R-Utah, told ABC News Tuesday at the Capitol. “But I’m not going to close off any doors to any possibilities of what we may or may not do.” ABC’s JOHN PARKINSON and MARY BRUCE have more: http://abcn.ws/2kudN06\nRUSSIAN AIRCRAFT BUZZED US NAVY SHIP 3 TIMES IN A DAY. Russia has secretly deployed a new cruise missile inside Russia, a move a U.S. official labels an apparent violation of the Intermediate Range Nuclear Forces (INF) Treaty signed in 1987, ABC’s LUIS MARTINEZ writes. The move is one of several incidents involving the Russian military and the United States that came to light on Tuesday. The Pentagon says Russian aircraft flew low and fast above an American destroyer in the Black Sea last week in an \"unsafe and unprofessional\" manner and a Russian intelligence vessel has been detected heading north along the eastern coast of the United States. http://abcn.ws/2l5VpN0\nARREST OF 'DREAMER' IMMIGRANT COULD BE FIRST UNDER TRUMP TO DEFY DACA. The Obama administration policy protecting the children of undocumented immigrants who were brought to the United States in their youth may face its first test under the Trump administration as Immigration and Customs Enforcement agents arrested a Mexican migrant in Washington state last week, writes ABC’s ADAM KELSEY. The arrest of Daniel Ramirez, 23, first reported by Reuters Tuesday evening, is possibly the first of an immigrant protected by the Deferred Action for Childhood Arrivals program during the presidency of Donald Trump. http://abcn.ws/2l6t4WY\nIN THE NOTE’S INBOX\nNEW ADS AGAINST PUZDER: The progressive group Allied Progress is launching new TV ad buys today calling on Senators Lisa Murkowski, R-Alaska, and Susan Collins, R-Maine, to vote no on President Donald Trump’s labor secretary nominee Andrew Puzder. The ads against the fast food executive are part of a six-figure, paid advertising effort from Allied Progress against Trump’s economic Cabinet nominees. WATCH: https://youtu.be/gssCYgohWu4\nWHO’S TWEETING?\n@MikeDelMoro: Sen. Graham on @GMA describes POTUS as an \"outlier\" when it comes to the Russians-says \"maybe so\" when asked if it's time to see tax returns\n@DanRather: Watergate is the biggest political scandal of my lifetime, until maybe now: https://www.facebook.com/theDanRather/posts/10158205383810716 …\n@rebeccaballhaus: Trump was surprised to see Flynn at dinner at Mar-A-Lago on Friday. \"What is he doing here?\" https://www.wsj.com/articles/mike-flynn-is-first-casualty-of-turmoil-in-trump-administration-1487121454 …\n@rebeccagberg: In a hallway interview, Sen. Tom Cotton shrugs off Flynn's resignation as the administration \"finding their sea legs.\"\n@kurtbardella: if the first four weeks of the #Obama presidency were like this when I worked at #oversight we'd have issued so many subpoenas by now\n@rpollockDC: The thoughts of Gen. Mike Flynn hours before he resigned. http://dailycaller.com/2017/02/14/exclusive-defiant-flynn-insists-he-crossed-no-lines-leakers-must-be-prosecuted/",
    "source_domain": "abcnews.go.com",
    "title": "The Note: Flynn's Out, But Questions Remain",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/note-flynns-questions-remain/story?id=45506379"
}