{
    "authors": [
        "Abc News",
        "More Candace"
    ],
    "date_download": "2018-03-19 19:26:19+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Alas, she didn't win.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fjay-beyonces-daughter-blue-ivy-bids-19000-art%2Fstory%3Fid%3D53851589.json",
    "image_url": "http://abcnews.go.com/GMA/Culture/jay-beyonces-daughter-blue-ivy-bids-19000-art/story?id=53851589",
    "language": "en",
    "localpath": null,
    "maintext": "It seems Beyoncé and Jay-Z's daughter Blue Ivy has an appreciation for fine art -- and a bank account to fuel it.\nWhile attending the second annual Wearable Art Gala with her famous parents in Los Angeles Saturday, the confident 6-year-old bid on an acrylic painting of a young Sidney Poitier, valued at $16,000. The starting bid for the art piece was $10,000 and in footage shared online from a fan account, Blue is seen raising her hand at $19,000, with Jay-Z attempting to stop her in jest.\nVanity Fair reported that director Tyler Perry ultimately placed a winning bid on the painting for $20,000.\nHowever, the magazine also noted that Blue took home another piece of art for the whopping price of $10,000 -- deconstructed law books from Indiana and medical books from California by artist Samuel Levi Jones. Her mother reportedly also won a set of Lorraine Schwartz panther earrings for a winning bid of $17,000.\nThe night was a special one for the Carter family for more than one reason, though. Beyoncé was also recognized for her humanitarian work at the gala, which was hosted by her mother, Tina Knowles-Larson, and stepfather, Richard Larson.\n\"I feel very overwhelmed and I feel really full and really blessed and fortunate,\" the singer said in a speech at the event. \"There's something that feels very off about receiving this award from my mother. She raised me to believe that giving was not an option, but a privilege and a responsibility. I think the real reason I feel weird to receive this award from my mother is because I feel like I should be giving her an award tonight.\"",
    "source_domain": "abcnews.go.com",
    "title": "Jay-Z and Beyonce's daughter Blue Ivy bids $19,000 on art",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/jay-beyonces-daughter-blue-ivy-bids-19000-art/story?id=53851589"
}