{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:41:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "The Latest: France's Macron wary of far-right and far-left",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-frances-macron-wary-left-46845184.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_adb4b7eecf7744f1bdd03fb9ebde447e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on France's two-round presidential election (all times local):\n6:25 p.m.\nFrench presidential hopeful Emmanuel Macron has pledged to represent an \"open, confident, winning France\" in contrast with his far-right and far-left rivals.\nWithout naming them, Macron suggested Monday that far-right candidate Marine Le Pen and far-left leader Jean-Luc Melenchon want to isolate France form the rest of the world. Speaking at a big rally in Paris, Macron says \"Some want us to believe ... that France will isolate itself.\"\nWarning against the consequences of a vote for the far-right, he said \"we feel everywhere the temptation of barbarism ready to surge in other guises.\"\nMacron, an independent centrist with pro-business, pro-European views, is among the front-runners in France's unpredictable presidential race. The top two vote-getters in the first round Sunday will advance to the May 7 presidential runoff.\n———\n12:50 p.m.\nFrench presidential candidate Emmanuel Macron and far-right rival Marine Le Pen hope to rally big crowds in Paris with their rival visions for Europe's future.\nFar-left candidate Jean-Luc Melenchon, enjoying a late poll surge, is campaigning on a barge Monday floating through the canals of Paris. And conservative candidate Francois Fillon is taking his tough-on-security campaign to the southern French city of Nice, which was scarred by a deadly truck attack last year that killed 86 people.\nThe French presidential race is being watched internationally as an important gauge of populist sentiment, and the outcome is increasingly uncertain just six days before Sunday's first round vote.\nLe Pen's nationalist rhetoric and Melenchon's anti-globalization campaign have resonated with French voters sick of the status quo. Macron, meanwhile, is painting himself as an anti-establishment figure seeking to bury the traditional left-right spectrum that has governed France for decades.\n———\n10 a.m.\nFrench centrist presidential candidate Emmanuel Macron, a former investment banker well connected in the business world, has fended off questions about his elitist image on BFM television.\nHe says Monday \"the money I earned in my life, I earned it. I have not been given gifts.\"\nHe accused rivals of pandering to Russian President Vladimir Putin, and tried to distance himself from Fillon, whose austerity-focused campaign has been damaged by accusations that he misused taxpayer money to pay his wife and children for government jobs that they allegedly did not perform. French investigators are probing the case.\nFillon denies wrongdoing and is focusing instead on security issues that resonate with many voters after two years of deadly attacks across the country.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: France's Macron wary of far-right and far-left",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-frances-macron-wary-left-46845184"
}