{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:49:04+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Lara Spencer reports the buzziest stories of the day in \"GMA\" Pop News.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Flady-gaga-film-movie-bradley-cooper-coachella-46859915.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/170418_gma_pop_0805_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Lady Gaga to film movie with Bradley Cooper at Coachella\nAnd we deserve some \"Pop news.\" Good morning, everybody. We begin \"Pop news\" this morning with lady gaga. A trifecta going on for her at co-chel L.A. The festival happening this weekend in California. She's serving as the overall headliner as Beyonce dropped out and debuting her new song you're listening to called \"The cure\" and using it as a backdrop if you will filming a scene for \"A star is born.\" That little remake. You might have heard of it and the director and co-star broadly cooper and his team are asking extras to join them. All little monsters are encouraged to come over to their stage whering denim and boots and leave the usual inspired gaga at home. She shared this photo, her first shot in character opposite cooper and writes in part I'm so excited to star in my first movie alongside someone I'm lucky to call my friend and so grateful to Bradley for making my dream come true. I think I read she had to audition for that part. Yeah, she had to audition for the part and I did not now, googling this morning, there were -- I thought there were three -- this is the fourth remake of this. Yeah, there was a version back in the '30s then Judy Garland and then Barbara striegs sand. And now lady gaga looking forward to that. Also in \"Pop news\" this morning, the wedding of duchess Kate's sister pippa and the question, will she or won't she? We're talking about Meghan Markle attending and the answer is kind of. While there is no formal rule for Royals bringing dates to such occasions Megan will likely not attend the church service alongside her boyfriend prince Harry. A source telling \"People\" magazine she's trying as best she can to keep it in check sizewise but Markle requested time off from her show \"Suits\" and will attend all other wedding festivities including the reception and evening bash and it comes on the heels that word that prince Harry took a trip to Toronto over Easter weekend to visit her skipping his usual royal traditions for the holiday. Things heating up, I think. But also because it's pippa's wedding and you never want to outshine the bride. Exactly. Absolutely. So much I could say. Okay, okay. Over coffee. Finally, if you're a pet owner you might want to hide your iPhone. Your furry friends are likely to damage it out of sheer boredom. A new report, a protective plan provider released their damage report. It's very technical that name. Pets break stuff and reports are a bit ruff, 59% of squaretrade users say their pets have destroyed at least one phone with male animals more likely to be the culprit and made up for 63% of tech wreckers and the report gives a not so purrty report for others. Small dogs get into trouble. You know it's not surprising. So why do they do it? They report them as being cure os or complained bored and 60% their weapon of choice was their teeth. The culprit was chewing and that, everybody, is \"Pop news\"\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Lady Gaga to film movie with Bradley Cooper at Coachella",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/lady-gaga-film-movie-bradley-cooper-coachella-46859915"
}