{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:15:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Steve Stephens, who allegedly killed Robert Godwin, 74, and posted a video of the murder on Facebook, is on the FBI's most wanted list; authorities say the Cleveland man's cell signal pinged Sunday afternoon in Erie, Pennsylvania.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fmanhunt-expands-nationwide-50k-reward-facebook-murder-suspect-46857362.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_perez1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Manhunt expands nationwide with $50K reward for Facebook murder suspect\nnationwide manhunt for the suspect who posted that crime on Facebook. This morning there are new 911 calls from the scene. And we are learning more about the killer who is still on the loose. ABC's Alex Perez is in Cleveland, has the latest details for us, good morning, Alex. Reporter: Good morning, robin. The FBI and local investigators say they have been talking to the police about this situation trying to figure out what exactly -- how they can piece this together, this case together here. Now, we've also learned that investigators are talking to anybody on the scene and anybody who may have any information on this case to try to figure out what exactly went wrong for the first time here. We are hearing some of these 911 tapes and the confusion and panic that followed in the moments after the shooting. Reporter: This morning Steve Stephens is on the FBI's most wanted list, the hunt intensifying and now going nationwide. Our reach now is basically all over this country. Reporter: This as new 911 tapes are released of the moment a neighbor witnessed the shooting aftermath of the unarmed elderly man. Where was he shot at? He's been shot in the head. He's unconscious. He's dead. Stephens' cell phone signal pinged 100 miles east of Cleveland, near Erie, Pennsylvania. They tried to persuade him to turn himself in but now the trail has gone cold. He's dangerous and could be a lot of places. Reporter: Stephens recorded this shocking video of himself randomly targeting 74-year-old Robert Godwin killing him in cold blood. Then posting it to Facebook Sunday afternoon. This morning we're learning more about the 37-year-old suspect, a case manager who worked with troubled youth. Every day but when it come to my Nobody gives a . Reporter: He complained about the downward spiral of his rife after gambling and girlfriend trouble. Earlier videos posted to his YouTube page a stark contrast. Showing the Cleveland native bowling, fishing and even celebrating -- Yeah, we dit, baby. Reporter: His city's basketball win last year. A former college friend of the alleged killer stunned. It was an act of cowardice, stand up, be a man, turn yourself in. Reporter: To family and friends gathering to remember the innocent victim, who leaves behind ten children and 14 grandchildren. I saw the video and it forever will be in my mind because I saw the fear in my father's eyes. He was so frightened. He was. He was so afraid. So sweet. Reporter: And authorities say they are following up on, quote, Dodds and dozens of leads. There's now a $50,000 reward for any information leading to his arrest. Joining us is Rebecca Jarvis and former Dallas police chief David brown. Chief brown, let me start with you. Where does the search stand right now. It's a national search. It's been reported and we are combing all of the technology that he might use, beyond cell phones, to social media might be leads that might develop as well as family and friends, because it's highly suggestive that he's getting help in order to be able to disappear off the radar like this. Yesterday we were saying there were five states that were on high alert. Now they're saying a nationwide search. As more time passes it becomes a little more complicated. More complicated and difficult for law enforcement to be able to locate. They need help from the public and made those pleas to the public to report anything they might see that's suspicious or a tip that leads them to capture the suspect. You're familiar with searching for suspects, so, what's next in the manhunt, do you think? Most of all there are cameras at tollways and cameras in public spaces like malls and locations where people frequent and so we're combing all of those types of technologies in order to hopefully get that one little tip of a license plate or just a suspicious thing that happened that people report and follow up on that but it's, again, a needle in the haystack type of search so we need the public's help and emphasize it is a crime to hinder apprehension and secrete him. There is a thought he must be getting help here. Rebecca, going back to Facebook, what are they saying this morning about this? What's so interesting as chief brown points out technology can help us find this individual, but it also helped this individual put his story public and overnight Facebook has now apologized for this video being up on its site for as long as it did and said as a result of this terrible series of events we are reviewing our reporting flows to be sure people can report videos and other material that violates our standards as easily and quickly as possible. We know we need to do better. That's part of the thing. People, the users of Facebook are the people who help Facebook take down this material. That's true. In order to take down material like this as of today, Facebook needs people to go on their site and say, this exists. There's nothing legally wrong with what Facebook did. But people are thinking morally, is there something more they can. They want to do more and developing technology to try to do more if you look at that time line it was more than two hours. Both of you thanks so much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Manhunt expands nationwide with $50K reward for Facebook murder suspect",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/manhunt-expands-nationwide-50k-reward-facebook-murder-suspect-46857362"
}