{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 19:39:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "'The Situation' pleads not guilty in latest tax fraud case",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fsituation-set-arraignment-tax-fraud-case-46840712.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_aabab9a4956046c6b62f8455ef632379_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"Jersey Shore\" star Michael \"The Situation\" Sorrentino and his brother pleaded not guilty Monday to additional tax fraud charges after federal prosecutors say they filed fake tax returns and claimed luxury car and clothing purchases were business expenses.\nMichael and Marc Sorrentino entered their pleas during an arraignment in federal court in Newark.\n\"This is a complicated case — Michael is not a complicated person,\" Michael Sorrentino's attorney, Henry Klingeman, told reporters outside the courthouse after the hearing had concluded.\nMarc Sorrentino's attorney declined to comment on the proceedings.\nIn 2014, the brothers pleaded not guilty to charges they filed bogus tax returns on nearly $9 million and claimed millions in personal expenses as business expenses.\nMichael Sorrentino was indicted this month on charges including tax evasion, structuring bank deposits to avoid reporting requirements and falsifying records. Marc Sorrentino was charged with falsifying records to obstruct a grand jury investigation.\nProsecutors allege Michael Sorrentino didn't pay federal income tax owed on the $8.9 million he earned from 2010 to 2012, failed to file a personal tax return for 2011 and filed fake corporate returns for one of the companies the brothers set up after he gained fame on the show. Prosecutors say he also made a series of bank deposits of under $10,000 to avoid bank reporting requirements.\nAfter the brothers were served with grand jury subpoenas seeking records from their companies, prosecutors allege Marc Sorrentino falsified records to reclassify taxable payments to himself as nontaxable payments and business deductions.\n\"The Situation\" appeared on all six seasons of the MTV reality show, which followed the lives of rowdy housemates on New Jersey's famed Atlantic shore and ran from 2009 to 2012.",
    "source_domain": "abcnews.go.com",
    "title": "'The Situation' pleads not guilty in latest tax fraud case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/situation-set-arraignment-tax-fraud-case-46840712"
}