{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 22:22:50+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Fyankees-put-gleyber-torres-dl-hip-strain%2Fstory%3Fid%3D56371022.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0703/dm_180703_nba_woj_on_kawhi/dm_180703_nba_woj_on_kawhi_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "NEW YORK - Yankees second baseman Gleyber Torres was placed on the 10-day disabled list Wednesday afternoon after an MRI revealed he had a right hip strain.\nNew York is officially beginning the DL stint during its off day Thursday, as team officials continue to talk through making a corresponding roster move ahead of a three-city road trip the Yankees are heading on beginning Friday in Toronto.\nThe injury, which forced Torres out of Wednesday's 6-2 win over the Atlanta Braves, was initially believed to be an aggravation of some \"tightness\" that had nagged Torres earlier this week.\n\"We're hoping it's a short stint,\" Yankees manager Aaron Boone said. \"Probably take us up to the All-Star Break.\"\nThe All-Star Game is two weeks from Tuesday.\nNeil Walker likely will replace Torres as the Yankees' everyday second baseman, and it's possible they decide to call up Tyler Wade, a 23-year-old middle infielder who began the season with them. Wade was sent down to Triple-A in April just as Torres was being called up to the big-league club.\nUtilityman Brandon Drury also could be an emergency option at second, having played the position in the past. Of late, he has been working at third base and first base.\nAccording to Boone, Torres has dealt with similar hip injuries in the past, but it has never given him major trouble. In fact, when Boone first addressed reporters following Wednesday's game, and just before the MRI results were revealed, he believed Torres would be fine.\nDuring in-game tests the infielder \"checked out OK.\" Boone added that the trainers were simply being cautious with the injury more than anything else. About 25 minutes later, Boone delivered news about the strain.\n\"Anytime you're talking about groin, hamstring, quads, once you have a strain in there and you push through it, you could make it a worse thing and now you're talking weeks and months and stuff like that,\" Boone said. \"So the wise thing is to do this now.\"\nThe Yankees initially became concerned about Torres' hip during Monday night's game, one in which Torres had a couple of sudden advancements on the basepaths, taking advantage of wild pitches in the dirt. One such advancement resulted in a Yankees run.\nBoone and his staff became so concerned about the injury coming out of Monday that the manager decided to keep the 21-year-old rookie out of Tuesday's starting lineup.\nWhile Torres may not have begun Tuesday's game, he did finish it. He checked in during the eighth inning, only getting an opportunity to play the field. He seemed to be feeling and looking better.\nIn his first at-bats since his right hip flexor started feeling stiff Monday, Torres, in the starting lineup Wednesday, struck out twice. He actually showed some visible discomfort as he fouled off a pitch in his final plate appearance in the fourth inning, and then tried to stretch.\nDuring the next half inning, Torres was replaced in the batting order by Drury. Walker took Torres' spot at second, moving over from third to accommodate Drury.\n\"We need him,\" first baseman Greg Bird said of Torres. \"He's going to be a big part of this. He's obviously shown what he can do, in big situations, too.\"\nA potential Rookie of the Year selection, Torres has been a force for the Yankees ever since he was called up April 21. He's batting .294 with 15 home runs, 42 RBI, a .555 slugging percentage and a .905 OPS in 63 games. He leads all rookies in homers, batting average and slugging percentage.\nThe Yankees also won 15 of the first 16 games in which he played. Torres also has three walk-off hits.\n\"Gleyber wants to take a couple days and just work through it, but he also understands that this is the best thing for him and for us,\" Boone said.",
    "source_domain": "abcnews.go.com",
    "title": "Yankees put Gleyber Torres on DL with hip strain",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/yankees-put-gleyber-torres-dl-hip-strain/story?id=56371022"
}