{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 04:50:47+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Marvin Bagley makes Duke the team to beat -- again",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmarvin-bagley-makes-duke-team-beat%2Fstory%3Fid%3D49219675.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170814_ncb_bagley_to_duke_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Now that Marvin Bagley III is headed to Duke, the discussion is over. Mike Krzyzewski and the Blue Devils are the clear-cut favorites (again) to cut down the nets come April 2 in San Antonio.\nWe've hemmed and hawed about it all spring and summer. Who should be preseason No. 1?\nArizona was the pick in our latest Way-Too-Early top 25 rankings from May -- but you could also make a strong case for Michigan State. And what about Kansas? Or Kentucky and all its newcomers?\nNone of that matters now. Bagley's decision on Monday night to commit to Duke and reclassify to 2017 means the race is over.\nBagley isn't just another five-star or top-10 prospect committing to Duke. He's the consensus No. 1 prospect in the 2017 class, was No. 1 in 2018, and is the heavy favorite to be the No. 1 pick in next June's NBA Draft. Oh, and he would have been the No. 1 pick had he been eligible for this past June's NBA Draft.\nIn fact, one can make a legitimate case that Bagley is the best prospect to come out of high school since Anthony Davis in 2011. Coincidentally, Bagley going to Duke and reclassifying to 2017 marks only the second time since 2007 that No. 1 prospects have gone to the same school in consecutive years, according to ESPN Stats and Info. Harry Giles was the No. 1 prospect a year ago. He spent one season at Duke before heading to the NBA. The last time? Anthony Davis and Nerlens Noel (who also reclassified) in 2011 and 2012.\nBagley would have been enough to put USC in the conversation for preseason No. 1. The same USC team that only made the NCAA tournament via a First Four berth would've been perhaps the most talented team in the country with Bagley in the fold. He would have been enough to push a UCLA team that lost four starters into the top-10 conversation.\nDuke was already in better shape than either of those teams, and now the Blue Devils are a notch above Arizona, Michigan State, Kansas and any other candidate for the top spot.\nYes, this is the same thing nearly everyone said before last season. In our defense, it was impossible to foresee Krzyzewski needing back surgery in the middle of the season; or Grayson Allen being the biggest story in college basketball for tripping opponents; or a late-January locker room ban; or Giles contributing next-to-nothing for essentially the entire season due to injury; or Jayson Tatum and Marques Bolden also starting the season injured and taking time to get acclimated.\nBy the time the NCAA tournament rolled around, though, Duke was one of the favorites to cut down the nets, coming off an ACC Tournament title and wins in 12 of its last 15 games.\nCould that all happen again? Of course. But it's the preseason, and preseason rankings should come down to talent.\nAnd as far as talent goes, it's Duke then everyone else.\nIt starts with Bagley. He's a supremely skilled 6-foot-11 prospect who can play any position in the frontcourt and also handle the ball or make shots from the perimeter. The lefty averaged 25.5 points, 14.7 rebounds and 3.0 blocks on the Nike EYBL circuit this past spring and summer with the Phoenix Phamily AAU program. In a 20-game season, Bagley hit the 30-point mark on four separate occasions and the 20-rebound mark three times. He has a terrific motor, but makes it look effortless at the same time.\nBut there's a lot more. Duke is only the second team since 2007 with four top-10 freshmen entering the program.\nTrevon Duval is the best point guard entering college basketball, and a legitimate game-changer at the point of attack. The past couple years, Krzyzewski has had to use guys like Allen and Frank Jackson at point guard -- talented offensive players, but not true point guards or consistent distributors. Duval is different, and will do a better job of keeping the surrounding talent happy.\nWendell Carter was the best power forward in the 2017 class before Bagley reclassified, and he gives Duke a go-to-guy in the post to balance the offense. Giles' health didn't allow him to do that last year, and Amile Jefferson was never been a dominant offensive player. Carter is a double-double waiting to happen.\nDuke is also welcoming the No. 1 freshman shooting guard in Gary Trent Jr., one of the best scorers in high school basketball the last couple seasons. He can take -- and make -- contested jumpers, and should find plenty of space on the perimeter with Duval and Allen attacking off the bounce.\nThere's also the return of Allen, who was the odds-on favorite for the Wooden Award at this time a year ago. He won't have that target on his back with the other stars in the lineup, and he won't have the pressure of being the primary playmaker in the backcourt. He's only one season removed from averaging 21.6 points and shooting 41.7 percent from 3-point range.\nFormer five-star Bolden provides potential off the bench; Jordan Tucker was one of the best 3-point shooters in the 2017 class; and Javin DeLaurier and Alex O'Connell can play minutes as well.\nWithout Bagley, there was enough on the roster for a top-five ranking in the preseason.\nWith Bagley, it's not even close.\nThe best player in college basketball will be playing for the best team in college basketball.",
    "source_domain": "abcnews.go.com",
    "title": "Marvin Bagley makes Duke the team to beat -- again",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/marvin-bagley-makes-duke-team-beat/story?id=49219675"
}