{
    "authors": [
        "Abc News",
        "More Stephanie"
    ],
    "date_download": "2018-07-04 20:52:55+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The Supreme Court ruled on several big issues during the 2018 term, including Trump's travel ban, cell phone privacy, online sales tax and public union fees.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fsupreme-courts-biggest-rulings-2018%2Fstory%3Fid%3D56364077.json",
    "image_url": "https://s.abcnews.com/images/Politics/supreme-court-building-ap-ps-180625_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Before Supreme Court Justice Anthony Kennedy announced his upcoming retirement, the Court issued decisions on several significant cases that could have impacts on public unions, cell phone privacy and how courts consider First Amendment protections.\nInterested in Supreme Court? Add Supreme Court as an interest to stay up to date on the latest Supreme Court news, video, and analysis from ABC News. Add Interest\nHere are some of the biggest decisions from the Supreme Court's 2018 term.\nTravel ban\nThe most highly anticipated decision of the session was the Court's ruling on President Donald Trump's ban on immigrants and refugees entering the U.S. from certain countries. The administration argued that the ban was necessary because people coming from those countries couldn't be vetted for potential national security threats.\nTwo versions of the travel ban were struck down by federal courts, which said the policy was essentially a ban on Muslims because many of the countries had Muslim-majority populations and Trump had previously made comments about a \"Muslim ban.\"\nBut the Supreme Court upheld the third version of the ban, which restricted people from Chad, Iran, Iraq, Libya, North Korea, Syria, Venezuela, and Yemen. In its decision, the majority wrote that what became known as \"Travel Ban 3.0\" was within the president's authority as a national security issue and that Trump's previous comments about Muslims were not relevant to the decision because the proclamation did not mention religion.\nThe U.S. later reversed the restrictions on travel from Chad.\nThe dissenting justices, however, strongly disagreed with the majority's decision and said Trump's comments about Muslims should have been considered in his intent for the policy.\nPlay\nMasterpiece Cake\nIn Masterpiece Cake LLC v. the Colorado Civil Rights Commission, the Court ruled in favor of a Colorado baker who declined to bake a wedding cake for a same-sex couple because it went against his religious beliefs.\nThe Court ruled that the baker was within his rights to refuse to make the wedding cake because the cake is a symbol of marriage, adding that the government cannot force someone to express something that would violate their right to freedom of religion or speech. However, the court also made a point of saying that the decision was specific to this case, which overturned the Colorado Civil Rights Commission decision in favor of the couple because commissioners had previously made statements in the proceedings that could be seen as biased against religion.\nEven though the Court stayed away from setting a precedent in the Masterpiece decision, the ruling will still likely be considered in any future cases where the rights of LGBTQ couples seem to conflict with the rights of businesses that say participating in their wedding ceremonies contradicts their religious beliefs.\nPlay\nOnline sales tax\nThe Court ruled that states could require retailers to collect state sales tax on online-only transactions, allowing states to collect more tax revenue but possibly leading to more expensive online shopping for consumers.\nIn this decision the Court overturned a rule that states could only tax online transactions from stores that had a brick and mortar presence in that state. Retailers like Wayfair and Overstock.com argued that allowing every state to collect online sales taxes would be overly complicated, but the Court said it caused too much confusion to make rules based on physical stores in an increasingly online retail economy.\nThe decision could mean that online shopping will get more expensive for consumers if they shop at retailers that don't already collect state sales taxes, but could also bring in up to $13 billion in tax revenue for states that previously could only tax stores that had a physical presence in that state.\nSome business groups say the ruling will level the playing field between online retailers and small local businesses, but others argue that it could hurt smaller online stores that don't already collect state sales taxes.\nPlay\nCell phone privacy\nIn a major Fourth Amendment case, the Court ruled that police officers need to get a warrant to access location data stored by wireless companies, which advocates called a major move in favor of the expectation of privacy when it comes to information collected by cell phones.\nIn this case, police asked a wireless provider to share location data on a man who was under investigation for robbery and gun offenses and said they didn't need a warrant because the source of the information was a third party. But the Court said there should be a higher bar for law enforcement to access location data and that police generally need a warrant.\nABC News' Supreme Court contributor Kate Shaw said the decision is part of a larger trend where the Court works to reconcile changing technology and ideas about what information is private with the laws about what information the government can access.\nThe Court's decision said law enforcement do not always have to get a warrant in cases related to national security or in a real-time investigation, but the ruling means that the police have to show probable cause that cell phone data is important to an investigation before cell phone providers have to turn it over.\nPlay\nPublic sector unions\nIn another First Amendment-related case, the Court ruled that requiring public employees to pay union fees even if they disagree with the union violates the employees' free speech.\nAn Illinois state employee, Mark Janus, challenged nonmember fees charged by his union to pay for collective bargaining and other expenses. Janus said that he didn't agree with all of the union's political positions. The Court agreed with Janus and said unions can't require nonmembers to pay a fee because it could force them to subsidize speech they don't agree with.\nIn the decision the Court also said that public unions have to allow employees to \"opt-in\" to support the union instead of giving the option to \"opt-out\" of having fees taken out of their paychecks.\nUnion groups said the decision was a political attack against unions. The ruling could be a major blow to funding for unions that advocate for public employees like teachers.",
    "source_domain": "abcnews.go.com",
    "title": "The Supreme Court's biggest rulings of 2018",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/supreme-courts-biggest-rulings-2018/story?id=56364077"
}