{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-05-31 02:56:52+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A second person of interest is still being sought.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fwoman-charged-murder-connection-deputys-death%2Fstory%3Fid%3D55535099.json",
    "image_url": "https://s.abcnews.com/images/US/steven-wiggins-02-as-ht-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A woman has been charged with murder in connection to the shooting death of a Tennessee sheriff's deputy during a traffic stop.\n\"Our hearts shattered with this,\" Dickson County Sheriff Joe Bledsoe said at a news conference this afternoon.\nThe deputy who was killed has been identified as Sgt. Daniel Scott Baker, who started with the department 10 years ago and was also a member of the U.S. Marine Corps Reserve.\nErika Castro-Miles was charged with first-degree murder and is being held at the Dickson County Jail, according to the Tennessee Bureau of Investigation. Officials are still searching for a second person of interest in Baker's death, identified by the TBI as Steve Wiggins.\nNEW: She was detained earlier today, but TBI has now arrested and charged this Dickson woman with First Degree Murder in the ongoing investigation into the death of Sgt. Daniel Baker. MORE: https://t.co/iYd0M0DR6u pic.twitter.com/ORaTeePofG — TBI (@TBInvestigation) May 31, 2018\nWiggins is an acquaintance of Castro-Miles, according to the TBI.\nBledsoe said that Baker moved up through the ranks and was \"one of our best deputies.\"\n\"He's one of the guys that puts it on the line every day to keep our community safe,\" Bledsoe said of Baker, who is survived by a wife and daughter.\nDickson County Sheriffs Office\nThe TBI wrote on Twitter that Wiggins is \"believed to be armed and dangerous,\" and called for the public's help to find him.\nNEW PICTURE: Here's a more recent photograph of Steven Wiggins, from a 2017 arrest in Williamson County. pic.twitter.com/qDSMgKBNMN — TBI (@TBInvestigation) May 30, 2018\nBledsoe said that Baker came into contact with Wiggins after he responded to a call about a suspicious vehicle.\nTennessee Bureau of Investigation\nActing TBI Director Jason Locke said that when Baker didn't check in after the call, attempts were made to track him and his vehicle down using GPS.\nThe vehicle was found in a wooded area, two miles away from the location of the original suspicious vehicle call, Locke said, adding that video from the area confirmed to authorities that Wiggins is connected to Baker's death.\nWiggins has been added to the state's Top 10 Most Wanted list along with a $7,500 reward for information.\nNEW PICTURES: Here are pictures of tattoos Steven Wiggins has on his arms and shoulders. Again, if you spot him, do not confront him. Call 911 immediately! MORE DETAILS: https://t.co/cBhAwnXcZI pic.twitter.com/tZ80EmUyqO — TBI (@TBInvestigation) May 31, 2018\nTBI records show that Wiggins is 31 years old and has previously been arrested for multiple cases of assault and domestic assault, as well as cases involving aggravated kidnapping, false imprisonment, leaving the scene of an accident, unlawful possession of a weapon and theft.\n\"Even though our hearts [are] broken, we're driven right now with a focus and resolve that this person is captured,\" Bledsoe said.",
    "source_domain": "abcnews.go.com",
    "title": "Woman charged with murder in connection to deputy's death",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/woman-charged-murder-connection-deputys-death/story?id=55535099"
}