{
    "authors": [
        "Abc News",
        "More Kendall"
    ],
    "date_download": "2018-07-04 09:46:42+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Jacobi Crowley is running for Oklahoma state Senate District 32.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fteacher-walkout-ballot-box-26-year-hopes-ride%2Fstory%3Fid%3D56305950.json",
    "image_url": "https://s.abcnews.com/images/Politics/jacobi-crowley1-ht-mem-180702_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Fresh off a Tuesday primary win, Jacobi Crowley — at the spry age of 26 — was heading to Fort Sill, a military base in his hometown of Lawton, Oklahoma, after accepting an invitation for a simulation tour of the post’s STEM education program.\nCrowley captured the Democratic nomination for Oklahoma state Senate District 32 on June 26 and if he wins the general election in November, he will be the youngest state senator in the Sooner state’s history, according to John Mahoney at the National Conference of State Legislatures.\nCrowley’s win would mark a major victory for both millennial and African-American candidates eyeing an entry into politics.\nThe young nominee has lived in Lawton all of his life, aside from the years he spent at Southeastern Oklahoma State University pursuing a degree in special education. Now, a zealous crisis interventionist in Lawton Public Schools, as well as a football coach and ordained minister, Crowley is only one crest of a wave of teacher candidates running for office in 2018.\nEarlier this year, thousands of educators revolted at the state capital in Oklahoma City to protest a decade of steep cuts to education funding by a GOP-controlled legislature.\nSue Ogrocki/AP\nAfter the nine-day walkout, the stunning show of activism morphed into a groundswell of teachers declaring candidacies for the 2018 ballot to unseat the very lawmakers that challenged their efforts to restore education funding.\nOf the 112 educators who filed for local, state and federal office in the state — as identified by the Oklahoma Education Association as former and current educators and administrators, and, candidates with an immediate relative that is an educator — seventy-one teachers made it through their primary elections, either by winning outright or moving to a runoff.\nAmong them is Crowley, who is running for a seat vacated by term-limited state Senator Randy Bass, the current Democratic Floor leader.\nBut he is not new to the electoral process. Crowley made an unsuccessful bid for state House District 64 in 2016. This cycle, his prospects look much more favorable: the district is a Democratic stronghold that Bass held for over the last decade.\n\"I’m running on things that truly affected my life and that truly affected a lot of people’s lives in the state,\" he told ABC News.\nJacobi Crowley/Facebook\nCrowley is campaigning on a platform that is pro-education and pro-criminal justice reform, two issues he views as very much intertwined and pivotal in own life.\nHe is set to face Republican state Rep. John Montgomery in November, who said of his own campaign, \"There are a number of issues that Oklahomans want addressed in addition to having a fighter for our children, and I am excited about sharing solutions and getting feedback as we go forward.\"\n'He always stood out as a leader'\nThroughout his life, one permeating thought guided Crowley on a path that led him to graduate from high school, earn a bachelor’s degree, work in an alternative school in Lawton, help with Eisenhower High School’s football team, become an ordained minister in his church, and now, seek political office in Oklahoma.\nThat thought is this: \"I work in an alternative school. I see the third grade cycle of they can’t read by the time they get to third grade. They get into the educational system, they act up, they have to come to me. I’m trying to put some life into them but they've never been told they can be anything. They’ve never been told they can amount to anything. And so what happens is the negative influences that are in their life take over.\"\nCrowley himself, in a lot of ways, contented with this notion his whole life — battling the negative forces that could have taken over.\nIt all began in his earliest years when reading and learning his ABC’s led him to be labeled as having a reading disability — a result of being raised by a grandmother who simply didn’t know to teach him.\nA young kindergarten-aged Crowley had to work with his aunt every day to learn the tune, which he said put him \"behind the curve.\"\nJacobi Crowley/Facebook\nAs the child of a single parent, he saw first-hand the \"struggle\" that comes with it, describing it as \"especially\" more difficult in a \"single parent black household.\"\n\"My mom did all that she could and all that she knew in order to provide for me and my brother,\" he said. \"I have some great women in my life that developed me into becoming the man that you see today.\"\nAt the age of eight, his childhood was marred by the death of his grandmother, a key figure for an impressionable Crowley.\n\"When I turned eight years old, that’s when my whole world changed,\" Crowley said. \"That’s when I had to grow up because I didn’t have my grandmother anymore.\"\n\"My grandmother taught me to be very strong, very precise in what I wanted, and be goal-oriented,\" he continued. \"As an eight-year-old, that’s what I did. And I kept doing things within my life, moving forward, and I always wanted to be somebody and do something with my life.\"\nCrowley strived to never let the negative influences seize any part of his life, instead, he worked harder \"than other people,\" he said, because the stakes were simply too high for him.\n\"I had to go get my degree to not be the status quo,\" he conceded. \"Out of my family, all the males have been locked up, except for a few. All the males have. In my family alone. I’m one of the first that didn’t go through that cycle.\"\nAfter college, Crowley made perhaps his most consequential decision of all: he returned to Lawton. He currently works with many kids in the community, including his own 18-year-old brother, Mark Berry Jr., through school, football and ministry.\n\"[I got] a degree in special education and now I am able to first, understand what is going on with these students and second thing, help them, teach them, mold them, to be young, successful men and women,\" Crowley said.\n\"He sees a lot of himself in those kids,\" Crowley’s family friend and fellow church member, Kimberly Jones, said. \"[He] really wants to make sure every kid will have an opportunity and go to college.\"\nJacobi Crowley\n\"They look up to him,\" she added. \"He has always stood out as a leader.\"\nCrowley’s political aspirations, while early to him, don’t seem that sudden, brazen or unwarranted.\n\"I never thought that I would get into politics this early,\" he admitted. \"But it’s time for now — my people need me. My community needs me. My state needs me.\"\n'We’re going to run different'\nHis theory is that by having \"real\" conversations about the pervasive issues in Oklahoma and the ones that have touched his own home — and listening to both sides — voters will show up to the polls.\nAs Oklahoma made the most dramatic cuts to education funding since the 2008 recession — decreasing funding per student by 23.6 percent, according to the Center for Budget and Policy Priorities, at the same, the state also ranked second in the nation for overall incarceration in 2016, according to the Oklahoma Department of Corrections.\nFor Crowley, these issues are first and foremost. He said he sees too often the cycle of incarceration breaking up families, even his own, and he’s plagued with anxiety over his brother’s future.\n\"It troubles me to see my brother who is 18 years old — if he makes key decisions in a negative way, he can be in a jail cell,\" he reflected. \"Quicker than anyone else. Because the first thing is the color of your skin.\"\nJacobi Crowley\n\"You can’t talk about economic diversity, you can’t talk about community awareness, you can’t talk about really even education when you’re breaking up families,\" Crowley lamented.\nStarting with his own community, Crowley said he aims to \"do more\" so others will see education as the first \"stoplight\" before young boys and girls become more incarcerated criminals.\n\"By doing more, I came to the decision of running for state Senate,\" he said. \"We’ve seen it on Tuesday — people really want to see something done in their community.\"\nBut Crowley’s most challenging hurdle is a stark reality for all Democrats this cycle: falling voter turnout.\nA new Pew Research study found that while the youngest generations, including Generation X, Millennials, and the post-Millennial generation, make up of the bulk of eligible voters in 2018, if turnout outcomes from the 2014 midterms persist, they are less inclined to comprise of the majority of voters who cast ballots this November.\n2018 has seen some exceptions for young political newcomers, like Alexandria Ocasio-Cortez or Stacey Abrams, who tapped into a dormant part of the electorate and emerged victorious in their primaries. Much like them, Crowley said he believes there is an awakening happening in the country.\n\"The last election — the presidential election as well as this election coming forward — a lot of people awakened,\" he said.\n\"It’s looking pretty good,\" he affirmed. \"I’m young, black and a Democrat. I want to be viewed different so we’re going to run different.\"\nJacobi Crowley/Facebook\n\"Town halls are good — but today, a lot of people are intimidated by that,\" he asserted. \"It’s always good to meet people where they’re at.\"\nSo he is out shaking hands, knocking on doors, riding the city transit bus to talk to voters during their commutes. He’s coming to them, telling them, it's \"now or never\" for change.\n\"If you want change, he is the right one to go to,\" Berry said after casting his ballot for the first time with his brother by his side.\nCrowley explained: \"This is the campaign of the people, this is the campaign of my community.\"",
    "source_domain": "abcnews.go.com",
    "title": "From the teacher walkout to the ballot box, a 26-year-old hopes to ride momentum to historic win",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/teacher-walkout-ballot-box-26-year-hopes-ride/story?id=56305950"
}