{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 10:07:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "The Latest: Major funds pressure companies over climate",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Flatest-climate-activists-protest-intl-climate-summit-51733658.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_9bc7ca05601245bf999ebf1510fea291_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the climate summit taking place in Paris (all times local):\n10:55 a.m.\nA group of 225 investment funds managing more than $26 trillion in assets says they are going to put pressure on companies to curb their greenhouse gas emissions and disclose climate-related financial information.\nThe group, which includes the California Public Employees' Retirement System, the largest U.S. public pension fund, says it will focus on 100 of the world's largest corporate greenhouse gas emitters.\nThe Climate Action 100 group made the announcement Tuesday at a climate summit in Paris marking the second anniversary of a United Nations accord to limit global warming.\nAnne Simpson, investment director of sustainability at CalPERS, said getting major energy and transportation companies to align their future plans with the goals of the 2015 Paris accord could spur action across all sectors as companies seek to avoid being \"left behind\" by investors.\n———\n10:05 a.m.\nGermany's Angela Merkel, who was once labeled the 'climate chancellor' for her efforts to curb global warming, has faced domestic criticism for failing to attend the summit in Paris.\nAnnalena Baerbock, a spokeswoman on climate issues for the opposition Green party, said Tuesday that French President Emmanuel Macron appears to be overtaking Merkel as Europe's leading lobbyist on climate issues.\n\"I think that's not a good sign,\" Baerbock told public broadcaster Deutschlandfunk. The Greens' lawmaker said Germany has lost international credibility on the issue by allowing its carbon emissions to stagnate over the past decade and refusing to join a recent international declaration on ending the use of coal, one of the most polluting fossil fuels.\nBaerbock said Europe's biggest economy also could have sent a signal on climate financing — a major topic in Paris — by declaring that civil servants' pensions wouldn't be invested in fossil fuels companies anymore, as some countries have already done.\n———\n9:55 a.m.\nTop world officials have opened a climate summit in Paris by saying investors and the entire global financial system need to shift faster toward energy and businesses that don't worsen climate change.\nThe prime minister of the island nation of Fiji said \"we are all in the same canoe,\" rich countries and poor. Opening the summit, Frank Bainimarama said \"financial pledges need to flow faster through more streamlined systems and make a difference on the ground.\"\nJapan's Foreign Minister Taro Kono described ways Japan is investing in climate monitoring technology and hydrogen energy, but acknowledged \"we have to do more and better.\"\nFrench Foreign Minister Jean-Yves Le Drian said Tuesday's summit is aimed at making efforts to cut emissions more \"credible.\"\nThe summit, co-hosted by the U.N., World Bank and French President Emmanuel Macron, is being held on the second anniversary of the Paris climate accord, ratified by 170 countries.\n———\n9:50 a.m.\nActivists pretending to represent a massive wave of oil are holding a protest in Paris at the start of an international climate summit.\nA few hundred protesters demonstrated Monday in front of the domed Pantheon monument on Paris' Left Bank as hundreds of world leaders, financiers and others gathered across town for the summit. The protesters unfurled a massive sheet and carried a huge banner reading \"Not one more euro for energies of the past.\"\nCEOs of banks and energy companies are joining more than 50 heads of state at the summit, which is aimed in part at speeding up investment in energy that doesn't damage the climate.\nFrench President Emmanuel Macron hosted leading world philanthropists Tuesday morning to encourage more climate-related investment.\n———\n8:15 a.m.\nMore than 50 world leaders are gathering in Paris for a summit that President Emmanuel Macron hopes will give new momentum to the fight against global warming, despite U.S. President Donald Trump's rejection of the Paris climate accord.\nSome 3,100 security personnel are fanned out around Paris for Tuesday's event, including extra patrol boats along the Seine River. Macron will accompany the visiting leaders to the summit site on a river island by boat.\nSean Penn, Arnold Schwarzenegger and Elon Musk are among prominent figures joining the world leaders at the summit, which marks the second anniversary of the Paris accord.\nParticipants are expected to announce billions of dollars' worth of projects to help poor countries and industries reduce emissions.\nMacron, who's also using the event to raise his international profile, did not invite Trump.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Major funds pressure companies over climate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/latest-climate-activists-protest-intl-climate-summit-51733658"
}