{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 09:08:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Most Asian markets gain after new Wall Street high",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fasian-markets-gain-wall-street-high-45502514.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/asian-markets-gain-wall-street-high-45502514",
    "language": "en",
    "localpath": null,
    "maintext": "Most Asian stock markets rose Wednesday after U.S. benchmarks hit new highs and Federal Reserve chair Janet Yellen said the U.S. central bank could raise interest rates as soon as next month.\nKEEPING SCORE: Tokyo's Nikkei 225 index rose 1 percent to 19,437.98 and Hong Kong's Hang Seng jumped 1.1 percent to 24,961.29. Sydney's S&P-ASX 200 gained 0.9 percent to 5,809.10. Seoul's Kospi added 0.5 percent to 2,083.86. The Shanghai Composite Index slipped 0.2 percent to 3,208.31 and India's Sensex dropped 0.6 percent to 28,158.79. Benchmarks in New Zealand and Taiwan rose, while Southeast Asian markets declined.\nWALL STREET: U.S. stock indexes hit new highs, boosted by bank stocks on hopes of bigger profits ahead. General Motors jumped 4.8 percent following news that France's PSA Group, maker of Peugeot and Citroen cars, is exploring a deal to buy Opel, GM's money-losing European business. Cynosure, which makes devices used in laser body contouring, hair removal and skin care, soared after agreeing to be bought by medical device maker Hologic for $1.57 billion. The Standard & Poor's 500 index rose 0.4 percent to 2,337.58 for its sixth straight day of gains. The Dow Jones industrial average rose 0.5 percent to 20,504.41. The Nasdaq composite rose 0.3 percent to 5,782.57.\nFED WATCH: Yellen told a Senate committee the central bank could raise interest rates as soon as next month. Bond yields jumped and fed through to shares of banks, which can benefit from higher rates by charging more for loans. Yellen said little to alter most investors' expectations. The Fed raised interest rates in December for just the second time in a decade, and Yellen said the strengthening job market and a modest move higher in inflation should warrant continued, gradual increases.\nANALYST'S TAKE: Yellen's comments were \"the main catalyst for overnight markets, evidently surprising on the hawkish side,\" said Jingyi Pan of IG in a report. \"While the market had expected a strong rhetoric on improving economic conditions, the push to hasten the next rate hike had been unexpected.\" Based on history, markets put the likelihood of a policy change out of the Fed's March meeting at 34 percent, Pan said, \"but that had not stopped the U.S. dollar and equity markets from ticking up.\"\nCHINA INFLATION: Chinese consumer and wholesale inflation ticked higher, fueling concern the central bank might hike rates or tighten access to credit. Analysts said they saw no sign the People's Bank of China would change course but money market rates should be elevated this year. Policymakers have indicated a \"tightening bias\" for policy since late last year but December and January data on credit \"clearly show that there has been no meaningful monetary and credit tightening at the macro level,\" said UBS economists in a report.\nCURRENCY: The dollar gained to 114.38 yen from Tuesday's 114.31 yen. The euro edged up to $1.0577 from $1.0571.\nENERGY: Benchmark U.S. crude sank 35 cents to $52.85 per barrel in electronic trading on the New York Mercantile Exchange. The contract gained 27 cents on Tuesday to $53.20. Brent crude, used to price international oils, lost 27 cents to $55.70 in London. It advanced 38 cents the previous session to $55.97.",
    "source_domain": "abcnews.go.com",
    "title": "Most Asian markets gain after new Wall Street high",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/asian-markets-gain-wall-street-high-45502514"
}