{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:22:13+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fwynn-resorts-posts-1q-loss-legal-settlement-charge-54705889.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/wynn-resorts-posts-1q-loss-legal-settlement-charge-54705889",
    "language": "en",
    "localpath": null,
    "maintext": "Wynn Resorts reported a first-quarter loss on Tuesday, its bottom line weighed by a nearly $465 million charge link to a legal settlement.\nBut after stripping away that one-time expense, it comfortably beat Wall Street's profit expectations, boosted by its gambling business in Macau even as the company grappled with sexual misconduct allegation forced the ouster of CEO Steve Wynn.\nThe company's new CEO, Matt Maddox, said he was \"as excited as ever about the future prospects of this company.\" He said the company had seen \"no degradation of business\" during a reporting period marked by the scandal.\nWynn Resorts in March settled a 6-year-old legal battle with a Tokyo casino game maker and its U.S. unit over the forced redemption of their shares in the company. It agreed to pay $2.4 billion to Universal Entertainment Corp., which previously held an almost 20 percent stake in Wynn Resorts through its subsidiary Aruze USA Inc.\nThe company blamed expenses related to the settlement for the loss of $204.3 million, or $1.99 a share, in the three-month period that ended March 31. A year ago it earned $100.8 million, or 99 cents a share.\nIts profit, adjusted for non-recurring costs, was $237.0 million, a 45 percent rise from $130.9 million in the same period of 2017, the company said in its first earnings report since the sexual misconduct scandal broke in January. The adjusted earnings came to $2.30 per share, topping analyst expectations for $1.96 per share, according to Zacks Investment Research.\nWynn resigned as chairman and CEO and later sold his company shares after the Wall Street Journal reported that several women said he harassed or assaulted them and that one case led to a $7.5 million settlement. He denies the allegations. He has filed a defamation lawsuit against The Associated Press for its reporting on a separate allegation made to police.\nThe company's earnings report came a day after Wynn's ex-wife, who is also the biggest shareholder and co-founder of Wynn Resorts, announced she was seeking the removal of one of the company's directors overseeing an internal investigation into the sexual misconduct allegations. Elaine Wynn said in a filing Monday with U.S. regulators that John Hagenbuch is allied too closely with Steve Wynn, and asked shareholders to reject his re-election.\nIn a statement in response to Elaine Wynn's letter, the company noted its decision last week to add three women directors to its board but did not directly address Hagenbuch's status.\nThe final piece of the company's long-running legal battle also ended earlier this month with Wynn agreeing to pay his ex-wife $25 million in a settlement. Elaine Wynn had joined the dispute alleging that had been unfairly removed from the board by her ex-husband and others in 2015 because of her inquiries into company activities.\nWynn Resorts said Elaine Wynn dropped claims against it, and the company made no payment under the agreement.\nFirst-quarter revenue jumped at both of the company's casinos in Macau, the Chinese enclave where regulators have been inquiring about the sexual misconduct allegations.\nBut in fallout over the scandal, Maddox cast doubt on the future of a casino under construction in Massachusetts. Gambling regulators in the state are conducting a review to determine where Wynn Resorts should continue to hold the state's only greater Boston casino license.\nMaddox said the company remains excited about the Massachusetts market but would to take \"hard look\" at the $2.5 billion project if there were indications that \"contagion\" from the controversy was affecting the rest of its business.\nThe company says it expects the Wynn Boston Harbor resort to open in mid-2019.\nIts stock was down 2.3 percent to 185.6 in after-hours trading after the earnings report.\n—————\nElements of this story were generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on WYNN at https://www.zacks.com/ap/WYNN",
    "source_domain": "abcnews.go.com",
    "title": "Wynn Resorts posts 1Q loss on legal settlement charge",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/wynn-resorts-posts-1q-loss-legal-settlement-charge-54705889"
}