{
    "authors": [
        "Abc News",
        "More Veronica"
    ],
    "date_download": "2017-08-14 14:24:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Merck CEO resigns from Trump's manufacturing council over president's remarks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fmerck-ceo-resigns-trumps-manufacturing-council-citing-presidents%2Fstory%3Fid%3D49205186.json",
    "image_url": "http://a.abcnews.com/images/Politics/frazier-gty-er-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Merck CEO Kenneth Frazier announced Monday that he's resigning from the president's American Manufacturing Council amid the ongoing criticism over the president's remarks on the weekend protests in Charlottesville, Virginia.\nFrazier said in statement that as a \"matter of personal conscience, I feel a responsibility to take a stand against intolerance and extremism.\"\n\"America's leaders must honor our fundamental values by clearly rejecting expressions of hatred, bigotry and group supremacy, which run counter to the American ideal that all people are created equal,\" Frazier said.\nThe president responded on Twitter, slamming the pharmaceutical executive's decision.\nNow that Ken Frazier of Merck Pharma has resigned from President's Manufacturing Council,he will have more time to LOWER RIPOFF DRUG PRICES! — Donald J. Trump (@realDonaldTrump) August 14, 2017\nOn Saturday, Trump said the hatred, bigotry and violence in Charlottesville needs to end on \"many sides.\"\nHe was summarily criticized for not directly condemning white supremacy and extremist groups.\nA White House official said on Saturday the president was \"condemning hatred, bigotry and violence from all sources and all sides\" when asked what Trump meant when he condemned the \"many sides\" involved in the Charlottesville rally.",
    "source_domain": "abcnews.go.com",
    "title": "Merck CEO resigns from Trump's manufacturing council over the president's remarks on Charlottesville",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/merck-ceo-resigns-trumps-manufacturing-council-citing-presidents/story?id=49205186"
}