{
    "authors": [
        "Abc News",
        "Conor Finnegan",
        "More Tara",
        "More Conor"
    ],
    "date_download": "2018-05-30 17:34:16+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Key senators say Susan Thornton is too soft on North Korea and China.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftop-us-diplomat-asia-ropes-ahead-north-korea%2Fstory%3Fid%3D55532280.json",
    "image_url": "https://s.abcnews.com/images/Politics/susan-thornton-gty-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The fate of the U.S.'s top diplomat for Asia remains in limbo two weeks ahead of the expected historic summit with North Korea.\nInterested in North Korea? Add North Korea as an interest to stay up to date on the latest North Korea news, video, and analysis from ABC News. Add Interest\nIn one of his first major personnel moves as secretary of state, Mike Pompeo is expected to withdraw the nomination of Susan Thornton for Assistant Secretary of State for East Asian and Pacific Affairs, three sources with knowledge of the matter told ABC News.\nThornton is a career Foreign Service officer with 20 years of experience in the region who has been the acting Assistant Secretary since March 2017. Former Secretary of State Rex Tillerson was a fierce proponent of hers, battling China hawks in the administration and on Capitol Hill to get White House approval for her nomination in December.\nMichael Reynolds/EPA via Shutterstock\nDespite her pending nomination and current role, Thornton has been largely sidelined from North Korea negotiations compared to other senior administration officials. She traveled to China and Japan in May to meet her counterparts, but she did not accompany Pompeo on either of his trips to North Korea to meet Kim Jong Un. She also did not join Pompeo for his Wednesday trip to New York where he was set to meet with Kim Yong Chol, a top adviser to Kim and Vice Chairman of the Central Committee.\nOne former administration official said Thornton has been “totally cut out” of talks.\nState Department spokesperson Heather Nauert did not elaborate on her role, only telling ABC News “Susan Thornton remains the nominee and is a respected member of the State Department team. The secretary has met with her numerous times to seek her counsel.”\nBefore Pompeo's confirmation as secretary of state, he used CIA channels to start talks with North Korea and has since relied on a small coterie of advisers. That team includes National Security Council Director for Asia Matthew Pottinger and the State Department's Policy Planning Director Brian Hook, Executive Secretariat Lisa Kenna, and spokesperson Nauert – all of whom traveled with Pompeo in May.\nOther officials, including the National Security Council's Director for Korea Allison Hooker, Assistant Secretary of Defense for East Asia Randall Schriver, State Department Korea Desk Director Mark Lambert, and U.S. Ambassador to the Philippines Sung Kim, have been involved in planning meetings with North Korea ahead of the summit.\nThe ambassador posting in South Korea has been vacant for 16 months. President Donald Trump nominated Navy Adm. Harry Harris for the position on Saturday but he is nowhere near being confirmed before the summit.\n\"I think it's going to lead to a position where we have no experts at the table, no one who has weighed in over the course of the situation,\" said foreign policy expert Brett Bruen, who worked as a State Department official for 12 years.\n\"There's no medium or long-term memory that has been built up over the last year and a half. From a national security perspective, on North Korea, Iran, any other major threat, we are flying blind,\" he added.\nTillerson and Thornton had a good working relationship, with Tillerson publicly praising her and privately going to the mat to secure her nomination. His aides also believed that promoting a career diplomat to the position typically allotted to political appointees would boost morale within the department.\nBut Thornton faced resistance from critics like former White House chief strategist Steve Bannon, who said he was \"getting Susan Thornton out at State\" in his last interview while working for the administration.\nChip Somodevilla/Getty Images, FILE\nKey Republican senators like Marco Rubio and Tom Cotton say she is too soft on North Korea and China.\nHer nomination process has slowed to a crawl on Capitol Hill. After a confirmation hearing in February, the Senate Foreign Relations Committee has not held a vote on her nomination, and Rubio has vowed to block her approval.\n\"I will do all I can to defeat the current nominee for top Asia diplomat,\" he tweeted in March. \"This position needs to be held by someone who understands we need to rebalance our relationship with China, support Taiwan & defend human rights.\"\nSources with knowledge of the matter say that Pompeo is considering Adm. Scott Swift and the Pottinger from the National Security Council as possible replacements, but he will not withdraw Thornton's name until after the potential summit in Singapore.\nAs a career diplomat, Thornton is expected to be reassigned to an ambassadorship in the region, possibly to Singapore where the Trump administration nominated and then withdrew former Deputy National Security Adviser K.T. McFarland after details emerged about her role in the Trump campaign’s contacts with Russian officials.\nPompeo hinted at the shakeup at a hearing on the Hill last week saying he was \"close to making a number of significant announcements about new members of the team, Assistant Secretary for East Asia Affairs and South Asia among them.\"\nAs the administration closes in on trade talks, the president appears to be taking a tougher line on China again. On Tuesday, the White House announced that the administration will go through with Trump's threat to place $50 billion worth of tariffs on Chinese goods.",
    "source_domain": "abcnews.go.com",
    "title": "Top US diplomat for Asia on ropes ahead of North Korea summit",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/top-us-diplomat-asia-ropes-ahead-north-korea/story?id=55532280"
}