{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:39:49+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Hurdles expected for Utah's medical marijuana research law",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fhurdles-expected-utahs-medical-marijuana-research-law-48037012.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_48f1e9a5b49e48efa6ce28b3b71a9aef_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Utah lawmakers balked again this year at joining more than half of all U.S. states and passing a broad medical marijuana law.\nInstead, they gave state colleges and other institutions a green light to study the medical impacts of the drug with the hope of having comprehensive data by next year.\nThe move, however, glossed over the fact that the studies would likely take years, requiring scientists to navigate layers of bureaucracy that can delay and even discourage research.\nThe slowdown is due to marijuana being considered a Schedule I drug by the federal government, meaning it's listed along with heroin and peyote among the most dangerous drugs.\nNo other U.S. state is taking the research-before-legislation route because they realize it is futile, said Jahan Marcu of Americans for Safe Access, a national medical cannabis advocacy group.\n\"It's never been shown to work in the past, so we are not confident that it's going to serve the needs of patients,\" he said of the process.\nA recent report from the National Academies of Sciences, Engineering and Medicine recommended that the gaps in understanding medical cannabis be filled through a national research agenda.\nKaren Wilcox, chair of the University of Utah's pharmacology and toxicology department, has spent about 18 months studying how cannabidiol — a derivative of cannabis — can affect seizures. The application process alone took six months.\n\"It just takes a lot of time and effort to fill out all the paperwork,\" she said. \"It's a nightmare.\"\nResident Doug Rice said Utah's research-before-legislation approach means his daughter, who has a genetic condition, is missing out on the one drug that completely eliminates her frequent seizures.\nThe wait for legalization has sent Rice on regular trips to Colorado to get cannabis to treat his 24-year-old daughter Ashley.\nNearly every drug they've tried, including cannabidiol, has failed to stop all of her seizures. Rice said the only time his daughter has a completely seizure free day is when he takes her to Colorado, where marijuana is legal, and gives her cannabis twice a day.\n\"Epilepsy is a deadly disease,\" he said. \"Every seizure takes away a little bit of her brain.\"\nLawmakers and advocates have pushed for the drug to be declassified and grouped with such drugs as cocaine and opiates, which have medical uses but are still illegal for recreational use.\nThe change could make it easier to study and prescribe marijuana, but the Obama administration decided against it last year.\nResearchers now have to file applications with multiple federal agencies before they can request cannabis products from a university in Mississippi that remains the country's sole source of pot for federally approved research.\nEthan Russo, medical director at the clinical research organization Phytecs, is working on a Johns Hopkins University research project on how components of cannabis impact mood and memory. He said the research team submitted the proposal about a year ago and is still working to get funding approval from the National Institute on Drug Abuse.\nSo far, there are a handful of projects being considered at the University of Utah, including how cannabidiol impacts people who have autism and anxiety and its effect on post-traumatic stress disorder. But it will likely take years before any of those studies are completed.\nSteven Gust of the National Institute on Drug Abuse, said the application process keeps patients safe, and is the same for researchers who want to study any controlled substance.\nIt usually takes about two-and-a-half months to get a U.S. Food and Drug Administration application approved and complete the registration process with the Drug Enforcement Administration, according to agencies' websites.\nResearchers may also be expected to complete the National Institute of Health review process, which the agency said can take about 10 months if the researchers are requesting funding.\nThe Food and Drug Administration announced last year it was going to expand the number of entities that can legally grow marijuana for research purposes to make it easier for researchers.\nBut so far no institutions have signed on, according to Gust.\nThe University of Mississippi grows about 120 plants in its indoor facility, each of which takes about four months to mature, said Mahmoud ElSohly, a pharmaceutics professor at the University of Mississippi Research Institute.\nUtah already allows cannabidiol to be used by people with severe epilepsy, as long as they obtain it from other states. The extract has low levels of THC, the chemical responsible for most of marijuana's psychological effects.",
    "source_domain": "abcnews.go.com",
    "title": "Hurdles expected for Utah's medical marijuana research law",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/hurdles-expected-utahs-medical-marijuana-research-law-48037012"
}