{
    "authors": [
        "Abc News",
        "More Trish"
    ],
    "date_download": "2017-12-12 01:04:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Judge warns Manafort: Gag order 'applies to you'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fjudge-warns-manafort-gag-order-applies%2Fstory%3Fid%3D51727303.json",
    "image_url": "http://a.abcnews.com/images/Politics/manafort-gates-ap-rt-er-171121_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A federal judge scolded former Trump campaign chairman Paul Manafort Monday for his alleged role in the crafting of a recently-published opinion piece in a Ukrainian newspaper designed to burnish his image.\nJudge Amy Berman Jackson warned Manafort that her prior gag order “applies to you and not just your lawyer,\" but took no further action on the matter.\nAfter thanking the judge, Manafort's lawyer Kevin Downing took the opportunity — in a courtroom full of reporters — to take issue with “a torrent of negative press” against his client that “keeps rolling out again and again,” asking Jackson, “What is it we do” to counter that?\nJackson refused to give “advice,” on the situation, noting that \"negative press\" was also spreading about the prosecution, which was not raising complaints about it.\nShe further essentially accepted the defense’s previously-filed argument that any potential jury pool would be drawn from Washington, D.C. and not Eastern Europe, so no jury pool would be tainted — one of the underlying reasons for the Nov. 8 gag order. But the judge noted that the op-ed is “out there” on the internet and therefore widely available and easily shared on “Facebook, Twitter, or a blog.”\nThe judge warned all parties against any further efforts “to circumvent and evade” the gag order.\nMark Wilson/Getty Images\nThe prosecution, which accused Manafort of heavily editing the article, had previously argued that the collaboration was with an individual “assessed to have ties” to Russian intelligence, but there was no mention of that relationship at the hour-long status hearing on Monday at U.S. District Court for the District of Columbia.\nManafort, 68, and his long-time associate Rick Gates, 45, have both pleaded not guilty to charges filed Oct. 30.\nBoth Manafort and Gates have, through their attorneys, argued to be released from house arrest with GPS monitoring, but Jackson was still trying to evaluate Monday the properties and other sureties that each defendant is offering to back their individual bonds — $10 million for Manafort and $5 million for Gates.\nAn exasperated Downing said, “We just want this thing to get done,” adding that with such strict conditions on his confinement, “It’s been real difficult for Mr. Manafort to make a living.”\nBrendan Smialowski/AFP/Getty Images\nDowning then took another opportunity to defend his client, in broader terms, saying, with arms outstretched, “Some of the charges in this case, we just don’t get it. We just see it as failing to file some paperwork.”\nJackson, with an amused expression on her face, was unfazed as she asked questions about Manafort’s future plans for residency. No decisions were made on Monday regarding home confinement.\nThe judge made it clear both defendants would have to report their future whereabouts under any modified release terms, “even when the FBI is following you everywhere you go.”\nDespite the seriousness of the proceedings, the judge injected a bit of levity saying of Gates, who has yet to prove the value of his assets backing his bond, the court wants “to get out of the business of monitoring soccer practice.”\nGates is the father of young children and has recently taken on coaching duties for one of his children’s teams. Without his bond being verified as secure, each time he wishes to leave his home, he must obtain permission from the judge.\nThe next status hearing is scheduled for Jan. 16.",
    "source_domain": "abcnews.go.com",
    "title": "Judge warns Manafort: Gag order 'applies to you'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/judge-warns-manafort-gag-order-applies/story?id=51727303"
}