{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 20:42:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Anderson discusses giving back during the holiday season in his hometown of Compton, California.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fvideo%2Fanthony-anderson-shows-off-singing-skills-talks-golden-51723792.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/171211_view_anthony_1129_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Anthony Anderson shows off his singing skills, talks Golden Globes nomination\nThank hechbs Anthony Anderson is everywhere these days. He's on the sitcom \"Black-ish,\" in the new animated movie Ferdinand. He's straight outta the Compton Christmas parade and now he's here on \"The view.\" Please welcome Anthony Anderson. This is the second year in a row they have nominated you for \"Black-ish\" for the golden globes. Sl yes. It feels good. Nominations are good. You do want to win eventually. I'm not going to lie. Yes. It will happen. I think the nomination is the win. Not really. Not really. That's what losers say. Someone who's never been nominated. Those are your pregnant drugs talking now. Whoopi mentioned you're the grand marshal of the -- what is it? The Compton Christmas parade, the grand marshal. I'm from Compton. That was me a couple years ago. I fed 6,000 people in Compton. My family went out. That's nice. We have a foundation. I just woke up one morning in a giving mood. We've been so blessed. I went back to my old neighborhood with the help of Walmart. When you grew up were you middle class? Joy I grew up in Compton. There's no middle class in Compton. I grew up in the middle of the block. What were your christmas like? My christmass were fun. My parents -- you sacrifice for your kids. That's what we did. We never felt in need or want at Christmas time. Yeah. My father made sure of that. Wow. Speaking of your father but not really, speaking of your mother. We all are obsessed with Doris. Mama Doris. Mama Doris. Last time you were here. What a beauty. Thank you. You told us she was back on the dating scene. Yeah. Is there any movement on that front? Look at that picture you see my mom's bottom row of teeth. I have a gap at the top. My mama has a gap at the bottom. At the Christmas parade this year I interrupted my mom and she was talking to someone. She started smiling. I thought it was code. I was like what' up with this sucker next to you. I was like mama what? She's like sucker you don't even notice my new teeth. My mama got her whole grill done. She said I kept my gap. She took the gap from the bottom and put it on top. Why? I have no idea. I said mama why you taking the gap to the top? Si guess she was moving on up. She got a whole mouthful of teeth. She's happy. That's all that counts. That's all that counts. To all the fellas out there my mama can't take her teeth out but she's got new teeth. Anthony, you had a special musical -- It took people a while to get that joke. I got it. I was moving on. You had a special musical EP code of \"Black-ish.\" You've sang. You have an incredible voice. Were you nervous? No. I wasn't nervous. I'm an artist. Either I sound good or I sad bad. You're classically trained. If that's what you want to call it. Fake it until you make it. That was our premiere episode about June tenth. Celebrating the day the slaves were supposedly freed. I have classically trained in the opera. I feel like you're saying don't make me sing. I'm not saying don't make me sing. If you want me to I will. All right. If my TV mama Jennifer Lewis can get up here. She did. I can't be out done for her. I ain't gonna sing for no book. Classically trained. Just a little bit. We have to talk about your new movie Ferdinand it's based upon the classic kid's book we all know so well. You play a bull named bones who is scrawny. But he has your gap. He has my gap. Originally I was supposed to be Ferdinand when I was fat Anthony. Then I lost the weight so they made me bones. That's my story and I'm sticking to it. I play bones. I saw the movie for the first time yesterday at our premiere in Los Angeles. It's a very -- it's a great story. It's about, you know, anti bullying. It's about overcoming adversity and believing in yourself so others can believe in themselves and never judging a book by its cover. I think it's a great story for all families to see and take something from those movies. We need those messages right now. Yeah. I was bullied as a kid by Tom boy Terry. We cool now. Tom boy Terry reached out to me on Facebook. I was like is this Tom boy Terry who used to kick my ass. He's like that's me. She? Yes she. It was a girl. You've don't call no boy Tom boy Terry in Compton. What up Tom boy Terry. Sounds like the waltons. We'll send Tiffany haddish to get her. Thank you antd ahony. Ferdinand is in theaters December 18th. \"Black-ish\" is on ABC. We'll be right back. ???\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Anthony Anderson shows off his singing skills, talks Golden Globes nomination",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/video/anthony-anderson-shows-off-singing-skills-talks-golden-51723792"
}