{
    "authors": [
        "Abc News",
        "More Morgan"
    ],
    "date_download": "2018-04-24 18:55:02+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "A Toronto police officer has been praised by officials for how he was able to single-handedly apprehend the suspect without firing his weapon.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FNews%2Ftoronto-officer-praised-terrific-policing-arresting-van-attack%2Fstory%3Fid%3D54689033.json",
    "image_url": "https://s.abcnews.com/images/International/toronto-van2-ht-ml-180424_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Toronto police officer who confronted the man accused of plowing into pedestrians with a van Monday has been praised by officials for how he was able to apprehend the suspect without firing a single shot.\nDramatic video taken by an onlooker shows the moment the officer gets out of his unmarked vehicle in the middle of the street in northern Toronto and engages in a standoff with the suspect.\nBy that point, the suspect had allegedly rammed numerous pedestrians while driving down Yonge Street in the Canadian city's bustling North York neighborhood. The battered white van then turned onto Poyntz Avenue, where it finally stopped, police said. That's when the alleged driver got out of the vehicle and was confronted by a lone police officer.\nIn the video footage, the officer draws his firearm and can be heard repeatedly shouting at the suspect to \"get down\" amid a blaring siren.\nThe suspect, clad in black pants with a black jacket over a blue shirt, has also drawn an object and is seen in the video pointing it at the officer. The officer repeats his calls for the man to \"get down.\"\nThe suspect then repeatedly draws and aims the object at the officer.\nHandout via Storyful\nThe officer quickly reaches into his vehicle to turn off the siren and then draws his gun again.\n\"Come on, get down!\" the officer yells at the suspect.\n\"Kill me!\" the suspect shouts while pointing the object at the officer.\nThe officer responds, \"No, get down! Get down!\"\n\"I have a gun in my pocket,\" the suspect says, with the object still drawn in his hands.\n\"I don't care, get down!\" the officer responds.\n\"I have gun in my pocket,\" the suspect says again.\nHandout via Storyful\n\"Get down! Get down, or you'll be shot!\" the officer shouts as he slowly advances toward the suspect.\n\"Shoot me in the head!\" the suspect responds before starting to walk toward the officer with the object still in his hands.\nThe officer takes a few steps back and yells, \"Get down on the ground! Get down! Get down! Get down!\"\nAt this point, the suspect finally yields to the officer's commands and lays face down on the sidewalk.\n\"Hands behind your back!\" the officer shouts as he runs toward the suspect on the ground and handcuffs him.\nThe officer never fires his weapon in the entire encounter.\nHandout via Storyful\nThe suspect, identified by authorities as 25-year-old Alek Minassian of Toronto, was arrested and later charged with 10 counts of first-degree murder as well as 13 counts of attempted murder. So far, there's no indication that Minassian was armed with a gun, police said. It's not clear what the object that he was holding was.\nTen people were killed and 15 others were injured in Monday's attack, police said.\nThe officer in the video has been identified in the Canadian press as Const. Ken Lam, who apparently works in traffic enforcement. The Toronto Police Service has not publicly confirmed the officer's name and has declined media requests to interview him or his supervisor.\nHowever, Toronto Police Chief Mark Saunders praised how the officer handled the situation, without naming him.\n\"I can tell you it's directly related to the high-caliber training that takes place. The officers here are taught to use as little force as possible in any given situation,\" Saunders told reporters during a press conference Monday. \"The officer did a fantastic job with respect to utilizing his ability of understanding the circumstances and the environment and having a peaceful resolution.\"\nPremier of Ontario Kathleen Wynn said she watched the footage of the standoff and said it shows \"terrific policing.\"\n\"The way he behaved was pretty much an example of terrific policing,\" Wynn said at a press conference this morning.\nABC News' Malka Abramoff, Andrew Fies, Fergal Gallagher, Benjamin Gittleson, Erin Keohane, Tom Llamas, Dennis Powell, Kirit Radia and Gerry Wagschal contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Toronto officer praised for 'terrific policing' after arresting van attack suspect without firing shot",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/News/toronto-officer-praised-terrific-policing-arresting-van-attack/story?id=54689033"
}