{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:52:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "More questions than answers in death of North Korean royalty",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fquestions-answers-death-north-korean-royalty-45501696.json",
    "image_url": "http://abcnews.go.com/International/wireStory/questions-answers-death-north-korean-royalty-45501696",
    "language": "en",
    "localpath": null,
    "maintext": "It looks like a perfectly staged assassination, straight out of the pages of a spy novel: North Korean royalty Kim Jong Nam, the estranged, exiled half-brother of leader Kim Jong Un, falls ill at a Malaysian airport, complains of being sprayed with some sort of chemical, and drops dead.\nBut, as with many things about the alleged motives of cloistered North Korea, the unknowns currently far outweigh the certainties.\nA look at what officials are trying to piece together as they work to reconstruct one of the most audacious, mysterious assassinations in recent Asian history:\n———\nWHY NOW?\nThis is the big one: Motive.\nKim Jong Nam, a jovial, overweight gambler and playboy, had embarrassed Pyongyang before — he tried to sneak into Tokyo Disney; he criticized his half-brother — but he's been generally seen more as an annoyance than an existential threat to North Korea's stability.\nWhy would Kim Jong Un go through the massive logistical trouble — and potential embarrassment — of staging the risky assassination of a blood relation on foreign soil?\nWithout elaborating, South Korea's spy service told lawmakers Wednesday that the North had been trying to kill Kim Jong Nam for five years. Spy officials offered a single, shaky motive for the death: Kim Jong Un's \"paranoia\" over his estranged brother.\nBut the South's National Intelligence Service has a long history of botching intelligence on North Korea and has long sought to portray the North's leadership as mentally unstable.\nSome in Seoul wonder if Kim Jong Un might have become enraged when a South Korean newspaper reported last week that Kim Jong Nam tried to defect to the South in 2012. South Korea's spy service denied this, but it's still an open question: Could public speculation that a member of the exalted Kim dynasty wanted to flee to the hated South have pushed Kim Jong Un to order his brother's assassination?\n———\nWHY THE AIRPORT IN MALAYSIA?\nThere would seem to be easier, less public places to kill such a high-profile target.\nA possible explanation might be found in another nugget provided by South Korea's spy agency: China had long protected Kim Jong Nam and his family in their home base of Macau. Analysts have seen Beijing as looking to Kim Jong Nam as a potential leader should North Korea's regime collapse.\nWith security, presumably overseen by China, tight in Macau, could there have been a security gap in Malaysia that offered North Korean assassins an opportunity they couldn't have gotten elsewhere?\n———\nWHO ARE THE MYSTERY WOMEN?\nThe details of the attack itself are a tangled mess as of now.\nKim told medical workers that he'd been sprayed with a chemical, which brings to mind past attacks with poison-tipped pens linked to North Korean assassins.\nSouth Korea's spy agency says two women believed to be North Korean agents attacked Kim. They then reportedly fled. Japanese media quoted the government in Tokyo as saying those women may now be dead. None of this has been confirmed yet.\nStill, finding out who these women are and who hired them could go a long way to unlocking the mystery.\n———\nWHAT NEXT?\nNorth Korea has said nothing officially about the death, but that's not unusual. The country's propaganda specialists are masters at reporting only details that lionize the Kim family as paragons of virtue. This clearly doesn't do that.\nChina may be angry at the killing of a close North Korean contact, so there could be some sort of reaction, possibly back-channel, from Beijing.\nBut a more concrete punishment could come from Washington.\nCheong Seong-Chang, a South Korean analyst, said the assassination might convince the U.S. Congress to relist North Korea as a state sponsor of terrorism, further isolating the already widely shunned country.\n———\nAssociated Press writer Kim Tong-hyung in Seoul, South Korea, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "More questions than answers in death of North Korean royalty",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/questions-answers-death-north-korean-royalty-45501696"
}