{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 00:23:46+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Plus, Robin Roberts tests \"GMA\" audience members' stress levels, and the anchors discuss the phenomenon of beach spreading.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fgma-hot-list-avoid-counterfeit-solar-eclipse-glasses-49216388.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_hotlist_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'GMA' Hot List: How to avoid counterfeit solar eclipse glasses\nHere's your 62 hot lip from GMA today. Fred about the solar eclipse I. But can't because you gotta be careful you can't just look directly at it have you special glasses to avoid serious damage this is the waiting you can tell if you're using bailout less of everything should look black if you look at under watchful do you see that element there again to actually look at it that's how you know these are real. We'll find out how stressed our audiences do you consider yourself and workaholic who could write. Are you having trouble sleeping with their lot agrees what are you easily. Irritated. I. Irritated about our audience is pretty rich yeah. I'm glad that we're having this conversation. Phenomenon beach reading where people are literally like packing up their homes and going to the beach and issuing on vacation and the pool that someone picks up all they've you know that your dad can. It's not want my guess I'll admit they still three in the afternoon you love the look good too much about that somebody never. And that's the GMA hot list from today we'll see you in the morning on GMA.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'GMA' Hot List: How to avoid counterfeit solar eclipse glasses",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/gma-hot-list-avoid-counterfeit-solar-eclipse-glasses-49216388"
}