{
    "authors": [
        "Abc News",
        "More Aaron"
    ],
    "date_download": "2018-05-30 19:05:47+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Lawyers for President Donald Trump’s longtime personal attorney Michael Cohen say they are racing to review millions of files seized by the FBI in last month’s raids.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fmichael-cohens-legal-team-racing-review-materials-seized%2Fstory%3Fid%3D55538172.json",
    "image_url": "https://s.abcnews.com/images/Blotter/cohen-ap-er-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lawyers for President Donald Trump’s longtime personal attorney Michael Cohen are racing to review millions of files seized by the FBI in last month’s raids of his home, office and hotel room, but they say they are running out of time.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nIn a hearing in Manhattan on Wednesday, Judge Kimba Wood of the Southern District of New York set a deadline of June 15 to complete their review, despite strenuous objections from Cohen’s legal team.\nCohen’s lawyers said they have about 3.7 million files to sift through, but they are only about a third of the way to completion.\n“We are moving heaven and earth,” said Todd Harrison, one of Cohen’s attorneys. “We have people sleeping on couches. We are working around the clock.”\nSteven Ryan, Cohen’s lead counsel, told the judge “I need more time” and lobbied — unsuccessfully — for a mid-July deadline. The judge said she needed to balance the need for a careful review with the need to move the case forward and noted that the special master, who is also reviewing documents as they are produced by the government, had no problem “speeding up as necessary.”\nIf Cohen’s legal team is unable to complete their review, Judge Wood said she would assign any remaining material to a government “taint team,” a group of federal prosecutors not directly involved in the case, to decide what if any material is subject to the attorney-client privilege.\nElizabeth Williams/AP, FILE\nFederal prosecutors also revealed for the first time that among the items seized Cohen last months was a shredding machine, the contents of which are among the only items that the government has not yet turned over to the special master or Cohen’s legal team.\nFederal prosecutors declined to comment on whether they would try to reassemble the contents of the shredder before turning them over or whether the very existence of a shredding machine necessitated the search warrant out of fear Cohen was attempting to destroy evidence. In defending the raids, the Justice Department has previously expressed concern that “absent a search warrant, these records could have been deleted without record, and without recourse for the law enforcement.”\nThe hearing was otherwise dominated by Michael Avenatti, the firebrand attorney who represents adult-film star Stormy Daniels, whose real name is Stephanie Clifford. Avenatti has taken to Twitter in recent weeks to accuse both Cohen and Trump of various forms of corruption unrelated to the civil case Daniels filed against Trump in California, and he has sought to intervene in the federal case against Cohen in New York while using court appearances to continue his public crusade against them.\nAvenatti is not admitted to the bar in New York State, so he filed paperwork asking the judge to allow him to appear in court specifically for this case, but the judge made it clear that would she would not tolerate any attempts by Avenatti to seek “publicity” from his appearance in her courtroom.\n“You will not be able to use this court as a platform,” Judge Wood said. “Until you are admitted here I don’t expect you to be heard. I can’t control what you do outside.”\nEduardo Munoz Alvarez/Getty Images\nCohen's attorney Ryan accused Avenatti of self-interested grandstanding, saying Avenatti’s release of some of Cohen’s financial records amounted to a “premeditated drive-by shooting” of Cohen’s rights.\n“He is involved in ways that call attention to himself,” Ryan said in opposition to Avenatti’s motion to be admitted. “This is about the aggrandizement of a single attorney.”\nAn attorney for President Trump, Joanna Hendon, joined Cohen's in seeking to keep Avenatti out of the case, saying Avenatti “is prepared to be not straightforward” with the court and accusing him of being “cute” with the facts.\nAvenatti denied doing anything improper and complained about audio recordings of a conversation between Cohen and Daniels’ prior lawyer Keith Davidson that were leaked to the Wall Street Journal. Ryan, however, assured the judge that any audio tapes in his possession remain “under lock and key.”\nShortly after the hearing, Avenatti withdrew his application for admission without prejudice, meaning he could choose to renew the motion at a later time, though he does not appear to be stepping back from the case.\nHe took to Twitter on Wednesday afternoon, promising to continue to “bring the facts and evidence to the American people.”\nABC News’ James Hill and Josh Margolin contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Michael Cohen's legal team racing to review materials seized in FBI raids",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/michael-cohens-legal-team-racing-review-materials-seized/story?id=55538172"
}