{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:59:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "MLB mourns, feels 'powerless' in face of continuing tragedy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmlb-mourns-feels-powerless-face-continuing-tragedy%2Fstory%3Fid%3D45508094.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170124_mlb_yost_on_ventura_interview_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "How do you prevent a tragedy? What can you do? What can you say? What can you teach at a time when all of baseball is mourning?\nTwice in the past four months -- first following the death of? Miami Marlins?ace? Jose Fernandez, then again this weekend in the wake of the car crashes that took the lives of? Kansas City Royals?right-hander? Yordano Ventura and former major league infielder? Andy Marte -- these haunting questions have reverberated around a grieving sport.\nSadly, as always, there are so many more questions than answers.\nTragedy isn't unique to baseball.\n\"A lot of incredible, wonderful, amazingly talented people die every day,\" Marlins president David Samson found himself saying Monday. \"I'm not sure it's ever going to change.\"\nNearly four months have passed since Samson and the rest of his franchise awoke to the life-changing news of Fernandez's shocking death in a late-night boating accident. In Samson's mind and heart, the what-ifs still mix with the sadness. Neither ever fades into the background for very long.\nBut the what-ifs don't bring Fernandez, and his effervescent presence, back to life. And just as sadly, the Marlins have concluded, they don't shed nearly enough light on a question that has hung over them ever since: What can people in baseball do to prevent the next tragedy?\n\"In truth, we're powerless,\" Samson said. \"I feel that powerlessness every day. There's only one way to avoid every ill thing that can happen. And that's to never leave the house.\"\nIn baseball, however, that's not a lesson you can teach. Not today. Not any day. So for the people who run franchises touched by these heartbreaking events, the only way to move forward is to make sure no one forgets that young athletes aren't as invincible as they seem.\nThe? St. Louis Cardinals?are?another team that has been touched by the pain the Royals feel today. In 2014, the organization lost its brightest prospect, Oscar Taveras, in a fatal high-speed auto accident in the Dominican Republic. In 2007, pitcher Josh Hancock lost his life in another auto accident following a game in St. Louis. Alcohol was involved in both incidents.\nSo when general manager John Mozeliak addresses his players about the importance of making \"smart decisions,\" there is never a time, he said Monday, when he doesn't remind them of two former Cardinals whose regrettable choices had an impact on many lives beyond their own.\n\"Unfortunately, we don't know the details of [Sunday's] tragedies,\" he said. \"But I do know the details of Oscar's tragedy. A lot of things were involved in that crash -- alcohol, wet roads, speeding. Those are themes that are definitely brought up and spoken about when I talk with players.\"\nHancock, too, \"made some mistakes\" that cost him his life, Mozeliak said. And players need to be reminded that \"mistakes\" can have powerful repercussions.\n\"My point,\" he said, \"is that you have to think about the risks you're taking before you get behind the wheel. ... And you've got to understand what can happen.\"\nBut it isn't as if baseball only waits for its most tragic moments to teach lessons. MLB sends a delegation to all 30 spring training camps every year to hammer home these themes. Those meetings will resume this spring.\nEvery January, the sport gathers its brightest prospects for its annual Rookie Career Development Program, run jointly by MLB and the players' union. Part of that program involves inserting players into improvisational skits, directed with brilliantly realistic humor by the Second City corporate training program, which force them to make all sorts of difficult choices that await them just over the horizon.\nAnd a union official said Monday that leaders are already mulling ways to reemphasize the importance of making good \"lifestyle decisions\" in the aftermath of these most recent tragedies.\n\"So I feel like, in our industry, we're very proactive,\" Mozeliak said, \"in trying to be out in front of these situations. But unfortunately, there are limitations on what we can do.\"\nThose limitations exist for one simple reason: Because there's a world out there beyond the ballpark walls. And no team can totally control what players do beyond those walls.\nRemember, to live and play baseball in the United States, Jose Fernandez had to escape from Cuba. So he \"relished freedom,\" Samson said. Was it his team's place to dictate what he could do with that freedom when he wasn't playing? That's a difficult line to cross.\n\"We would never do that,\" Samson said. \"We would never take that freedom away from anybody, in the name of safety or in the name of conservatism. It's immoral. It goes against everything we believe in as a country.\"\nSo whatever concerns the Marlins may have had about the choices made by Fernandez -- or any other player once they walk outside the clubhouse door -- all they can do is advise those players about the impact those choices can make. But human beings have the responsibility to make those choices for themselves.\n\"In Jose's case, we spoke to him a million times,\" Samson said. \"Do I wish now we would have spoken to him a million and one times? Of course. But I'm not sure what people think we should have done. Did they want us to move in with him? Did they want us to have a guy stay with him at all times like Josh Hamilton? What should we have done better?\"\nThe men Fernandez played with still live with the pain of his decision to go boating way too late on that fateful Saturday night. Their team would like to think that pain will act as a reminder to make good, safe choices for the rest of their lives. But they have no guarantee of that.\n\"The 25 guys in that locker room on that Sunday, Sept. 25, will never forget that moment,\" Samson said. \"But will it impact them? Maybe. But this year's team will have seven new guys, and maybe more. Those guys weren't here to experience that. So we'll have the same talk with our players this spring that we always have. But who knows?\"\nIn fact, they never know. Just roll the clock back to October 2014. The night after Oscar Taveras' death, who was the pitcher who went to the mound with Taveras' initials scrawled on his cap? Who was the pitcher who dedicated a World Series victory to the memory of his friend Oscar?\nIt was Yordano Ventura, of course. Is there a more vivid reminder that the lessons of even the most painful tragedies don't last forever?\n\"I think,\" David Samson said, \"you just answered your own question.\"",
    "source_domain": "abcnews.go.com",
    "title": "MLB mourns, feels 'powerless' in face of continuing tragedy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/mlb-mourns-feels-powerless-face-continuing-tragedy/story?id=45508094"
}