{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 15:47:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Only five of 11 NFL players show up for Israel-sponsored trip",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2F11-nfl-players-show-israel-sponsored-trip%2Fstory%3Fid%3D45509111.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0215/dm_170215_MLB_Verlander_on_Tigers_chances/dm_170215_MLB_Verlander_on_Tigers_chances_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "JERUSALEM -- In an embarrassment to the Israeli government, only five of 11 NFL players have arrived on a sponsored trip aimed at improving the country's image.\nThe ministry for strategic affairs and public diplomacy issued a press release after the Super Bowl boasting that the visit would bring \"influencers\" who would serve as \"goodwill ambassadors\" when they returned home.\nThe announcement led Seattle Seahawks defensive lineman Michael Bennett to pull out. He accused the government of trying to use him for PR purposes and cited sympathy for the Palestinians.\nSeveral other players followed suit, including Bennett's brother, New England Patriots tight end Martellus Bennett, who retweeted his brother's letter.\nRambam Health Care Campus spokesman David Ratner said Wednesday that only five players arrived for a planned visit to the hospital. The ministry declined to comment.\nAccording to the Times of Israel, the five players that went on the trip were? Arizona Cardinals defensive end Calais Campbell, Oakland Raiders defensive tackle Dan Williams, New Orleans Saints defensive end Cameron Jordan, Tennessee Titans tight end Delanie Walker and Philadelphia Eagles linebacker Mychal Kendricks.\nIn addition to Michael and Martellus Bennett, the players scheduled to appear but didn't make the trip were Seattle Seahawks defensive end Cliff Avril, Miami Dolphins wide receiver Kenny Stills, San Francisco 49ers running back Carlos Hyde and Denver Broncos running back Justin Forsett. Retired NFL linebacker Kirk Morrison also was originally scheduled to appear.?\nKendricks and Jordan have posted pictures and video on social media from their visit.?\nThe visit will include stops at a hospital, the Yad Vashem Holocaust memorial and a meeting with the \"Black Hebrews,'' a community of African Americans who live in southern Israel.\nThe Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Only five of 11 NFL players show up for Israel-sponsored trip",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/11-nfl-players-show-israel-sponsored-trip/story?id=45509111"
}