{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:49:48+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "How the schedule was made: NBA taking hard look at metrics",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fschedule-made-nba-taking-hard-metrics-49215848.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_a16ea1456c274468a4b17930c8d6c1e5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Larry Bird made his plea years ago.\nHis request to the NBA was not unique: Bird wanted the league to eliminate the dreaded stretches of four games in five days. What made Bird's pitch memorable was that it didn't just cite the demand of so many games in such a short amount of time, but also pointed out how the anxiousness caused by such tests can hurt a team beforehand and how the fatigue lingers long afterward.\n\"What he said to me has been ringing in my head ever since,\" said Tom Carelli, the NBA's senior vice president for broadcasting.\nCarelli and the rest of the NBA schedule-making gurus were unable to make Bird's request reality — until now. With an extra week of days to play with, along with some much deeper looks at arena availability and ways to try to help competitive balance, the NBA believes the schedule released Monday should be the most user-friendly in the league's history.\nThe four-games-in-five-days challenges? Eliminated for the first time in NBA history.\nBack-to-backs? Only 14.4 per team on average, an all-time low for the third straight year.\nSingle-game road trips, average miles traveled and time zones crossed? All down a bit as well.\n\"I think at this point, and frankly the minute we got the extra week, we could conclude the schedule is really, undebatably, the best basketball schedule we've ever had,\" said Evan Wasch, the NBA's senior vice president for basketball strategy and analytics. \"That's what the week affords you, the opportunity to focus on all these different metrics.\"\nThe extra week, which allows the regular season to start Oct. 17 — the league's earliest start since 1980 — was an obvious help. But schedule makers went further, taking a deeper-than-usual look at arena availability around the league and trying to minimize the nights where a weary team will face a well-rested opponent.\nIn other words, NBA fans, meet FTE.\nThe metric — an acronym for Fresh, Tired and Even — is a major part of the NBA schedule process. It's a way the NBA has charted how tired one team will likely be when facing another.\nFTE has been part of the NBA's internal charting for years, but wasn't often discussed openly or with teams.\n\"If a team plays the night before and its opponent didn't, then one team is tired and its opponent is fresh,\" Wasch said. \"That fresh-tired ratio will be lower than ever. It's hard to measure and track when you build a schedule manually, but it's easy to track when building one with optimization software.\"\nInstead of asking teams for 50 possible home dates for their respective buildings — the past standard — schedule makers like Carelli, Wasch, Chris Boghosian, Gene Li and Hao Meng instead checked every available date and tried a much broader look at how the puzzle might fit.\nTheir work might be particularly noticed on ABC games this season.\nLast season, when stars like LeBron James, Kyrie Irving, Kevin Love, Stephen Curry, Klay Thompson, Draymond Green and Andre Iguodala all were given nights off when the Cavaliers or Warriors were playing nationally televised games on ABC, there was no shortage of scorn. This season, teams playing in those marquee ABC games will have a day off both before and after those contests.\n\"The more information we got, the easier it was to reduce back-to-backs,\" Carelli said.\nThe changes aren't only to benefit players and teams.\nThe league this year will be labeling the schedule by week — Week 1, Week 2, so on, from Monday to Sunday. It's essentially a idea at presenting fans, and fantasy players, with a schedule that's broken down into smaller bites.\n\"It's progress. It's all part of a larger basket of progress,\" Carelli said.\nThere will undoubtedly be some schedule griping. No one is claiming perfection. Improvement, for now, is enough, and that extra week of room being built into the season is already making an impact — even though the first real games are still two months away.\n\"We don't get scored,\" Carelli said. \"We don't necessarily win or lose, which is nice. The bottom line is that our primary, secondary, whatever goal it is, our goal is about the game. Our goal is about doing the best we can to create the most competitively balanced schedule we can for all the teams.\"\n———\nMore AP NBA: https://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "How the schedule was made: NBA taking hard look at metrics",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/schedule-made-nba-taking-hard-metrics-49215848"
}