{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 02:57:08+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "\"We have got to get tough,\" the president said. \"This isn't about nice anymore.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ftrump-proposes-executing-drug-dealers-fight-opioid-crisis-53860786.json",
    "image_url": "https://s.abcnews.com/images/WNT/180319_wn_vega_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump proposes executing drug dealers to fight opioid crisis\nNext tonight here, president trump traveling to New Hampshire today, talking tough about the opioid crisis, calling for the death penalty for some drug dealers. He also lashed out against Robert Mueller all weekend long, with tweets naming Mueller. Here's ABC's senior white house correspondent Cecilia Vega tonight. Reporter: In New Hampshire today, president trump toeing a tough line on the nation's opioid crisis. Praising other countries for executing drug dealers, and proposing the same right here at home. We have got to get tough. This isn't about nice anymore. Reporter: Right there in the crowd, his embattled attorney general. For today, back in the president's good graces. Jeff sessions, who's here with us now, feels so strongly about this. Reporter: President trump getting tough after a weekend lashing out against the special counsel and his Russia probe. The escalating attacks still going this morning. The president tweeting, \"A total witch hunt with massive conflicts of interest!\" For the first time, he also went after Robert Mueller by name, say saying, \"The Mueller probe should never have been started in that there was no collusion and there was no crime.\" A year into tin vest game, the president growing increasingly frustrated. I can only say this, there was absolutely no collusion. Everybody knows it. Reporter: And he is not alone. Over the weekend, his personal attorney stunning Washington, slamming the Russia probe as \"Manufactured\" and calling for its conclusion. The president's Twitter tirade started with the Friday night firing of FBI deputy director Andrew Mccabe, ousted less than two days before he was set to retire. You cannot stop the men and women of the FBI from doing the right thing. Reporter: An inspector general report concluded Mccabe authorized a conversation between FBI officials and a journalist about a Clinton foundation probe, and then he misled investigators about it. Mccabe denies any wrongdoing and says he was singled out as part of the administration's war with the special counsel. And now, sources tell ABC news Mccabe sat down for an interview with Mueller's team and has turned over memos of his conversations with the president. Tonight, the white house insists the president has no plans to fire Robert Mueller. But many in Washington, like Republican senator Lindsey graham, remain concerned. If he tried to do that, that would be the beginning of the end of his presidency. Cecilia, as you reported, the white house trying to ease concern over on the hill, saying the president has no plans to fire Mueller. But back to the other headline you reported on tonight, about the nation's ode yoid crisis. The president had this to say about executing some drug dealers. The ultimate penalty has to be the death penalty. Now, maybe our country's not ready for that. It's possible. It's possible. That our country's not ready for that. And I can understand it, maybe. Although personally, I can't understand that. So, Cecilia, how does the president plan to make this happen? Reporter: Well, David, it appears he wants to enforce certain laws on the books that are not currently being used, by expanding capital punishment to include certain drug kingpins, not just those drug dealers involved in murders. David? Cecilia, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump proposes executing drug dealers to fight opioid crisis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/trump-proposes-executing-drug-dealers-fight-opioid-crisis-53860786"
}