{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 07:04:48+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "AP PHOTOS: Debutantes Make Their Bows to Society at NY Gala",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fap-photos-debutantes-make-bows-society-ny-gala-44507599.json",
    "image_url": "http://abcnews.go.com/US/wireStory/ap-photos-debutantes-make-bows-society-ny-gala-44507599",
    "language": "en",
    "localpath": null,
    "maintext": "Dozens of debutantes from around the world made their bows to society as 2016 came to a close.\nThe families of the 46 women who gathered Thursday night at The Pierre hotel on Manhattan's Fifth Avenue had paid about $20,000 for a table and a chance to dine and waltz through an evening filled with air kisses and haute couture.\nThis year's International Debutante Ball featured young women from countries including Canada, China, England, France, Scotland and the United States.\nChairwoman Margaret Hedberg said the gala is no longer \"a marriage mart.\"\n\"The girls today are savvy about networking, and their parents want to celebrate their coming of age,\" Hedberg said. \"We have had daughters of presidents — Eisenhower, Nixon and Bush. We've invited Ivanka Trump, who decided not to attend. And I would like to invite the Obama daughters, now that the president is leaving office.\"\nThe 2016 group included Caroline Jones, the granddaughter of Dallas Cowboys owner Jerry Jones; Lady Louisa Murray, daughter of the Earl of Mansfield, whose home is Scone Palace in Perth, Scotland; and Wendy Yu, of London, the director of an investment firm and daughter of a Chinese billionaire.\n\"The perception of the debutante ball is quite antiquated,\" said debutante Kittsie Klaes, from Houston, who is a film major at the University of St. Andrews in Scotland and plans on becoming a screenwriter in Hollywood. \"Now it really is an opportunity for young ladies to show what they've accomplished and what they hope to become.\"\nHere's a gallery of images from the International Debutante Ball.\n———\nFollow AP photographers and photo editors on Twitter: http://apne.ws/15Oo6jo",
    "source_domain": "abcnews.go.com",
    "title": "AP PHOTOS: Debutantes Make Their Bows to Society at NY Gala",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/ap-photos-debutantes-make-bows-society-ny-gala-44507599"
}