{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 21:20:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Social media harnessed to expose white nationalists at rally",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fsocial-media-harnessed-expose-white-nationalists-rally-49214595.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_6dbbbcf6809440c0adb7c38a5ca9496a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One of the social media posts resembled a wanted poster or a missing-persons flyer: Photographs of men were arranged in rows, seeking their names and employers.\nBut the Facebook post wasn't circulated by law enforcement in the search for a suspect or by relatives looking for a missing loved one. It was the work of ordinary people trying to harness the power of social media to identify and shame the white nationalists who attended last weekend's violent rally in Charlottesville, Virginia.\nMeanwhile, a Twitter account dedicated to calling out racism, YesYoureRacist, identified people who attended the rally using photos culled from the news and social media and listed their places of employment and other information. A website created Sunday dedicated itself to collecting the names, social media profiles, colleges and employers of people photographed at the rally.\nAt least one person has lost his job as a result, showing that angry online groups can be used to renounce racism as well as promote it.\n\"The goal with online shaming is very short term and driven by people's desire to feel as if they are fighting back and having an impact,\" said Brian Reich, who's written several books on digital communications, behavior and political influence. \"They are afraid, appalled and they want to stop it.\"\nBut is it helpful? Reich said those behind these efforts \"are arguably fanning the flames,\" giving attention to a group — white supremacists — that feeds on attention.\n———\nTHE END OF ANONYMITY?\nNicholas Brody, professor of communications at the University of Puget Sound, said the events show that in the age of social media, \"nothing is really anonymous anymore.\"\nPeople attending a white supremacist rally decades ago may have had the comfort of knowing that their schools, employers and disapproving family members probably wouldn't find out about their activity.\nThese days, not only can information be quickly and widely shared, but a lot of data is available about people on Facebook, Twitter and LinkedIn. Image searches and facial-recognition technology, meanwhile, can make it relatively easy to identify people online.\nBut the method isn't foolproof. In 2013, users of Twitter and the website Reddit wrongly accused a man of being a suspect in the Boston Marathon bombing. Reddit later apologized .\n———\nCOLLEGE STUDENT IS EXPOSED\nPeter Cvjetanovic, a 20-year-old college student, was photographed shouting with a group of torch-wielding protesters Friday during a march through the University of Virginia campus. Cvjetanovic said in a television interview that he didn't expect the photo to spread as widely as it did.\nBut spread it did. And thousands of people signed an online petition to have him kicked out of school. Cvjetanovic told a local TV station that he is \"not the angry racist they see in that photo,\" but a white nationalist who cares for all people.\nThe University of Nevada in Reno confirmed Monday that Cvjetanovic is a student there. Spokeswoman Kerri Garcia said the university is \"still monitoring the situation and reviewing information.\"\nA message left for Cvjetanovic through the school was not returned. There was no telephone listing available for him in Reno.\nMeanwhile, Top Dog, a hot dog company in the San Francisco area, said one of its employees resigned after being confronted by management about participating in the rally.\n———\n'DOXING' AS INVITATION TO VIOLENCE\nThe practice of publishing private or identifying information — such as an address or phone number — about people online in an attempt to hurt, shame or abuse them is known as \"doxing.\"\nIn the 1990s, anti-abortion hackers infamously exposed abortion providers' home addresses, photos and other information on a now-defunct website called the \"Nuremberg Files.\" Names that were greyed out indicated people who had been \"wounded.\" A strikethrough meant they had been killed.\nCollecting and posting publicly available information, such as a photo of a person attending a public protest, is not the same thing, even if that can still hurt or shame people.\nPaul Levinson, a communications professor and social media expert, called it a \"moral obligation\" to expose white supremacists for who they are, something for which social media provides a good opportunity.\nGordon Coonfield, communications professor at Villanova University, said there is an important difference in the reasons people get doxed.\n\"Doxing an advocate of racial equality is an implicit — and often explicit — call for violence against them,\" he said in an email. \"Doxing a white nationalist is a call for accountability. Compelling individuals to be accountable for their words and deeds online or off is not a threat to freedom of expression. It is the foundation of freedom of expression.\"\nOf course, mere presence at a rally does not imply willing participation. Tiki Brand Products, whose torches were used and widely photographed during the rally, took to Facebook to distance itself from the march.\n\"We do not support their message or the use of our products in this way,\" the company wrote on its Facebook page. Our products are designed to enhance backyard gatherings and to help family and friends connect with each other at home in their yard.\"",
    "source_domain": "abcnews.go.com",
    "title": "Social media harnessed to expose white nationalists at rally",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/social-media-harnessed-expose-white-nationalists-rally-49214595"
}