{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 16:21:00+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Out of Power, State Dems Frustrated With National Committee",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fpower-state-dems-frustrated-national-committee-44511939.json",
    "image_url": "http://a.abcnews.com/images/Politics/AP_dnc_philadelphia_jt_160725_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Democrats around the country are demanding change from a national committee they say has focused too heavily on the White House at the expense of governorships, legislatures and state party operations.\n\"It's got to be helping us organize in our states to be able to build that power at the state legislative level,\" Michigan Democratic Party Chair Brandon Dillon said of the Democratic National Committee, currently searching for a new leader. \"We've lost governorships and state legislatures at a rate that is pretty astounding.\"\nDNC members gather in February to elect a new chairman, with five candidates running so far, each pledging to rebuild from the ground up. Money from the DNC to state parties has been inconsistent during President Barack Obama's tenure and, in most states, less than it was under former chairman Howard Dean. Party chairs say that's resulted in fewer staff members and training programs, a change felt particularly in Republican-leaning states. State leaders also say Obama's grassroots group Organizing for Action has functioned more like competition than a partner.\nBeginning in 2017, Republicans will hold 33 governorships and fully control legislatures in 25 states, as well as the Congress and presidency. During Obama's two terms in office, the party lost more than 1,000 seats at the state and national level.\n\"I love President Obama, but he and his administration allowed for the deterioration, the terrible deterioration, of the state parties over the last eight years,\" said Mark Brewer, who led the Michigan Democratic Party for 18 years.\nObama has announced plans, though, to improve Democrats' down-ballot fortunes once he leaves office. He is launching an initiative with former Attorney General Eric Holder aimed at making Democratic gains when states redraw legislative district lines following the 2020 census. Democrats have blamed Republican gerrymandering for some of their losses in Congress and state legislatures.\nState officials say it's been hard to plan long term and recruit and train candidates in off-election years due to inconsistent funding from the DNC. Under Dean, the national party installed and paid several staff members in each state. But that program ended after Obama's election. State parties began to receive monthly payments of anywhere from $5,000 to $10,000, an amount that varies depending on the year. At some point, the parties have received no money at all. The DNC does provide some money to state parties for elections based on the state's competitive races and other factors.\nThe change has left some states scrambling.\nThe Nebraska Democratic Party, for example, paid five full-time staff members during Dean's tenure. But when Dean's \"50-state strategy\" ended, it was hard to keep one and pay the rent, said Maureen Monahan, a vice president of the Association for State Democratic Chairs from Nebraska. Some states, such Mississippi, do not pay their party chairs. Even in Michigan, a staff that once stood at more than a dozen now is between five and seven employees, party chairs said.\n\"The past eight years we have not had any focus on the state parties,\" Monahan said. \"There's been a sense that the DNC is a building in Washington.\"\nThe push-and-pull between state parties and the DNC is nothing new. State parties, congressional Democratic groups and the president's allies often spar over how best to spend party resources. The DNC defended its involvement with states.\n\"State parties are the lifeblood of the DNC, and we make investing in all of them a priority because they are an integral part of winning up and down the ballot. State parties were critical to picking up Senate seats, House seats, legislative chambers and governorships in 2016, and their importance will be a key focus for the party as we elect new officers in February,\" DNC spokesman Adam Hodge said.\nMarcel Groen, Pennsylvania Democrats' chair, said it's unfair to blame Democrats' troubles completely on the national party. But he said a focus on recruiting and running Democrats even in low level races in Republicans areas can help the top of the ticket in the long term.\n\"We can't expect people in rural areas, in red areas, to vote for our presidential candidates or our gubernatorial or Senate candidates if they've never seen a Democrat running for school board or county office,\" he said.",
    "source_domain": "abcnews.go.com",
    "title": "Out of Power, State Dems Frustrated With National Committee",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/power-state-dems-frustrated-national-committee-44511939"
}