{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 06:21:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Las Vegas tragedy weighs on minds of Tony Ferguson, Kevin Lee ahead of UFC 216",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Flas-vegas-tragedy-weighs-minds-tony-ferguson-kevin%2Fstory%3Fid%3D50339228.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_171003_MMA_Feguson_Lee_fight_at_UFC_216_under_difficult_circumstances_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "LAS VEGAS -- Both fighters in this weekend's UFC 216 pay-per-view event -- the first major sports event scheduled in Las Vegas since Sunday's mass shooting -- said they were affected by the tragedy.\nSaturday's event, which takes place inside T-Mobile Arena, is headlined by an interim lightweight title fight between Tony Ferguson and Kevin Lee, a resident of Las Vegas.\nFerguson, who trains out of Southern California, was in Las Vegas when the shooting happened. It was the worst shooting in modern U.S. history, killing 59 people.\nFerguson said his wife and family were near the south end of Las Vegas Boulevard, where the Route 91 Harvest Festival -- the site of the tragedy -- was held. They had gone to church that evening, before the shooting, and even had considered moving closer to the concert, before ultimately leaving the area.\n\"I was actually at a Walmart, and my wife had went to church, across the street from [the festival],\" Ferguson told ESPN. \"My brother-in-law hit me up and said he'd heard from dispatch about the shootings and for me to be careful.\n\"I'm getting these random texts from my wife; she's telling me to stay put. I'm like, 'What the f--- is going on? I need to get to you guys.' The one thing I needed to do is get to my family, and it was hard, but I found a way. Everything was blockaded, but we got where we needed and everybody was safe. Then my wife tells me they were going to go to the damn festival, because I was working out late.\n\"Walking out of the church, they could hear music. They had country music, and my wife knows I like country music. I'm just glad they didn't go, man. They went to church, said a prayer and she made the gut decision to go home.\"\nOriginally from Detroit, Lee moved to Las Vegas in 2014. He flew to California to promote the UFC 216 fight on Sunday, and he did not learn the full scope of the attack until Monday.\n\"When I woke up the next morning, that's when I see all the news and all the videos,\" Lee said. \"That was a big media day for us, and it was hard for me to focus or even talk about the fight. My mind was on something else. I reached out to everybody that morning. I must have had 50 phone calls, of people checking up on me.\n\"It hits close to home. I just did a charity event at Luxor [Hotel]. I don't know. The brain just works different when you're looking at a place [on the news] and you were just there.\"\n\"At the end of the day, I had to sit back and look at it -- this Saturday is going to be a celebration. When I feel most alive is during a fight and in the cage. This was one coward and I'm not going to let him win. I'm going to go out there unafraid. This just makes me want to live and fight harder.\"\nWhen asked if it might have an emotional effect on him during the fight, Lee admitted he didn't know.\n\"Maybe. I don't even know what the emotions will be,\" Lee said. \"It's just something that will be in the moment. It's not something you can even think about or predict. It's going to be in the moment.\n\"It's not just about being from Las Vegas or from Detroit. Yeah, it's about that, but it's about everybody too. I feel like there doesn't need to be that separation. I fight for kids that come from similar [low-income] situations as me. I don't care if you're from Detroit, Atlanta, Philly, New York, Las Vegas, California -- I'm fighting for all those kids.\"\nFerguson (22-3) and Lee (16-2) have traded verbal insults leading up to the event, but both said they hold no ill will toward the other.\n\"You've got to embrace everybody and share the love, pay it forward, give somebody a high-five and a smile,\" Ferguson said. \"Kevin Lee is my brother-in-arms. I've got nothing aggressive against him.\"\nAs Lee added, \"I'm going to be in the biggest fight of my life, but there are other things in the world. There's bigger s--- going on. Yeah, me and Tony might have this back-and-forth, and I might show him disrespect and he might show it to me; but really, I want him to go home to his family after this. I want him to live his life.\"\nUFC president Dana White told ESPN earlier this week that the UFC 216 event will be \"dedicated to the entire city of Las Vegas.\" The promotion also will donate $1 million to victims' families.\nMGM properties did not immediately respond to requests for comment on planned security measures for the event.",
    "source_domain": "abcnews.go.com",
    "title": "Las Vegas tragedy weighs on minds of Tony Ferguson, Kevin Lee ahead of UFC 216",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/las-vegas-tragedy-weighs-minds-tony-ferguson-kevin/story?id=50339228"
}