{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-03-20 01:31:16+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "An official book about the vice president's pet bunny was published Monday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fjohn-oliver-trolls-mike-pence-book-gay-rabbit%2Fstory%3Fid%3D53857617.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/john-oliver-ap-thg-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "John Oliver's attempt to troll Vice President Mike Pence was as successful as he could have hoped.\nInterested in Mike Pence? Add Mike Pence as an interest to stay up to date on the latest Mike Pence news, video, and analysis from ABC News. Add Interest\nLess than 24 hours after the \"Last Week Tonight\" host announced that he'd published a children's book about Pence's pet rabbit, Marlon Bundo, to compete with one issued by the politician's family, the parody tome “Last Week Tonight with John Oliver Presents a Day in the Life of Marlon Bundo\" soared to the top of Amazon's sales list.\nMeanwhile, “Marlon Bundo’s Day in the Life of the Vice President,\" a book written by Pence's daughter Charlotte and illustrated by his wife Karen, had reached No. 5 on the sales chart as of Monday evening.\nAmazon\n\"There are a few small differences between the two books,\" Oliver told \"Last Week Tonight\" viewers on Sunday night. \"Our story is about Marlon Bundo falling in love with another boy rabbit because our Marlon Bundo is gay.\"\nOn Sunday night's show, Oliver delved into Pence's fraught relationship with the LGBTQ community. Pence has been an outspoken critic of gay marriage, opposed the repeal of Don’t Ask, Don’t Tell, and as the governor of Indiana, signed into law the Religious Freedom Restoration Act, which critics claimed would allow businesses to discriminate against the LGBTQ community. He later signed into law an additional measure that clarified no person could be discriminated against because of their sexual orientation or gender identity.\nSo it was only appropriate that all proceeds from the sales of Oliver's parody book would benefit AIDS United and The Trevor Project, a suicide hotline for LGBTQ youth. He also revealed that actors Jim Parsons, Jesse Tyler Ferguson, Jeff Garland, Ellie Kemper, John Lithgow, Jack McBrayer and RuPaul lent their voices to the audio version.\n\"This is a sweet story about Marlon Bundo falling in love,\" Oliver said. \"This isn't some adult book telling Mike Pence to go f--- himself, although in buying it, that's exactly what you would be doing.\"\nA spokesperson for Regnery Publishing, the conservative publisher behind the Pences' book, told CNN that the spoof was \"unfortunate.\"\nThe representative's statement read: \"It's unfortunate that anyone would feel the need to ridicule an educational children's book and turn it into something controversial and partisan. Our and Mrs. and Charlotte Pence's goal is -- and will continue to be -- to educate young readers about the important role of the vice president, as well as to highlight the charities to which portions of the book proceeds will be donated.\"",
    "source_domain": "abcnews.go.com",
    "title": "John Oliver trolls Mike Pence with a book about a gay rabbit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/john-oliver-trolls-mike-pence-book-gay-rabbit/story?id=53857617"
}