{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2017-12-11 08:31:33+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Massive California wildfire now the fifth-largest in state's history",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmassive-california-wildfire-now-largest-states-history%2Fstory%3Fid%3D51710805.json",
    "image_url": "http://a.abcnews.com/images/Sports/california-fires-8-ap-jt-171210_4x3_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Thomas fire, the worst of five wildfires currently burning in California, grew by more than 50,000 acres on Sunday, making it the fifth-largest wildfire in the state's history, fire officials said.\nInterested in California Wildfires? Add California Wildfires as an interest to stay up to date on the latest California Wildfires news, video, and analysis from ABC News. Add Interest\nFueled by shifty Santa Ana winds and extremely low humidity, the destructive blaze had charred at least 230,000 acres by Sunday evening, prompting new mandatory evacuation orders for about 5,000 residents in Santa Barbara County.\nMore than 30,000 other residents in Santa Barbara County were under evacuation warnings.\nThe fire, which has burned uncontrollably since last Monday, had destroyed 790 structures and damaged about 190 others by Sunday, authorities said. It was only 10 percent contained as of Sunday evening as about 5,770 firefighters from about 100 different crews battled the blaze, according to fire officials. It was about 15 percent contained earlier, but the containment dropped as the fire’s perimeter grew, officials said.\nThe Associated Press\nIt was previously 15 percent contained, according to fire officials, but the containment level dropped as the fire’s perimeter grew overnight Saturday and through the day Sunday.\nThe state has spent more than $34 million on efforts to suppress the Thomas fire, which has also knocked out electricity for thousands of area residents, authorities said.\nCollectively, the series of wildfires across Southern California have forced more than 200,000 people out of their homes since last Monday, damaging about 800 structures and scorching more than 270 square miles of land, according to The Associated Press.\nThe Associated Press\nA 70-year-old woman was identified Friday as the first victim of the fires. Virginia Pesola, of Santa Paula, was killed in a car crash as she evacuated Wednesday, The Associated Press reported.\nThe Associated Press\n\"[We're] facing a new reality in the state,\" California Governor Jerry Brown said Saturday as he surveyed the damage in Ventura County. \"It's a horror and a horror we need to recover from.\"\nHe also noted that the years of drought and climate change have caused experts to conclude that \"California is burning up.\"\nThe Associated Press\nFrom here on in California, Brown said, fires are going to be more \"intense\" and penetrate lives and property.\n\"Individuals need to come together to make our communities livable,\" he said.",
    "source_domain": "abcnews.go.com",
    "title": "Massive California wildfire now the fifth-largest in state's history",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/massive-california-wildfire-now-largest-states-history/story?id=51710805"
}