{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:39:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Trial begins against suspects in Istanbul nightclub attack",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ftrial-begins-suspects-istanbul-nightclub-attack-51712262.json",
    "image_url": "http://a.abcnews.com/images/GMA/170104_gma_marquardt_0712_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Turkey? Add Turkey as an interest to stay up to date on the latest Turkey news, video, and analysis from ABC News. Add Interest\nA trial began Monday in Turkey against dozens of suspects, including the alleged shooter in the New Year's Eve attack that left 39 people dead in Istanbul.\nFifty-seven suspects, mostly foreigners and 51 of them behind bars, went on trial near a prison on the outskirts of Istanbul.\nAlbulkadir Masharipov of Uzbekistan — the lead suspect in the case — is charged with membership in a terror group, murder and attempting to overthrow the constitutional order, among other charges. The prosecutor is seeking multiple aggravated life sentences. The suspect's wife has also been charged.\nEarly on Jan. 1, an assailant shot his way into Istanbul's Reina nightclub where hundreds were partying, celebrating the New Year. The assailant escaped and the Islamic State group claimed the attack.\nSeventy-nine people were wounded. Most of the dead were foreigners.\nMasharipov was captured in Istanbul after evading police for 15 days. Turkish officials said the 34-year-old suspect had trained in Afghanistan.\nTurkey has been hit by a string of attacks since 2015 by Kurdish militants and IS. More than 300 people have been killed in 14 separate attacks blamed on IS.",
    "source_domain": "abcnews.go.com",
    "title": "Trial begins against suspects in Istanbul nightclub attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/trial-begins-suspects-istanbul-nightclub-attack-51712262"
}