{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2017-08-14 21:17:53+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Sisters who gave birth 20 minutes apart celebrate their daughters' 1st birthday",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fsisters-gave-birth-20-minutes-celebrate-daughters-1st%2Fstory%3Fid%3D49206321.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/sisters-pregnant1-ht-ml-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two sisters who gave birth to daughters only 20 minutes apart last year are now marking their baby girls' first birthdays with an epic photo shoot.\nCorey Struve Talbott and Katie Struve Morgan found out they were both expecting their second and third child, respectively, around the holidays in 2015.\nAfter Talbott, 32, discovered she was expecting, she immediately told her younger sister.\nSo Cute Photo Monterey Materntiy Photography\n\"My sister [Katie] was like, 'I have to tell you something too. I'm pregnant too and I haven't been telling anyone for two weeks to surprise everyone on Christmas morning,\" Talbott told ABC News. \"I almost passed out because I couldn't believe it.\"\nThe sisters eventually went on to give birth to Ryatt Raegan Talbott and Indie Mae Morgan, in the exact same hospital on the exact same day: Aug. 10, 2016.\nSo Cute Photo Monterey Materntiy Photography\n\"It was really surreal,\" Morgan, 30, told ABC News. \"Corey was on her way to [take] photos for me [at the hospital] and I hadn’t seen her and I’m like, 'Where is she?' And she comes in fully gowned with her IV and she’s like, 'I’m sorry, I have to have Ryatt! She’s coming!'\"\nSince then, the Struve sisters, who live five minutes apart in Salinas, California, have enjoyed raising their daughters together. They even recently celebrated their daughters turning 1 by staging a photo shoot with photographer Brenden Boggs.\n\"It's pretty funny how close they are,\" Talbott said. \"They're almost twins.\"\nSo Cute Photo Monterey Materntiy Photography\nMorgan agreed, adding that their \"twins\" have \"opposite personalities.\"\n\"My sister is more like the leader or outspoken one and I'm the quiet, mellow one and our babies are the complete opposite,\" Morgan said. \"[My daughter Indie is] very loud and takes charge and her daughter [Ryatt] is very quiet and soft and goes with the flow.\"\n\"It's been so much fun,\" she added.",
    "source_domain": "abcnews.go.com",
    "title": "Sisters who gave birth 20 minutes apart celebrate their daughters' 1st birthday",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/sisters-gave-birth-20-minutes-celebrate-daughters-1st/story?id=49206321"
}