{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 11:08:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Muguruza Beats Stosur in 1st Round at Brisbane International",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fmuguruza-beats-stosur-1st-round-brisbane-international-44508971.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/muguruza-beats-stosur-1st-round-brisbane-international-44508971",
    "language": "en",
    "localpath": null,
    "maintext": "French Open champion Garbine Muguruza finished off a first-round match for the first time at the Brisbane International, and extended Sam Stosur's unhappy run in the process with a 7-5, 6-7 (2), 7-5 win on Monday.\nThe fourth-seeded Muguruza saved three set points in the first and rallied from a break down in the third to finish off in 2 hours, 45 minutes on a humid afternoon. In two previous trips to the season-opening tournament, Muguruza struggled with injuries and hadn't completed a match.\n\"It was a battle,\" Muguruza said. Stosur \"played very well today. She served like a beast. It took three hours for that battle to see what happens in the end.\"\nMuguruza beat Stosur in the French Open semifinals last year and went on to beat then No. 1-ranked Serena Williams in the final to claim her first major title.\nThe loss extended a slump for Stosur, the 32-year-old Australian who hasn't won a competitive singles match since the first round of the U.S. Open in September and hasn't advanced past the second round at her home tournament in Queensland state.\nNo. 5 Svetlana Kuznetsova, No. 6 Elina Svitolina and No. 8 Roberta Vinci were among the women's seeds advancing Monday.\nSvitolina, the only player to beat both Serena Williams and Angelique Kerber in 2016, opened with a 6-3, 6-3 win over Olympic champion Monica Puig.\nKuznetsova beat American Louisa Chirico 6-2 6-4 and Vinci was pushed all the way in a 7-6 (4), 6-7 (4), 7-6 (5) win over qualifier Kateryna Bondarenko.\nAmerican qualifier Asia Mohammed advanced with a 7-6 (5), 6-1 win over Donna Vekic, and Zhang Shuai of China beat Laura Siegemund 4-6, 7-6 (3), 6-3.\nIn the men's draw, another of Australia's local hopes went out in the first round with No. 8-seeded David Ferrer beating error-prone Bernard Tomic 6-3, 7-5.\nNicolas Mahut advanced to the second round with a 4-6, 6-3, 6-4 win over fellow Frenchman Stephane Robert and Kyle Edmond held off American qualifier Ernesto Escobedo 7-6 (4), 7-6 (6).",
    "source_domain": "abcnews.go.com",
    "title": "Muguruza Beats Stosur in 1st Round at Brisbane International",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/muguruza-beats-stosur-1st-round-brisbane-international-44508971"
}