{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 16:20:53+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Dick Clark Productions Rejects Mariah Carey's Sabotage Claim",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fdick-clark-productions-rejects-mariah-careys-sabotage-claim-44507667.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/RT-mariah-carey-jt-170101_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dick Clark Productions is hitting back against Mariah Carey's claim it sabotaged her live performance on its \"New Year's Rockin' Eve\" special.\nCarey's disaster during the annual New Year's Eve special in Times Square made international headlines: The superstar vocally stumbled through her short set, failing to sing for most of it despite a pre-recorded track of her songs playing in the background.\nCarey was visibly upset during the performance and afterward tweeted \"(expletive) happens.\" Her representative Nicole Perna blamed technical difficulties, and in an interview with Billboard she said Dick Clark Productions hampered Carey's performance.\n\"She was not winging this moment and took it very seriously,\" Perna told Billboard. \"A shame that production set her up to fail.\"\nPerna said Carey's earpiece wasn't working and she flagged the issue to the production team but was told it would be OK when she got on stage.\n\"However, that was not the case, and they were again told that her earpiece was not working,\" Perna said. \"Instead of endeavoring to fix the issue so that Mariah could perform, they went live.\"\nIn a statement released on Sunday, the production company called such claims \"absurd.\"\n\"As the premier producer of live television events for nearly 50 years, we pride ourselves on our reputation and long-standing relationships with artists,\" it said. \"To suggest that dcp (Dick Clark Productions), as producer of music shows including the American Music Awards, Billboard Music Awards, New Year's Rockin' Eve and Academy of Country Music Awards, would ever intentionally compromise the success of any artist is defamatory, outrageous and frankly absurd.\"\nIt said that in \"very rare instances\" there are technical errors that can occur with live television. It said an initial investigation, however, indicated it had no involvement in the challenges associated with Carey's performance.\n\"We want to be clear that we have the utmost respect for Ms. Carey as an artist and acknowledge her tremendous accomplishments in the industry,\" it said.\nA person familiar with the production of the show who asked for anonymity to speak publicly about the incident said all of the other performers, including Gloria Estefan, rehearsed onsite for their performances and Carey was there but had a stand-in for her rehearsal, atypical for the show's performers. The person said all of the monitors were working and no technical problems were found.\nIronically, Carey was Dick Clark Productions' first live performer for the broadcast in 2005, when it went off without any such problems.",
    "source_domain": "abcnews.go.com",
    "title": "Dick Clark Productions Rejects Mariah Carey's Sabotage Claim",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/dick-clark-productions-rejects-mariah-careys-sabotage-claim-44507667"
}