{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:13:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Final push for Moore and Jones in Alabama Senate race",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Ffinal-push-moore-jones-alabama-senate-race-51712283.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_759f7161b2d6476298f6c2dc248b24a7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Alabama Democrats see Tuesday's special Senate election as a chance to renounce a history littered with politicians whose race-baiting, bombast and other baggage have long soiled the state's reputation beyond its borders.\nMany Republicans see the vote as chance to ratify their conservative values and protect President Donald Trump's agenda ahead of the 2018 midterm elections.\nAt the center are Republican Roy Moore, a former jurist twice removed as state chief justice and now accused of sexual misconduct with teenage girls decades ago, and Democrat Doug Jones, an erstwhile federal prosecutor best known for prosecuting two Ku Klux Klansmen responsible for killing four black girls in the 1963 bombing of Birmingham's 16th Street Baptist Church.\nThe winner will take the seat held previously by Trump's attorney general, Jeff Sessions. Republicans control the Senate with 52 seats.\nIn truth, the matchup mixes both Alabama's tortured history and the nation's current divisive, bitterly partisan politics, and it has made a spectacle of a Deep South state well acquainted with national scrutiny but not accustomed to competitive general elections.\n\"This is an election to tell the whole world what we stand for,\" Jones told supporters at one stop Sunday, adding that his campaign \"is on the right side of history.\" At an earlier appearance, he declared Alabama is \"at a crossroads\" and that Moore, an unapologetic evangelical populist, tries only to \"create conflict and division.\"\nJones, 63, stops short of explicitly comparing Moore to the four-term Gov. George Wallace, whose populism was rooted in segregation. But Jones alluded Sunday to that era of Alabama politics.\n\"Elect a responsible man to a responsible office,\" Jones said, repeating the campaign slogan of another Alabama governor, Albert Brewer, who nearly defeated Wallace in 1970 in a contest Alabama liberals and many moderates still lament as a lost opportunity.\nSome of Jones' supporters put it even more bluntly. \"I thought Alabama's image was pretty much at the bottom,\" said Pat Lawrence, a retired software engineer in Huntsville. A Moore win, Lawrence added, \"will be a whole new bottom.\"\nThose concerns extend even to some GOP quarters. Alabama's senior senator, Richard Shelby, confirmed Sunday that he did not vote for Moore, saying he wrote in another \"distinguished\" party figure he declined to name.\nYet for many Republicans, Moore is a paragon of traditional values. They reject accusations that he molested two teenage girls and pursued relationships with others decades ago. Moore denies the charges.\n\"Everyone has to vote their convictions,\" said Kevin Mims of Montgomery, as he held his Bible outside his Baptist church Sunday in Montgomery. \"My conviction is he's the right man for the job.\"\nWhere Moore's critics see a state judge who defied federal courts, including the U.S. Supreme Court's decision legalizing same-sex marriage, Mims see a stalwart who stands \"on the word of God.\" Other conservatives see an anti-establishment firebrand in the mold of Trump, who won Alabama by 28 percentage points.\nMoore encourages that view with fundraising emails that urge backers to help him \"defeat the elite,\" a swipe at both Democrats and the establishment Republicans who tried to deny him the GOP nomination earlier this year.\nUltimately, Republicans from Moore to Trump himself are betting on a simple bottom line: Most Alabama conservatives simply won't defect to a Democrat.\n\"If Alabama elects liberal Democrat Doug Jones, all of our progress will be stopped cold,\" Trump says in a robocall the Moore campaign plans to push out Monday.\nThe president also invokes a common fear among Republicans, calling Jones \"a puppet of Nancy Pelosi and Chuck Schumer,\" the Democratic House and Senate leaders in Washington, both of them reviled by conservative voters. \"Roy Moore is the guy we need to pass our Make American Great Again agenda,\" the president insists.\nMoore's baggage could make it difficult to draw conclusions about what the results might mean beyond Alabama, but both parties are watching closely.\nDemocrats need to flip 24 GOP-held seats to reclaim a House majority, and they're trying to dent the slim Republican advantage in the Senate and its dominance of statehouses around the country. In many of those races, they'll need the same thing Jones must get to win in Alabama: strong turnout among young and non-white voters, along with improved performance among suburban moderates.\nA Jones victory would be hailed as a potential precursor, and Democrats have indicated they have a post-Alabama strategy even if Jones loses: They'll take Alabama's brand national, hammering Republicans as \"the party of Donald Trump and Roy Moore.\"\n-----\nBarrow reported from Mobile, Alabama. Follow Barrow on Twitter at https://twitter.com/BillBarrowAP and Chandler at https://twitter.com/StatehouseKim.",
    "source_domain": "abcnews.go.com",
    "title": "Final push for Moore and Jones in Alabama Senate race",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/final-push-moore-jones-alabama-senate-race-51712283"
}