{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 16:55:25+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Two families are joined together by the sound of one beating heart in this lifesaving story of organ donation.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fvideo%2Fmom-listens-sons-heart-organ-donor-recipient-55532383.json",
    "image_url": "https://s.abcnews.com/images/US/180530_kgtv_heart_donor_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Mom listens to son's heart in organ donor recipient\nIf you noticed nothing else when looking at the photos of Mathieu Bergeron he can't tell me you don't notice that beaming smile. Perhaps it's because an all of them smiling right beside him his high school sweetheart Jessica wall. Probably no one knows Matthew's heart better than sheets. We got away from. Compared. That was instructed and sets. Up. Still beating strong as ever own way. It's no longer be eating and Matthews chest. Shocking. Yeah. Thank you really looking really really excited where I haven't gotten along work. It was may of last year a freak accident Matthew fell off that long board and hit his head he died doing what he loved. Which brings us back to that part of his. You see Matthew was an organ donor and what Marie also needed more than anything else was a strong horror of almost overnight what appeared to be cold. The cold never left was a heart condition. The former lifeguard and polo player suddenly found it hard to walk two even three. Cut indescribable. Which brings us to today. But marriage lake did everything personally. Through the organ donation group life sharing the two families brought together. No matter right Iraqis girlfriend and his mom cheaply. And so I think. Listening for the first time to Matthew's heart beating and all sorts Chet. When I was diagnosed a million years ago I knew that they calm but when the day comes it's it's just it's such it. Transformation that she. We can't express in words to families forever unite over one beating heart brunch Lonsky ten news.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Mom listens to son's heart in organ donor recipient",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Family/video/mom-listens-sons-heart-organ-donor-recipient-55532383"
}