{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 08:32:06+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Iraq's ex-President Talabani buried in Kurdish region",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Firaqs-president-talabani-buried-kurdish-region-50339625.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_84779c785b6d46cb94e0aaff31d9a38d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Thousands of Iraqi Kurdish mourners, Iraqi officials and world dignitaries attended the funeral of Jalal Talabani, the country's first president in a post-Saddam Hussein Iraq and once a symbol of national unity.\nTalabani was laid to rest Friday in Sulaimaniyah, the second-largest city in Iraq's Kurdish region, after his casket — draped in the Kurdish flag — was flown back from Berlin where he died at a hospital earlier this week.\nFrom the airport in Suleimaniyah, a motorcade carried the casket to a nearby hill for burial. Crowds poured into the streets, following the funeral procession on foot, carrying flags and posters bearing Talabani's image and the emblem of the political party he founded more than three decades ago, the Patriotic Union of Kurdistan.\nMany threw flowers on top of the coffin.\nWhile Talabani traces his roots to a small village in Iraq's north, Sulaimaniyah is the seat of his political power.\nA long-time champion of Kurdish self-rule, Talabani, also established himself as a national statesman after accepting the largely symbolic office of the presidency two years after the 2003 U.S. invasion toppled Saddam.\nHe held the post from 2005 to 2014, but faded from Iraqi political life after suffering a debilitating stroke in 2012.\nDuring his time as president, Talabani was seen as a symbol of unity, a politician able to manage tensions between Sunnis, Shiites and Kurds that in Iraq often erupt into violence.\nTalabani's death in Germany on Tuesday came as Iraq struggles to manage the fallout of a controversial referendum on Kurdish independence spearheaded by his long-time Iraqi Kurdish political rival, Masoud Barzani.\nWhile Barzani was present at the funeral and laid a wreath of white flowers at Talabani's casket, Iraq's Prime Minister Haider al-Abadi was not in attendance.\nInterior Minister Qassim al-Araji came to Sulaimaniyah to pay his respects in al-Abadi's place.\nAlso in attendance were Iran's Foreign Minister Mohammad Javad Zarif; Iraq's current president and fellow Kurd, Fuad Masum; U.S. Ambassador to Iraq Douglas A. Silliman, and Jan Kubis, the top U.N. envoy in Iraq.\nBaghdad, along with neighboring Turkey and Iran, has rejected the Kurdish referendum and is demanding Kurdish leadership do the same. While the vote in non-binding and will not immediately create an independent state, many saw it as a symbolic affirmation of the Iraqi Kurdish dreams for a state of their own.\nIraq's central government has banned international flights from servicing the Kurdish region's airports and Turkey and Iran, fearful of their own restive Kurdish minorities, have threatened further punitive measures.\nTurkish President Recep Tayyib Erdogan threatened a total blockade and has not ruled out the possibility of military invasion.\nAs Talabani's coffin arrived at Sulaimaniyah airport, Iraqi state TV hailed the late president as a national leader who would not have approved of the referendum, called by Barzani.\nHowever, Talabani had not made any official statement on the vote and his political party was split on the subject.\nIraq's Kurds have been politically divided for decades. Shortly after securing an autonomous zone in the 1990s with the backing of a U.S.-enforced no-fly zone, Barzani and Talabani's rival factions — mainly their Patriotic Union of Kurdistan and the Kurdistan Democratic Party — were drawn into a bitter civil war that killed thousands of civilians and fighters on both sides.\nDeep distrust remains to this day, but across the political spectrum, the dream of an independent state is a central rallying point. Both the referendum vote and Talabani's death whipped up nationalist sentiment throughout the Kurdish region.\n\"Since the beginning of the Kurdish liberation movement until now, it was Mam Jalal who brought us to this point,\" said Karim Mohammed, a Sulaimaniyah resident among the crowds gathered to pay their respects, \"he always looked after us.\"\n\"Mam Jalal\" is Talabani's Kurdish nickname that translates to Uncle Jalal.\nThe United Nations described Talabani as \"a leading voice of moderation, dialogue, mutual understanding and respect in Iraq's contemporary politics\" and a \"patriot of unique wisdom and foresight.\"\nTalabani's son and the Kurdish region's deputy prime minister, Qubad Talabani, spoke at the funeral ceremony, saying that his family received condolences from across the Kurdish region.\n\"He was an uncle to all of you. He belonged to all of Kurdistan,\" Qubad said in remarks broadcast on local Kurdish television.\n———\nAssociated Press writer Adnan Ahmed Qader in Sulaimaniyah, Iraq, and Susannah George in Baghdad contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Iraq's ex-President Talabani buried in Kurdish region",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/iraqs-president-talabani-buried-kurdish-region-50339625"
}