{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 22:42:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Business Highlights",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbusiness-highlights-46850464.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/business-highlights-46850464",
    "language": "en",
    "localpath": null,
    "maintext": "___\nINFLUENCE GAME: Telecom lobbying muscle kills privacy rules\nNEW YORK (AP) — The telecom industry's lobbying muscle has helped push a consumer privacy measure to a swift death in Congress. Digital-rights and consumer-advocacy groups support keeping the rules. But they were outmatched by telecom services and telephone companies, which spent more than $120 million in 2016 to lobby this and other issues.\n———\nLed by banks, stocks jump after strong report from China\nNEW YORK (AP) — Banks, technology and consumer-focused companies lead stocks higher after China's economy, the world's second-largest, regained some strength in the first quarter. It was the best day for US stocks in more than a month. Drugmaker Eli Lilly fell after regulators refused to approve a rheumatoid arthritis pill.\n———\nNetflix on the verge of hitting 100 million subscribers\nSAN FRANCISCO (AP) — Netflix is on the verge of surpassing 100 million subscribers, a testament to how much the video streaming service has changed the entertainment landscape since its debut a decade ago. The milestone will be reached this weekend if Netflix's projections are correct. Netflix still has a way to catch up with its cable-TV role model, HBO, which has 134 million subscribers.\n———\nUS homebuilder sentiment slips, but overall outlook positive\nU.S. homebuilders are feeling slightly less optimistic about their sales prospects, even as their overall outlook remains favorable. The National Association of Home Builders/Wells Fargo builder sentiment index released Monday slipped to 68 this month. That's down three points from 71 in March, when it jumped to the highest level since June 2005.\n———\nOvercoming Opioids: The quest for less addictive drugs\nWith some 2 million Americans hooked on opioid painkillers, drug companies are racing to find alternatives to stem the epidemic. Some fresh approaches are providing some hope such as drugs that target specific pathways in the brain or prevent the needs for opioids. But the biggest need is for novel medicines that can be used by lots of people for lots of problems.\n———\nBank of America settles racial discrimination case from 1993\nRALEIGH, N.C. (AP) — The U.S. Labor Department says Bank of America has settled a decades-old case that accused its predecessor company of systematically discriminating against black applicants for entry-level jobs in Charlotte. The bank settled the 1993 case by agreeing that about 1,000 people who applied for clerical, teller and administrative positions a generation ago would share $1 million in back wages and interest.\n———\nKids prefer the TV for their viewing, but love other devices\nNEW YORK (AP) — Youngsters mostly watch television on a television. As old-fashioned, linear, off-the-air telecasts. Just as their elders mostly still do, and always have, since TV was born.\n———\nArconic CEO Klaus Kleinfeld steps down\nNEW YORK (AP) — Arconic says CEO and Chairman Klaus Kleinfeld has agreed to step down from those roles after the company's board of directors discovered that he sent a letter to one of Arconic's biggest shareholders without telling them. Arconic makes aluminum, titanium or nickel parts for planes, cars and electronics. The New York-based company was spun off from aluminum company Alcoa last year.\n———\nChina's 1Q economic growth ticks higher to 6.9 percent\nHONG KONG (AP) — China reports its economic growth rose to 6.9 percent in the first quarter of the year. Data released Monday show the world's second-biggest economy grew at a slightly faster pace in the January-March period than in the previous quarter, when it expanded at a 6.8 percent annual pace. It's the second straight quarter that China's economy has accelerated, suggesting its rebound is gaining momentum.\n———\nBrazil construction firm ordered to pay $2.6B in bribe case\nNEW YORK (AP) — Brazilian construction conglomerate Odebrecht has been ordered in New York to pay $2.6 billion in fines to settle charges it bribed officials in a dozen countries. The payout was ordered Monday by Judge Raymond Dearie after a plea agreement was reached in December. Odebrecht has apologized for its involvement in corruption scandals that led to the arrest of its former chief executives and several of its officials.\n———\nThe Standard & Poor's 500 index advanced 20.06 points, or 0.9 percent, to 2,349.01.\nThe Dow Jones industrial average surged 183.67 points, or 0.9 percent, to 20,636.92.\nThe Nasdaq composite gained 51.64 points, or 0.9 percent, to 5,856.79.\nBenchmark U.S. crude lost 53 cents, or 1 percent, to $52.65 a barrel in New York. Brent crude, used to price international oils, fell 53 cents to $55.36 per barrel in London.\nWholesale gasoline slipped 2 cents to $1.72 a gallon. Heating oil fell 2 cents to $1.63 a gallon. Natural gas decreased 6 cents, or 2 percent, to $3.16 per 1,000 cubic feet.",
    "source_domain": "abcnews.go.com",
    "title": "Business Highlights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/business-highlights-46850464"
}