{
    "authors": [
        "Abc News",
        "More Cheyenne"
    ],
    "date_download": "2018-02-02 22:51:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Rand Paul voices support for memo, citing privacy rights",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Frand-paul-voices-support-memo-citing-privacy-rights%2Fstory%3Fid%3D52798953.json",
    "image_url": "http://a.abcnews.com/images/Politics/Rand-Paul-01-as-gty-180119_3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sen. Rand Paul, a Republican from Kentucky who recently was attacked by a neighbor while working on his lawn, said he believes the anger and polarization around the country fueled the assault.\n“Somebody who is going to attack you has to have something else wrong other than your yard,” he said.\n“With the whole idea of the country being angry, over your yard or even the guy that shot us in the ball field … There's just some people so angry,” said the senator, who was on a baseball field over the summer when a gunman shot Rep. Steve Scalise, R-LA, and three others.\nABC News\nThe neighbor, 58-year-old Rene A. Boucher of Bowling Green, Kentucky, admitted to the assault, but denied accusations that it may have been politically motivated, according to court documents. Boucher was charged with assaulting a member of Congress resulting in personal injury, a felony under federal law, the documents say.\n“I didn't know how badly I was hurt in the beginning,” Paul said of the injury. “To describe how much it hurt, I couldn't sit up. I had to have help to sit up for the first four or five weeks,” he said. “Who knew you had to have armed protection to mow your yard?\"\nHe was wearing hearing protection when he was attacked from behind, he said. The attack ultimately left him with five broken ribs, three of which will heal in a crooked fashion.\nPaul also discussed news of day with the co-hosts, including the release of a Republican memo accusing the Department of Justice of political bias. Paul appeared just minutes before the memo was posted online by the House Intelligence Committee but voiced his support for its release.\n“If you look at my position, I had the same position under President Obama that I have under President Trump and that is the power to listen to people's conversation, your private conversations are private and nobody else's business and the government should not reveal that,” Paul said, prior to the memo's release.\nABC News\nThe memo was first drafted by the chairman of the House Intelligence Committee, Rep. Devin Nunes, R-Calif, amd is critical of Deputy Attorney General Rod Rosenstein for his role in renewing a surveillance warrant on former Trump campaign aide Carter Page after Trump took office.\nThe president approved its release on Friday, despite a statement Wednesday in which the FBI expressed \"grave concerns about material omissions of fact that fundamentally impact the memo's accuracy.\"\nPaul falls on the side of “privacy advocates,” he said, and is worried about information getting into the wrong hands.\n“The worrisome thing is the government has all of your information. Do you want them releasing it willy-nilly against their enemies?” he said. “And think who the enemies are. They're people who are minorities of opinion, minorities of color. People who have a lifestyle that other people think is unacceptable. Do you want the government or the majority to be able to selectively target their enemies?”",
    "source_domain": "abcnews.go.com",
    "title": "Rand Paul voices support for memo, citing privacy rights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/rand-paul-voices-support-memo-citing-privacy-rights/story?id=52798953"
}