{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 19:46:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Flatest-trump-drops-hampshire-firefighters-53855790.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_7eafd1a69a294b158c7636bde5bb256d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on President Donald Trump and opioid drug addiction (all times local):\n3:15 p.m.\nPresident Donald Trump is declaring the need for a nationwide public relations effort to convince Americans, and particularly children, to not start using drugs.\nHe announced a new website — crisisnextdoor.gov — that warned of the dangers of opioids, including fentanyl. He also called for broadcasting \"great commercials\" during \"the right shows\" that demonstrate to children \"how bad\" drugs are.\nTrump said tougher borders were needed to prevent the flow of drugs to the United States. He told the audience in Manchester, New Hampshire, that the nation needed a stronger southern border and a crackdown on sanctuary cities — including nearby Lawrence, Massachusetts — that he says supply drugs the nation's heartland.\n———\n2:55 p.m.\nPresident Donald Trump says the nation \"must get tough\" with drug dealers, which includes utilizing the death penalty.\nTrump unveiled his plan to combat the nation's deadly opioid addiction in a speech Monday in Manchester, New Hampshire, a state ravaged by the drug.\nTrump said \"failure is not an option\" and vowed that \"addiction is not our future.\"\nHe vowed to help create \"a generation of drug-free children.\" And he complained that, under the current law, a dealer could sell a drug that could kill hundreds but only receive a short prison sentence.\nThis is Trump's first visit as president to New Hampshire. His victory there in the 2016 Republican primary helped propel him to the nomination, though he lost the state narrowly in the general election to Hillary Clinton.\n———\n2:50 p.m.\nMelania Trump says \"real progress\" is being made in combatting the nation's opioid crisis because of the hard work of doctors and nurses across the country.\nShe introduced President Donald Trump at an event Monday in Manchester, New Hampshire, where he's outlining more elements of his plan to combat the opioid addiction.\nOne element of the plan includes applying the federal death penalty to drug traffickers where applicable under current law. Raising education and awareness, and expanding access to proven treatment and recovery efforts.\nMrs. Trump spoke about her visits to hospitals and clinics that help children who were born addicted to opioids.\n———\n2:10 p.m.\nPresident Donald Trump has dropped in on New Hampshire firefighters before he gives a speech about the nation's opioid drug crisis.\nTrump and his wife, Melania, stopped at fire department headquarters in downtown Manchester on Monday.\nEight firefighters stood in front of a truck emblazoned with \"Rescue 1.\"\nTrump told the firefighters he's getting a \"big response\" in Congress for his three-part plan to end the drug epidemic. The plan focuses on education and raising awareness, law enforcement, and expanding access to proven treatment and recovery efforts. One element includes subjecting drug traffickers to the federal death penalty.\nTrump is making his first visit to New Hampshire since becoming president.\n———\n3:00 a.m.\nPresident Donald Trump's plan to combat opioid drug addiction calls for stiffer penalties for drug traffickers, including the death penalty where it's appropriate under current law.\nAdministration officials say Trump also wants Congress to pass legislation reducing the amount of drugs necessary to trigger mandatory minimum sentences on traffickers who knowingly distribute certain illicit opioids.\nThe president is scheduled to unveil his plan Monday in New Hampshire, a state hard-hit by the crisis. He'll be accompanied by first lady Melania Trump, who has shown an interest in the issue, particularly as it pertains to children.\nTrump has mused openly in recent weeks about subjecting drug dealers to the \"ultimate penalty.\"\nHis three-part plan includes multiple steps to raise awareness, cut the illicit drug flow and expand proven treatment options",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Trump wants PR effort on dangers of drugs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/latest-trump-drops-hampshire-firefighters-53855790"
}