{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:21:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "At least 200 dead in Sierra Leone mudslides and flooding",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fofficial-200-dead-sierra-leone-floods-49204542.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_57cd03fa17a040a48e4d8a59c45f03a9_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Mudslides and torrential flooding killed at least 200 people in and around Sierra Leone's capital early Monday following heavy rains, with many victims trapped in homes buried under tons of mud.\nSurvivors and volunteers dug through the mud and debris at times with their bare hands in a desperate search for missing relatives, and military personnel were deployed to help with the rescue operation in the West African nation.\nInitial Red Cross estimates said as many as 3,000 people have been left homeless by the disaster, and the figure is expected to rise. Communications and electricity also have been affected.\nThe mortuary at Connaught Hospital was overwhelmed by the number of dead, and bodies had to be spread out on the floor, said coroner's technician Sinneh Kamara.\nAt least 200 bodies had been brought to the facility already, and that toll did not include the untold numbers buried alive in their homes as they slept. More bodies also were expected to be found as floodwaters receded.\nIn an interview with the Sierra Leone National Broadcasting Corp., Kamara urged the health department to deploy more ambulances to bolster the four belonging to the hospital.\nThe broadcaster interrupted regular programming to show scenes of people trying to retrieve the bodies of relatives, and some were shown carrying the dead to the morgue in rice sacks.\nThe president's office released a statement encouraging people to relocate to safer parts of Freetown and sign up at registration centers. The office made no mention of the death toll.\n\"The government is fully seized of the situation and in collaboration with our development partners, is undertaking a coordinated response to provide emergency services to our affected compatriots,\" it said.\nOne particularly hard-hit area was the suburb of Regent, located east of Freetown.\n\"The mudslide swept down from the hills on the outskirts of Freetown early this morning and spared nothing in its path,\" said Sasha Ekanayake, the Sierra Leone director for the charity Save the Children. \"Houses are buried and entire families are missing, including children.\"\nHomes were destroyed by the flooding, while others were inundated by the floods, leaving many without shelter, Ekanayake said, adding that some children have been separated from their families.\n\"In places, entire communities seem to have been washed away and whatever is left is covered in mud,\" said Abdul Nasir, program coordinator for the International Federation of Red Cross and Red Crescent Societies.\nHe said Red Cross volunteers have been digging with their bare hands and whatever tools available to search for survivors.\n\"They are also caring for and helping family members who are desperately waiting for news of their loved ones,\" Nasir said.\nMany of the impoverished areas of Sierra Leone's capital are close to sea level and have poor drainage systems, exacerbating flooding during the rainy season.\nFreetown also is plagued by unregulated building of large residential houses in hilltop areas.\nDeforestation for firewood and charcoal is one of the leading factors of worsening flooding and mudslides. Freetown's drainage channels also are often clogged because of garbage dumping due to insufficient sanitation services in many areas.",
    "source_domain": "abcnews.go.com",
    "title": "At least 200 dead in Sierra Leone mudslides and flooding",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/official-200-dead-sierra-leone-floods-49204542"
}