{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:46:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Frank Broyles, who led Arkansas to 1964 title, dies at 92",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ffrank-broyles-led-arkansas-1964-title-dies-92%2Fstory%3Fid%3D49213055.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0813/dm_170813_MLB_Coley_Harvey_on_Harpers_injury/dm_170813_MLB_Coley_Harvey_on_Harpers_injury_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "FAYETTEVILLE, Ark. -- Frank Broyles, who guided Arkansas to its lone national football championship and later molded the overall program as athletic director, died Monday at the age of 92.\nBroyles died from complications of Alzheimer's disease, according to a statement from his family, who said he \"passed peacefully in his home surrounded by his loved ones.\"\nBroyles won almost 71 percent of his games in 19 years as Razorbacks football coach. He became the school's athletic director in 1974 while still coaching, eventually retiring from the gridiron to focus on administrative duties after the 1976 season.\nAs athletic director, Broyles led an overhaul and upgrade of Arkansas' facilities -- as well as leading the school in its move to the SEC. Following his coaching career, Broyles, who earned a spot in the National Football Foundation's College Hall of Fame, served as an analyst on ABC's college football telecasts from 1977 to 1985.\nWhile his coaching record of 144-48-5 at Arkansas defined the first part of his career, Broyles' legacy is every bit equaled by his work as athletic director.\nArkansas' athletic facilities underwent a near-complete overhaul following the school's move from the Southwest Conference to the SEC in 1991.\nBroyles spearheaded the fundraising efforts that led to the construction of Bud Walton Arena, the renovation of and additions to Razorback Stadium and the building of Baum Stadium. He also guided the school as it built indoor and outdoor tracks, a tennis facility and the athletic administrative complex that bears his name.\nHe was known for his ability to identify top coaches, both head coaches and assistants.\nBroyles was responsible for hiring basketball coaches Eddie Sutton and Nolan Richardson as well as Lou Holtz and Ken Hatfield in football. He also hired former great John McDonnell in track.\nMcDonnell won 40 national championships with the Razorbacks, while Richardson led Arkansas to the 1994 national championship in men's basketball.\nBroyles retired as athletic director in 2007, moving into a fundraising role with the school's Razorback Foundation until leaving that role in 2014.\n\"For the past 56 years, I have had the privilege or working in the only job I ever wanted -- to be the head football coach and then the athletic director of the Razorbacks,\" Broyles said at the time. \"The Razorbacks have always been my passion.\"\nHe spent much of his time later in life attending various Arkansas sporting events and raising money for Alzheimer's awareness after the 2004 death of his wife, Barbara, following a battle with the disease.\nBroyles started the Frank and Barbara Broyles Foundation CareGivers United, an Alzheimer's education organization, and wrote a book that published more than 800,000 copies and focused on helping those who care for loved ones with Alzheimer's.\n\"In 50 years, people are going to look back and that's what they are going to remember him for, his second legacy,\" said Broyles' daughter, Betsy Arnold.\nUnder Broyles as coach, the Razorbacks won or shared seven Southwest Conference titles and went to 10 bowl games.\nThat included a win over Nebraska in the Cotton Bowl following the 1964 regular season, which left the Razorbacks 11-0. Alabama was also undefeated entering the bowl season and was named the national champion by The Associated Press poll, but the Crimson Tide lost their bowl game to Texas -- leading to Arkansas being named the champion by the Football Writers Association of America.\nThe AP poll soon changed its policy and began naming its champion following the bowl games.\nSeveral prominent football figures were members of the undefeated 1964 football team, including Dallas Cowboys owner Jerry Jones, former Miami Hurricanes and Cowboys coach Jimmy Johnson and Hatfield.\n\"He's a life teacher,\" Jones told the AP in 2014. \"He always spoke about football as it related to life. ... All things pointed to life's lessons.\"\nOne of Broyles' first moves as athletic director was the hiring of Sutton, the coaching great who took over a struggling basketball program and turned it into a national power.\nFollowing Sutton's departure, Broyles again struck coaching gold with the hiring of Richardson -- though the two strong personalities clashed when Richardson was fired in 2002 and claimed he was a victim of racial discrimination, a lawsuit that was eventually ruled without merit.\nAt Decatur, Georgia, Broyles was a star in football, basketball and baseball. He won 10 letters in those sports at Georgia Tech and was the All-SEC quarterback in 1944 and 1946.\nHe graduated from Georgia Tech in 1947 with an industrial management degree. Broyles was drafted in the third round by the Chicago Bears but turned down professional football and baseball offers before accepting a position on Bob Woodruff's staff at Baylor.\nAfter a year as an assistant at Florida, Broyles returned to Georgia Tech as the offensive backfield coach and the Yellow Jackets won 31 straight.\nIn 1957, Broyles was hired as head coach at Missouri and guided the Tigers to a 5-4-1 record. The following January, Arkansas athletic director John Barnhill offered Broyles the Arkansas job vacated by Jack Mitchell.\nBroyles' first team started 0-6 and finished 4-6. Only one other time did the Razorbacks finish below .500 under Broyles.\nA couple dozen of Broyles' players or assistants became head coaches, leading to the creation of the annual Broyles Award -- given to the nation's top assistant coach -- in his honor.\nBroyles had four sons and two daughters with his first wife, Barbara, and later married Gen Whitehead in late 2005.\n\"I will forever be grateful for the generosity, graciousness and unwavering support he extended to me when I came to the University of Arkansas,\" Arkansas athletic director Jeff Long said. \"The thoughts and prayers of the entire Razorback nation are with his wife, Gen, his children and the entire Broyles family.\"\nThe Associated Press and ESPN Stats & Information contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Frank Broyles, who led Arkansas to 1964 title, dies at 92",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/frank-broyles-led-arkansas-1964-title-dies-92/story?id=49213055"
}