{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 06:28:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "CSX railroad wants shareholder vote on hedge fund's demands",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fcsx-railroad-shareholder-vote-hedge-funds-demands-45501165.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/csx-railroad-shareholder-vote-hedge-funds-demands-45501165",
    "language": "en",
    "localpath": null,
    "maintext": "CSX wants its shareholders to vote on the demands a hedge fund is making as it seeks to install the executive who led Canadian Pacific's turnaround at the U.S. railroad.\nThe Jacksonville, Florida-based CSX said Tuesday it will call a special shareholder meeting so investors can have a say on the requests from Paul Hilal's hedge fund, which it detailed in a statement.\nThe railroad said the hedge fund and railroad executive Hunter Harrison want excessive compensation and enough board seats to effectively control CSX even though the Mantle Ridge fund controls less than 5 percent of the railroad's stock.\nCSX said it is open to hiring Harrison to lead the railroad, but not on the expensive terms he wants. The railroad said it estimates that Harrison's requested compensation would cost more than $300 million over four years with much of the payment coming up front.\n\"The CSX board believes such an employment arrangement for an incoming CEO is exceptionally unusual if not unprecedented,\" the railroad said in a statement.\nThe Mantle Ridge hedge fund said it holds 4.9 percent of CSX's stock and wants the railroad to install the operating model Harrison used at CP and Canadian National to reduce costs and improve profits.\nHilal said he had hoped to negotiate an agreement privately, but he welcomed the shareholder vote.\n\"We remain fully confident in a favorable outcome for CSX and its shareholders and are excited for the future,\" Hilal said.\nThe date of the special shareholder meeting has not been set, but investors must own CSX stock on March 16 to have a vote.\nCSX Corp.'s current Chairman and CEO Michael Ward is nearing retirement, and the railroad said it was engaged in succession planning when it was approached by Hilal's hedge fund last month.\nThe 72-year-old Harrison retired last month from Canadian Pacific railroad several months earlier than he planned and negotiated an agreement that would let him work at either CSX or Norfolk Southern railroads.\nHarrison came out of retirement in 2012 to lead Canadian Pacific after Pershing Square Capital took a large stake in the railroad and forced management changes.\nA year ago, Harrison led a failed Canadian Pacific bid to acquire Norfolk Southern railroad. Canadian Pacific abandoned its roughly $30 billion bid for Norfolk Southern Corp. after encountering opposition from the railroad, politicians and some customers.",
    "source_domain": "abcnews.go.com",
    "title": "CSX railroad wants shareholder vote on hedge fund's demands",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/csx-railroad-shareholder-vote-hedge-funds-demands-45501165"
}