{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 08:07:10+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Fcardinals-te-jermaine-gresham-helps-thankful-passenger-make%2Fstory%3Fid%3D55553159.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "TEMPE, Ariz. -- They say no good deed goes unpunished.\nMake that no good deed goes unnoticed.\nArizona Cardinals tight end Jermaine Gresham's act of kindness toward a fellow traveler Wednesday saved her from missing a flight and has caught the attention of social media.\nA little after 4:30 p.m. ET, Delilah Cassidy tweeted about a potential travel disaster that ended with a chance interaction with Gresham, who essentially swooped in to save her day, all for $50.\nCassidy, who according to her Twitter profile attends law school at Arizona State, was boarding a flight when she was informed by the American Airlines gate agent that she would have to pay to carry on her bag. She tried to consolidate her bags, but after measuring, the gate agent told her she would have to pay $50.\nCassidy, who had just returned from a European trip, said her credit cards weren't working. She tried to pay cash at the gate, but the agent told her she'd have to go back to the ticket counter to pay with cash. That would've meant missing her flight.\nShe tried to plead with the gate agent, who wouldn't budge. Then Gresham, whom Cassidy didn't recognize, came up and asked how much the charge was. He was told $50 and said, \"I got it,\" as Cassidy tweeted.\n\"I'm astonished and tell him it's fine not to worry and he hands the lady his card as the American Airlines employees stand in silence shocked by this man's generosity. They swipe the card and he tells me to have a great flight and hop on board,\" Cassidy tweeted.\nOnce on board, she tried to offer Gresham, whom she still didn't recognize, cash as she passed by him in first class. He wouldn't accept it and told Cassidy to pay it forward.\n\"I'm crying as I write this and as I board the flight. This man was an angel,\" she tweeted.\nIt wasn't until after her flight that she found out the man who helped her was Gresham.\nThat tweet of her photo with Gresham has been liked more than 11,000 times.",
    "source_domain": "abcnews.go.com",
    "title": "Cardinals TE Jermaine Gresham helps thankful passenger make flight",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/cardinals-te-jermaine-gresham-helps-thankful-passenger-make/story?id=55553159"
}