{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:46:16+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcalifornia-chief-vows-review-stabbing-homeless-man-54697950.json",
    "image_url": "http://abcnews.go.com/US/wireStory/california-chief-vows-review-stabbing-homeless-man-54697950",
    "language": "en",
    "localpath": null,
    "maintext": "A California police department will review its procedures after a restaurant patron with his 5-year-old daughter on his lap was fatally stabbed inside a crowded beachfront steakhouse by a man authorities say was homeless.\nOfficers should have responded in person to initial reports about the man rather than simply monitoring his actions via a security camera on the pier, Ventura police Chief Ken Corney told the Los Angeles Times .\nThe slaying highlights the challenges often faced by police when they deal with people who are homeless or mentally ill.\nLaw enforcement has sometimes been accused of over-policing the homeless community, leading to violent encounters.\nBut in Ventura, the lack of a police response has come under scrutiny. Residents gathered at a City Council meeting Monday night to vent frustrations over how officials are handling the homeless and mentally ill population.\nAuthorities say Jamal Jackson walked up to a table occupied by customer Anthony Mele on April 18 and stabbed him in the neck. The 35-year-old died at a hospital the following day. His daughter was not injured.\nThe attack came after a decision was made at the police 911 center to observe the 49-year-old Jackson on a security camera at the city pier, where homeless people often congregate.\n\"They didn't see any behavior that appeared to be concerning or significantly disruptive,\" Corney said. But he conceded, \"our practice is not to handle these calls by security cameras. It is to put boots on the ground.\"\nAn administrative review is underway, he told the Times.\nJackson, a convicted felon, faces a first-degree murder charge. He has not entered a plea and is due in court this week. It was unclear if he has an attorney.\nProsecutor Richard Simon said customers and a restaurant employee followed Jackson from the restaurant after the stabbing, even though he still had the knife. They kept track of him until police arrived and arrested him.",
    "source_domain": "abcnews.go.com",
    "title": "Police chief vows review after homeless man accused in death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/california-chief-vows-review-stabbing-homeless-man-54697950"
}