{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2017-04-18 06:14:54+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "US Supreme Court stops execution of Arkansas death row inmate",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fus-supreme-court-stops-execution-arkansas-death-row%2Fstory%3Fid%3D46854837.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_3519092b8cfd4108a5a6b3fdee1bc8cc_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Supreme Court on Tuesday denied a request by the state of Arkansas to carry out the execution of a death row inmate who was scheduled to die before midnight.\nThe court delivered its ruling early Tuesday morning denying a request to vacate a stay of execution for convicted murderer Don Davis.\nIf carried out, the execution would have been the state’s first in nearly 12 years.\nArkansas Governor Asa Hutchinson said he is \"disappointed in this delay for the victim’s family.\"\n\"While this has been an exhausting day for all involved, tomorrow we will continue to fight back on last minute appeals and efforts to block justice for the victims’ families,” the governor added.\nArkansas Attorney General Leslie Rutledge had asked the Supreme Court to allow Davis' execution to go forward. Davis' death warrant expired at 12 a.m. Tuesday.\nDavis is expected to head back to death row, even though he was already served his \"last meal\" on Monday.\nArkansas initially planned to execute eight convicts between Monday and April 27 as it rushes to use the state’s supply of a key lethal injection drug before it expires at the end of the month.\nArkansas' supply of midazolam, one of three drugs in a lethal cocktail, expires on April 30 and the state said it has no source for additional doses.\nThe state has not executed anyone since 2005.\nThis is a breaking news story. Please check back for updates.\nABC News' Darren Reynolds contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "US Supreme Court stops execution of Arkansas death row inmate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/us-supreme-court-stops-execution-arkansas-death-row/story?id=46854837"
}