{
    "authors": [
        "Abc News",
        "John Verhovek",
        "More Emily",
        "More John"
    ],
    "date_download": "2018-04-24 23:45:06+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Democrats and Republicans are watching the Arizona special election for signs of their political standing leading into the November midterms.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Farizona-special-polls-open%2Fstory%3Fid%3D54702869.json",
    "image_url": "https://s.abcnews.com/images/Politics/arizona-special-election-lesko-trump-tiperneni-ap-jc-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Midterm Elections? Add Midterm Elections as an interest to stay up to date on the latest Midterm Elections news, video, and analysis from ABC News. Add Interest\nDemocrats and Republicans are watching the Arizona special election for signs of their political standing leading into the November midterms.\nA Democratic loss by a single digit will be seen by that party as a \"symbolic victory\" and as evidence that enthusiasm remains strong. However, Republicans seeking to guard their deep-red stronghold worry that a loss could signal that their hold on the House of Representatives is in trouble.\nFacing off tonight is Democrat and cancer research advocate Hiral Tiperneni against Republican former state senator Debbie Lesko.\nPolls close at 7pm MST (10pm EST) but Arizona requires its Secretary of State’s office to withhold results until an hour after polls close, so first results will not start coming in until at least 8pm MST (11pm EST).\nAnita Snow/AP\n7:26 PM — Conor Lamb roots for Tiperneni\nRep. Conor Lamb, the Democrat who won Pennsylvania's special election last month, tweeted out a good luck message to Democrat Hiral Tiperneni in her election tonight.\nLamb, who won a district President Trump carried by 20 points, wrote that Tiperneni \"is a great candidate who's run a grassroots campaign against the same super PACs & special interests we faced in PA.\" He urged Arizona voters to support her.\nRooting for @hiral4congress today in Arizona's special election. Dr. Tipirneni is a great candidate who's run a grassroots campaign against the same super PACs & special interests we faced in PA. If you're in #AZ08, get to the polls & help win another one for working families. — Conor Lamb (@ConorLambPA) April 24, 2018\n6:31 PM — Arizona Special: It's not like Pennsylvania's contest\nFiveThirtyEight, a partner of ABC News, reports that for Democratic candidate Hiral Tiperneni to win, she would need to outperform Conor Lamb's numbers in last month's special election in Pennsylvania.\nThey note the voters in the district are older and white (the area is popular with retires) and these voters tend to vote Republican.\nIn their analysis, they conclude: \"Even if, as expected, Democrats do lose this race, it could still be good news for their prospects in November. The key question to ask is this: How much did Tipirneni outperform partisan-lean-based expectations by?\"\nFiveThirtyEight also discussed the special election in their podcast.\nDuring the conversation, politics writer Clare Malone points out the Arizona contest is not like the March special election in Pennsylvania's 18th Congressional District.\n\"Pennsylvania has a more recent history of voting Democratic,\" she said, adding that tonight's contest is \"a bit of a different political landscape.\"\nThe entire podcast can be heard here.\n5:25 PM — By the Numbers\nSince the April 17th primary, where both candidates faced fairly competitive races, Republican Debbie Lesko has outraised Democrat Hiral Tiperneni.\nLesko has brought in $350,748, according to Federal Election Commission data, while Tiperneni has raised $229,335.\nSince after the primary, outside groups have spent a total of $1,357,590 on the race, overwhelmingly in favor of Lesko.\n4:30 PM — Trump tweets for GOP candidate\nPresident Donald Trump waded into the election with a tweet encouraging people to vote for Republican candidate Debbie Lesko.\nArizona has a history of strong early voting. As of Monday, 155,694 voters had cast ballots, according to early voting data from the Arizona secretary of state's office. The district has 455,660 registered voters.\nLesko is favored to win but the president's tweet could be an effort to pump up the final margins. Most Democrats would consider it a “victory” of sorts if their candidate, Hiral Tiperneni, loses by single digits.\nArizona, please get out today and vote @DebbieLesko for Congress in #AZ08. Strong on Border, Immigration and Crime. Great on the Military. Time is ticking down - get out and VOTE today. We need Debbie in Congress! — Donald J. Trump (@realDonaldTrump) April 24, 2018\n6:00 AM — Polls have opened\nPolls opened in Arizona at 6am MST (9am EST) for a special election to replace former Republican Rep. Trent Franks in the 8th Congressional District.\nA strong performance by the Democratic candidate in this deeply red district would be another sign of the party's enthusiasm and growing strength ahead of the 2018 midterm election.\nThe race pits Democrat and cancer research advocate Hiral Tiperneni against Republican former state senator Debbie Lesko.\nThe deeply red district is composed of Maricopa County -- the home of former Sheriff Joe Arpaio, a hero to the conservative movement. President Donald Trump won the district by 21 points.\nFranks resigned on December 8, 2017, after an investigation was launched into conversations he had with members of his staff.\nThe special election will determine who represents the seat through January 2019. Whoever wins the seat on Tuesday night will have to run and win again in both in the August primary in Arizona, and the general election in November to hold the seat.",
    "source_domain": "abcnews.go.com",
    "title": "Arizona special election: Polls are open",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/arizona-special-polls-open/story?id=54702869"
}