{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:32:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Comic Hari Kondabolu on Trump, racism and his rise to fame",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fcomic-hari-kondabolu-trump-racism-rise-fame%2Fstory%3Fid%3D46844280.json",
    "image_url": "http://a.abcnews.com/images/Politics/ABC-hari-kondabolu-jef-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"Don’t worry, white people,\" Hari Kondabolu jokes on his comedy album, \"Waiting for 2042.\"\n“You were the minority when you came to this country. Things seem to have worked out for you.”\nIt is this sarcasm that distinguishes Kondabolu’s particular style of comedy. He found his voice and a way to make racism funny. Yet his career path was not a linear one.\n“I went from wanting to be a lawyer, to being an immigrant rights organizer, to being a comedian,” said Kondabolu. “So I kind of very slowly -- with subtlety and intention -- so that by the time we got to comedian [my parents] were already on board with ‘this is not going to be what we want.’”\nIt has, however, proven to be what millions of Americans want. Like most comedians, Kondabolu has built his audience over years – performing stand-up across the country, writing and performing on critically-acclaimed shows like \"Totally Biased With W. Kamau Bell\" (with whom he now hosts the Politically Re-Active podcast), and recording full-length comedy albums. But he’s kept his audience -- a loyal and engaged following -- with his consistently unique, astute and unflinching observations on race and class and justice in America.\n“People of color were where the jokes came from,” the Queens-raised, Brooklyn-based comic said about his early exposure to comedy. “We were the props. We were talked about. We didn’t get to write the scripts and we didn’t get to speak for ourselves. So what is it like when it’s the other way around?”\nKondabolu’s comedy carries with it the weight of our American reality. His words have now found their way onto protest placards and internet memes. One of his lines -- “Saying I’m obsessed with racism in America is like saying I’m obsessed with swimming when I’m drowning” -- has been shared widely on social media, and was spotted on marchers’ signs following the death of Eric Garner, a Staten Island man who was killed by police officer Daniel Pantaleo in 2014.\nThe election of Donald Trump and the divisive language used during the 2016 presidential campaign, Kondabolu said, reveals how far we still have to go as a nation when it comes to civil rights. That equality, he argued, will never come about without all Americans actively working toward it.\n“The idea that the civil rights movement is a living thing. It’s not just a period of time,” he said. “There’s something to be said for ignoring something, allowing something to happen. You’re aiding and abetting in racism even if you’re not actively taking part in it.”\nCheck out the full conversation on this week’s episode of \"Uncomfortable.\"\nDownload and subscribe to the \"Uncomfortable\" podcast on Apple Podcasts, Google Play Music, Stitcher, and ABC News podcasts.\nKondabolu was interviewed as part of a series called 'Uncomfortable,\" hosted by Amna Nawaz, that offers in-depth honest conversations with influential figures about issues dividing America.",
    "source_domain": "abcnews.go.com",
    "title": "Comic Hari Kondabolu on Trump, racism and his rise to fame",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/comic-hari-kondabolu-trump-racism-rise-fame/story?id=46844280"
}