{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:13:49+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmercy-thieves-kenya-graft-scandal-president-55533384.json",
    "image_url": "https://abcnews.go.com/International/wireStory/mercy-thieves-kenya-graft-scandal-president-55533384",
    "language": "en",
    "localpath": null,
    "maintext": "\"There will be no mercy for the thieves,\" Kenya's president announced Wednesday amid a growing corruption scandal as diplomats representing 18 Western countries including the United States urged strong action against graft.\nPresident Uhuru Kenyatta spoke a day after 24 officials were charged with corruption-related offenses in a probe linked to the alleged diversion of nearly $80 million.\nThe government will spare no effort to recover all of the money, Kenyatta said. As for those to blame, \"their days are numbered. They will be prosecuted and jailed.\"\nKenya's leader is under increasing pressure as outrage grows over a number of corruption scandals revealed in recent weeks around the ministries of health, energy, agriculture, public service and youth. Kenyatta has long been criticized for not acting against corrupt officials despite numerous vows to crack down.\nIn a statement, the 18 Western diplomats urged strong political leadership and zero tolerance for graft.\n\"When there is evidence of corruption, those responsible should be prosecuted regardless of political party, social stature or personal connections,\" the diplomats said.\nAmong Kenyans, the president's announcement was received with some skepticism.\n\"We know @UKenyatta you are going to sacrifice small thieves and the big thieves will not be touched,\" rights activist Boniface Mwangi said on Twitter.\nThe president, who won a second term last year, declared corruption a national security threat in 2015. At the time he pledged to implement the vetting of customs and revenue officers, suspected by some in the government of denying the country revenue by taking bribes to overlook tax obligations. That vetting has never occurred.\nKenya is considered among the world's most corrupt countries, ranked 143th out of 180 nations by Transparency International in its annual corruption index.\nJohn Githongo, a former anti-corruption adviser to ex-President Mwai Kibaki, told The Associated Press he believes Kenyatta's administration is the most corrupt of the four presidents Kenya has had since independence.\nGithongo said the public is cynical because of a lack of corruption prosecutions, including against some people who still are holding office.\n\"The people being taken to court are involved but given our history in Kenya, these are patsies,\" he said, adding that \"if the president is willing to shore up his legacy then he must be willing to pay the political price of going after\" the people around him.\nSince Kenya's corruption watchdog was created in 1997, all five of its heads have resigned or been forced out of office in what analysts say is a result of the country's deeply entrenched graft.\n———\nFollow Africa news at https://twitter.com/AP—Africa",
    "source_domain": "abcnews.go.com",
    "title": "'No mercy for the thieves' in Kenya graft scandal: President",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/mercy-thieves-kenya-graft-scandal-president-55533384"
}