{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 13:42:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Oprah Winfrey Reveals 42-Pound Weight Loss in Weight Watchers Magazine",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2Foprah-winfrey-reveals-42-pound-weight-loss-weight%2Fstory%3Fid%3D44503470.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-oprah-winfrey-jef-161221_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Oprah Winfrey has long been known for her struggle with weight, but now she is saying she has learned the keys not just to losing pounds, but to gaining a fuller life.\nThe media mogul shared her lessons in Weight Watchers magazine, appearing on the cover for the first time.\n\"She is very open and very open about her journey on Weight Watchers,\" Theresa DiMasi, the magazine's editor in chief, told ABC News.\nWinfrey, who has lost 42 pounds since she started the program, said that setting a clear intention has been the key to her success this time around.\n\"Intention is the most powerful principle that rules my world,\" she told the magazine. \"I do nothing without first thinking about why I'm doing it. What is the real motivation?\"\nShe said her intention is to live more fully, which is now the focus of the new Weight Watchers \"Live Fully\" campaign, and a new commercial featuring Winfrey sharing an elegant outdoor dinner with other people on the program.\nWeight Watchers\n\"When people struggle [with] losing weight or getting healthier, if you have a clear intention, that actually really helps,\" DiMasi said.\n\"The fullness of life, the fullness of being, the self-acceptance, I'd never done that before,\" Winfrey told Weight Watchers. \"I'd always beaten myself up because I was tied to a number.\"\nBut even Winfrey has her setbacks.\n\"At this point I'm wise enough to know that there's no such thing as failure. It's all here to teach me,\" she said. \"I don't look at this as a diet; I see it as a plan for life.\"\nWinfrey also told the magazine that for the longest time, she was afraid of potato chips, but now she denies herself nothing and just doesn't give herself everything at the same time.",
    "source_domain": "abcnews.go.com",
    "title": "Oprah Winfrey Reveals 42-Pound Weight Loss in Weight Watchers Magazine",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/oprah-winfrey-reveals-42-pound-weight-loss-weight/story?id=44503470"
}