{
    "authors": [
        "Abc News",
        "More Geneva"
    ],
    "date_download": "2018-04-24 22:35:32+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Wednesday marks three years since the devastating 2015 Nepal earthquake.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-administration-decide-fate-9000-nepali-tps-holders%2Fstory%3Fid%3D54701029.json",
    "image_url": "https://s.abcnews.com/images/US/rtr_nepal_rubble_search_jc_150430_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pema Lama was at work in New York City three years ago when the 7.8 magnitude earthquake struck her home country of Nepal.\nOver the next four days, she didn’t sleep or eat as she tried to reach her children from more than 7,000 miles away.\n“Finally, finally my son called me,” she said.\nLama is one of nearly 9,000 people from Nepal living in the United States with humanitarian protection known as Temporary Protected Status (TPS).\nThe Trump administration must decide by Wednesday whether to terminate status for Nepal, which was granted after the April 25, 2015 earthquake left approximately 9,000 people dead, 22,000 injured and 755,000 homes significantly damaged or destroyed.\nRoughly 25 to 33 percent of Nepal’s population - eight million people - were affected.\nWednesday is the three-year anniversary of the earthquake.\nLama, who works as a nanny, came to the U.S. in 1994, leaving her children – ages 4 and 6 – behind. She said she stayed in the U.S. for a “better chance, better education and better future for me and my kids.”\nProtected status allowed her to travel to Nepal this year and \"touch my kids and celebrate my daughter's birthday after 24 years.\"\nThe deadline for Nepal arrives amid a slew of TPS terminations as the administration has taken a strict interpretation on what conditions qualify for an extension.\nOver the past year, the Department of Homeland Security (DHS) announced it would terminate status for El Salvador, Haiti, Nicaragua and Sudan – more than an estimated 300,000 people that will either need to leave the United States of face residing illegally.\nHomeland Security Secretary Kirstjen Nielsen in January announced an 18-month extension for Syria.\nAnd the decision deadline for Honduras is next week.\nSomalia, Yemen and South Sudan also have protected status and will be up for renewal in the next months and into next year.\n“America is a very family-oriented country, so I am hoping for the best,” said Lama as the deadline looms.\nThe DHS Secretary is authorized to grant TPS to nationals of foreign countries when conditions temporarily prevent people from returning safely. The program provides for work authorization but does not offer a pathway to citizenship.\nLama is also the primary financial provider for her family in Nepal.\nRemittances from Nepali citizens working abroad is roughly 30 percent of Nepal's GDP, according to Austin Lord, Ph.D. Student of Sociocultural Anthropology, Cornell University.\n\"I would argue that remittance is probably the most effective and efficient way to support locally-driven and earthquake-safe reconstruction, as compared to institutionally managed programs that often require significant overhead and that do not adequately cover even half the average cost of construction,” said Lord.\nLama was able to help her children get an apartment after nearly three years of living under a tent and then from one friend’s house to another.\n“There’s no shelters, like in America,” she said.\nHumanitarian relief was extended for Nepal for 18-months in 2016, after DHS determined that although conditions in Nepal had improved, the “recovery and reconstruction process was delayed and people remained without homes or adequate infrastructure.\nAt this time DHS does not have an announcement regarding Nepal's TPS, but one is expected in the coming days, according to an administration official.\n“TPS allowed me to continue working and become part of a community,” said Namrata Pradhan, Nepali TPS holder, domestic worker, and organizer at Adhikaar (NYC).\nPradhan said that after moving to the U.S. a decade ago, she was forced to leave behind her legal education and become a nanny, but as a TPS holder she was able to join the staff at both Adhikaar and the National Domestic Workers Alliance.\n“For them [DHS], it is just a single decision like a signature on a piece of paper. But for me and the almost 9,000 other Nepalis with TPS like me, this is a life-changing decision. Our homes are here, we are as American as anyone else and we deserve to be here,” she said.\nNepal has made some limited progress in stabilizing and rebuilding since the earthquake, but a humanitarian crisis remains, found a recent Catholic Legal Immigration Network Inc. (CLINIC) report.\nThe report concluded that the safe return of Nepali TPS holders and their families remains impossible at this time due to the severe lack of adequate shelter, food, water, healthcare, education and jobs as well as other risks.\n“It is critical for the TPS designation for Nepal to be extended, in light of the slow pace and numerous obstacles to reconstruction and recovery from the 2015 earthquake,” said Jennifer Ruddle, CLINIC staff attorney.\nLama said that when she visited this March, she witnessed the country “still struggling” with clean water and air.\n“People are happy and trying to build their country, but how?” she said.\nConor Finnegan contributed to this story.",
    "source_domain": "abcnews.go.com",
    "title": "Trump administration to decide fate of nearly 9,000 Nepalis in US with humanitarian protection",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-administration-decide-fate-9000-nepali-tps-holders/story?id=54701029"
}