{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:15:07+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Morton joined \"The View\" to discuss the upcoming royal wedding.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Fandrew-morton-meghan-markle-prince-harrys-relationship-54696424.json",
    "image_url": "https://s.abcnews.com/images/theview/180424_view_andrew_morton_1154_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Andrew Morton on Meghan Markle, Prince Harry's relationship\nFederal wedding is just a few weeks away and were all dressed up to celebrate Prince Harry and his bride to be made it Markel who royal biographer Andrew Morton takes a candid look at the latest addition to the family in his new book Macon. And Hollywood princess and he's here to tell me if I have a shot at making duchess of I love them and I'm not a our view of your wonderful unless sunny day here and it's just exactly what. One of the things at the royals who that is just theirs and it's fabulous that he's fattening it analytical them fat coordinator fascinate I love absolutely let's talk about the royal family and the fact that Megan Markell is now. Coming into the family she's a divorcing me yeah she's American. My good Paula. Rob looking and that the panelists has been criticized in the past for the lack of diversity shall we say I mean. It's completely white for centuries let's put it that way and that's how does it. I mean this is that this is an assist total sea change that you thanks to roll common relevant. I mean there's of them think something like 11100 people employed by the house only 6% of them ethnic book backgrounds but I find that Megan biracial. African American mobile descended from slaves and also on this under the thumb my that descend from. Robert the Bruce move came knowing about off during a good. So you've got about the fascinating concept is don't give your average home counties so how does a pretty Dylan is she OK with that. Well the free advice is if it's a we and his lifetime. I'm. I think she's passed the world's fast and she feels lady feels to me like Mankins always being widows and he's he's almost like some kind of and national treasure these days. A minister real question do you think that if Harry word heir to the throbbing as William is that they would be quite that okay with it. I didn't think so that's really I think. Finger they would have pulled probably for the bit more carefully about it I think that. Megan's background of being checked out mall I'm very fond of bi racial I'm American I'm trust divorcee to marry. It is the role Thomas I'm get the appellation royal highness is a sign of massive change over the last eighteen years. What it's impossible not to think of Princess Diana now that her youngest son is getting married. And you knew her what would she think of making. Well she beat should have been impressed by the fire that's. How is just didn't just bring stuff smile on his lips is a happy man meant. As a parent she would want to see that all sudden. Should also be thinking she's actually bring something positive to the wolf comments he's challenging. Exceptions. A social mores she and she will be make a real difference. And let's face it but I think this in his today. If Harry was just mind some ordinary bread and the home counties go. The front is. Megan's an interest in person in her Enron she's a chief Kwon law in 36 years have panda I think they're going forwards a bull move all be looking to see how this American princess. France and saw the House of Windsor who. Well Harry and make it met they were set up on a blind date by mutual friend in July 2016. And here's a go though Harry was something of a tabloid figure. Many people wondered if you would ever settle down now if PM Megan had met each other back then do you think we'd be sitting here in the east Cassidy years talking about. And we look I think she would have its issues seen Harry this angry man. Drinking too much getting suffice it paparazzi falling out of balls taking a swim trunks often must plague us as real men now. I'm chip and chase caught in his she's content related like that she would have forced some. Non sky but not. Not for me. Thank you for joining us live now because I love the to have you here people should watch the crown you really think it's happening. Watch out every everything but lots at ground.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Andrew Morton on Meghan Markle, Prince Harry's relationship",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/andrew-morton-meghan-markle-prince-harrys-relationship-54696424"
}