{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2017-01-02 14:19:01+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "ISIS Claims Istanbul Nightclub Attack That Killed 39",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fisis-claims-istanbul-nightclub-attack-killed-39-manhunt%2Fstory%3Fid%3D44509710.json",
    "image_url": "http://a.abcnews.com/images/International/EPA-turkey-nightclub-memorial-jef-170102_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "ISIS claimed responsibility for the shooting rampage at a New Year's Eve celebration at an Istanbul nightclub that killed at least 39 people and injured nearly 70 more, including one American, as authorities continued a manhunt for the assailant.\nThe gunman entered the popular Reina club early Sunday morning armed with what authorities described as a long-barreled weapon. Surveillance video footage of the moments leading up to shooting spree shows the shooter firing his weapon as he approached the club. He killed a policeman and a civilian outside of the club before \"[raining] bullets in a very cruel and merciless way on innocent people\" inside the club, according to Visip Sahin, the governor of Istanbul.\nMost of the victims in the massacre were shot at close range or took bullets directly to the head, an official morgue report said.\nISIS propaganda channels published a statement Monday claiming that the attack was a response to Turkey's military operations against the Islamic State group. The statement suggests that the nightclub was targets because it is where \"Christians celebrate their apostate holiday\" although many of the 39 victims may have been Musliam.\n\"One of the hero soldiers of the caliphate hit one of the most famous nightclubs where Christians celebrate their apostate holiday ... so the Turkish government knows that the Muslim blood it is spilling through its airstrikes and artillery will strike back in the midst of its nation,\" the ISIS statement said.\nFifteen of those killed were Turkish, and the other 24 hailed from a diverse array of countries including Belgium, France, India, Israel, Jordan, Lebanon, Saudi Arabia and Tunisia, according to Turkish media.\nThe Reina club had attracted a diverse crowd of between 400 and 500 patrons from foreign countries as well as Turkey to ring in the new year.\nAmong the nearly 70 people injured was a small business owner from Greenville, Delaware, Jake Raak, who was shot in the leg, family members told ABC station WPVI-TV in Philadelphia. Raak's brother, Michael, told WPVI-TV the bullet may have struck his cellphone, which prevented him from being injured more seriously.\nThe U.S. is not aware of any Americans dying in the attack, the U.S. State Department said early Sunday.\nAt a press conference Sunday, authorities said the assailant arrived wearing a jacket and pants, and is believed to have left wearing different clothing.\nABC News' Darren Reynolds, Devin Villacis, Engin Bas, Benjamin Gittleson, Troy McMullen and The Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "ISIS Claims Istanbul Nightclub Attack That Killed 39",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/isis-claims-istanbul-nightclub-attack-killed-39-manhunt/story?id=44509710"
}