{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:34:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Start the clock for Trump, GOP in last push on taxes, budget",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fstart-clock-trump-gop-push-taxes-budget-51712426.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_b1b3e8f044cd48acb720f331351f9a5b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Republican Party? Add Republican Party as an interest to stay up to date on the latest Republican Party news, video, and analysis from ABC News. Add Interest\nStart the countdown clock on a momentous two weeks for President Donald Trump and the GOP-run Congress.\nRepublicans are determined to deliver the first revamp of the nation's tax code in three decades and prove they can govern after their failure to dismantle Barack Obama's health care law this past summer. Voters who will decide which party holds the majority in next year's midterms elections are watching.\nRepublicans are negotiating with Democrats on the contentious issue of how much the government should spend on the military and domestic agencies to avert a holiday shutdown. An extension of the program that provides low-cost health care to more than 8 million children and aid to hurricane-ravaged Puerto Rico, Texas and Florida need to be addressed. And further complicating the end-of-year talks is the fate of some 800,000 young immigrants here illegally.\nLawmakers are trying to get it all done by Dec. 22.\nA look at the crowded agenda:\n———\nTAXES\nRepublicans are upbeat about finalizing a tax bill from the House and Senate versions for Trump's first major legislative accomplishment in nearly 11 months in office.\n\"I feel very confident we're going to get this done ... at the end of the day we're going to get this to the president's desk and he's going to sign it,\" House Majority Leader Kevin McCarthy, R-Calif., said Sunday in an interview on Fox News Channel.\nThe House and Senate bills would cut taxes by about $1.5 trillion over the next decade while adding billions to the $20 trillion deficit. They combine steep tax cuts for corporations with more modest reductions for most individuals.\nRepublican leaders have struggled to placate GOP lawmakers from high-tax states like California, New York and New Jersey whose constituents would be hit hard by the elimination of the prized federal deduction for state and local taxes. Repeal of the deduction added up to $1.3 trillion in revenue over a decade that could be used for deep tax cuts.\nLawmakers finally settled on a compromise in both bills — full repeal of the state and local deductions for income and sales taxes, but homeowners would be able to deduct up to $10,000 in local property taxes.\nAnd yet it's still not a done deal.\n\"There's a lot of conversation around the fact that in some of the blue states where the taxes are high, the property tax alone, they will not be able to use the $10,000 possible deductions,\" Sen. Tim Scott, R-S.C., said on NBC's \"Meet the Press with Chuck Todd\" Sunday. \"So allowing for income and property taxes, which would cost another $100 billion by the way, to be options for folks in those states would be a better solution. And we're looking at ways to make that happen.\"\nJust a few weeks ago, lawmakers were unyielding on their insistence that the corporate tax rate be slashed from 35 percent to 20 percent. Now, one way to finance the changes on state and local taxes would be to cut the corporate tax rate to 21 or 22 percent instead.\n———\nGOVERNMENT SPENDING\nRepublicans and Democrats are trying to work out a sweeping budget deal. They got a temporary reprieve from a partial government shutdown when they passed a stopgap, two-week bill last Thursday.\nRepublicans want a major boost in defense spending. Democrats want a similar increase for domestic agencies.\nCongress also has to figure out how much disaster aid should be directed to Puerto Rico, Texas and Florida. The Trump administration requested $44 billion last month, an amount lawmakers from hurricane-slammed regions say is insufficient. The latest request would bring the total appropriated for disaster relief this fall to close to $100 billion — and the government still must calculate how much it will cost to rebuild Puerto Rico's devastated housing stock and electric grid.\n———\nCHILDREN'S HEALTH\nFresh federal money for the Children's Health Insurance Program, known as CHIP, ran out on Oct. 1, a blow to the widely popular program that provides low-cost medical care to more than 8 million children. Some states have relied on unspent funds, while others that were running out of money got a short-term reprieve in the two-week spending bill.\nLawmakers hope to agree on a long-term budget solution for a program that's about $14 billion a year.\n———\nIMMIGRATION\nDemocrats want to act now to protect young immigrants who came to the United States illegally as children, with demands that a solution is included in any year-end spending deal.\n\"We will not leave here without a DACA fix,\" said Minority Leader Nancy Pelosi, D-Calif., referring to the Deferred Action for Childhood Arrivals program.\nThese young immigrants, often referred to as Dreamers, face deportation in a few months after Trump reversed administrative protections established by President Barack Obama.\nRepublicans say it can wait till next year and shouldn't bog down the broad budget agreement. However, House GOP leaders likely will require Democratic votes for the spending bill and they have to work out a deal with Pelosi.\n———\nAssociated Press writers Marcy Gordon and Andrew Taylor contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Start the clock for Trump, GOP in last push on taxes, budget",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/start-clock-trump-gop-push-taxes-budget-51712426"
}