{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 16:55:48+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Fboss-year-capitals-owner-ted-leonsis-pays-200%2Fstory%3Fid%3D55532711.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Washington Capitals are in the Stanley Cup Final for the first time in 20 years. That's as special for coaches and players as it is for everyone behind the scenes.\nSo Washington owner Ted Leonsis celebrated by surprising 200 employees of Monumental Sports & Entertainment with tickets and a chartered flight to the first leg of the Stanley Cup Final. According to The Washington Post, the selected employees -- chosen based off how closely they work with the Capitals, and also seniority -- received an email last week from a senior vice president with the subject line: \"Let's go to Vegas.\" They received tickets to either Game 1 or Game 2.\n\"It's truly amazing and out of this world,\" Omar Castro, a guest relations manager, told the Post. \"I never expected an owner of the company to do this. We get to share in this with them. ... He's thinking of us as part of a family, as part of the experience. There's no reason for him to do it. All I can say is a big thanks to Ted and his family for the opportunity, and for truly making this into something memorable for all of us here in the company.\"\nLeonsis organized two chartered flights and also put up the chosen employees up at the Excalibur. Leonsis has owned the Capitals since 1999. He has been a forward-facing figure for the franchise, which is still looking for its first Stanley Cup.\nMost notably, the Capitals could never make it past the Pittsburgh Penguins in the playoffs. The Penguins were 9-1 against the Capitals in their 10 postseason meetings entering this season. Leonsis appeared in the team's locker room after Washington finally knocked off its rivals in the second round. \"It's almost embarrassing it's taken this long for us to get past it,\" he said.\nThis is not the first example of an owner rewarding employees of a long-suffering fan base. In 2016, Chicago Cubs owner Tom Ricketts footed the bill for more than 400 full-time staffers (and their significant others) to attend World Series games in Cleveland. Indians owner Paul Dolan matched the generosity by doing the same for 300 of his employees and their significant others to attend a game in Chicago.\nThe Capitals dropped Game 1 of the Stanley Cup Final to the expansion Vegas Golden Knights 6-4. Game 2 is Wednesday in Las Vegas before the series shifts back to Washington,",
    "source_domain": "abcnews.go.com",
    "title": "Boss of the Year? Capitals owner Ted Leonsis pays for 200 employees to go to Stanley Cup Final games",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/boss-year-capitals-owner-ted-leonsis-pays-200/story?id=55532711"
}