{
    "authors": [
        "Abc News",
        "More Lucien"
    ],
    "date_download": "2018-05-30 23:33:53+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Facing “tremendous legal costs” amid proceedings brought by the special counsel Robert Mueller, “long time friends” of Paul Manafort have set up a legal defense fund.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Flong-time-friends-manafort-set-legal-defense-fund%2Fstory%3Fid%3D55540217.json",
    "image_url": "https://s.abcnews.com/images/Politics/paul-manafort-01-as-ap-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Paul Manafort’s supporters want to help him pay the bills.\nFacing “tremendous legal costs” amid proceedings brought by the special counsel Robert Mueller, “longtime friends” of Manafort have set up a legal defense fund for the former Trump campaign chairman.\n“A gift by you will help Paul and his Team mount the strongest and most thorough legal defense possible,” according to a brief pitch on the website manafortdefense.org, which gained attention on Wednesday.\nIt was not immediately clear when the fund was started or by whom, beyond “longtime friends,” as noted by the website.\nABC News’ inquiries to an email address on the fund’s website were not immediately returned.\nManafort faces two criminal cases in Virginia and Washington, DC, both brought by Robert Mueller and his team of prosecutors as part of their investigation into Russian meddling during the 2016 campaign.\nThe charges against Manafort include bank fraud, money laundering, and other points of financial malfeasance. Manafort has pleaded not guilty to all charges.\nIn a November filing, Mueller’s team revealed that Manafort submitted “a spreadsheet listing his total assets at approximately $28 million,” but added that the special counsel was unable to substantiate that figure.\nProsecutors with the special counsel’s office have seized accounts linked to Manafort at three different banks, according to a court filing, and a federal judge in Washington, D.C., has repeatedly denied Manafort’s attempts to back a $10 million bond set by the court, largely because of Manafort’s complex finances and properties.\nCharles Dharapak/AP, FILE\nNeither the special counsel’s office nor Manafort’s attorney – who is under a gag order in the case – responded to a request for comment.\nA legal defense fund called “the Patriot Legal Expense Fund Trust LLC” was established in February to benefit any individual who \"was an employee, consultant, fundraised or volunteer\" on behalf of President Trump’s campaign, specifically to assist in legal expenses incurred by investigations led by Mueller’s investigation or House and Senate committees. Trump and his immediate family members are excluded from receiving money from the fund.\nIt was not clear whether Manafort has received any money from the “Patriot” fund.\nTrump’s former national security advisor Lt. Gen. Michael Flynn and former Trump campaign political adviser Michael Caputo have both benefited from legal defense funds of their own. Manafort’s longtime business associate, Rick Gates, who pleaded guilty to the special counsel’s charges in February, has solicited donations to help pay his legal bills, too.\nIn an op-ed published this week in The Washington Times, former Trump campaign aide J.D. Gordon lamented the heavy financial toll for witnesses and targets of the various investigations into Russian meddling during the 2016 campaign.\n“Nearly 50 Trump associates from the campaign, transition and administration have been called before the various congressional committees, special counsel and/or grand jury,” Gordon wrote. “We are collectively spending millions of dollars defending ourselves from intense interrogations and blatant perjury traps.”\nManafort is scheduled to go to trial in his case in Virginia in July. His trial in Washington, DC is expected to start in September.\nTrish Turner and Katherine Faulders contributed reporting",
    "source_domain": "abcnews.go.com",
    "title": "'Long time friends' of Manafort set up legal defense fund",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/long-time-friends-manafort-set-legal-defense-fund/story?id=55540217"
}