{
    "authors": [
        "Abc News",
        "Lenny Bourin"
    ],
    "date_download": "2018-02-03 23:12:44+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Eagles fan said he went 'bananas' when surprised by sons with trip to the Super Bowl",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Feagles-fan-bananas-surprised-sons-trip-super-bowl%2Fstory%3Fid%3D52818902.json",
    "image_url": "http://a.abcnews.com/images/US/philadelphia-eagles-plane-ht-jt-180203_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Among the thousands of fans packing in the Super Bowl on Sunday will be two adult sons and one very happy dad who in his words went \"bananas\" when he was surprised with a trip to the championship game.\nInterested in Super Bowl? Add Super Bowl as an interest to stay up to date on the latest Super Bowl news, video, and analysis from ABC News. Add Interest\nEagles fan Jim Mulhern of Downingtown, Pennsylvania, was eating dinner recently with his wife, Anita, and some other family members when he got a call from his son, Jimmy, in Thailand.\nWith the son on speaker phone, dad Jim continued eating his dinner as the conversation started with small talk about the upcoming big game, as seen on a video shot by the family.\nThen Jimmy casually let it spill that he and his brother, Sean, would be taking their father in person to the championship in Minneapolis.\n\"You're kidding,\" Jim Mulhern said quietly, sounding stunned.\nRealizing then it was not a joke, he said, \"Oh my god, you wait to tell me that?\"\nMulhern family\nNow Jim Mulhern and sons Jimmy and Sean are among the thousands of fans who will be packing the stadium in Minneapolis for the match-up, which the Mulherns hope will end in a victory for their beloved Eagles against the New England Patriots.\nJimmy and Sean's sister, Donna, also played a role, Sean told ABC News in an interview Saturday.\n\"A matter of fact, she was able to get my dad his Eagles wear, so that he’s warm,\" Sean Mulhern said.\nDad Jim Mulhern said he's not too worried about the cold in Minneapolis.\n\"The cold weather is one of the things on the bottom of my list as far as this game is concerned,\" he said, adding, however, \"I’m excited about it being an indoor game ... and I think the excitement will pump some blood when it starts to get cold, so I’ll be ready.\"\nMulhern family\nBut most on his mind is excitement for the game and gratitude for his family and their generosity.\n\"Thank God, and if there’s a sports god, thank you to him,\" Jim Mulhern said, \"and then thank you to my boys for what they’ve done and to my daughter.\"\nAmerican Airlines\nAs to the possibility of the Eagles losing?\n\"I wouldn’t even use that word,\" Jim Mulhern said. \"That word is not in my vocabulary for awhile until maybe I get back and see that somebody’s crying somewhere and then I’ll understand what losing is, but it’s not in my vocabulary for a little bit, no sir.\"",
    "source_domain": "abcnews.go.com",
    "title": "Eagles fan said he went 'bananas' when surprised by sons with trip to the Super Bowl",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/eagles-fan-bananas-surprised-sons-trip-super-bowl/story?id=52818902"
}