{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 09:13:47+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Deadline week crunch for health law sign-ups under Trump",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fdeadline-week-crunch-health-law-sign-ups-trump-51712286.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_6e51eb65c960475ab4387433a7619638_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Trump administration came into office looking to dismantle Barack Obama's health care law, but the Affordable Care Act survived. Now the administration is on the hook to deliver a smooth ending to sign-up season, with a crush of customers expected this week.\nFor millions of eligible consumers time runs out on Friday.\nDec. 15 is the last day for procrastinators to enroll in subsidized private coverage in 39 states served by the federal HealthCare.gov website. Consumer interest has remained brisk, even as the Trump administration cut the sign-up season in half, reducing it from roughly from 90 days to 45 days.\n\"It's more likely than ever that they're going to run into real volume problems in the last week because that's when everybody is going to show up,\" said Tim Jost, a legal analyst who closely follows the workings of the ACA.\nHeavy traffic could slow the website, and lead to long hold times at the federal call center. For the vast majority, this is the last opportunity to secure coverage for 2018, or switch from an existing plan. One exception: People living in hurricane-affected areas can get an extension to sign up by Dec. 31 by contacting the HealthCare.gov call center. That could make a difference in states such as Texas and Florida.\nEnrollment fluctuates in the course of the year, but it's estimated that 9 million to 10 million people currently have coverage through the ACA's marketplaces. The markets cater to people who don't have access to a job-based plan, and participation is expected to dip somewhat next year.\nIn a twist, many people eligible for financial help may actually be able to pay lower premiums in 2018. Although list price premiums for the most popular plans went up sharply, so did taxpayer-provided subsidies that limit how much individuals actually have to pay. In many communities, bare-bones \"bronze\" plans are available for no monthly premium to those eligible for subsidies.\nSign-up season has been free of problems up to now, insurers say. Scheduled early Sunday maintenance shutdowns have not been a disruption.\nNonetheless, administration officials at the Health and Human Services department are saying little about their contingency plans for the final week. That's a contrast from the Obama years.\nThe Centers for Medicare and Medicaid Services, which also administers the ACA, did say that the deadline hour will remain the same this year — midnight Pacific time. That means consumers on the East Coast will have until 3 a.m. on Saturday morning to enroll.\nAlthough the Trump administration slashed the advertising budget, HealthCare.gov has been sending out targeted emails to people potentially eligible. Examples:\n— \"Don't forget: Friday, December 15 is the last day to pick a 2018 Marketplace plan.\"\n— \"FINAL DEADLINE: Enroll in a 2018 health plan before December 15 or risk going without Marketplace coverage.\"\n— \"Come back to HealthCare.gov to select a plan before the final deadline or risk missing out on 2018 Marketplace coverage.\"\nDuring the Obama years, officials allowed a grace period for consumers who started an application before the final deadline, but were unable to finish. It's unclear if the Trump administration will allow such extensions, or whether it will strictly enforce the deadline hour. Previous extensions allowed hundreds of thousands of consumers to enroll.\nFailure to provide extensions this year would be a mistake, said Andy Slavitt, who oversaw HealthCare.gov under Obama.\n\"It really would not be fair to people, particularly if there are technology challenges with the last minute surge as there have been every year,\" Slavitt said.\nWhile Dec. 15 is the deadline for states served by HealthCare.gov, that's not the case in all parts of the country. Most states that run their own health insurance websites are providing an extended period for consumers to enroll. In California and New York, for instance, the deadline remains the same as last year — Jan. 31. Other states have deadlines spanning from late December to mid-January.\nEconomist Joe Antos of the business-oriented American Enterprise Institute said the Trump administration has to get it right. Otherwise, it reinforces the Democrats' charge that Trump is bent on sabotaging the health law.\n\"Everything that goes wrong will be attributed to White House malevolence,\" said Antos. \"Donald Trump should not be tweeting negative statements this week. If he were to tweet at all, I would suggest: 'Be sure to check your plan.'\"",
    "source_domain": "abcnews.go.com",
    "title": "Deadline week crunch for health law sign-ups under Trump",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/deadline-week-crunch-health-law-sign-ups-trump-51712286"
}