{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 22:48:36+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmerkel-poland-talks-eu-future-security-53855290.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_3608bb59f1834a7cb9369e9920538f20_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "German Chancellor Angela Merkel said Monday she would be pleased if Poland's talks with the European Union yielded a solution to the standoff over the country's rule of law record.\nDuring a brief visit to Warsaw, Merkel said she was following the negotiations to avert unprecedented EU sanctions over changes to Poland's judiciary pushed by its conservative government.\n\"I would be pleased to hear the European Commission say that the talks were fruitful,\" Merkel said following talks with Polish Prime Minister Mateusz Morawiecki.\nMorawiecki said there was \"light in the tunnel\" but that an agreement to resolve the dispute over Poland's judicial system \"requires understanding on both sides.\"\nThe EU triggered a censure procedure in December that could lead to potential sanctions over Poland's judicial overhaul. The European Commission said at the time it was putting Poland on notice that it was at risk of contravening EU law.\nHowever, the leaders of Poland and Germany said Monday that Europe needs unity to be strong. They stressed agreement on issues such as economic cooperation and providing more support to countries that have received the most migrants since a new wave of mass immigration got underway in 2014-2015.\n\"In the face of the global situation, we understand that our voice will be strong if we have a strong alliance, if we act jointly,\" Merkel said.\nMorawiecki and Merkel also discussed Europe's response to the poisoning in Britain this month of a Russian ex-spy and his adult daughter.\nMerkel said she expects European Union leaders to reach \"strong conclusions\" about the poisoning of Sergei Skripal and his daughter, Yulia, during a summit this week in Brussels.\nSignificant information points to Russia's responsibility for the nerve agent attack and it's now up to Moscow to prove it wasn't involved, the German chancellor said.\nMorawiecki said the entire EU needs to give a firm response so \"the Russian aggressor will know that it cannot permit itself to attack a NATO member state, an EU member state.\"\nRussia has rejected allegations that it was behind the poisonings.",
    "source_domain": "abcnews.go.com",
    "title": "German, Polish leaders discuss EU unity on sanctions, ex-spy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/merkel-poland-talks-eu-future-security-53855290"
}