{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 20:34:43+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Woman charged in pregnant neighbor's death pleads guilty",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fwoman-charged-pregnant-neighbors-death-change-plea-51719535.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_7f58fd7e1b74461a9cc8b52166586757_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A North Dakota woman pleaded guilty Monday in the killing of a pregnant neighbor so she and her boyfriend could keep the baby, though officials are still saying little about how the victim died.\nBrooke Crews, 38, could face life in prison after pleading guilty to conspiracy to commit kidnapping and murder and lying to law officers in the death of 22-year-old Savanna Greywind, of Fargo. Her boyfriend, William Hoehn, 32, has pleaded not guilty to conspiracy to commit kidnapping and murder and lying to law officers.\nHe is scheduled for trial in March, which a prosecutor cited as a reason for continuing to withhold information on the case.\nCrews' attorney, Steven Mottinger, said afterward that the guilty pleas will help his client argue for less than the maximum sentence of life in prison without parole.\n\"Ms. Crews early on indicated that she wanted to take responsibility for her actions,\" Mottinger said. \"From where I stand, she took responsibility today by entering a guilty plea to the three charges.\"\nGreywind was eight months pregnant when she disappeared in August. Kayakers found her body wrapped in plastic in a river. The baby was found alive in the apartment Crews shared with her 32-year-old boyfriend, William Hoehn. Hoehn is scheduled for trial in March.\nCrews didn't offer details on how Greywind was killed. Authorities haven't said either, but Fargo Police Chief Dave Todd has said her death was a \"cruel and vicious act of depravity.\"\nCass County State's Attorney Birch Burdick said further details aren't likely to be released until after Hoehn's case is finished.\n\"As you're well aware, this is one important step in two cases that are intertwined,\" Burdick said outside the courtroom. \"At least our office will be rather circumspect until we've got both cases resolved. Then we can elaborate more fully.\"\nCrews initially claimed that Greywind gave up her newborn daughter, but she later admitted taking advantage of the woman to get the child, according to court documents. Crews told police she arranged to have Greywind come to her apartment and told her how to induce labor. Greywind came back two days later to give her the newborn baby, Crews said.\nBut Hoehn told police a different story, according to the documents. He said he came home on Aug. 19 to find Crews cleaning up blood in their bathroom. Hoehn said Crews presented him with an infant girl and said: \"This is our baby. This is our family.\"\nHoehn told police he took garbage bags containing bloody shoes and his bloody towels and disposed them away from the apartment complex, according to the court documents. Hoehn is scheduled for trial in March.\nAuthorities have not said how the baby was delivered. The baby is now in the custody of her father, Ashton Matheny, who was Greywind's boyfriend.\nEast Central District Judge Frank Racek on Monday asked Crews about letters she sent to the court complaining about a delay in receiving evidence. Crews told the judge that the issue was resolved.\n\"Cases like this we start with initial police reports, lab reports,\" Mottinger said. \"Things come in over a period of time. It's a step by step by process.\"",
    "source_domain": "abcnews.go.com",
    "title": "Woman charged in pregnant neighbor's death pleads guilty",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/woman-charged-pregnant-neighbors-death-change-plea-51719535"
}