{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 09:20:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "The Latest: Building blaze traumatizes London firefighters",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-london-fire-donations-overwhelming-centers-48050094.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_42036bc777fa4ef1b03168f51e8d3ad0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the London high-rise fire (all times local):\n9:55 a.m.\nLondon's fire commissioner says that firefighters have been traumatized by the devastation they witnessed during a high-rise apartment blaze that killed at least 12 people.\nFirefighters have extinguished the last of the flames at the 24-story and are now working to make the building safe so they can continue the search for more victims.\nEntire families are missing, and the death toll is certain to rise. Fire Commissioner Dany Cotton told Sky would be a miracle if anyone were to be found alive.\nCotton says that firefighters are having trouble with the aftermath. She says \"we like to think of ourselves as 'roughty, toughty' and heroes —they are heroes —but they have feelings, and people were absolutely devastated.\"\n———\n8:45 a.m.\nLondon's fire commissioner says it will be a miracle if any survivors are found following a devastating high-rise fire that killed at least 12 people. Authorities have said many more victims are expected.\nDany Cotton told Sky News that authorities don't expect to find anyone else alive after the blaze and that it's too early to speculate on how it started.\nShe said early Thursday that authorities have finally extinguished the last pockets of flame, and are trying to secure edges of the building for a fingertip search.\n--A previous version of this item has corrected the day of Cotton's comments to Thursday, not Wednesday.\n———\n8:10 a.m.\nCommunity centers in London have been overwhelmed by the number of donations flooding in for those left homeless by a high-rise apartment building fire.\nSo much food, clothing, shoes and other items have been coming in that the centers, churches and mosques have had to start turning away new donations. At least 12 people have been killed in the inferno at the 24-story building, with the death toll expected to rise. Dozens of others have been hospitalized.\nMissing people posters have been put up throughout the north London neighborhood of North Kensington. Celebrity chef Jamie Oliver has offered free food for survivors at one of his nearby eateries.\n———\n7:40 a.m.\nLondon fire investigators are painstakingly searching for more victims of an inferno that engulfed a high-rise apartment building and killed at least 12 residents.\nAuthorities say the death toll is expected to rise as emergency workers sift through more of the wreckage on Thursday.\nThe fire early Wednesday in the 24-story building in west London's North Kensington district also injured dozens, 18 of them critically, and left an unknown number missing. The cause of the blaze is under investigation, but a tenants' group had complained for years about the risk of a fire.\nMore than 1 million pounds ($1.27 million) has been raised to help victims of the tragedy as volunteers and charities worked through the night to find shelter and food for people who lost their homes.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Building blaze traumatizes London firefighters",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-london-fire-donations-overwhelming-centers-48050094"
}