{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 11:22:06+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-cooperation-needed-migration-europe-56359577.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_1173d48e9ca34daab50f40ac5200f8a3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on migration into Europe (all times local):\n1 p.m.\nAid groups say France's system for handling the unprecedented number of unaccompanied migrant children is arbitrary and hurts those who need help the most.\nIn a report Wednesday, Human Rights Watch described a confusing system that is stacked against minors. The aid group Medecins Sans Frontiers echoed the finding, saying France's default is to assume someone claiming to be under 18 is lying.\nAround 25,000 young people claiming to be unaccompanied migrant children arrived in France last year. Of those, the claims of around 14,000 were accepted, the groups say.\nBut they say reasons for rejection were contradictory — children were denied for being too articulate, or not articulate enough. Those whose claims are accepted receive housing and education; those rejected can be expelled or jailed.\n———\n11:55 a.m.\nThe Portuguese picked as the next leader of the U.N.'s migration agency predicts that the number of migrants heading from North Africa to Europe will grow and that European countries will increasingly refuse to let them in.\nAntonio Vitorino says \"I have no illusions. I know that in coming years the flow of migrants will increase and (destination) countries will close in on themselves.\"\nVitorino told Portuguese television channel SIC that cooperation between the migrants' countries of origin and European Union countries \"is the only response\" that will solve the issue of migration to Europe.\nHe says refugees seeking asylum must be guaranteed protection. He says the admittance of economic migrants depends on whether European labor markets can absorb them.\nVitorino was selected last week as the next director-general of the International Organization for Migration and takes office Oct. 1.\n———\n10:45 a.m.\nA rescue ship carrying 60 migrants has arrived in a Spanish port after being refused entry by Italy and Malta, the second time in a month that a humanitarian group has been forced to travel for days to unload people rescued in the central Mediterranean.\nThe Open Arms ship docked Wednesday in the northeastern port of Barcelona, where the group — including 5 women, a 9-year-old toddler and four teenagers — will be going through health checks and identification procedures.\nThe Spanish aid group Proactiva Open Arms said the migrants come from 14 countries and are in good health.\nDoctors Without Borders says more than 500 people have died in the Mediterranean since the Aquarius, another rescue ship, was blocked from ports in Italy and Malta in June.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Aid groups slam France on child migrants",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/latest-cooperation-needed-migration-europe-56359577"
}