{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 20:49:46+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-trapped-thai-team-practices-diving-masks-56355934.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_0afbb141f93e487e8f139babc416cb23_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the search for 12 boys and their soccer coach in a cave in northern Thailand (all times local):\n1:05 p.m.\nThe Thai official overseeing the rescue operation of a soccer team trapped in a flooded cave says the boys and their coach may not all be extracted at the same time depending on their health.\nChiang Rai provincial Gov. Narongsak Osatanakorn said Wednesday that \"all 13 may not come out at the same time. If the condition is right and if that person is ready 100 percent, he can come out.\"\nHe said authorities will evaluate their readiness each day and if there is any risk will not proceed.\nHe said the team is currently recuperating.\nAuthorities are still determining the best way to get the team out of the cave, options that include diving.\n———\n12:50 p.m.\nThai authorities are working to with navy SEALs to run a fiber optic internet line into a flooded cave in northern Thailand where 12 young soccer players and their coach are trapped.\nCommunication technician Phoowanart Keawdum said Wednesday that once the cable is installed, phone calls to the cave will be possible.\nAuthorities tried to do the same Tuesday, but the equipment was damaged by the water.\nIn latest videos released by the Thai navy, the boys and coach say they're fine. The group entered the cave in northern Thailand on June 23 before flooding cut off the main entrance. Rescuers are studying how to extract them safely.\n———\n11:10 a.m.\nThailand's navy is continuing to release videos of the young soccer players trapped in a flooded cave in northern Thailand.\nThe two latest videos posted to a navy Facebook page late Wednesday morning show a navy SEAL treating minor cuts on the feet and legs of the boys with antibiotic ointment. Several of the boys are seen smiling as they interact with the navy SEAL, who cracks jokes.\nOther boys are seen sleeping under foil warming blankets.\nA previous video released early Wednesday showed the boys saying they were healthy.\n———\n10:35 a.m.\nThe Thai official overseeing the rescue operation of a soccer team trapped in a flooded cave says the boys have been practicing wearing diving masks and breathing.\nOfficials have said that teaching the 12 boys and their coach to dive may be the only way to get them out of the cave, but other options are being explored.\nChiang Rai provincial Gov. Narongsak Osatanakorn said Wednesday that while the team has been practicing with masks, he doesn't believe they have attempted any practice dives.\nHe said it is unknown when an extraction could be attempted, but it is unlikely to be Wednesday.\nHe said any extraction has to be \"100 percent safe.\"\n———\n8:55 a.m.\nThe soccer teammates stranded more than a week in a partly flooded cave say they are healthy on a new Thai navy video.\nThe boys and their coach introduce themselves individually with the camera turning to show a Thai navy SEAL with them. They smile at times and interact with the SEAL who asks questions.\nSome appeared to be wearing a change of clothes since they were found late Monday and most were wrapped in foil warming blankets.\nThe video lasting about a minute was recorded sometime Tuesday and was posted on the navy SEAL Facebook page Wednesday morning.\nThe group had entered the cave in northern Thailand on June 23 before flooding cut off the main entrance. Rescuers are studying how to extract them safely.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Boys may be taken out of Thai cave in stages",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/latest-trapped-thai-team-practices-diving-masks-56355934"
}