{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 13:54:52+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "ABC News' Matthew Dowd discusses President-elect Donald Trump's transition process and Twitter strategy.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Ftrump-bluffing-knowledge-alleged-russian-hacking-44509643.json",
    "image_url": "http://a.abcnews.com/images/GMA/170102_gma_dowd2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Is Trump Bluffing About Knowledge of Alleged Russian Hacking?\nLet's get more on the intelligence and the politics from our analyst, Steve ganyard and Matthew dowd. Steve, you spent a lot of time dealing with national security and intelligence when you were in the government. First let's talk about this new threat to the electric grid. No signs that it actually penetrated the grid in Vermont but this is a serious threat. It is a serious threat for all of the infrastructure around the U.S. And around the world, George, for things like power supply and things like that. But what we saw in Vermont, there were definitely Russian fingerprints on that, but one of the interesting things about malware is it's becoming kmod tied. You can actually buy it in the dark resays of the internet, so it could have been Russia, China, North Korea, Iran. I think what's going to happen here is that the intelligence community is not going to release the sources and methods that allow them to draw conclusions that it was definitely Russian. We could get the new report, the full report on Russian involvement as early as this week. You see Donald Trump is questioning the intelligence. Based on your experience, how solid is it? Again, it's hard to say what the white house released about last week was not conclusive. It didn't show intent. It was very thin on details. So there's a push/pull going on within the intelligence community right now about how much to release. Until we get more definitive detail we're not going to be able to make that determination. You heard from Donald Trump over the weekend saying he knows things that others don't. He's continued to question this intelligence and praised Vladimir Putin for withholding any response to the U.S. Sanctions and actions that president Obama took last week. He's playing a tricky game here because he's going to face pressure from Republicans to respond to Putin as well. Well yeah. He sounds a little like that \"Saturday night live\" character John love its played where he says something and he says, yeah, that's the ticket. He makes up stuff and then later on doesn't prove it. I think the fascinating thing about this is for years Republicans have said Barack Obama did not respond strong enough to Russia. Now as of yesterday the Republican response or at least Donald Trump's response I should say is that he responded too overwhelmingly which is an amazing situation after Russia it looks like committed an act of cyber war and undermined one of the most fundamental principles of our country which is our democratic election. So the question will be, does he change his tune after getting the intelligence briefing later this week? Well, I think that's a really good question, and the other thing Donald Trump has to realize is somebody needs to tell him, as he said don't use computers, use courier. I don't know if he wants to go back to the pony express. This is a computer that Donald Trump is on every day sending messages to the American public, so somebody might want to tell Donald Trump that what he holds in his hand is also a computer. Thanks very much. We move on now to a deadly mid-air accident.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Is Trump Bluffing About Knowledge of Alleged Russian Hacking?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/trump-bluffing-knowledge-alleged-russian-hacking-44509643"
}