{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 14:38:38+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fjudges-ruling-slows-plans-medicaid-work-requirement-56363335.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_e108ebdc4f41423a90c7a39ebf7ae766_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Trump administration's drive to wean poor people from government benefits by making them work has been slowed by a federal judge framing a fundamental question: Are poverty programs meant to show tough love or to help the needy?\nU.S. District Judge James E. Boasberg in Washington last week halted Kentucky's first-in-the-nation experiment with Medicaid work requirements, ruling that the Trump administration glossed over potential coverage losses. He sent the state's plan back to federal authorities for a harder look.\nThe debate goes well beyond Medicaid, the federal-state health program for low-income and disabled people.\nThis spring, President Donald Trump signed an executive order directing cabinet agencies to add or strengthen work requirements for programs including subsidized housing, food stamps and cash welfare. The government's biggest assistance program for low-income people — the Earned Income Tax Credit — is already designed to supplement earnings from work.\nBoasberg found that \"medical assistance\" is by law a \"central objective\" of Medicaid. While work requirements might be allowable if that's what a state wants, \"there may be limits to how much (coverage) loss is too much,\" he wrote.\nKentucky's Republican Gov. Matt Bevin wanted to impose work requirements on some 428,000 state residents who got Medicaid under the Affordable Care Act's expansion. Optional for states, the expansion passed under former President Barack Obama covers about 12 million people nationally, mainly adults.\nKentucky expanded Medicaid under a Democratic governor. Bevin argues that the cost is unsustainable for his state, even with Washington paying at least 90 percent of the bill, because many more people signed up than initially expected. The state estimated that work requirements would save money, reducing the Medicaid rolls by about 95,000 people over five years.\nThat number got the judge's attention.\nBoasberg ruled that the federal Health and Human Services department didn't dig deeply enough into the potential coverage losses. The department \"paid no attention to that deprivation,\" he wrote, and \"this oversight is glaring,\" amounting to rubber-stamping the state's request.\nAlthough state and federal officials contend that many people leaving Medicaid would find private coverage, Boasberg said there was no hard analysis, no \"bottom-line estimate.\"\nThe ruling seemed to catch the Trump administration unprepared.\nSeema Verma, head of the Centers for Medicare and Medicaid Services, called it \"disappointing.\" The administration may appeal, or it may re-run its evaluation of the Kentucky plan to meet the judge's concerns. Medicaid work requirements in a few other states are unaffected.\nHowever, the ruling may make it much harder to approve work requirements in states that have not expanded Medicaid. In such states, Medicaid recipients would face a high risk of losing health care because even paltry earnings could make them ineligible for continued coverage.\nVerma said the administration won't be deterred from nudging the poor to go to work.\n\"We will continue to support innovative, state-driven policies that are designed to advance the objectives of the Medicaid program by improving health outcomes for thousands of low-income Americans,\" she said in a statement. Work improves health, the administration argues.\nThe nonpartisan Kaiser Family Foundation estimates that about 60 percent of adults with Medicaid are already working, and among those not working, most either have health problems, are taking care of home or family or are students.\nAdvocates for low-income people say they feel like a corner has been turned, even if the issue is far from settled.\n\"What's particularly significant is that the judge basically said you have to look at the purpose of Medicaid, which is to provide coverage,\" said Judy Solomon of the nonprofit Center on Budget and Policy Priorities. Work requirements \"were outside the core objectives of the Medicaid program, and he basically said you can't ignore the core objectives.\"\nOthers point out that the judge stopped short of deciding the merits of the case, focusing instead on problems with the process that HHS followed in approving Kentucky's request.\nMatt Salo, executive director of the nonpartisan National Association of Medicaid Directors, said work requirements may serve the purposes of Medicaid in some states, particularly if that helps convince conservative lawmakers to expand coverage to more uninsured people.\n\"There's a broader issue at play here about maintaining political support and the sustainability of the program,\" said Salo. \"Does the inability to do a work requirement lead to a scenario where Kentucky is going to get rid of the entire expansion?\"\nSo far that hasn't happened, but Bevin did cut Medicaid dental and vision coverage in response to the judge's ruling.\nThe case is Stewart vs. Azar.",
    "source_domain": "abcnews.go.com",
    "title": "Judge's ruling slows plans for Medicaid work requirement",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/wireStory/judges-ruling-slows-plans-medicaid-work-requirement-56363335"
}