{
    "authors": [
        "Abc News",
        "More Catherine"
    ],
    "date_download": "2018-07-04 12:51:51+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The couple will be renewing their wedding vows this summer.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fwife-amnesia-accident-couple-dates-build-back-bond%2Fstory%3Fid%3D55574758.json",
    "image_url": "https://s.abcnews.com/images/US/amnesia7-abc-ml-180601_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Although they had been married for over a decade, an Oklahoma husband made his wife fall in love with him again after she suffered from a form of amnesia that made her forget all their memories together.\nJaff Hartung and Angela Sartin-Hartung met at church in 2000 and got married just one year later.\nIn 2013, after 12 years of marriage, Sartin-Hartung was struck by a car and suffered an acute traumatic brain injury.\n“ ” She didn’t know who I was\nABC News\n\"The pictures I have seen show my face went through the windshield,\" Sartin-Hartung said.\n\"She was crossing the street,\" her husband said. \"It was twilight and she didn't see him ... he didn't see her and she was struck, full speed.\"\nAs a result of the tragic accident, all of Sartin-Hartung's memories of her husband vanished. Doctors told the couple that she would likely never get those memories back.\n\"Angela’s having very extensive retrograde amnesia,\" Dr. Kirk Lercher, a doctor at Mount Sinai Health System in New York who helped treat Sartin-Hartung, said of her condition. \"She ... lost a giant chunk of a period of her life.\"\nUpon waking up from a medically induced coma, Sartin-Hartung thought she was still married to her first husband, who passed away in 1998. She also thought that her teenage children were still toddlers and that her parents were still alive.\n\"Those were sad, confusing moments for her,\" Hartung recalled.\nSarting-Hartung added that she is especially sad that \"I don't remember raising the children.\"\nABC News\nAlthough Hartung waited by her side every day at the hospital, Sartin-Hartung did not recognize her husband when she woke up.\n\"She would look at me and ask me why I was in the room,\" Hartung recalled of their time in the hospital. \"She just learned to trust because I was there every day, all day ... I was there more than the doctor.\n\"She actually thought I was the doctor at one point,\" Hartung added.\nABC News\nABC News\nLercher said that \"to this day, the staff still remembers very fondly his interactions with Angela.\"\nDespite his wife's memory loss, Hartung chose to look on the bright side, saying, \"The situation could have been way worse.\"\n\"She was able to see and talk,\" he said. \"She didn’t know who I was, but we worked through that.\"\nWooing his wife with retrograde amnesia\nHartung said he stopped at nothing to make his wife fall in love with him again, saying they would go on \"memory walks in the city.\"\n“We would remember these things,” he said. “It was fun to go into different places, we would walk down the street and she would recall a store, so we would go into the store.\n“We did that over and over again for months,\" he added. \"And just enjoyed spending that time together for us, building that relationship.”\nDespite being married for 12 years, Hartung said, \"I felt like I was dating her all over again.\"\n\"Everything is a date,\" he said. \"We would go to the grocery store and it's like a date.\"\n\"It is fun dating again,\" Sartin- Hartung added. \"He's just an awesome man.\"\nA wedding 'redo' this summer\nSartin-Hartung said, however, that she doesn't have any \"memory of getting married 17 years ago.\"\nHer husband added, \"She sees the pictures that we have, and she thinks about what we may have gone through.\"\n\"I finally realized that, you know what we need? To redo our wedding and give her that memory,\" he said. \"Now she gets to do it all over again and remember that, that’ll be ours.\"\nSartin-Hartung said what she is most looking forward to about the wedding is \"just spending that time with Jeff\" and \"reconnecting with Jeff.”\nThe couple plans to renew their vows this summer in a ceremony at Central Park.",
    "source_domain": "abcnews.go.com",
    "title": "After wife gets amnesia in accident, couple dates all over again to build back their bond",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Family/wife-amnesia-accident-couple-dates-build-back-bond/story?id=55574758"
}