{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2018-02-03 18:35:16+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Pink reveals she has the flu ahead of singing national anthem at Super Bowl",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fpink-reveals-flu-ahead-singing-national-anthem-super%2Fstory%3Fid%3D52816759.json",
    "image_url": "http://abcnews.go.com/GMA/Culture/pink-reveals-flu-ahead-singing-national-anthem-super/story?id=52816759",
    "language": "en",
    "localpath": null,
    "maintext": "Pink will go ahead with singing the national anthem at Super Bowl LII on Sunday even as she battles the flu, saying that the illness is making \"one of my dreams ... sort of a nightmare.\"\nThe singer, who is set to open the championship game by singing “The Star-Spangled Banner,” revealed in an Instagram post Saturday that she caught the flu from her two small children.\nPink, 38, and former motorcars competitor Carey Hart are parents to 6-year-old Willow and 1-year-old Jameson.\n\"[I'm] trying to practice the flu away,\" she began in a caption. \"I’ve been waiting to sing this song since 1991 when I saw my idol, Whitney Houston, own this song. And now, my chance has finally come.\"\nPink continued, \"And it just so happens that this chance comes when I have two small Petri dish kids who literally cough INTO MY MOUTH and rub their snot on my cheek. You can’t write this stuff I swear! And here we are. I’ve arrived at another one of my dreams which is slowly becoming a sort of nightmare.\"\nPink said the opportunity to sing the national anthem at the Super Bowl which is being held at U.S. Bank Stadium in Minneapolis, \"is one of the biggest honors of my life, singing this song in front of my family, my military family, my dad and brother and step mama and family and the world. And the EAGLES!?!?!\"\nDespite the flu, she said, \"I promise I will do my best, as I always do. As far as the gremlins that got me into this mess, you can cough at me for the rest of your lives. If it’s a contest, babies, you win.\"\nPink joins a long line of pop stars who have had the honor of singing the national anthem at the Super Bowl, including Beyonce, Diana Ross, Lady Gaga, Neil Diamond, Luther Vandross, Mariah Carey, and Cher.\nJustin Timberlake is set to perform at the halftime show during this year's big game.",
    "source_domain": "abcnews.go.com",
    "title": "Pink reveals she has the flu ahead of singing national anthem at Super Bowl: 'I will do my best'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/pink-reveals-flu-ahead-singing-national-anthem-super/story?id=52816759"
}