{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2017-04-18 10:00:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Man accused of stealing more than 100 cellphones at Coachella",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fman-accused-stealing-100-cellphones-coachella%2Fstory%3Fid%3D46855967.json",
    "image_url": "http://a.abcnews.com/images/US/AP_17107268137755_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tech-savvy concert-goers helped police locate a New York man who allegedly stole more than 100 cellphones at the Coachella Valley Music and Arts Festival over the weekend, authorities said.\nThe Indio Police Department in California said it arrested Reinaldo De Jesus Henao on Friday after several attendees activated their \"Find my iPhone\" app and followed the suspect around the festival venue until authorities were able to detain him.\nPolice said Henao, 36, was arrested with a backpack containing more than 100 mobile phones, which were believed to have been stolen from the concert site, located east of Los Angeles near Palm Springs.\nSeveral of the devices were returned to the victims and the rest were reported to the venue’s lost and found site, according to police.\nHenao was arrested on charges of grand theft and possession of stolen property, police said.\nHe was booked at the Larry D. Smith Correctional Center in Banning, California, and released on a $10,000 bail, according to inmate records.\nHenao is scheduled to appear in court on May 26, according to inmate records.\nThe event is one of the most anticipated music festivals of the year and it's known to attract well-known stars.\nCelebrities, including Katy Perry, Halsey, A$AP Ferg, Kylie Jenner, Amber Rose, Paris Hilton and Odell Beckham Jr., were all spotted at the festival over the weekend.\nThe three-day festival, held at the Empire Polo Club in Indio, California, attracted an estimated 125,000 attendees per day, according to ABC’s Southern California affiliate KABC.\nABC News' Joi-Marie McKenzie contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Man accused of stealing more than 100 cellphones at Coachella",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/man-accused-stealing-100-cellphones-coachella/story?id=46855967"
}