{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 01:36:04+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The officers were critically wounded, the Dallas Police Department said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fmanhunt-underway-person-interest-shooting-police-officers-civilian-54707531.json",
    "image_url": "https://s.abcnews.com/images/US/180424_vod_orig_dallas_officers_shot_presser_MIX_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Manhunt underway for person of interest in shooting of 2 police officers, civilian\nOnce again and Dallas. Is that the precipice. Looking. Into the hell heartbreak as our. Police department. Was attacked this afternoon. Approximately 4:12 PM. Officers received a call to the 111000 block before central dropped The Home Depot. Shortly after they Iraq. It was a subsequent call for assistance. Or officers. Were shot. They were transported. Fox higher Dallas rescue. It's here to Presbyterian Hospital. What we believe they're getting the best possible case. What we know right now. Is that the person of interest. Is a Armond hill the weeks Morris. He is a Latin male approximately 29 years old. What we do know right now he's that he possibly left the location. In a white pickup truck. That information is going to be given to you shortly in a bulletin. We're going to give you all the information the possible apartment interests data are in any other information that was issued. In assisting us in apprehending this individual questioning. We do believe that he is armed at this time I do not have all the details of how he was able. Two. Act get a gun and shoot all three of the officers that were in that location loss prevention officer. As well as our two officers were still investigating. Reviewing video and all of those things and we will continue to update you. As that information comes.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Manhunt underway for person of interest in shooting of 2 police officers, civilian",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/manhunt-underway-person-interest-shooting-police-officers-civilian-54707531"
}