{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:19:39+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Police in Austin, Texas, said the device had been detonated by a tripwire.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fmen-injured-4th-bomb-attack-20-days-authorities-53860790.json",
    "image_url": "https://s.abcnews.com/images/WNT/180319_wn_moore2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 2 men injured in 4th bomb attack in less than 20 days: Authorities\nBut first, the hunt for a suspected serial bomber tonight, striking fear yet again in Austin. This time, authorities say with a trip wire bomb, the fourth bomb to go off. The first bomb, in a package left at a home. The following week, two more packages on the same day, both exploding. And this newest bomb with that trip wire on a darkened street overnight. The neighborhood on lockdown for most of this day, and tonight, the audio of this newest bomb going off just out. ABC's Marcus Moore leading us off from Austin tonight. Reporter: Tonight, more than 500 agents flooding Austin Texas, a massive manhunt intensifying. We're clearly dealing with what we expect to be a serial bomber. There was a loud explosion heard on scene. Reporter: 8:32 P.M. Sunday night, a bomb exploding. The sound captured on this surveillance video. Seriously injuring two men. The fourth attack in less than 20 days. But this device, detonated by a trip wire. With this trip wire, this changes things. It is more sophisticated. It is not targeted to individuals. Reporter: The massive blast site littered with evidence tags. One of the unsuspecting victims walking on this suburban street, tripping a nearly invisible wire connected to a device placed several feet away. That's what we need, is people paying attention for suspicious objects, bags, boxes, backpacks. Anything that looks out of place. We need to lock down a twoblock perimeter, there's a nail in the wound of one of the subjects. Reporter: Richard Harrington heard the latest blast. My first thought, that's my granddaughter, you know she could have she could have run down the street and tripped the wire. Reporter: The fear of more devices triggering a neighborhood lockdown. School buses kept away. This bomb went off hours ago, and authorities still have this neighborhood street closed. And telling residents to stay in their homes for their safety. Teams of investigators combing through the streets, searching for clues that could lead them to the bomber. David asking the police chief on \"Good morning America\" -- Do you have any suspects, any names, any potential people you're looking at? We have had a lot of good leads and tips. We run them to ground. At this point, we have people that we have looked at, but there's no leading suspect at this time. Reporter: Baffled authorities not ruling out any motive, including a hate crime, even though the latest victims were white. The previous plea blasts, all package bombs, killing two, those victims all minorities. Desperate for any answers, police now asking the bomber to contact them. What kind of a person would do this? That's what we're trying to figure out and that's one of the reasons why we would like the bomber to reach out and talk to us. Reporter: Tonight, new Marcus, authorities pleading with the public now to check their home surveillance cameras, should they are one? Reporter: That's rirgght, David. The thinking here is that someone has video that could help police. And investigators are working to reconstruct the latest device. David? Marcus Moore tonight, thank you. We're going to turn next here to that severe weather threat at this hour. A tornado watch.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "2 men injured in 4th bomb attack in less than 20 days: Authorities",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/men-injured-4th-bomb-attack-20-days-authorities-53860790"
}