{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 20:17:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Correction: Shipwreck Discovery story",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fcorrection-shipwreck-discovery-story-48040683.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/correction-shipwreck-discovery-story-48040683",
    "language": "en",
    "localpath": null,
    "maintext": "In a story and photo captions June 13 about the discovery of a shipwreck, The Associated Press reported erroneously the rank of Todd Sokalzuk. He is a Rear Admiral, not a Commander. Also, the story should have made it clear that the Coast Guard could not assign blame to the crash that caused the ship to sink.\nA corrected version of the story is below:\nCoast Guard ship will linger in century-old watery grave\nOn the 100th anniversary of a Coast Guard ship's disappearance, the agency says it found the shipwreck off Southern California and plan to leave it there\nBy LINDA WANG\nAssociated Press\nSAN FRANCISCO (AP) — A hundred years ago in a blinding fog, a U.S. Coast Guard ship was sailing off the coast of Southern California when it crashed into a passenger steamship.\nThe USCGC McCulloch sank within 35 minutes and lingered on the ocean floor undisturbed by people for a century.\nOn the 100th anniversary of the vessel's June 13, 1917, disappearance, the Coast Guard announced Tuesday that it found the shipwreck — not far from where it went down. And officials plan to leave it there.\nStrong currents and an abundance of sediment would make moving the delicate ship too difficult, officials said in detailing the discovery of the San Francisco-based USCGC McCulloch. They also paid tribute to its crews, including two members who died in the line of duty, but not in the crash.\nCoast Guard Rear Adm. Todd Sokalzuk called the ship \"a symbol of hard work and sacrifice of previous generations to serve and protect our nation\" and an important piece of history.\nThe ship sank shortly after hearing a foghorn nearby and then colliding with the SS Governor, a civilian steamship. The McCulloch's crew was safely rescued and taken aboard the steamship.\nThe National Oceanic and Atmospheric Administration and the Coast Guard discovered the wreck last fall during a routine survey.\nResearchers focused on the area of the shipwreck 3 miles (5 kilometers) off Point Conception, California, after noticing a flurry of fish. Sunken ships offer a great place for fish to hide. The site is about 150 miles (240 kilometers) northwest of Los Angeles.\nCommissioned in the late 1800s, the McCulloch first set out to sea during the Spanish-American War as part of Commodore George Dewey's Asiatic Squadron in the Battle of Manila Bay.\nCutters based in San Francisco in the late 1800s and early 1900s represented American interests throughout the Pacific. They also played important roles in the development of the Western U.S.\nAfter the war, the cutter patrolled the West Coast and later was dispatched to protect fur seals in the Pribilof Islands off the coast of Alaska, where it also served as a floating courtroom in remote areas.\nThe archaeological remains, including a 15-inch torpedo tube molded into the bow stem and the top of a bronze 11-foot propeller blade, are draped with white anemones 300 feet (90 meters) below the surface, officials said. A 6-pound gun is still mounted in a platform at the starboard bow.",
    "source_domain": "abcnews.go.com",
    "title": "Correction: Shipwreck Discovery story",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/correction-shipwreck-discovery-story-48040683"
}