{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:17:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "ABC News' Kayna Whitworth is in Oroville as officials downgrade the mandatory evacuation to a warning and consider what's next for the California community.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Foroville-contemplates-steps-dam-emergency-45497508.json",
    "image_url": "http://a.abcnews.com/images/US/170214_vod_whitworth_oroville_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Oroville contemplates next steps after dam emergency\nAnd they will admit ABC news and I'm Orville California with some good news finally we have just learned. But authorities have lifted the mandatory and mandatory evacuations but it nearly. 200000. People. In this area you wondering about Leila I'm standing in an empty holiday and parking lot isn't actually the hotel we were supposed to save come cover this story. But isn't evacuations. So they were close and we couldn't stay there but people are now starting to funneled back in. All of the businesses have been close this area has been completely desolate. But after hard work overnight they've been dropping these one ton bags full of boulders in C and into those holes in this bill way in the emergency spillway and you really think a lot of progress. And so because of that authorities now believe that this can't actually has the capacity to withstand future storms that they expect to start tomorrow so places like. This on it will Bill Clinton opening in San. I really want land mines in science but and act. And as an he'll walk over your starting to see gas stations open and I'm telling you this area was completely desolate. Just a day ago people are funneling in with all of their cars all of their belongings. Those who weren't evacuation shelters that didn't have a vehicle they're providing buses with and so they can get back to town. Actually we could swing over here and see some people that are driving back into its now. Even out of their homes for two nights thankfully they were able to avoid a third night. Authorities are also saying that they are planned to prevent any future erosion to things are looking really good. Had that the levels of water in the dam are dropping about three to four inches every hour. They're still hanging down fifteen feet that is their goal but this incoming storm looks to be much more manageable and they originally thought it's also going to be colder. Which means they won't be getting snow melts from the mountains. So things are really looking good here for the folks and Orville authorities telling them again it can come back home although they are asking them to use caution and to be very vigilant. Just in case they acted back racing again authorities feel very confident. About the progress made in the last few days again I'm getting it right and Orville California everybody.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Oroville contemplates next steps after dam emergency",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/oroville-contemplates-steps-dam-emergency-45497508"
}