{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:15:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Documents highlight Prince's struggle with opioid addiction",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fdocuments-highlight-princes-struggle-opioid-addiction-46855105.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_a5767496a2e346c2bd0998f4da3647ee_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Before his death, Prince abused opioid pain pills, suffered withdrawal symptoms and received at least one opioid prescription under his bodyguard's name, according to search warrants and affidavits unsealed Monday.\nPrince was 57 when he was found alone and unresponsive in an elevator at Paisley Park on April 21. Nearly a year after his accidental overdose death at his suburban Minneapolis studio and estate, investigators still don't know how he got the fentanyl that killed him. The newly unsealed documents give the clearest picture yet of Prince's struggle with opioid painkillers.\n———\nWHAT DO AUTHORITIES SAY HAPPENED?\nInvestigators heard plenty from the people at Paisley Park when Prince's body was discovered. They told investigators that Prince was recently \"going through withdrawals, which are believed to be the result of the abuse of prescription medication.\"\nWhen authorities later checked a database set up to monitor who's getting prescriptions for controlled substances, they found nothing for Prince. But there was a prescription for the opioid painkiller oxycodone written for Kirk Johnson, Prince's bodyguard.\nThe prescription was dated April 14, 2016, the same day Prince was revived with an anti-overdose drug after falling ill on a plane. Dr. Michael Schulenberg, who wrote the prescription, told authorities he put the prescription in Johnson's name to protect Prince's privacy, according to a detective's affidavit. Schulenberg's attorney, Amy Conners, said in a statement that Schulenberg never prescribed opioids to Prince directly nor to another person with the intent of giving them to the singer.\nJohnson's attorney, Clayton Tyler, said Johnson \"did not secure nor supply the drugs which caused Prince's death.\" An autopsy showed Prince died of an overdose of fentanyl, another drug in the opioid family.\n———\nWHAT ARE POTENTIAL CHARGES?\nWriting a prescription under another person's name violates state and federal law, said Ruth Martinez, executive director of the Minnesota Board of Medical Practice.\nMartinez said she could not comment on whether the board is investigating Schulenberg's treatment of Prince. The agency's website on Monday listed no disciplinary or corrective actions taken against the doctor.\nThe board doesn't launch investigations unless someone makes a complaint. Complaints typically take 90 to 120 days to resolve, she said.\nA person convicted under the law could be stripped of the ability to prescribe controlled substances by the U.S. Drug Enforcement Administration and face other discipline from the state medical board.\n———\nWHY NO CHARGES YET?\nA year might seem like a long time without charges, but criminal justice experts say the fact that no one's been charged doesn't mean no one ever will. They say it's a complex thing to track illegally obtained pills, and investigators and prosecutors want to build strong cases before interviewing witnesses who might provide useful information.\nAlthough they can resort to subpoenas, the targets can exercise their right against self-incrimination — and the only way to get them to talk after that is by offering immunity. And, experts say, prosecutors and investigators don't want to lose a high-profile case such as Prince's — likely increasing their caution.\n———\nHOW OFTEN DO PRESCRIBERS USE FALSE NAMES?\nMartinez of the Minnesota medical board said it's \"quite infrequent\" for a doctor to write out a prescription for someone in another person's name.\nTwo Los Angeles attorneys say it happens all the time in Hollywood. Celebrities frequently use aliases in hospitals and doctor's offices.\nLaws against prescribing with a false name are not usually enforced when a doctor intends to protect a celebrity's privacy, said Los Angeles attorney Ellyn Garofalo.\nShe represented a doctor who was acquitted of all charges, including false name allegations, in the death of Anna Nicole Smith, the Playboy model and reality TV star who died of an accidental overdose in 2007.\n\"They would be indicting every pharmacist in Beverly Hills if this were strictly enforced,\" Garofalo said Monday.\nLos Angeles criminal defense attorney Harland Braun said there are good reasons for doctors to want to protect privacy with the insatiable appetite for celebrity gossip.\n\"Say you have a major male actor who has a prescription for Viagra, do you want that out on TMZ?\" Braun said.\n———\nAmy Forliti and Doug Glass contributed from Minneapolis.",
    "source_domain": "abcnews.go.com",
    "title": "Documents highlight Prince's struggle with opioid addiction",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/documents-highlight-princes-struggle-opioid-addiction-46855105"
}