{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:34:45+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Shot within minutes of one another, the victims recount the events of last Thursday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fdetroit-police-hunt-gunman-taking-aim-michigan-highways-51727809.json",
    "image_url": "http://a.abcnews.com/images/WNN/171211_wn_bankert_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Detroit police hunt for gunman taking aim along Michigan highways\nNext this Monday night, the manhunt for a highway shooter in Detroit. Police linking the gunman now to a fourth shooting. Here's ABC's Adrienne Bankert. Reporter: Police today expand their search for evidence. On the hunt for a gunman who took aim at drivers on Michigan freeways. Can you call police? I just got shot in the leg. Reporter: The first of four people targeted. Seen here stumbling into a Detroit gas station just before 3:00 A.M. Thursday. I thought it was a rock. I'm on 94, I heard a big bang. Reporter: Minutes later a bullet tears though this man's truck. It went through the car. A bullet was actually stuck on the bottom of my seat. I think it was probably about five, six cars down, I saw a gun flashing down the window. Reporter: Three of the drivers recall seeing a silver sedan pull up alongside them. We doubled our patrols on the freeway system. We actually have some undercover officers working out there. Reporter: And David, only one of the drivers was hurt in what police say could have been a game or a stunt, like target practice. And that the suspect's had to be moving at very high speeds in order to do so much damage in minutes. David? Adrienne, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Detroit police hunt for gunman taking aim along Michigan highways",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/detroit-police-hunt-gunman-taking-aim-michigan-highways-51727809"
}