{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:45:48+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "The Latest: Trump Takes Dig at Chicago Mayor Rahm Emanuel",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-trump-takes-dig-chicago-mayor-rahm-emanuel-44514272.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/latest-trump-takes-dig-chicago-mayor-rahm-emanuel-44514272",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on President-elect Donald Trump (all times EST):\n1 p.m.\nPresident-elect Donald Trump is taking a dig at Rahm Emanuel, Chicago's mayor and President Barack Obama's former chief of staff.\nThe nation's third largest city had 762 homicides in 2016 — the most in two decades and more than the largest cities, New York and Los Angeles, combined. The Chicago Police Department says the city had 1,100 more shootings last year than in 2015. The statistics have put Chicago at the center of a national dialogue about gun violence.\nTrump on Monday noted the spike in shooting deaths on Twitter. He wrote, \"If Mayor can't do it he must ask for federal help!\"\nEmanuel did not immediately respond to a request for comment.\n———\n8:10 a.m.\nIncoming White House press secretary Sean Spicer is defending cryptic comments by President-elect Donald Trump that he knows \"things that other people don't know\" when it comes to allegations of Russian hacking.\nSpicer tells Fox News Channel's \"Fox & Friends\" that Trump is getting national security briefings \"on a daily basis\" and \"there doesn't seem to be conclusive evidence\" Russians were behind the hacking of Democratic emails during the election.\nSpicer also dismissed on Monday a report released by the FBI and Homeland Security Department supporting the accusations against Russia, calling it a \"how-to\" manual on basic cybersecurity for Democrats.\nIn an interview on NBC's \"Today Show,\" Spicer said President Barack Obama only punished Russia after Democrat Hillary Clinton lost the election and that the recent sanctions were politically motivated.\nTrump has said he will get a briefing from U.S. intelligence officials this week.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Trump Takes Dig at Chicago Mayor Rahm Emanuel",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-trump-takes-dig-chicago-mayor-rahm-emanuel-44514272"
}