{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 03:46:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "LEADING OFF: Sale goes for No. 9; Hoffman tries for 5th",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fleading-off-sale-hoffman-5th-48047960%3Fyptr%3Dyahoo%3Fsrc%3Drss.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/leading-off-sale-hoffman-5th-48047960?yptr=yahoo?src=rss",
    "language": "en",
    "localpath": null,
    "maintext": "A look at what's happening all around the majors Thursday:\n———\nSURGING SALE\nRed Sox ace Chris Sale goes for his eighth straight win and ninth of the season in the finale of a three-game series at Philadelphia. It would tie Sale, 7-0 in his last eight starts, with Houston's Dallas Keuchel (9-0), Kansas City's Jason Vargas (9-3) and the Los Angeles Dodgers' Clayton Kershaw (9-2) for the major league lead in wins.\nSTAYING UNBEATEN\nColorado rookie Jeff Hoffman will look for his fifth straight win when the Rockies host San Francisco in the opener of a seven-game homestand. Hoffman is 4-0 with a 2.10 ERA in four starts.\nSIXTH MAN\nWith the New York Mets using a six-man rotation during a long stretch between days off, Robert Gsellman gets another start in the opener of a four-game series against NL East-leading Washington. After making two relief appearances, the rookie right-hander is 3-0 with a 2.16 ERA in four starts. He faces Nationals lefty Gio Gonzalez, who is 9-1 with a 1.62 ERA in 14 starts at Citi Field.\nFIRST START\nMatt Strahm makes his first career start in the opener of Kansas City's four-game series at the Los Angeles Angels. The left-hander was 1-3 with a 4.05 ERA in 20 appearances out of the bullpen this season.\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "LEADING OFF: Sale goes for No. 9; Hoffman tries for 5th",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/leading-off-sale-hoffman-5th-48047960?yptr=yahoo?src=rss"
}