{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 23:05:20+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Oklahoma considers chemical castration for sex offenders",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Foklahoma-considers-chemical-castration-sex-offenders-52815974.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_f3332b7c70784b16989417f0056f71f3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Republican lawmaker is pushing to add Oklahoma to the list of states in which so-called chemical castration is an option for certain sex offenders, albeit an option that rarely gets used.\nState Rep. Rick West, a first-term lawmaker from Heavener, said he filed the bill at the request of a constituent and that he fully intends to push for its passage, though it's likely to face strong opposition, even in a conservative state with a tough-on-crime reputation.\nIf approved, Oklahoma would join at least seven other states that have laws allowing courts to order chemical treatments that reduce male testosterone for certain sex offenders, although experts say the punishment is rarely carried out and one described it as a \"half fantasy\" version of criminal justice.\n\"When I knocked on that guy's door when I was campaigning, he said: 'I'll vote for you if you'll run this bill,'\" West said.\nWest, who has introduced a measure that would allow tobacco back inside state prisons, said he's confident his constituents would support efforts to prevent sex crimes, especially against children.\nUnder the bill , anyone convicted of a sexually violent offense could be required as a condition of release to take the drugs designed to reduce a male offender's testosterone and sexual libido. A second offense would require the treatment unless a court determined it wouldn't be effective.\nCalifornia became the first state to pass such a law in 1996, and since then at least six other states have passed laws allowing it in some form, including Georgia, Florida, Louisiana, Montana, Oregon and Wisconsin, according to the National Conference of State Legislatures. Texas allows repeat sex offenders to voluntarily elect to be surgically castrated.\nIt's unclear how often the procedure is used, but it appears to be rare. For it to be used in California, a judge would have to issue an order as part of a convict's sentence. Only a couple of parolees are currently required to receive the treatment every year, said prisons spokesman Luis Patino. Prison officials in Montana and Louisiana are aware of only one case in each state in the last decade in which a judge ordered the treatment.\nOklahoma's American Civil Liberties Union chapter is concerned about West's proposal, saying that requiring unwilling offenders to undergo such treatments likely violates the Constitution's 8th Amendment.\n\"It's hard to imagine this couldn't be considered cruel or unusual,\" said chapter spokeswoman Allie Shinn, who added there's little scientific evidence to suggest such treatments are even effective.\n\"I don't want to place too much faith in the Oklahoma Legislature to avoid blatantly unconstitutional proposals, but we're hopeful this bill, as written, is just too extreme to move,\" Shinn said.\nWhile drugs used to diminish an offender's sex drive can be effective, they are mostly successful with offenders who want to change their behavior and take them as prescribed, said Frank Zimring, a law professor at University of California at Berkeley and an expert on sex crimes.\nBut he said the laws are generally about good politics since sex offenders are an easy target, and not necessarily about sound criminal justice policy.\n\"Chemical castration is half advertising slogan, half fantasy,\" Zimring said. \"There are chemicals which are supposed to, if dosages are maintained, reduce sex drives. That isn't castration.\"\nThe Oklahoma Legislature has over the years entertained various bills involving the castration of sex offenders. In 2002, a measure allowing chemical or surgical castration of sex offenders made it all the way to the desk of Republican Gov. Frank Keating, who promptly vetoed it and derided it as \"silly.\"\n———\nOnline: House Bill 2543: http://bit.ly/2DDJxKB\n———\nFollow Sean Murphy at https://twitter.com/apseanmurphy",
    "source_domain": "abcnews.go.com",
    "title": "Oklahoma considers chemical castration for sex offenders",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/oklahoma-considers-chemical-castration-sex-offenders-52815974"
}