{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:43:48+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "In her quest for revenge and pride, Ronda Rousey lost her own way",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fquest-revenge-pride-ronda-rousey-lost%2Fstory%3Fid%3D44513683.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_161231_mma_ramona_on_rousey_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "LAS VEGAS -- The first time Ronda Rousey met UFC president Dana White, she asked for a few minutes of his time to make her pitch for creating a women's division in the UFC.\nShe was passionate and charismatic. She had a vision for what the sport could do for women and how she could lead the way.\n\"Fifteen minutes into a 45-minute conversation, I was like, 'Holy s---, I'm in. If we're ever going to do it, this is the woman to do so,'\" White recalled.\nThe last time he spoke to Rousey, late Friday night after a brutal first-round knockout loss to Amanda Nunes, White was the one doing all the talking. She barely said a word.\n\"I must have tears, blood and boogers all over my f---ing jacket. I went in there and hugged her for 45 minutes,\" White said. \"I told her, 'I love you so much, and whatever you want to do next, I got your back. You built this. This doesn't exist without you. You're the best decision I ever made.'\"\nLess than five years separated these conversations, and yet everything was different -- the world, the sport and, most of all, Ronda Rousey herself.\nShe wasn't making the case to fight anymore; White was.\nIn many ways, Rousey had outgrown a fighter's life years ago. She talked openly of wanting to get married, have children and start a new life for herself outside of the spotlight. She had movie roles waiting for her. She was signing on for executive producing positions in various other projects. She had made tens of millions of dollars from the UFC, endorsements and other projects. She'd written a bestselling autobiography. She'd become a feminist hero with her message of fierce strength and ambition.\nBy themselves, none of these things meant she couldn't still be a champion fighter. But collectively, they meant she didn't have to be one anymore.\nShe didn't have to fight. And for the better part of a year, she has been trying to find the right reasons to keep doing it.\nWas she after revenge or respect?\nWas she simply trying to right a wrong after she'd lost to Holly Holm in November 2015?\nMaybe it was about legacy and pride. The baddest woman on the planet couldn't just fold after one loss. She had to try to come back so she could leave with some dignity.\n\"I want to be able to walk away with my head held high,\" Rousey said before the fight. \"It's like a painter looking at what he made and knowing it's not done yet. You could get away with it. You could sell that painting and it would sell. But you'll always know it was never as good as it could have been. I don't want 'good enough' to be my legacy.\"\nEventually she settled on a mix of pride and revenge. But even the fact that she needed to ask herself why she was fighting spoke volumes.\nThere's nothing wrong with taking advantage of opportunities. There's nothing wrong with wanting more.\nThat desire to keep pushing and stretching and growing is at the core of her being. It's part of what made her such a compelling figure to her fans in the first place.\nWomen often are terrible about wanting more, expecting more or demanding more. Rousey went after it and refused to apologize for her ambitions.\nShe was able to talk that talk because she'd previously always backed it up.\nAfter the loss to Holm, though, it was as if she didn't know how to be if she couldn't be the invincible superwoman champion. How could she have swagger when she was still so embarrassed at how she'd performed? How could she talk about beating Nunes when she was still beating herself up for losing to Holm?\nSo she stayed mostly silent before the fight, explaining that there was nothing she could say that would help win the fight in front of her. She would do a few interviews with Ellen DeGeneres and Conan O'Brien and ESPN The Magazine, but she would not participate in the traditional fight-week promotional and media activities.\nShe was doing things on her terms, not anyone else's.\nThat did not sit well. A couple of weeks ago, as I finished a feature story on her comeback attempt, a male colleague said to me, \"Boy, I hear she's just getting worse and worse. She's storming off the stage in New York. She's refusing to help promote the fight.\"\nIt was an arresting statement. \"Worse and worse\"?\nIn reality, she'd gotten better and better after the loss to Holm. Being out of the spotlight had helped her spirit and psyche.\n\"I'm just getting my life back,\" she said.\nBut to many men, she was just another woman they didn't want to be around after she'd fallen apart. There was too much emotion, too much intensity and unpredictability to deal with. So in the great tradition of women being given tranquilizers to help calm their nerves or women running into the bathroom at work to avoid crying, it was easier to call her broken and bitter than to try to understand her.\nRousey's problem is that it wasn't just men who had a hard time dealing with her in this state. It was just as uncomfortable for her.\nShe never truly accepted the loss to Holm. She just tried to compartmentalize it.\nBut whether it was stubborn competitiveness or residual embarrassment, when she fought Nunes it was as if she'd been frozen in amber from a year ago. She stood in front of Nunes with very little head movement or defense. She got tagged in the face repeatedly with powerful right hands. After 48 seconds of punishment, it was abruptly over.\nRousey stood and leaned against the cage with a sad, defeated look on her face. Nunes came over, grabbed her by the shoulders and paid her respects by saying, \"You did so much for this sport.\"\nThe pro-Rousey crowd inside the T-Mobile Arena was stunned and saddened.\n\"I walked out of the arena and people were crying, men and women,\" White said. \"She has been an amazing role model and amazing partner, an amazing friend.\n\"For the millions of people who admire her, she is somebody who is actually worth the admiration. Believe me, there's a lot of celebrities out there that are popular. I meet them all the time. They are not worth your admiration. They suck. But Ronda Rousey is all of that. She's incredible.\"\nWhite spoke with resignation about Rousey's future in the sport. This likely is her final fight, though both White and her camp said she'd need some time to make a final decision.\n\"It's very rare that people go out on this glorious ride, on top,\" he said. \"It almost never happens. Either people stick around too long and they get too old or things happened like what happened with Ronda.\"\nWhat exactly happened to Ronda these past two fights?\nIs she the proverbial goose who finally ran out of golden eggs? Or was this just the inevitable turnover of the fame cycle?\nDid she lose confidence in herself once her invincibility was gone? Or did she train the wrong way?\nThose are questions she must answer before she decides whether to fight again.\nBut if this was her last fight, if she has grown out of the fighter's life, White wanted her to know her legacy was secure.\n\"None of this happens without Ronda Rousey,\" White said. \"She built this whole thing.\"",
    "source_domain": "abcnews.go.com",
    "title": "In her quest for revenge and pride, Ronda Rousey lost her own way",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/quest-revenge-pride-ronda-rousey-lost/story?id=44513683"
}