{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:48:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "US retail sales rise in January, led by gas and restaurants",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-retail-sales-rise-january-led-gas-restaurants-45506980.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/us-retail-sales-rise-january-led-gas-restaurants-45506980",
    "language": "en",
    "localpath": null,
    "maintext": "Retail sales rose a seasonally adjusted 0.4 percent last month, slowing down from a solid 1 percent gain in December, the Commerce Department said Wednesday.\nOverall sales likely pulled back from a December bump in holiday shopping online and at auto dealers, while Americans spent more than normally expected last month at clothiers, department stores, electronics outlets and sporting goods retailers.\nHigher gas prices drove a 2.3 percent sales increase at service stations last month. Gasoline prices climbed 7.8 percent between January and December, according to a separate Labor Department report released Wednesday. The retail sales report does not adjust its figures for prices.\nPurchases at restaurants and bars climbed 1.4 percent. Building materials stores saw a slight 0.3 percent gain.\nBut sales at auto dealers slipped 1.2 percent, a sharp pull back after jumping 2.9 percent in December.\nSales at non-store retailers such as internet outlets were flat in January, although they have climbed 12 percent over the past year as more Americans prefer to shop via their computers and phones.\nOver the past 12 months, total retail sales have risen a solid 5.6 percent. The greater spending likely reflects the improving job market. Employers added 227,000 workers in January, while the unemployment rate ticked up slightly to 4.8 percent because more people started looking for jobs and were counted as unemployed.",
    "source_domain": "abcnews.go.com",
    "title": "US retail sales rise in January, led by gas and restaurants",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-retail-sales-rise-january-led-gas-restaurants-45506980"
}