{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2017-06-15 10:28:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "As rescue effort continues, death toll up to 17 from London high-rise fire",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fauthorities-miracle-survivors-found-london-fire%2Fstory%3Fid%3D48050649.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_b6c4e13ece044d90a76479798633fc98_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rescue workers continued to search for survivors on Thursday a day after a deadly fire swept through a London high-rise, but officials admitted it would be a \"miracle\" if more people were found alive as the death toll rose to 17.\n\"Tragically now we are not expecting to find anyone else alive,\" London Fire Commissioner Dany Cotton told Sky News early Thursday. \"The severity and the heat of the fire will mean that it will be an absolute miracle for anyone to be left alive.\"\nAs the search operations continued, authorities braced for the death toll to increase. In addition to the deceased, nearly 80 others were injured at the inferno at Grenfell Tower in North Kensington, which erupted early Wednesday morning. Of the injured, 18 people were listed in critical condition.\nCotton confirmed that there was still \"unknown numbers\" of people in the still-smoldering wreckage as of early Thursday morning.\n\"Due to the severity of the fire and the way things are, it will take a long time for us to be able to do that search to properly identify anyone who is left in the building, but we will do that as soon as we can in conjunction with the police,\" Cotton said. \"There are, as we believe, still unknown numbers of people in the building.\"\nCotton commended rescue workers for doing \"absolutely sterling work\" and said her team hoped to conduct a fingertip search of the building once its edges were deemed secure.\nThe fire reportedly started at around 1 a.m. local time Wednesday on the fourth floor of the 24-story residential building. The cause of the fire is still unknown, but U.K. Prime Minister Theresa May, who visited the site on Thursday morning, promised a \"proper investigation\" into the incident.\nSome tenants had previously complained about the upkeep of the tower, specifically warning about the fire risk. In November, a residents' group, Grenfell Action Group, said that only a \"catastrophic event\" would expose the concerns it had about the building's landlord, according to a blog post from the group.\nIt was not clear exactly how many residents were in the building, but the tower, built in 1974, contained 120 apartments, according to its management company, Kensington and Chelsea Tenant Management Organisation.\nFamily and friends of residents have posted missing persons bulletins all throughout the North London area, while others have shared images of loved ones who are unaccounted for.\nLondon Ambulance Service said that as of Thursday morning, 68 people had been taken to local hospitals and another 10 people had self-reported and been accounted for. Other survivors have been asked to self-report at Portobello Rugby Club in London and \"make themselves known.\"\nFire officials said it took nearly two hours to gain control of the massive fire. The London Fire Brigade dispatched at least 40 fire engines, 20 ambulance crews and more than 200 firefighters in an effort to battle the conflagration.",
    "source_domain": "abcnews.go.com",
    "title": "Authorities: It'll be a 'miracle' if more survivors are found after London fire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/authorities-miracle-survivors-found-london-fire/story?id=48050649"
}