{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:50:58+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Bag That Washed Ashore Is From Plane Carrying 6, Police Say",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Frecovery-efforts-resuming-small-plane-carrying-44511244.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_b7c27357441144a1b27f08c6ee934fc2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A bag that washed ashore near a private harbor has been confirmed as coming from a small plane carrying six people that disappeared over Lake Erie near Cleveland, authorities said Monday as they resumed a search for the missing aircraft.\nThe city said there have been multiple reports of debris washing ashore east of Burke Lakefront Airport, where a plane carrying a family of four and two neighbors departed late Thursday. John T. Fleming, chief executive of a Columbus-based beverage distribution company, was piloting. His wife, Sue, their two teenage sons, Jack and Andrew, and two neighbors were also aboard.\nPolice confirmed that a bag recovered Sunday was from the aircraft. It was found near Shoreby Club Harbor in Bratenahl, a small lakeside community. No other details were released immediately.\nThe other debris hadn't been verified as coming from the Cessna 525 Citation.\nThe aircraft was headed to Ohio State University Airport, northwest of downtown Columbus. The plane suddenly lost altitude about 2 miles out, according to a flight-tracking service.\nFleming's father has said the family and friends went to a Cleveland Cavaliers basketball game.\nThe city of Cleveland said there were light winds and fairly calm waters Monday for seven vessels and four dive teams searching waters 35 to 45 feet deep. The search grid area is some 2.5 miles from east to west along the shoreline and 2 miles north to south into the lake.\nThe U.S. Coast Guard and crews from Cleveland city agencies, the cities of Akron and Toledo, Ohio's Department of Natural Resources, New York State Police and Underwater Marine Contractors are involved in the search by air, shore and water.\nThe Coast Guard began searching the air after being notified soon after the plane's disappearance. High waves and blustery conditions prevented smaller Coast Guard boats from the Cleveland area from deploying Thursday night. A 140-foot Coast Guard cutter joined a search that covered 128 square miles of the lake on Friday.\nWeather and water conditions didn't allow for recovery efforts to begin Saturday, but crews searched for the plane until darkness fell Sunday.\nThe Federal Aviation Administration and National Transportation Safety Board are investigating.",
    "source_domain": "abcnews.go.com",
    "title": "Bag That Washed Ashore Is From Plane Carrying 6, Police Say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/recovery-efforts-resuming-small-plane-carrying-44511244"
}