{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:12:45+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcalifornia-pension-fund-urged-divest-gun-sellers-53853560.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_f7e53b76d58642bcbcd185529255c93e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Families of mass shooting victims are joining California State Treasurer John Chiang in calling on the nation's largest public pension fund to stop investing in companies that sell assault weapons and devices that allow guns to fire more rapidly.\nChiang will speak Monday at a board meeting of the California Public Employees' Retirement System, alongside family members of people who died in the 2015 terror attack in San Bernardino that killed 14 people and advocates for stricter gun laws. The wife of a high school teacher who died in Parkland, Florida, sent a letter supporting the effort by Chiang, a Democrat running for governor.\n\"Enough is enough,\" Chiang told The Associated Press in an interview. \"You have to go to what moves people, and we know money moves people.\"\nNew Jersey, Connecticut, Illinois and New York also are discussing divesting from gun-related companies.\nChiang asked after the Las Vegas mass shooting in October for the retirement system and the state's teacher pension fund to sell its stock in companies that sell \"military-style assault weapons\" and devices such as bump stocks that help guns fire like automatic weapons.\nCalifornia severely restricts the sale and possession of assault-style weapons.\nThe February shooting at Marjory Stoneman Douglas High School in Florida has spurred fresh efforts to put financial pressure on the National Rifle Association and companies that make and sell guns.\n\"We keep having these mass shootings,\" said Robert Velasco, whose 27-year-old daughter, Yvette, was killed in San Bernardino. \"If we can encourage them to divest in companies, wholesalers and retailers of these types of weapons, it could send a message throughout the country to other institutional pensions to do the same.\"\nThe retirement system has a roughly $850 million in holdings in Dick's Sporting Goods, Walmart, Kroger, Big 5 Sporting Goods and Sportsman's Warehouse Holdings. The fund's total value is $354 billion.\nThe fund approached all five in the fall, asking them to stop selling assault weapons and devices such as bump stocks. Following the Florida shooting, Dick's and Kroger announced they would stop selling such guns and would, along with Walmart, raise the age for firearms purchases to 21. Walmart and Big 5 Sporting Goods had previously stopped selling assault weapons.\nChiang attributed the pension fund's efforts as one pressure point that helped create change.\nBut experts, including at California's pension fund, have long questioned the financial and political effectiveness of divestment. By divesting, shareholders give up their power to exert influence and often times simply turn over the shares to other owners who may not take the same political or social stance.\nAs of June 2017, the pension fund's various divestment initiatives had cost the system more than $8 billion, according to a memo put together by the fund.\n\"There's considerable evidence that divestment is an ineffective strategy for achieving social or political goals since the usual consequence is often a mere transfer of ownership,\" the fund's investment office wrote in a presentation for the board.\nStill, using divestment to make political statements is a popular tactic in California. The pension fund decided in 2016 to sell off the last of its tobacco investments and has similarly started reducing its investments in coal. The state began divesting from gun manufacturers in 2013 following the shooting at Sandy Hook Elementary School in Connecticut.\nThe teachers fund will present research on its holdings in gun retailers in May.\n———\nThis story has been corrected to reflect that Walmart stopped selling assault weapons three years ago but recently raised the age for gun purchases.",
    "source_domain": "abcnews.go.com",
    "title": "California pension fund urged to divest from gun sellers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/california-pension-fund-urged-divest-gun-sellers-53853560"
}