{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:27:54+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Ravens GM Ozzie Newsome to step down after 2018 season",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fravens-gm-ozzie-newsome-step-2018-season%2Fstory%3Fid%3D52805791.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_ss_20180202_143236746_983580_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "OWINGS MILLS, Md. -- Ozzie Newsome will step down as the Baltimore Ravens general manager after the 2018 season and Eric DeCosta will replace him, owner Steve Bisciotti said at the annual \"State of the Ravens\" address Friday.\nNewsome, 61, made the decision to hand over top personnel role over DeCosta after the 2013 season, when he signed a five-year extension. Since becoming the team's top decision maker after the franchise's move from Cleveland to Baltimore, Newsome has been the architect for two Super Bowl championship teams (2000 and 2012).\n\"Ozzie will step down as GM and has assured me that he's not going anywhere,\" Bisciotti said. \"He will work with me and work with Eric for a smooth transition. He'll be the highest paid scout in America when Eric takes over next year.\"\nBisciotti also said there was \"a thought\" about firing coach John Harbaugh after the season, but he pointed out that he was proud of how Harbaugh held the team together during losing streak in the middle of the season. Baltimore finished 9-7 last season and has reached the postseason only once in the past five years.\n\"It was certainly a consideration, but not one that I was inclined to make this year,\" Bisciotti said.\nBisciotti refused to give a playoff-or-bust edict to Harbaugh heading into next season.\n\"He's under as much pressure than probably he's ever been in his life, and I expect him to keep his chin up and take his positivity and his talents and make the most of the season,\" Bisciotti said. \"I may as well replace him now if I tell him to make the playoffs or you're out of town next year. That's not the way we run business here.\"\nUnder Newsome, the Ravens have drafted 18 players who developed into Pro Bowl players, including one Hall of Fame inductee (offensive tackle Jonathan Ogden) and three potential ones (linebacker Ray Lewis, safety Ed Reed and linebacker Terrell Suggs).\nBut the Ravens have struggled with disappointing drafts in recent years. Baltimore has selected two Pro Bowl players in the past five drafts (linebacker C.J. Mosley and fullback Kyle Juszczyk) while whiffing on top picks such as wide receiver Breshad Perriman, safety Matt Elam and linebackers Arthur Brown and Kamalei Correa.\nDeCosta, 46, joined the Ravens in 1996 in an entry level position and worked his way up to becoming the assistant general manager in 2012. He has continually turned down interviews for general manager positions.\nAsked what he likes about DeCosta, Bisciotti said, \"Everything. I think he has learned from Ozzie and he's a great leader of the scouts. I like working with him. I think it's pretty evident by the fact that we were getting called every single year to try to get him, and it's a matter of it's time. There are people running other franchises that got the jobs because Eric wouldn't take it.\"",
    "source_domain": "abcnews.go.com",
    "title": "Ravens GM Ozzie Newsome to step down after 2018 season",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/ravens-gm-ozzie-newsome-step-2018-season/story?id=52805791"
}