{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:16:03+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Lu-Ann Merrell, 62, the wife of Merrell hiking boot company's co-founder, and her stepgrandson Jackson Standefer, 14, are believed to be \"well equipped to survive,\" according to Grand Canyon park rangers.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fsearch-continues-hikers-swept-grand-canyon-creek-46857363.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_whitworth3_0715_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Search continues for 2 hikers swept away in Grand Canyon creek\nLet's move on to the search for two hikers swept away in a creek at grand canyon national park from the family who founded the Merrell hiking boot company and kayna Whitworth is in los Angeles with the details. Good morning, kwain. Reporter: Good morning. The two have been missing more than 48 hours and were in their second day of a multiback backpacking trip and family members telling us they are experienced and have the skills to survive the rugged terrange. This morning, investigators desperately searching to locate two missing hikers who were swept away in the rushing waters of the grand canyon this weekend. 14-year-old Jackson Standefer and his step grandmother 62-year-old lou-ann Merrell were hiking with a group including Jackson's mother in a remote area of Arizona on Saturday. The national park service says the group was crossing this creek with fast-moving water when the two fell in and were swept away. This particular kind of incident is extremely rare. The two people would be washed away in a creek crossing is something that is unheard of in our local memory of grand canyon incidents. In 1981 Randy Merrell had an idea to create a hiking boot. Reporter: Lou-ann Merrell is married to the head of Merrell and is said to be an experienced hiker. Jackson's uncle facing where the hikers are is hot during the day and freezing at night and the water they were in was probably below 40 degrees. They were well provisioned for a multiday trip. The both were reported to have food and water in their backpacks. We believe they're equipped and have the knowledge to survive. Reporter: Now, the boy's uncle telling the ap searchers have found their backpacks. It's important to note this happened in such a remote part of the grand canyon search crews are having to stay the night into the wilderness. Some areas can't be accessed by foot, using boat, helicopters and drones to find the two. Thank you. Now we have that incredible\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Search continues for 2 hikers swept away in Grand Canyon creek",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/search-continues-hikers-swept-grand-canyon-creek-46857363"
}