{
    "authors": [
        "Abc News",
        "More Gerry"
    ],
    "date_download": "2018-07-04 14:38:08+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The 12-year-old boy is one of about 2,000 migrant kids separated from parents.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2F12-year-migrant-shelter-900-miles-family-happening%2Fstory%3Fid%3D56260143.json",
    "image_url": "https://s.abcnews.com/images/Politics/brayan-caceres-ht-thg-180629_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "He is 12, and in a shelter in Maryland, nearly a thousand miles from his family.\nInterested in Immigration? Add Immigration as an interest to stay up to date on the latest Immigration news, video, and analysis from ABC News. Add Interest\nWhen Brayan Cáceres' grandmother in Florida was finally able to talk to the boy after he had been detained with family at the border and sent to Maryland, \"He was crying. He didn't understand what was happening,\" Rosa Cáceres, the grandmother, said.\nNow when she talks by phone with the child, “He asks me when we are going to see each other, and I don’t know what to say. Sometimes I’m scared they will never give him back to me... With the authorities here, anything can happen.”\nA traumatic past\nBrayan is one of about 2,000 children who have been recently separated from family members trying to cross the U.S. border.\nHe is from Honduras, a country that has become wracked by violence and the home to many of the migrants now trying to reach the United States.\nAbout two years ago, Brayan's mother was found murdered in her home’s septic tank.\nThe main suspect was a boyfriend who had been living with the mom and Brayan since her separation from her son's father. The boyfriend, according to Cáceres, had been violent to both the mother and son, and was arrested in the mother's killing. But he was later released, the grandmother said.\nAfter the traumatic loss of Brayan's mother, his grandmother worries about the effect on him of living more than 900 miles from any family.\n“At first when his mother died he was terrified of the dark, of being alone … It was terrible to know that he was alone in that place [the shelter in Maryland] after what he’s been through,” said Cáceres, 48, who has been in the U.S. since 2007 and lives in Kissimee in central Florida.\nCourtesy Rosa Caceres\nThey traveled by foot, bus and on top of trains\nIt began for Cáceres with a call in early May informing her that her child was in custody at the U.S.-Mexico border in California. She assumed it was a mistake since her youngest child, a teenager, had just spoken to her by phone from Honduras.\nLater she learned that her adult son, José, had traveled to the U.S. border with Brayan; the boy's stepmother, Nubia; and José and Nubia’s youngest child, Yahir, a 4-year-old boy.\nThe family had come on the so-called Way of the Cross caravan, an organized group of mostly Central American migrants that travels together for protection as they make their way through Mexico to the U.S.\nJosé, Nubia and the two young boys came by foot, bus and on top of trains, and when they reached the U.S. they turned themselves in to authorities, Cáceres said.\nTwo days later, Brayan was taken from his father, and did not know why, Cáceres said.\nThe father, José, is back in Honduras after signing a deportation order when he met with immigration officials, according to Cáceres. The circumstances around his deportation are unclear. He also signed a notarized document granting custody to his mother, she said. The Department of Homeland Security declined to comment except to confirm that, “Jose Bartolo Caseres Caseres illegally entered the U.S on May 4, 2018, and was processed for removal. On May 22, 2018, he was removed to Honduras.”\nBut where was the 4-year-old?\nThe grandmother meanwhile said she didn't know for about 10 days what happened to her youngest grandchild, 4-year-old Yahir, or his mother.\n“I was desperate, I called every number I saw in the news, I looked for their faces in the TV reports,\" Cáceres said. \"I was very scared because [Yahir] was born prematurely and he has always been a small and sickly child.”\nThen she got a call from Nubia from a jail near the border, Cáceres said. She said the boy's mother asked for money for food because the child had a high fever and was refusing to eat the jail's food.\nNubia and her son were released soon after, and Cáceres paid for them to travel by bus from Texas to her Florida home. They are preparing to file an asylum claim.\nBrayan remains in Maryland, where according to his grandmother he shares a room with 11 other children and is able to make a 20-minute phone call twice a week.\nThe shelter is run the Board of Child Care in Baltimore, which is affiliated with the United Methodist Church, according to the program's website.\nIt launched its migrant-child program in 2014, targeted at the time to unaccompanied minors who came to the U.S., to \"offer care, safety, and support to a unique population in need,\" the agency's website says.\nABC News reached out to the Board of Child Care but the agency declined to comment.\nCáceres has been told that Brayan might be released around July 4, but, she said she has been given inaccurate or incomplete information before and is skeptical.\nCourtesy Rosa Caceres\nObstacles to reunification\nCáceres, who is employed at a construction company in Florida, has help from a social worker to sort out paperwork to acquire custody of her grandson.\nShe said she has had to submit a variety of notarized documents, including proof of her residence, a background check, fingerprinting and several documents sent from Honduras certifying their family ties to Brayan.\nHer one-bedroom apartment proved to be a problem, Cáceres said. The social worker told her she needed a larger place, a two-bedroom home, which has been a financial hardship. And because the area where she lives has been flooded with people fleeing from Puerto Rico after Hurricane Maria, there is a shortage of affordable homes, with several families often sharing a single house.\nWhen Cáceres finally managed to navigate the home search, she said she was told that too much time had elapsed and she needed to start the process over.\nCáceres has also had to submit documentation proving that she has enough income to support Brayan. She then started working as much overtime as possible, often working up to 12 hours a day. This, too, proved to be a problem because there would be no one to provide child care during those long hours.\nNow that Nubia and her child have joined her in Florida, Cáceres said she hopes to prove that Nubia can take care of the children while she works.\n“My son often tells me that he feels trapped in a dark tunnel with no way out. I tell him we have to keep pushing forward. Even if they are separated, things will be better once both children are with me,” Cáceres says.\nLaura Jaramillo Bernal contributed to this story.\nEditor’s note: This story has been updated to reflect that Brayan Cáceres is 12 years old, not 11 as previously stated.",
    "source_domain": "abcnews.go.com",
    "title": "12-year-old sent to migrant shelter 900 miles from family: 'He didn't know what was happening'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/12-year-migrant-shelter-900-miles-family-happening/story?id=56260143"
}