{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:30:03+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "A new report that Trump's company received three new trademarks from the Chinese government raises ethical concerns.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fivanka-trumps-brand-spotlight-reported-trademarks-46857354.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_vega2_0710_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Ivanka Trump's brand in the spotlight over reported new trademarks\nGeorge. A lot of tension, Matt Gutman, thanks very much. President trump planning to sign new executive orders as a new report reveals his daughter ivanka was awarded lucrative trademarks from chinaen 0 the same day she sat down with the Chinese president in mar-a-lago and Cecilia Vega has all the latest. Good morning, Cecilia. Reporter: Good morning to you, the associated press is reporting that the famous first daughter's business is booming. Sales they say have hit record levels. Imports are up and at least some of that success has come during some key moments during her short time here at the white house. Now, the day that Ivanka Trump's won provisional approval from the Chinese government for three new trademarks, that would give that company monopoly rights to sell things like jewelry and bags there, that night she and her husband Jared Kushner dined with China's president at mar-a-lago. Ethics experts are already weighing in and saying this could pose serious conflict of interest concerns. Ivanka Trump personally has tried to distance herself from her company and stepped down as CEO. She has said that she would recuse herself from con flishlgs of interest. We tried to ask Ivanka Trump, the white house, her team about this report. They have not responded to us yet but her attorney, take a look at this -- did tell the associated press, quote, she has retained authority to direct the trustees to terminate agreements that she determines create a conflict of interest or the appearance of one. But some big questions about that this morning. Can she judge her own conflict is the question. Meantime, these executive orders from the president designs to encourage hiring of American workers and buying of American products somewhat limited in scope. Reporter: This new order will take it tougher for tech companies to replace Americans with foreign workers. We're talking about these highly skilled workers on these h1b Visas. Candidate trump had called for a moratorium on these Visas. That doesn't go that far and also doesn't seem to impact the seasonal workers at the mar-a-lago hotel. He brings them in down at mar-a-lago and let's bring in\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Ivanka Trump's brand in the spotlight over reported new trademarks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/ivanka-trumps-brand-spotlight-reported-trademarks-46857354"
}