{
    "authors": [
        "Abc News",
        "More Veronica"
    ],
    "date_download": "2017-02-15 16:09:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Explaining the Logan Act that Dems say Mike Flynn may have violated",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fexplaining-logan-act-dems-mike-flynn-violated%2Fstory%3Fid%3D45481930.json",
    "image_url": "http://a.abcnews.com/images/Politics/ap-mike-flynn-jc-170214_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Retired Lt. Gen. Mike Flynn this week resigned from his position as national security adviser amid revelations that he misrepresented the nature of his phone conversations with Russia’s ambassador to the United States.\nEven though Flynn is out, Democrats and critics are calling for investigations and question whether he violated the Logan Act, a law dating back to 1799, which prohibits unauthorized individuals from communicating with foreign governments.\nHouse Democrats on the Oversight and Government Reform committee Tuesday sent a letter to chairman Rep. Jason Chaffetz, R-Utah, asking him to reconsider launching an investigation into Flynn and his ties to Russia as the congressman advised critics to “move on” and not to “dwell on the situation or pile on.”\nThe White House has cited an “eroding level of trust” in Flynn and not illegal activity to explain why President Trump asked for his resignation, adding that its counsel had determined there were no legal issues.\nBut the letter from Democrats, citing media reports, says Flynn “secretly discussed with the Russian ambassador, in possible violation of the Logan Act, sanctions imposed by President Obama.”\nHere’s an explanation of the 218-year-old law:\nWhat is the Logan Act?\nThe Logan Act was signed into law Jan. 30, 1799, by President John Adams, the second U.S. president.\nThe measure, amended in 1994, states that any U.S. citizen without authority who “directly or indirectly” communicates with a foreign government, officer or agent in dispute with the United States “shall be fined under this title or imprisoned not more than three years, or both.”\nThe Logan Act was named after George Logan, a doctor and friend of then-Vice President Thomas Jefferson who negotiated with France in 1798 without authorization from the president. After the French Revolution, France and the United States had tensions that President Adams tried but failed to smooth over.\nWhen Logan arrived in France unauthorized and was successful in easing the tensions, Adams recommended Congress put an end to the “temerity and impertinence of individuals affecting to interfere in public affairs between France and the United States.”\nWhy some critics argue Flynn is in violation of the Logan Act\nTrump named Flynn as his national security adviser Nov. 18. Before Trump was sworn in as president, Flynn had discussed sanctions with Russian ambassador Sergey Kislyak the same day the measure were imposed by the Obama administration, current and former U.S. officials confirmed to ABC News last week.\nWhat the White House is saying\nThe White House counsel conducted a “thorough review” to determine whether there were any legal issues with Flynn’s actions and concluded there were not, according to White House press secretary Sean Spicer.\n“There was nothing that the general did that was a violation of any sort,” Spicer said of Flynn in a press briefing Tuesday. “He was well within his duties to discuss issues of common concerns between the two countries.”\nIs Flynn in violation of the Logan Act?\n“This is not a statute that we actually ever use today. Ever,” University of Texas law professor Stephen Vladeck told ABC News.\n“I think the Logan Act is a red herring and I think it’s a red herring for a couple of different reasons. One: It’s almost never been used in the 218 years it's on the books. There's never been an actual conviction under the statute,” Vladeck said. “Two: It raises serious constitutional questions that I think would dissuade even the most zealous prosecutor from trying a case under the Logan Act.”\nPhilip Holloway, a legal analyst and former constitutional law adjunct professor, elaborated.\n“There’s a number of reasons why Lt. Gen. Flynn would not face criminal prosecution of the Logan Act. First reason is that most people agree that it’s unconstitutional. It’s unconstitutional in at least two ways. In my view the first is that it violates the First Amendment, which, of course, protects freedom of speech and freedom of association,” Holloway told ABC News.\nThe second reason, according to Holloway, is that the Logan Act is also unconstitutionally vague.\n“Vagueness is one reason that courts sometimes will strike down laws. Criminal laws need to be specific enough so that someone will know when they’re in violation of it,” Holloway said.\nFormer Deputy Attorney Assistant General Tom Dupree Jr. told ABC News, “Like many federal criminal laws, this statute is drafted exceedingly broadly. Unlike other criminal laws, you don’t have a rich body judicial precedent to narrow the scope of the law. All that said, I think a Logan Act prosecution would likely face serious constitutional difficulties.”\nEven hypothetically, legal analyst Holloway said he “could not stand in court and make the argument that that is a private person” because Flynn was an official member of the Trump transition team and national security adviser appointee at the time of his conversations with Kislyak.\nProfessor Vladeck said, “It’s not clear to me that a member of the transition team like Gen. Flynn is even violating the Logan Act in so far it’s not clear that he’s acting ‘without the authority of the United States.’”\nSo why does the Logan Act keep coming up?\n“It’s an easy branch to reach for if you’re trying to criticize a political opponent on more than just policy grounds,” Vladeck said.\nApart from apparently misleading Vice President Mike Pence, Vladeck said, there could be “a real potential issue” if he misrepresented information to the FBI.\n“Because whereas the Logan Act may be an [anachronism],” Vladeck said, “the federal false statements statute is not.”\nHe added, “But you would need the Department of Justice to want to pursue such a prosecution.”",
    "source_domain": "abcnews.go.com",
    "title": "Explaining the Logan Act that Dems say Mike Flynn may have violated",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/explaining-logan-act-dems-mike-flynn-violated/story?id=45481930"
}