{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 14:24:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Russian intelligence agency says it foiled attack plot",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frussian-intelligence-agency-foiled-attack-plot-49202324.json",
    "image_url": "http://abcnews.go.com/International/wireStory/russian-intelligence-agency-foiled-attack-plot-49202324",
    "language": "en",
    "localpath": null,
    "maintext": "Russia's main intelligence agency said on Monday it has foiled a plot led by two Soviet-born militants fighting for the Islamic State group in Syria.\nFour people have been arrested on suspicion of plotting a series of attacks, the FSB said in a statement. That includes two would-be suicide bombers who were supposed to blow themselves up on Moscow's transit system and in a shop. The FSB said they discovered a lab outside Moscow where improvised explosive devices were made.\nThe intelligence agency said the attacks were directed by two senior militants who fight on the side of IS in Syria and hail from the former Soviet Union.\nThe suspects arrested outside Moscow were not identified, but the FSB said one of them is a Russian national and three others are from Central Asia. The FSB did not say when the arrests took place.\nMore than 4,000 Russian nationals, mostly from predominantly Muslim regions, are estimated to fight alongside IS militants in Syria. When Russian President Vladimir Putin in 2015 launched a military operation there to provide air cover for the government's offensive against the IS, he said Russia's involvement was necessary to deter Russians fighting there from coming back home.",
    "source_domain": "abcnews.go.com",
    "title": "Russian intelligence agency says it foiled attack plot",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/russian-intelligence-agency-foiled-attack-plot-49202324"
}