{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 04:26:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Dolphins minicamp interrupted by swarm of bees",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fdolphins-minicamp-interrupted-swarm-bees%2Fstory%3Fid%3D48047979.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170614_nfl_bees_at_dolphins_camp_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "DAVIE, Fla. -- The second day of mandatory minicamp for the Miami Dolphins on Wednesday had several hundred uninvited guests.\nA swarm of bees packed one corner of the practice field near the bleachers and caused the team to switch ends of the field toward the close of practice.\nThe Dolphins noticed the bees after a deep passing play in the insects' direction to receiver DeVante Parker, who caught the pass in the end zone over cornerback Xavien Howard.\n\"I was standing right in the middle of it,\" Dolphins coach Adam Gase said. \"I was starting to see all of those somethings flying around and I didn't know what was going on. Then a couple of guys were freaking out.\"\nParker kept his full concentration and made the impressive catch. The team went to the opposite side of the field soon after.\nNo one was stung or needed treatment, Gase said.\nThere were no bees present at the start of practice. But by the end of the nearly two-hour session, a large group had formed.\n\"It was towards the end of practice and it got to the point where I was like, 'I'm not going to run. If they get me, they get me,'\" Dolphins guard Jermon Bushrod said. \"That was pretty weird and it was funny because we moved all the way down to the other end and you could still kind of see the swarm of them down at the other end.\"\nEven 6-foot-4, 305-pound Pro Bowl defensive tackle Ndamukong Suh didn't want anything to do with the swarm.\n\"I'm not a fan of bees,\" Suh said afterward. \"I've been around yellow jackets in Jamaica and all that stuff. I'm not too scared of them, but I'd rather not be stung if I didn't have to be.\"\nThe Dolphins will wrap up their three-day minicamp on Thursday, most likely without the uninvited guests.",
    "source_domain": "abcnews.go.com",
    "title": "Dolphins minicamp interrupted by swarm of bees",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/dolphins-minicamp-interrupted-swarm-bees/story?id=48047979"
}