{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 16:42:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Moscow faces 130 fake bomb calls, evacuates 100,000 people",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fmoscow-faces-130-fake-bomb-calls-evacuates-100000-50327413.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_511b3ed36461483990e5067cb443beaf_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Moscow on Friday faced over 130 fake bomb calls that prompted the evacuation of some 100,000 people from airports, shopping malls, schools, railway stations and office buildings.\nAmong those targeted by the bomb calls were all four Moscow airports, five railway stations, 15 shopping malls, several hotels, more than 20 schools and many other venues, the state Tass news agency said. No explosives have been found in the anonymous calls.\nIt was the latest and the most massive flurry of fake bomb threats since a wave of bomb hoaxes began in early September. The fake bomb threats have affected dozens of Russian cities and incurred massive economic damages.\nAlexander Bortnikov, the director of the Federal Security Service (FSB), the main KGB successor, said Thursday the agency had tracked down four people suspected of engineering the wave of hoaxes.\nBortnikov said the suspects were Russians living abroad who had accomplices inside the country, but he wouldn't identify them or describe their motives. He added that the perpetrators were using internet connections to make the calls, making them hard to identify.\nRussian media have speculated that the fake calls might have been launched from neighboring Ukraine, which has been angry with Russia for its support of separatists in eastern Ukraine, or staged by other Kremlin foes. There has been no evidence to back any of the theories, however.",
    "source_domain": "abcnews.go.com",
    "title": "Moscow faces 130 fake bomb calls, evacuates 100,000 people",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/moscow-faces-130-fake-bomb-calls-evacuates-100000-50327413"
}