{
    "authors": [
        "Abc News",
        "More Allan"
    ],
    "date_download": "2017-08-15 01:17:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Plus, get the latest from Guided by Voices, A.J. Croce and others.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Favicii-guided-voices-aj-croce-album-reviews%2Fstory%3Fid%3D49215336.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/avicii-performing-gty-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This week Swedish EDM star Avicii releases a new EP, indie-rock titans Guided by Voices release their second new album of 2017, Jim Croce’s son A.J. Croce releases his ninth album, British rockers the Cribs release a bold, raw record, Frankie Rose explores a more delicate synth-y side and Canadian country singer Lindsay Ell drops her debut album.\nAmazon\nAvicii’s “AVICI (01)”\n***\nSwedish EDM star Avicii has dropped a six-song EP entitled “AVICI (01).” Supposedly this will be the first part in a series of EPs making up his third album. This EP is guest-heavy and finds him working with mixed results, but more often than not, it works.\nListening to “Without You” featuring Sandro Cavazza and you get the feeling that he’s blending somewhat standard balladry with a textbook rave-up. Soft beginnings lead to booming choruses and then recede. When Avicii pitch-shifts and remixes Cavazza’s “So Much Better,” it works, but with its refrain of “I could do so much better,” you can’t help but agree. Avicii is capable of making records that are far less predictable.\nEven if this is one of his most consistently enjoyable releases date, he’s doing what is most universally appealing. It might give him hits, but it makes things a bit boring. Even though “You Be Love” featuring Billy Raffoul has some interesting emotional turns, you can predict the keyboard rise before it comes.\nOverall, “AVICI (01)” shows Avicii growing and slowly branching out, even if his standard mixing of easy balladry and EDM tropes sometimes brings him down. Hopefully the EPs that may follow will get him even more out of his comfort zone. He has plenty of room to still grow.\nFocus Tracks:\n“Lonely Together” (Featuring Rita Ora) This is the one stunning example of modern pop on this record. This is the one slow-burning banger where the formulas really come together to create something compelling. Ora brings a smoothness to the track, making something worthy of repeated listens.\n“What Would I Change It to” (Featuring AlunaGeorge) There’s a sweet, singsongy quality to this song. It gets by on a combination of immediate familiarity and cuteness. Again the kick-drum and calculated claps serve as a bit too strong of a backbone, but the British duo AlunaGeorge take Avicii beyond his stock tendencies.\nAmazon\nGuided by Voices’ “How Do You Spell Heaven”\n****\nFour months after handing in the double-length “August By Cake,” Robert Pollard and the current incarnation of Guided by Voices deliver the 15-track, 37-minute “How Do You Spell Heaven.” While Pollard’s prolific output often results in an unwieldy and sometimes uneven discography, this album and its immediate predecessor seem to indicate Pollard continues to be in peak-form.\nThis is a very cohesive set with numbers like “Diver Dan” and “The Birthday Democrats” showcasing Pollard at his signature best. Throughout, he maintains an indie-rock explosiveness with a power-pop-anchored catchiness. The set is also decently produced, sounding experimental but not so lo-fi that it hinders the end product.\n“King 007” has a lounge-flavored swagger, while “How to Murder a Man (In 3 Acts)” is a quickly shifting, multi-hued triumph. You get the feeling that Pollard could stretch these songs out if he wished, but the fact that he often leaves them as one-to-three-minute sketches keeps things moving and to the point. When he does decided to expand, like on the four-minute instrumental, “Pearly Gates Smoke Machine,” with its classic rock poses, things get more interesting.\nThere’s a regal quality to much of this record, even if it has its occasional purposely ragged edges. The inward-looking, smoldering qualities of “Low Flying Perfection” and “Tenth Century” indicate Pollard still can beguile and stun simultaneously.\nFocus Tracks:\n“Low Flying Perfection” This is a future GBV classic on par with “I Am a Tree” and “The Best of Jill Hives,” as it simmers with slow-burning perfection.\n“Diver Dan” A bubbling two-minute burst of a song, this is also a vintage slice of GBV.\n“Steppenwolf Mausoleum” There’s an earnestness throughout this record that indicates some hard-driving, dark edges. This track is one of the most successful turns in this vein.\nAmazon\nA.J. Croce’s “Just Like Medicine”\n***1/2\n\"Just Like Medicine” finds A.J. Croce working with legendary titans like Steve Cropper and co-writing a song with the late Leon Russell. Croce takes an understandably large chunk of influence from his legendary dad, singer Jim, even taking on his father’s previously never recorded composition, “Name of the Game” and making it his own.\n“Just Like Medicine” is a brisk, brief workout but it also shows that Croce is a performer in his own right, working from an age-old blues and rock mold. “Cures Just Like Medicine” is soulful track, as is the Russell co-penned “The Heart That Makes Me Whole.” There’s an old-school back-to-basics energy on both “Full Up” and “Hold You.” Croce is working from an older mold that blends a singer-songwriter strain with some strong Stax influence.\nSeasoned producer Dan Penn helps Croce execute an album that sounds like it was crafted with the influence of greats like Van Morrison, Bob Dylan and Elvis Costello in mind. Croce’s voice takes on several different tones during the course of the record, often having bluesy appeal. You can’t help but occasionally think of his father while listening to this record, but in spite of his obvious nods to other legends, it is evident that Croce has been (perhaps more subtly) building a legacy of his own.\n“The Heart That Makes Me Whole” You can definitely hear Leon Russell’s input on this track and Croce really sells it with a powerfully soulful croon.\n“Name of the Game” No doubt there was a lot of thought put into to tackling a previously unreleased song by his heavily celebrated father, but taking on such a task was definitely the right move. Doing so brings the bits of family resemblance to the forefront of the conversation. Croce delivers the song with both love and pride.\n“Hold You” There’s definitely a Van Morrison vibe here and Croce does this sound some justice.\nAmazon\nThe Cribs’ “24-7 Rockstar S---”\n****\nOn some level, the album’s title brings up absurd associations with outdated “rock star” tropes, but at the same time, once you hear that opening burst of feedback that opens “Give Good Time,” the title fits nonetheless, even if it initially comes off a bit hamfisted.\nThere’s fury embedded deeply in “Year of Hate,” but underneath all the shouting, the guitar and the bass keep a solid melodic structure intact. As the vocals settle and become more melodic, it feels like an exercise in catharsis.\n“Dendrophobia” brings to mind the most blistering side of Nirvana, which isn’t surprising given Albini’s presence on “In Utero.” In the midst of the pop-fueled atmosphere of 2017, this brand of volatility sounds fresh and exciting. Even when the band calms down on songs like “What Have You Done for Me” and “Dead at the Wheel,” a seething undercurrent is still present. This is a wonderfully unsettled record and yet if you really give it a concentrated listen, it is deceptively tuneful. Just give the brash “Partisan” and “Broken Arrow” a solid examination and both songs would survive much quieter readings with all their structural charms still present.\n“24-7 Rockstar S---” is an album designed for blasting. It’s a gleefully unhinged celebration of sheer volume, punctuated by amplifier squeals and a no-frills attitude.\nFocus Tracks:\n“Year of Hate” This is the album’s strongest track. It’s unsettled and at the same time it keeps your attention for reasons beyond its palpable sense of fury.\n“What Have You Done for Me” This is a singer-songwriter number injected with a brazen fuzz-rock core that makes it really simmer. The guitars explode and recede in the background adding powerful bits of emphasis.\n“Broken Arrow” On this, the album’s closing track, the Jarman brothers end the set on an upbeat note, with a thunderous, surprisingly pop-fueled chorus.\nAmazon\nFrankie Rose’s “Cage Tropical”\n****\nSinger-songwriter and rocker Frankie Rose has spent time in a number of key bands, notably Beverly, Dum Dum Girls, Vivian Girls and more. On her first solo record in four years, “Cage Tropical,” she trades up indie-rock for glowing eighties-inspired synth pop with an ethereal glow. No doubt this may be a polarizing effort for some fans of her previous work, but it is a polished, electro-fueled exercise with the same brand of majesty.\n“Dancing Down the Hall” is vaguely hypnotizing, while “Art Bell” takes a sly whisper and turns it into something that sounds like a post-punk experiment.\nBy calling a song “Love in Rockets,” she is nodding to the post-Bauhaus band Love and Rockets, and yet there’s something undeniably sunny about her approach, beneath the sleek atmospheres. Producer Jorge Elbrecht is able to bring forth the smooth, airy sound he brings to his own band, Violens’ records. This also feels like a cousin to Tamaryn’s 2015 album “Cranekiss” and No Joy’s 2015 album “More Faithfull,” two albums which Elbrecht also helmed.\nFrom the light pop shine of the title-track to the intriguing warmth of “Red Museum,” this stands as an appealing and unique record that should open up Frankie Rose to a bigger audience.\nFocus Tracks:\n“Red Museum” A swirling, somewhat dreamy composition, this song has some great vocal and instrumental call-and-response during the verse portion, and a blooming, bursting, multi-layered chorus.\n“Trouble” This is slick, semi-robotic ethereal exercise that sounds like a future new-wave classic. Rose isn’t quite singing in a deadpan tone here, but she is close.\n“Dyson Sphere” There’s a whispering, early-Cure-like energy here and yet this sounds ready for the beach at the same time. It bristles with both indie coolness and an alterna-pop sensibility.\nAmazon\n>Lindsay Ell’s “The Project”\n***1/2\nProduced by Sugarland’s Kristian Bush, the debut studio album from Canadian country singer Lindsay Ell is a likable, diverse release. Though Ell has a minor hint of a twang that pops up from time to time, really this record finds its sweet spot in mid-tempo pop numbers. There’s nothing really “country,” for instance, about the sleek sound of “Champagne,” which has a sultry, almost jazzy vibe. While this song has its cheesy moments (it name-checks both Jessica Biel and Aretha Franklin) it still winds up being a somewhat likable pop nugget.\nOn “Wildfire,” Ell works an appealing blues-rock groove, while “Castle” has some blues and R&B-flavored textures. Meanwhile, “Mint” has a bright, bounciness that cements its upbeat vibe. Sure, these are somewhat standard songs on some level, but Ell can drive them home.\nOn the surface, it sometimes seems like she is stuck on gender stereotypes that are perhaps a tad stale. “Just Another Girl” has the lines, “I could cry I guess. / Damsel in distress. / That’s a role I really know.” Soon after, though, she talks herself up after a break-up, essentially telling herself to not be “Just Another Girl,” to find a backbone and move on with her life.\nThere are peaks and valleys on this record. “The Project” definitely feels very much like a country-pop offering of the most commercial sort, and sometimes it gets ahead of itself. However, in the end, Ell is able to shift and move within the context of any backdrop she is handed. This is a record that could earn a wide audience.\nFocus Tracks:\n“Wildfire” This is easily the most ear-catching track on the record. It has a pretty rocking core and Ell commands the crowd, perhaps showing some influence from early-period Sheryl Crow. You can bet in concert this is a bit of a pop rager.\n“White Noise” A country-pop number with some nods to R&B in its verse sections, but its big chorus could potentially make it a hit. What makes this album on the whole appealing is that for the most part, its rises come off as pretty effortless and natural.\n“Worth the Wait” The echo on her voice is perfectly placed as Ell sings over a beautiful and subtle electric guitar riff.\nLater this week: New music from Grizzly Bear and more.",
    "source_domain": "abcnews.go.com",
    "title": "Avicii, Guided by Voices, A.J. Croce album reviews",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/avicii-guided-voices-aj-croce-album-reviews/story?id=49215336"
}