{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:47:50+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Seahawks DE Michael Bennett stays on bench for national anthem",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fseahawks-de-michael-bennett-stays-bench-national-anthem%2Fstory%3Fid%3D49215376.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170814_NFL_Michael_Bennett_Not_Standing_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CARSON, Calif. -- Seattle Seahawks defensive end Michael Bennett sat with a towel over his head during the national anthem on Sunday before his team took on the Los Angeles Chargers in the preseason opener for both teams at the StubHub Center.\nBennett's action came a day after his former teammate, running back Marshawn Lynch, did something similar before the Oakland Raiders' exhibition opener on the road against the Arizona Cardinals on Saturday.\n\"With everything that's been going on the last couple of months, and especially after the last couple of days seeing what's going on in Virginia, and earlier today in Seattle,\" Bennett said after his team's 48-17 victory. \"I just wanted to be able to use my platform to be able to continuously speak on injustice.\"\nBennett told reporters that he hopes his stance will cause others to go out and get involved in changing their community. Bennett said he intends to continue to sit during the national anthem.\n\"First of all, I want people to understand that I love the military,\" Bennett said. \"My father's in the military. I love hot dogs like any other American. I love football like any other American. But I don't love segregation. I don't love riots or oppression.\n\"I just want to see people have the equality that they deserve. And I want to be able to use this platform to continuously push the message of that.\"\nOne member of the Seahawks' front office told ESPN's Jim Trotter that he is OK with it, \"as long as Michael is preaching love and not hate.\"\nBennett said he spoke to other players around the league about his stance but did not talk to Lynch.\nBennett's Seahawks teammates and coaches were not aware of his plans. He decided to make a statement on his own because he didn't want to be a distraction to other players or his teammates.?\n\"I'm being vulnerable right now,\" Bennett said. \"There's a whole bunch of people sitting at home judging me, but they will never get to this point where they can be vulnerable. Let people attack me because they don't believe what I believe in, but at the end of the day, I'm being vulnerable to show every person that no matter [what] you believe in, keep fighting for it. Keep fighting for equality. Keep fighting for oppressed people. And keep trying to change society.\"\nBennett has been vocal in expressing his opinions on social issues over the past year.\nHe spent time with Colin Kaepernick during the offseason and wore a T-shirt supporting Kaepernick's \"Know Your Rights\" campaign during a spring news conference. Bennett was asked earlier this month what it will take for a team to take a shot on Kaepernick.\n\"It's going to take the organization,\" Bennett said. \"I think the players have spoken up enough. I think the media has spoken up. It just takes the ownership for someone to say we want this guy in our locker room. I think a lot of teams, like we said before, were really affected by what he did and what he did this year. It wasn't criminal.\n\"There's been guys who have criminal records, guys who have been accused of murder, guys who have been accused of rape and domestic violence who are still in the NFL. It's crazy to see this guy not have an opportunity in the NFL. It's just weird. I mean, some quarterbacks, as we all know, shouldn't be playing, but they are, and this guy is sitting on the side. We all know why. It's just hard to fathom that he's not having a job this year.\"\nESPN NFL Nation Seahawks reporter Sheil Kapadia contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Seahawks DE Michael Bennett stays on bench for national anthem",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/seahawks-de-michael-bennett-stays-bench-national-anthem/story?id=49215376"
}