{
    "authors": [
        "Abc News",
        "More Joohee"
    ],
    "date_download": "2018-04-24 20:23:03+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Cold buckwheat noodles from Pyongyang's famous restaurant will be served.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fserved-south-korean-president-moon-jae-meets-kim%2Fstory%3Fid%3D54698211.json",
    "image_url": "https://s.abcnews.com/images/Politics/koreas-menu-beef-gty-ps-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When South Korea's president meets with North Korean leader Kim Jong Un on Friday, they'll be dining on some of Korea's most famous dishes.\nInterested in North Korea? Add North Korea as an interest to stay up to date on the latest North Korea news, video, and analysis from ABC News. Add Interest\nCold buckwheat noodles from Pyongyang's famous restaurant, Okryugwan, will be served and its head chef will bring a noodle-making machine to the demilitarized zone, where it will be delivered to the House of Peace building, the location of the historic summit.\nSouth Korea's presidential office publicly released the menu for the multi-course meal, along with envy-inducing photos.\n\"We have sincerely prepared (dishes) from the sea and land of South and North carrying all people's wishes towards peace,\" according to a statement posted on the office's Facebook page.\nHere's a glimpse of what dishes will be prepared:\n- Cold octopus appetizer from Tongyeong, a port at the southern tip of South Korea. It is the hometown of a famous composer, Yun I-sang, who is beloved by all Koreans.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Swiss rosti with a Korean twist, in tribute to Kim's early school years spent in Switzerland.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Pyeonsu dumpling made of croaker and sea cucumber from the hometown of former South Korean President Kim Dae-jung who met with Kim Jong Un's father, Kim Jong Il, for the first historic summit in 2000.\n- Grilled dalgogi from President Jae-in Moon's hometown, Busan.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Barbecued beef from a famous ranch in Seosan, in the western province. The founder of Hyundai gave hundreds of cows from this ranch to North Korea in the 1990s.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Bibimbap made of vegetables grown inside the demilitarized zone and rice grown from former South Korean President Ro Moo-hyun's hometown in Bongha village. Ro had also met Kim's father in 2007 for the second inter-Korean summit.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Steamed red snapper and catfish, a common dish during feasts for Koreans. It is to symbolize similarities between the two Koreas, the president's office said.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Mango mousse dessert decorated to convey the wishes of reunification.\nSouth Korean presidential Blue House via AFP/Getty Images\n- Pine mushroom tea from the Baekdu Mountains in the far north of North Korea and citrus cake from the island of Jeju in the far south of South Korea. It represents the \"the mood of peace transferring down from the North's Baekdu Mountain to the end of Jeju,\" the president's office said.",
    "source_domain": "abcnews.go.com",
    "title": "A look at what will be served when South Korean President Moon Jae-in meets Kim Jong Un",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/served-south-korean-president-moon-jae-meets-kim/story?id=54698211"
}