{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:52:18+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Guatemala's indigenous seek recognition for justice system",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fguatemalas-indigenous-seek-recognition-justice-system-45501558.json",
    "image_url": "http://abcnews.go.com/International/wireStory/guatemalas-indigenous-seek-recognition-justice-system-45501558",
    "language": "en",
    "localpath": null,
    "maintext": "The law works as it has for centuries in the Guatemalan indigenous community of Solola: Townsfolk bring grievances and local authorities make rulings, usually with a speed unheard of in a country where justice is often delayed, if it comes at all.\nAt one recent weekly court session, Maria Micaela Panjoc, baby in arms, came with a request for paternity payments. Others sought help with land disputes. Andres Xelp wanted the judges to force his son to move back home.\nThe generally non-partisan leaders of local Mayan communities hear the cases, trying to find quick resolutions when they can and sometimes passing cases over to formal prosecutors when they cannot — as in the case of a young woman speaking the Kaqchikel language who said she'd been raped.\nThe Solola court alone handled 3,000 cases last year.\nFor generations, outsiders have looked down on indigenous law courts, as they have on the native cultures themselves. Some 40 percent of Guatemala's 17 million people identify themselves as indigenous and they are pushing for wider respect for the traditional ways in which their cultures deal with their differences, though opposition remains strong within the country's non-indigenous communities.\nGuatemala's Constitutional Court already has accepted some rulings by indigenous courts and there's a move to formally amend the country's constitution to recognize them. An earlier measure to do that came two votes short in congress, with opposition coming from conservatives and from business interests that said they feared legal confusion if different systems co-exist.\nMembers of congress on Wednesday are scheduled to discuss the proposed constitutional amendment to recognize indigenous justice as part of the country's judicial system. At least 105 of 158 legislators must approve the proposal for it to pass.\nThe idea has gained support from national Attorney General Thelma Aldana, as well as Ivan Velaszuqez, who heads the U.N. Commission Against Impunity in Guatemala that has been assisting in corruption investigations in the country.\n\"Guatemala has to be a place where all its inhabitants belong,\" said Velazquez, who visited Solola to view the court process.\nThe formal legal system has often exploited or ignored indigenous Guatemalans, who were legally required to perform forced labor well into the 20th century and who generally found it nearly impossible to pay for lawyers. Even now, only 10 percent of the country's townships have prosecutors' offices.\nIn Solola, Mayor Tomas Saloj presided over hearings in a town hall decorated with the 20 figures representing the Mayan calendar — 20 days per month, 18 months per year. On the table that served as the judge's bench were a candle and a glass of water, an invitation for the wisdom of dead ancestors to enter.\nPunishments can include restitution, community labor, banishment or whippings: Two braided leather whips hang in the Solola town hall as a reminder.\nAgustin Bocel, a town spokesman, recalled a case of attempted rape in which the attacker was sentenced to nine lashes of a whip — at the insistence of his own mother, one for each month she carried him, to remind him of the shame he caused her. Bocel said the man has never caused problems again.\nTomas Guarcas, the mayor of nearby Pixabaj, defended the practice.\n\"Whipping is a punishment that is like educating children, without violating human rights,\" he said, adding that the punishment is usually applied by \"by one of the offender's relatives, the mother, father or in-laws.\"\nIndigenous Congressman Amilcar Pop said the use of floggings is increasingly discouraged, however.\n\"This type of mechanism is something that has to be controlled and avoided,\" Pop said.\nAldana, the attorney general, said she sees no contradiction between the indigenous system and the formal courts. The indigenous courts, she said, \"have helped maintain the peace\" and helped \"reduce pressure on the regular justice system and its budget.\"\nVictoria Chuj is one of just three women among the 71 mayors in the province of Solola, of which the town of Solola is part. She carries her wooden staff — the badge of her authority, decorated with four tokens representing the four directions — with pride.\n\"The staff has to be good and straight so that, like justice, it cannot be bent,\" Chuj said.",
    "source_domain": "abcnews.go.com",
    "title": "Guatemala's indigenous seek recognition for justice system",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/guatemalas-indigenous-seek-recognition-justice-system-45501558"
}