{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 01:11:49+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fus-sailor-accused-stealing-grenades-navy-ship-54706583.json",
    "image_url": "http://abcnews.go.com/US/wireStory/us-sailor-accused-stealing-grenades-navy-ship-54706583",
    "language": "en",
    "localpath": null,
    "maintext": "A sailor was arrested in Illinois on Tuesday on charges he stole 20 hand grenades from a San Diego-based Navy destroyer, authorities said.\nGunner's Mate 2nd Class Aaron Booker, 31, of Waukegan, Illinois, was taken into custody in Great Lakes by U.S. Navy criminal investigators and was expected to be returned to California. It was unclear whether he had an attorney.\nBooker stole the concussion grenades — each of which contained about a half-pound (226 grams) of TNT — while he was assigned to the Weapons Department aboard the USS Pinckney, prosecutors said. Booker's job was to check the temperature of the secured locker where the grenades were kept.\nThe grenades were discovered missing from their storage crates in February 2017. He left the ship about a week later to drive to his new duty station in Great Lakes.\nAbout two months later, a black military backpack containing 18 grenades was found leaning on a guardrail on the side of Interstate 15 in northwest Arizona, officials said. The words \"GM2 BOOKER\" were written on a tag inside the backpack, prosecutors said.\nBooker told investigators that he had driven that road but said the backpack had been stolen from him and denied taking the grenades, according to a criminal complaint. Authorities continue to search for the two missing grenades, which Booker indicated to investigators might have wound up in Mexico, the complaint said.\nIt was unclear why the grenades were stolen or what the thief intended to do with them.\n\"A backpack full of grenades on the side of the road is obviously extremely dangerous and could have had resulted in injuries or death,\" U.S. Attorney Adam L. Braverman said in a statement. \"The theft of explosives is a very serious offense, particularly if it is carried out by an insider with access to military weapons and secrets.\"\nIf convicted of possessing stolen explosives, Booker could face up to 10 years in prison and a $250,000 fine.",
    "source_domain": "abcnews.go.com",
    "title": "US sailor accused of stealing grenades from Navy ship",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/us-sailor-accused-stealing-grenades-navy-ship-54706583"
}