{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 03:57:00+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Thames, Braun power Brewers past struggling Cubs 6-",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fthames-braun-power-brewers-past-struggling-cubs-46853751.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_d15d191d70514c99abbbc5d36c6f73fa_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Eric Thames homered in his club record-tying fifth straight game and the streaking Milwaukee Brewers turned back the Chicago Cubs 6-3 on Monday night.\nMilwaukee never trailed after Thames hit an opposite-field homer to snap a 3-3 tie in the third inning. Jeromy Burnitz became the first and last Brewers player to homer in five straight games in August, 1997.\nRyan Braun and Jeff Bandy also went deep for Milwaukee, the only team to hit as many as three homers in a game off Chicago starter John Lackey (1-2) last season. The victory was the Brewers' sixth in the last seven games.\nThe Cubs lost for a fourth straight time, their worst stretch since a five-game skid from July 5-9 last season.\nBrewers starter Chase Anderson (2-0) pitched five innings of three-run, seven-hit ball to pick up the victory. He walked two batters and struck out five. Neftali Felix pitched a scoreless ninth for his fifth save in as many tries.\nMilwaukee added pair of insurance runs in the eighth inning on Braun's RBI double and steal of third base followed by catcher Willson Contreras' throwing error.\nChicago trailed 3-1 when Albert Almora Jr. reached Anderson for a two-run double in the third inning. The hit scored Jason Heyward and Miguel Montero, who had led off with singles.\nIt took the Brewers three batters to break through against Lackey in the first inning.\nAfter Thames extended his hit streak to 10 games with a one-out double, Braun unloaded his seventh homer in the last nine games versus the Cubs. Braun's 651st extra-base hit moved him into second place with Paul Molitor on the Brewers' all-time list.\nChicago closed to within 2-1 on Ben Zobrist's two-out single in the bottom half of the inning.\nBandy quickly restored the two-run lead with a homer to open the second inning.\nTRAINER'S ROOM\nBrewers: RHP Matt Garza (strained right groin) had his rehab start moved from Triple A Colorado Springs to Class A Wisconsin on Monday due to forecast of rain in Nashville. The hope is that Garza can pitch with no limits before his return to the parent club this weekend. . RHP Junior Guerra (strained right calf) began workouts on a treadmill. Manager Craig Counsell offered no timetable for his return.\nTRADING PLACES\nChicago RHP Carl Edwards Jr. was activated after bereavement leave and OF Tommy La Stella was placed on the same list. Edwards was available for the opener of the three-game series against Milwaukee.\nLa Stella is 1 for 4 with one double and one RBI in six games this season.\nUP NEXT\nBrewers: RHP Jimmy Nelson (1-0, 1.38) will take a 1-6 career record versus the Cubs into his start on Tuesday.\nCubs: LHP Brett Anderson (1-0, 0.84) will get the call against the Brewers on Tuesday. He has no decisions in two career starts against them.",
    "source_domain": "abcnews.go.com",
    "title": "Thames, Braun power Brewers past struggling Cubs 6-",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/thames-braun-power-brewers-past-struggling-cubs-46853751"
}