{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 19:22:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "The Latest: Tillerson calls China official to discuss NKorea",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-tillerson-calls-china-official-discuss-nkorea-46847009.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_0b14c439e3e34898bd69149f7cd7b46c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Highlights of Vice President Mike Pence's trip to Asia (all times local):\n2 p.m.\nU.S. Secretary of State Rex Tillerson has spoken with China's foreign policy chief about North Korea.\nThe State Department says Tillerson called Chinese State Councillor Yang Jiechi (yahng jee-uh-CHEHR') over the weekend from Washington to discuss reducing tensions.\nNations have been on alert in recent weeks after a series of North Korean missile tests and fears that Pyongyang may detonate another nuclear weapon.\nThe Trump administration has repeatedly called on China to increase pressure on North Korea to comply with U.N. demands that it halt nuclear and missile tests.\nTillerson plans to raise North Korea again when he hosts a meeting of foreign ministers at the U.N. Security Council late next week in New York.\n———\n7:30 a.m.\nRussia's foreign minister says he hopes the U.S. will not take unilateral action against North Korea as it did recently in Syria.\nSergey Lavrov is responding to Vice President Mike Pence's statement Monday in South Korea that the \"era of strategic patience is over\" with regard to North Korea's efforts to build nuclear weapons.\nLavrov told journalists in Moscow that if Pence's words can be understood as a threat to take unilateral action against North Korea, \"then this is a very risky path.\"\nHe said, \"I hope there will be no unilateral actions like those we saw recently in Syria and that the U.S. will follow the line that President Trump repeatedly voiced during the election campaign.\"\n———\n4 a.m.\nChina is urging a return to negotiations over North Korea's pursuit of nuclear weapons after Vice President Mike Pence warned that the U.S. has lost its patience with the regime.\nChina's Foreign Ministry spokesman Lu Kang said Monday that tensions need to be eased on the Korean peninsula to bring the escalating dispute there to a peaceful resolution.\nLu says China wants to resume multi-party negotiations that ended in stalemate in 2009. He suggested plans to deploy a U.S. missile defense system in South Korea were damaging its relations with China.\nPence said during a Monday visit to South Korea that the North needs to abandon its weapons program and stop testing ballistic missiles.\nA North Korea missile exploded during launch in the latest test on Sunday.\n———\n2:55 a.m.\nVice President Mike Pence says the U.S. commitment to South Korea is \"iron-clad and immutable\" in the face of North Korea's work to advance its nuclear and ballistic missile program.\nPence is noting in a statement alongside South Korean Acting President Hwang Kyo-ahn that President Donald Trump recently launched airstrikes in Syria. Pence says, \"North Korea would do well not to test his resolve.\"\nThe vice president reiterated Monday that \"all options are on the table\" to deal with the threat posed by North Korea. He says any use of nuclear weapons by North Korea will be met with \"an overwhelming and effective response.\"\n———\n1:24 a.m.\nViewing his adversaries in the distance, U.S. Vice President Mike Pence traveled to the tense zone dividing North and South Korea and warned Pyongyang that after years of testing the U.S. and South Korea with its nuclear ambitions, \"the era of strategic patience is over.\"\nPence made an unannounced visit to the Demilitarized Zone at the start of his 10-day trip to Asia in a U.S. show of force that allowed the vice president to gaze at North Korean soldiers from afar and stare directly across a border marked by razor wire. As the brown bomber jacket-clad vice president was briefed near the military demarcation line, two North Korean soldiers watched from a short distance away, one taking multiple photographs of the American visitor.\n———\nFollow Ken Thomas on Twitter at https://twitter.com/KThomasDC",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Tillerson calls China official to discuss NKorea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-tillerson-calls-china-official-discuss-nkorea-46847009"
}