{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 07:45:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Thomas picks the right major at the right time to win",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fthomas-picks-major-time-win-49200264.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_e8f9b81806ae4ee9a952702668af671b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The son and grandson of golf professionals, Justin Thomas couldn't think of a better major to win than the PGA Championship.\nAnd at age 24, he couldn't think of a better time.\nYouth is taking over the highest level of golf, and there were times Thomas felt left behind. Rory McIlroy already had four majors when he was 25. Closer to home was Jordan Spieth, a close friend since they were 14. Spieth won his third major at the British Open last month to give him three legs of the career Grand Slam.\n\"Frustration probably isn't the right word,\" Thomas said. \"Jealously definitely is. I wanted to be doing that, and I wasn't.\"\nSunday at Quail Hollow was his moment.\nStarting the final round two shots out of the lead, Thomas closed with a 3-under 68 for a two-shot victory to capture the final major of the year.\nIt required a little bit of good fortune, like when his tee shot bounced out of a tree and into the fairway on the par-5 10th hole, which ended with his 8-foot putt teetering on the edge of the cup for 12 seconds before gravity finally took over and the ball dropped for birdie.\n\"I didn't even see it go in,\" said Thomas, who had his back turned to the cup as he was asking caddie Jimmy Johnson how it didn't go in. Players are allowed reasonable time to get to the ball, and then they get 10 seconds before they hit the next shot, so he was well within the limit.\nHe seized control on the back nine with a chip-in for birdie from 40 feet on the par-3 13th hole.\nAbove all, it required plenty of grit, and Thomas showed plenty of that.\nThe key moment in his victory came along the infamous \"Green Mile\" at Quail Hollow, a brutal stretch of holes where players are trying to hang on with pars. Thomas had a one-shot lead over Hideki Matsuyama when he drove into the rough, and his approach tumbled into a bunker. He did well to get that out to 6 feet.\nMatsuyama was spared by the thick rough behind the green that kept his ball from going into the water, and he had a good lie that allowed him to chip to 5 feet.\nThomas wasted no time over the putt and drilled into the center of the cup. Matsuyama missed and fell two shots behind.\nAnd then Thomas effectively ended it with a 7-iron so pure that he let the club swirl through his hand as the ball soared over the water, onto the green and rolled out to 15 feet on the 221-yard shot to a peninsula green. His birdie putt swirled into the cup, and the rest was easy.\nHe finished with a bogey — his first since the third hole — when it no longer mattered. Thomas finished at 8-under 276.\nHe won by two shots over Francesco Molinari (67), Patrick Reed (67) and Louis Oosthuizen (70), none of whom were a serious threat as they played the 18th.\nHis real challenge was Matsuyama playing next to him, and Kevin Kisner, the 54-hole leader in the group behind him.\nKisner ran off two important birdies on the 14th and 15th holes to get within one shot, but the final stretch is no place to make up more ground. He three-putted from 100 feet on the 16th hole to fall two back, couldn't convert from long range on the 17th and hit into the water because of mud on his ball on the 18th.\nAmong those waiting for Thomas alongside the 18th green were his father and Spieth.\nMike Thomas, the longtime pro at Harmony Landing outside Louisville, Kentucky, spread his arms wide as he approached his only son and wrapped them around him. He also made sure to collect an important part of history.\nEver since his son was in elementary school, he has been collecting golf balls from his victory. The total is now 131. Asked if he made sure to get the ball Thomas used to tap in the final putt, Mike Thomas reached into his pocket, smiled and said, \"You mean this one?\"\nThe PGA Championship was important to Thomas to take his place among the young elite in the game, and it was important to his family. His grandfather, Paul Thomas, also was a club pro and has been a PGA of America member for 60 years. He was the first person Thomas called.\n\"As a kid growing up, you want to win all the majors. You want to win any major,\" Thomas said after his two-shot victory. \"For me, the PGA definitely had a special place in my heart, and maybe a special drive. It's just a great win for the family, and it's a moment we'll never forget — all of us.\"\nSpieth was there, too, wanting to celebrate with his friend.\nThe week began with Spieth's bid to complete the career Grand Slam, and it never got out of the gates. Thomas, endlessly referred to as \"Spieth's close friend,\" emerged from his shadow with a major of his own.\n\"So awesome, dude,\" Spieth told him.\nSpieth and Thomas first became close when they played the Junior Evian Masters in 2007. Thomas won the 36-hole event and got to play the pro-am the next day with LPGA great Juli Inkster. Spieth caddied for him.\nTen years later, they have won consecutive majors and head into the FedEx Cup playoffs battling for PGA Tour player of the year.\nLongtime friends, now both are major champions.",
    "source_domain": "abcnews.go.com",
    "title": "Thomas picks the right major at the right time to win",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/thomas-picks-major-time-win-49200264"
}