{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 07:22:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Slain North Korean played complicated role in ruling dynasty",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fslain-north-korean-played-complicated-role-ruling-dynasty-45502621.json",
    "image_url": "http://abcnews.go.com/International/wireStory/slain-north-korean-played-complicated-role-ruling-dynasty-45502621",
    "language": "en",
    "localpath": null,
    "maintext": "A failed attempt to sneak into Japan to visit Disneyland in 2001 may have doomed the leadership dreams of the half-brother of North Korean dictator Kim Jong Un, who was assassinated this week in an airport in Malaysia.\nBanished from his dictator father's favor, the exiled Kim Jong Nam frequented casinos, five-star hotels and traveled around Asia, with little say in North Korean affairs. That ended Monday when he was killed in the Kuala Lumpur International Airport. Officials in South Korea say they believe the attack was carried out by North Korean agents.\nDespite multiple reported assassination attempts over the years, Kim Jong Nam was still a member of the most important family in North Korea, a direct blood descendent of North Korea founder Kim Il Sung.\nEstranged for years from his relatives, the 45-year-old gambler and playboy played a key, if complicated role in the dynasty that has ruled for three generations since North Korea's foundation in 1948.\nHere's a look:\n——\nPARENTS\nKim Jong Nam is the eldest son of Kim Jong Il, the second member of the Kim family to rule North Korea. Kim Jong Il had three known sons with two different women. Jong Nam was born from his father's unofficial relationship with North Korean actress Sung Hae Rim.\nKim Jong Il forced Sung to divorce her first husband and live with him, but Kim Il Sung — the first leader of North Korea and Kim Jong Il's father — never accepted Sung as his daughter-in-law. Kim Jong Il reportedly kept Kim Jong Nam's 1971 birth a secret from his father for several years. Sung was reportedly forced to leave North Korea and died in Moscow in 2002.\nDespite his mother's exile, some foreign experts believed that Kim Jong Nam would end up inheriting power because of a traditional Korean value system that favors the eldest son as heir.\nUnlike his mother, Kim Jong Nam eventually won the affection of his grandfather, who died in 1994, according to South Korean media reports.\n——\nBROTHERS AND SISTERS\nKim Jong Nam's two younger brothers share a mother: Kim Jong Il's Japan-born mistress, the dancer Ko Yong Hui.\nKo's links to Japan, which colonized the Korean Peninsula in the early part of the 20th century, led some to believe that Kim Jong Nam would outpace his siblings in the succession race. Ko immigrated to North Korea in the 1960s from Japan, where she had lived among the ethnic Korean minority. She died in Paris in 2004.\nKim Jong Un eventually won the succession race and became the North's supreme leader in late 2011 upon the death of his father. Believed to be in his early 30s, Kim Jong Un has carried out a series of high-profile executions and purges, and outside experts say few can now challenge his rule.\nKim Jong Nam's other half-brother, Kim Jong Chol, was once viewed by some outsiders as a potential candidate for leader. But a former sushi chef of Kim Jong Il said the late leader derided the middle son, known as a huge fan of rock guitarist Eric Clapton, as \"girlish.\"\nThe brothers also had at least two known sisters. One is Kim Yo Jong, who shares a mother with Kim Jong Un and who is currently working as a top propaganda official.\nAnother sister, Kim Sol Song, was born from Kim Jong Il's relationship with another woman, Kim Yong Sok. There has been little information about Kim Sol Song, but unconfirmed rumors in the South say she is being detained.\n——\nAUNT AND UNCLE\nKim Jong Nam's aunt, Kim Kyong Hui, is Kim Jong Il's younger sister. She was reportedly behind the expulsion of Kim Jong Nam's mother to the then Soviet Union in the 1970s. Kim Kyong Hui and her husband Jang Song Thaek then acted as Kim Jong Nam's caretaker.\nBut Jong Nam gradually lost favor with his father. He reportedly spent too much money at a Pyongyang hotel and made wild shopping excursions to China. When he was detained in Tokyo for trying to enter the country with a fake Dominican passport, he sported a diamond-encrusted Rolex watch and carried wads of cash.\nKim Kyong Hui and Jang were believed to have played a major role in grooming Kim Jong Un as the next leader. After Kim Jong Un took power, the two initially enjoyed great power. Jang was seen as the country's No.2 until he was stripped of all posts and executed in a sudden purge for alleged treason in 2013. Kim Kyong Hui, who was reportedly seriously ill, disappeared from the public eye.\n——\nFollow Hyung-jin Kim on Twitter at twitter.com/hyungjin1972",
    "source_domain": "abcnews.go.com",
    "title": "Slain North Korean played complicated role in ruling dynasty",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/slain-north-korean-played-complicated-role-ruling-dynasty-45502621"
}