{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 03:23:08+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-schools-closing-early-amid-weather-threat-53847692.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_0726a2a7a06b48d0af1e41bf04fe8f80_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the threat of severe weather across the Southeast (all times local):\n10:45 p.m.\nSignificant damage has been reported at Jacksonville State University in Alabama.\nAthletic director Greg Seitz said in a tweet Monday evening, \"I can confirm we have major roof damage at Pete Mathews Coliseum, but The Pete is not completely destroyed.\" He said there was extensive damage in Jacksonville.\nThe National Weather Service in Birmingham, Alabama, tweeted earlier that there was possibly a large tornado near Jacksonville and Calhoun County that was moving east into northern Cleburne County.\n———\n7:30 p.m.\nSevere storms have damaged buildings and downed trees in a northern Alabama county.\nThe Limestone County Sheriff's Office posted photos on Twitter of houses without roofs and destroyed garages in Ardmore, Alabama, on Monday evening. But it had no reports of injuries from the storms.\nThe office also tweeted that downed trees and power lines were blocking roads in the county along the Tennessee border.\nThe National Weather Service in Huntsville, Alabama, issued a severe weather statement at 6:41 p.m. that a confirmed tornado was over Ardmore and moving east.\n———\n5:45 p.m.\nThe University of Alabama planned to suspend normal operations Monday evening because of a severe weather threat.\nThe school said in a news release that operations would be suspended from 6:30 p.m. until midnight. That means classes and campus activities scheduled during that window are canceled.\nUniversity libraries were set to close at 6:30 p.m. and some dining halls were set to close early.\nCampus shelters were open to students, faculty and staff at North Campus Storm Shelter, East Campus Storm Shelter and the Magnolia Parking Deck. The Magnolia Parking Deck accepts pets accompanied by their owners.\nThe university plans to provide updates on Twitter at @UA—Safety.\n———\n4:35 p.m.\nState officials are warning residents in northern Alabama to brace for severe weather Monday evening.\nState meteorologist Jim Stefkovich said at an afternoon news conference that the \"potential for strong to violent, long-track tornadoes is a real possibility.\"\nStefkovich says storms moving into north Alabama will reach the Interstate 20 and Interstate 59 corridor between 7 and 10 p.m. and exit the state south of Interstate 85 and east of Interstate 65 between midnight and 2 a.m. Warnings could extend south to Dothan overnight.\nGov. Kay Ivey urged Alabama residents to implement safety plans and get in a safe location.\nAlabama Emergency Management Executive Operations Officer Jeff Smitherman raised the threat level and increased staffing at Alabama's emergency management agency. This is the first severe weather to hit the state this year.\n———\n4:15 p.m.\nForecasters say a late winter storm is expected to bring significant snowfall to parts of West Virginia this week.\nThe National Weather Service has issued a winter storm warning or watch for more than half of West Virginia's 55 counties beginning early Tuesday. Snowfall in amounts of 6 inches (15 centimeters) or more are possible.\nSome parts of the state are expected to receive a mix of rain, sleet and snow before changing to heavy, wet snow Tuesday night. The weather service says power outages could occur where the heaviest amounts fall.\n———\n3:55 p.m.\nThe National Weather Service has issued a tornado watch for parts of three Southeastern states and says the region faces a particularly dangerous situation.\nThe watch covers all of north Alabama including the cities of Birmingham and Huntsville, plus smaller areas in northeastern Mississippi and southern Tennessee. It expires at 11 p.m. CDT.\nForecasters say the storm threat is unusually dangerous because of the possibility of several tornadoes, some of which could be intense. The weather service says hail as large as 3 inches (7 centimeters) in diameter could fall, and there's a possibility of wind gusts to 70 mph (110 kph).\nForecasters already have reported hail in Mississippi, and they issued a tornado warning for a section of northwestern Alabama.\nTemperatures will turn cooler Tuesday after a cold front passes.\n———\n1:15 p.m.\nA strong thunderstorm has begun dropping hail in northern Mississippi as the Southeast braces for a round of storms that threaten to bring strong tornadoes.\nIn Mississippi on Monday, the National Weather Service reports hail near Ripley, while radar indicates hail fell along a 50-mile (80-kilometer) path from Holly Springs to Booneville. The storm has tracked all the way across the state from west to east, decreasing in severity as it nears Alabama.\nPictures posted to social media showed as many as several inches of pea-sized hail in some places.\nTwenty-nine million people face a threat of severe storms that could bring damaging hail, high wind and even tornadoes to the southeastern United States.\n———\n11:20 a.m.\nForecasters say there's increasing confidence that strong tornadoes could rumble across parts of the South — especially northern Alabama.\nIn a midmorning update Monday, the national Storm Prediction Center said the risk appeared increasingly likely for \"several tornadic supercells\" to traverse northern parts of Alabama.\nThe region is in the bulls-eye of a larger area under threat of severe weather Monday afternoon that also included parts of Tennessee, Mississippi and Georgia.\nTwenty-nine million people faced a threat of severe storms Monday that could bring damaging hail, high wind and even tornadoes to the southeastern United States.\n———\n8:20 a.m.\nSchools are closing early in the southeastern United States because of the threat of severe weather including tornadoes.\nMore than a dozen school systems in northern Alabama announced they're dismissing students early Monday because of a line of storms forecasters say will move through the area. Scattered early-closings extend into central Tennessee.\nOther school systems say they're monitoring conditions and could release students early if conditions warrant. Birmingham city offices are closing at noon because of the threat.\nThe National Weather Service says thunderstorms will develop ahead of an approaching storm system. They say tornadoes, damaging winds and hail as large as tennis balls are all possible.\n———\n7:15 a.m.\nTwenty-nine million people faced a threat of severe storms Monday that could bring damaging hail, high wind and even tornadoes to the southeastern United States.\nThe national Storm Prediction Center said large parts of Alabama, Georgia and Tennessee and a small portion of northeast Mississippi would be under a tornado threat Monday afternoon and Monday evening. Forecasters said enhanced risk of severe storms covers Nashville and Chattanooga in Tennessee; and Birmingham, Huntsville and Tuscaloosa in Alabama.\nIn Alabama, tornadoes, hail the size of tennis balls and 70 mph (110 kph) winds were most likely to occur in parts of central and northern Alabama, including all of metro Birmingham.\nIn Georgia, the highest risk of tornadoes will be in northwest Georgia, including Dalton, Rome and Cartersville.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Significant damage at Jacksonville State",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-schools-closing-early-amid-weather-threat-53847692"
}