{
    "authors": [
        "Abc News",
        "More Katherine"
    ],
    "date_download": "2017-04-18 10:10:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "President Trump to sign executive order targeting foreign work visas",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fpresident-trump-sign-executive-order-targeting-foreign-work%2Fstory%3Fid%3D46852992.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_0bc7147dba6245cbbb4e7d70fd206b36_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump is set to sign an executive order titled “Buy American, Hire American” Tuesday morning in Kenosha, Wisconsin, calling on agencies to overhaul the H-1B visa program.\nThe order calls on the Department of Labor, the Department of Justice, the Department of Homeland Security and the State Department to “take prompt action to crack down on fraud and abuse” within the U.S. immigration system to \"protect workers.\"\nThe order doesn't seem to change the status of existing visa waiver rules in the United States and instead orders departments to review and identify potential \"abuses\" of the visa waiver system.\nThe order align's with President Trump's promise as a candidate to review visa programs to prioritize the goal of \"buy American, Hire American,\" even as the president's own company, the Trump Organization, has often opted to take an alternate route. The company has used existing visa waiver laws in order to fill positions with foreign workers in Trump properties such as Mar-a-Lago and Trump Vineyard.\nThe president will travel to Wisconsin today and is expected to tout his “Buy American, Hire American” agenda during a visit to Snap-on-Tools -- a manufacturer of high-end tools and equipment that, according to their website, employs approximately 11,500 people worldwide.\n“He will talk about his buy America, hire America agenda at Snap-on Tools in Wisconsin,” White House Press Secretary Sean Spicer said. “For those who aren’t aware, Snap-on is a prime example of a company that builds American-made tools, with American workers for U.S. taxpayers.”\nThis marks the president’s first visit to Speaker Paul Ryan’s home state and district since taking office.",
    "source_domain": "abcnews.go.com",
    "title": "President Trump to sign executive order targeting foreign work visas",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/president-trump-sign-executive-order-targeting-foreign-work/story?id=46852992"
}