{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 23:56:58+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Kevin Durant says he thinks Kyrie Irving is better than Allen Iverson",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fkevin-durant-thinks-kyrie-irving-allen-iverson%2Fstory%3Fid%3D48045245.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170614_NBA_Kyrie_or_Iverson_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kevin Durant?has no problem displaying his pride in being from the Washington, D.C., Maryland and Virginia area, but he said he thinks? Kyrie Irving?is greater than one DMV legend and NBA Hall of Famer.\n\"Kyrie is better than [Allen Iverson] to me,\" Durant said of the? Cleveland Cavaliers?point guard while appearing on \" The Bill Simmons Podcast.\"\n\"I'm going from like skill for skill. His handle is better,\" Durant continued in praising Irving. \"We might have to cut that out -- I don't want no problems with A.I. Y'all might have to cut that one. I don't want that to get out. I'm just saying I feel like Kyrie got more skill.\"\nDurant's comments come after his team, the? Golden State Warriors, pulled off a five-game NBA Finals victory over Irving's Cavs.\n\"I was telling some of my friends after Game 2, I was like, Kyrie, he just makes you happy when you watch him play,\" Durant said on the podcast. \"You just smile when you watch him play, because for somebody to be that skilled, you know he had to work tirelessly at it. The stuff he has in his package is next-level stuff that you can try to teach your kids to do it, but you'll never be able to do it.\"\nAt 6-foot-2, Irving is listed as being two inches taller than Iverson. What Irving can do to defenders despite his slighter frame continues to impress Durant.\n\"I've never seen nobody block [Irving's] layup, and he's 6-2. I've never seen one person pin his layup on the glass, not one. Because the spin he got on it and he don't got to look at it,\" Durant said. \"I've got so much respect for him because I know how much work he has to put in to be that good.\"\nIn six years in the NBA, Irving is averaging 21.6 points, 5.6 assists and 3.4 rebounds per game, as compared to Iverson's career averages of 26.7 points, 6.2 assists and 3.7 rebounds over 14 years. Irving also has one NBA championship to Iverson's zero, though Iverson was named MVP in 2001.",
    "source_domain": "abcnews.go.com",
    "title": "Kevin Durant says he thinks Kyrie Irving is better than Allen Iverson",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/kevin-durant-thinks-kyrie-irving-allen-iverson/story?id=48045245"
}