{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:06:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Pope Francis: Native people have rights over their lands",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fpope-francis-wades-us-oil-pipeline-dispute-45504681.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_8cd7bba19bd54c5c9b3898ac9b5c2abe_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pope Francis insisted Wednesday that indigenous groups must give prior consent to any economic activity affecting their ancestral lands, a view that conflicts with the Trump administration, which is pushing to build a $3.8 billion oil pipeline over opposition from American Indians.\nFrancis met with representatives of indigenous peoples attending a U.N. agricultural meeting and said the key issue facing them is how to reconcile the right to economic development with protecting their cultures and territories.\n\"In this regard, the right to prior and informed consent should always prevail,\" he said. \"Only then is it possible to guarantee peaceful cooperation between governing authorities and indigenous peoples, overcoming confrontation and conflict.\"\nThe Cheyenne River and the Standing Rock Sioux tribes have sued to stop construction on the final stretch of the Dakota Access pipeline, which would bring oil from North Dakota's rich Bakken fields across four states to a shipping point in Illinois.\nThe tribes say the pipeline threatens their drinking water, cultural sites and ability to practice their religion, which depends on pure water. The last piece of the pipeline is to pass under a reservoir on the Missouri River, which marks the eastern border of both tribes' reservations.\nThe company building the pipeline, Texas-based Energy Transfer Partners, has insisted the water supply will be safe.\nFrancis didn't cite the Dakota pipeline dispute by name and the Vatican press office said he was not making a direct reference to it. But history's first Latin American pope has been a consistent backer of indigenous rights and has frequently spoken out about the plight of Indians in resisting economic development that threatens their lands.\n\"For governments, this means recognizing that indigenous communities are a part of the population to be appreciated and consulted, and whose full participation should be promoted at the local and national level,\" Francis told the indigenous leaders Wednesday.\nIn the waning days of the Obama administration, amid protests over construction that led to some 700 arrests, federal agencies that have authority over the reservoir said they would not give permission for pipe to be laid until an environmental study was done.\nU.S. President Donald Trump reversed course and last month instructed the U.S. Army Corps of Engineers to proceed with building the pipeline.\nFrancis' reference to prior consent is enshrined in the U.N. Declaration on the rights of indigenous peoples, which was adopted by the U.N. General Assembly in 2007 over the opposition of the U.S., Canada, Australia and New Zealand.\nFrancis' strong backing for indigenous groups and refugees, his climate change concerns and criticism of the global economy's profit-at-all-cost mentality highlight the policy differences with the Trump administration that may come out if the U.S. president meets with Francis while in Italy for a G-7 summit in May. There has been no confirmation of any meeting to date, however.\n———\nAP writer Daniela Petroff contributed.",
    "source_domain": "abcnews.go.com",
    "title": "Pope Francis: Native people have rights over their lands",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/pope-francis-wades-us-oil-pipeline-dispute-45504681"
}