{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2018-04-24 23:45:09+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The Dallas Police Department confirmed the shooting on Twitter.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdallas-police-officers-shot-critically-wounded-authorities%2Fstory%3Fid%3D54705025.json",
    "image_url": "https://s.abcnews.com/images/US/dallas-4-abc-er-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two Dallas Police officers have been shot and critically wounded, the Dallas Police Department wrote on Twitter.\nThe shooting occurred at a Home Depot in North Dallas, according to the ATF, which is responding to the scene.\nBREAKING: ATF is responding to the scene of a officer involved shooting at Home Depot in North Dallas, Texas. pic.twitter.com/inpxJQkncd — ATF HQ (@ATFHQ) April 24, 2018\nA civilian was also shot, and his or her condition is unknown at this time, police said.\nABC News\nThe shooting suspect may be in custody, according a U.S. Marshal on the scene. Police were actively searching for the shooting suspect in a nearby wooded area.\nWe can confirm that two @DallasPD officers have been shot and critically wounded. We will provide updates as we get them. Please pray for our officers and their families. — Dallas Police Dept (@DallasPD) April 24, 2018\nThe police department asked for prayers for the officers and their families.\nWFAA\nWFAA\nFurther details were not immediately available.\nIn 2016, five Dallas law enforcement officers were shot and killed and seven more injured after they were ambushed by 25-year-old former Army reservist Micah Xavier Johnson. Johnson later died in a standoff with police.\nFormer Dallas Police Chief and ABC News contributor David Brown said the most recent shooting on two police officers is \"too much to bear for one department in such a short time frame.\"\nThis is a breaking news story. Please check back for updates.",
    "source_domain": "abcnews.go.com",
    "title": "2 Dallas police officers shot and critically wounded, authorities say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/dallas-police-officers-shot-critically-wounded-authorities/story?id=54705025"
}