{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:32:28+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fap-norc-poll-online-americans-facebook-habit-54691945.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_80269ce4706b4ad580088bb81aaef8e0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Social media is a daily way of life for many Americans.\nNearly half of Americans who use the internet say they use Facebook at least several times a day, making it easily the most popular social media site. And Facebook-owned Instagram comes in No. 2.\nSo whether you're reaching for your phone before getting out of bed in the morning, or logging on to procrastinate during work, chances are you see the little blue \"F'' icon more often than you take a shower.\nA new poll from The Associated Press-NORC Center for Public Affairs Research finds that 12 percent of Americans who are online use Facebook \"almost constantly,\" while 34 percent use it several times a day. About 15 percent use it once a day, and only 12 percent of Americans don't have a Facebook account at all.\nMore women than men check Facebook more than once a day — 57 percent of women compared to 36 percent of men, according to the poll. Younger people are on Facebook more than older people. About 62 percent of adults under 30 check the site several times a day or more, while only 30 percent of adults 60 or over do. About 54 percent of adults 30 to 44 check multiple times a day, as do 43 percent of adults aged 45 to 59.\nJim Mazzarese, 73, a retired airline manager from Ft. Lauderdale, Florida, is one senior who checks Facebook on his phone several times a day when he gets notifications. He has a bit of a love-hate relationship with the site.\n\"It gets me crazy when I see opinions other than mine, it gets my blood pressure going up — but it's a lot of fun,\" he said. He appreciates how Facebook has let him connect with people from when he was growing up \"100 years ago.\"\nWhat about the other social media sites?\nSeventeen percent of Americans say they check Instagram throughout the day, and 10 percent say that about Snapchat. For all of the attention that President Donald Trump gets for his tweets, only 7 percent of Americans say they use the micro-blogging site several times a day. Just 5 percent say they spend that much time on WhatsApp, and 4 percent say the same of Reddit.\nIs it actually healthy to check in with Facebook so much?\nIn a blog post in December, Facebook acknowledged that users should be mindful of the issue. A study published in the Journal of Experimental Psychology the same month found University of Michigan students randomly assigned to read Facebook for 10 minutes were in a worse mood at the end of the day than students assigned to post or talk to friends on the platform.\nMeanwhile, a study that Facebook research director David Ginsberg conducted with a Carnegie Mellon professor showed that sending or receiving direct messages or posts and comments on one's timeline tends to boost psychological well-being.\nWorldwide, Facebook has 1.4 billion daily active users out of 2.2 billion total, so most active Facebook users check in at least once a day.\n———\nThe AP-NORC poll of 1,140 adults was conducted April 11-16 using a sample drawn from NORC's probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for all respondents is plus or minus 4.0 percentage points.\n———\nOnline:\nAP-NORC Center: http://www.apnorc.org/",
    "source_domain": "abcnews.go.com",
    "title": "AP-NORC Poll: For many online Americans, Facebook is a habit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/ap-norc-poll-online-americans-facebook-habit-54691945"
}