{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 16:21:00+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "GOP Congress Feels It Has Mandate to Undo Obama's Agenda",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fgop-congress-feels-mandate-undo-obamas-agenda-44508262.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_8fe9ab707af449a49216f7a6842062c5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Republicans' grip on all levers of power stands as a mandate to the GOP-led Congress, which will move swiftly to try to undo eight years of outgoing President Barack Obama's agenda.\nWith Republican President-elect Donald Trump just weeks away from assuming office, GOP lawmakers plan to open the 115th Congress on Tuesday and immediately take steps to repeal Obama's health care law. Beyond that, they'll look at a tax overhaul, reversing Obama-era environmental regulations and other conservative priorities.\nRepublicans will face some obstacles. House Minority Leader Nancy Pelosi says Democrats \"stand ready to fight vigorously\" to protect health care and other priorities, and Republicans will have to compromise with Senate Democrats to move major legislation through that chamber.\nA look at what the 115th Congress will be up to in 2017:\n———\nNEW MEMBERS\nNew members of the House and Senate will be sworn in on Tuesday, the first day of the new Congress.\nIn the Senate, five Democrats and two Republicans will be sworn in for the first time, joined by returning members who won re-election in 2016. After those members are sworn in, there will be 52 Republicans, 46 Democrats and two independents who caucus with the Democrats.\nThe House will have 52 new members — 27 Republicans and 25 Democrats. There will be 241 Republicans in the House and 194 Democrats.\n———\nCONFIRMING A NEW CABINET\nTrump is sworn in on Jan. 20, and Republicans in the Senate will spend the first days and weeks of his presidency pushing to confirm his Cabinet picks. Democrats changed the rules and curbed the filibuster in 2013, making it easier for Republicans to move nominations. But even though they won't be able to block Trump's nominees, Democrats have pledged to fight many of them anyway, highlighting what they say is the hypocrisy of Trump's populist message and his wealthy, corporate-favoring nominees for several posts.\n———\nREPEALING OBAMA'S HEALTH CARE LAW\nThe Senate plans to begin repealing Obama's health care law on Tuesday, Congress' very first day, with consideration of a procedural measure that will shield the initiative from Democratic filibusters.\nLawmakers will then spend the next few months working on legislation canceling broad swaths of the law. Likely to go are its mandate that people buy health insurance or face IRS fines, and its expansion of Medicaid coverage to more lower-earning Americans. Some elements of the repeal likely wouldn't go into effect for two to four years.\nRepublicans will then begin the more complicated task of building a new system. The GOP will have to craft new programs for the nation's $3 trillion health care system and make sure insurance markets don't collapse while the transition is under way.\n———\nTAX OVERHAUL\nSenate Majority Leader Mitch McConnell, R-Ky., and Speaker Paul Ryan, R-Wis., want a massive overhaul of the tax system with the goal of simplifying a complicated tax code that rewards wealthy people with smart accountants as well as corporations that can easily shift profits and jobs overseas.\nIt would be the first major tax overhaul in 30 years. Trump has also advocated a tax overhaul, but with fewer details. He promises a tax cut for every income level, with more low-income families paying no income tax at all.\n———\nSUPREME COURT\nSupreme Court Justice Antonin Scalia died 11 months ago, but the Senate still hasn't considered a replacement. That's because McConnell blocked consideration of Obama's nominee, Judge Merrick Garland, saying the next president should make the pick. The strategy paid off, and the Republican Senate will consider whomever Trump nominates.\n———\nMEDICARE CHANGES\nRyan is the most powerful advocate in Washington for an overhaul of Medicare and a premium-support approach that would, over time, remake it into a voucher-like program that could force some seniors entering the program to buy health insurance on the open market instead of getting coverage through the traditional open-ended program.\nBut his ideas likely will run into a political reality. Trump said on the campaign trail that he wouldn't cut the program, and Senate Republicans haven't been as enthusiastic either.\nCandidate Trump also initially promised not to cut Medicaid — the federal-state health insurance program for low-income and severely disabled people. During the campaign, Trump seemed to shift, backing \"block grants\" that limit federal funding.\n———\nSOCIAL SECURITY\nLike Medicare, some House conservatives have said they want to overhaul Social Security and slow the program's growth to curb spending. But Trump has said he doesn't want to touch those programs, and Ryan told CBS' \"60 Minutes\" in December that he has no plans to change Social Security.\n———\nREVERSING REGULATIONS\nRepublican leaders have complained throughout Obama's presidency about burdensome regulations, a theme Trump used frequently during the campaign as well. GOP lawmakers now want to undo some of Obama's regulations and executive orders, using the Congressional Review Act, a rarely invoked procedure.\nMany of the regulations they are targeting are rules put in place by the Environmental Protection Agency, including the Clean Power Plan to cut carbon pollution from coal-fired power plants, a clean water rule that has drawn the ire of farmers and another rule imposed in December to protect nearby streams from coal-mining debris.\n———\nINFRASTRUCTURE\nTrump made rebuilding the nation's aging roads, bridges and airports a major part of his job-creation strategy in the presidential race. But those plans appear to have fizzled, somewhat, as GOP leaders have questioned the spending.\n———\nAssociated Press writers Alan Fram, Matthew Daly and Ricardo Alonso-Zaldivar contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "GOP Congress Feels It Has Mandate to Undo Obama's Agenda",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/gop-congress-feels-mandate-undo-obamas-agenda-44508262"
}