{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 19:46:16+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Radio host Martin Starke calls Salisbury a \"quintessentially English city.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fvideo%2Fbritish-city-center-russian-spy-scandal-53856722.json",
    "image_url": "https://s.abcnews.com/images/International/180319_vod_orig_salisbury_profile_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for The British city at the center of a Russian spy scandal\nGonna see a bright spot in the morning him consoles were some moments sunny intervals would about it through the morning them if you like showers as well. He high today of twelve to parades. Hi my name's Martin stopped I think that for so owns pirate fan which he's the local radio station missiles rate. Source free ice sold described this week. 1690 miles west of London and and that kind of beneath them though how. The world thinks about schools that. If that quintessentially English 63. Great run great I think the common Steve you. If such a beautiful beautiful city. And that many people will come to souls braved it was stay here they were visit Stonehenge. Was the true. Imprisoned in Russia afraid to come to push through another critically ill in hospital when. The news broke about its that is weak opening Pullman Russian spy and and attempted murder happening in schools please. But if it's because you couldn't be here and then the world's media descended on Seoul's Korea and thieves he still pixels but beast underneath. Under that need useful life. It was it's a good a couple of days to think it east and a cosmonaut who's from the two schools. Well tonight on the roads this morning and security heading into salt on the downs right that's the thing. Later today. At its site for the that the biggest stories locally for us it's been the consent of the well fat two rockets the manager of the new pub I Philippe and Hari. Because of the piece called the executions and its top. If Levy's Pat Roberts behind. And that we were taking hundreds of cools them messages on social media about that the welfare of these two wrap it. As a radio station we were able to to highlight we write to to get in touch weekly food should beneath and then I think he needs on. Wednesday or Thursday that someone of being needed Fred and walked to the rapid never going to be a case that. Today to the kind of things that are affecting the people but living and working in Seoul spree and we day. Eleventh that speak to the local businesses I think out. Not to normally quaint strip between some pretty pieces of yet that we from culminates on fifteenth street installed pretty good. Cordon around the supermarket extended than people who on the side not punish king about whether they know what they've done their asking how do I still get into the seat market. If this fight and consistent with the front and I couldn't how mandated to get my bills and to get my break the bank and to get money supply that. But he is who very terribly British and Ayman. Mossy stuck you with us fight fat when he shouts of ice and what he thought. He sells and and it's the initial Schultz that we school on the front pages of the newspapers of the guys in the house Nazis was. Was a little bit scary but the thing about reading that information seeing as it utensils for is that. That we all know these people then when you come into when you're talking about it that's. Let's put the plight of athletes say they had to sit on the right hand side of and that's been that's what he's talking about not the fact that this has not states and its. Potentially. A nerve agent and I've had to take it away with talking about it is that these without coal. And we that the police officers while he's been in post but so that people that would no news nick by the ninety's found me and people can buy him as it and he's been back there and he doesn't want to be known as a hero and boss everybody's been focusing on the fifth inflation kind of odd things would just looking at. Of it because people but we know and we live in schools we weave in and look around. We just about it buffeted but the partition it fit and to get on with it. I think reports that we're living in Korea. Greatly exactly.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "The British city at the center of a Russian spy scandal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/video/british-city-center-russian-spy-scandal-53856722"
}