{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:30:18+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Ricki Lake's ex-husband has died after struggle with bipolar disorder",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fricki-lakes-husband-died-struggle-bipolar-disorder%2Fstory%3Fid%3D45507983.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-Ricki-Lake-Christian-Evans-rc-170215_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Actress and former talk show host Ricki Lake has revealed that her ex-husband has died at age 45 after a lifelong battle with bipolar disorder.\nLake shared the tragic news Tuesday by posting a photo of the two of them on Instagram, with the caption, \"It is with a heavy heart that I share that my beloved soulmate, Christian Evans has passed.\"\nShe continued, \"The world didn't understand this man, but I did. He succumbed to his life long struggle with bipolar disorder. For anyone who has ever lost a family member or friend to mental illness, my heart goes out to you.\"\nLake, 48, wrote that she is a \"greater person\" for knowing her ex and spending \"6 and a half years\" with him.\n\"He was a man of love and what mends my broken heart today is knowing that he is finally at peace and his spirit is free,\" she added. \"Rest in peace, my love.\"\nThey were engaged in August 2011 and eloped in 2012. Lake separated from Evans Oct. 9, 2014, and she filed for divorce a week later, citing irreconcilable differences.\nLake was previously married to Rob Sussman, and they have two sons named Milo, who is 19, and Owen, who is 15.",
    "source_domain": "abcnews.go.com",
    "title": "Ricki Lake's ex-husband has died after struggle with bipolar disorder",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/ricki-lakes-husband-died-struggle-bipolar-disorder/story?id=45507983"
}