{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:15:01+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Lara Spencer reports the buzziest stories of the day in \"GMA\" Pop News.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fvideo%2Fdwayne-rock-johnson-welcomes-baby-girl-tiana-54688803.json",
    "image_url": "https://s.abcnews.com/images/GMA/180424_gma_pop3_0810_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Dwayne 'The Rock' Johnson welcomes baby girl Tiana\nAnd hi to Lara with \"Pop news.\" Hi, robin. Hi, George and Michael and everybody in the audience. We'll begin with a chip off the old rock. The tiny little pebble if you will in it photo posted by Dwayne Johnson. Oh. Welcoming Tiana Gia Johnson. He writes, I was raised and surrounded by loving strong women all my life but after participating in baby tia's delivery it's hard to express the new level of love, respect and admiration I have for Lauren and all mommas and women out there. She is the second child for Dwayne and longtime love Lauren hashian and wish the whole family all the best from your families at \"Gma.\" Beautiful. Congratulations. And music lovers, listen up. Phenomenal news for prince fans. \"Variety\" revealing a full new album of unreleased prince material is many cog and soon. The caretakers of his estate say it will come from a specific time in his ten-decade career but they won't reveal when that period is at this point. Please \"Little red corvette.\" Please, \"Little red con vet.\" After the success of last week's release of \"Nothing compares to you\" and this never before seen of him in the studio from 1984, the prince team decided they should probably give the fans something else this year and so they will. This new album reportedly dropping September 28th. Look for that. Good. There is a lot. Yes, prolific. And then finally actress Sarah Jessica parker in the news. She's made fashion a full-fledged second career and now she is launching her own bridal collection. The \"Sex and the city\" star created a line of wedding dress, body suit, skirts, jumpsuits and more all in an assortment of colors not just white and crime for a modern day wedding look. Parker telling page 6 she intended on her line being usable outside of just that special occasion. I think that's a great idea. She insisted on a large rank of sizes making it easy for anyone to enjoy her designs. The bridal collection is called sjp by Sara Jessica parker bridal comes out emotionally on gilt then as he \"Pop news.\"\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Dwayne 'The Rock' Johnson welcomes baby girl Tiana",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/video/dwayne-rock-johnson-welcomes-baby-girl-tiana-54688803"
}