{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 12:13:46+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Under 3 Weeks Left: Obama in Closing Stretch of Presidency",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fweeks-left-obama-closing-stretch-presidency-44508261.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_fc9e82550eb94e9a8788089920b75aac_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "His last presidential vacation behind him, Barack Obama is entering the closing stretch of his presidency, an eleventh-hour push to tie up loose ends and put finishing touches on his legacy before handing the reins to President-elect Donald Trump.\nObama returns to Washington midday Monday from Hawaii with about two-dozen work days left. His final days will largely be consumed by a bid to protect his endangered health care law, a major farewell speech and the ongoing handover of power to Trump.\nIn an email to supporters on Monday, Obama said he'll deliver a valedictory speech on Jan. 10, following a tradition set in 1796 when the first president, George Washington, spoke to the American people for the last time in office. The speech will take place at McCormick Place, a giant convention center in Obama's hometown of Chicago.\n\"I'm thinking about them as a chance to say thank you for this amazing journey, to celebrate the ways you've changed this country for the better these past eight years, and to offer some thoughts on where we all go from here,\" Obama said.\nObama's chief speechwriter, Cody Keenan, traveled with Obama to Hawaii and spent much of the trip working on the speech. The Chicago trip will likely be Obama's last outside Washington as president and will be include a \"family reunion\" for Obama's former campaign staffers.\nObama is also planning last-minute commutations and pardons, White House officials said, in line with his second-term effort to cut sentences for inmates given unduly harsh sentences for drug crimes. Though prominent offenders like Edward Snowden and Rod Blagojevich are also asking for leniency, Obama's final acts of clemency are expected to remain focused on drug offenders whose plight Obama tried but failed to address through criminal justice reform.\nAfter taking office eight years ago, Obama and his aides were effusive in their praise for how Obama's predecessor, George W. Bush, helped his team take over the massive federal bureaucracy. Obama has vowed to pass on the favor to Trump. But the transition hasn't been without incident.\nThe two teams have clashed over the Trump team's requests for information Obama aides fear could be used to eliminate government employees who worked on Obama priorities like climate change and minority rights overseas. Trump's team, meanwhile, has been frustrated by Obama's attempts to box Trump in with parting moves to block ocean drilling, declare new monuments and further empty out the Guantanamo Bay prison.\nWhile on his annual vacation in Oahu, Obama asserted himself forcefully on two foreign policy issues that put him in direct conflict with Trump. Obama directed the U.S. to defy tradition by allowing a U.N. Security Council resolution criticizing Israel on settlements to pass, then slapped Russia with sweeping penalties over U.S. allegations of hacking.\nThe final days are Obama's last chance to define his presidency before his loses the bully pulpit and cedes his legacy to historians. For Obama, helping Americans understand how his two terms have reshaped American life is even more critical amid concerns that Trump may undo much of what he accomplished, including the health law.\nAs Trump and Republicans vow to gut the Affordable Care Act, Democrats are working to devise a strategy to protect the law by exploiting GOP divisions about how to replace it. To that end, Obama will travel Wednesday to the Capitol to meet with House and Senate Democrats, likely his last meeting with his party's lawmakers as president.\nHis administration is also working feverishly to finish up regulations in the pipeline that Obama hopes can be completed in the final days, perhaps increasing the likelihood his policies carry over. But the closer it gets to Trump's inauguration, the harder those tasks become.\nThough Obama remains president until Jan. 20, the White House can't process the departure of all its staffers on a single day. So this week Obama aides will start \"offloading,\" turning in their Blackberries and shutting down their computers for the last time, leaving a smaller staff on hand for the final days.\nObama must also prepare to become a private citizen for the first time in two decades. An office of the former president must be stood up, and Obama's family will be making arrangements to move into a rental home in Northwest Washington where they plan to stay until youngest daughter Sasha finishes high school.\nThe Obamas have long lamented how the presidency denied them freedom and privacy, with first lady Michelle Obama likening the White House to \"a really nice prison.\" But on their last Hawaii vacation, the first family took time out to visit Breakout Waikiki, where visitors are \"trapped\" in a room together and must try, as a team, to escape.\n———\nReach Josh Lederman on Twitter at http://twitter.com/joshledermanAP",
    "source_domain": "abcnews.go.com",
    "title": "Under 3 Weeks Left: Obama in Closing Stretch of Presidency",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/weeks-left-obama-closing-stretch-presidency-44508261"
}