{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 06:54:13+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Denise Huskins was kidnapped from her boyfriend's bed on March 23, 2015, and authorities at the time were suspicious of her disappearance.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fcouple-girl-case-open-night-attack-accused-hoax-53867355.json",
    "image_url": "https://s.abcnews.com/images/Nightline/180320_ntl_crime_1240_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Couple in 'Gone Girl' case open up about night of attack, being accused of hoax\nI don't know how to describe what it's like to sit back silently and watch the world have a conversation on the most horrific thing that you've lived through. Reporter: For Denise Huskins everything changed one fateful night. I remember thinking like that this is a really bad nightmare. Reporter: It's one that still haunts her today. Three years ago she was dragged from her boyfriend Aaron Quinn's bed in the dead of the night, drugged, kidnapped, and raped. She then mysteriously reappeared two days later about 400 miles away in southern California. Aaron had gone to the police pleading for them to investigate. Everything was accusatory and fairly quickly a detective said I don't believe you. Our investigation has concluded that none of the claims can be substantiated. Reporter: The Vallejo county police publicly declared it all a hoax. Mr. Quinn and Ms. Huskins has plundered valuable resources away from our community. My wife, Amy Elliott Dunn, disappeared three days ago. Reporter: Denise quickly dubbed the gone girl after the novel and film about a woman who stages her own disappearance. Isn't it true that truth is often stranger than fiction? This is only strange because the law enforcement made it strange. Reporter: It was March 2015. Denise Huskins and Aaron Quinn were both in bed, asleep. Around 3:00 A.M. They heard a noise. You were woken up with lights in your face, correct? Yeah. The voice kept saying wake up, this is a robbery week, not here to harm you. I opened my eyes and there's flark light. And he said Aaron turned over. And I was named. And that was another like oh, my god, what is this? He said I'm going to leave some ties at the edge of the bed. You're going to tie his hands behind his back and his feet together. And I was shaking. And he was encouraging me, saying you're doing a good job. Saying you were being good victims. Yeah. Reporter: They were both blindfolded. Aaron had a pair of headphones placed over his years with prerecorded messages that warned him not to resist or Denise would be hurt, and they were both made to take drugs. He told me to go to the closet and lay down. And that's when he restrained me. I don't know a better word than terrifying. Reporter: It became clear this attack was not random. One of the first things he said to me when he separated us was he gave my parents' address when I grew up, all my bank account records. This was stuff that -- as it kept on going you could tell this was planned. And then I was given multiple instructions by prerecorded messages. A certain amount of money. Twoin Staum . Two installments of $8500. Yes. Reporter: The two were separated. Denise forced into the trunk of the attacker's car. They would travel about three hours to the attacker's house in south lake tahoe. My only hope was to maybe show him the human that was in front of him. How did you do that? He shared with me that he just had a difficult time in his life. And I shared with him something that happened when I was younger, hoping maybe that knowing that I've already been assaulted that he won't want to add to it. But you know -- He raped you. Yeah. Reporter: For the next 48 hours Denise would be alone with her attacker, physically assaulted, mentally tormented. Meanwhile, Aaron was going through hell of his own. According to court documents, Aaron awoke, cut himself free, and saw that his car and laptop were gone. His phonesere still there. And he saw e-mail messages demanding the money. Despite warnings he calls the police. He also had stated if I called anybody they would hurt Denise. But you did it anyway. So I had to make a decision to call the police. I figured like I'm going to be safe, the police will come. Reporter: But Aaron soon went from victim to suspect. The moment you walked into the door and you told this story, nobody believed you. Yeah, they accused me of being drugged. I told them -- I said yes, I am. They drugged me. I gave them permission to go search through my house. I gave them access to all my e-mail accounts because the kidnappers were e-mailing and fairly quickly they turned to detectives saying I don't believe you. Just started saying I killed Denise. What is that moment like? I knew they were going to look at me as a suspect. That's what they should do. I was the last person to see her. If it wasn't for Denise, if she didn't get the kidnappers to let her go, I would be behind bars. How did you get away? He made the decision to release me, and he said that he was going to drive me all the way down to southern California. Your home town. Yeah. When he opened the car door, I thought, this is it. Like either I'm going to hear a gunshot and that's it or I might get pushed off a cliff. I thought I was walking to my death. And then I heard a door close behind me and I pulled up the blindfold and I just started walking. And the only thing that I was thinking of was I want to see my mom and dad. Reporter: It seemed a near-miraculous ending to a horrendous ordeal. But for Denise and Aaron a new sort of trauma was just beginning. I didn't act like a good enough victim. Reporter: Shortly after Denise reappeared the Vallejo police department held this press conference. That is a tremendous amount of resources that in my opinion was wasted. So if anything, it is Mr. Quinn and miss Huskins that owes this community an apology. They say this was a kidnapping hoax. Mm-hmm. When all this stuff was happening, we know that the public is in danger and we're trying to do everything to convince the police like you need to -- they're trained professional criminals. Like they're going to do this again. Reporter: The very next day a \"San Francisco chronicle\" reporter receives a series of e-mails from a purported group of criminals claiming responsibility with pictures of computer equipment, fake guns, and more. And with a voice recording from Denise. My name is Denise Huskins. I'm kidnapped. Otherwise I'm fine. Reporter: And the supposed attackers ended with this, calling the police response a travesty. About two months after the kidnapping things came to a head when law enforcement responded to reports of a home invasion and robbery near San Francisco. The circumstances eerily familiar. A man attacking a couple in bed using zip ties. Only this time one of the victims managed to call police. The suspect ran off but left a cell phone behind. That cell phone tracked back to a 38-year-old harvard-educated man named Matthew muller. By June 8th muller was in custody. One of the most notable piece of evidence recovered, Aaron Quinn's stolen laptop computer. Inside his vehicle they found more evidence, including zip ties and swim-style goggles with tape covering the lenses with a long blond hair stuck in the duct tape. Muller eventually confessed and pleaded guilty to the kidnapping of Huskins. By July she and Quinn vindicated. They are absolutely 100% not just not guilty but innocent. Reporter: Huskins got the chance to confront muller in court as he was sentenced to 40 years behind bars. And you said I am the woman behind the blindfold. Yeah. He saw me, every part of me, but he never looked into my eyes. And so I wanted to make sure that he saw me. And he did. Reporter: But that wasn't the only justice the couple is looking for. The Vallejo police department did eventually apologize. They wrote a letter of apology. They haven't made a public apology. They acknowledge that they were wrong, but they wouldn't have done anything different. It's kind of like sorry, I'm not sorry. Reporter: Now muller is facing new state charges including rape. Last week Huskins and Quinn settled a civil lawsuit with the Vallejo police for $2.5 million. The police declined to speak to ABC news until after that settlement is signed. But they do not admit to any wrongdoing. I mean, it was on multiple levels you were victimized. I felt like a complete betrayal of humanity. You just don't think that people would be so cruel, and for what. Reporter: Huskins and Quinn say this traumatic experience strengthened their bond and they are committed to moving forward together. The pair recently got engaged and plan to marry in the fall. We're excited to put thought into something that's going to be a good day. Something joyful. Yeah. A little more fun. Reporter: For \"Nightline\" I'm Amy robach in San Francisco. Incredible story. And Amy will have much more on this whole thing on \"20/20\" this Friday night at 10:00, 9:00 central.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Couple in 'Gone Girl' case open up about night of attack, being accused of hoax",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/couple-girl-case-open-night-attack-accused-hoax-53867355"
}