{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2018-02-03 20:06:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Halle Berry is 'livid' former manager allegedly used her name to prey on women",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fhalle-berry-shes-livid-manager-allegedly-prey-women%2Fstory%3Fid%3D52816012.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/halle-berry-2-gty-jt-180203_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Oscar winner Halle Berry is speaking out hours after her former manager was accused by nine women of sexual misconduct and sexual harassment, saying she's \"saddened\" and \"livid.\"\nVincent Cirrincione faces accusations published by the Washington Post on Friday that he pressured women for sexual favors or engaged in sexual misconduct against them in exchange for his helping the actresses, all women of color, succeed in Hollywood.\nOne actress claimed in the Post story that the manager said he would take her on as a client only if he was able to have sex with her monthly; another claimed he masturbated in front of her in his office.\nAccording to the allegations in the Post story, Cirrincione, 70, who is white, would often use the name of Berry, who is African American, and later that of another African-American client, Oscar nominee Taraji P. Henson, as a way of luring the women. Eight of the women making accusations are African-American, and one Asian, according to the Post.\nMichael Caulfield Archive/Getty Images, FILE\nThe accusations concern events alleged to have occurred as early as 1993 and as recently as 2011, the Post reported.\nBerry took to Twitter on Friday evening, writing: \"Yesterday I was saddened by the [allegations] against my former manager, Vincent Cirrincione, but today I'm sick after reading the horrifying detailed accounts of his abuse toward 9 women.\"\n\"I'm livid that he used me, and the role model he helped me become, to lure and manipulate innocent, vulnerable women of color for his predatory actions,\" she continued.\nBerry, 51, concluded her statement by writing, \"I'm deeply hurt and I want these women and countless others to know I see you. I hear you. You matter. I will fight for you.\"\nShe also said in a statement to the Post that she ended her professional relationship with Cirrincione more than three years ago after hearing about a misconduct allegation against him.\nBerry added in the statement, “While Vince never made an inappropriate gesture toward me, nor did I hear about this type of behavior from any woman or man while we worked together, I have always had a no-tolerance policy when it came to such matters.”\nMeanwhile, Henson spoke positively to the Post of her relationship with Cirrincione, her one-time producing partner, saying, \"I’ve never had any issue with this on any level.\"\nThe \"Proud Mary\" star added, \"He totally respected me.”\nChristopher Peterson/Getty Images, FILE\nHenson claimed that at times during her working relationship with Cirrincione, he would help her pay rent and costs associated with raising her son as a single mother.\n“He saw a single mother trying to make her dreams come true, and he nurtured that,” Henson, whose publicist, Pam Sharpe, is Cirrincione's longtime girlfriend, according to the Post, told the newspaper. “He wrote checks and wouldn’t ask for anything in return. It wasn’t coming from a creepy place. If anything, it empowered me. Like this man believes in me. I love him for that.”\nABC News reached out to Cirrincione, Berry and Henson but didn't immediately hear back.\nJean-Baptiste LaCroix/AFP/Getty Images\nCirrincione in a statement to the Post denied asking for sexual favors in exchange for helping actresses' careers.\n“We live in a time where men are being confronted with a very real opportunity to take responsibility for their actions. I support this movement wholeheartedly. I have had female clients and employees my entire career in this industry. I have built a reputation for advancing the careers of women of color,” Cirrincione began.\n“I have had affairs while in committed relationships, ones I am now ashamed to say are coming to light and shading my past and my reputation. I can say without a doubt that I have never used favors, sexual or otherwise, as a reason for managing anyone. I want to make it clear that not one of those relationships were anything but consensual.\nCirrincione concluded, “I take responsibility for my part in the situation and I am not here to diminish anyone’s feelings or experiences. I apologize to these women, my past and present partner, my clients and employees for the pain this is bringing them. I was under the impression I was living my life as a supportive man to women. It is with a heavy heart that I see now I was wrong.\"",
    "source_domain": "abcnews.go.com",
    "title": "Halle Berry says she's 'livid' former manager allegedly used her name to prey on women",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/halle-berry-shes-livid-manager-allegedly-prey-women/story?id=52816012"
}