{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 06:28:10+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fchinas-premier-appeals-us-act-rationally-trade-53867203.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_5764b512239844d3872c8cbcc8389d3d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chinese Premier Li Keqiang appealed to Washington on Tuesday to \"act rationally\" and avoid disrupting trade over steel, technology and other disputes, promising that Beijing will \"open even wider\" to imports and investment.\n\"No one will emerge a winner from a trade war,\" said Li, the No. 2 Chinese leader, at a news conference held during the meeting of China's ceremonial legislature.\nLi made no mention of a possible Chinese response in the event U.S. President Donald Trump raises import barriers over trade complaints against Beijing, but other officials say President Xi Jinping's government is ready to act.\nTrump's government already has raised import duties on Chinese-made washing machines and other goods to offset what it says are improper subsidies and is investigating whether Beijing pressures foreign companies to hand over technology, which might lead to trade penalties. That has prompted fears of Chinese retaliation.\n\"What we hope is for us to act rationally rather than being led by emotions,\" said Li. \"We don't want to see a trade war.\"\nCommerce Minister Zhong Shan said on March 11 that China will \"resolutely defend\" its interests. He gave no details but business groups say Beijing might target U.S. exports of jetliners, soybeans and other goods for which China is a major market.\nAsked whether Beijing might use its large holdings of U.S. government debt as leverage, the premier said its investments are based on market principles and \"China will remain a responsible long-term investor.\"\nLi promised more market-opening and other reforms as Xi's government tries to make its cooling, state-dominated economy more productive. He said Beijing will make it easier to start a business and will open more industries to foreign and private competition.\nThe ruling Communist Party promised in 2013 to give a bigger role to market forces and entrepreneurs who generate most of China's new jobs and wealth.\nReform advocates complain they are moving too slowly, but hope Xi, who took power in 2012, might accelerate changes after focusing during his first five-year term as party leader on cementing his status as China's most dominant figure since at least the 1980s.\n\"If there is one thing that will be different from the past, that will be that China will open even wider,\" said Li.\nBeijing plans to \"further bring down overall tariffs,\" with \"zero tariffs for drugs, especially much-needed anti-cancer drugs,\" the premier said.\nLi repeated a promise he made March 5 at the opening of the legislature to \"fully open the manufacturing sector\" to foreign competitors.\n\"We will also fully open the manufacturing sector,\" the premier said. \"There will be no mandatory requirement for technology transfers and intellectual property rights will be better protected.\"\nThe government has yet to say how that might change conditions for automakers and other manufacturers that are required to work through Chinese partners, which requires them to give technology to potential competitors.\nIn a sign of Li's reduced status as President Xi Jinping amasses power, the premier was flanked by eight newly promoted economic officials, in contrast to previous years when he appeared alone at the annual news conference.\nThey included Liu He, a Harvard-trained Xi adviser who was named a vice premier Monday and has told foreign businesspeople he will oversee economic reform. Neither Liu nor any of the other officials spoke at the event.\nThe premier traditionally is China's top economic official but Xi has stripped Li of his most prominent duties by appointing himself to lead ruling party bodies that oversee economic reform and finance policy.",
    "source_domain": "abcnews.go.com",
    "title": "China's premier appeals to US to 'act rationally' over trade",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/chinas-premier-appeals-us-act-rationally-trade-53867203"
}