{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 02:52:59+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "No charges were filed against Randall Margraves, who said, \"I lost control. ... I'm embarrassed.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ffather-victims-apologizes-lunging-usa-gymnastics-team-doctor-52808987.json",
    "image_url": "http://a.abcnews.com/images/WNT/180202_wn_davis3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Father of three victims apologizes after lunging at former USA Gymnastics team doctor in court\nThe dramatic and raw moment in court today. The father lunging towards former gymnastics team doctor, Larry Nassar. His daughters were abused by Nassar, and he said he was unable to contain himself. Here's ABC's Lindsey Davis with the moment. Could I have a chance to say something? You son of a . Reporter: Mayhem? A Michigan courtroom this morning after this plea from a father of three girls who say they were molested by Larry Nassar. I ask you to, as part of the sentencing, to grant me 5 minutes in a locked room with the demon. Would you do that. That is not -- Yes or no? No, sir, I can't do that. Would you give me one minute? You know I can't do that. That's not how our legal system -- Well, I'm going to have to -- Reporter: Deputies tackle Randall margraves to the ground. Need to verbate \"I want that sob .\" Reporter: Nassar seen ducking under a table as his attorney tries to protect him. As he is led from the courtroom margraves tries to explain. You cannot behave like this. I want to make this crystal clear. Well you haven't lived through this, lady. Reporter: The chaos erupted after two of his daughters gave victim impact statements in yet another sentencing hearing. One thanking her parents for standing by them. You have done everything that a parent could ever do. I love you. Reporter: As for the father who lost it D-- I lost control, and I apologize a hundred times. Reporter: No charges. Margraves apologized to the court saying he was angered seeing Nassar shake his head while his daughters spoke. I'm embarrassed. I'm not here to upstage my daughters. I'm here to help them heal. Love people can understand the anger of these parents, and lipidsy joins us tonight, and there are more questions now. In the meantime, for the U.S. Olympic committee after \"The Wall Street journal\" reported that they were aware of abuse, but did not alert athletes or law enforcement? Reporter: David, the usoc tells us they have consistently said that they learned in 2015 that a doctor had potentially abused an athlete and that it was reported to the FBI. They say they are now launching an independent investigation to determine the who, what and when of it all, David. Lindsey Davis on this again\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Father of three victims apologizes after lunging at former USA Gymnastics team doctor in court",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/father-victims-apologizes-lunging-usa-gymnastics-team-doctor-52808987"
}