{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 15:16:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Ronaldo banned for 5 games after pushing referee",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fronaldo-banned-games-pushing-referee-49205878.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_f9cc8797c3604252b258b467a52586eb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Cristiano Ronaldo was banned for five games on Monday after shoving a referee following his red card for diving in Real Madrid's 3-1 win over Barcelona in the season-opening Spanish Super Cup.\nRonaldo was suspended for one game for the red card in Sunday's Super Cup first leg at Barcelona, and four games for pushing referee Ricardo de Burgos Bengoetxea in the back, the Spanish football federation said.\nRonaldo will miss Wednesday's return leg of the Super Cup in Madrid plus the first four matches of the Spanish league season.\nMadrid opens the league on Sunday at Deportivo La Coruna. Its next three matches after that are against Valencia, promoted Levante, and at Real Sociedad.\nRonaldo and Madrid have 10 days to appeal the federation's ruling.\nStill regaining peak fitness after an extended summer vacation, Ronaldo began the Super Cup match on the bench, and came on in the 58th minute.\nHe scored with a long-range strike to put Madrid 2-1 up moments after Lionel Messi had equalized for Barcelona from the penalty spot.\nBut Ronaldo's goal celebration — when he took his shirt off and flexed his muscles — earned him a yellow card.\nTwo minutes later, he charged into the area and collided with Barcelona defender Samuel Umtiti. Ronaldo went down hoping for a penalty. Instead, referee De Burgos Bengoetxea showed Ronaldo a second yellow for diving and sent him off.\nRonaldo raised his arms in disbelief before he stepped up to De Burgos and shoved him in the back with his right hand.\nThe federation ruling said that Ronaldo's shove violated article 96 of its disciplinary code, which states that \"light aggressions\" defined as \"pulling, pushing and shaking\" of a referee are punished by suspensions of 4-12 matches.\nThe federation also fined Ronaldo 3,005 euros ($3,500) and Madrid 1,400 euros ($1,650) for the shove, and another 600 euros ($705) for the player and 350 euros ($412) for the club for simulating a foul.",
    "source_domain": "abcnews.go.com",
    "title": "Ronaldo banned for 5 games after pushing referee",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/ronaldo-banned-games-pushing-referee-49205878"
}