{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 17:04:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Lots of questions still hang over Trump's tax plan",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Flots-questions-hang-trumps-tax-plan-49208618.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_c48da4d80c194139b523cf6e9426fe5d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump wants to close a frustrating 2017 with the first overhaul of the tax code in more than three decades.\nYet after seven months of work, Trump's plan remains little more than a rough sketch. Despite the haziness of the blueprint, administration officials have held to their pledges that lowering tax rates would spur the creation of millions of jobs and faster economic growth.\nThe White House maintains that the House and Senate will begin considering a detailed tax overhaul after the August recess with final passage scheduled for November. But after the Republican drive to repeal the 2010 health care law collapsed this summer, Senate Majority Leader Mitch McConnell declared that the president had \"excessive expectations about how quickly things happen in the democratic process.\"\nThe president told reporters last week, \"I'm very disappointed in Mitch.\"\nHere are the open questions about taxes that will be decided in the coming months:\n———\nTAX CUTS OR TAX REFORM?\nThey're not the same thing, though Trump seems to use the terms interchangeably.\nTax cuts mean that people simply pay less money to the government. Reform is more complex and more difficult to achieve. It generally involves simplifying the tax code by erasing breaks. With tax reform, the government can, in theory, collect taxes from a broader base of incomes and that enables lower rates.\nTax reform is difficult because the deductions and tax breaks generally have vocal and well-financed supporters who will fight to preserve those benefits.\n\"From a political standpoint, the perceived losers are more vocal and louder than the perceived winners,\" said Mark Mazur, director of the nonpartisan Tax Policy Center and a former Treasury Department official in the Obama administration.\nThis is why the administration might ultimately decide to cut taxes in hopes of boosting the economy, rather than wading through an overhaul.\n———\nWHAT'S IN STORE FOR THE MIDDLE CLASS?\nTrump has said he wants tax relief for the middle class.\nHe has supported doubling the \"standard deduction.\" This essentially means that a greater amount of income would be treated as tax-free and that would help the middle class.\nBut many elements of the outline the White House submitted in April, like eliminating the estate tax, favor the wealthiest 1 percent of earners. This group would see their after-tax incomes shoot up on average 17.8 percent under the plan, while the middle fifth of taxpayers would get a boost of only 3.3 percent, according to an analysis by the Tax Policy Center.\nSome people who perceive of themselves as middle class could be surprised by tax hikes. This is because the White House wants to shrink the number of personal tax brackets to three from seven, but it hasn't set the income levels for the new brackets.\nMarc Short, the White House director of legislative affairs, said the income levels will be set by the House Ways and Means Committee, which will draft and hold hearings on the bill.\n———\nSO WILL THE DEFICIT RISE?\nTrump and congressional leaders have kept quiet about just how much a tax overhaul could increase the budget deficit. Outside analysts have estimated that the known changes could cause the debt to climb by several trillions of dollars over the next decade. A joint White House and congressional statement released in July says their priority is keeping the deficit at its current projections.\nCongress could use accounting gimmicks in the budget process to create space for large tax cuts before the new fiscal year starts in October. However, the gimmicks aren't a long-term solution to a revenue shortfall.\nLawmakers could change how the deficit gets calculated in future years by treating tax breaks that are set to expire this year as permanent. This could add $450 billion to the baseline over 10 years, said Marc Goldwein, senior policy director at the Committee for a Responsible Federal Budget.\nThe budget instructions could also allow lawmakers to make both permanent and temporary changes to the tax code.\n\"This is one way that they get some of their priorities\" without having to eliminate popular tax breaks, said Kyle Pomerleau, director of federal projects at the right-leaning Tax Foundation.\n———\nWILL THE PLAN MOSTLY BENEFIT THE RICH?\nOne way White House aides say that growth will be improved is by reducing taxes for smaller firms in which a company's profits double as the owner's personal income. These are commonly known as \"pass-through\" businesses — and they're linked with rising income inequality.\nTrump's April guidelines would have this income taxed at a rate as low as 15 percent, the same as its intended rate for all corporate income. The top corporate tax rate is now 35 percent, relatively high compared with similar nations. The administration has also said it would create rules to keep the wealthy from exploiting the lower pass-through rate as a way to reduce their tax rates.\nPass-throughs play a key role in widening income inequality. Research by economists Thomas Piketty and Emmanuel Saez found that the top 1 percent of earners accounted for more than 20 percent of total U.S. income in 2013, up from 10 percent in 1980. Of that increase in share of income, 41 percent was due to wealthier people earning money via pass-through firms.\nBut so far, Trump aides say they have yet to finalize a plan that would support small businesses instead of the rich.",
    "source_domain": "abcnews.go.com",
    "title": "Lots of questions still hang over Trump's tax plan",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/lots-questions-hang-trumps-tax-plan-49208618"
}