{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:19:46+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Orville Roger, 100, of Dallas, Texas, won gold with his family cheering him on",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fcentenarians-break-world-records-track-meet-53860782.json",
    "image_url": "https://s.abcnews.com/images/WNT/180319_wn_muir4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Centenarians break world records at track meet\nFinally tonight, America strong. Catch them if you can. Lane number three, wearing his blue Jersey. 100-year-old Orville Rogers from Dallas. A World War II veteran, a bomber pilot, then a commercial pilot. Hanging up his wings and lacing up his shoes. This time, the 60-meter dash. His family, who we've met before here, cheering him on again. Breaking a new record. The oldest male runner to compete, this time, in the 60-meter dash. Hello, David. It's Orville in Dallas, checking in to say hi. Reporter: And to tell us he's still going strong. How great it feels at the age of 100 to break five new world track records and to bring home the gold. Reporter: Bringing it home. And he's not alone. On the right there, 102-year-old Julia \"Hurricane\" Hawkins, as they call her. Graduating from lsu in 1938, now the oldest woman to compete in the usa track and field championships. She, too, setting the world record. The 60-meter dash in 24.79 seconds. She has a message, too. Adrenaline that you get when you do sports is hard to express, but it's a wonderful thing. Reporter: Julia \"Hurricane\" Hawkins and Orville Rogers. America strong. We love them. Making us feel like slouches. I'm David Muir. I hope to see you right back here tomorrow. Les has removed toward the cave\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Centenarians break world records at track meet",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/centenarians-break-world-records-track-meet-53860782"
}