{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 12:00:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Phoenix faces Arizona law that bars sanctuary-city status",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fphoenix-faces-arizona-law-bars-sanctuary-city-status-45503245.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/phoenix-faces-arizona-law-bars-sanctuary-city-status-45503245",
    "language": "en",
    "localpath": null,
    "maintext": "As some cities reaffirm support for sanctuary policies that protect immigrants, Phoenix finds itself in an unusual position to push back against any immigration actions by the new White House.\nThe Phoenix City Council on Wednesday will discuss a petition to adopt the sanctuary label, following the lead of Chicago, Los Angeles, New York and others in a city with one of the nation's largest populations of immigrants in the country illegally. But the effort is complicated by the fact that Arizona's landmark 2010 immigration law, known as SB1070, bars any Arizona city from becoming a sanctuary.\nThe Phoenix metro area is home to about 250,000 immigrants in the country illegally, according to a report last week from the Pew Research Center. The report is based on data from 2014. New York, Los Angeles and Houston have the highest number of immigrants who lack legal status.\nCities are doubling down on sanctuary policies in light of an order by President Donald Trump requiring immigration authorities to arrest and deport more people. The city policies vary but essentially bar local police from cooperating with federal immigration authorities.\nPhoenix has a Democratic, immigrant-friendly mayor who has denounced Trump, but his hands are tied because of SB1070.\nThe law requires local police to question the immigration status of people suspected of being in the country illegally while enforcing other laws or in the course of an investigation. Most of the law was gutted by the courts, but city leaders say the surviving sections prevent local government agencies from restricting the enforcement of federal immigration law.\nStill, pressure has mounted on Mayor Greg Stanton from immigrant advocacy groups who want the city to adopt sanctuary policies and from police and Republican leaders who oppose the measure.\nCity attorney Brad Holm says in a letter to the city manager that the petition for sanctuary status is \"legally impermissible.\"\n\"It demands that the council break state law. If the petition were adopted, a court could fine the city for breaking the law, and the attorney general could seek forfeiture of state-shared revenue,\" Holm wrote.\nStanton last week blasted the Trump administration over the deportation of 35-year-old Guadalupe Garcia de Rayos, a Phoenix-area woman who until now had been granted leniency by Obama policies that aimed to protect immigrants without violent pasts and who have ties to the community. Garcia de Rayos was arrested in Phoenix during a routine check-in with U.S. Immigration Customs Enforcement and was deported the next day to Nogales, Mexico.\n\"Rather than tracking down violent criminals and drug dealers, ICE is spending its energy deporting a woman with two American children who has lived here for more than two decades and poses a threat to nobody,\" Stanton wrote on Twitter.\nStanton denounced Garcia de Rayos' deportation, but immigration activists called on him to use his power and not just his voice.\n\"If there was ever a time when we need your courage and we need you to stand up and we need you to put actions behind saying that Phoenix PD is not gonna become a mass deportation machine, it's now,\" said Francisca Porchas, of Puente Arizona, an immigrant rights group. \"This is when we need Mayor Stanton, the city council, the state, everybody who is of conscience to stand up and defy this racist law.\"",
    "source_domain": "abcnews.go.com",
    "title": "Phoenix faces Arizona law that bars sanctuary-city status",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/phoenix-faces-arizona-law-bars-sanctuary-city-status-45503245"
}