{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 21:57:37+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Will Trump plan help New Orleans' crumbling infrastructure?",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftrump-plan-orleans-crumbling-infrastructure-52815869.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_caba2a3e25244e97a80ec10bfaf6c087_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When a heavy rain hits New Orleans, residents move their cars to higher ground for fear of fast-rising street flooding. Knee-deep potholes can eat a car's fender. When pressure drops in the city's aging water delivery system, restaurants and cafes have to boil water to feed customers.\nBattered by nature and neglect, New Orleans is one of the best examples of what President Donald Trump calls the country's \"crumbling infrastructure.\" But when looking at the billion-dollar needs of this 300-year-old city, two things become apparent: The rebuilding task is immense and it's not clear the president's new plan will help.\nThe city needs about $11.6 billion to bring key parts of its infrastructure into \"this century,\" said city official Katie Dignan. That means repairing the roads, the infrastructure under them — sewer, water and drainage — as well as other parts of the drainage system that empties the city of water when it rains.\nDignan said the city has about $2 billion available, some from FEMA to mitigate Hurricane Katrina damage and some from other sources. Now, the city faces choices on how to come up with the remainder. Mayor Mitch Landrieu, who calls the aging sewer, water and drainage system a \"prime example\" of needed infrastructure work, has doubts about Trump's proposal.\nTrump called on Congress to produce a bill that generates \"at least $1.5 trillion\" for infrastructure investment. But he hasn't detailed how much money the federal government would actually supply and has suggested that much of the money would come from state and local governments or private-sector investments.\n\"What the president is really proposing is not HIS infrastructure plan but basically saying to the states and the cities: 'Build it on your own and find another way to pay for it through raising taxes or cutting services,'\" Landrieu, a Democrat and the current president of the U.S. Conference of Mayors, said Thursday.\nFinding more money is a challenge in a financially strapped Louisiana — and in a city that was facing a major budget deficit when Landrieu took office eight years ago.\nLandrieu said public-private partnerships can work on some types of projects where there's money to pay back the partner, but poorer cities — often those with the biggest infrastructure problems — are going to have a harder time. Forcing cities like New Orleans to pay for the infrastructure means taking money away from other local priorities, such as housing homeless veterans, he said.\nThe precariousness of the city's infrastructure was on full display last August when a massive downpour overwhelmed the pumping system and inundated many neighborhoods.\nThe Broad Theater was still recovering from a previous rainstorm when the August storm hit. Movie-goers evacuated waist-high waters by boat. Manager Michael Domangue lost his car to the flood. The theater closed for seven days and had to refund tickets.\n\"I still feel when we rain, people get worried about coming here,\" Domangue said.\nAnd this damage all happened within sight of a pumping station that's part of the drainage system. Of the $11.6 billion, an estimated $2 billion is needed for long-term repairs and upgrades to the city's pumping system, Dignan said, although she cautioned that figure could change. The other $9.6 billion would go toward fixing the roads and the infrastructure under them. That includes a drinking water system plagued by wasteful leaks and occasional power failures and pressure drops that can let contaminants in — requiring residents to boil water.\nRenee Blanchard owns the Church Alley Coffee Bar. She bought a $3,500 reverse osmosis water filtration system so that she can still make lattes and cappuccinos when the water pressure drops. Blanchard is frustrated that a small business in a big city has to deal with such expensive problems.\n\"That's ridiculous,\" she said. \"I'm so small. I work most of the hours. I started off with a tiny bit of savings.\"\nAll cities have potholes but the New Orleans streets are in another category. Locals put traffic cones or tires into especially deep potholes to warn other drivers.\n\"If it rains the day before and it's filled with water, you don't know the pothole's there. You could tear up your car, your front end,\" Kenny Buras said of his street.\nResidents try to take it in stride. During the summer flooding, people canoed through the streets, sometimes with a drink in hand. In May 2016, there was a \"Sinkhole de Mayo\" party after a massive sinkhole opened up at the foot of Canal Street.\nBut there's also a real frustration about how problems in New Orleans and elsewhere will be fixed.\nResident James Jensen noted mudslides and fires in California and rising seas in Miami: \"There's many New Orleans out there.\"\n———\nAssociated Press writer Stacey Plaisance contributed to this report.\n———\nFollow Santana on Twitter @ruskygal.",
    "source_domain": "abcnews.go.com",
    "title": "Will Trump plan help New Orleans' crumbling infrastructure?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/trump-plan-orleans-crumbling-infrastructure-52815869"
}