{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 10:02:00+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Federal Reserve imposes new penalties on Wells Fargo",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ffederal-reserve-imposes-penalties-wells-fargo-52808394.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_ec54ba6389f74a75b83db4b939462837_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Federal Reserve is imposing more penalties on Wells Fargo, freezing the bank's growth until it can prove it has improved its internal controls. In addition, bank agreed to replace four board members.\nIt's the latest blow against the San Francisco bank that has had its reputation tarnished by revelations it opened phony customer accounts and sold auto insurance to customers who did not need it.\nThe new penalties were announced late Friday on Fed Chair Janet Yellen's last day at the central bank.\n\"We cannot tolerate pervasive and persistent misconduct at any bank,\" Yellen said in a statement. \"The enforcement action we are taking today will ensure that Wells Fargo will not expand until it is able to do so safely and with the protections needed to manage all of its risks and protect its customers.\"\nThe Fed said it is restricting the bank's assets to the level where they stood at the end of last year until it can demonstrate that it has improved its internal controls.\nThe announcement came after the close of trading on Wall Street Friday. Wells Fargo's stock fell more than 6 percent in after-hours trading.\n\"We take this order seriously and are focused on addressing all of the Federal Reserve's concerns,\" CEO Timothy Sloan said.\nWells Fargo said that it is confident it will satisfy the Fed's requirements and reiterated that it remains \"open for business.\"\nThe bank said it will continue to meet customer's financial needs, including saving, borrowing and investing.\nIt said it has the flexibility on its balance sheet to pull back from certain activities to meet the Fed's growth limits, although its exact steps have not been determined.\nSloan also emphasized that the order is related to prior issues, not any new matters.\n\"While there is still more work to do, we have made significant improvements over the past year to our governance and risk management that address concerns highlighted in this consent order,\" he said.\nThe company has agreed to replace three directors by April and another one by year-end. It did not specify which board members would be affected.\nThe Fed's new order marked the latest chapter in a series of scandals which have rocked the bank in recent years.\nWells Fargo has admitted that employees opened more than 3 million fake accounts in order to meet sales quotas. It ended up paying $185 million to regulators and settled a class-action suit for $142 million.\nIt also has admitted it signed up hundreds of thousands of auto loan customers for auto insurance they did not need. Some of those customers had their cars repossessed because they could not afford both the auto loan and insurance payments.\nAnd Wells Fargo also offered refunds to customers last year after acknowledging that its mortgage bankers unfairly charged them fees to lock in interest rates on mortgages.\nThe Fed's action came on a 3-0 vote. Randal Quarles, who is the Fed's vice chairman for supervision, has recused himself from participating in matters involving Wells Fargo.\n———\nSkidmore Sell reported from Portland, Oregon.",
    "source_domain": "abcnews.go.com",
    "title": "Federal Reserve imposes new penalties on Wells Fargo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/federal-reserve-imposes-penalties-wells-fargo-52808394"
}