{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:15:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "AP Explains: The obscure law in spotlight after Flynn's call",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fap-explains-obscure-law-spotlight-flynns-call-45503420.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/ap-explains-obscure-law-spotlight-flynns-call-45503420",
    "language": "en",
    "localpath": null,
    "maintext": "Michael Flynn's conversations with a Russian diplomat roiled the White House and put a spotlight on a little-enforced law prohibiting U.S. citizens from trying to influence a foreign government in disputes with the United States.\nFlynn resigned as national security adviser after conceding that he may have discussed U.S. sanctions in phone calls with Russia's ambassador to the United States while Barack Obama was still in office. Those conversations may have violated the Logan Act, which aims to bar private citizens from conducting diplomacy, though White House spokesman Sean Spicer said Tuesday that no legal issues arose.\nStill, the centuries-old act has been so rarely invoked that legal experts say it may no longer be valid. And no one has been found guilty of violating the act in its more than 200-year history.\nA look at the Logan Act and whether such conversations could lead to charges.\nWHAT IS THE LOGAN ACT?\nLawmakers enacted the Logan Act in 1799 after George Logan, a friend of Thomas Jefferson, made a private visit to France in an attempt to ease tensions with the United States after the French Revolution. That trip was sharply criticized back home as an inappropriate interference in affairs between the two countries, prompting the passage of the law.\nHAS IT EVER BEEN USED BEFORE?\nSince then, there appear to have been very few indictments, and no prosecutions, under the obscure act. Legal experts say that would make potential violations even harder to prove in court.\nThe one known indictment came in 1803 after a Kentucky farmer wrote a newspaper article advocating for a separate country within the United States that would ally with France. But no prosecution followed.\n\"It really is an anachronism,\" written during a very different time in diplomatic and constitutional history, said Stephen Vladeck, a professor at the University of Texas School of Law. \"The statue was written at a time when Congress thought it had the power to criminalize this kind of ill-conceived, but not illegal, speech.\"\nOver the years, politicians and public figures have been accused of violating the Logan Act, often by political rivals. The Rev. Jesse Jackson's diplomatic activities in several countries in the 1980s, including trips to Cuba to negotiate the release of prisoners, raised questions about whether he violated the act. So did former NBA star Dennis Rodman's travels to North Korea to meet with dictator Kim Jong Un in 2014. Another allegation involved a letter sent by 47 Republican senators to Iran's leaders in 2015, warning them against making a nuclear deal with Obama.\nNone of those cases yielded criminal charges. A court could find the Logan Act no longer valid under a legal doctrine that says statutes become unenforceable if they are never used.\nIF FLYNN DISCUSSED SANCTIONS, DIDN'T HE BREAK THE LAW?\nDiscussing economic sanctions against Russia with the Russian envoy during the American presidential transition could have been a violation of the act. But that doesn't mean it will result in charges against Flynn. Prosecutors, for questions of resources or interpretations of the law, sometimes opt not to pursue criminal cases even when presented with a clear violation. And when it comes to the Logan Act, they would have to overcome a difficult defense that Flynn's phone calls were protected free speech. They would also have to prove Flynn was actually acting without the authority of the United States, Vladeck said.\nAnd then find a prosecutor willing to take the case.\nA U.S. official told The Associated Press on Tuesday that the FBI interviewed Flynn about his actions with the ambassador. But the content of the conversations is unclear.\nThe official was briefed on the investigation but was not authorized to discuss it by name and spoke on condition of anonymity.\nIf Flynn lied to investigators, he would have opened himself up to a possible felony prosecution for making false statements.\nBut Vladeck called threats to prosecute under the Logan Act \"an increasingly empty gesture.\"\n\"It's a fun game for commentators to play,\" he said. \"It's a way of turning what looks like a really bad move into a potentially illegal one.\"\n———\nAssociated Press writer Eric Tucker contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "AP Explains: The obscure law in spotlight after Flynn's call",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/ap-explains-obscure-law-spotlight-flynns-call-45503420"
}