{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 08:52:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Commonwealth Bank of Australia's CEO to retire within a year",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fcommonwealth-bank-australias-ceo-retire-year-49200961.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/commonwealth-bank-australias-ceo-retire-year-49200961",
    "language": "en",
    "localpath": null,
    "maintext": "The Commonwealth Bank of Australia announced on Monday that its beleaguered chief executive will retire by June 2018 after the country's largest bank was accused of breaching money laundering and terrorism financing laws.\nBank Chairman Catherine Livingstone said chief executive Ian Narev will retire by June 30, the end of the current fiscal year. The exact timing will dependent on finding his replacement.\nThe board decided to detail the succession process \"to ensure the market is fully informed and to provide certainty for the business,\" Livingstone said in a statement.\nThe Australian Transaction Reports and Analysis Center, the government's anti-money laundering and counter-terrorism financing intelligence agency better known as AUSTRAC, this month launched a civil prosecution in the Federal Court alleging that the bank failed to report more than 53,000 suspicious transactions totally more than 77 million Australian dollars ($61 million) from 2012 to 2015.\nThe bank has blamed a software error in its automated teller machines. Narev last week conceded the bank had \"made mistakes\" in relation to the AUSTRAC allegations. The bank has not yet filed its defense in the case.\nThe Australian Securities and Investments Commission, the corporate watchdog, has since announced it is investigating whether the bank's board should have notified investors sooner of the AUTRAC allegations.\nNarev has been the bank's chief executive since 2011.",
    "source_domain": "abcnews.go.com",
    "title": "Commonwealth Bank of Australia's CEO to retire within a year",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/commonwealth-bank-australias-ceo-retire-year-49200961"
}