{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:22:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The FBI is looking into the background of James Alex Fields Jr., who police say drove a car into demonstrators, killing Heather Heyer, 32, and injuring more than one dozen others.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fohio-man-charged-murder-charlottesville-attack-49201681.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_thomas3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Ohio man charged with murder in Charlottesville attack\nRobin, this morning we're learning new details about the suspected driver behind that deadly attack in Virginia, 20-year-old James Alex fields is due in court for second degree murder charges. Here's Pierre Thomas. Reporter: This is the man who police say was behind the wheel of this car and the deadly attack in charlottesville. Jamie Guglielmi James fields Jr. Charged with second degree murder of Heather Heyer. The FBI now dissecting fields' background launching a civil rights investigation to determine if the attack was a hate crime or domestic terrorism. The premeditated violence our community experienced today was completely unacceptable. Reporter: A key question this morning, federal authorities want to know does fields have any ties to white supremacist groups and was he directed to attack. This shows him at the rally before the tragedy standing with members of vanguard, a group described as a white supremacist organization. On Sunday the group claimed fields is not a member. This as we learn more about fields, a 0-year-old who lived with his mother in Ohio until recently. According T the Pentagon, fields attempted to join the military in August of 2015 but lasted only four months after failing to meet training standards. Some associates are now painting a disturbing picture. I hate to say it, I wasn't that surprised. Reporter: One of his high schoolteachers say he idolized dictator and mass murderer Adolf hitler. He felt that whites were superior. You know, we covered the rise of hitler, he would often say how, you know, hitler's views were right. You know, what if hitler had won. Reporter: Former classmates telling a similar story saying during an overseas trip to Germany, he allegedly told students while walking through a concentration camp this is where the magic happened. He was vocal about his ideas. He proclaimed himself as a Nazi and as a white supremacist. It wasn't a secret. Reporter: But his mother who learned of the incident on camera. Did it hurt anybody? Reporter: Says she saw no evidence of racist beliefs and only had limited knowledge of his chip to charlottesville. I didn't know it was white supremacists. I thought it had something to do with trump. I just knew he was going to a rally. I tried to stay out of his political views. Reporter: Those were intense. Fields drove eight hours from Ohio to charlottesville and they believe they were tinged with hate and eventually murder. Thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Ohio man charged with murder in Charlottesville attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/ohio-man-charged-murder-charlottesville-attack-49201681"
}