{
    "authors": [
        "Abc News",
        "National Defense Authorization Act"
    ],
    "date_download": "2018-05-30 22:58:19+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Based in Honolulu, Hawaii it is the military headquarters for all U.S. military operations from India to California.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fus-pacific-command-renamed-us-indo-pacific-command%2Fstory%3Fid%3D55539935.json",
    "image_url": "https://s.abcnews.com/images/US/us-pacific-command-hawaii-ap-thg-180529_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Pentagon has renamed U.S. Pacific Command to U.S. Indo-Pacific Command in recognition of the growing security role that India is playing in the region. The name change was announced by Defense Secretary James Mattis in Hawaii where he was attending the ceremony where Admiral Philip Davidson assumed command of the newly renamed command.\n\"Today, we rename the U.S. Pacific Command to U.S. Indo-Pacific Command,\" said Mattis in prepared remarks. \"Over many decades this command has repeatedly adapted to changing circumstance and today carries that legacy forward as America focuses West.\"\nThe name change will not lead to the shifting of U.S. military forces in the region or mark changes to the area of operations of what had been U.S. Pacific Command. Based in Honolulu, Hawaii it is the military headquarters for all U.S. military operations from India to California.\nAccording to Pentagon officials the military command's new name is a recognition of the reality of India's increasing role in regional and global security. One official said the U.S. wants to work more with India to help that nation expand its relationships in the region, that includes plans for new maritime security exercises.\nOne defense official said that since its formation U.S. Pacific Command has always operated in the Indian Ocean as a key part of its mission. The officials said the name change reflects the connectivity between the Pacific and Indian Oceans that is a key factor in providing security in the Pacific region.\nIn his remarks Mattis referenced the National Defense Strategy that \"acknowledges Pacific challenges and signals America's resolve and lasting commitment to the Indo-Pacific.\" Released earlier this year that document consistently referred to what had been previously called the Asia-Pacific region by the new term Indo-Pacific region.\nMattis stressed the U.S. desire \"to seek opportunities for cooperation and open dialogue with our competitors when it aligns with our international interests and the interests of allies, partners and stability.\nIn a veiled swipe at China, Mattis described the Indo-Pacific region as one that is \"open to investment and free, fair and reciprocal trade, not bound by any nation's predatory economics or threat of coercion.\" And in a reference to China's \"One Belt, One Road\" global economic initiative Mattis said \"the Indo-Pacific has many belts and many roads.\"\nIndo-Pacific Command's new name is also in line with recent moves in Congress that supported a name change.\nLast week the House Armed Services Committee included language for the name change in next year's National Defense Authorization Act.\nIn his remarks, Admiral Harry Harris, who turned over command to Davidson stressed that North Korea and China will remain key areas of interest for the new commander of U.S. Indo-Pacific Command.\n\"North Korea remains our most imminent threat,\" said Harris. \"And a nuclear capable North Korea with missiles that can reach the United States is unacceptable.\"\n\"China remains our biggest long term challenge,\" he continued. \"We should cooperate with Beijing when we can, but stand ready to confront them when we must.\"\nHarris will continue playing a key role in U.S. national security efforts in the region. He has been nominated by the Trump administration to be the next U.S. ambassador to South Korea.",
    "source_domain": "abcnews.go.com",
    "title": "US Pacific Command renamed US Indo-Pacific Command",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/us-pacific-command-renamed-us-indo-pacific-command/story?id=55539935"
}