{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 20:23:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Justin Verlander makes light of pitch-tipping talk with tweet",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fjustin-verlander-makes-light-pitch-tipping-talk-tweet%2Fstory%3Fid%3D46848942.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0417/dm_170417_ncf_tomherman_interview/dm_170417_ncf_tomherman_interview_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Detroit Tigers ace Justin Verlander apparently isn't worried he might be tipping his pitches.\nThe right-hander tweeted \"working on my tipping\" Monday with a gif of himself drinking a beer in a pool.\nVerlander matched a career high by allowing nine runs Saturday in the Indians' 13-6 win over the Tigers. gave up 11 hits in four-plus innings, including home runs by Carlos Santana and Lonnie Chisenhall. The 2011 AL Cy Young Award winner and MVP also gave up nine runs against the Chicago White Sox on April 6, 2008, and versus Texas on May 25, 2014.\nManager Brad Ausmus said Verlander and catcher James McCann changed their signals throughout the game as a precaution against signs being stolen.\nOn Sunday, McCann strongly hinted that he believed Verlander was tipping his pitches.\n\"We use multiple signs with nobody on base. We change our signs often. It's got to be something other than that,\" McCann told reporters, according to mlive.com.\n\"For a day where I thought he had his best stuff all season, they seemed to be on quite a few pitches,\" McCann said. \"What that is, I don't know. We're going to study film and see.\"\nIndians manager Terry Francona said his team wasn't stealing signs.\n\"I'm just happy when our guys get our signs -- and I'm being serious about that.\"\nAsked if he thought Verlander might be tipping his pitches, Ausmus told reporters: \"Could be.\"\n\"Hitters are always trying to find an edge on pitchers. And looking for a pitcher tipping is standard operating procedure. I can't tell you whether it is or isn't. Only the Indians could tell you that, and they probably won't,\" he said, according to mlive.com.\nThe Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Justin Verlander makes light of pitch-tipping talk with tweet",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/justin-verlander-makes-light-pitch-tipping-talk-tweet/story?id=46848942"
}