{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:31:51+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A watchdog group is investigating him for excessive use of donor money; he did not return calls for comment.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fevangelist-asked-worshipers-54m-private-jet-now-probe-55543804.json",
    "image_url": "https://s.abcnews.com/images/WNT/180530_wn_davis_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Evangelist who asked worshipers for $54M private jet now under probe\nLiberty Mutual Insurance. We turn next tonight to the tevangelist underfire. He says god gave him the message. Here's ABC's lindseyis. Reporter: The bibles say, \"Ask and ye L receive. So televangelist Jesse Duplantis is asking -- for a llion private jet. I realllie that if Jesus was phly on the Earth today, he wouldn't riding a don think about that for a minute. 'D be in an airplane preaching the gospel all oe world. Eporter: Last week, the new orleans-based minister posted this video, now gettibacklash, asking for donations so H can purchasis fourth private E, in cash. We believe in god for a brand new on-7x so we can go anywhere in the worle stop. Repor he says the plane will help him San exorbitant fuel prices arhe world. Online, there is Ging of teeth, with peopleling him a hypocrite and fal prop one person simply writing, \"Con-air.\" Plan tis, who lives in a $3 million,35,000 square foot home, has S that he's not, ote, living lavishly, but bib likely. He did nurn our calls for comment. David?\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Evangelist who asked worshipers for $54M private jet now under probe",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/WNT/video/evangelist-asked-worshipers-54m-private-jet-now-probe-55543804"
}