{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 20:45:46+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Maldives president says he's willing to hold early election",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmaldives-president-fires-2nd-police-chief-days-52814508.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_26702cc4cfe74c23a5172d3b93a21d05_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The president of the Maldives said Saturday that he was willing to hold an early presidential election to allow voters to decide who they want to lead the Indian Ocean archipelago, as political unrest continued to grow after a court ordered the release and retrial of political prisoners.\nSpeaking publicly for the first time since Thursday's Supreme Court order to release politicians opposed to him, including exiled former President Mohammed Nasheed, President Yameen Abdul Gayoom said he was open to holding an election several months before his term ends next November.\nIn addition to ordering the release of the political prisoners, the court also reinstated 12 lawmakers who had been ousted for switching allegiance to the opposition. When those lawmakers return, Yameen's Progressive Party of the Maldives will lose its majority in the 85-member parliament, which can result in the legislative body functioning as a rival power to the president.\nThe opening of the Parliament for the year on Feb. 5 has been indefinitely postponed, opposition lawmaker Ahmed Mahloof said. He says the government's fear of losing their majority could be the reason for the postponement.\nYameen said that he did not expect the court ruling, but that all relevant authorities of the state need to do \"a lot of work to see how to implement it.\"\n\"We are working on making sure we can respect the Supreme Court order in a way that doesn't cause any difficulties to the people,\" he said at a rally in his support organized by his Progressive Party of the Maldives.\nEarlier on Saturday, Yameen fired a national police chief for the second time since the court order. Yameen's office said he dismissed Ahmed Saudhee and appointed Deputy Police Commissioner Abdulla Nawaz to act as interim police chief. No reason was given for the dismissal.\nSaudhee was appointed interim police chief on Friday, one day after Yameen fired Ahamed Areef, whose dismissal came after the police department announced that it would uphold the Supreme Court's order. Attorney General Mohamed Anil said Areef was fired because Yameen was repeatedly unable to reach him on the phone.\nThe court's ruling, which said the dissident political leaders' guilty verdicts were politically influenced, has led to protests by opposition supporters urging the government to obey the order.\nProtesters late Friday and early Saturday converged on a prison in the capital, Male, where the politicians are being held, demanding their immediate release, but police forced them to leave. They then moved to another location for a sit-in protest that was also broken up. Journalists were kept away from both events by police.\nAfter the court's ruling was made public, street celebrations by government opponents transformed into three hours of clashes with police, who used tear gas and batons to break up the gatherings.\nUnited Nations Secretary-General Antonio Guterres asked the Maldivian government to respect the Supreme Court's order, his spokesman's office said.\n\"The secretary-general reiterates his belief in finding a solution to the political stalemate in the Maldives through all-party talks, which the United Nations continues to stand ready to facilitate,\" the office said in a statement.\nKnown for its luxury tourist resorts, the Maldives became a multiparty democracy 10 years ago after decades of autocratic rule by the current president's half-brother, strongman Maumoon Abdul Gayoom.\nBut the nation lost much of its democratic gains after Yameen was elected in 2013. He has maintained a tight grip on power, controlling institutions such as the judiciary and the police.\nYameen had been set to run for re-election this year virtually unopposed, with all of his opponents either jailed or exiled.\nOn Friday, Nasheed, whose conviction for abducting a judge was overturned by the court order, said he would mount a fresh challenge for the presidency this year.\nNasheed was sentenced to 13 years in prison after he was convicted of the abduction charge under the Maldives' anti-terror laws in a trial that was widely condemned by international rights groups.\n———\nAssociated Press writer Bharatha Mallawarachi in Colombo, Sri Lanka, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Maldives president says he's willing to hold early election",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/maldives-president-fires-2nd-police-chief-days-52814508"
}