{
    "authors": [
        "Abc News",
        "More Erin"
    ],
    "date_download": "2017-04-18 00:57:52+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "After being widely criticized for his initial response to the incident, United's CEO is acknowledging that the Dao video represents a \"watershed moment\" for the airline.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fdao-video-watershed-moment-united-embattled-ceo%2Fstory%3Fid%3D46851106.json",
    "image_url": "http://a.abcnews.com/images/International/ABC-Oscar-Munoz-ml-170412_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The video of Dr. David Dao being dragged down the aisle of a United jet has been trolled by competing airlines, roundly mocked on late-night television and slammed by consumer rights advocates and PR professionals alike.\nNow, after being widely criticized for his initial response to the incident, United's CEO is acknowledging that the viral video represents a \"watershed moment\" for the airline.\n\"It is obvious from recent experiences that we need to do a much better job serving our customers,\" United CEO Oscar Munoz said in a statement on Monday. \"The incident that took place aboard Flight 3411 has been a humbling experience, and I take full responsibility. This will prove to be a watershed moment for our company.\"\nDao, who was forcibly removed from his seat by airport police to make room for a crew member, suffered a concussion and broken nose and lost two front teeth, according to his attorney.\nInitially, Munoz defended the airline's actions, labeling Dao \"disruptive and belligerent\" and claiming employees \"followed established procedures\" while attempting to \"re-accommodate\" the 69-year-old doctor.\nThe reaction was swift and severe.\nIn a follow-up interview with ABC News' Rebecca Jarvis, Munoz apologized to Dao and acknowledged that he was \"ashamed\" of the video.\n\"He was a paying passenger sitting on our seat in our aircraft and no one should be treated that way, period,\" Munoz told Jarvis. \"This is not who we are.\"\n\"He apologized -- we accept that,\" Dao's attorney, Thomas Demetrio, told reporters. \"But that's not going to let him off the hook here.\"\n\"Bullying customers has gone to the next step,\" he added. \"Are we all going to be treated like cattle?\"\nLast Thursday, Demetrio indicated that he and his client would likely file a lawsuit against United and the city of Chicago.\nIn his latest statement, released alongside the airline's first-quarter earnings report, Munoz said the company is \"more determined than ever to put our customers at the center of everything we do.\"\nIn the aftermath of the Dao incident, United indicated that it changed its policy to prevent crew members from displacing any customers who are already seated on a plane.\nABC News' Whitney Lloyd, Jeffrey Cook, and Taylor Dunn contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Dao video a 'watershed moment' for United, embattled CEO says",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/dao-video-watershed-moment-united-embattled-ceo/story?id=46851106"
}