{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 13:52:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The Latest: Confederate group: Atlanta statue must be fixed",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-protesters-deface-confederate-statue-atlanta-49203071.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_5e7b8f439045405db7e40d99fcd0af12_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on violent protesting in Virginia and related developments around the nation (all times local):\n9:45 a.m.\nA group that hosts a ceremony every year to re-dedicate an Atlanta monument depicting a Confederate soldier vows that it will be repaired after protesters spray-painted it and broke a chunk from it.\nJohn Green, past commandant of the Old Guard of the Gate City Guard, said Monday it appears his group must now raise money to repair the 105-year-old statue damaged during a Sunday protest after the deadly weekend violence in Virginia.\nCity officials haven't commented on any plans for repairs or whether city funds would be used for that.\nGreen said removing the statue from Piedmont Park, a city park, is not an option.\nHe said the angel standing over the soldier represents peace, and it was created to help bring the nation back together after the Civil War.\n———\n7:40 a.m.\nA prominent white nationalist website that promoted a Virginia rally that ended in deadly violence Saturday is losing its internet domain host.\nGoDaddy tweeted late Sunday night that it has given the Daily Stormer 24 hours to move its domain to another provider because the site has violated GoDaddy's terms of service.\nGoDaddy spokesman Dan Race tells the New York Daily News that the Daily Stormer violated its terms of service by labeling a woman killed in an attack at the event in Charlottesville \"fat\" and \"childless.\" Heather Heyer was killed Saturday when police say a man plowed his car into a group of demonstrators protesting the white nationalist rally.\nShortly after GoDaddy tweeted its decision, the site posted an article claiming it had been hacked and would be shut down.\n———\n7:25 a.m.\nProtesters spray-painted and broke a chunk off a statue depicting a Confederate soldier at an Atlanta park after they marched through the city to protest the weekend violence in Charlottesville, Virginia.\nThe Atlanta Journal-Constitution reports that a lone policeman at Piedmont Park on Sunday night was surrounded by black-clad protesters shouting \"pig\" as demonstrators used chains to try and destroy the Peace Monument.\nThe statue depicts a winged angel standing over a Confederate soldier.\nVideo from local news outlets showed red spray paint covering much of the monument following the demonstration.\nThe Atlanta protest was among several around the nation over the weekend that were organized after a chaotic white supremacist rally in Virginia ended with deadly violence.\n———\n7:25 a.m.\nThe German government is condemning the white nationalist rally in Virginia that turned violent Saturday, expressing solidarity with peaceful counter-protesters.\nChancellor Angela Merkel's spokesman Steffen Seibert told reporters Monday that it was an \"absolutely repulsive scene at this extreme-right march.\"\nHe said \"there was outrageous racism, anti-Semitism and hate in its most despicable form to be seen, and whenever it comes to such speech or such images it is repugnant.\"\nHe added that it's \"completely contrary to what the chancellor and the German government works for politically, and we are in solidarity with those who stand peacefully against such aggressive extreme-right opinions.\"\nSeibert says Merkel also regrets the death of a counter-protester and sent her sympathies to those injured.\n———\n3 a.m.\nAn Ohio man accused of plowing his car into counter-protesters at a white nationalist rally in Virginia is set to make his first court appearance.\nCol. Martin Kumer, superintendent at the Albemarle-Charlottesville Regional Jail, says 20-year-old James Alex Fields Jr. has a bond hearing Monday morning.\nFields is charged with second-degree murder and other counts after authorities say he drove into the crowd, fatally injuring one woman and hurting 19 others.\nFields has been in custody since Saturday. Jail officials told The Associated Press they don't know if he's obtained an attorney.\nA high school teacher said Fields was fascinated with Nazism, idolized Adolf Hitler and had been singled out by school officials in the 9th grade for his \"deeply held, radical\" convictions on race.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Confederate group: Atlanta statue must be fixed",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-protesters-deface-confederate-statue-atlanta-49203071"
}