{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 03:30:56+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FSports%2Flebron-james-ceiling-prime-playing-years%2Fstory%3Fid%3D55550828.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0530/dm_180530_nba_woj_steveclifford/dm_180530_nba_woj_steveclifford_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "OAKLAND, Calif. -- On the eve of his eighth straight NBA Finals after dominating the 2018 playoffs by averaging the most points (34.0), the second most minutes (41.3) and the third most assists (8.8) of any player in the league, LeBron James acknowledged his career is defying conventional wisdom as to how long a player's prime is supposed to last.\n\"They always kind of talked about the NBA prime is like 27 (until) like 31, 32. That's, if you're lucky, you'll get to that point,\" said James, 33. \"I don't know. I've just never really bought into that. I've never bought into a ceiling either. You guys (in the media) talked about what's your ceiling, and I've always kind of told you guys that I don't really have a ceiling. I want to just try to maximize as much as I can and be as good as I can.\"\nJames, in his 15th year in the league, will break his personal record for most games in a single regular season plus postseason, suiting up for the 101st time in Thursday's Game 1 (9 p.m. ET, ABC). His previous high was 100, set in 2010-11, which ended in a Game 6 Finals loss to the Dallas Mavericks in his inaugural campaign with the Miami Heat.\nJames referenced a postgame interview with ESPN's Cassidy Hubbarth from March when he declared he felt the best he has in his entire career, to illustrate the reason for his extended prime.\n\"I don't know if she believed me, and I don't know if you guys believe me, but I really felt that,\" James said. \"And I continued to just play at an all-time-level standard for the rest of this season. Hopefully I can continue it in this Finals also.\"\nNot only will James be playing the most games of his career, but he's played them consecutively -- logging all 82 regular season games for the first time in his career and then playing in 18 playoff games through the first three rounds, continuing his streak of 235 playoff games played without missing a game because of injury.\n\"I've been blessed to be available,\" he said. \"That's what I take pride in more than anything, is being available to my teammates every single day.\n\"I think I've missed one or two practices a (year) because when you live in Northeast Ohio and you have four seasons, you will get sick. But I've been available for my teammates and been a leader to my teammates all year, and I've put in the work.\"\nJames showed just the faintest hint of his mortality in the Eastern Conference finals against the Boston Celtics, however. Cavs coach Tyronn Lue said James appeared tired in Game 5 and then Cleveland big man Larry Nance Jr. fell into James' right leg in Game 6. Despite the chain of events, James managed to play all 48 minutes in Game 7, going the distance in a playoff game for the first time since 2006.\nJames said he spent Monday \"relaxing and decompressing\" with a family cookout to celebrate Memorial Day, but shifted into Finals preparation mode Monday night when the Golden State Warriors and Houston Rockets tipped off Game 7 of the Western Conference finals.\nJames \"figured\" the Warriors would win because of \"their championship DNA,\" and with his Finals foe determined as the Warriors for the fourth straight season, he shifted to his physical prep for the series on Tuesday.\n\"Just round-the-clock treatment,\" James said. \"We had a workout before we left Cleveland. I got treatment on the four-and-a-half-hour flight up here. We did a little prep yesterday. Got some more treatment, ate dinner. I woke up this morning, worked out like I always do. I got some more treatment and headed here to see you guys.\"\nJames is 1-2 against the Warriors in the Finals. In 2015, James earned four of the 11 votes for Finals MVP despite the Cavs losing in six games. In 2016, James was named Finals MVP as he led Cleveland to the first comeback from down 3-1 in Finals history. In 2017, he became the first player in Finals history to average a triple-double for the series.\nWhat does he have in store for 2018?\n\"The level that I can play at is to be seen, but the level that I put into the game and put into my craft is who I am,\" he said. \"So numbers and things like that kind of take care of itself. But for me, I understand and I know how much I put into the game. So everything else is OK.\" And just how much basketball does James say he has left to play this season?\n\"Tomorrow (I will) suit up for the 101st consecutive time,\" James said. \"If I'm fortunate, I can suit up for -- what is it, (107)? We'll see what happens.\"",
    "source_domain": "abcnews.go.com",
    "title": "LeBron James: No ceiling for my prime playing years",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Sports/lebron-james-ceiling-prime-playing-years/story?id=55550828"
}