{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 08:02:58+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "The US Open is closed to amateurs winning",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fus-open-closed-amateurs-winning-48049849.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_4a799bce7f344be8b9de2a0d7f50d009_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jack Nicklaus was good enough to win the U.S. Open as an amateur, and he nearly did.\nNicklaus was a 20-year-old U.S. Amateur champion at Cherry Hills, leading by one shot with six holes to play until he missed too many short putts and Arnold Palmer capped off a signature charge to win the 1960 U.S. Open.\nThat explains why Nicklaus had a wry smile when asked if he regarded Marty Fleckman as a threat 50 years ago in the U.S. Open.\nFleckman was a 23-year-old amateur, an NCAA champion at Houston and winner of the Texas State Amateur. He had a one-shot lead over Nicklaus, Palmer and Billy Casper in the final round in 1967 at Baltusrol.\n\"Let me put it this way,\" Nicklaus said. \"He was leading after 54 holes. He had a very good chance to win the Open.\"\nBut he didn't.\nAmateurs just don't win the U.S. Open anymore, bad news for the 14 amateurs at Erin Hills this week. The last amateur winner was Johnny Goodman in 1933, and there's little evidence that will change. Fleckman and Jim Simons in 1971 were the last ones to have a 54-hole lead.\nFleckman shot 80 in the final round that day, quickly stepping aside for a brief Nicklaus-Palmer duel that ended with Nicklaus by four shots, the second of his four U.S. Open titles. Fleckman drove up to Rhode Island the following week and won the prestigious Northeast Amateur at Wannamoisett.\nThe U.S. Open, for 83 years and counting, belongs to the pros.\n\"It was a wonderful experience,\" said Fleckman, the director of golf instruction at Blackhorse Teaching Center in Texas. \"I got off to a shaky start. I knew I couldn't win any money, so I tried to attack the golf course. You don't really attack a U.S. Open venue, and I paid the piper.\"\nSimons was a threat to the end at Merion. He was one shot behind going to the 18th hole until making a double bogey to finish three shots out of a playoff that Lee Trevino won the following day over Nicklaus.\nGoodman had such a big lead that he shot 76 and still won the U.S. Open. He later won the U.S. Amateur.\nBobby Jones in 1930 at Hoylake is the last amateur to win the British Open. No amateur has ever won the Masters, which also has had its share of close calls, most notably Ken Venturi in 1956 until he shot 80 on the last day.\nThe amateurs at Erin Hills are facing Dustin Johnson and Rory McIlroy, Jordan Spieth and Jason Day. The gap between the pros and the amateurs is growing by the year, especially as the competition at the professional level is stronger than ever.\n\"If it's going to be done, it would be at the U.S. Open, where you can get on the good side of the draw and par is a good score and you're not giving anything to the field,\" Spieth said. \"I imagine it will be done.\"\nNot by him. He was low amateur in 2012, but he wasn't the best teenager at Olympic Club until it was over and 17-year-old Beau Hossler stumbled at the end.\nJordan Niebrugge, who was to hit the opening tee shot at Erin Hills on Thursday, was the low amateur at St. Andrews in the 2015 British Open, and he wasn't even the amateur attraction that week. Paul Dunne of Ireland shared the 54-hole lead with Day and Louis Oosthuizen, but fell back quickly and shot 78.\nDunne also is at Erin Hills. Much like Fleckman in 1967, the Irishman looks back on that final round as a great experience sprinkled with regrets.\n\"Major golf courses seem to be set up as different tests from any other week,\" Dunne said. \"Because of that, it can take a few people by surprise. And it can take an amateur by surprise to get in a position he didn't think he'd be in the first place.\"\nDunne, Spieth and Nicklaus would not rule out an amateur winning a major. So why hasn't it happened?\nThe simple answer is because they turn pro.\nJon Rahm was low amateur at Oakmont last year in the U.S. Open. After a year of playing PGA Tour competition, he is No. 10 in the world and a threat to win this week. Spieth turned pro during his sophomore year at Texas. His game matured against the best.\nDunne also considered sheer numbers.\n\"The amateur game is strong,\" Dunne said. \"The top end amateurs, everyone is quite professional in hos they go about their business. It's hard to see it happening because there are so few amateurs. If you took the top 75 ranked players, and let in the next 75 top amateurs, you'd definitely have an amateur winner in a few years.\"\nNicklaus still believes if a player is good enough, he can win anywhere, like he almost did in 1960. A year later, still an amateur, Nicklaus tied for seventh in the Masters and tied for fourth in the U.S. Open. And the year after that, he beat Palmer in a playoff at Oakmont for the first of his 18 majors.\n\"Most of them don't stay amateur very long,\" Nicklaus said of today's crop. \"If I had stayed amateur, do I think I would have won it? Yeah. You have amateurs who are good players, but they usually turn pro before they get real good.\"",
    "source_domain": "abcnews.go.com",
    "title": "The US Open is closed to amateurs winning",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/us-open-closed-amateurs-winning-48049849"
}