{
    "authors": [
        "Abc News",
        "More Pete"
    ],
    "date_download": "2017-10-07 01:37:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Attorney General Jeff Sessions consulted Alliance Defending Freedom ahead of issuing controversial guidance to government agencies and departments on Friday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fjeff-sessions-consulted-christian-legal-group-religious-freedom%2Fstory%3Fid%3D50336322.json",
    "image_url": "http://a.abcnews.com/images/Blotter/jeff-sessions-gty-jc-171006_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Attorney General Jeff Sessions consulted Alliance Defending Freedom, a legal advocacy group that champions conservative Christian causes, ahead of issuing controversial guidance to government agencies and departments on Friday about how to interpret federal religious liberty protections.\nAlliance Defending Freedom (ADF), a group whose stated mission is to “keep the doors open for the Gospel by advocating for religious liberty, the sanctity of life, and marriage and family,” hailed Sessions’ announcement, while a number of leading LGBT advocacy groups condemned the move for effectively offering a religious exemption for sexual orientation discrimination.\nIn a call with reporters, ADF CEO Michael Farris confirmed to ABC News that Sessions met with the group during a series of so-called “listening sessions” convened by the Attorney General, who says he was “seeking suggestions regarding the areas of federal protection for religious liberty most in need of clarification or guidance.”\nFarris, who took over as CEO and general counsel of ADF in January, also lauded President Donald Trump for fulfilling a campaign promise.\n“I commend the president for taking another step to honor his campaign promise to make religious liberty his ‘first priority’ by directing the Department of Justice to issue this guidance, which simply directs the federal government to adhere to its legal and constitutional obligation to respect existing religious freedom protections,” wrote Farris in a statement.\nThe Department of Justice did not respond to requests to release a list of the individuals and groups Sessions met with during his “listening sessions.”\nADF was founded in 1994 by a group of leading Christian evangelical leaders, including James Dobson of Focus on the Family, Bill Bright of Campus Crusade for Christ and Larry Burkett of Crown Financial Ministries. Since then, ADF has established itself as a leading litigation and appellate advocacy group for Christian right causes, including opposition to abortion and same-sex marriage, and social conservatives hail the group as champions of religious freedom.\nADF lawyers have argued several cases before the Supreme Court and are currently representing Colorado baker Jack Phillips, who is challenging the state’s nondiscrimination protections after he was found in violation of the law for refusing to bake a wedding cake for a same-sex couple in 2012. The U.S. Supreme Court recently agreed to review the Phillips case. In a recent appearance on ABC’s “The View,” Phillips defended his actions: “I don’t believe that Jesus would have made a cake, if he would have been the baker,” he said.\nThe progressive Southern Poverty Law Center added ADF in 2016 to its “designated hate group” list, which includes a number of right-wing evangelical organizations, for what SPLC calls its “anti-LGBT ideology.” The SPLC said ADF “works to develop ‘religious liberty’ legislation and case law that will allow the denial of good and services to LGBT people on the basis of religion” and “has supported the recminalization of homosexuality in the U.S. and criminalization abroad.”\nADF has repeatedly disputed the Southern Poverty Law Center’s “hate group” designation as “a lie” and criticized news organizations, including ABC News, who make reference to it.\nThe group also has powerful conservative allies willing to come to their defense. Sen. James Lankford, a Republican from Oklahoma, criticized ABC News for its coverage of the group in July, after ABC News reported that Sessions delivered a closed-door address to the group at their Summit on Religious Liberty in California, where he suggested, according to a text of the speech later published by the conservative website The Federalist, religion was “under attack.”\nThe SPLC, meanwhile, which has monitored hate groups throughout the United States for decades, continues to stand by its label, telling ABC News it’s “rightfully earned.”\nJeff Malet Photography/Newscom\nOn Friday, Sessions outlined 20 broad “principles” designed to ensure that “to the greatest extent practicable and permitted by law, religious observance and practice should be accommodated in all government activity,” including a decree that “a governmental action substantially burdens an exercise of religion … if it compels an act inconsistent with that observance or practice, or substantially pressures the adherent to modify such observance or practice.”\nFor several leading LGBT advocates, the new guidance was an alarming effort to undermine sexual orientation discrimination protections, under the guise of affirming religious liberty, that could have far-reaching implications.\nSen. Tammy Baldwin, a Democrat from Wisconsin and the first openly gay U.S. Senator, told ABC News that today’s guidance could pave the way for discrimination of vulnerable populations.\n“I support religious freedom and the freedom of full equality for every American,” Baldwin said in a statement. “A license to discriminate goes against our core American values and I fear that the guidance the Justice Department issued today is not designed to help agencies comply with the law, but rather to give them greater leeway to condone discrimination against LGBTQ people, women and others.”\nAccording to Human Rights Campaign president Chad Griffin, the new guidance makes millions of Americans vulnerable to discrimination.\n“Today the Trump-Pence administration launched an all-out assault on LGBTQ people, women and other minority communities by unleashing a sweeping license to discriminate,” said Griffin in a statement. “This blatant attempt to further Donald Trump’s cynical and hateful agenda will enable systematic, government-wide discrimination that will have a devastating impact on LGBTQ people and their families.”\nSarah Kate Ellis, president and CEO of GLAAD, argued that the new guidance rests on a misinterpretation of religious liberty.\n“Today’s guidance by Jeff Sessions proves this Administration will do anything possible to categorize LGBTQ Americans as second-class citizens who are not equal under the law,” said Ellis in a statement. “Freedom of religion is paramount to our nation’s success, but does give people the right to impose their beliefs on others, to harm other, or to discriminate. Nothing could be more un-American and unholy that using religion to justify harm and discrimination to others.”\nFor David Dinielli, the deputy legal director for the Southern Poverty Law Center’s LGBT Rights Project, the ADF’s apparent relationship with Sessions is a troubling sign of the group’s growing influence in the new administration.\n“The fact that the ADF has confirmed it has participated in a listening session is further proof that extremists have infiltrated the highest echelons of power in this administration, even the Attorney General who is tasked with protecting the civil rights of all Americans,” Dinielli told ABC News. “I’m not certain who came up with the invitation list to these listening sessions, but I can assure you it did not include groups who provide services to those who will be directly affected by this new guidance.”",
    "source_domain": "abcnews.go.com",
    "title": "Jeff Sessions consulted Christian right legal group on religious freedom memo",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/jeff-sessions-consulted-christian-legal-group-religious-freedom/story?id=50336322"
}