{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 01:37:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Bank pays $1.75M over treasurer likened to Bernie Madoff",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fbank-pays-175m-treasurer-likened-bernie-madoff-50337044.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_df3966ac266b430b84e04985b5d84e9d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Beverly Hills-based bank has paid $1.75 million to settle allegations that a bank it acquired facilitated embezzlement by failing to monitor transactions by a woman whom a prosecutor likened to the Bernie Madoff of campaign treasurers.\nFormer Democratic campaign treasurer Kinde Durkee pleaded guilty to five counts of mail fraud in 2012 and was sentenced to more than eight years in federal prison for defrauding high-profile clients, including U.S. Sen. Dianne Feinstein, in a case that a judge said tampered with the electoral process.\nU.S. Attorney Phillip Talbert said Friday that Pacific Western Bank paid $1.75 million to resolve allegations that First California Bank, which PacWest acquired in 2013, facilitated Durkee's embezzlement by failing to properly monitor her accounts.\nThe government said the bank ignored obvious warning signs that Durkee was stealing, allowing the fraud to continue.\n\"People who commit white collar crimes such as embezzlement, fraud, and money laundering often use the banking system to facilitate their crimes,\" Talbert said in a statement.\nDurkee acknowledged defrauding clients of more than $7 million, though prosecutors believe the figure was closer to $10.5 million, and she was ordered to make $10.5 million in restitution. She had little money remaining, though.\nFeinstein said she lost about $4.5 million in the scam that targeted dozens of other Democratic lawmakers and nonprofit political groups, including U.S. Reps. Loretta Sanchez and Laura Richardson; former state Sen. Lou Correa; former Assemblyman Jose Solorio; and political nonprofit groups such as the Los Angeles County Democratic Party.\nThe U.S. attorney who prosecuted her, Benjamin Wagner, called Durkee \"the Bernie Madoff of campaign treasurers,\" referring to the New York financial manager convicted of operating the largest Ponzi scheme in history. Wagner said Durkee's scheme relied on the trust of her victims, many of whom were her longtime clients.\nProsecutors and Durkee's attorney, Daniel Nixon, said she ran the equivalent of a shell game from her Burbank office, shifting millions of dollars among bank accounts for politicians, community groups, personal accounts and those of her business.\nAuthorities said she used the money to pay mortgages for her home and business, pay her employees, to care for her parents in a home for seniors and to buy some pleasure items such as season tickets to the Los Angeles Dodgers.\nDurkee remains jailed in a federal prison in Seattle. Her release date is listed as February 2020.",
    "source_domain": "abcnews.go.com",
    "title": "Bank pays $1.75M over treasurer likened to Bernie Madoff",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/bank-pays-175m-treasurer-likened-bernie-madoff-50337044"
}