{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 18:35:12+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Texas' Andrew Jones seeing 'positive strides' to leukemia treatments",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ftexas-andrew-jones-positive-strides-leukemia-treatments%2Fstory%3Fid%3D52816958.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180203_cgd_shaka_on_jones_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Texas sophomore guard Andrew Jones, who was diagnosed with leukemia in January, is seeing improvement in his condition, his family announced on Saturday.\n\"We do want everyone to know that in the last two weeks, Andrew has made some positive strides,\" his family said in a statement released by the school. \"He's even been able to get out of bed and move around some, which is a huge difference from when he was first diagnosed in Austin.\"\nJones, whose condition was announced on January 10, was moved to the University of Texas MD Anderson Cancer Center in Houston on Jan. 19, where he continues to undergo treatment.\nThe 6-foot-4 Jones was second on the team in scoring (13.5 points per game) before his diagnosis. He was a McDonald's All-American coming out of MacArthur High School in Irving, Texas, and averaged 11.4 points per game as a freshman. He declared for the NBA draft after his freshman season but eventually withdrew his name and chose to return to school for his sophomore season.\nThe Longhorns host No. 12 Oklahoma on Saturday. The team has seen significant support from those around the program as well as opposing teams for Jones since his diagnosis.\n\"We are very appreciative of the outpouring of love and support for Andrew and our family, and we do ask that you continue to keep Andrew in your daily thoughts and prayers,\" the family said. \"We know there's a long battle ahead, but together we will win this fight.\"",
    "source_domain": "abcnews.go.com",
    "title": "Texas' Andrew Jones seeing 'positive strides' to leukemia treatments",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/texas-andrew-jones-positive-strides-leukemia-treatments/story?id=52816958"
}