{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:18:48+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fgaza-truce-brings-relief-volatile-situation-55540605.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_d83016c0d3964ceb87987d1046c6f085_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With a cease-fire declared Wednesday, Israel and Hamas appear to have pulled back from a fourth war after a day of intense rocket fire and airstrikes. But the situation could explode at any moment.\nTuesday's fighting was the heaviest since a 2014 war, with Palestinian militants firing scores of rockets and mortars into Israel, and Israel carrying out dozens of airstrikes in Gaza.\nBoth sides appeared to have accomplished some short-term goals. But the underlying issues that helped fuel the fighting remain in place.\nHamas, weakened by a decade-long blockade of Gaza, remains defiant and in distress. A confident Israel appears unrestrained by the United States or its Middle Eastern neighbors. Palestinian militants still have an arsenal of rockets and could potentially inflict damage or casualties in Israel, followed by Israeli retaliation.\nHere's a look at the current state of play and potential for escalation.\n———\nHOW DID WE GET HERE?\nEleven years after seizing control of Gaza from Palestinian President Mahmoud Abbas, Hamas is in trouble.\nGaza's economy has been battered by an Israeli-Egyptian blockade, imposed to prevent the group from arming. Three wars with Israel have brought widespread destruction, and the Islamic militant group has no close international allies to bail it out.\nFrustrated with his inability to regain control of Gaza, Abbas has stepped up economic pressure on Hamas by cutting the electricity supply and reducing the salaries to tens of thousands of former civil servants in Gaza.\nRunning out of options and rejecting calls to disarm, Hamas has led a series of weekly mass protests along the Israeli border during the past two months to draw attention to Gaza's poor conditions and pressure Israel to ease the blockade.\nIsrael has fired live bullets and tear gas to break up the protests and prevent a mass breach of the border fence, killing over 110 Palestinians, the vast majority unarmed. Some of the Palestinian protesters hurled fire bombs, burned tires or tried to breach the fence, undermining Hamas' claims that the protests were entirely peaceful.\nIsrael says Hamas is responsible for the bloodshed, and accuses the group of using the demonstrations as a cover for attacks.\nStill, Israel has come under heavy international criticism for its use of deadly force. But the protests have not succeeded in easing the blockade.\n————\nHOW DID THINGS ESCALATE?\nEarlier this week, Israel carried out a pair of deadly strikes on military posts belonging to Hamas and the smaller Islamic Jihad militant group, contending militants planted explosives and tried to break through the border to carry out an attack. Four militants were killed.\nEarly Tuesday, Islamic Jihad retaliated by firing a barrage of mortar fire into southern Israel near the Gaza border. Hamas later fired rockets for the first time since the 2014 war ended with an informal cease-fire.\nThe cross-border exchange lasted throughout the night, but both sides showed restraint. Israel targeted empty Palestinian military training and weapons sites, while the militants avoided use of powerful longer-range rockets capable of striking deeper into Israel. Both were signs that neither side wants to go to war.\n———\nWHAT DID EACH SIDE ACCOMPLISH?\nThe Palestinian militants, who accuse Israel of violating the terms of the 2014 cease-fire by targeting their military observation posts, believe they sent a powerful reminder that they still possess arsenals capable of disrupting the lives of hundreds of thousands of Israelis on the other side of the border.\n\"Israel used to initiate the strikes and end them unilaterally and impose new rules,\" said Adnan Abu Amer, an independent analyst in Gaza. \"This time the resistance took the initiative. ... The resistance came out from this round in a superior position.\"\nFrom Israel's perspective, the military delivered a measured, but powerful response that made Hamas realize quickly that fighting is not in its interest. Israel did not signal that it is willing to ease the blockade.\n———\nWHERE DO WE GO FROM HERE?\nWhile Israel's military and the Palestinian militant groups flexed their muscles, little was resolved.\nAny time Hamas or Islamic Jihad resort to firing rockets, they risk triggering a fierce Israeli response, especially if there are serious casualties on the Israeli side.\nIsrael's \"Iron Dome\" rocket defense system intercepted dozens of incoming projectiles on Tuesday. But the system is not fail-safe. One mortar shell landed next to an Israeli kindergarten shortly before it opened, and four Israelis were wounded by Palestinian fire.\nIt was not immediately clear if Islamic Jihad, a much smaller, Iran-backed militant group, acted independently Tuesday or at least had the tacit blessing of Hamas. At times, Islamic Jihad has pursued objectives that differ from those of Hamas.\nIsrael, meanwhile, appears to have made progress in defusing long-term threats posed by Hamas. Its air defenses have largely mitigated the rocket threat, and its military has made great progress in destroying Hamas' system of attack tunnels along the border.\nThe Trump administration has shielded Israel from critics in Europe and the human rights community who say Israel's open-fire orders are illegal because they allow deadly force even when soldiers are not in life-threatening situations.\nIsrael has quietly forged good behind-the-scenes ties with Egypt and Gulf Arab states that have little empathy for Hamas, an offshoot of the regional Muslim Brotherhood movement.\nBut Israel's apparent military and diplomatic advantage does not solve the underlying problem of having a volatile, impoverished territory on its doorstep. Many analysts and members of the international community believe it is only a matter of time before Gaza boils over again as long as the blockade remains in place.\nThat could happen sooner than later. Next Tuesday, Hamas plans another mass protest along the border.\n———\nAssociated Press writer Fares Akram in Gaza City, Gaza Strip, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Gaza truce brings little relief to volatile situation",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/gaza-truce-brings-relief-volatile-situation-55540605"
}