{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 22:06:34+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Investment pros staying calm after rate fears clobber stocks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Finterest-rate-worries-send-jolt-stock-market-52816923.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_b639b07f59ea4f419a8355c6977fb66f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The stock market has finally found something to fear.\nFor more than a year, investors have brushed off bombastic talk about nuclear war, dysfunction on Capitol Hill and other worrisome situations. The Dow Jones industrial average and the Standard & Poor's 500 glided to record after record, with few hiccups.\nThis week, the calm cracked. The stock market finally got spooked by an ongoing sell-off in bonds. As bond prices fall, their yields go up, a signal of rising interest rates. Low interest rates have been an underpinning of the current bull market in stocks, now in its ninth year.\nOn Friday, the rate on the 10-year Treasury note jumped to a four-year high. The Dow and S&P 500 each lost around 4 percent, their worst week since January 2016. On Friday, the Dow dropped 665 points, or 2.5 percent. Some earnings-related selling in big names such as Apple and Exxon Mobil added to the swoon.\nSome investors believe the market can recover, noting that both global economic growth and corporate earnings remain strong. One hallmark of this bull market has been investors' willingness to buy the dips. This week's drop could test their resolve.\nSince the Great Recession, ultra-low interest rates have made it easier for businesses and companies to borrow. They also have pushed investors into buying stocks by minimizing the interest payments from bonds.\nRates were due to rise, and investors cast a wary eye on the 10-year Treasury as it rose earlier this year. Those concerns hit a high point on Friday after a U.S. government report said wages last month rose at the fastest pace in eight years.\nBigger paychecks are a welcome sight for workers, but can also signal that inflation is about to pick up across the economy. Inflation has been relatively dormant since the recession. This week, the Federal Reserve said it expects inflation to finally pick up this year.\nThe Fed could raise interest rates more quickly than investors are prepared for if inflation accelerates at too fast a pace. That could further upset markets, which have seen an unusual lack of volatility for more than a year. After Friday's jobs report, some economists raised their forecast for Fed rate increases this year to four from three.\nThe yield on the 10-year Treasury climbed to 2.84 percent Friday from 2.79 percent late Thursday and from 2.41 percent at the start of the year. It's at its highest level since 2014.\n\"We are rapidly approaching the point at which low rates will no longer provide support to the equity market,\" said Eric Winograd, senior U.S. economist at AllianceBernstein.\nThose concerns echoed worldwide. Other markets around the world were similarly weak as interest rates climbed. The German DAX index lost 4.2 percent over the week, and South Korea's Kospi index lost 1.9 percent.\nInvestors have cited low interest rates are one reason they've continued to buy stocks, even as prices rose faster than corporate earnings. By that measure, the price-earnings ratio, the S&P 500 is close to the most expensive it's been in many years, adjusted for inflation.\nHigher interest rates tend to make investors less willing to pay high price-earnings ratios. Hence all the focus on exactly how many times the Fed will raise rates this year.\nStill, many fund managers and analysts say they're optimistic stocks can keep rising, even if interest rates continue to climb. As long as inflation doesn't spike out of control, stocks can rise if earnings continue to grow.\nMany analysts expect earnings to keep growing because of the strength in the global economy. Few economists see a recession striking anytime soon.\nThe strengthening economy is translating into not only stronger profits for companies but also better sales, something that investors have been keen to see. Roughly half the companies in the S&P 500 have given updates on their performance for the last three months of 2017, and 79 percent of them have reported stronger revenue for the quarter than analysts expected, according to S&P Global Market Intelligence. That compares with 67 percent a quarter earlier.\nWhat makes this past week's market drop particularly noticeable for investors is how rare a decline has been for stocks. Before Friday, the last time the S&P 500 index fell 2 percent in a day was in September 2016.\nBut historically, pullbacks for stocks are normal, and investors shouldn't be surprised if stocks drop by 5 percent or even 10 percent before they begin rising again.\nThe S&P 500 still has not experienced a decline of 5 percent in roughly 400 trading days, even after this past week's 3.9 percent drop. That's a record number of days. Going back to 1929, the average was 92 days, according to Goldman Sachs.\nOr, as Greg McBride, chief financial analyst at Bankrate.com, said: \"Markets go up and down, not just up.\"",
    "source_domain": "abcnews.go.com",
    "title": "Investment pros staying calm after rate fears clobber stocks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/interest-rate-worries-send-jolt-stock-market-52816923"
}