{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:48:49+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Police: Hostage situation at Somali restaurant",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-confusion-gunmen-somali-explosion-48038254.json",
    "image_url": "http://abcnews.go.com/International/wireStory/latest-confusion-gunmen-somali-explosion-48038254",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on a suicide attack outside a restaurant in Somalia's capital (all times local):\n———\n10:40 p.m.\nPolice are reporting a hostage situation inside a restaurant in Somalia's capital as gunmen are holed up inside and security forces try to secure the scene.\nCapt. Mohamed Hussein says a burst of gunfire has been heard inside the Pizza House restaurant, where dozens of people are reported to be held.\nThe attack Wednesday night began with a suicide car bombing at the gate of the restaurant. Police say at least four people have been killed and several wounded.\nThe Somalia-based extremist group al-Shabab has claimed responsibility.\n———\n9:45 p.m.\nPolice say at least four people were killed and several others wounded in a suicide car bomb blast that targeted a popular restaurant in Somalia's capital.\nCapt. Mohamed Hussein says most of the victims were young men who were entering the Pizza House at the time. The car exploded at the restaurant's gate.\nThe Somalia-based extremist group al-Shabab often targets high-profile areas in Mogadishu.\n———\n9:05 p.m.\nPolice say there is confusion whether gunmen are inside a restaurant in Somalia's capital after a suicide car bomb detonated at its gate.\nCapt. Mohamed Hussein at first said gunmen were fighting their way inside the restaurant and that a hostage situation was underway.\nHussein now says it's possible the attack ended with the car bombing outside the Pizza House restaurant. The restaurant is just meters away from another establishment popular with the city's elite.\nThe Somalia-based extremist group al-Shabab often targets high-profile areas in Mogadishu.\n———\n8:45 p.m.\nPolice say a suicide bomber has detonated an explosives-laden vehicle at the gate of a popular restaurant in Somalia's capital.\nCapt. Mohamed Hussein says a hostage situation is under way at the Pizza House restaurant.\nHussein has no immediate information about any casualties.\nThe Somalia-based extremist group al-Shabab often targets high-profile areas of Mogadishu, including hotels, military checkpoints and areas near the presidential palace. It has vowed to step up attacks after the recently elected government launched a new military offensive against it.",
    "source_domain": "abcnews.go.com",
    "title": "Police: Hostage situation at Somali restaurant",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-confusion-gunmen-somali-explosion-48038254"
}