{
    "authors": [
        "Abc News",
        "More Evan"
    ],
    "date_download": "2018-07-04 17:33:11+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Alex Jones' \"civil war\" warning drew mocking hastags like #secondcivilwar and #secondcivilwarletters.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FNews%2Fcivil-war-post-wing-radio-host-roundly-mocked%2Fstory%3Fid%3D56363983.json",
    "image_url": "https://s.abcnews.com/images/Politics/alex-jones-radio-host-gty-thg-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It all started with a tweet.\n\"BREAKING,\" conspiracy theorist and radio personality Alex Jones tweeted this past Sunday. \"Democrats Plan To Launch Civil War On July 4th.\"\nBREAKING: Democrats Plan To Launch Civil War On July 4th https://t.co/38AWiUFaag — Alex Jones (@RealAlexJones) July 1, 2018\nThe \"Infowars\" host announced that Democrats, in alliance with anti-fascist protesters and billionaire philanthropist and liberal donor George Soros, had been planning to overthrow President Donald Trump since his 2016 presidential election.\n\"This is it,\" Jones warned in a livestream that logged nearly three-quarters of a million views. \"The globalists see July 4th as their new D-Day against us, and a lot of stuff is going to start then.\"\nJones claimed to have seen recent indicators that the alleged effort was coming to a head around Independence Day, though he gave no specific reason that a \"civil war\" or any other potential actions would initiate on the Fourth of July.\nThe radio personality has a history of incendiary and false rhetoric. In 2016, Jones helped promulgate the fictitious \"Pizzagate\" conspiracy theory -- which falsely alleged that a child sexual assault ring was being run by figures tied to the Democratic party. He later apologized.\nHe is also being sued by families of the Sandy Hook shooting victims after calling the massacre fake.\nBut social media users see mostly humor in his latest broadside. The hashtags #secondcivilwar and #secondcivilwarletters, comprised of mostly mockery of Jones' warning, have generated nearly 400,000 tweets, according to analytics company Spredfast. The hashtags have rapidly increased in frequency in the 24 hours leading up to Wednesday's holiday.\nSome users made fun of the gap between Jones' martial rhetoric and stereotypes of liberals as coastal elites who enjoy high-end coffee drinks and electric cars, while others, including model Chrissy Teigen, joked about the difficulty of coordinating the mass effort.\nI have to go to Ralph’s then need to shower but I can shower after the war I guess — christine teigen (@chrissyteigen) July 4, 2018\nSorry. I can’t participate in the #SecondCivilWar tomorrow. I have bone spurs. But I can throw paper towels out of a moving vehicle if anyone needs me. — JEN KIRKMAN (@JenKirkman) July 3, 2018\nLegit #SecondCivilWar question: Do I bring my own chilled La Croix, or is it provided? — sara field (@sadiefield) July 4, 2018\nWho schedules the #SecondCivilWar on a Wednesday? — Abraxsys (@Abraxsys) July 4, 2018\nIs this #SecondCivilWar happening on east coast or west coast time? Also, I feel fat in my fatigues. — andy lassner (@andylassner) July 4, 2018\nI’ve had ZERO luck finding a tank for tomorrow like my Sgt. instructed. I did however find a Hyundai Santa Fe with a third row so I can take some extra troops with me if I take out the booster seat. #secondcivilwar — DI$ARM the NRA (@Trumpalump) July 3, 2018\nThe #SecondCivilWar has started! I’ve gathered up supplies for today’s battle. ???????? pic.twitter.com/hCEKA8ZmXI — Amy Siskind (@Amy_Siskind) July 4, 2018\nWhen the #SecondCivilWar kicks off soon, liberals will get the jump on the Trumpers because we will be fully caffeinated and they broke their Keurig machines. — Adam Best (@adamcbest) July 4, 2018\nDay 1 of #SecondCivilWar. I have prepared 10 pounds of potato salad. Concerned the popsicles may melt as we march, tho. — Joyce Alene (@JoyceWhiteVance) July 4, 2018\nWhile liberals online were having a lot of fun with the hashtag, it wasn't just them partaking. Self-proclaimed Trump supporters also joked about a second civil war, which they claimed Democrats would quickly lose.\nThere is going to be no #SecondCivilWar tomorrow.\nIf there was, it would be over in 30 minutes.\nConservatives have all the guns!!\n??????????????\nRest easy liberals. Unlike you, we are actually gentlemen. We will just beat your butts at the ballot box...again. Happy 4th! #MAGA — Michael Nöthem (@mikandynothem) July 4, 2018\nSocial media users also jokingly imagined letters home from the battle. Comedian Patton Oswalt and even former Office of Government Ethics head Walter Shaub got in on the #secondcivilwarletters hashtag.\nDear Jeb,\nOur depleted ranks grew when a yankee, one Mr. Dershowitz, was shunned from the evening’s repast and defected to our side. Alas, he will surely starve before deigning to partake of our crackers dressed with cheese from the aerosol spray can. #secondcivilwarletters — Walter Shaub (@waltshaub) July 4, 2018\nMy beloved Harriet — I write to you with a heavy heart. I was gravely memed during a skirmish with a squad of Incel Irregulars. Doc Tibbens says there’s nothing for it — he will have to amputate my Twitter feed. Womp womp — Jed. #SecondCivilWarLetters — Patton Oswalt (@pattonoswalt) July 3, 2018\nMy dearest,\nToday I fear we will engage the enemy. We drank our morning half-caf lattes with grim determination. The Hipster Battalion has waxed its moustaches, for they will be in the vanguard. If I do not return, find another with whom to Netflix & chill. #secondcivilwarletters — Josh Chafetz (@joshchafetz) July 4, 2018\nDear Hillary, I regret to inform you that my journey to join you and Maxine at Jade Helm II is delayed. Upon reaching the Beltway I found my wife had removed the EZ-Pass transponder from the Prius and I must now await expiration of the HOV restrictions.#SecondCivilWarLetters — Col. Morris Davis (@ColMorrisDavis) July 4, 2018\nDearest, I hope this finds you as I am at 4% battery life. I have been captured and I am at a Trump Rally. It is a sight. 1000 people and 65 teeth. I hope I survive. Love, Me #secondcivilwar — Tony Posnanski (@tonyposnanski) July 3, 2018\nDear Mrs. Dershowitz — I regret to inform you that your husband has been gravely wounded during the battle of Martha’s Vineyard, overtaken by a fierce volley of social disinvitations. We fear that his ego shall remain desperately fragile. #secondcivilwarletters #SecondCivilWar — ??????? ? ????n? (@Dofang) July 3, 2018\nI pulled on my yoga pants, stopped at Starbucks for a skinny latte and grabbed my iPhone and a portable battery. I worried I wouldn’t go to the right battleground but luckily it was location tagged on Facebook. I knew I could postmate avocado toast for lunch. #SecondCivilWar — Molly Jong-Fast (@MollyJongFast) July 4, 2018\nDear Ma, In preparing for tomorrow's battle, we spent the day using Hillary's emails to build our fortress. There is no doubt now that we will be victorious as no one can seem to get over them. Now we covfefe till morning. Happy Second Civil War Eve!#secondcivilwarletters — Be Best Bowling Green Victim (@TeamGulley) July 4, 2018\nMeanwhile, a few predicted that the real division of Jones' warning would be resolved not in any Fourth of July junta, but at the ballot box on November:",
    "source_domain": "abcnews.go.com",
    "title": "'Civil war' post by right-wing radio host roundly mocked",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/News/civil-war-post-wing-radio-host-roundly-mocked/story?id=56363983"
}