{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 05:52:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Hong Kong activist arrested over allegation of stapled legs",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fhong-kong-activist-arrested-allegation-stapled-legs-49220720.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_f7d8e2f8ef69485dadbc3103dd7211fd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The strange case of a Hong Kong pro-democracy activist who claimed mainland Chinese agents stapled his legs as a warning has taken another twist after police arrested him Tuesday on suspicion of providing false information.\nHoward Lam made waves last week with his eye-catching allegations, which rekindled fears about Beijing interfering in Hong Kong despite promising it considerable autonomy since the 1997 handover from Britain. But police said his story didn't check out.\n\"The victim's reports about his activities on that day and the investigation's results do not match,\" police said in a statement, \"At this time, there's no evidence that anyone was illegally detained in Hong Kong.\"\nLam, 42, had intended to send a signed photo of Argentine soccer star Lionel Messi to Liu Xia, the widow of late Nobel Peace Prize laureate Liu Xiaobo, and posted his plans on Facebook. He said received a call early last week from an acquaintance on the mainland warning him not to send the photo.\nLam said that on Thursday, unknown Mandarin-speaking men abducted him from a busy street in Cantonese-speaking Hong Kong and rendered him unconscious. He said they beat him and warned him not to follow through on his plan.\nHe said they also stapled Xs into his thighs because he is Christian. He displayed his wounds to reporters at a press conference Friday, flanked by members of his Democratic Party, before filing a police report and going to a hospital.\nPolice said Tuesday that they arrested Lam on suspicion of providing false information to mislead police after carrying out an investigation, including checking surveillance footage from cameras in the area.\nLam's case stirred concerns that Beijing is tightening its hold on Hong Kong, following other recent cases including the secret detention of a group of Hong Kong booksellers and a Chinese-Canadian tycoon whose whereabouts are unknown. In both cases, mainland security agents are suspected of taking them across the border, in violation of Hong Kong's constitution.\n———\nFollow Kelvin Chan: www.twitter.com/chanman",
    "source_domain": "abcnews.go.com",
    "title": "Hong Kong activist arrested over allegation of stapled legs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/hong-kong-activist-arrested-allegation-stapled-legs-49220720"
}