{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 05:50:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Rescuers pull out 46 bodies after landslide hits north India",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frescuers-pull-46-bodies-landslide-hits-north-india-49199718.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/WireAP_95f5e9b9b4284be6bd4f414a2144af57_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Soldiers and volunteers resumed rescue operations Monday morning after pulling 46 bodies from the mud left by a landslide that trapped two buses and washed away houses in northern India's Himalayan foothills.\nLandslides are common during the heavy rains of India's monsoon season, and the area around Urla village in Himachal Pradesh state has been deforested extensively, increasing its vulnerability to landslides.\nIntermittent rain has been hampering the rescue work and army troops had to stop late Sunday with more rain threatening to cause another landslide, police superintendent Ashok Sharma said Monday.\nSoldiers had managed to pull out 46 bodies from the buses that were covered with rocks and mud.\nTwo buses, two cars and a motorbike had been trapped on a highway by the landslide Sunday, said Mandi district official Sandeep Kadam.\nWith the road blocked in several places, soldiers used shovels and pickaxes to remove rocks, boulders and debris covering the buses and pull out the bodies. Earth-moving equipment was brought in later to speed up the clearing operations.\nSharma, who was overseeing the rescue operations, said the death toll could rise and he did not hold out much hope for survivors. \"One of the buses is buried under nearly 15 meters (50 feet) of mud. It will take us many hours to extricate the bus.\"\nPrime Minister Narendra Modi tweeted his condolences: \"Pained by the loss of lives due to landslide related accidents in (Himachal Pradesh's) Mandi district. My condolences with the families of the deceased.\"",
    "source_domain": "abcnews.go.com",
    "title": "Rescuers pull out 46 bodies after landslide hits north India",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/rescuers-pull-46-bodies-landslide-hits-north-india-49199718"
}