{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 17:03:39+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Belief in the underdog: Four million-dollar bets placed on Eagles in Super Bowl LII",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fbelief-underdog-million-dollar-bets-eagles-super-bowl%2Fstory%3Fid%3D52816688.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0203/dm_180203_ncb_bilas_on_trae_young/dm_180203_ncb_bilas_on_trae_young_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "LAS VEGAS -- With a day to go before kickoff, four reported million-dollar bets have already been placed on Super Bowl LII -- all on the underdog Philadelphia Eagles.\nA bettor on Friday at William Hill placed a $1 million money-line bet on the Eagles at 155 odds. If Philadelphia pulls the upset over the New England Patriots, the unnamed bettor would net a $1,550,000 profit.\nEarlier in the week, William Hill reported taking a $1.6 million bet on the Eagles 4.5 and another $1 million money-line bet on Philadelphia. Last week, MGM's sportsbook reported taking a \"multimillion\" bet on the Eagles.\nIt's not uncommon for million-dollar bets to show up each year on the Super Bowl, but not this many. Last year, for example, only one $1 million bet was reported on Super Bowl LI between the Patriots and the Atlanta Falcons.\nThe Patriots were 4.5-point favorites over the Eagles on Saturday at most sportsbooks. They opened as high as 6-point favorites two weeks ago, but the majority of the early action, especially the largest bets, have been on the Eagles.\nOn Friday night at Caesars Palace sportsbooks, 61.4 percent of the point-spread bets and nearly 70 percent of the money that had been wagered was on the Eagles. The action was even more lopsided at William Hill, where 85 percent of the money on the point spread was on Philadelphia.\nThe largest reported bets on the Patriots were in the six-figure range. MGM vice president of race and sports Jay Rood told ESPN that the largest bet he had taken on the Patriots was a \"mid-six-figure\" money-line bet.\nThe sportsbook at the South Point casino also reported taking a six-figure bet on the Patriots.\nA lot could change leading up to kickoff. Las Vegas bookmakers say as much as 80 percent of the bets will be placed Saturday and Sunday. For right now, though, Las Vegas is rooting for the Patriots.",
    "source_domain": "abcnews.go.com",
    "title": "Belief in the underdog: Four million-dollar bets placed on Eagles in Super Bowl LII",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/belief-underdog-million-dollar-bets-eagles-super-bowl/story?id=52816688"
}