{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 00:19:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Rockies RHP Bettis returns after cancer treatment",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Frockies-rhp-bettis-returns-cancer-treatment-49217022.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_dcc18247dde1492f829f44200574bfcd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Colorado Rockies are thrilled to see Chad Bettis back on the mound after cancer treatment. The prospect of the right-hander helping them in a playoff push, that's a bonus.\nBettis was set to start Monday night at Coors Field in his first major league game since being diagnosed with testicular cancer in November. After undergoing surgery and chemotherapy, he was ready to pitch against Atlanta.\n\"It's really cool with all the stuff he's been through he's back here and ready to go,\" teammate Jon Gray said. \"I can't wait to see him compete.\"\nThe 28-year-old discovered a lump on his testicle last fall and underwent surgery to remove one of his testicles. He passed subsequent follow-up screenings and was healthy enough to report to spring training. But a regular screening on March 10 led to a biopsy being done, which revealed the cancer had spread to his lymph nodes.\nBettis underwent nine weeks of chemotherapy but kept up his conditioning throughout. He was sent on a minor league rehab assignment July 13 and worked his way back to the rotation, much to the pleasure of his team.\n\"Everyone loves him,\" third baseman Nolan Arenado said. \"He tries to help. I always see him in the video room trying to help the young guys. He's just a great teammate.\"\nBettis' return is expected to be emotional but the Rockies are hoping he can boost the staff. He led Colorado in starts (32), wins (14) and innings (186) last season. His best outing was a two-hit shutout against San Francisco on Sept. 5, and he was expected to anchor a young rotation this season before being diagnosed with cancer.\nHe comes back to a team holding onto the second NL wild card spot. Colorado was 21 games above .500 in June but has gone 18-26 since, so getting Bettis back gives the Rockies a chance to strengthen the rotation.\n\"This is a pitcher, when he's throwing well, will have an impact on the game every time he takes the mound,\" manager Bud Black said. \"He wants to be a part of this and make a contribution.\"",
    "source_domain": "abcnews.go.com",
    "title": "Rockies RHP Bettis returns after cancer treatment",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/rockies-rhp-bettis-returns-cancer-treatment-49217022"
}