{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:23:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "NSAC to re-evaluate disciplinary action taken against Conor McGregor",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fnsac-evaluate-disciplinary-action-conor-mcgregor%2Fstory%3Fid%3D45498364.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0214/dm_170214_mma_okamoto_mayweather_mcgregor/dm_170214_mma_okamoto_mayweather_mcgregor_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "LAS VEGAS -- The Nevada State Athletic Commission intends to re-evaluate the disciplinary action it took against UFC lightweight champion Conor McGregor in October.\nMcGregor, 28, met with NSAC Chairman Anthony A. Marnell III and Executive Director Bob Bennett on Tuesday in Las Vegas to discuss his written request for the regulatory body to reconsider its disciplinary order against him.\nPer NSAC protocol, an NSAC chairman has the authority to grant a motion for reconsideration filed by a sanctioned athlete. That motion is then voted on by commission members and, if passed, reopens the case to a new disciplinary hearing.\nMarnell is expected to grant McGregor's request during the commission's monthly meeting in March.\nThe NSAC originally fined McGregor $75,000 and ordered him to produce an anti-bullying public service announcement with a production value of a minimum $75,000. He was also ordered to perform 50 hours of community service.\nThe order stemmed from McGregor's actions during a UFC fight week news conference last August, during which he threw water bottles and drink cans in the direction of his opponent,? Nate Diaz, inside the MGM Grand Hotel and Casino.\nAt the time of his initial disciplinary hearing in October, McGregor, of Dublin, was primarily focused on avoiding any suspension that would have prevented him from a scheduled lightweight title fight at UFC 205 on Nov. 12 in New York.\nShortly after that hearing, UFC president Dana White publicly stated McGregor had informed him that he never wished to fight in the state of Nevada again. McGregor later told RollingStone.com that he didn't see Nevada in his \"foreseeable future.\"\nOn Nov. 18, six days after becoming the first fighter in UFC history to hold titles in multiple weight classes, McGregor filed a formal petition for judicial review of the NSAC's order in Nevada District Court. That case remains open for the time being.\nThe NSAC has undergone changes since McGregor appeared before the commission via conference call in October. Longtime commissioner Pat Lundvall's tenure with the NSAC came to an end in October. Former commissioner Michon Martin is no longer with the NSAC, as well.\nIt's worth noting that Lundvall made the initial motion to fine McGregor $150,000, which amounted to 5 percent of his $3 million purse to fight Diaz at UFC 202. And during deliberations, Martin suggested an even higher fine amount of $300,000, which was ultimately shot down.\nThe NSAC's pending decision to reopen McGregor's disciplinary order could have a direct effect on the recent developments regarding a potential megafight between McGregor and retired pound-for-pound boxing great Floyd Mayweather Jr.\nIn order for that fight to happen in Las Vegas, which is historically Mayweather's preferred location, McGregor would require a professional boxing license. Prior to submitting an application for that license, McGregor would need to settle any outstanding disciplinary orders with the commission.\nDiaz was fined $50,000 for his part in the August incident. Diaz initially stood up from the news conference and began to walk out. As McGregor yelled to him from the stage, Diaz tossed a bottle in his direction, which prompted McGregor to return fire. The $50,000 represented 2.5 percent of Diaz's purse.\nIt's unknown at this time whether Diaz will file a similar request to reopen his disciplinary case with the NSAC, but sources told ESPN.com the commission would likely consider that request as well.\nIt's rare for an athletic commission to reopen a disciplinary case after a sanction has already been voted on. Most recently, and famously, the NSAC reached a settlement with UFC welterweight Nick Diaz in January 2016. After it initially suspended Diaz for five years, the commission reduced his sentence to 18 months.",
    "source_domain": "abcnews.go.com",
    "title": "NSAC to re-evaluate disciplinary action taken against Conor McGregor",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/nsac-evaluate-disciplinary-action-conor-mcgregor/story?id=45498364"
}