{
    "authors": [
        "Abc News",
        "M.L. Nestel",
        "More Michael"
    ],
    "date_download": "2017-08-14 22:47:48+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Timeline: What led to the violence that unfolded in Charlottesville",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Ftimeline-led-violence-unfolded-charlottesville%2Fstory%3Fid%3D49207428.json",
    "image_url": "http://a.abcnews.com/images/Politics/charlottesville-alt-right-protest-01-gty-jef-170812_1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The aftermath of a white nationalist rally in Charlottesville, Virginia, turned deadly on Saturday after a 20-year-old Ohio man allegedly accelerated his car into a crowd of counter-protesters, killing a 32-year-old woman and wounding several others.\nConflict in the college town, however, has been brewing for months. Here's a brief timeline of the events this year that led to this weekend's deadly crash:\nFebruary and March\nThe Charlottesville City Council voted in February to remove a statue of Confederate general Robert E. Lee from what was then called Robert E. Lee Park.\nIn March, some groups filed lawsuits against the Charlottesville City Council in response to the decision, arguing that the city violated a state law that protects war memorials, and violated the terms of the deed in which donor Paul Goodloe McIntire granted the memorial to the city, according to a report by The Associated Press.\nMay 13\nA group of at least 100 white nationalists carried torches in Charlottesville while protesting the removal of the Lee statue, provoking anger and frustration from politicians, and an outcry on social media from those who viewed the display as an attempt to intimidate minorities.\nMike Signer, the city's mayor, expressed his disgust with the protest in an interview with ABC News.\n\"I think it's horrific,\" he said. \"We're a city that proudly values our diversity.\"\nProminent white nationalist Richard Spencer was among the marchers that day.\nJune 5\nSigner announces that Robert E. Lee Park has been renamed Emancipation Park.\nAug. 11\nWhite nationalists holding tiki torches marched through the University of Virginia campus in Charlottesville ahead of the so-called \"Unite the Right\" rally, a gathering of white supremacists staged in part to demand protection for the statue of Lee.\nThe men chanted \"white lives matter,\" \"you will not replace us,\" and the Nazi-associated phrase \"blood and soil.\" Some white nationalists brawled with counter-protesters at the scene of the rally.\nPolice arrived on campus, declared it an unlawful assembly, and ordered the crowds to disperse. But the skirmishes, as well as images of the marching that were posted on social media, contributed to an atmosphere of tension that opened up into violence the next day.\nAug. 12: Morning\nAlthough the \"Unite the Right\" rally was scheduled to start at noon, violence between white nationalists and counter-protesters began in the morning.\nState police reported injuries, and soon after, the city declared an unlawful assembly at Emancipation Park.\nVirginia Gov. Terry McAuliffe declared a state of emergency shortly before noon.\nAug. 12: Afternoon\nAt 1:42 p.m., an Ohio man allegedly rammed a car into a crowd of people who were demonstrating against the white nationalist gathering.\nAbout an hour and a half later, Signer confirmed in a tweet that at least one person had died in the day’s violence. It later emerged that a 32-year-old woman, Heather Heyer, was killed when the car hit the crowd. At least 19 others were injured.\nHours later, President Trump appeared from his Bedminster Golf Club to denounce the violence, but was quickly assailed for not admonishing white nationalist and Nazi groups immediately.\n\"We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides — on many sides,\" the president said. \"It's been going on for a long time in our country. Not Donald Trump. Not Barack Obama. It's been going on for a long, long time.\"\nAug. 12: 5 p.m\nTwo Virginia State Police troopers, Lt. H. Jay Cullen and Trooper-Pilot Berke M.M. Bates, died while lending air support to respond to the deadly violence unfolding in Charlottesville. Their helicopter crashed seven miles southwest of the city.\nAug. 12 to 13\nVigils and marches of solidarity are held throughout the country in remembrance of Heyer and against white nationalism.\nAug. 14\nJames Alex Fields Jr. of Maumee, Ohio, was charged with one count of second degree murder, three counts of malicious wounding and one count of hit-and-run for allegedly plowing into the crowd. The Department of Justice also opened an investigation into the incident.\nBeckoning to criticism for failing to denounce white supremacists or label the Charlottesville car ramming as an act of terrorism, two days after the incident Trump made a strong statement against groups he believed were responsible for Saturday's bloodshed.\n\"Racism is evil,\" Trump said. \"And those who cause violence in its name are criminals and thugs, including the [Ku Klux Klan], neo-Nazis, white supremacists and other hate groups that are repugnant to everything we hold dear as Americans.\"",
    "source_domain": "abcnews.go.com",
    "title": "Timeline: What led to the violence that unfolded in Charlottesville",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/timeline-led-violence-unfolded-charlottesville/story?id=49207428"
}