{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 19:30:42+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpoles-protest-forced-retirements-judges-law-56358164.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_9b64a001f2294ced9e54c71a7cc448b4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Poland's international isolation and political uncertainty at home deepened on Wednesday as a purge of the Supreme Court's justices took effect, with the chief justice defiantly refusing to step down.\nFirst President Malgorzata Gersdorf arrived for work as usual at the court in Warsaw, vowing to continue her constitutionally mandated term, which runs through 2020. The court's judges support this view.\nThousands of anti-government protesters cheered Gersdorf on and vowed to defend the constitutional order and fight what they see as the erosion of their democratic system.\nWhile she was allowed in to the modern glass Supreme Court building in Warsaw and oversaw a meeting with other judges, it was not clear how Gersdorf could continue in her role following a new law that lowers the mandatory retirement age to 65 from the previous 70.\nJaroslaw Kaczynski, the ruling party leader, said in an interview published Wednesday by the Gazeta Polska daily that the judges' \"action\" will result in their \"shameful disaster.\" An adviser to President Andrzej Duda also insisted that Gersdorf has no choice but to step down.\nMeanwhile, Prime Minister Mateusz Morawiecki faced a grilling in the European Parliament for what many European lawmakers see as Poland's violations of democratic standards with a broader overhaul of the judiciary that gives the ruling party vast political control over courts and judges.\nManfred Weber, a German member of the conservative European People's Party group, hailed Poland's great democratic legacy, praising the 10 million Poles who joined Solidarity in the struggle against communism in the 1980s.\n\"Their great achievement — a sovereign, democratic Poland — is at stake today,\" Weber said.\nHe also mentioned the ruling party's transformation of state media into a propaganda tool and the prosecution of peaceful anti-government protesters even as authorities have failed to act against nationalists who had attacked the protests.\nUdo Bullmann, head of the Progressive Alliance of Socialists and Democrats, praised Gersdorf for defending the Polish constitution, and criticized Morawiecki for dismantling \"the last bastion of the judiciary in Poland.\"\nGuy Verhofstadt, president of the Alliance of Liberals and Democrats, said that putting judges under political control was reminiscent of Soviet practices and said Poland should abandon its \"illiberal\" illusions.\n\"I ask you personally, really, to turn the wheel and bring Poland back into the family of democratic nations,\" Verhofstadt told Morawiecki.\nMorawiecki defended the changes the populist Law and Justice party has brought to the justice system, insisting his government is working to make judges more accountable to the democratic will of the people and that Poland's democracy \"has never been as alive as it is today.\"\nThough calm, he did not take the criticism well.\n\"We are a proud nation and we know the price of freedom,\" he said. \"It is not good when proud nations are being lectured to by others, because that produces deadlocks.\"\nSpeaking later to reporters he insisted the forced retirements were \"perfectly in line with the constitution.\"\nIn the debate that was to be dedicated to Europe's future, Morawiecki also got support from some who backed Warsaw's arguments that an overreaching EU was meddling in a sovereign state's internal affairs.\nThe new law lowers the mandatory retirement age from 70 to 65 for the Supreme Court justices. That forces Gersdorf, who is 65, and as many as one-third of the court's 73 sitting judges to step down, unless they obtain from the president a special permission to remain.\nAfter having taken control of common courts and the constitutional court, Law and Justice now takes control of the top court, which handles appeals for all civil and criminal cases and authorizes election results.\nProtesters expressed fears that the party will use its political sway over the court to falsify future elections.\n\"We have the right to live in a free country with a constitution,\" said Monika Czerniakowska, 50. She said once a government violates the constitution, \"anything can happen. Look what's happening in Hungary. How far can we go?\"\nMore protests were held late Wednesday in a number of cities and Lech Walesa, the legendary pro-democracy fighter and Solidarity leader in the 1980s, addressed the cheering crowd in front of the Supreme Court building.\n\"He who breaks the constitution and the division of powers is a criminal, they are criminals,\" he said.\n\"We must do everything to send these people away and vote to choose different people,\" Walesa said, apparently referring to the ruling party.\nOn Wednesday, 63 justices were working, meaning that 10 of the 27 covered by the new legislation have accepted their retirement under the new law, according to the court's press office.\n\"I still hope that the legal order will be restored in Poland,\" Gersdorf said as she arrived at the court.\nThe European Commission, which polices compliance with EU laws, opened an infringement procedure Monday against Poland over the Supreme Court law.\nGovernment critics now are putting their hopes in the EU to preserve the rule of law in their homeland — a message that was reflected in the chants and slogans at the protest.",
    "source_domain": "abcnews.go.com",
    "title": "Poland's isolation deepens as Supreme Court law takes effect",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/poles-protest-forced-retirements-judges-law-56358164"
}