{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:56:06+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Doctors are warning parents of sick children that if they get better and then worse, go to the emergency room.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2F53-children-died-flu-winter-cdc-52809052.json",
    "image_url": "http://a.abcnews.com/images/WNT/180202_wn_osunsami3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 53 children have died from the flu this winter: CDC\nNext to new numbers late today from the CDC, and they are concerning, especially when it comes to children and this deadly flu. Take a look tonight. All those states in red right there, reporting high flu activity, three more added just this week. 42 states now, and 16 more children dying in the past week alone. 53 children lost this season, nearly double this time last queer. Tonight, a warning for parents from the parents who have been through this. Here's ABC's Steve osunsami at the CDC. Reporter: Just when they thought they were about to lose their son to the flu -- Hi, Jackson. Hi, honey. Reporter: This 7-year-old west of Des Moines Iowa opened his eyes and tonight for the first time in a week, jackson Ridout is breathing on his own. He went from being okay ten his deathbed possibly. It's a nasty, nasty virus. Reporter: The numbers tonight from the CDC are alarming 16 more children have died from the flu, so far 53 children this winter. Jackson wasn't vaccinated. His mother wishes she had gotten him a flu shot, but he was sick at the time. This is not something that anyone should ever have to go through, all because of the flu. Reporter: Overall, health officials say the flu is hospitalizing more Americans than ever before. Tonight, about 1 out of every 14 visits to doctors and clinics are for fever, cough and other symptoms of the flu. Doctors warn parents of sick children that if your child gets better and then gets worse, run back to the emergency room. Warning signs of things taking a turn for the worse would be difficulty breathing, a persistent or spike in the fever or being lethargic or difficult to wake up. Those are scary signs for a parent and a reason to call for for the doctor. So let's get to Steve. He is live at the CDC in Atlanta again tonight for us, and the CDC is saying those early results from Canada suggesting that the flu shot is not terribly effective against the most common strain. Might be on the right track, Steve? Reporter: That's right, David, and the Australians are saying the same thing, but the CDC is still saying that the flu shot still helps. That if you get the flu shot and you get sick, your illness will be less severe, David.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "53 children have died from the flu this winter: CDC",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/53-children-died-flu-winter-cdc-52809052"
}