{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:43:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Michael Flynn's resignation: A timeline",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fmichael-flynns-resignation-timeline-45495527.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/michael-flynns-resignation-timeline-45495527",
    "language": "en",
    "localpath": null,
    "maintext": "A timeline of key dates leading to the resignation of White House National Security Adviser Michael Flynn:\nNov. 17 — President-elect Donald Trump offers former military intelligence chief Michael Flynn the job of national security adviser.\nDec. 25 — According to incoming Press Secretary Sean Spicer, Flynn sends a text to Russian Ambassador Sergey Kislyak \"wishing him a Merry Christmas and a Happy New Year\" and saying he looks forward \"to touching base with you and working with you, and I wish you all the best.\" Spicer says the ambassador texted Flynn back, \"wishing him a Merry Christmas as well.\"\nDec. 29 — The United States retaliates against Russian hacking aimed at influencing the U.S. election. President Barack Obama announces sanctions Russian intelligence services and their top officials, kicking out 35 Russian officials and closing down two Russian-owned compounds in the U.S. Flynn texts the ambassador and the two speak by phone. Spicer later says the call was \"centered around the logistics of setting up a call\" between Trump and President Vladimir Putin.\nDec. 30 — Putin announces he won't immediately retaliate against Obama's sanctions, breaking from a pattern of angry denunciations of U.S. penalties. The Russian leader says he plans to restore U.S. ties \"based on the policies that will be carried out by the administration of President D. Trump.\" Trump later praises Putin's restraint on Twitter. \"Great move on delay (by V. Putin) - I always knew he was very smart!\" he writes.\nJan. 13 — A senior U.S. official tells The Associated Press that the Obama administration is aware of contacts between Flynn and Kislyak, including one on Dec. 29. Spicer denies the timing of the call, then later acknowledges it. Spicer says Flynn and Kislyak did not discuss sanctions. They only discussed logistics, he said, \"that was it, plain and simple.\"\nJan. 15 — Vice President Mike Pence repeats that denial in an interview with CBS's \"Face the Nation.\" Flynn and Kislyak \"did not discuss anything having to do with the United States' decision to expel diplomats or impose censure against Russia\" in their conversations, he says.\nJan. 23 — Spicer says in his first scheduled press conference that he'd spoken with Flynn the night before and was assured that the sanctions were not a topic that was discussed in Flynn's calls with Kislyak.\nJan. 26 — The Justice Department informs White House Counsel Don McGahn that the White House denials contradict what intelligence officials knew to be true based on routine recordings of communications with foreign officials who are in the U.S. The White House says Trump and other senior advisers were \"immediately\" informed of the issue. Trump's tasks the White House counsel's office to begin looking into the legal issues involved, Spicer said.\nJan. 28 — Flynn is photographed sitting in the Oval Office as the president speaks with Putin by phone.\nFeb. 1 — Flynn continues to serve in full capacity. He makes a surprise appearance at a daily White House briefing and delivers a message to Iran. \"As of today, we are officially putting Iran on notice,\" he says.\nFeb. 8 — Flynn again denies that he'd discussed sanctions with Kislyak, according to The Washington Post.\nFeb. 9 — Flynn, through his spokesman, backs away from his comments, according to the Post. A spokesman for Flynn tells the paper \"that while he had no recollection of discussing sanctions, he couldn't be certain that the topic never came up.\" Citing U.S. officials, the Post publishes a report stating that Flynn did discuss U.S. sanctions against Russia with Kislyak during the month Trump took office, despite administration officials' denials. The report also suggests Flynn had misled Pence.\nFeb. 10 — Trump is asked about the Post report. \"I haven't seen them. I'll look into them,\" he says. Flynn meets with Pence and speaks with him by phone.\nFeb. 13 — Flynn delivers the president's daily briefing, sits in on his calls with foreign leaders and joins his meetings with Canadian Prime Minister Justin Trudeau. Around 5 p.m., White House adviser Kellyanne Conway tells reporters that the president has \"full confidence\" in Flynn. Less than an hour later, Spicer tells reporters that the president is \"evaluating the situation.\" Shortly after, the Post breaks the news of the earlier Justice Department warning. Flynn submits his resignation. Keith Kellogg is named acting national security adviser. Flynn is spotted waking down the hallway that leads from the Oval Office to his office just after 10 p.m.",
    "source_domain": "abcnews.go.com",
    "title": "Michael Flynn's resignation: A timeline",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/michael-flynns-resignation-timeline-45495527"
}