{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 00:43:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Auriemma and UConn turn attention to winning another title",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fauriemma-uconn-turn-attention-winning-title-45492099.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/auriemma-uconn-turn-attention-winning-title-45492099",
    "language": "en",
    "localpath": null,
    "maintext": "As faux $100 bills adorned with coach Geno Auriemma's face rained down on the sellout crowd at UConn after the team's 100th consecutive win, the Hall of Fame coach waxed poetic about the Huskies' past and present.\nIt's the future though, that he's most interested in.\nWith 100 straight victories in the books, Auriemma and his top-ranked Huskies can turn their attention to the more important streak — a fifth consecutive national championship and 12th overall.\n\"Tonight they carried the torch across the finish line to 100 so to speak, they took the last baton and crossed the finish line,\" Auriemma said after the 66-55 win over South Carolina on Monday. \"If we win the national championship it is all theirs start to finish. I want to focus on trying to do that instead of worrying about all this other stuff. Don't get me wrong, it is a lot of fun, everybody gets a kick out of it, our players, our former players, the fans so I think that is great.\"\nUConn's past was out in full force Monday night. Sitting a few rows behind the Huskies bench was UConn women's basketball royalty with former greats Sue Bird, Tina Charles, Morgan Tuck and Breanna Stewart watching the milestone win.\nThey paved the way for the current success, including Tuck and Stewart being a huge part of the first 75 victories of this current streak.\n\"We're extremely conscious,\" guard Kia Nurse said of the team's history. \"We understand that everything that we have here, all the opportunities we have and the benefits that we have about being this program strictly come from what they've done to build it into what it is today. I think even in practices, when you're dead tired, you can see the banners on the wall with their names and understand that they went through it and they pushed through it and they got this to what it is.\"\nAuriemma's main priority with this team all along is to have them cut down the nets in Dallas in early April. He built this year's schedule — as he does many practices — to test his team, expecting them to fail before solving a challenge. He figured they would take some lumps early before hopefully coming together to make another March run.\nThe funny thing is, the Huskies haven't failed yet, winning their first 25 games against the nation's best. Look down the Top 25 and UConn's already beaten No. 2 Maryland, No. 4s Baylor and Florida State, No. 6 South Carolina, No. 7 Notre Dame and No. 8 Texas.\n\"I'm probably the most surprised person in the country,\" Auriemma said. \"I set the schedule up so that (the streak continuing) wouldn't happen, and it has happened. I'm flabbergasted to a certain extent.\"\nIf that streak continues, they'll enter the NCAAs with 107 consecutive wins. That shouldn't be too hard since the Huskies haven't lost an American Athletic Conference game, going 75-0, since joining a few years back.\nSix wins in the NCAAs would get UConn a 12th national championship. Then talk will turn to how long can the Huskies keep the run going?\nUConn returns six of its seven rotation players and adds transfers Azura Stevens and Batouly Camara. Throw in the nation's top recruiting class and the Huskies could break Wayland Baptist's record of 131 consecutive wins set from 1953-58. Then what? 150 straight? 200 in a row?\nThose numbers may seem crazy, but it's tough to bet against these Huskies right now.\nNotes: The Monday night game drew the highest overnight rating on ESPN2 for any college basketball game this season — men's or women's on that network. It was the highest-rated women's college basketball regular season game since 2010. ... Of the 100 games, 56 have been decided by more than 40 points. Only two (Florida State and Maryland) were fewer than 10-point wins. ... UConn's milestone win drew social media praise from Kobe Bryant and Ellen DeGeneres .\n———\nFollow Doug on Twitter at http://www.twitter.com/dougfeinberg",
    "source_domain": "abcnews.go.com",
    "title": "Auriemma and UConn turn attention to winning another title",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/auriemma-uconn-turn-attention-winning-title-45492099"
}