{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2017-01-02 17:58:57+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "It's been revealed that \"Bachelor\" Nick Viall will see a familiar face during tonight's Season 21 premiere of the hit reality show.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fnick-viall-remembers-night-stand-bachelor-contestant%2Fstory%3Fid%3D44509512.json",
    "image_url": "http://a.abcnews.com/images/GMA/170102_gma_viall2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"Bachelor\" Nick Viall acknowledged that he will see a familiar face during tonight's Season 21 premiere of the hit reality TV show.\nViall stopped by \"Good Morning America\" today and admitted he had a close encounter in the past with Elizabeth \"Liz\" Sandoz, who recently spilled that the pair had a one-night stand.\n\"Oh I definitely remembered, yeah,\" Viall said of when he saw Sandoz on the show. \"At that point, I had already met about 14 other women ... Your head is kind of spinning. And so she came out, I was like 'Huh?' and then she took an interesting approach, which you'll have to watch tonight. But she didn't say her name so the whole time I'm like, 'I'm pretty sure it's you...'\"\nIn an exclusive preview of the season's first episode, Sandoz said she met Viall at the September wedding of Jade Roper and Tanner Tolbert, who met while filming the second season of \"Bachelor in Paradise.\"\n\"And there definitely was a connection and chemistry there and we had sex,\" Sandoz recalls of her encounter with Viall. \"It was just a fun night.\nSandoz said she was unsure if Viall would remember her. The two held hands and were seen hugging in the clip as Viall met her and the 29 other women who will compete for his love.\nViall received some advice from \"Bachelor\" alums, including Desiree Hartsock and Ali Fedotowsky live on \"GMA\" this morning. The 36-year-old said he also gets tips from men formerly on the dating show.\n\"I'm good friends with Chris Soules and Ben Higgins, and they kind of prepped me like, 'It sounds great, but it's really hard because you want to give everyone your attention,'\" he said. \"You want to make sure that they feel comfortable and welcome and they want to get to know you, so you're just trying to remember what you should say, or not say. So, it's hard, and they weren't kidding.\"\n\"The Bachelor\" premieres at 8 p.m. ET on ABC, tonight.",
    "source_domain": "abcnews.go.com",
    "title": "Nick Viall 'Definitely Remembers' One-Night Stand With 'Bachelor' Contestant, He Says",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/nick-viall-remembers-night-stand-bachelor-contestant/story?id=44509512"
}