{
    "authors": [
        "Abc News",
        "Cho Park",
        "Pavni Mittal",
        "More Juju",
        "More Cho",
        "More Pavni"
    ],
    "date_download": "2018-04-24 22:35:48+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "From donkey's milk to snail mucus, \"Nightline\" traveled to the source of exotic ingredients in South Korea to understand the reason behind the popularity of K-Beauty.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fdonkeys-milk-snail-mucus-popular-south-korean-skincare%2Fstory%3Fid%3D54699871.json",
    "image_url": "https://s.abcnews.com/images/International/donkey-01-abc-jef-180424_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Korean beauty products -- otherwise known as K-Beauty -- have taken the internet by storm, popping up on social media posts by celebrities.\nThese viral products and regimen are not only limited to celebrities and beauty bloggers. The latest Korean craze has lined up beauty aisles of big stores like Walmart and Target – a slice of the estimated $7.1 billion K-Beauty market in 2016.\n\"Nightline\" traveled to the source of some of the more exotic ingredients in South Korea to understand the reason behind the popularity of these products.\nABC News\nThirty miles outside Seoul, the fortune of Farmer Lee's donkey farm turned around when the animal’s milk became an important source of a core K-Beauty ingredient – milk.\nHistorically, donkeys were the preferred means of transport for Korean aristocrats because of their slow pace, but today the entire farm is dedicated to producing milk that ends up in beauty products.\nOn this particular farm, donkeys are milked manually after which the milk is immediately frozen. Rumor has it that the milk has so many benefits that even Cleopatra bathed in it.\nAnd, donkeys are not alone.\nABC News\nSnails, which were traditionally used as food, have also made a comeback with Korean beauty companies using snail mucus as an ingredient in some of their most popular products.\nYongho Kim owns a farm with around 300,000 snails whose mucus is extracted very carefully.\n“For two to three days, you don't feed the snail and you clean it - you can't have any waste,” Yongho Kim told “Nightline.” “And then you gently tickle the snail. Then the snail gets mad and it creates mucin.”\nOnce collected, the ingredients are taken to the laboratory to be made into products.\n“Donkey's milk has much more protein than cow's milk, and it is known for its properties for immunity,” a chemist for the Korean beauty company Soo Ae explained to “Nightline.” “Snail mucin is also a very sticky mucus, so it helps create a barrier on your skin to prevent your skin from drying out.”\nABC News\nSome skeptics believe that the craze isn't about the purported benefits of Korean beauty products - rather, it's a successful concerted marketing effort by the Korean government to advertise their products cool and desirable.\n\"The Korean cool concept started out kind of on a lark but it became a government priority and government necessity after the Asian financial crisis,\" Euny Hong, author of \"The Birth of Korean Cool,\" told \"Nightline.\"\nAccording to Hong, the South Korean government realized after the Asian financial crisis in 1997 that by depending on just a few mega-conglomerates like Samsung for the GDP, they were leaving themselves at risk for major economic crises.\n\"If one big company defaults in Korea, everyone is kind of in trouble,\" Hong said. \"And they realized we need other industries. We can't just have these heavy industries, we can't just do semiconductors.\"\nThe South Korean government's solution? Investing into pop culture as a major focus in economic diversification.\n“One of the ideas floated was, why don’t we focus on popular culture because you don’t need a big infrastructure to enter this business? You don’t have to build factories, you just need time and talent,” Hong said.\nThat sparked a national effort by the South Korean government to export culture as an attractive selling point to an outside audience.\n\"They financed the translation of all the dramas at the beginning, and even now they pay for translation into all sorts of obscure languages,\" said Hong.\nThe investment has paid off in not just popularizing Korean dramas, K-Pop, a South Korean music genre and K-Beauty, but in also creating symbiotic relationships between them.\nABC News\nAccording to Hong, K-Pop stars have frequently become brand ambassadors for K-beauty products, which in turn reap benefits for the farmers producing the raw materials in South Korea and beauty companies like Soo Ae, which ships around 10 million face masks a day around the world.\nThe beauty industry has been a form of high interest to South Koreans. According to the International Society of Aesthetic Plastic Surgeons, about one in five South Korean women undergo plastic surgery. With the streets of Seoul lined with hundreds of clinics, the country has emerged as one of the world’s foremost beauty destinations, attracting people from around the globe all flocking to get procedures done.\nWhether it’s pure marketing or the lure of exotic ingredients, people are cashing in, as the K-beauty industry has more than doubled in size between 2014 and 2016 - all contributing to the legend of K-Beauty and its benefits.\nWatch the full story on \"Nightline\" TONIGHT at 12:35 a.m. ET.",
    "source_domain": "abcnews.go.com",
    "title": "Donkey’s milk and snail mucus: How popular South Korean skincare products are made",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Lifestyle/donkeys-milk-snail-mucus-popular-south-korean-skincare/story?id=54699871"
}