{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:48:21+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "PepsiCo's revenue climbs as it sells more drinks, snacks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fpepsico-beats-4q-profit-forecasts-45505021.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/pepsico-beats-4q-profit-forecasts-45505021",
    "language": "en",
    "localpath": null,
    "maintext": "PepsiCo reported a better-than-expected profit for the fourth-quarter as soda and snack sales increased and the company cut costs.\nThe maker of Frito-Lay chips, Mountain Dew soda and Tropicana orange juice said Wednesday that its sales volume rose 3 percent globally for snacks and 1 percent for its beverages. PepsiCo, Coca-Cola and other big packaged food makers are trying to adapt and keep up with changing eating habits.\nPepsiCo Inc., based in Purchase, N.Y., has said that it is working on reducing the amount of sugar it uses for drinks globally.\nFor the quarter ended Dec. 31, the company earned $1.4 billion, or 97 cents per share. Earnings, adjusted for non-recurring costs and restructuring costs, came to $1.20 per share, topping the $1.16 per share analysts expected, according to Zacks Investment Research.\nTotal revenue was $19.52 billion. Wall Street expected $19.6 billion.\nPepsiCo expects full-year earnings to be $5.09 per share, with revenue growth of at least 3 percent after stripping out the impact of currency fluctuations and structural changes.\n—————\nThis story was generated by Automated Insights (http://automatedinsights.com/ap) using data from Zacks Investment Research. Access a Zacks stock report on PEP at https://www.zacks.com/ap/PEP\n—————\nKeywords: PepsiCo, Earnings Report, Priority Earnings",
    "source_domain": "abcnews.go.com",
    "title": "PepsiCo's revenue climbs as it sells more drinks, snacks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/pepsico-beats-4q-profit-forecasts-45505021"
}