{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 10:44:37+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "'Everyone’s hearts are aching': Cities hold vigils in wake of Charlottesville attack",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Feveryones-hearts-aching-cities-hold-vigils-wake-charlottesville%2Fstory%3Fid%3D49199926.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_e515fb01b0784406a4bee6fd723ddf44_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dozens of vigils and demonstrations were held across the country Sunday a day after a woman was killed at an anti-fascist rally in Charlottesville, Virginia.\nThe vigils honored the life of Heather Heyer, who died when a man drove his car into a group of counter protesters on Saturday afternoon, with some calling for action against hate groups.\n\"Really devastated, really disappointed that terrorists came and took over,\" Leah Larsen, a Charlottesville resident told ABC affiliate WRIC on Saunday. \"Everyone’s hearts are aching, just really upset that this is still going on even after we fought wars over this.\"\nHeyer was part of the group that assembled to denounce the \"Unite the Right\" rally held by far-right groups on Saturday. A melee broke out between the two sides followed by the car-ramming that killed Heyer and injured 19 others.\nPolice arrested James Alex Fields, 20, and charged him with second-degree murder in the incident.\nA vigil was also held in Charlottesville at the location where Heyer was killed, and in a number of other U.S. cities.\nMost of the rallies were peaceful, though in Seattle protesters clashed with a previously planned pro-Donald Trump rally. Police dispersed the rally with pepper spray and blast balls after fireworks were thrown at officers, according to the Associated Press. ABC affiliate KOMO in Seattle reported three protesters were arrested.\nHere's a look at a few of of Sunday's gatherings:\nCHARLOTTESVILLE, VIRGINIA\nA post shared by Ryan Burrow (@rburrow1) on Aug 13, 2017 at 9:53am PDT\nIt's a sad day in #charlottesville but also a bright, sunny one with a brilliant blue sky...perhaps to remind us that the sun will come up tomorrow and we all have another chance to be better. A post shared by shawnfitzgerald8 (@shawnfitzgerald8) on Aug 13, 2017 at 9:54am PDT\nSEATTLE\nSeattle police disperse Antifa marchers with spray and flash bangs pic.twitter.com/dJ3WUhuVAI — Katherine Cleland (@kcleland) August 13, 2017\nNEW YORK\nNo one is safe unless everyone is safe. This is Letitia James, public advocate for the city of New York. She is speaking about the violence in Charlottesville and the so very dangerous rhetoric our president is flippantly using to provoke war. #nowar #blacklivesmatter #nonukes #peaceandsanity #indivisiblenationbk thank you! A post shared by Lesley Unruh (@allenunruh) on Aug 13, 2017 at 9:29am PDT\n#EndHate #TheWhiteHouse #Charlottesville #Hallelujah #candles #vigil #respect A post shared by Thorne (@thorne33) on Aug 13, 2017 at 5:54pm PDT\nMIAMI\nSinging \"We shall overcome\" at Miami candlelight vigil in solidarity with Charlottesville #standwithCharlottesville pic.twitter.com/HyyRQ55dpM — United for Unity (@unitedforunity) August 14, 2017\nATLANTA\n\"No Hatred, No Fear, Immigrants are welcomed here!\" #Atl #Atlanta #FILA A post shared by Sokpheap Sar (@tooshort_khmer) on Aug 13, 2017 at 6:15pm PDT",
    "source_domain": "abcnews.go.com",
    "title": "'Everyone’s hearts are aching': Cities hold vigils in wake of Charlottesville violence",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/everyones-hearts-aching-cities-hold-vigils-wake-charlottesville/story?id=49199926"
}