{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 18:12:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "In tax push, Trump's team uses a dubious growth estimate",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ftax-push-trumps-team-dubious-growth-estimate-51720904.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_447563061c2e4811a388396934b98144_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Taxes? Add Taxes as an interest to stay up to date on the latest Taxes news, video, and analysis from ABC News. Add Interest\nThe Treasury Department just gave Republicans ammunition that their tax cuts would pay for themselves.\nBut the one-page memo relies on a mathematical gimmick: It includes an assumption that tax cuts and other Trump administration policies would cause the economy to expand at a 2.9 percent annual pace over 10 years. Economic growth at that level would, in theory, be enough to keep the national debt from rising.\nBut most analyses have concluded that the Senate tax overhaul would add at least $1 trillion to budget deficits in the next decade because the analyses foresee significantly less growth resulting from the tax cuts.\nThe Treasury Department report enables President Donald Trump to claim that the Senate tax overhaul would pay for itself, even though outside analyses show otherwise.\nWhen the same report tries to estimate how much growth the tax cuts would actually produce, it also finds that the national debt would likely increase by at least $1 trillion during the next decade.\nMany economists and tax experts were quick to dismiss the Treasury memo.\n\"It's a joke,\" David Kamin, a law professor at New York University and former economic policy aide in the Obama White House, said on Twitter.\nSen. Ron Wyden, the ranking Democrat on the Senate Finance Committee, said, \"It's no more than a thinly veiled attempt by the Trump administration to cover up an economic agenda that showers corporations with goodies while taking money and health care away from those who need it most.\"\nMost economic analyses — including one by Congress' Joint Committee on Taxation — assume that the tax cuts would cause the debt to rise significantly because the cuts would fail to deliver significantly faster growth.\nAn analysis of the Senate plan released Monday by the nonpartisan Tax Policy Center found that even after factoring in additional economic growth, deficits would rise by $1.5 trillion over the next 10 years when including the additional interest costs.\nA separate analysis by the Penn Wharton Budget Model found a similarly sized increase in budget deficits.\nNone of the top academic economists surveyed by the University of Chicago said the tax cuts would likely generate enough growth to pay for themselves.\nThe Treasury Department report, though, might provide a tool for Republican lawmakers to sell to a skeptical public tax cuts that largely help corporations and the wealthy. Both Senate Majority Leader Mitch McConnell and House Speaker Paul Ryan have said that the tax cuts wouldn't add to budget deficits.",
    "source_domain": "abcnews.go.com",
    "title": "In tax push, Trump's team uses a dubious growth estimate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/tax-push-trumps-team-dubious-growth-estimate-51720904"
}