{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2017-06-15 08:58:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Why Daphne Oz didn't tell her kids about their grandfather's death",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fdaphne-oz-explains-kids-father-laws-death%2Fstory%3Fid%3D47967884.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-daphne-oz-jt-1706111_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Father's Day is never easy for those who have lost their fathers.\n\"The Chew\" co-host Daphne Oz announced on Instagram last February that her family was \"heartbroken\" after losing her father-in-law Sretko Dimitric to cancer.\nOz, 31, has been married to John Jovanovic since 2010. The couple has two children and recently announced they're expecting a third -- a baby girl -- next year.\n“ ” We didn’t tell them because they feel too young...\nThe eldest child of Dr. Oz told ABC News that this Father's Day she and her husband plan to keep Dimitric's \"memory alive for as much as we can.\"\nIt may feel like business as usual for her two children -- 3-year-old Philomena and 1-year-old Jovan -- since Oz hasn't broken the news that their grandfather passed away.\n\"We didn’t tell them because they feel too young to really talk about that so we talk about him all the time,\" Oz explained of her decision. \"And that’s probably what we’ll do on Father’s Day too -- just remember him.\"\nA post shared by D A P H N E O Z (@daphneoz) on May 29, 2017 at 6:47pm PDT\nOz, who is the face of the public awareness campaign TurnAfter2, which reminds parents to keep their children rear-facing in car seats until they're 2 years old, doesn't care if other parents don't understand her decision.\n\"The Happy Cook\" author said she's dealt with many judgmental parents, especially on social media.\n\"I have gone through phases where I go through every comment [and it] warrants a response and then I’m like, 'My God, I don't need to justify to you how I choose to spend my time, or how much I love my kids; how much I love my family,\" she said.\nas a mom, it can be hard to keep track of changing safety protocols. I’ve partnered with @chicco.usa to take the guesswork out of one important issue – how long to keep your child rear-facing in the car. #TurnAfter2 is an easy way to remember to only turn your child forward-facing AFTER their second birthday. learn more at TurnAfter2.com #AD ??? A post shared by D A P H N E O Z (@daphneoz) on May 15, 2017 at 9:47am PDT\nShe also recalled what her own father has taught her over the years.\n\"He’s endlessly curious,\" she gushed. \"As his child, we were always very aware that he'd outwork everybody else. [He'd always say], 'Talent means nothing if you’re not willing to work hard.'\"",
    "source_domain": "abcnews.go.com",
    "title": "Daphne Oz explains why she didn't tell her kids about her father-in-law's death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/daphne-oz-explains-kids-father-laws-death/story?id=47967884"
}