{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:59:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Review: A questionable murder derails 'Rough Night' fun",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Freview-questionable-murder-derails-rough-night-fun-48035213.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_9e9e2ba73ae842bb8f28ca743cf74cd8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In \" Rough Night \" four women on a wild and crazy bachelorette weekend in Miami accidentally kill a guy and try to get away with it.\nYou know it's coming. It's right there in the trailer. In the middle of the party, Jillian Bell's coked out character runs full speed toward a male stripper to straddle him and inadvertently knocks the guy over. As his seat falls back, his head cracks into the sharp edged fireplace ledge behind him.\nWhat the trailer doesn't show is the reddish black blood oozing out from the dead guy's head onto the white tile floor. Have I mentioned this is a comedy? Was the trailer warning us about this moment so we could be prepared? Or was it selling it as part of the laughs?\nOthers have tried to venture into this questionable terrain before, like the insanely awful \"Very Bad Things,\" in which the dead stripper is referred to as a \"105 pound problem.\" Comedies are welcome to test our moral flexibility, but it was extremely hard to get on board with the privileged cover-up antics of the \"Rough Night\" crew after the man bleeds out — no matter what narrative gymnastics they try to concoct to make it OK. Not even \"Weekend At Bernie's\" had the gall to make the protagonists the murderers.\nThe thing is, there is a lot of funny in \"Rough Night,\" the directorial debut of Lucia Aniello, who wrote the script with her partner Paul W. Downs (he also plays the straight-laced fianc? of Scarlett Johansson's character). The comedy duo has the chops to make something wild and great — they've worked as co-producers and writers on the wonderfully manic millennial friendship comedy \"Broad City,\" which Aniello also directs occasionally.\nFor \"Rough Night\" they assembled a great (and brilliantly random) cast, including \"Broad City's\" salty star Ilana Glazer, Saturday Night Live's pinch-hitter Kate McKinnon, the fearless up-and-comer Bell and the wonderfully versatile Zoe Kravitz. They're put in an initial situation that's both relatable (college friends reuniting years later for a bachelorette) and gives room for things to get out of control (just add some cocaine, missed connections and a pair of crazy neighbors in Demi Moore and Ty Burrell). But it lacks \"Broad City's\" delicious edge and deranged specificity in favor of something more broad and generic.\nWe meet the girls briefly in college. Jess (Johansson), Alice (Bell), Blair (Kravitz) and Frankie (Glazer) are inseparable and unapologetically sloshed at a frat party owning a game of beer pong.\nCut to few years later and they've gone their separate ways and grown up, sort of. Jess is even running for office, sporting a politician crop and dowdy wares. There's a great bit between her and her campaign staff about the reasons she's lagging in the polls.\nThat most have evolved beyond their college selves makes the reunion feel a little bit like forced joy at the outset. But that's a good thing, and you find yourself cringing and laughing in equal measure as they negotiate how the weekend is going to go. Things take a turn, too, when Jess' friend Pippa (McKinnon, affecting an Australian accent) from a semester abroad shows up — throwing Alice into a jealousy spiral. But then the stripper comes, and dies, and it's excruciatingly hard to care or worry about whether or not they're going to get away with it, let alone how the friendship is going to survive this trial.\nThere are some wild moments that come after, and some of them are fun (watch out for the \"sad astronaut\"). I just wish they weren't in service of a throwaway gimmick that is too dark to stomach.\n\"Rough Night,\" a Sony Pictures release, is rated R by the Motion Picture Association of America for \"crude sexual content, language throughout, drug use and brief bloody images.\" Running time: 101 minutes. Two stars out of four.\n———\nMPAA Definition of R: Restricted. Under 17 requires accompanying parent or adult guardian.\n———\nFollow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr",
    "source_domain": "abcnews.go.com",
    "title": "Review: A questionable murder derails 'Rough Night' fun",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/review-questionable-murder-derails-rough-night-fun-48035213"
}