{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 07:53:06+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Citing religious freedom, Trump backing off Obama-era rules",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fciting-religious-freedom-trump-backing-off-obama-era-50339795.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_f2f4e2fb71ca47f3970d4aa8a43d1735_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In a one-two punch elating religious conservatives, President Donald Trump's administration is allowing more employers to opt out of no-cost birth control for workers and issuing sweeping religious-freedom directions that could override many anti-discrimination protections for LGBT people and others.\nAt a time when Trump finds himself embattled on many fronts, the two directives — issued almost simultaneously on Friday — demonstrated the president's eagerness to retain the loyalty of social conservatives who make up a key part of his base. Leaders of that constituency were exultant.\n\"President Trump is demonstrating his commitment to undoing the anti-faith policies of the previous administration and restoring true religious freedom,\" said Tony Perkins, president of the Family Research Council.\nLiberal advocacy groups, including those supporting LGBT and reproductive rights, were outraged.\n\"The Trump administration is saying to employers, 'If you want to discriminate, we have your back,'\" said Fatima Goss Graves, president of National Women's Law Center.\nHer organization is among several that are planning to challenge the birth-control rollback in court. The American Civil Liberties Union filed such a lawsuit less than three hours after the rules were issued.\n\"The Trump administration is forcing women to pay for their boss' religious beliefs,\" said ACLU senior staff attorney Brigitte Amiri. \"We're filing this lawsuit because the federal government cannot authorize discrimination against women in the name of religion or otherwise.\"\nThe Democratic attorneys general of California and Massachusetts filed similar suits later Friday.\nBoth directives had been in the works for months, with activists on both sides of a culture war on edge about the timing and the details.\nThe religious-liberty directive, issued by Attorney General Jeff Sessions, instructs federal agencies to do as much as possible to accommodate those who claim their religious freedoms are being violated. The guidance effectively lifts a burden from religious objectors to prove that their beliefs about marriage or other topics that affect various actions are sincerely held.\n\"Except in the narrowest circumstances, no one should be forced to choose between living out his or her faith and complying with the law,\" Sessions wrote.\nIn what is likely to be one of the more contested aspects of the document, the Justice Department states that religious organizations can hire workers based on religious beliefs and an employee's willingness \"to adhere to a code of conduct.\" Many conservative Christian schools and faith-based agencies require employees to adhere to moral codes that ban sex outside marriage and same-sex relationships, among other behavior.\nThe Alliance Defending Freedom, a conservative Christian law firm, called it \"a great day for religious freedom.\" But JoDee Winterhof of the Human Rights Campaign, a national LGBT-rights group, depicted the two directives as \"an all-out assault, on women, LGBT people and others\" as the administration fulfilled a \"wish list\" of the religious right.\nThe new policy on contraception, issued by the Department of Health and Human Services, allows more categories of employers, including publicly traded companies, to opt out of providing no-cost birth control to women by claiming religious or moral objections — another step in rolling back President Barack Obama's health care law that required most companies to cover birth control at no additional cost.\nEmployers with religious or moral qualms will also be able to cover some birth control methods, and not others. Experts said that could interfere with efforts to promote modern long-acting implantable contraceptives, such as IUDs, which are more expensive.\nThe top Democrat in the House of Representatives, Minority Leader Nancy Pelosi, said the birth-control rollback was despicable.\n\"This administration's contempt for women reaches a new low with this appalling decision to enable employers and health plans to deny women basic coverage for contraception,\" she said.\nOn the Republican side, however, House Speaker Paul Ryan welcomed the decision, calling it \"a landmark day for religious liberty.\"\nThe new policy took effect on Friday, but its impact won't be known immediately and may not be dramatic.\n\"I can't imagine that many employers are going to be willing to certify that they have a moral objection to standard birth control methods,\" said Dan Mendelson, president of the consulting firm Avalere Health.\nNonetheless, he worried that the new rules would set a precedent for undermining basic health benefits required under federal law. The administration has estimated that some 200 employers who have already voiced objections to the Obama-era policy would qualify for the expanded opt-out, and that 120,000 women would be affected.\nSince contraception became a covered preventive benefit, the share of female employees paying with their own money for birth control pills has plunged to 3 percent, according to the Kaiser Family Foundation.\nMany Catholic hospitals now rely on an Obama-era workaround under which the government pays for the cost of birth control coverage. That workaround can continue under the new rules.\nDespite that workaround, there have been extensive legal battles waged by religious institutions and other parties challenging the birth-control mandate. The U.S. Conference of Catholic Bishops hailed the new policy as a \"return to common sense\" that would enhance \"peaceful coexistence\" between church and state.\nDoctors' groups that were instrumental in derailing Republican plans to repeal Obama's health law outright expressed their dismay.\nThe American Congress of Obstetricians and Gynecologists said the new policy could reverse the recent progress in lowering the nation's rate of unintended pregnancies.\n\"Instead of fulfilling its mission 'to enhance and protect the health and well-being of all Americans,' HHS leaders under the current administration are focused on turning back the clock on women's health,\" said the organization's president, Dr. Haywood Brown.\n———\nCrary reported from New York. Associated Press writers Sadie Gurman and Eric Tucker in Washington and Religion Writer Rachel Zoll in New York contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Citing religious freedom, Trump backing off Obama-era rules",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/citing-religious-freedom-trump-backing-off-obama-era-50339795"
}