{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 00:03:40+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fsex-city-star-cynthia-nixon-running-governor-53855344.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/WireAP_dcd1407392b94f9b92215cbc7da1ba2d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Former \"Sex and the City\" star Cynthia Nixon is running for New York governor.\nAfter flirting with a run for months, Nixon tweeted Monday that she will challenge Gov. Andrew Cuomo in New York's Democratic primary in September.\nIt sets up a longshot bid pitting an openly gay liberal activist who has never held political office against a two-term incumbent with a $30 million war chest and possible presidential ambitions.\nHer campaign website said Nixon won't accept any corporate contributions and will limit contributions from any individual or organization to $65,100 for the election cycle.\n\"We want our government to work again. On health care, ending massive incarceration, fixing our broken subway,\" Nixon said in a video announcing her candidacy . \"We are sick of politicians who care more about headlines and power than they do about us.\"\nNixon has her work cut out for her. A Siena College poll released Monday showed Cuomo leading her 66 percent to 19 percent among registered Democrats, and by a similar margin among self-identified liberals. Nixon did a little better among younger and upstate Democrats but didn't have more than a quarter of either group.\nThe poll of 772 registered voters was conducted March 11-16. The margin of error is plus or minus 4 percentage points.\nNixon in recent months has given speeches and interviews calling on Democrats nationally to run \"bluer\" in 2018 and carve out a strong, progressive liberal identity rather than being merely \"the anti-Trump party.\"\n\"It could be a fight for the soul of the Democratic Party in some sense,\" said Baruch College political scientist Douglas Muzzio.\nNixon, a 51-year-old Manhattan mother of three, is a longtime advocate for fairness in public school funding and fervent supporter of Democratic New York City Mayor Bill de Blasio, who has frequently clashed with Cuomo on a range of issues. Her video shows her with her young son Max as she talks about being a proud public school parent.\nLast month, at the annual New York gala of Human Rights Campaign, which has endorsed Cuomo, she took a backhanded stab at the governor's record: \"For all the pride that we take here in being such a blue state, New York has the single worst income inequality of any state in the country.\"\nA Cuomo campaign spokesman said the governor \"has delivered more real progressive wins than any other Democrat in the country,\" including legalizing gay marriage, tightening gun restrictions, raising the minimum wage, expanding public education funding and banning fracking.\nThe 60-year-old Cuomo recently mocked the celebrity status the Grammy, Emmy and Tony winner could bring to the race.\n\"Normally name recognition is relevant when it has some connection to the endeavor,\" Cuomo said earlier this month. \"If it was just about name recognition, then I'm hoping that Brad Pitt and Angelina Jolie and Billy Joel don't get into the race.\"\nWhile Nixon has strong political connections and name recognition in the city that was the backdrop for her Emmy Award-winning role as lawyer Miranda Hobbes in the HBO comedy \"Sex and the City,\" her star power among upstate voters is less certain.\nJefrey Pollock, pollster and political adviser to Cuomo and other prominent Democrats, said that celebrity isn't likely to trump governing experience in the voting booth.\n\"Over and over in our research, Democratic primary voters say they're not looking for an outsider because they look to Washington, D.C., and see what the outsider has meant to this country,\" Pollock said.\nThe first task for Nixon, Muzzio said, is to launch a listening and talking tour.\n\"She can't be the celebrity glamour girl,\" he said. \"She's got to get out there and get exposure upstate.\"\nNixon won't be the only celebrity candidate on the New York ballot. Former \"Law and Order: SVU\" actress Diane Neal is running for Congress as an independent in a Hudson Valley district.\n———\nThis story has been corrected to show the child in the video is Nixon's son, not daughter.",
    "source_domain": "abcnews.go.com",
    "title": "'Sex and the City' star Cynthia Nixon running for governor",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/sex-city-star-cynthia-nixon-running-governor-53855344"
}