{
    "authors": [
        "Abc News",
        "More Andrea"
    ],
    "date_download": "2018-03-19 20:16:04+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The three victims were killed on March 9.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmemorial-held-veterans-home-shooting-victims%2Fstory%3Fid%3D53849866.json",
    "image_url": "https://s.abcnews.com/images/US/yountville-veterans-home-05-pol-jc-180309_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A memorial will be held today for three women killed at a California veterans home on March 9, according to ABC station KGO in San Francisco.\nThe victims were the Yountville home's executive director Christine Loeber, 48; clinical director Jennifer Golick, 42; and psychologist Jennifer Gonzales Shushereba, 32, who was six months pregnant. They were allegedly killed by Army veteran Albert Wong, 36, who later took his own life.\n\"[The event] will be a solemn and respectful honoring of the lives and contributions of the three brave women who lost their lives at The Pathway Home; an opportunity for family members, friends, and community to grieve together; and a moment to thank all of those who support our nation's veterans, especially in the area of mental health,\" the organizers of the event told KGO.\nThe memorial, which will be held at the Napa Valley Performing Arts Center at Lincoln Theater, is open to the public, and will have dignitaries and therapy dogs onsite.\n\"Beta and myself, as well as several other service dogs and their companions and handlers will be here at the services Monday night, just in case people need an extra little hug,\" said Linda Powers, comfort dog handler, to KGO.\nFamilies of at least two of the victims will be in attendance, KGO reported.\nMuir Wood Adolescent and Family Services via AP\nGolick was a therapist, wife and mother to a 7-year-old daughter, reported KGO.\nPsychArmor Institute via AP\nShushereba's husband told KGO his wife would \"always be remembered for her unconditional love and incredibly giving heart.\"\nTom Turner via AP\nLoeber dedicated her life to helping veterans heal, reported KGO.\nThe Pathway Home called the victims \"brave\" and \"accomplished.\"\n\"These brave women were accomplished professionals who dedicated their careers to serving our nation's veterans and working closely with those in the greatest need of attention after deployments in Iraq and Afghanistan,\" said a statement obtained by ABC station KGO in San Francisco. \"All of us at The Pathway Home are devastated by today's events. We stand with the families, friends, and colleagues who share in this terrible loss.\"\nAuthorities said the suspected gunman had been treated for PTSD at the same veterans home.",
    "source_domain": "abcnews.go.com",
    "title": "Memorial to be held for veterans home shooting victims",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/memorial-held-veterans-home-shooting-victims/story?id=53849866"
}