{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2018-03-19 20:57:37+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Legal-defense group asks governor to investigate handling of 2015 case.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fharvey-weinstein-probe-mishandled-prosecutor-times-claims-calling%2Fstory%3Fid%3D53849524.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/harvey-weinstein-rt-thg-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Time's Up, an advocacy and legal-defense group fighting sexual harassment in Hollywood and beyond, wants New York Gov. Andrew Cuomo to investigate why a prominent prosecutor decided against prosecuting Harvey Weinstein in 2015, two years before dozens of allegations of sexual misconduct and assault against the producer became public.\nThe open letter, which was exclusively obtained and published by New York magazine's The Cut, calls on Cuomo to \"launch an independent investigation of the New York County District Attorney, Cyrus Vance, and the office of the District Attorney to determine the facts related to the decision not to prosecute Harvey Weinstein for sexual abuse crimes against one of his accusers, Ambra Battilana [Gutierrez].\"\nGutierrez, a Filipina-Italian model, got Weinstein on audio in March 2015 allegedly admitting to groping her, according to a New York magazine article referenced in the Time's Up letter. The audio recording was part of a sting operation led by the New York Police Department.\nOn the tape, Weinstein tries to convince her to come into his room, and only after almost two minutes of back-and-forth in the hallway does Weinstein finally end his efforts to get her to stay, New York magazine reported.\nSpencer Platt/Getty Images, FILE\nTime's Up's open letter to the New York governor focuses on a New York magazine's report suggesting that the district attorney's office may have mishandled the case against Weinstein at the time.\n\"Reports that District Attorney Cyrus Vance could have been improperly influenced by Mr. Weinstein and/or his representatives, and that senior officials within the DA’s office may have sought to intimidate Battilana are particularly disturbing and merit investigation,\" the letter said.\n\"Similarly, reports that the New York Police Department chose to isolate Battilana from Vance’s staff because they feared his office was actively working to discredit her story demand immediate scrutiny,\" the letter continued.\nGutierrez said previously about her experience with Weinstein, “There were two years where I lost a lot in my life, but I wanted to help others. I’m happy now no one will suffer anymore.”\nRobyn Beck/AFP/Getty Images, FILE\nABC News reached out to Gutierrez today, but didn't immediately hear back.\nThe district attorney’s office told ABC News that the New York magazine article “bears little resemblance to the facts.”\n“The Manhattan DA's pioneering sex crimes unit – the first of its kind in the country – has been a national leader in the investigation and prosecution of sexual assaults committed by perpetrators of all backgrounds since the 1970s,” the statement continued. “The idea that our office would shrink from the challenge of prosecuting a powerful man is belied by our daily work and unparalleled record of success on behalf of sexual assault survivors.”\nThe statement went on to describe the different roles of prosecutors and police, concluding that because of current, active investigations of Weinstein, the prosecutor’s office can’t comment further.\n“ ” There were two years where I lost a lot in my life, but I wanted to help others. I’m happy now no one will suffer anymore.\nABC News also reached out to representatives for Gov. Cuomo and the NYPD but didn’t immediately hear back.\nWeinstein's lawyer, Ben Brafman, in a statement to ABC News slammed the New York magazine report on Gutierrez.\n\"We are stunned that NY Magazine chose to report on the claim\" by Gutierrez against Weinstein without noting that in a sworn affidavit she 'stated in substance that her complaint against Harvey was the result of a misunderstanding and that her decision to report the incident to the police, was attributed by her to 'bad advice' she received,\" Brafman said in his statement.\nAndrew Burton/Getty Images, FILE\nThe NYPD said the 2015 case against Weinstein was never prosecuted, New York magazine reported.\nAnd according to the New Yorker magazine, after the district attorney’s office decided not to press charges, Gutierrez \"signed a highly restrictive nondisclosure agreement\" with Weinstein in addition to the affidavit.\nTime's Up's letter said that if Weinstein had been successfully prosecuted in 2015, other women might have been spared his alleged sexual misconduct.\nJohn Carucci/AP\n\"Arguably his continued victimization of others could have been avoided,\" the letter said.\nWeinstein, 66, has been accused by dozens of women of sexual misconduct, including rape. Though the former movie mogul has apologized for his behavior and sought professional help, a spokeswoman for him has told ABC News that \"any allegations of nonconsensual sex are unequivocally denied by Mr. Weinstein.\"\nFollowing publicity on the allegations, Weinstein was fired from The Weinstein Company, banned from the Producer's Guild of America and expelled from the Academy of Motion Picture Arts and Sciences.\nSabina Ghebremedhin and Aaron Katersky contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Harvey Weinstein probe may have been mishandled by prosecutor, Time's Up claims, calling for action",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/harvey-weinstein-probe-mishandled-prosecutor-times-claims-calling/story?id=53849524"
}