{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 06:20:50+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Chad Bettis throws 7 scoreless innings in return from cancer treatment",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fchad-bettis-throws-scoreless-innings-return-cancer-treatment%2Fstory%3Fid%3D49220294.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170814_mlb_bettis_return_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chad Bettis had trouble controlling his emotions as he took the mound for the first time since cancer treatment. He had no trouble controlling the Atlanta Braves' lineup.\nBettis threw seven impressive innings in his season debut Monday, thrilling the crowd as the Colorado Rockies beat the Braves 3-0 on a feel-good night at Coors Field.\nBettis scattered six hits, walked none and struck out two. He hadn't pitched in the majors since being diagnosed with testicular cancer in November.\n\"I don't think I was in tune to what was going on until the fifth,\" Bettis said. \"So many emotions. I was trying to get them under control. It was taking much longer than what was expected.\"\nBettis had surgery for the condition, but tests in March showed the cancer had spread to his lymph nodes. He later underwent chemotherapy.\nThe journey to get back to the rotation was on his mind all day, but he was able to harness his emotions and put together a strong outing.\n\"From what everybody has told me about this fella, seeing what he did tonight didn't surprise me,\" first-year Rockies manager Bud Black said. \"I'm sure it was emotional for him, his family, the people who he's close to, people with cancer that follow his path.\"\nThe 33,641 fans at Coors Field were cheering for Bettis before he threw his first major league pitch of 2017. The crowd rose as he walked in from the bullpen before the start, and gave a big cheer as he went out to pitch the first inning.\n\"You try to get your mind clear because of the task at hand, and then to be hit with that emotion, it was unbelievable,\" Bettis said. \"Walking in, it was deep breaths.\"\nAsked about trying not to think too much about this start in the days leading up to it, Bettis said, \"It crept in this morning, when I woke up. Just thinking about everything that happened, everything my family and I have been through ... I was holding back tears until the start.\"\nReality hit in a hurry when Ender Inciarte led off with a triple past a diving Gerardo Parra in left, but Inciarte was thrown out trying to stretch it to an inside-the-park home run.\n\"It went from being incredibly high to, 'Oh no, we're about to be down 1-0.' I've never had a problem with guys laying out,\" Bettis said. \"Parra tried to make a spectacular play and ended up still making a spectacular play.\"\nThe 28-year-old Bettis settled into a pitchers' duel with Atlanta starter Julio Teheran and pitched the way he did last year when he led Colorado in starts (32), wins (14) and innings (186). Bettis left for a pinch hitter in the seventh with the game still scoreless.\nBettis said he never had any doubt that he would return.\n\"The question was when was it going to be and what would it look like,\" said Bettis. \"Was I going to be in the bullpen helping them back there, or was I going to be able to start.\n\"So the fact that I'm able to start again is exciting.\"\nColorado scored three times in the eighth off Rex Brothers (2-3), who relieved Teheran. The Rockies are tied with? Arizona?for the top NL wild card.\n\"You hate not to get that one for [Teheran],\" Brothers said.\nMike Dunn (5-1) got the win and Greg Holland closed for his 35th save. Holland, who had blown his previous two save chances, gave up a single and a walk in the ninth before getting the last out.\nTeheran allowed four hits and struck out eight in seven innings.\n\"I've been working to try and get back on track and today I feel like I had my best, like the old Julio Teheran that we're used to seeing,\" he said.\nCharlie Blackmon led off the Colorado eighth with a triple. After an intentional walk, Parra singled through the drawn-in infield to put the Rockies ahead.\nCarlos Gonzalez's two-run single off Jason Motte provided some insurance.\nTRAINER'S ROOM\nBraves: OF Matt Kemp (right hamstring strain) did some running and is scheduled to do more Wednesday. He will take Thursday off but could play Friday against? Cincinnati.\nRockies: OF-1B Ian Desmond (right calf strain) did some hitting and running on Colorado's recent road trip.\nCRISIS AVERTED\nThe Rockies got a scare Sunday when All-Star 3B Nolan Arenado, who leads the majors with 100 RBIs, left the game in? Miami?after being hit on the left hand with a pitch. He and the team feared he broke a bone but X-rays showed only a bruise.\n\"I was a little surprised. I thought I broke it,\" Arenado said Monday. \"It got super tight right after. Last time I broke my finger, and I've broken bones before, it gets super tight and it usually comes out broken.\"\nArenado didn't start but he pinch hit in the seventh, fouling out to first.\n\"I'm good to go. It hurts, but I've dealt with worse pain,\" he said. \"It's not as swollen as we thought it was going to be. It's just pain tolerance.\"\nBAYLOR TRIBUTE\nBefore the game, the Rockies honored Don Baylor, the club's first manager, with a video tribute and a moment of silence. Baylor, who managed Colorado for its first six seasons, died last week at age 68 after a 14-year battle with multiple myeloma. The Rockies hung his jersey in their dugout.\nUP NEXT\nBraves: LHP Sean Newcomb (1-7, 4.45 ERA) will make his 12th start of the season Tuesday.\nRockies: LHP Kyle Freeland (11-7, 3.70) returns from a left groin strain to make his first career start against? Atlanta.\nInformation from The Associated Press was used in this report.",
    "source_domain": "abcnews.go.com",
    "title": "Chad Bettis throws 7 scoreless innings in return from cancer treatment",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/chad-bettis-throws-scoreless-innings-return-cancer-treatment/story?id=49220294"
}