{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 04:55:16+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fchinas-premier-promises-wider-opening-economy-53865342.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_672c250cb60243fab4241b6faee2ba93_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Premier Li Keqiang said Tuesday that China doesn't want to see a \"trade war\" with the United States and hopes to reach a negotiated settlement of disputes.\nSpeaking at a nationally televised news conference, Li said rash action would hurt all sides. He made no mention of a possible Chinese response to any increase in U.S. import controls.\nBeijing faces mounting pressure from the government of U.S. President Donald Trump over complaints it hampers access to its markets, pressures foreign companies to hand over technology and is flooding foreign markets with unfairly low-priced steel and other goods.\nThat has prompted concern possible U.S. import controls might set off a cycle of retaliation by Beijing and other governments.\n\"No one will emerge a winner from a trade war,\" said Li. He said that would be contrary to trade rules based on negotiation and dialogue and would damage a mutually beneficial U.S.-Chinese trading relationship.\n\"What we hope is for us to act rationally rather than being led by emotions,\" he said. \"We don't want to see a trade war.\"\nChinese trade officials said earlier that Beijing was ready to respond, though they gave no details. Business groups have suggested they could target U.S. exports of jetliners, soybeans and other goods for which China is a major market.\nAsked whether Beijing might use its large holdings of U.S. government debt as leverage in a dispute, the premier said China's investments are based on market principles and \"China will remain a responsible long-term investor.\"\nAlso Tuesday, Li promised China \"will open even wider\" to imports and investment and will fully open manufacturing industries to foreign competitors.\nBeijing plans to eliminate import tariffs on drugs and slash duties on consumer goods, said Li. He said the country will \"fully open the manufacturing sector,\" with better protection for intellectual property.\nChinese leaders are moving to make their slowing, state-dominated economy more productive. They have promised to open more industries to private and foreign competition, but business groups complain they are moving too slowly.\n\"If there is one thing that will be different from the past, that will be that China will open even wider,\" said Li.\nBeijing plans to \"further bring down overall tariffs,\" with \"zero tariffs for drugs, especially much-needed anti-cancer drugs,\" the premier said.\n\"We will also fully open the manufacturing sector,\" said Li. \"There will be no mandatory requirement for technology transfers and intellectual property rights will be better protected.\"\nBeijing faces complaints it violates its market-opening commitments by requiring automakers and other foreign companies to hand over technology to potential Chinese competitors. Washington is investigating whether Beijing is acting improperly, a probe American officials have suggested might lead to trade penalties.",
    "source_domain": "abcnews.go.com",
    "title": "China's premier: 'We don't want to see a trade war'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/chinas-premier-promises-wider-opening-economy-53865342"
}