{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-07-04 20:52:43+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The employee texted saying she wouldn't be able to make her next shift.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FNews%2Fcompany-fires-manager-heartless-response-worker-son-life%2Fstory%3Fid%3D56364209.json",
    "image_url": "https://abcnews.go.com/News/company-fires-manager-heartless-response-worker-son-life/story?id=56364209",
    "language": "en",
    "localpath": null,
    "maintext": "Text messages are notorious for misconstruing tone, but a recent exchange led to one person losing her job.\nAn apparently heartless text response to a request for time off was shared online and led to an investigation and a dismissal.\nCrystal Reynolds Fisher shared screen grabs of her conversation with her manager on , and now their company has confirmed that the manager no longer works at the company.\nIn the texts, Fisher writes that her son is on life support and, as a result, she will not be able to make it to her shift two days later.\n\"This isn't how we do things, so I'll accept that you're quitting,\" her manager, identified only as Dawn, wrote in response, according to the screengrab.\nFisher shared three screen grabbed images of the exchange, wherein Dawn continues to assert that if Fisher doesn't come to work for the following shift, it will be viewed as her quitting as opposed to a planned absence.\n\"If you can't come to work that's you quitting,\" she writes at one point.\n\"I will not get into [it] with you on here but I've been more than accomodating during this alloweding schedule changes and such,\" Dawn writes. \"There is no reason you can't work and I will not tolerate drama.\"\n\"End of conversation... If you aren't there to work your shift tomorrow then I take that as you quit,\" she wrote in two texts.\nFisher did not immediately return ABC News' request for comment.\nFisher and her manager reportedly worked at PS Food Mart in Albion, Michigan, which is owned by Folk Oil.\nAt one point in the exchange, Fisher says that she will contact corporate, and Dawn responds with the phone number for the corporate office.\n\"Would u [sic] be able to go to work and function if ur [sic] child was on life support? I don't know if I'm coming or going and I [sic] expect me to work?\" Dawn writes in one text.\n\"Yes I would, I still have bills to pay and something to keep me busy and occupied. We don't just get to come and go as we please at Folk Oil. I have tomorrow and Monday covered. Your son is in the best place he can be. I have a store to run and that's my focus,\" Dawn responded in the final text.\nFisher posted the exchange on Facebook on June 30, and two days later, PS Food Mart posted a statement on their Facebook account.\n\"We investigated and have found that the situation was handled improperly and without the compassion that we value as a company. For that, we are very sorry,\" the said in the statement.\n\"As a result of this finding, we took quick action and that manager is no longer employed by PS Food Mart. We have also reaffirmed to our employee that she will be able to take all the time off that she needs during this difficult period,\" the statement said.",
    "source_domain": "abcnews.go.com",
    "title": "Company fires manager over heartless response to worker saying her son is on life support",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/News/company-fires-manager-heartless-response-worker-son-life/story?id=56364209"
}