{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 20:45:52+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Suicide bombing in northwestern Pakistan kills 11 soldiers",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsuicide-bombing-northwestern-pakistan-kills-soldiers-52816450.json",
    "image_url": "http://abcnews.go.com/International/wireStory/suicide-bombing-northwestern-pakistan-kills-soldiers-52816450",
    "language": "en",
    "localpath": null,
    "maintext": "A suicide bombing in Pakistan's northwestern Swat Valley killed 11 soldiers and wounded 13 on Saturday in what authorities said was the first attack in over three years in the region once ruled by militants.\nNo group immediately claimed responsibility for the attack.\nThe bomber detonated his explosives vest near an empty lot used by the soldiers for sports and exercise in the Kabal area, the military said. Initial reports said three troops died in the attack but later the army said another eight soldiers who were critically wounded died of their wounds. One officer was among those killed.\nThe military said the wounded were being treated at a local hospital.\nSecurity forces cordoned off the area and were searching for possible accomplices of the bomber, the statement added.\nIslamic militants ruled the picturesque Swat Valley from 2007 until a massive military operation routed them from the area in 2009. The operation involved evacuating 2 million people from the valley. They were able later to return to their homes.\nPakistani Prime Minister Shahid Khaqan Abbasi and other political leaders condemned the attack. Abbasi pledged that the country's security forces will \"fight until the last terrorist is eliminated.\"",
    "source_domain": "abcnews.go.com",
    "title": "Suicide bombing in northwestern Pakistan kills 11 soldiers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/suicide-bombing-northwestern-pakistan-kills-soldiers-52816450"
}