{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:15:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Officials: Trump knew Flynn misled WH weeks before ouster",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fofficials-trump-knew-flynn-misled-wh-weeks-ouster-45503453.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/officials-trump-knew-flynn-misled-wh-weeks-ouster-45503453",
    "language": "en",
    "localpath": null,
    "maintext": "Just six days into his presidency, Donald Trump was informed his national security adviser had misled his vice president about contacts with Russia. Trump kept his No. 2 in the dark and waited nearly three weeks before ousting the aide, Michael Flynn, citing a slow but steady erosion of trust, White House officials said.\nFlynn was interviewed by the FBI about his telephone conversations with Russia's ambassador to the U.S., a sign his ties to Russia had caught the attention of law enforcement officials.\nBut in the White House's retelling of Flynn's stunning downfall, his error was not that he discussed U.S. sanctions with the Russian before the inauguration — a potential violation of a rarely enforced law — but the fact that he denied it for weeks, apparently misleading Vice President Mike Pence and other senior Trump aides about the nature of the conversations. White House officials said they conducted a thorough review of Flynn's interactions, including transcripts of calls secretly recorded by U.S. intelligence officials, but found nothing illegal.\nPence, who had vouched for Flynn in a televised interview, is said to have been angry and deeply frustrated.\n\"The evolving and eroding level of trust as a result of this situation and a series of other questionable incidents is what led the president to ask General Flynn for his resignation,\" White House spokesman Sean Spicer said Tuesday, one day after the president asked Flynn to leave.\nFlynn, in an interview with The Daily Caller News Foundation, said Monday \"there were no lines crossed\" in his conversations with Russian Ambassador Sergey Kislyak.\nThe explanation of the episode left many questions unanswered, including why Trump didn't alert Pence to the matter and why Trump allowed Flynn to keep accessing classified information and taking part in the president's discussions with world leaders up until the day he was fired.\nWhite House officials also struggled to explain why Trump counselor Kellyanne Conway had declared the president retained \"full confidence\" in Flynn just hours before the adviser had to submit his letter of resignation.\nLater Tuesday, The New York Times reported that U.S. agencies had intercepted phone calls last year between Russian intelligence officials and members of Donald Trump's 2016 campaign team. Current and former U.S. officials who spoke to the Times anonymously said they found no evidence that the Trump campaign was working with the Russians on hacking or other efforts to influence the election.\nThe White House shakeup, less than one month into Trump's tenure, marked another jarring setback for a new administration already dealing with tensions among top aides and a legal fight over the president's travel ban order. Flynn's firing also heightened questions about the president's friendly posture toward Russia. Democrats called for investigations into Flynn's contacts, and Republican Sen. Lindsey Graham said Congress needed to know whether he had been acting with direction from the president or others.\nTrump initially thought Flynn could survive the controversy, according to a person with direct knowledge of the president's views, but a pair of explosive stories in The Washington Post in recent days made the situation untenable. As early as last week, he and aides began making contingency plans for Flynn's dismissal, a senior administration official said. While the president was said to be upset with Flynn, he also expressed anger with other aides for \"losing control\" of the story and making his young administration look bad.\nPence spokesman Marc Lotter said Pence became aware that he had received \"incomplete information\" from Flynn only after the first Washington Post report Thursday night. Pence learned about the Justice Department warnings to the White House around the same time.\nThe officials and others with knowledge of the situation were not authorized to discuss the matter publicly and requested anonymity.\nAhead of the Jan. 20 inauguration, Pence and other officials insisted publicly that Flynn had not discussed sanctions in his talks with Russian Ambassador Sergey Kislyak. On Jan. 26, Acting Attorney General Sally Yates contacted White House counsel Don McGahn to raise concerns about discrepancies between the public accounting and what intelligence officials knew to be true about the contacts based on routine recordings of communications with foreign officials who are in the U.S.\nThe Justice Department warned the White House that the inconsistencies would leave the president's top national security aide vulnerable to blackmail from Russia, according to a person with knowledge of the discussion. The president was informed of the warnings the same day, Spicer said.\nFlynn was interviewed by the FBI around the same time, according to a U.S. official who was briefed on the investigation.\nIt was not immediately known what questions the FBI asked of Flynn or what he told law enforcement officials.\nMcGahn, along with chief of staff Reince Priebus and strategist Steve Bannon, also questioned Flynn multiple times in the ensuing weeks, a White House official said. Top aides also reviewed transcripts of Flynn's contacts with the ambassador, according to a person with knowledge of the review process.\nAt the same time, the official said Trump aides began taking steps to put some distance between the president and Flynn. CIA Director Mike Pompeo and retired Lt. Gen. Keith Kellogg, a top Flynn aide, started taking part in Trump's daily security briefings.\nTop Trump advisers quietly met with Vice Admiral Robert Harward last week and spoke with the former Navy SEAL again Monday, the White House official said. Harward is seen as the top contender for the job, though former CIA Director David Petraeus and Kellogg, who has temporarily stepped into the role, are also under consideration.\nSpicer said other \"questionable incidents\" had contributed to Flynn's firing. According to one person with knowledge of the matter, those incidents included Flynn seeking a security clearance for his son during the transition.\nAt the time, it was Pence who was again put in the position of defending Flynn on television, saying he had not sought a clearance for the retired general's son.\nA U.S. official told The Associated Press that Flynn was in frequent contact with Kislyak on the day the Obama administration slapped sanctions on Russia for election-related hacking, as well as at other times during the transition. Spicer said Flynn was not discussing sanctions at the president's behest.\nBefore he resigned Monday night, Flynn told the investigative news nonprofit affiliated with the website The Daily Caller that he and Kislyak spoke only generally about the Russian diplomats expelled by President Barack Obama as part of the previous administration's response to Moscow's interference in the U.S. presidential election.\n\"It wasn't about sanctions. It was about the 35 guys who were thrown out,\" Flynn said. \"It was basically: 'Look, I know this happened. We'll review everything.' I never said anything such as, 'We're going to review sanctions,' or anything like that.\"\n———\nAssociated Press writers Jonathan Lemire, Eric Tucker, Ken Thomas, Jill Colvin, Erica Werner and Catherine Lucey contributed to this report.\n———\nOnline: https://www.documentcloud.org/documents/3461508-Michael-Flynn-Resignation-Letter.html\nFollow Julie Pace at http://twitter.com/jpaceDC and Vivian Salama at http://twitter.com/vmsalama",
    "source_domain": "abcnews.go.com",
    "title": "Officials: Trump knew Flynn misled WH weeks before ouster",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/officials-trump-knew-flynn-misled-wh-weeks-ouster-45503453"
}