{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 10:02:04+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Business Highlights",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbusiness-highlights-52807317.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/business-highlights-52807317",
    "language": "en",
    "localpath": null,
    "maintext": "___\nDow industrials drop 600 points, extending a weeklong slump\nNEW YORK (AP) — U.S. stocks slumped Friday, pulling the Dow Jones industrial average down more than 650 points and handing the market its worst week in two years. Technology, banks and energy stocks accounted for much of the broad slide. Several major companies, including Exxon Mobil and Google's parent company, Alphabet, sank after reporting weak earnings. Bond yields rose sharply after the government reported the fastest wage growth in eight years, stoking fears of inflation.\n———\nWages up by most in 8 years as US adds a robust 200K jobs\nWASHINGTON (AP) — The solid pay gains reported for January show that employers are increasingly competing for a narrower pool of workers with the U.S. expansion now in its ninth year. Raises stemming from Republican tax cuts and minimum wage increases in 18 states also likely boosted pay last month. The figures point to an economy on strong footing, fueled by consumer spending and global growth.\n———\nExxon, Chevron report sharply higher 4Q profit on tax gains\nDALLAS (AP) — Fourth-quarter profits are up at Exxon and Chevron, helped by the new tax law. However, the core results fell short of Wall Street forecasts. Analysts expected a bigger benefit from rising oil prices.\n———\nSuper Bowl ads shy from politics and mind their manners\nNEW YORK (AP) — This year's Super Bowl advertisers — with a few notable exceptions — are trying hard to steer clear of divisive subjects and are instead running mild-mannered ads that don't offend. So Bill Hader is touting Pringles, Danny DeVito appears in an ad for M&Ms, Chris Pratt promotes Michelob Ultra and Peyton Manning shills for Universal Parks in spots tinged with light humor. The goal is to capture the attention of the 111 million people expected to tune in on Sunday.\n———\nYellen lands new job at Brookings Institution\nWASHINGTON (AP) — Federal Reserve Chair Janet Yellen, the first woman to head the nation's central bank, got a boisterous send-off from Fed staff, but she isn't taking any time off. After her last day at the Fed on Friday, she will start a new job Monday at the Brookings Institution.\n———\nSpain extradites suspect thought to be spam kingpin to US\nMADRID (AP) — Spain says it has extradited to the United States a Russian citizen suspected as one the world's most notorious spammers. Pyotr Levashov, a 37-year-old from St. Petersburg, was arrested last April while on vacation in Barcelona with his family. U.S. authorities had asked for him to be detained on charges of fraud and unauthorized interception of electronic communications. A statement from Spain's National Police said officers handed Levashov over to U.S. marshals on Friday.\n———\nTax overhaul charge hands Merck 4Q loss despite higher sales\nNEW YORK (AP) — Drugmaker Merck posted a loss of $872 million in the fourth quarter, as a big charge related to the recent U.S. tax overhaul more than offset higher medicine sales. Its adjusted earnings still topped Wall Street's expectations. The maker of Januvia diabetes pills and cancer drug Keytruda took a charge of $2.6 billion toward taxes for repatriating profits held overseas. It now plans to invest about $12 billion over five years on capital projects.\n———\nSony taps CFO Yoshida as new president, replacing Hirai\nTOKYO (AP) — Sony Corp. has named Chief Financial Officer Kenichiro Yoshida as its new president and CEO, replacing Kazuo Hirai, who led a turnaround at the Japanese electronics and entertainment company and will stay on as chairman. Yoshida has experience in Sony's U.S. operations, as well as its network, financial and investor relations businesses.\n———\n900 trapped South Africa miners evacuated after power outage\nJOHANNESBURG (AP) — At least 900 miners who were trapped in a South African gold mine for more than 24 hours after a power outage have been safely evacuated. The Sibanye-Stillwater company which manages the Beatrix mine in Free State province says the miners will have medical tests and counseling. It expects the mine to start operating again on Monday.\n———\nOldest nuke plant in the US closing a year ahead of schedule\nLACEY TOWNSHIP, N.J. (AP) — The oldest active nuclear power plant in the United States will shut down this October, more than a year ahead of schedule. Chicago-based Exelon Generation says the Oyster Creek plant in Lacey Township, New Jersey, will close this fall instead of its Dec. 31, 2019, deadline under an agreement with state authorities. The company says it is becoming too costly to operate the plant.\n———\nYouTube begins flagging videos backed by governments\nMENLO PARK, Calif. (AP) — YouTube says it has started flagging videos provided by news outlets that receive government backing. It's part of a commitment made last year when its owner, Google, was hauled before congressional investigators looking into Russian tampering with the U.S. electorate. In particular, it faced numerous questions about RT (formerly Russia Today), which had at one point been a preferred partner on YouTube even though it is funded by the Russian government.\n———\nThe Standard & Poor's 500 index fell 59.85 points, or 2.1 percent, to 2,762.13. The Dow Jones industrial average lost 665.75 points, or 2.4 percent, to 25,520.96. The Nasdaq slid 144.92 points, or 2 percent, to 7,240.95. The Russell 2000 index of smaller-company stocks gave up 32.59 points, or 2.1 percent, to 1,547.27.\nBenchmark U.S. crude slid 35 cents, or 0.5 percent, to settle at $65.45 a barrel on the New York Mercantile Exchange. Brent crude, used to price international oils, fell $1.07, or 1.5 percent, to close at $68.58 a barrel in London. Wholesale gasoline fell 2 cents to $1.87 a gallon and heating oil slipped 4 cents to $2.05 a gallon. Natural gas lost 1 cent to $2.85 per 1,000 cubic feet.",
    "source_domain": "abcnews.go.com",
    "title": "Business Highlights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/business-highlights-52807317"
}