{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:52:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Fed raises key rate and unveils plan to reduce bond holdings",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ffed-hikes-key-rate-unveils-bond-trimming-plans-48038078.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_a7d36ec0ebd643309f7b154abe20ebbd_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Federal Reserve has raised its key interest rate for the third time in six months, providing its latest vote of confidence in a slow-growing but durable economy. The Fed also announced plans to start gradually paring its bond holdings later this year, which could cause long-term rates to rise.\nThe increase in the short-term rate by a quarter-point to a still-low range of 1 percent to 1.25 percent could lead to higher borrowing costs for consumers and businesses and slightly better returns for savers. The Fed foresees one additional rate hike this year, unchanged from its previous forecast. It gave no hint of when that might occur.\nThe Fed chose to raise rates again despite economic weakness at the start of 2017 and a further slowdown recently in inflation, which remains persistently below the Fed's 2 percent target rate. Fed officials reiterated their belief that that both inflation and economic growth will pick up.\nThe Fed's decision was approved on an 8-1 vote with Neel Kashkari, head of the Fed's Minneapolis regional bank, dissenting in favor of holding rates unchanged.\nThe latest rate increase, announced in a statement after a Fed policy meeting, comes as the U.S. economy is growing only sluggishly. Even so, many of the barometers the Fed monitors most closely have given it the confidence to keep gradually lifting still-low borrowing rates toward their historic norms.\nIn particular, hiring in the United States remains solid if slowing, with employment at a 16-year-low of 4.3 percent — even below the level that the Fed associates with full employment.\nThe Fed's announcement that it would begin paring its balance sheet later this year — \"provided that the economy evolves broadly as anticipated\" — involves its enormous portfolio of Treasury and mortgage bonds. The Fed began buying the bonds after the Great Recession to try to depress long-term loan rates. That effort resulted in a five-fold increase in its portfolio to $4.5 trillion.\nOn Wednesday, the Fed said it would eventually allow a small amount of bonds to mature without being replaced — an amount that would gradually rise as markets adjusted to the process. This process could put upward pressure on long-term borrowing rates.\nUnder the plan it unveiled, the Fed would start with monthly reductions in Treasury holdings of no more than $6 billion and $4 billion in mortgage bonds. Those figures would rise in increments over a year until they reached $30 billion a month in Treasurys and $20 billion in mortgage bonds.\nBy using a gradual pace for reducing its bond holdings, the Fed hopes to avoid upsetting financial markets..\nThe Fed on Wednesday also issued updated economic forecasts that showed it still foresees one additional rate increase this year, to following Wednesday's increase and an earlier rate hike in March.\nThe rate forecast, based on the individual projections for each member, envisions three more rate hikes in 2018 and three more in 2019. By then, the Fed's forecast would put its key policy rate at 3 percent. That's the level the Fed believes is a neutral rate — neither stimulating economic growth nor restraining it.\nBut the Fed's forecasts are only predictions and are frequently revised as its assessments evolve.\nThe revised economic forecast bowed to reality by reducing its estimate for unemployment by year's end to 4.3 percent from a March projection of 4.5 percent. Unemployment has already reached a 16-year low of 4.3 percent.\nThe Fed kept forecast for economic growth this year of 2.2 percent, up slightly from its March forecast, with growth of 2.1 percent in 2018 and 1.9 percent in 2019. Those forecasts are far below the 3 percent annual growth the Trump administration has said it can achieve with tax cuts, deregulation and tougher enforcement of trade rules to protect American jobs.\nThe central also updated its projections for inflation to take account of a slowdown. It forecast that prices will rise just 1.6 percent this year, down from a March forecast of 1.9 percent. The Fed continues to project that prices, as measured by a gauge tied to consumer spending, will rise 2 percent in 2018 and 2019, achieving its target.\nAt the moment, uncertainty surrounds the membership of the Fed's own policy committee. President Donald Trump is expected soon to fill three vacancies on the Fed's influential board, and those new members, depending on who they are, could alter its rate-setting policy.\nSome news reports have mentioned leading candidates to fill the vacancies. They include Randal Quarles, a top Treasury official in two past Republican administrations, for the vice chairman's job of overseeing bank regulation. Marvin Goodfriend, an economist at Carnegie Mellon University, has been mentioned for another board spot, and Robert Jones, chief executive of Old National Bancorp in Indiana, reportedly is a candidate for a board seat designated for a community banker.\nThe betting is that the administration will choose officials who will tilt the Fed toward a more \"hawkish\" stance. Hawks tend to worry that rates kept too low for too long could escalate inflation or fuel asset bubbles. By contrast, \"doves\" favor the direction taken under Chair Janet Yellen, favoring relatively low rates to maximize employment.\nYellen, the first woman to lead the Fed, is serving a term that will end in February. So far, Trump has sent conflicting signals about whether he plans to nominate her for a second term.",
    "source_domain": "abcnews.go.com",
    "title": "Fed raises key rate and unveils plan to reduce bond holdings",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/fed-hikes-key-rate-unveils-bond-trimming-plans-48038078"
}