{
    "authors": [
        "Abc News",
        "More Taylor"
    ],
    "date_download": "2017-04-17 16:40:02+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Kardashian rushed to West's side when he was hospitalized in November.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fkim-kardashian-west-kanyes-hospitalization-wife%2Fstory%3Fid%3D46842340.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-kim-kanye-01-as-161122_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Kanye West's hospitalization late last year was highly publicized, and on Sunday's episode of \"Keeping Up With the Kardashians,\" viewers got an inside look at how the incident affected Kim Kardashian West.\nWest, 39, was admitted to the hospital due to exhaustion and sleep deprivation on Nov. 21, 2016, and Kardashian West soon rushed to his side in Los Angeles.\n\"My heart is breaking for Kim,\" Kardashian West's sister, Kourtney Kardashian, said in the most recent episode of the show. \"I know that her and Kanye have been through so much this year ... it just never ends.\"\n\"Everything will be OK,\" Kardashian West, 36, said. \"It's forcing him to take much needed time off, which he needs. I think that will be really good for him. I feel a sense of responsibility just with the pressure of taking care of everything. Even after the robbery and everything it's just [that] I've been staying home and I've been looking to him to just take care of everything while I stay home.\"\nShe also touched on a conversation she had with West after the events transpired.\n\"Kanye was really cute,\" Kardashian West said. \"He was like, 'So, this is what for better and worse means?' and I'm like, 'Yeah.' This is being a wife. This is what you got to do.\"\nThe incident only added to other struggles the couple had recently gone through together. West's hospitalization came shortly after Kardashian West was robbed at gunpoint in Paris last October. The pair married in 2014 and have two children, 3-year-old North and 1-year-old Saint.",
    "source_domain": "abcnews.go.com",
    "title": "Kim Kardashian West on Kanye's hospitalization: 'This is being a wife'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/kim-kardashian-west-kanyes-hospitalization-wife/story?id=46842340"
}