{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2017-01-02 19:49:57+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Trump Is No 'Email Person' but 'Knows Things About Hacking'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fdonald-trump-email-person-things-hacking%2Fstory%3Fid%3D44511376.json",
    "image_url": "http://a.abcnews.com/images/Politics/AP-trump-01-as-160117_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Although Donald Trump said this weekend that he knows “things that other people don’t know” about email hacking, he has also repeatedly admitted that he is “not an email person” and “almost never” sends it.\nAsked Saturday about the Russian hacking allegations, President-elect Trump continued to cast doubt on the findings of U.S. intelligence agencies.\n“If you look at the weapons of mass destruction, that was a disaster, and they were wrong. And so I want them to be sure,” Trump told reporters at his Mar-a-Lago estate in Palm Beach, Florida, apparently referring to U.S. intelligence.\n“I think it’s unfair if they don’t know. And I know a lot about hacking. And hacking is a very hard thing to prove. So it could be somebody else. And I also know things that other people don’t know, and so they cannot be sure of the situation,” he added.\nTrump’s weekend comments were far from the first time he has weighed in on cybersecurity, dating back to the presidential campaign when he repeatedly said he doesn’t trust email, so rarely uses it.\n“I'm not an email person myself. I don't believe in it,” he said at an event in Doral, Florida, July 27. “I think it can be hacked, for one thing. When I send an email, I mean, if I send one, I send one almost never. I'm just not a believer in email. A lot of people have taught me that, including Hillary [Clinton]. But, honestly, it could be maybe attacked. Who knows.”\nTwo days later, he talked about how widespread hacking was and, specifically, said Russia is apparently “excellent” at it.\n“The hacking is all over the place. I hear China is brutal. They say Russia is excellent,” he said at a July 29 town hall event in Colorado Springs, Colorado.\n“And you have guys sitting in their home that are very good. You have people, men and women, sitting in their homes that are better than the people that are the inventors.”\nTrump also talked in July about how he prefers the idea of using couriers to transport top-secret information, especially when it pertains to military intelligence.\n“I guarantee you General George Patton, who was rough as hell, he wouldn't be doing emails when he's going to be ready to attack. If he were around, he'd say, ‘I don't like that system at all,’” Trump said.\nTrump apparently intends to take the idea to heart, saying Saturday that he will place an emphasis on such self-described “old school” tactics when it comes to keeping information protected during the Trump administration.\n“If you have something really important, write it out and have it delivered by courier, the old-fashioned way because I'll tell you what, no computer is safe,” Trump said in Palm Beach.\n“I don't care what they say, no computer is safe. I have a boy who's ten years old. He can do anything with a computer. You want something to really go without detection, write it out and have it sent by courier.”",
    "source_domain": "abcnews.go.com",
    "title": "Donald Trump Is No 'Email Person' but 'Knows Things About Hacking'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/donald-trump-email-person-things-hacking/story?id=44511376"
}