{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 05:42:54+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fmelania-trump-tweets-shes-feeling-great-55551885.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_652d3202cd2243ddb783fedf06199ba1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After nearly three weeks out of sight, Melania Trump tried to put to rest speculation about her health and even her whereabouts as she continues to recover from medical treatment for a kidney condition. It didn't completely work.\nMrs. Trump tweeted Wednesday that she's \"feeling great\" and is at the White House working hard for children and American families. But she still didn't make a public appearance, leaving some skeptics still wondering about her condition and plenty more.\nThe first lady's tweet landed while her husband was participating in a White House event that seemed tailor-made for a first lady, as famous athletes joined President Donald Trump and his daughter and senior adviser Ivanka Trump on the South Lawn to promote youth sports and fitness.\n\"I see the media is working overtime speculating where I am & what I'm doing,\" Mrs. Trump said on Twitter. \"Rest assured, I'm here at the @WhiteHouse w my family, feeling great, & working hard on behalf of children & the American people!\"\nThe first lady's absence from public view has spawned all sorts of wild theories on social media and elsewhere: Has she moved back to Trump Tower in New York City? Is she cooperating with the special counsel's Russia investigation? Is her health in jeopardy? Has she entered the witness protection program? And so on.\nMrs. Trump has not appeared in public since the wee hours of May 10, when she accompanied the president to a military base in Maryland to welcome home three Americans who had been released from detention in North Korea.\nFour days later, the White House announced that the 48-year-old first lady had successfully undergone an \"embolization\" procedure to treat a benign kidney condition, and that there were no complications. She spent five nights at Walter Reed National Military Medical Center in nearby Bethesda, Maryland. Some doctors familiar with the procedure but not involved in her care said people treated with embolization typically are sent home the same day or the next.\nFirst ladies are under no obligation to make their medical histories public, and the White House has said nothing more about Mrs. Trump's condition.\nOn Friday, the president tried to assure reporters that his wife was doing fine.\nAsked about the first lady's health before he boarded the presidential helicopter on the South Lawn, Trump pointed to the second floor of the White House and said: \"She's doing great. Right there. She's doing great. She's looking at us, right there.\"\nDespite Trump's assurances, reporters didn't see any sign of the first lady watching from above.\nMrs. Trump is often viewed as a reluctant first lady, but her lengthy absence from public view comes after what was probably her most high-profile period in the role to date.\nIn April, she alone represented the administration at the Houston funeral of former first lady Barbara Bush. She joined the president to host the Japanese prime minister for talks at the Trumps' estate in Florida. That was followed by the French president's three-day state visit to the White House, which included the first state dinner planned under her watch for more than 100 guests.\nMrs. Trump capped it off in early May with a splashy Rose Garden rollout for her \"Be Best\" campaign to teach kindness to children. Trump watched from the audience.\nHer popularity is rising, according to a recent CNN poll that found 57 percent of those surveyed saying they have a favorable impression of her, up from 47 percent in January.\nA week after the first lady announced \"Be Best,\" she was in the hospital.\nShe's been heard from — including tweets about the Texas school shooting, the newest Medal of Honor recipient and Memorial Day — but not seen since.\nThe first lady's longtime friend, Paolo Zampolli, thinks \"she wanted to spend some quality time with her family.\"\nHer spokeswoman, Stephanie Grisham, said the first lady has been meeting with her staff on the \"Be Best\" initiative and working on upcoming projects like the annual White House picnic for members of Congress in June and Fourth of July festivities.\nGrisham said the first lady would like to be \"out and about promoting her initiatives\" but \"her health comes first.\"\nJean Harris, who teaches political science and women's studies at the University of Scranton in Pennsylvania, said people so far seem to be giving the first lady \"her space for a whole bunch of reasons.\"\nBut Harris said Mrs. Trump could end up being hurt by the fact that she made the long-waited announcement about her initiative — and then disappeared.\n\"If there's not that follow-up, I think people will begin to be a bit more critical than they have been,\" Harris said.\n———\nFollow Darlene Superville on Twitter: http://www.twitter.com/dsupervilleap",
    "source_domain": "abcnews.go.com",
    "title": "Melania Trump tweets that she's 'feeling great'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/wireStory/melania-trump-tweets-shes-feeling-great-55551885"
}