{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-07-04 22:17:47+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Authorities have confirmed the latest case is tied to the same chemical.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Fcouple-uk-exposed-poison-russian-spy%2Fstory%3Fid%3D56370968.json",
    "image_url": "https://s.abcnews.com/images/International/uk-couple-exposed-poison-russian-spy-01-gty-mt-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two people in England have been confirmed to have been exposed to the nerve agent Novichok, the same chemical weapon that was used against an ex-Russian spy earlier this year.\nBritish police at Scotland Yard confirmed that the mysterious agent that appears to have caused a couple in their 40s to become critically ill was Novichuk.\nThe couple collapsed at a residence four days ago, The Associated Press reported. The couple were found collapsed eight miles from where the former Russian spy and his daughter were found after being exposed to the same agent four months ago, the AP reported.\nPolice first thought the couple, identified by friends to the AP as 44-year-old Dawn Sturgess and Charlie Rowley, 45, were suffering as a result of using contaminated heroin or crack cocaine.\nNeil Basu, the assistant commissioner for specialist operations which handles counter terrorism operations in the U.K., said that the latest victims are both British nationals and are local to the area.\nJack Taylor/Getty Images\nAn ambulance was called to a residence in Amesbury following the woman collapsed shortly after 10 a.m. Saturday morning, and another ambulance was called that afternoon in response to the collapse of the man.\nThe initial assessment by doctors suggested they had fallen ill from contaminated drugs but on Monday, \"due to concerns over the symptoms the man and woman were displaying,\" samples from the patients were sent to a different laboratory for further study, Basu said in a statement. That further analysis led to the conclusion that the couple had been contaminated with the same nerve agent that was used in the earlier attack.\nThe couple are in critical condition and are being treated in a hospital.\nInvestigators concluded that they were exposed to the same type of nerve agent as the former spy and his daughter, but they are unsure if it was from the same batch.\nJohn Stillwell/PA via AP\nHe said that there is no evidence that the latest individuals were targeted in any way, noting that there is nothing in their background to suggest that they would be targeted. The object that contaminated them has not yet been identified, Basu said.\nBack in March, Prime Minister Theresa May confirmed that former Russian spy Sergei Skripal and his daughter Yulia were exposed to Novichuk.\nSergei Skripal was unconscious for a month after the attack and his daughter Yulia was unconscious for three weeks.\nBasu said that there is no evidence that the new victims visited areas that had been decontaminated in the wake of the Skripal case. Several areas where the latest victims may have been leading up to their collapse have been cordoned off as a precaution.\nEngland's chief medical officer Professor Sally Davies said that the risk of contamination to the general public remains low but anyone who may have visited any area that is now cordoned off between now and Friday evening should take precautions to was their clothes and wipe down shoes and bags. She also warned the public to be careful picking up any unknown items.\nNovichok — which means \"newcomer\" in Russian — is the codename for a series of nerve agents that Russia allegedly secretly developed in the latter stages of the Cold War. Novichok nerve agents were intended to be more powerful and harder to detect than previous generations of nerve agents.\nRussia has never officially acknowledged the existence of the Novichok program and most of what is publicly known about it comes from Vil Mirzayanov, a Russian scientist who worked for years in the Soviet chemical weapons program.\nNearly two weeks ago, Prince Charles and his wife Camilla visited the town of Salisbury, where the Skripals were poisoned, to show their support for the town's recovery.\nABC News' Patrick Reevell contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Couple in UK exposed to same poison as ex-Russian spy",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/couple-uk-exposed-poison-russian-spy/story?id=56370968"
}