{
    "authors": [
        "Abc News",
        "More Catherine"
    ],
    "date_download": "2018-07-04 09:47:05+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "It's not too late to get into the patriotic spirit with these easy party hacks.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FLiving%2Fminute-diy-party-hacks-fourth-july-bash%2Fstory%3Fid%3D56346793.json",
    "image_url": "https://s.abcnews.com/images/US/4th-of-july-party-1-ht-thg-180702_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Today is America's birthday, which means it's time to party.\nThis year, the Fourth of July landed on a Wednesday and sort of crept up on us.\nIf you find yourself hosting a party tonight but don't feel at all prepared, fear not, because \"Good Morning America\" teamed up with the DIY lifestyle team at Brit + Co to round up some last-minute party hacks that are sure to take your Fourth of July bash to the next level.\nPlus, for those who only fire up the grill once or twice a year, we tapped a few female grill masters to share some of their wisdom. Here are some of their top tips and tricks to keep in mind if you are planning on grilling today.\nSo round up your friends and family, fire up the barbecue, and get into the patriotic mood with these easy ways to throw the ultimate party in the USA.\nLight it up with these DIY starred-and-striped candle holders\nBrit + Co\nThere's a ridiculously easy way to create some last-minute holiday decor for your July Fourth bash, using items you likely already have around the house or can easily acquire.\nWhat you need: Mason jars, red, white and blue spray paint, 1/4-inch masking tape and star-shaped stickers.\nThe end results look like something straight out of Pinterest.\nCreate last-minute patriotic attire from head to toe\nBrit + Co\nCan't find anything red, white and blue in your closet today? Don't worry -- \"Brit + Co\" has a step-by-step guide for how to create some patriotic garb with a regular T-shirt, jean shorts and white sneakers you likely already have lying around the house.\nBrit + Co\nFirst off, transform a simple white T-shirt into a stars-and-stripes tee in less than 10 minutes with this DIY guide.\nWhat you need: Their template, a white tee, iron-on transfer paper, an iron, scissors and a piece of cotton fabric. Follow Brit + Co's ten minute, step-by-step guide on how to make the festive T-shirt here.\nNext, a super simple way to upgrade your plain denim shorts or plain white sneakers into festive Fourth of July party wear is to use some fabric paint.\nBrit + Co\nWhat you need: Plain denim shorts, plain white sneakers, fabric paint in assorted colors, a large paintbrush and a small detail paintbrush.\nBrit + Co\nFollow Brit + Co's patriotic patterns for your shorts and shoes here.\nMake a rocket pop pinata\nBrit + Co\nNothing says summer like the classic red, white and blue rocket popsicles that have become a Fourth of July party staple over the years.\nUse the iconic design as an inspiration for a fun pinata to take your party to the next level.\nMaking a pinata from scratch is actually way easier than it sounds and is sure to be a crowd-pleaser.\nWhat you need: Red, white and blue crepe paper streamers, two 3-foot tall pieces of cardboard (can easily use a couple of old boxes), scissors, liquid glue, marker, a box cutter and masking tape.\nTo learn how to put it all together, click here.\nMake your party pop with homemade confetti poppers\nBrit + Co\nThe Fourth of July is all about fireworks. While handheld fireworks or sparklers are fun, if you are hosting a party with children, or live in an area with strict firework restrictions, then these confetti poppers are the perfect fun alternative to make your party pop.\nWhat you need: Origami paper, glitter, cake push pops, scissors, spray paint and permanent markers.\nGrilling tips from female grill masters\nLonghorn Steakhouse\nWhile many view grilling as a man's terrain, these boss female grill masters are proving that misconception wrong. Here, two female grill masters shared their top tips to remember when firing it up outside this Fourth of July.\nMichelle Cerveny, 30, of Canton, Ohio, beat out 5,000 grill masters to win the Longhorn Steakhouse Steak Master Series Championships this year, becoming the first woman to do so.\n\"A lot of people are intimidated by the grill, I think people need to treat it like it’s another appliance in their kitchen, only its outside,\" she told \"GMA.\"\nMake sure your grill is 'super clean'\nCerveny said her number one tip is to \"make sure your grill grates are super clean.\"\n\"A lot of people don't take the time to scrape them off or clean it off,\" she said, adding that this rookie mistake can have a big effect on taste.\nUse fresh, not frozen meat and season heavily\nNext, Cerveny says to be sure everything you put on the grill is \"always fresh and never frozen.\"\nFinally, when grilling, she recommends to not shy away from seasoning.\n\"A lot of people are scared of using too much seasoning,\" she said. \"But I always recommend to boldly season what you put on the grill, a lot of the seasoning will fall off through the grates.\"\nCerveny will be operating a Fourth of July grill hotline, similar to Butterball's Thanksgiving turkey-cooking hotline, to answer any questions that might arise when you fire up the grill today.\nUse your grill to do some baking\nCourtesy Christie Vanover\nChristie Vanover, the founder of Girls Can Grill, told \"GMA\" that one tip many people don’t know about is that you can also double up and use your grill for baking.\nThis is especially handy if you didn't get a chance to make desserts ahead of time and don't have time to run in and out of the kitchen.\n\"In order to bake on a grill, you need to distance your cookie sheet or muffin pan from the heat source,\" she told \"GMA,\" adding that this will ensure the bottoms of whatever you're making don't burn.\n\"To do this, place a pie tin, metal pan or veggie grill basket on the grill grate, and then place your baking sheet on top,\" she said.\nYou can get Vanover's original recipe for grilled cupcakes here.\nCourtesy Christie Vanover\nUse foil to clean your grill grates\nAnother tip she had is that if you don't have a grill brush but need to clean your grill grates, an easy substitute is to 'crumble foil into a ball to make a grill cleaner.\"\nSimply rip off a sheet of foil, ball it up, and scrape it along the grill grates.\n'The foil will mold in between the grates to clean leftover residue,' she said. \"And it's sturdy enough to hold up for the toughest messes.\"\nUse winter gloves to make pulled pork\nCourtesy Christie Vanover\nFinally, if you are making pulled pork this summer, Vanover recommends using winter gloves with latex gloves over top to protect your hands.\n\"The winter gloves will keep your hands from burning, while the latex gloves will keep your winter gloves clean,\" she added. \"I prefer pulling pork by hand because it allows me to feel the meat and separate out any fatty pieces.\"",
    "source_domain": "abcnews.go.com",
    "title": "Must-know, last-minute DIY party hacks for your Fourth of July bash",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Living/minute-diy-party-hacks-fourth-july-bash/story?id=56346793"
}