{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 07:53:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "Science Says: Lightning is zapping fewer Americans, not more",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fscience-lightning-zapping-fewer-americans-49221945.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_90aff4101c2a4eb6b287e11625836ce1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lightning — once one of nature's biggest killers —is claiming far fewer lives in the United States, mostly because we've learned to get out of the way.\nIn the 1940s, when there were fewer people, lightning killed more than 300 people annually. So far this year, 13 people have died after being struck, on pace for a record low of 17 deaths. Taking the growing population into account, the lightning death rate has shrunk more than forty-fold since record-keeping began in 1940.\nPeople seem to be capturing the phenomenon more on camera than before, making it seem like something new and sizzling is going on in the air. Separate videos last month of a Florida lifeguard and an airport worker being hit by lightning went viral. Both survived.\nLightning strikes have not changed — they hit about the same amount as they used to, said Pennsylvania State University meteorology professor Paul Markowski.\nA big difference: Fewer of us are outside during bad weather. If we're not huddled indoors, we're often in cars. Vehicles with metal roofs — not convertibles — are safe from lightning, experts say.\n\"As a society we spend less time outside,\" said Harold Brooks, a scientist at the National Weather Service's National Severe Storms Laboratory. \"Especially farmers. There aren't just many farmers around.\"\nDecades ago, farmers would be in fields and were the tallest object, making them most likely to get hit, said National Weather Service lightning safety specialist John Jensenius Jr.\nThat helps explain the drop in yearly lightning deaths from about 329 in the 1940s to about 98 in the 1970s. The numbers have kept plunging since. From 2007-2016, average yearly deaths dropped to 31.\nImproved medical care also has played a key role, including wider use of defibrillators and more CPR-trained bystanders.\nWhen Dr. Mary Ann Cooper started out in the emergency room in the 1970s, there was nothing in textbooks about how to treat lightning victims.\nNow instead of treating lightning patients the same way as people who touch high-voltage wires and are burned, doctors focus more on the neurological damage, said Cooper, professor emerita of emergency medicine at the University of Illinois in Chicago.\nPerhaps the biggest reason deaths are down is because of efforts to teach people not to get hit in the first place.\n\"We've equipped the public by saying, 'When thunder roars, go indoors.' Three-year-olds can remember that,\" Cooper said.\nMen are four times more likely to be killed by lightning in the U.S. than women, statistics show. Men do riskier things that get them in trouble in storms, Cooper and Jensenius said.\n\"Our victims are at the wrong place at the wrong time. The wrong place is anywhere outside. The wrong time is anywhere that you can hear thunder,\" said Jensenius.\nIn July — the deadliest month for lightning in the U.S. — vacationers Andre Bauldock and Lamar Rayfield were on a beach in Florida when a thunderstorm rolled in.\n\"We ignored it. We were just thinking it was going to pass over soon,\" recalled Bauldock. \"We could see the sun in the distance. I was admiring the lightning out in the ocean and I thought it was far away.\"\nThe next thing Bauldock remembers is waking up in a parking lot surrounded by people. He was told the lightning struck his friend's stomach and then hit him. They both fell over. Rayfield eventually died.\nAn analysis of 352 U.S. lightning deaths from 2006 to 2016 found people were most often doing something near water — fishing, camping and beach activities— when they were hit. Golf doesn't even crack the top dozen activities, but soccer does, said Jensensius.\nJames Church was hit earlier this year in Florida as his first cast of the day flew through the air.\n\"I woke up. I couldn't move. It was like an elephant sitting on me, not a single muscle would work,\" Church recalled. \"My eyes were working, my brain was working ... I couldn't feel anything.\"\n———\nVideo journalist Joshua Replogle contributed to this report. Follow Seth Borenstein on Twitter at @borenbears. His work can be found here.\n———\nThis Associated Press series was produced in partnership with the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content.",
    "source_domain": "abcnews.go.com",
    "title": "Science Says: Lightning is zapping fewer Americans, not more",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/science-lightning-zapping-fewer-americans-49221945"
}