{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 12:40:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "UK leader says there's new optimism in Brexit talks",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fuk-leader-optimism-brexit-talks-51713015.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_d45e5bedde80447aaf46d46001fc817f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Brexit? Add Brexit as an interest to stay up to date on the latest Brexit news, video, and analysis from ABC News. Add Interest\nPrime Minister Theresa May is stressing her optimism about negotiations over Britain's departure from the European Union, insisting that a preliminary deal has given fresh impetus to the talks.\nMay met with her Cabinet on Monday morning before a scheduled address to the House of Commons, where she will update lawmakers on the agreement reached Friday that covers questions about citizens' rights, Britain's financial obligations and the Irish border. Leaders of the other 27 EU members are expected to ratify the agreement later this week, allowing Brexit talks to move on to trade and security cooperation.\n\"Of course, nothing is agreed until everything is agreed,\" May said in a statement. \"But there is, I believe, a new sense of optimism now in the talks and I fully hope and expect that we will confirm the arrangements I have set out today in the European Council later this week.\"\nBut weekend comments by the official in charge of the talks have threatened to spoil May's triumphant moment. In an interview with the BBC on Sunday, Brexit chief David Davis suggested that last week's agreement was a \"statement of intent\" that wasn't legally binding.\nThe comments caused unease in Ireland, where leaders demanded provisions in the agreement to ensure Brexit won't restrict travel and trade between the Republic of Ireland and the U.K.'s Northern Ireland. Officials in both parts of the island say the border must remain open to protect the Irish peace process.\nThe Irish government branded Davis' comments \"bizarre\" and insisted that Britain must live up to the commitments it made last week.\nDavis on Monday tried to mitigate the fallout, insisting his words had been \"completely twisted.\"\n\"What I actually said yesterday ... was we want to protect the peace process, want to protect Ireland from the impact of Brexit for them, and I said this was a statement of intent which was much more than just legally enforceable,\" Davis told LBC Radio.\n\"In the event that the withdrawal agreement doesn't happen then we would still be seeking to maintain an invisible border between Northern Ireland and Ireland,\" he added. \"I was making the point that it was much more than just in the treaty, it's what we want to do anyway.\"",
    "source_domain": "abcnews.go.com",
    "title": "UK leader says there's new optimism in Brexit talks",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/uk-leader-optimism-brexit-talks-51713015"
}