{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:22:29+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Ftrump-remaking-federal-policy-womens-reproductive-health-55536025.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_7a12fb29d82d4ed696ef39747f68289b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Step by methodical step, the Trump administration is remaking government policy on reproductive health — moving to limit access to birth control and abortion and bolstering abstinence-only sex education.\nSocial and religious conservatives praise the administration for promoting \"a culture of life.\" But women's-rights activists and some medical experts view the multi-pronged changes as a dangerous ideological shift that could increase unintended pregnancies and abortions.\n\"When I ran for office, I pledged to stand for life,\" President Donald Trump said in a recent speech to the Susan B. Anthony List, which backs political candidates who oppose abortion. \"And as president, that's exactly what I've done. And I have kept my promise, and I think everybody here understands that fully.\"\nMost of the changes involve rules and regulations under the administration's direct control, such as a proposal to forbid federally funded family planning clinics from referring women for abortions and separately allowing more employers who cite moral or religious reasons to opt out of no-cost birth control for women workers.\nTrump also is appointing numerous new federal judges endorsed by anti-abortion groups.\nJustice Neil Gorsuch, the president's only appointment to the Supreme Court so far, has a sparse record on abortion, but has drawn praise from anti-abortion groups and criticism from abortion rights supporters. Unlike regulatory changes, judicial appointments cannot be reversed by a future president.\nDemocrats say Trump is changing policy in ways that could disrupt access to family planning for some women.\nA recently proposed rule would make major changes to Title X, the family-planning program, including banning clinics from sharing physical space and financial resources with abortion providers. Providers like Planned Parenthood could be forced out.\n\"It's across the spectrum of women's health services,\" said Rep. Diana DeGette, D-Col. \"They're proposing abstinence-only sex education —which study after study has shown doesn't work— restrictions to family planning, and more and more restrictions to abortion.\"\nTitle X serves about 4 million low-income people, mainly women. Disruptions could affect women's access to long-acting contraceptives, such as implants and IUDs. Those are more effective than daily pills that can be forgotten but also much more expensive up-front.\nEight professional groups representing doctors, nurses, midwives and physician assistants say the Title X proposal \"dangerously intrudes\" on the patient-provider relationship. That could lead to more unplanned pregnancies, medical complications and undiagnosed diseases.\n\"The strange thing about this is that people who want to decrease the number of abortions are taking away access to the very services that help prevent them,\" said Dr. Hal Lawrence, CEO of the American College of Obstetricians and Gynecologists, one of the eight groups. Among the others are the American College of Nurse-Midwives and the American Academy of Pediatrics.\nThe administration says it supports family planning and isn't cutting funding — merely drawing a \"bright line\" between birth control and abortion. Officials say the doctor-patient relationship is protected because if a woman asks for an abortion referral, Title X doctors could offer a list of pregnancy services providers, including some who perform abortions.\nAbortion is legal, but under longstanding law and regulations, taxpayer money cannot be used to pay for abortions. Planned Parenthood, a major provider of both kinds of services, can receive federal family-planning grants while separately providing abortions.\nTrump's changes come at a time when U.S. rates of births overall, births to teens, and abortions are low.\n\"If we were seeing skyrocketing abortion rates and wildly high numbers on teen births, you could say we have a crisis, but this is just the opposite,\" said Kathleen Sebelius, secretary of Health and Human Services under President Barack Obama, and a supporter of abortion rights. \"This is playing politics and putting people in a very precarious situation.\"\nIn addition to the proposed changes to Title X, other regulatory actions include:\n— Proposing a shift in the Teen Pregnancy Prevention Program to emphasize an abstinence-only approach.\n— Proposing new criteria for federal family-planning grants that would favor applicants who promote \"natural family planning\" and abstinence.\n— Expanding a ban on U.S. funding to foreign organizations that promote or provide abortions.\nProfessor Michael New, who teaches economics at Ave Maria University in Florida, agrees there's a major policy shift. But New, who opposes abortion, dismisses claims of dire consequences as \"false and frankly absurd.\"\n\"President Trump is decidedly pro-life and it is his administration's prerogative to use federal funding rules to incrementally build a culture of life,\" said New. \"The administration is seeking to redirect tax dollars away from entities like Planned Parenthood that treat abortion as a method of family planning and toward entities that affirm life and provide more holistic health care services.\"\nPlanned Parenthood, which survived attempts by congressional Republicans to deny it funding, says the administration's proposed changes to Title X could be another way of achieving the same goal. Planned Parenthood serves 41 percent of program clients, and operates 13 percent of the clinics.\nSuch facilities have become a specialized niche. Research from Texas after that state moved to oust Planned Parenthood showed that other local providers like community health centers were not able to easily fill the gap.\nDr. Stephanie Ho works for Planned Parenthood at a clinic in Arkansas that will have to stop offering medication abortions because of a state law that the Supreme Court this week allowed to take effect. The combination of state restrictions and administration actions worries her.\n\"They're pushing their views on everyone,\" she said. \"They're ignoring scientific evidence and expert medical opinion.\"\nTop Planned Parenthood officials say they will fight to remain in Title X, and will consider litigation if necessary to challenge new rules. HHS is expected to announce funding awards for the $260-million program this fall.\nAt a time when social mores on human reproduction continue changing across the world, some see the U.S. in a time warp.\n\"A lot of social conservative activists are still fighting the battles from the '60s and the sexual revolution,\" said Adam Sonfield, policy manager at The Guttmacher Institute, a research organization that supports abortion rights. \"That's their ultimate goal — that some people will just give up and stop having sex.\"\nBut Kristi Hamrick, spokeswoman for Students for Life of America, said one result of the policy changes \"may be that American women will find that life goes on without Planned Parenthood.\"\n———\nCrary reported from New York.",
    "source_domain": "abcnews.go.com",
    "title": "Trump remaking federal policy on women's reproductive health",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/wireStory/trump-remaking-federal-policy-womens-reproductive-health-55536025"
}