{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:44:12+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "\"The View\" co-hosts discuss the president's lawyers' claim that Daniels violated a confidentiality agreement at least 20 times.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Ftrump-threatening-sue-stormy-daniels-20-million-53853247.json",
    "image_url": "https://s.abcnews.com/images/theview/180319_view_stormy_1114_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump threatening to sue Stormy Daniels for $20 million\nSo Donald Trump's lawyer, Michael Cohen, is threatening to sue stormy Daniels for $20 million. Why? For violating the nondisclosure agreement, also known as the nda, and he wants to take it to federal court. They are literally making a federal case out of it. You know your mother would say, why are you making a federal case out of it. Doesn't this prove that stormy has info that they don't want out there? They want to move it to federal court so they can have an arbitration and remember arbitrations are kind of like secret proceedings? What is it, secret proceedings? Almost like a secret proceeding, whereas in the federal court it's open to the public. I pulled this for joy, the actual notice of removal. It says Stephanie Clifford, aka stormy Daniels, versus Donald Trump, aka David Dennison. He filed it. He's in the middle of it now. I thought he said he had nothing to do with it. Now he's in the middle of it. That's so strange. Why did he join the lawsuit and move it to federal court. Does this automatically happen? Who makes the decision on whether this is a justifiable case? A federal judge. Now that he's in the middle of it and this was obviously hush money, doesn't that say something about -- What do we want to know because -- is it, like acom's razor, of course. Is it highly likely he slept with a porn star, 1,000%? Her porn hub searches have spiked 375% following the weeks after the Wall Street journal report. She put out a report to which I was unimpressed. She came on TV and giggled. I want to know going forward if she's threatened, if she knows something about the Mueller investigation, if she knows something about our national security, great. But what are we interested in? We're interested in the hush money. The campaign finance law. So there's proof now that the trump campaign, through the vessel of the trump campaign paid her off, that's what we want to know? Yeah. That's against the law. I don't even know what I want to know but because he keeps doing things it makes me think there's something I should know. It's campaign finance laws. If he paid $130,000 to hush her up, you know, right before the election, I think as the American people we should know if that money was used -- It's like a bullying scheme against a private citizen, $1 million per count he's charging with the nondisclosure. Now I'm like what is so big in this interview? Is there something else in there. I'm fascinated. Stick with Mueller. She's going on 60 minutes this Sunday. She was supposed to go on last Sunday. Next week, the 25th. It keeps getting moved every Sunday when I'm going to hear her talk. They're vetting it. I get it but this is the problem. Even for me right now, I'm like, enough dancing, enough teasing. You're on your make America horny again tour, I got it, but I want to know what else you have to say. It's obnoxious. We'll find out. Aren't there some legal battles with not allowing it to air? Yes, of course. That's the part that's holding her off. It's making the tour more profitable. Stormy Daniels was not born like Donald Trump with a multi-million dollar gift from his daddy. Let's remember -- She needs to make a living. First of all, I would never talk about a woman who is making money in a legal -- of course not. That's not the issue. But we can't negate the fact that she has benefitted financially from these accusations. Good for her. Whatever, but if that's the only reason why you're doing this -- We cared when John Edwards did this. We cared enough to take him to court. We cared then. Why don't we care about this now? I have to wrap. In fact, there were many rumors on campaigns that this was going on and it took a \"National enquirer\" journalist to get it out, not a regular political journalist. Well they're in trump's pocket. The \"National enquirer\" won a Peabody award. Why aren't they in trump's pocket. They never say a negative thing about him. Interesting. One more thing about stormy Daniels and then I have to go. She says she was threatened physically. Yes, and I would like to know by whom. We'll find out. I want to know the details.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump threatening to sue Stormy Daniels for $20 million",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/trump-threatening-sue-stormy-daniels-20-million-53853247"
}