{
    "authors": [
        "Abc News",
        "More Lauren"
    ],
    "date_download": "2017-04-18 10:10:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Examining the Trump administration's stance on the WH visitor log",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fexamining-trump-administrations-stance-white-house-visitor-log%2Fstory%3Fid%3D46852102.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_31608b6202a444998fa4ced0694544bc_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Challenging critics of Friday's announcement that the White House will not voluntarily release its visitor logs, Press Secretary Sean Spicer on Monday accused the Obama administration of a \"faux attempt\" at transparency and said the Trump administration was following both law and tradition.\n\"We recognize there's a privacy aspect to allowing citizens to come express their views and that's why we maintain the same policy that every other administration did coming up here, prior to the last one,\" Spicer said. \"And the last one frankly was a faux level of doing that because when you go through and scrub everyone's name out you don't want everyone to know, that really is not an honest attempt at doing it.\"\nThe Obama administration voluntarily released some 6 million records of White House visitors, but withheld other records under claimed national security and personal privacy exemptions. Obama administration lawyers at the time said the release was voluntary and not required by law.\nThe Trump administration announced on Friday that it would reverse that Obama-era policy on releasing White House visitor logs because of \"grave national security and privacy concerns.\"\nThese records will not be released until five years after the president's term ends pursuant to the Presidential Records Act, with some logs remaining secret for up to 12 years. Visitor logs of certain executive agencies, such as the Office of Management and Budget, might be obtained sooner through Freedom of Information Act (FOIA) requests.\nLegal experts told ABC News that Trump's stated policy on visitor logs appears to follow both the law and settled practice prior to the Obama administration.\nSpecifically, it was Judge Merrick Garland -- Obama’s unsuccessful nominee for the U.S. Supreme Court -- who ruled in August 2013 that White House visitor logs are not considered \"agency records\" subject to FOIA requests. That ruling is currently being challenged in the Second Circuit Court of Appeals by watchdog groups committed to government transparency.\nTom Fitton, president of the conservative-leaning Judicial Watch, said he is disappointed by the Trump administration's decision to keep the names of White House visitors secret, but told ABC News that he agrees with Spicer that Obama engaged in \"faux transparency.\"\n\"We only saw the visitor logs he wanted us to see,\" Fitton said.\nBut others said the Obama policy had been a laudable break from past policies.\n\"President Obama administratively flipped the presumption from one of opaqueness to one of openness,\" said Michael W. Macleod-Ball, chief of staff of the ACLU Washington Legislative Office.\nMacleod-Ball called Spicer’s rationale \"illogical\" and said it \"discounts the value of the non-national security information that was released under Obama that this administration will not be releasing.\"\nHe pointed out that visitor logs revealed that his own organization, the American Civil Liberties Union, had more White House access than any other non-profit group during the Obama years. \"There are many stories in those millions of records, and they are fair game. People can make what they want of that information and without having access all we can do is speculate,\" he said.",
    "source_domain": "abcnews.go.com",
    "title": "Examining the Trump administration's stance on the White House visitor log",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/examining-trump-administrations-stance-white-house-visitor-log/story?id=46852102"
}