{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 08:01:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Today in History",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-46854226.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-46854226",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Tuesday, April 18, the 108th day of 2017. There are 257 days left in the year.\nToday's Highlights in History:\nOn April 18, 1942, during World War II, an air squadron from the USS Hornet led by Lt. Col. James H. Doolittle raided Tokyo and other Japanese cities. The first World War II edition of The Stars and Stripes was published as a weekly newspaper.\nOn this date:\nIn 1775, Paul Revere began his famous ride from Charlestown to Lexington, Massachusetts, warning colonists that British Regular troops were approaching.\nIn 1865, Confederate Gen. Joseph E. Johnston surrendered to Union Maj. Gen. William T. Sherman near Durham Station in North Carolina.\nIn 1906, a devastating earthquake struck San Francisco, followed by raging fires; estimates of the final death toll range between 3,000 and 6,000.\nIn 1925, the first Woman's World's Fair, an eight-day event, opened in Chicago.\nIn 1934, the first laundromat was opened by John F. Cantrell in Fort Worth, Texas; the \"Washateria,\" as it was called, rented four electric washing machines to the public on an hourly basis.\nIn 1945, during World War II, famed American war correspondent Ernie Pyle, 44, was killed by Japanese gunfire on the Pacific island of Ie Shima (ee-eh shee-mah), off Okinawa.\nIn 1946, the League of Nations met for the last time. The International Court of Justice, the judicial arm of the United Nations, held its first sitting in The Hague, Netherlands.\nIn 1956, American actress Grace Kelly married Prince Rainier (ray-NEER') of Monaco in a civil ceremony. (A church wedding took place the next day.)\nIn 1966, \"The Sound of Music\" won the Oscar for best picture of 1965 at the 38th Academy Awards. The first Major League baseball game played on AstroTurf took place at the Houston Astrodome as the Los Angeles Dodgers defeated the Astros 6-3. Bill Russell was named player-coach of the Boston Celtics, becoming the NBA's first black coach.\nIn 1978, the Senate approved the Panama Canal Treaty, providing for the complete turnover of control of the waterway to Panama on the last day of 1999.\nIn 1983, 63 people, including 17 Americans, were killed at the U.S. Embassy in Beirut, Lebanon, by a suicide bomber.\nIn 1996, Israeli shells killed 107 Lebanese refugees in a United Nations camp; Israel called the attack an \"unfortunate mistake.\" Gunmen opened fire at a hotel in Egypt, killing 18 Greek tourists they'd mistaken for Israelis.\nTen years ago: The Supreme Court, in a 5-4 ruling, upheld the Partial Birth Abortion Ban Act, saying it did not violate a woman's constitutional right to an abortion. Four large bombs exploded in mainly Shiite locations of Baghdad, killing at least 183 people. Mark Buehrle (BUR'-lee) of the Chicago White Sox faced the minimum 27 batters in a 6-0 no-hit victory over the Texas Rangers. Curtis Strange and Hubert Green were elected to the World Golf Hall of Fame.\nFive years ago: Defense Secretary Leon Panetta apologized for gruesome photographs published in the Los Angeles Times that purported to show U.S. soldiers posing with the bloodied remains of dead insurgents in Afghanistan two years earlier. Dick Clark, the ever-youthful television host and producer who helped bring rock 'n' roll into the mainstream on \"American Bandstand\" and rang in the New Year for the masses at Times Square, died in Santa Monica, California, at age 82.\nOne year ago: The U.S. agreed to deploy more than 200 additional troops to Iraq and to send eight Apache helicopters for the first time into the fight against the Islamic State group in Iraq, the first major increase in U.S. forces in nearly a year. The Associated Press won the Pulitzer Prize for public service for documenting the use of slave labor in Southeast Asia to supply seafood to American tables. \"Hamilton,\" Lin-Manuel Miranda's hip-hop stage biography of America's first treasury secretary, won the Pulitzer for drama. At the Boston Marathon, Ethiopians won both the men's and women's races for the first time in history; Lemi Berhanu Hayle won the men's race in 2:12:45 and Atsede Baysa won the women's race in 2:29:19.\nToday's Birthdays: Actor Clive Revill is 87. Actor James Drury is 83. Actor Robert Hooks is 80. Actress Hayley Mills is 71. Actor James Woods is 70. Actress-director Dorothy Lyman is 70. Actress Cindy Pickett is 70. Country musician Walt Richmond (The Tractors) is 70. Country musician Jim Scholten (Sawyer Brown) is 65. Actor Rick Moranis is 64. Actress Melody Thomas Scott is 61. Actor Eric Roberts is 61. Actor John James is 61. Rock musician Les Pattinson (Echo and the Bunnymen) is 59. Author-journalist Susan Faludi is 58. Actress Jane Leeves is 56. Ventriloquist/comedian Jeff Dunham is 55. Talk show host Conan O'Brien is 54. Bluegrass singer-musician Terry Eldredge is 54. Actor Eric McCormack is 54. Actress Maria Bello is 50. Actress Mary Birdsong is 49. Actor David Hewlett is 49. Rock musician Greg Eklund (The Oolahs) is 47. Actress Lisa Locicero is 47. TV chef Ludovic Lefebvre is 46. Actor David Tennant is 46. Country musician Marvin Evatt (EH'-veht) is 43. Rock musician Mark Tremonti is 43. Rhythm-and-blues singer Trina (Trina and Tamara) is 43. Actress Melissa Joan Hart is 41. Actor Sean Maguire is 41. Actor Kevin Rankin is 41. Actor Bryce Johnson is 40. Reality TV star Kourtney Kardashian (kar-DASH'-ee-uhn) is 38. Actress America Ferrera is 33. Actress Vanessa Kirby (TV: \"The Crown\") is 29. Actress Alia Shawkat is 28. Actress Britt Robertson is 27. Actress Chloe Bennet is 25. Rock singer Nathan Sykes (The Wanted) is 24. Actor Moises Arias is 23.\nThought for Today: \"Logic will get you from A to B. Imagination will take you everywhere.\" — Albert Einstein, German-American physicist (born 1879, died this date in 1955).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-46854226"
}