{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 04:14:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Mattis' reassurance tour in Europe could include US requests",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmattis-reassurance-tour-europe-include-us-requests-45499877.json",
    "image_url": "http://abcnews.go.com/International/wireStory/mattis-reassurance-tour-europe-include-us-requests-45499877",
    "language": "en",
    "localpath": null,
    "maintext": "For Defense Secretary Jim Mattis, the next few days will be a reassurance tour with a twist.\nAs much he'll tell allies the U.S. is committed to NATO, he also is expected to visit Europe with a hand out, hoping to secure bigger defense spending commitments and greater assistance in military campaigns in Afghanistan and elsewhere.\nMattis also will field questions on national security adviser Michael Flynn's resignation over his pre-inauguration discussions with Russia, and what the change means for U.S. policy on Moscow.\nSpeaking to reporters on the way to a NATO defense ministers' meeting, Mattis said Flynn's departure \"has no effect at all\" on him.\n\"Frankly, this has no impact,\" he said. \"I haven't changed what I'm heading there for. It doesn't change my message at all. Who is on the president's staff is who I will work with. And so, you know, it's full speed ahead.\"\nMattis also reinforced earlier comments he's made on NATO's importance.\nCalling it \"the most successful military alliance in history,\" he told reporters on the plane that \"our commitment remains to NATO.\" But he said allies need to discuss increasing their military funding to the benchmark goal of 2 percent of gross domestic product.\nAfter spending his first official trip telling America's Asian allies they wouldn't be abandoned, Mattis is on a similar journey in Brussels and Munich this week, where he will have to address the mixed messages from President Donald Trump on the value of NATO before and after he took office.\n\"I think there will be a lot of reassuring words spoken over the next week,\" said Derek Chollet, a former senior defense official who is now senior adviser at the German Marshall Fund.\nNations want Mattis to maintain the U.S. commitment to providing military support and troops to bolster Poland and the Baltics, who feel threatened by Russia, he said. While Mattis' words may provide some comfort, Chollet said: \"It will leave the question: What does the president think? If anything, the sum total of all of this will just perpetuate the confusion.\"\nWednesday marks Mattis' first NATO meeting as defense secretary. During his Senate confirmation hearing last month, the retired Marine general said he wanted the U.S. to \"maintain the strongest possible relationship with NATO.\"\nWith remarks such as those, Mattis has distanced himself from Trump's criticism of the military alliance and threats that the U.S. might not defend allies that don't fulfill their financial obligations as NATO members.\nMattis, however, is aligned with Trump's call for the 27 NATO members to meet the defense spending requirement. Only a few are currently hitting the 2 percent mark, while the U.S. spends more on its armed forces than all the others combined. Washington also foots more than 22 percent of NATO's commonly funded budget.\nThe U.S. also would like to see an increased NATO commitment in Afghanistan, where forces have been fighting the Taliban for more than 15 years, since the Sept. 11, 2001 attacks. Washington wants more trainers in Afghanistan, where about 8,400 American troops are still deployed.\nThere also will be discussions about how to accelerate the newer, U.S.-led campaign to defeat the Islamic State group in Iraq and Syria.\nEurope's leaders will first be looking for clarity from Mattis. They're still rattled by Trump's declarations that NATO is \"obsolete\" and his repeated praise for Russian President Vladimir Putin.\nSuch comments have triggered fears Trump will ease sanctions imposed on Moscow after it annexed Ukraine's Crimea region in 2014 and supported an insurgency in eastern Ukraine. Another concern: lessened U.S. military support for eastern European allies near Russia's border who worry about being the next target.\nDuring his confirmation hearing, Mattis told senators that he has discussed NATO with the president and that Trump was \"open\" to changing his position. Among Mattis' first calls after Trump's inauguration was one to NATO Secretary-General Jens Stoltenberg.\nIn recent weeks, Trump's public statements on NATO have softened somewhat.\nAfter meeting Trump, British Prime Minister Theresa May told reporters that he assured her he was \"100 percent\" behind NATO. A joint statement issued after Trump and German Chancellor Angela Merkel spoke by telephone said the two agreed on the \"fundamental importance that the NATO alliance has for trans-Atlantic relations\" and the need for all members to pay their fair share. Trump made similar comments in a call with French President Francois Hollande.\nOnly four countries other than the U.S. — Britain, Estonia, Greece and Poland — are meeting NATO's spending target. Many are increasing their budgets in response to Russia's actions.",
    "source_domain": "abcnews.go.com",
    "title": "Mattis' reassurance tour in Europe could include US requests",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/mattis-reassurance-tour-europe-include-us-requests-45499877"
}