{
    "authors": [
        "Abc News",
        "More Alexandra"
    ],
    "date_download": "2018-07-04 22:17:44+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Two men are dead and five others were injured after a large tree branch fell during Fourth of July celebration fireworks.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FNews%2Fdead-tree-branch-falls-fourth-july-fireworks%2Fstory%3Fid%3D56364424.json",
    "image_url": "https://s.abcnews.com/images/US/tree-branch-accident-courthouse-2-ktrk-thg-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two men are dead and five others were injured after a large tree branch fell on them during Fourth of July celebration fireworks, officials said.\nResidents were gathered on the lawn of the Rock Island, Illinois courthouse Tuesday night to watch the fireworks for the Fourth of July when suddenly a branch from a tree estimated to be more than 100 years old on the courthouse lawn fell, Rock Island County Sheriff Gerry Bustos said.\nThe branch. measured to be more than 8 feet wide at its base and 45 feet long, fell about 25 feet to the ground, striking the spectators below, Bustos said.\nKTRK\nDaniel Mendoza Sr., 61, died at the scene and Lawrence Anderson, 72, was rushed to Unity Point Hospital where he was later pronounced deceased, the sheriff said.\nFive other people were injured, one of them a pregnant woman, Bustos said. She was near full term at the time of the accident and was taken to Unity Point Hospital where she gave birth, according to the sheriff. Both mother and child are reported to be in good health, he said.\nKTRK\nThe other four people injured were treated for cuts, bruises and suspected concussions and have since been released from the hospital, the sheriff said.\nAuthorities are still investigating why the branch fell.\n\"The tree, although old, was in good health as best you could tell from looking at it,\" Bustos said.",
    "source_domain": "abcnews.go.com",
    "title": "Two dead after tree branch falls during Fourth of July fireworks",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/News/dead-tree-branch-falls-fourth-july-fireworks/story?id=56364424"
}