{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 13:46:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Bills new receiver Jordan Matthews out with chest injury",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fbills-receiver-matthews-chip-fracture-sternum-49203882.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/bills-receiver-matthews-chip-fracture-sternum-49203882",
    "language": "en",
    "localpath": null,
    "maintext": "Buffalo Bills newly acquired receiver Jordan Matthews has a chip fracture in his sternum and is listed as week to week.\nThe team provided the update Monday, a day after Matthews hurt his upper chest in his first practice since joining the team in a trade with the Philadelphia Eagles. Matthews finished practice before being escorted off the field to be evaluated.\nGeneral manager Brandon Beane told The Associated Press the team was \"still figuring it out\" regarding the injury and recovery time.\nThe Bills are counting on Matthews to fill Sammy Watkins' spot after he was dealt to the Los Angeles Rams for cornerback E.J. Gaines and a second-round draft pick in a separate trade on Friday. Buffalo gave up starting cornerback Ronald Darby to acquire Matthews and a third-round draft pick from Philadelphia.\nIt's unclear when Matthews was hurt, though he did fall hard along the sideline while attempting to make a leaping catch in one-on-one coverage with cornerback Shareece Wright during a drill.\nAside from the draft picks, Matthews was the key addition in addressing Buffalo's more immediate needs on what is now a retooled group of receivers. Buffalo lost starter Robert Woods and speedster Marquise Goodwin in free agency this past offseason.\nThe Bills were looking for Mathews to play alongside Anquan Boldin, who was signed last week, and rookie second-round draft pick Zay Jones. Also competing for jobs are Walt Powell and offseason free-agent additions Andre Holmes and Rod Streater.\nThough not considered as dynamic of a deep threat as Watkins, Matthews has been consistent in his first three seasons with the Eagles. He was Philadelphia's most productive receiver with 2,673 yards and 19 touchdowns. He became just the fifth NFL player to top 65 catches and 800 yards in each of his first three seasons.\nMatthews was to have made his preseason debut Thursday, facing his former team when Buffalo plays at Philadelphia.\n———\nAP NFL website: www.pro32.ap.org and www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Bills new receiver Jordan Matthews out with chest injury",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/bills-receiver-matthews-chip-fracture-sternum-49203882"
}