{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 00:15:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "A hurricane warning is in effect for New Orleans as Tropical Storm Nate continues to strengthen.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fhurricane-warning-effect-orleans-50335775.json",
    "image_url": "http://a.abcnews.com/images/US/171006_vod_new_orleans2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Hurricane warning in effect for New Orleans\nFriday after them now and changes eat up your house down you know son and that. This season feels lock. We understand but now we have capped a stormy so you know my personal reasons latest information is that right now the note. We don't want tracking this thing for a couple of days now. And really it's gonna move fast I think every instant katic get into position realize it happening this is coming to Gulf Coast within the next 24 hours and extend life I think that's important to get out there. Let's go through a couple few questions and you joining us right now on ABC world news tonight. FaceBook page. Post them out answer. And many. Of indictment and some disease he starting with the position it is just east and southeast of the Yucatan peninsula seek. C Cancun and cuts amount that's what most people ill at. East has now get past. And married a hurricane watch so it looks like a slide either right along just east of the Yucatan. Obviously less interaction with land means the ability court to stay organized. Because it could affect the impact Atlanta Moore is also a stone has already killed dozens. Or at least close to two doesn't think an Central America. With that mudslides and all that rain flash flooding. Attack and it goes into the golf. And it moves fast break outscored 21 miles per that it last that's fast. And there's a lot of forcing factors that help. Keep it moving so you can see the timing here that's Saturday at 1 PM somebody outer bands and look miles computer here already. Reaching by Saturday act into. Its. Well. At least five inches of rain letting it live at flash flooding. Only three to five inches easily see that with this. Some places could see a Catholic or even which. That's 2 PM my heart and go forward with this is that it. Way to showcase. 60. That's an audit late kind of outer band but really getting closer to 6 PM on Saturday August 24 hours now. And I'm. And then let PM. Basically it's its right there aren't that it's literally right and that's why he's at this because I Mexico right now at twenty rationale it's there. So its its ally. Making landfall. Louisiana. Decade restaurants and Nittany. All the fishing and tourism. That's right there between. Biloxi violence. I L Robert Robertson lessons. Her family would be affected by this remember if we're talking about at tropical storm or tropical anything. That writes that went up water test pilot even greater so if you are east of this in the last year over it through mobile day. Overtook Gulf Shores, Alabama. Any in Pensacola. Still pick up significant storms it will that'll be the most arms are at highest and young. Let you play Ukraine. So we don't leave anybody up there and it goes north into the Mississippi just east ice bag. That's Sunday 6 AM Artie but Sunday morning it makes it happens when Sunday torrential rains happening flash flooding possible. Between I expert and you know western Alabama. That keeps moving north and slightly east as well fast that's an Atlanta part. It a couple hours. Well let it race but sending units and why are almost a must ask itself it's and it's gonna fall apart. Sell out essential to see. Eastern and central Kentucky. And southern Eileen. So what this movie patch you know Tennessee Ohio River valley. Last appalachians. And then right. And that's Sunday night. True even on day one it's and other remnants cutting its rate break to you know be chopped it anymore. Still have lots of moisture that's happy go back here so hurricane warning. That's new violence Gulfport mobile. Apple is included in Pensacola is in the tropical storm warning look up aren't aren't the tropical storm warning goes. Into Alabama certainly expect panhandle of Florida. At Mississippi and a little further north into Louisiana. So that's again tomorrow night through Sunday morning and then the tract takes it. And it becomes well so I Monday afternoon it's just making its way through Pennsylvania. Maryland West Virginia and out by Tuesday after. That's a fact that the best let me ask that they tropical storm. That is good news that it is. If you travel the aren't. That sits in major issues. It not at because. Rainfall lies and sponsored by as you can still Cadillac here the search for Anna Massey that little bit over here. One to three feet. The Pensacola to Gulf Shores to mobile bay back into gulf port and Angela seats its Al all of these this area. It's up to eight feet. That's all area that's fort sixty. A lot of water. These places act at our dollar goes to use NC. So it very susceptible systems age you. And there's the heaviest rain. There. Mississippi gulf port. And even heavy rains I'll Tennessee values with the packages funny potential stretching. Up and parents mountain. That's where rain forecast all parties you can CNN it. Right on track that get news let me take your rates need New England. That's Sunday and Monday without eating an east hear from people ash. Planes and stuff so. Alerts arch area and specific questions ancestry now I instantly but. It. It's that kind it actually. Pre answer questions. As. This. Way. The question. At. The end and the low lying areas that's always it no matter what Apple's. Way. Pat the highlands water. Power of that water even lower at six to twelve area it's. Crucial to. As well where is covered Hurricane Katrina. We've just about heard it with two. An. Act. That's actually seen exact I mean it's only August that was a category one at significant rain on Wednesday. Teens when he mentions that lottery and that there's plenty of flooding. That looked a little slower and bigger at the time this happened accidentally become category one hurricane before it makes landfall. And I definitely think all parties want places that is legally. Your right there won't let heavy rain. It definite. Close to that the worst highs of the storm six. I'm and then this thing makes its way north and northwest. You are in here golf or a hurricane warning. So we're so that's gonna start tomorrow afternoon evening and go through early Sunday morning. And relatively. Near Gulfport and yet it could be right in that general area and that's Sunday. Around 1 AM let's start obviously as the sham future cast at least part that Saturday the union. Yet other people are very sensitive. In Mississippi. Because post-Katrina New Orleans did and that. Having built levees break and having a lot of the attention go to them but in the storm itself and treat Gulfport took. But the biggest storm hit you mean as far as storm surge and wind damage. That's right covered in France I got all of that first and they got to see and talk to the people and an even in years later. Seven years later and out there for I think can't say that people are still think. People say don't forget about us as here at. Its fare better under it pleases. Along the coast and ports Gulfport Gulfport he. At least back and her. Husband and I. Industries. That would definitely. Lines and areas that are warning that high. I. It might well past hour talking. With. I. He. Eat and it isn't this all is split office at any act. This and the US and just axes speculation that hurt me and it causes friction. Causes an action plan that you are at. Herky is just beaten that is arms. And that it man and now we call which giving them immediate. It's relatively easy and tornadoes. That. People of Pennsylvania West Virginia. Eight pact. You act on the art and pat and its currency to war even higher amounts. From remnants. That's. 88. 88. It's a kids and it was a beautiful. Cloudless this week. But on Catholic Church three part at all. These. Mom. And that's. All. I just aren't as it right now. That they now Aniston admits that it's funny is that semantics mean a lot of people so. Will the center go over Pensacola looking like it would be less. I remember the worst some of heavy bands of rain can be easily that Far East that unit tropical strong wind also have the potential flash flooding. And some. 13 feet modest or change and that's. You're still seeing some acts. And that. Atlantic and the events page eighteen and at least night 6 PM eastern time I think centrum. We're going to be on tonight and you even more updates that. And the afternoon. It.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Hurricane warning in effect for New Orleans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/hurricane-warning-effect-orleans-50335775"
}