{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 07:52:44+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Sudan, the rhino, died after 'age-related complications'.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fworlds-male-northern-white-rhino-sudan-dies-53867444.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_aeacf097df4c4324987ee04e2fea4c7c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Animals? Add Animals as an interest to stay up to date on the latest Animals news, video, and analysis from ABC News. Add Interest\nThe world's last male northern white rhino, Sudan, has died after \"age-related complications,\" researchers announced Tuesday, saying he \"stole the heart of many with his dignity and strength.\"\nA statement from the Ol Pejeta Conservancy in Kenya said the 45-year-old rhino was euthanized on Monday after his condition \"worsened significantly\" and he was no longer able to stand. His muscles and bones had degenerated and his skin had extensive wounds, with a deep infection on his back right leg.\nThe rhino had been part of an ambitious effort to save the subspecies from extinction after decades of decimation by poachers, with the help of the two surviving females. One is his daughter, Najin, and the other is her daughter, Fatu.\nHis death won't have an impact on the efforts to save the subspecies, as the focus turns to in vitro fertilization techniques using stored semen from other dead rhinos and eggs extracted from the two remaining females.\n\"He was a great ambassador for his species and will be remembered for the work he did to raise awareness globally of the plight facing not only rhinos, but also the many thousands of other species facing extinction as a result of unsustainable human activity,\" said the conservancy's CEO, Richard Vigne.\nSudan was something of a celebrity, attracting thousands of visitors. Last year he was listed as \"The Most Eligible Bachelor in the World\" on the Tinder dating app in a fundraising effort.\nThe last male northern white rhino had been born in Sudan, the last of his kind to be born in the wild.\nHe was taken to a Czech zoo and then transferred to Kenya in 2009 with the three other remaining fertile northern white rhinos at the time. They were placed under 24-hour armed guard and fed a special diet. \"However, despite the fact that they were seen mating, there were no successful pregnancies,\" the conservancy said.\nRangers caring for Sudan described him as gentle and, as his condition worsened in recent weeks, expressed sadness over his imminent death.\nThe rhino \"significantly contributed to survival of his species as he sired two females,\" the conservancy said. \"Additionally, his genetic material was collected yesterday and provides a hope for future attempts at reproduction of northern white rhinos through advanced cellular technologies.\"\nThe only hope for preserving the subspecies \"now lies in developing in vitro fertilization techniques using eggs from the two remaining females, stored northern white rhino semen from males and surrogate southern white rhino females,\" the statement said.\nSudan's death \"is a cruel symbol of human disregard for nature and it saddened everyone who knew him. But we should not give up,\" said Jan Stejskal, director of international projects at Dvur Kralove Zoo in the Czech Republic. \"It may sound unbelievable, but thanks to the newly developed techniques even Sudan could still have an offspring.\"\nNorthern white rhinos once roamed parts of Chad, Sudan, Uganda, Congo and Central African Republic, and were particularly vulnerable because of the armed conflicts that have swept the region over decades.\nOther rhinos, the southern white rhino and another species, the black rhino, are under heavy pressure from poachers who kill them for their horns to supply illegal markets in parts of Asia.\nRoughly 20,000 southern white rhinos remain in Africa. Their numbers dipped below 100 around a century ago, but an intense effort initiated by South African conservationist Ian Player in the mid-20th century turned things around.\n———\nAssociated Press writer Christopher Torchia contributed.\n———\nFollow Africa news at https://twitter.com/AP—Africa",
    "source_domain": "abcnews.go.com",
    "title": "World's last male northern white rhino, Sudan, dies",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/worlds-male-northern-white-rhino-sudan-dies-53867444"
}