{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 13:43:16+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Analysis: Nobel lets Korea nuke players know they 'are watching'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fanalysis-nobel-korea-nuke-players-watching-50322267.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_ed41d34ebdff4476bb99b280705323bb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "They couldn't award it to Kim Jong Un or Donald Trump; that much was certain.\nBut the granting of the Nobel Peace Prize to the International Campaign to Abolish Nuclear Weapons opened itself to a clear interpretation across Asia: When it comes to the nuclear-saturated war of words on the Korean Peninsula, attention must be paid and treaties must be signed. And it must be done in a preventative way, at top speed, before something happens that can't be undone.\nLooming in the background of the award announcement Friday was the sometimes scalding, sometimes tepid, never silent geopolitical scuffle this year between the young leader of the third-generation Pyongyang regime and the always voluble president of the United States.\nEven the Nobel committee's language keyed in on that. It sounded like a plaintive cry to push parties to the negotiating table — to fix something that's already cracked before it's completely, irreversibly shattered.\nThe head of the group listed an assortment of the world's nuclear nations when she spoke after the win. But it was easy to find significance in the two she mentioned before all others — North Korea and the United States.\nAnd this was the immediate assessment from a Nobel historian: \"The panel wants to send a signal to North Korea and the U.S. that they need to go into negotiations.\" The prize, Oeivind Stenersen suggested, was also \"coded support\" of the Iran nuclear deal.\nThis year's Geneva-based winner, known as ICAN, was cited \"for its work to draw attention to the catastrophic humanitarian consequences of any use of nuclear weapons and for its ground-breaking efforts to achieve a treaty-based prohibition of such weapons.\"\n?From the vantage point of the Korean Peninsula and its surrounding countries, where people shudder weekly at volleys of intemperate words and missile or bomb tests, such a treaty seems a distant dream. And few of the key players seem anywhere near a Nobel Peace Prize.\nNorth Korea just conducted its sixth and by far largest nuclear test, moving closer to its goal of mounting a nuclear warhead on an intercontinental ballistic missile.?It has repeatedly threatened to obliterate the United States from the map.\nSuch bellicose language from the North is common. It has spent years issuing over-the-top dispatches through its propaganda apparatus promising to destroy the United States.\nIn recent months, however, Pyongyang's invective has been matched almost blow by blow for the first time by equally aggressive language from Washington under the Trump administration, or at least Trump himself. The U.S. president has shown no hesitation in cutting through the niceties of diplomatic lingo to excoriate the North and threaten to wipe it out of existence.\nHe has dubbed Kim \"Little Rocket Man\" and said his regime may not be long for this world.?The U.S., of course, has one of the world's largest nuclear arsenals, even after significant reductions since the Cold War. It remains the only nation on the planet to use nuclear weapons during a war.\nIn the past four weeks alone, Trump has used words like these, in a recent tweet: \"Just heard Foreign Minister of North Korea speak at U.N. If he echoes thoughts of Little Rocket Man, they won't be around much longer!\"\nAnd Kim, who bestowed upon Trump the rarely used insult \"dotard\" and pronounced him senile, has used words like these:\n\"Now that Trump has denied the existence of and insulted me and my country in front of the eyes of the world and made the most ferocious declaration of a war in history that he would destroy (North Korea), we will consider with seriousness exercising of a corresponding, highest level of hard-line countermeasure in history.\"\nPublic posturing, sure. But not exactly language that points the way toward common ground, either.\nThe tension in word and deed between Washington and Pyongyang has faded slightly in recent days as the in-the-moment news cycle marches forward, but history shows that to be temporary. Another early-morning missile test, another intemperate remark or worse will put it right back on center stage.\nThe awarding of the $1.1 million prize to ICAN helps that happen, too, though even the group's executive director, Beatrice Fihn, said she \"worried it was a prank at first\" when she got the call from the Nobel committee.\nAgainst this backdrop — and in Northeast Asia, a region that remains the only place where nuclear weapons were used against a civilian population during a war — the awarding of the Nobel Peace Prize in this manner implies one key point.\nThe influential body, which often uses the prize to set the agenda of where the light gets shone, is saying to Kim Jong Un and Donald Trump, among others: We've got our eye on you, and the world needs to look harder, too.\n———\nTed Anthony, the Bangkok-based director of Asia-Pacific news for The Associated Press, has traveled to North Korea multiple times since 2014. Follow him on Twitter at @anthonyted",
    "source_domain": "abcnews.go.com",
    "title": "Analysis: Nobel says to Korea nuke players: We are watching",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/analysis-nobel-korea-nuke-players-watching-50322267"
}