{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:04:24+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2F142-charged-la-crackdown-illegal-marijuana-businesses-55548382.json",
    "image_url": "https://abcnews.go.com/US/wireStory/142-charged-la-crackdown-illegal-marijuana-businesses-55548382",
    "language": "en",
    "localpath": null,
    "maintext": "Prosecutors have brought the first criminal charges against 142 people as they aim to tamp down the growing illegal marijuana market in Los Angeles since the state legalized recreational use in January, officials said Wednesday.\nThe charges involve employees of 32 commercial cannabis companies and a business that delivers marijuana, said City Attorney Mike Feuer.\n\"The combination of significant amounts of cash and marijuana at these locations can make them dangerous,\" Feuer said.\nRecreational cannabis businesses must be licensed by both the city and state. So far, only 147 city licenses have been issued to sell adult-use, recreational cannabis in Los Angeles. Many illegal marijuana shops operate in plain sight — out of storefronts in busy neighborhoods.\nSince the beginning of the year, officers targeting illegal marijuana businesses have served 54 search warrants and arrested 160 people, which includes the 142 people charged by the city attorney, said Lt. Stacy Spell of the LAPD's Gang and Narcotics Division.\nInvestigators have been prioritizing going after shops that are causing crime and generating complaints from the community, he said.\n\"We've tried to be very responsible with taxpayer money, understanding that we have limited resources and are not able to necessarily address all of the locations,\" Spell said.\nIn addition to the misdemeanor criminal charges, the city attorney's office will also send cease-and-desist letters to other illegal cannabis businesses that prosecutors have identified, Feuer said. He declined to say how many letters would be sent.\nEarlier this year, state regulators sent similar letters to about 1,000 marijuana businesses they said were operating illegally statewide.\n———\nMike Balsamo is a member of AP's marijuana beat team. Follow him on Twitter at twitter.com/MikeBalsamo1 . Find complete AP marijuana coverage here: apnews.com/tag/LegalMarijuana .",
    "source_domain": "abcnews.go.com",
    "title": "142 charged in LA crackdown on illegal marijuana businesses",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/wireStory/142-charged-la-crackdown-illegal-marijuana-businesses-55548382"
}