{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 00:18:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Authorities: 3 Alaska hikers injured in bear run-in",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fauthorities-alaska-hikers-injured-bear-run-48043943.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_f41122d5fc0f4bd6ab1dffe02f3e2408_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Three juveniles were mauled Wednesday after coming across a grizzly bear and her two cubs while they were hiking in a heavily wooded area just north of Alaska's largest city, in an area were two aggressive bears have already been killed this week.\nAnchorage authorities said four young people were hiking in the woods around the Eagle River campground when three of them were injured after running into the bear and two young cubs. Police said in a release that the juveniles were taken to a hospital with non-life-threatening injuries. The fourth youth wasn't injured.\n\"It's possible this group just surprised a mother brown bear,\" Alaska Department of Fish and Game spokesman Ken Marsh said. \"She reacted defensively, pretty much in brown bear fashion.\"\nAnchorage police said that while responding officers were searching for the hikers, they were charged by the bear and shot at it. The bear took off into the woods, Armed game officers took up the search, Marsh said.\nThe officers followed specks of blood up a river, but the trail dissipated. Marsh said that indicates whichever bear was shot was not mortally wounded.\nThe search for the bears was called off after about three hours and would not resume. Instead, he said signs warning people of bear activity in the area would be posted.\n\"It's that time of year when we're having fairly decent weather and a lot of people are getting out,\" he said. \"People just need to be bear aware.\"\nGame officials said two bears were killed in the Eagle River area earlier this week. Eagle River is an Anchorage suburb, located about 10 miles north of the city.\nA black bear that was part of a group of three on a homeowners property was killed, but officials didn't immediately know the circumstances. Authorities say a brown bear was also killed after it raided a chicken coop in an Eagle River neighborhood.\nSo far this year, seven bears have been killed statewide in defense of life and property, Anchorage television station KTVA reported.\nThe municipality of Anchorage covers more than 1,960 square miles, which is larger than the state of Rhode Island. Anchorage's population of about 300,000 humans shares that space with up to 350 black bears and about 65 brown bears, according to the Fish and Game website.\n———\nThiessen reported from Anchorage, Alaska. Associated Press writer Becky Bohrer in Juneau, Alaska, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Authorities: 3 Alaska hikers injured in bear run-in",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/authorities-alaska-hikers-injured-bear-run-48043943"
}