{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 15:53:24+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Stronger economy lifts bond yields; stocks hold at records",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fstronger-economy-lifts-bond-yields-stocks-hold-records-45509183.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/stronger-economy-lifts-bond-yields-stocks-hold-records-45509183",
    "language": "en",
    "localpath": null,
    "maintext": "Bond yields climbed again on Wednesday and U.S. stocks held close to their record highs after more reports showed the economy continues to strengthen. The encouraging data could push the Federal Reserve to raise interest rates sooner rather than later in its gradual move away from record low rates during the Great Recession.\nKEEPING SCORE: The Standard & Poor's 500 index was close to flat at 2,338 as of 9:57 a.m. Eastern time. The index closed at a record high Tuesday after rising for the sixth straight day. The Dow Jones industrial average rose 37 points, or 0.2 percent, to 20,541. The Nasdaq composite rose 8, or 0.1 percent, to 5,790.\nENCOURAGING ECONOMIC GAINS: Wednesday's economic reports give the Federal Reserve more leeway to raise interest rates. Retailers had stronger sales in January than economists expected, and inflation at the consumer level was the highest in years. Consumer prices rose 2.5 percent in January from a year earlier, the highest rate since March 2012.\nFed Chair Janet Yellen said in testimony before a Senate committee on Tuesday that the strengthening job market and a modest move higher in inflation should warrant continued, gradual increases in interest rates. The central bank raised rates in December for just the second time in a decade, after keeping rates at nearly zero to help lift the economy out of the Great Recession. Yellen speaks before a House committee Wednesday.\nBOND YIELDS: Treasury yields jumped immediately after the release of the retail sales and inflation reports. The 10-year yield rose to 2.50 percent from 2.47 percent late Tuesday. The two-year yield inched up to 1.25 percent from 1.24 percent, and the 30-year yield rose to 3.09 percent from 3.06 percent.\nDAMPENED DIVIDEND DEMAND: When bonds are paying more in interest, it can mean less demand from income investors for stocks that pay big dividends. Utility stocks, which are some of the biggest dividend payers, fell 1.2 percent, the largest loss among the 11 sectors that make up the S&P 500. Real-estate investment trusts and telecom stocks are also go-to buys for dividend seekers, and they were weak as well.\nGLOBAL MARKETS: In Europe, the German DAX index lost 0.2 percent, while the French CAC 40 and U.K. FTSE 100 each added 0.4 percent. In Asia, Japan's Nikkei 225 index rose 1 percent, Hong Kong's Hang Seng rose 1.2 percent and the Kospi in South Korea gained 0.4 percent.\nCURRENCIES: The strong U.S. economic reports helped lift the value of the dollar against many of its rivals. The dollar ticked up to 114.64 Japanese yen from 114.22 late Tuesday. The euro fell to $1.0557 from $1.0572, and the British pound dipped to $1.2411 from $1.2465.\nCOMMODITIES: Benchmark U.S. crude rose 2 cents to $53.22 per barrel. Brent crude, the international standard, lost 11 cents to $55.85 in London. Natural gas rose 5 cents to $2.96 per 1,000 cubic feet.\nGold slipped 30 cents to $1,225.10 per ounce, silver was close to flat at $17.89 per ounce and copper was flat at $2.74 per pound.",
    "source_domain": "abcnews.go.com",
    "title": "Stronger economy lifts bond yields; stocks hold at records",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/stronger-economy-lifts-bond-yields-stocks-hold-records-45509183"
}