{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:51:28+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "The memo was authored by Republican staff of the House Intelligence Committee.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fgop-memo-alleges-fbi-doj-abused-government-surveillance-52806992.json",
    "image_url": "http://a.abcnews.com/images/Politics/180202_nwo_trump_russia_memo_MIX_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for GOP memo alleges FBI and DOJ abused government surveillance powers in Russia probe\nIt was declassified. And let's hear what happened. Lot of people should be ashamed president trump against the recommendation of his own FBI director declassified a controversial memo written by Republican members of the House Intelligence Committee. The memo posted this afternoon is critical of deputy attorney general rob Rosen Stein and others for their roles in renewing a surveillance warrant on former trump campaigning Carter page. At its crux the memo argues that the FBI and Department of Justice used information from Christopher steals unsubstantiated dossier to renew their finds a surveillance warrant against paid without disclosing that the dossier was paid for in part the Clinton Campaign this dossier was the foundational. Basis. Or spying on American citizens Democrats in the committee have charged that the memo cheery picks thaksin critiques the chair DeVon unit at trump LA. For releasing misleading allegations. Calling it a shameful effort to discredit these institutions undermine the special counsel's ongoing investigation and undercut congressional probes and former FBI director James Conley tweets that sits dishonest and misleading memo wreck the house Intel committee destroyed trust with intelligence community and image relationship with finds a court in inexcusable he exposed class fine investigation I'm an American citizen. Four white DOJ and FBI must keep doing their jobs. Critics charge that this is all an effort to compromise the special counsel Robert smaller and the one man who could fire him. Deputy attorney general rob rose and Stein the president was asked the memo makes him more likely to fire Rosen Stein. You figure that one out. The top Democrat on the committee congressman Adam Schiff says that the memo tells a political story to help the president. And already Democrats are warning that if the president did in fact trying use the memo as a basis for trying to fire roads and sign or Muller. That it would be considered an attempt to obstruct justice. Lana Zack ABC news Washington.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "GOP memo alleges FBI and DOJ abused government surveillance powers in Russia probe",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/gop-memo-alleges-fbi-doj-abused-government-surveillance-52806992"
}