{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 08:07:45+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Kelly, McCoy, Baalke Latest to Feel the NFL Ax",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fkelly-mccoy-baalke-latest-feel-nfl-ax-44507991.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/kelly-mccoy-baalke-latest-feel-nfl-ax-44507991",
    "language": "en",
    "localpath": null,
    "maintext": "Bono and the guys in U2 are big football fans, as in soccer.\nSo when they sang about \"Sunday Bloody Sunday\" and \"New Year's Day,\" they had no intention of describing the end of the 2016 NFL season.\nYet, the firings of Chip Kelly and Trent Baalke in San Francisco, Mike McCoy in San Diego, and the resignation of Gary Kubiak for health reasons in Denver certainly rang true to those rock classics.\nUsually, the axings take place the day after the regular season concludes. Except, of course, for the teams in a rush to get into the personnel market extra early, which in '16 were the Jaguars (Gus Bradley), Rams (Jeff Fisher) and Bills (Rex Ryan).\nOn Sunday, while other franchises were scrambling to make the playoffs or improve their postseason standing, the coaching carousel spun wildly in California. With Fisher already canned in Los Angeles, Kelly and McCoy became unemployed within an hour of each other.\nBoth moves were predictable, as was the release of Baalke, whose success as a GM with the 49ers now, it's clear, was dependent on how Jim Harbaugh molded and improved the players Baalke gave him. Baalke won a power struggle with Harbaugh, who headed to Michigan. The Niners became historically bad without him, and Baalke's choice of Kelly to work with such a weak roster looks worse than hiring caretaker Jim Tomsula after Harbaugh left. At least Tomsula went 5-11, three more victories than Kelly managed.\nIndeed, his only wins in a 2-14 record came against the Rams, so maybe LA owner Stan Kroenke will turn to Kelly.\nDon't count on it.\n\"Despite my feelings for Trent and Chip, I felt the decision to change our football leadership was absolutely necessary,\" 49ers CEO Jed York said in a statement. \"The performance of this team has not lived up to my expectations or those of our fans, and that is truly disappointing. We all expected to see this team progress and develop as the season went on, but unfortunately that did not happen. That is why now is the time to find a new direction for this team.\"\nThe new direction for the Chargers looks like it will be north a bit to become a tenant of Kroenke and the Rams in the new Inglewood, California palace that will open in a few years. McCoy's team lost its last five games and finished second for two straight seasons in the tough AFC West. Injuries tore it apart, too, but with the focus on whether the Chargers would move to LA, it was hard to judge what kind of job McCoy was doing.\nApparently Chargers chairman Dean Spanos wants a totally fresh start when the club abandons its long-time home.\nWhich means both of the new teams in Los Angeles, which was without the NFL since 1995 until the Rams moved back last year, will be riding the coaching carousel.\nMore moves could be coming, too. Is Chuck Pagano safe in Indianapolis? Might the Saints do something with Sean Payton? What about Bears coach John Fox?\nSafe for another year are Todd Bowles and Mike Maccagnan, who the Jets are bringing back. And Cleveland coach Hue Jackson, despite a 1-15 record. And Marvin Lewis despite the meltdown in Cincinnati.\nThe saddest news comes from Denver. Never was there a question about Gary Kubiak returning after leading the Broncos to their Super Bowl win last February. But Kubiak's health issues forced him to step aside, disappointing fans, players and John Elway alike.\n\"We love Kube, we love how he treated us,\" said cornerback Aqib Talib. \"We pray he gets healthy.\"\nDenver won't have any trouble filling Kubiak's spot. One of the hot candidates, for example, is Atlanta offensive coordinator Kyle Shanahan, son of Mike Shanahan, who coached Elway to two Super Bowl championships.\nGiven how well Kubiak fit in the Broncos' family, such a hire makes a lot of sense.\nThen again, sensibility isn't always a criteria in NFL coaching circles.\n———\nFor more NFL coverage: www.pro32.ap.org and http://twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Kelly, McCoy, Baalke Latest to Feel the NFL Ax",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/kelly-mccoy-baalke-latest-feel-nfl-ax-44507991"
}