{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:08:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-10 00:00:00",
    "description": "Today in History",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-51697633.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-51697633",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Sunday, Dec. 10, the 344th day of 2017. There are 21 days left in the year.\nToday's Highlight in History:\nOn Dec. 10, 1817, Mississippi was admitted as the 20th state of the Union.\nOn this date:\nIn 1520, Martin Luther publicly burned the papal edict demanding that he recant parts of his 95 Theses, or face excommunication.\nIn 1898, a treaty was signed in Paris officially ending the Spanish-American War.\nIn 1906, President Theodore Roosevelt became the first American to be awarded the Nobel Peace Prize for helping to mediate an end to the Russo-Japanese War.\nIn 1931, Jane Addams became the first American woman to be awarded the Nobel Peace Prize; the co-recipient was Nicholas Murray Butler.\nIn 1946, newspaperman Damon Runyon, known for his short stories featuring colorful Broadway denizens, died at a New York hospital at age 66.\nIn 1950, Ralph J. Bunche was awarded the Nobel Peace Prize, the first black American to receive the award.\nIn 1964, Martin Luther King Jr. received his Nobel Peace Prize in Oslo, saying he accepted it \"with an abiding faith in America and an audacious faith in the future of mankind.\"\nIn 1967, singer Otis Redding, 26, and six others were killed when their plane crashed into Wisconsin's Lake Monona; one passenger, Ben Cauley, survived.\nIn 1972, baseball's American League adopted the designated hitter rule on an experimental basis for three years.\nIn 1987, President Ronald Reagan and Soviet leader Mikhail S. Gorbachev concluded three days of summit talks in Washington. Violinist Jascha Heifetz died in Los Angeles at age 86.\nIn 1994, Yasser Arafat, Shimon Peres and Yitzhak Rabin received the Nobel Peace Prize, pledging to pursue their mission of healing the anguished Middle East.\nIn 1996, South African President Nelson Mandela signed the country's new constitution into law during a ceremony in Sharpeville.\nTen years ago: Suspended NFL star Michael Vick was sentenced by a federal judge in Richmond, Virginia, to 23 months in prison for bankrolling a dogfighting operation and killing dogs that underperformed (Vick served 19 months at Leavenworth). Madison Square Garden and New York Knicks coach Isiah Thomas reached an $11.5 million settlement of a sexual harassment case brought by former team executive Anucha Browne Sanders. Cristina Fernandez was sworn in as Argentina's first elected female president. Former Vice President Al Gore accepted the Nobel Peace Prize with a call for humanity to rise up against a looming climate crisis and stop waging war on the environment.\nFive years ago: President Barack Obama told auto workers in Michigan that he would not compromise on his demand that tax rates go up for the top 2 percent of American earners to help reduce the deficit. A judge announced that former International Monetary Fund leader Dominique Strauss-Kahn and a New York City hotel maid had signed a settlement of her sexual-assault lawsuit stemming from a May 2011 encounter. Marijuana for recreational use became legal in Colorado.\nOne year ago: Donald Trump's presidential transition team challenged the veracity of U.S. intelligence assessments that Russia had tried to tip the November election to the Republican; Democratic Sen. Chuck Schumer, D-N.Y., said he would press for a congressional investigation in the new year. Louisiana voters chose to send Republican state Treasurer John Kennedy to the nation's capital, filling the nation's last U.S. Senate seat and giving the GOP a 52-48 edge in the chamber when the new term began in January. In college football, Army ended a 14-year run of frustration against Navy with a 21-17 victory. Sophomore quarterback Lamar Jackson became the first Louisville player to win the Heisman Trophy.\nToday's Birthdays: Actor Tommy Kirk is 76. Actress Fionnula Flanagan is 76. Pop singer Chad Stuart (Chad and Jeremy) is 76. Rhythm-and-blues singer Ralph Tavares is 76. Actress-singer Gloria Loring is 71. Pop-funk musician Walter \"Clyde\" Orange (The Commodores) is 71. Country singer Johnny Rodriguez is 66. Actress Susan Dey is 65. Former Illinois Gov. Rod Blagojevich is 61. Jazz musician Paul Hardcastle is 60. Actor John York (TV: \"General Hospital\") is 59. Actor-director Kenneth Branagh (BRAH'-nah) is 57. Actress Nia Peeples is 56. TV chef Bobby Flay is 53. Rock singer-musician J Mascis is 52. Rock musician Scot (cq) Alexander (Dishwalla) is 46. Actress-comedian Arden Myrin is 44. Rock musician Meg White (The White Stripes) is 43. Actress Emmanuelle Chriqui is 42. Rapper Kuniva (D12) is 42. Actor Gavin Houston is 40. Actor Alano Miller is 38. Violinist Sarah Chang is 37. Rock musician Noah Harmon (Airborne Toxic Event) is 36. Actor Patrick John Flueger is 34. Country singer Meghan Linsey is 32. Actress Raven-Symone is 32.\nThought for Today: \"Originality and a feeling of one's own dignity are achieved only through work and struggle.\" — Feodor Dostoyevsky, Russian author (1821-1881).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-51697633"
}