{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:57:54+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Spain extradites suspect thought to be spam kingpin to US",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fspain-extradites-suspect-thought-spam-kingpin-us-52790850.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/spain-extradites-suspect-thought-spam-kingpin-us-52790850",
    "language": "en",
    "localpath": null,
    "maintext": "Spain has extradited to the United States a Russian citizen who is suspected of being one of the world's most notorious spammers.\nPyotr Levashov, a 37-year-old from St. Petersburg, was arrested in April while vacationing with his family in Barcelona.\nU.S. authorities had asked for him to be detained on charges of fraud and unauthorized interception of electronic communications. He was arraigned late Friday in a federal courthouse in Bridgeport, Connecticut, where a grand jury indicted him last year. Levashov pleaded not guilty and remains in detention.\nA statement from Spain's National Police said officers handed Levashov over to U.S. marshals on Friday. The extradition was approved in October by Spain's National Court, which rejected a counter-extradition request from Russia.\nThe Russian Embassy in Washington didn't immediately respond to requests for comment.\nAuthorities in the U.S. say they have linked Levashov to a series of powerful botnets, or networks of hijacked computers, that were capable of pumping out billions of spam emails. An indictment unsealed last year said he commanded the sprawling Kelihos botnet, which at times allegedly involved more than 100,000 compromised computers that sent phony emails advertising counterfeit drugs, harvested users' logins and installed malware that intercepted bank account passwords.\nOn a typical day, the network would generate and distribute more than 2,500 spam emails, according to the indictment.\nLevashov's lawyers have alleged the case is politically motivated and that the U.S. wants him for reasons beyond his alleged cybercrimes. They had argued that he should be tried in Spain instead, and pointed to evidence showing that he gained access to Russian state secrets while studying in St. Petersburg.\nLevashov's U.S.-based lawyer, Igor Litvak, didn't return emails or calls seeking comment Friday.",
    "source_domain": "abcnews.go.com",
    "title": "Spain extradites suspect thought to be spam kingpin to US",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/spain-extradites-suspect-thought-spam-kingpin-us-52790850"
}