{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 04:38:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "President returns to Trump Tower, greeted by protesters chanting 'impeach'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fpresident-returns-trump-tower-greeted-protesters-chanting-hate%2Fstory%3Fid%3D49219781.json",
    "image_url": "http://a.abcnews.com/images/US/trump-protest-nyc-rt-hb-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "About 1,000 protesters greeted President Trump in Manhattan in his first arrival at Trump Tower as president.\nSome of the protesters formed a human wall while others shouted messages like \"no hate\" or \"impeach.\" Nearby, an inflatable caricature of Trump in the form of a rat was set up at The Plaza hotel.\nTrump came under fire over the weekend for his statement on the violence following a rally of white supremacists and white nationalists in Charlottesville. The president's first remarks on the violence Saturday condemned what he called an \"egregious display of hatred, bigotry and violence on many sides.\" Two days later, amid mounting pressure, he made new remarks denouncing hate groups, including white supremacists.\nSpencer Platt/Getty Images\nTrump made his return visit Monday night in the midst of what his administration has called a \"working vacation\" away from the White House, which is undergoing renovations. The president has been staying at his golf club in Bedminster, New Jersey for over a week.\nFeels good to be home after seven months, but the White House is very special, there is no place like it... and the U.S. is really my home! — Donald J. Trump (@realDonaldTrump) August 15, 2017\nWhile this may be the president's first visit back to his Fifth Avenue skyscraper, it is hardly the first time he has retreated from 1600 Pennsylvania Ave to one of his Trump properties. The president has already made a dozen trips to his Mar-a-Lago estate in Florida and his home in New Jersey since assuming the presidency.\nABC News' Katherine Faulders and the Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "President returns to Trump Tower, greeted by protesters chanting 'no hate' and 'impeach'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/president-returns-trump-tower-greeted-protesters-chanting-hate/story?id=49219781"
}