{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 15:23:21+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Stars shine in Minneapolis ahead of Super Bowl Sunday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Finside-star-studded-super-bowl-affairs-52814775.json",
    "image_url": "http://a.abcnews.com/images/GMA/180203_gma_superbowl1_739_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Inside star-studded Super Bowl affairs\nIt is bitter cold in Minneapolis on this super bowl weekend but the preparties are hot. Let's face it. Some go just for the parties. T.J. Holmes joins us again. T.J., I know you are the consummate professional. Always want to do your homework so I trust you did your research on this subject. Reporter: Dan, Paula, I don't need to do research on this subject. I'm already an expert. You talk about super bowl, super bowl is not just a game, right. Super bowl is actually an entire week of events and, yes, every single night here there's something to do. You're wlm hard-pressed in Minneapolis to find people going to the game. They just come here to hang out at night. What can you see at night? Look over here, snoop Dogg. Kevin hart, me, I chose to spend my night rubbing elbows with an Oscar winner. Even single digit temperatures can't keep the nights from getting hot in Minneapolis as a-listers step out for a number of super bowl bashes including this one, Jamie Foxx's Foxx and friends dinner. It is cold but you know what, though, sort of let your mind help you get used to it. Reporter: I caught up with the comedian and actor and got his take on the big game. Give me your game predictions. Look, man, I'm torn because my boy from philly, first out the limo, so I got to root for the homies, but I'm a big Tom Brady fan. You got to get an edge to the berterback to ever play, Tom Brady. Reporter: All right. You got to give him that respect. Now, if philly win I wouldn't be mad because that's the homies. Reporter: Super bowl parties like this one are always packed with musicians, actors and athletes. Shaquille O'Neal stopped to talk with us about the game and in particular, Tom Brady. If he gets a sixth super bowl ring -- Best quarterback ever in history of the NFL. Reporter: And at this party a surprise D.J. On the turntables. Yep, Shaq, aka D.J. Diesel. Request some white guy classics. Got to keep everybody included. What is a white guy classic? ??? I wish I had Jessie's girl ??? Those are Shaq's words. He said he wanted to keep everybody included so had some white guy classics. I was there as he was deejaying and he deejayed for ten or so minutes then he made a turn to journey's \"Don't stop believin'\" and, well, people really got into it. ??? Don't stop -- Those are classics no matter who you are. So, amazing -- Reporter: According to Shaq. We should say T.J. Is not short and but standing next to Shaq, he looked short so Shaq is just gigantic. He is gigantor. Reporter: I don't know how he reached those turntables. It was fun to see the big man up there doing his thing. With a personality to mat just as big. T.J., great work. Enjoy the game. We'll see you tomorrow morning. Good to see you, guys. Really appreciate it.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Inside star-studded Super Bowl affairs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/inside-star-studded-super-bowl-affairs-52814775"
}