{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 22:47:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "WWE Hall of Famer Ric Flair has surgery for undisclosed issue",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fwwe-hall-famer-ric-flair-surgery-undisclosed-issue%2Fstory%3Fid%3D49215250.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0813/dm_170813_MLB_Coley_Harvey_on_Harpers_injury/dm_170813_MLB_Coley_Harvey_on_Harpers_injury_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two-time WWE Hall of Famer Ric Flair is resting after undergoing surgery Monday, according to a statement from a WWE representative.\nThe statement did not give details about the surgery. Flair was placed in a medically induced coma before surgery, WWE confirmed to ESPN earlier Monday.\nFlair was hospitalized and admitted to an intensive care unit over the weekend. After initially downplaying the seriousness of the issue, Melinda Morris Zanoni, the CEO of Legacy Talent and Entertainment and a Flair representative, made a plea for public support Sunday night via Twitter.\nAs first reported by Pro Wrestling Sheet, Flair was hospitalized Saturday morning for heart-related issues, with Zanoni initially reporting the situation involved \"routine monitoring.\" PW Insider's Mike Johnson reported that Flair is hospitalized near his home in Atlanta.\nFlair, 68, has spent the past five decades in professional wrestling with a reputation as one of the most charismatic personalities in the history of that business. His popularity and personality have transcended into professional sports on many occasions, with athletes recreating some of his most famous wrestling promos and Flair often called on to serve as a motivational speaker.",
    "source_domain": "abcnews.go.com",
    "title": "WWE Hall of Famer Ric Flair has surgery for undisclosed issue",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wwe-hall-famer-ric-flair-surgery-undisclosed-issue/story?id=49215250"
}