{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 16:33:01+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-bond-revoked-suspect-waffle-house-attack-54694310.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_328b76641bdd478e90140d765963c0ad_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on a shooting at Tennessee restaurant that left four dead (all times local):\n10:50 a.m.\nA Nashville judge has revoked the bond of a man accused of killing four people at a Waffle House restaurant.\nCourt records show that a judge struck the $2 million bond for Travis Reinking until a hearing can be held Wednesday. The records did not give a reason why General Sessions Judge Michael Mondelli revoked the bond.\nReinking has been charged with four counts of criminal homicide. Police say the 29-year-old man opened fire outside the restaurant with an AR-15 rifle and then stormed the restaurant, wearing only a green jacket. Four other people were injured in the shooting.\nAn attorney listed as Reinking's lawyer did not immediately respond to an email seeking comment.\n———\n12:01 a.m.\nPolice say Travis Reinking had stolen a BMW from a Nashville area car dealer last week. They discovered it outside the apartment where he lived and hauled it away. But they didn't figure out who had stolen the car until after tragedy struck.\nBy then, police say, the 29-year-old with a troubled past had shot four people to death in a Waffle House not far from where he lived. If not for the efforts of a customer who wrestled the gun away, many more would have died.\nHis arrest ended a manhunt that involved more than 160 law enforcement officers. But it left troubling questions about his behavior before the shooting unanswered.\nThose questions included what might have led him to the carnage he is said to have unleashed at the Waffle House.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Bond revoked for suspect in Waffle House attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-bond-revoked-suspect-waffle-house-attack-54694310"
}