{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 21:18:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Romania's ruling party withdraws support for its PM",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fromanias-ruling-party-decide-ax-premier-48025636.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_9c85be2c0ee440eca030a1d22e4a618e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Romania's ruling party withdrew political support for Premier Sorin Grindeanu and his Cabinet on Wednesday after the party's leader said he had lost confidence in the government, throwing the country into a political crisis.\nThe Social Democratic Party voted unanimously to withdraw support for its government after a meeting lasting more than five hours. Party leaders said Grindeanu, who has been in office for six months, had failed to respect the party's governing program.\nGrindeanu was defiant, saying later: \"I am not resigning,\" and adding: \"This is the government of Romania, not of the executive committee of the Social Democratic Party.\" Dozens of people rallied outside the government offices in support of Grindeanu.\nThe prime minister said he would step down in the future when President Klaus Iohannis nominates a premier from the Social Democratic Party. Grindeanu remains in office, but the party threatened to expel him if he did not resign.\nParty Chairman Liviu Dragnea said the party had shown \"an act of courage...to do this.\" He said the government's direction was good, but the speed of implementing its governing program was too slow. He claimed nearly all Cabinet ministers had resigned.\nDragnea himself cannot be prime minister because he was convicted last year of vote-rigging.\nDragnea has said he is dissatisfied with the government's performance, except in ministries headed by his political allies. Grindeanu said the evaluation of his Cabinet was done unfairly.\nCalin Popescu Tariceanu, the leader of a junior party in the governing coalition, said his Alliance of Liberals and Democrats no longer supports the government and the party's three ministers have agreed to resign.\nFormer Premier Victor Ponta, a Social Democrat, accused Dragnea of sparking a futile crisis and suggested he was envious of Grindeanu's relative popularity.\nGrindeanu moved to decriminalize official misconduct in January, sparking huge protests that led him to withdraw the decree. Critics said Grindeanu's government was backtracking on its anti-corruption campaign.",
    "source_domain": "abcnews.go.com",
    "title": "Romania's ruling party withdraws support for its PM",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/romanias-ruling-party-decide-ax-premier-48025636"
}