{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:47:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Official sides with Georgia over Florida in water lawsuit",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fofficials-sides-georgia-florida-water-lawsuit-45492600.json",
    "image_url": "http://abcnews.go.com/US/wireStory/officials-sides-georgia-florida-water-lawsuit-45492600",
    "language": "en",
    "localpath": null,
    "maintext": "A judicial official sided with Georgia in a decades-long dispute over water rights with Florida on Tuesday, recommending that the U.S. Supreme Court refuse Florida's high-stakes request to cap water use by its neighboring state.\nThe dispute focuses on the Apalachicola-Chattahoochee-Flint River Basin, covering nearly 20,000 square miles in western Georgia, eastern Alabama and the Florida Panhandle. The Chattahoochee and Flint rivers meet at the Georgia-Florida border to form the Apalachicola, which flows into the bay and the Gulf of Mexico beyond.\nThe recommendation from Special Master Ralph Lancaster, who was appointed by the court to oversee Florida's suit against Georgia, isn't a final decision. The court's review of Lancaster's report and responses from each state could take months. The states' battle over water use dates back to 1990, and includes drawn-out negotiations and several lawsuits.\nThe initial decision was a big blow for Florida Gov. Rick Scott, who had decided to take Florida's case directly to the U.S. Supreme Court and announced the lawsuit in the town of Apalachicola with great fanfare. Jackie Schutz, a spokeswoman for Scott, said the governor's office was reviewing the report by the special master but did not offer any comments beyond that.\nIn the past few weeks Scott has been forced to defend the lawsuit because the state's legal fees in the complicated case have been rapidly mounting. The state has spent more than $41 million in the past 18 months alone, an amount that Republicans in charge of the Florida House say is too much.\nGeorgia Gov. Nathan Deal said he was \"incredibly pleased\" by Lancaster's conclusion.\n\"Georgia remains committed to the conservation efforts that make us amicable stewards of our water,\" he said in a statement. \"We are encouraged by this outcome which puts us closer to finding a resolution to a decades-long dispute over the use and management of the waters of the basin.\"\nOthers hailed Lancaster's recommendation as a victory for Georgia following months of worry that the outcome would hurt industries that contribute millions to the state's economy. The Georgia Agribusiness Council called it \"great news\" for the state's agriculture industry, while the Metro Atlanta Chamber thanked Deal and others \"for vigorously and successfully defending the state's water rights.\"\nFlorida's 2013 lawsuit sought a cap on Georgia's water use, blaming farmers and booming metro Atlanta for low river flows that harmed the environment and fisheries dependent on fresh water entering the area. Alabama isn't directly involved in the case but supported Florida in court filings.\nGeorgia, though, warned that a cap would damage the state's economy and argued that Florida didn't prove its use of water caused low river flows. The state's attorneys also said there was little proof that capping Georgia's use would substantially help Floridians.\nLancaster agreed, writing that Florida provided \"no evidence\" that a cap would help the state outside of drought periods and that any benefits \"are likely rare and unpredictable.\" He also questioned Florida's decision not to include the U.S. Army Corps of Engineers, which manages dams that affect the river basin, in its lawsuit.\n\"Without the ability to bind the Corps, I am not persuaded that the court can assure Florida the relief it seeks,\" Lancaster wrote.\nLancaster repeatedly urged the states' attorneys to settle during the case, to no avail.\n———\nAssociated Press writer Gary Fineout in Tallahassee, Florida, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Official sides with Georgia over Florida in water lawsuit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/officials-sides-georgia-florida-water-lawsuit-45492600"
}