{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:04:28+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcalifornia-senate-supports-state-backed-bank-pot-money-55547924.json",
    "image_url": "https://abcnews.go.com/US/wireStory/california-senate-supports-state-backed-bank-pot-money-55547924",
    "language": "en",
    "localpath": null,
    "maintext": "California lawmakers moved Wednesday to create a state-backed bank to handle the billions of dollars flowing from the newly legal recreational marijuana market.\nThe world's largest legal recreational marijuana economy, created under a law that took effect this year, is projected to grow to $7 billion.\nThe bill approved by a bipartisan 29-6 state Senate vote is designed to help pot entrepreneurs who usually deal in cash because most banks won't accept money from a product that remains illegal under federal law.\nSB930 now goes to the Assembly for consideration.\nThe bill would permit charter banks and credit unions regulated by the state Department of Business Oversight to provide limited banking services to pot-related businesses.\nThey could use the banks to pay rent, state and local taxes and fees, vendors within California for goods and services related to the cannabis business and to buy state and local bonds and other investments.\n\"We're not using the federal system, we're not using the federal wire,\" Democratic Sen. Bob Hertzberg of Van Nuys said of his proposal. \"This is a short-term creative approach to deal with this extraordinary problem.\"\nHe said the banks would suffice until what proponents hope will be an eventual change in federal law.\nHertzberg said the current system is dangerous because it requires pot dealers to conduct their business using cash, sometimes tens of thousands of dollars. He said he's heard of some businesses burying or hiding tens of millions of dollars for lack of an alternative.\nState budget officials project California will collect $600 million in cannabis taxes in the upcoming year, but that often requires the businesses to haul duffel bags full of cash to tax agencies.\nThe cash economy also makes audits and other standard oversight measures difficult.",
    "source_domain": "abcnews.go.com",
    "title": "California Senate supports state-backed bank for pot money",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/wireStory/california-senate-supports-state-backed-bank-pot-money-55547924"
}