{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:48:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "New concerns arise as it becomes difficult for firefighters to fight the blaze on the building's top floors.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fvideo%2Flondon-apartment-building-smoldering-danger-collapsing-48043794.json",
    "image_url": "http://a.abcnews.com/images/International/170614_gostream_molly425_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for London apartment building still smoldering, in danger of collapsing\nAnd now let's go back to more details about that deadly apartment building fire in London ABC's Molly hunter has been there now on the scene for several hours Molly joining us again from London. Molly what he now. Good. Marty. No we aren't exactly. And it won't get that building right there won't bring behind you think that thing. Black smoke that you not to see the firefighters still. Fighting the fire they're waters that's still going up at the late it. Not that building are out of reach and the reason that fire that flames in both the top of that building spread. So quickly from the fourth floor where it's believed that this fire started is because of this external clouding. Apparently in the prefer basement last year at thirteen million dollar verdict and on that building just last here. External fat with but it was put in for but aesthetic reasons and insulation and residents tell and that's what caught fire that's what's red. Rapid buildings so quickly so quickly that firefighters even arrived on the scene immediately could not put the fire thank you wanna say residents are all the time has. That their instructions from the building from the landlord that if the fire happened in their apartment on there floor. Get out of that if the fire happened at different part of the building stay in place and that's might panic and it's so many people got stranded. Up top gambling is outward seen leaning out the window late last night flashlight waving trying to get the attention of rescuers but of course this buildings. Selling stable right now it's very likely and he might still life in those upper levels thanks. Kenneth Noonan Molly I know they have their hundreds of firefighters on the scene some of them working through the night we're now getting some images in. Of those firefighters just looking absolutely exhausted you can imagine. What they've gone through trying to get this fire under control and we can see so many hours later is still burning you're still seeing their names. It is a frustrating effort for those firefighters some residents shockingly say they smelled. Smoke and then some thirty minutes later they heard that fire detectors go off the smoke alarms go off what a horrible scene there in London of course we're gonna have very latest on that.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "London apartment building still smoldering, in danger of collapsing",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/video/london-apartment-building-smoldering-danger-collapsing-48043794"
}