{
    "authors": [
        "Abc News",
        "Scott Shulman",
        "Robert Zepeda",
        "More Emily"
    ],
    "date_download": "2017-08-14 16:44:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Peace rally held in Guam amid North Korea threat",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fpeace-rally-held-guam-amid-north-korea-threat%2Fstory%3Fid%3D49206249.json",
    "image_url": "http://a.abcnews.com/images/US/guam-protest-4-gty-er-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Amid North Korea's threat of a missile attack against Guam, the U.S. territory's homeland security adviser said Monday there's a 0.000001 percent chance that a missile launched from North Korea would get through the various layers of defense and reach Guam.\nGov. Eddie Baza Calvo said Monday it's business as usual in Guam, with no change of threat levels.\nThe governor said President Trump and his chief of staff, John Kelly, called him at home, vowing that Guam residents will be defended and protected from any attacks.\nRoughly 75 people gathered in Guam's capital city of Hagatna, near the statue of Chief Kepuha, Guam's first Catholic chief, on Monday evening local time to call for peace.\nEd Jones/AFP/Getty Images\nThe Chamorro people (the indigenous people of Guam) and others stood together with peace signs, chanting, \"Peace not war -- that's what our island is for,\" as the sounds of conch shells and horns from motorists filled the air.\nEd Jones/AFP/Getty Images\nA University of Guam professor from Illinois told ABC News she is fearful of the rhetoric that is being used between North Korean and U.S. leaders. She said she will have to start the first day of school directing her students to a makeshift bunker at the university in the event that sirens begin.\nOfficials said 30,000 students are returning to school this week.\nA Department of Education official said all schools have an emergency response plan and students are trained each month for different kinds of disasters.",
    "source_domain": "abcnews.go.com",
    "title": "Peace rally held in Guam amid North Korea threat",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/peace-rally-held-guam-amid-north-korea-threat/story?id=49206249"
}