{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 18:38:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Top Fed official tells AP: Bond portfolio could shrink soon",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ftop-fed-official-tells-ap-bond-portfolio-shrink-49210606.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_f0377c2ee2904532ac1d43892425ad52_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A top Federal Reserve official suggested Monday that the Fed will likely announce next month that it will begin paring its bond portfolio — a step that could lead to slightly higher rates on mortgages and other loans.\nIn an interview with The Associated Press, William Dudley, president of the Federal Reserve Bank of New York, said he thinks the Fed has adequately prepared investors for a reduction in the portfolio, which swelled after the 2008 financial crisis as the Fed bought bonds to reduce long-term rates. With the economy now much healthier, the Fed is ready to begin selling some of those bonds.\nDudley also said that he would favor a third increase this year in the Fed's benchmark short-term rate if the economy remained strong. Many investors expect a modest rate hike in December, to follow the Fed's previous increases in March and June this year.\nSpeaking of the Fed's likely September announcement that it will begin shrinking its $4.5 trillion bond portfolio, Dudley expressed confidence that investors would react calmly to the prospect of modestly higher rates on some consumer and business loans. He noted that the Fed spelled out to investors months ago the system it plans to use to reduce the portfolio gradually.\n\"The plan is out there,\" he said during an interview at the New York Fed. \"It's been generally well-received and fully anticipated. People expect it to take place.\"\nAs president of the Fed's New York regional bank, Dudley is an influential voice on interest-rate policy. He is vice chairman of the central bank's policy panel that sets interest rates and is a longtime close ally of Fed Chair Janet Yellen.\nHis interview with the AP comes at a time when the Fed has essentially met one of its two mandates: To maximize employment. The unemployment rate is at a 16-year low of 4.3 percent, and job growth remains consistently solid.\nYet the Fed has so far failed to meet its second objective of keeping prices stable. Inflation has stayed chronically below the Fed's 2 percent target rate — a problem because consumers often delay purchases when they think prices will stay the same or even decline. In its latest reading, the Fed's preferred inflation gauge was just 1.4 percent year over year. Dudley said Monday that he still thinks inflation will rise toward the Fed's target level as the job market strengthens further and sluggish wage growth begins to pick up.\nOn other topics, Dudley:\n— Suggested that Gary Cohn, who leads President Donald Trump's National Economic Council and is close to Trump, would be a \"reasonable candidate\" to succeed Yellen as Fed chair if Trump chooses not to re-nominate Yellen when her term ends early next year. Dudley, who worked with Cohn as top officials at Goldman Sachs, said Cohn \"knows a lot about financial markets,\" and \"I don't think you have to have a Ph.D. in economics\" to lead the Fed. In a recent interview, Trump said he was considering both Yellen and Cohn for the top Fed job, along with some other candidates he would not name.\n— Expressed confidence that the Fed's political independence, long considered essential for it to carry out its functions, would remain respected during a Trump presidency. Trump may have the opportunity to install up to five members of the Fed's seven-member board over the next year, and the president has shown a tendency to expect loyalty from some people he has named to key positions. Trump had offered a harsh judgment of the Fed and of Yellen during the presidential campaign but has since avoided making critical comments. Dudley noted that the Trump administration has so far been \"very hands-off\" toward the Fed, \"very respectful of monetary policy.\"\n— Said that even as stock prices set record highs and other assets surge as well, he isn't concerned that any potentially devastating asset bubbles might be forming, akin to the subprime mortgage bubble that triggered the 2008 crisis. Dudley said asset prices \"are pretty consistent with what we are seeing in terms of the actual performance of the economy,\" which he said has been evolving without much volatility.\nThe Fed's announcement that it will start paring its bond portfolio is expected to come after its next policy meeting ends Sept. 20. The meeting after that, in December, is when many Fed watchers expect the next increase in its key short-term rate, which remains in a still-low range of 1 percent to 1.25 percent.\nYellen and other Fed officials have attributed the persistently low inflation rate, which slowed further in recent months, to such transitory events as a sharp drop in cellphone fees.\nDudley said that if the economy evolves during the rest of 2017 as he expects, with inflation rebounding, \"I would be in favor of doing another rate hike later this year.\"",
    "source_domain": "abcnews.go.com",
    "title": "Top Fed official tells AP: Bond portfolio could shrink soon",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/top-fed-official-tells-ap-bond-portfolio-shrink-49210606"
}