{
    "authors": [
        "Abc News",
        "More Lauren"
    ],
    "date_download": "2017-06-15 01:26:56+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "White House moves travel ban date to avoid mooting case",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fwhite-house-moves-travel-ban-date-avoid-mooting%2Fstory%3Fid%3D48045631.json",
    "image_url": "http://a.abcnews.com/images/Video/ap_supreme_court_rulings_jc_160623_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The White House released a memorandum Wednesday stating that the effective date of its revised travel ban -- spelled out in the executive order as March 16 -- is now “delayed or tolled until those injunctions are lifted or stayed.”\nThis action came “in light of questions in litigation about the effective date of the enjoined provisions and in the interest of clarity,” the memo reads, adding that it “should be construed to amend the Executive Order.”\nIn its reply briefs submitted to the Supreme Court, the government argued that the “clarification forecloses respondents’ mootness argument” and asked the Supreme Court to stay the Maryland and Hawaii injunctions, and grant a writ of certiorari to take the case.\nPlaintiffs in the Fourth Circuit case had argued to the Supreme Court that the 90-day ban on nationals from six designated countries ended on Wednesday, which is 90 days from the “effective date” of March 16 written into the executive order. Under that interpretation, the whole case would become moot before the Supreme Court had a chance to weigh in, leaving the Fourth and Ninth Circuit rulings to stand.\nThe government disagreed, arguing that the injunction by Hawaii federal judge Derrick Watson had stopped the clock on the 90-day six-country and 120-day refugee ban. Watson blocked those portions of the travel ban before they could go into effect.\nThe challengers could still argue that even with a postponed effective date, the clock is now running, because the Ninth Circuit on Monday allowed the administration to go forward with provisions of the executive order directing an internal review of vetting procedures.\nABC News contributor Kate Shaw said that today’s memorandum “clarifies and amends the executive order, effectively neutralizing one of the plaintiffs’ key arguments against both a stay and cert -- that the Order expired [Wednesday.]\"\n\"I don't know that this changes the likelihood of a grant of a stay, but I do think it increases the chances that the Court grants the cert petition,\" said Shaw.\nAccording to Tuesday’s briefing schedule, the parties need to submit their briefs regarding the stay and cert petitions by June 21.",
    "source_domain": "abcnews.go.com",
    "title": "White House moves travel ban date to avoid mooting case",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/white-house-moves-travel-ban-date-avoid-mooting/story?id=48045631"
}