{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "This week's Big Question: What are your earliest memories of Jaromir Jagr?",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fweeks-big-question-earliest-memories-jaromir-jagr%2Fstory%3Fid%3D45507559.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0215/dm_170215_MLB_Verlander_on_Tigers_chances/dm_170215_MLB_Verlander_on_Tigers_chances_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This week's Big Question:?What are your earliest memories of Jaromir Jagr?\nEric Lindros, C, retired:?\"I'm thinking back to world juniors when I was 16, it was 1989, our Canadian team went to watch the Czechs play one day, everyone had eyes on Jagr. As soon as he got on the ice, nobody is watching anything else. Our world junior team was glued to watching him on every shift. Just everything about him, it's like he did everything without leaving a footprint. I just remember that, our whole team just mesmerized by him.\"\nDavid Pastrnak, RW, Boston Bruins:?\"It was a couple of days after he was traded to Florida, so [ David] Krejci?asked me if I wanted to meet Jagr. He was staying at the same hotel, so we met up in the yard by the pool, [he's] just chilling there, and that's when I met him for the first time. Obviously, he's a legend for us [Czechs]. I didn't say much. I was just listening to him. He's a funny guy. It's unbelievable [he's still playing]. It's his life, and he loves hockey. You can't do well in hockey if you don't love it, and he loves it a lot, and that's a big thing that sticks out for me.\"\nJeff O'Neill, C, retired/analyst:?\"My first Jagr memory was that playoff goal he scored against Chicago when he deked everybody out. That's when you're like, 'Wow, this guy is a special talent.' Then when I went to Hartford as a rookie, Paul Maurice took over as coach after 7-8 games, and he put me with? Brendan Shanahan and Nelson Emerson, and whenever we played Pittsburgh, we got the Lemieux-Jagr matchup -- and it was hell. I knew that Shanny and Emerson hated me because we never touched the puck the whole game. They were playing shinny hockey with us. ... But you know, it still boggles my mind that I've been retired 10 years, and Jagr is still playing.\"\nRoman Polak, D, Toronto Maple Leafs:?\"I just remember in early years he was taller than everybody else. He was big. He had that big ass out there and protected the puck, he was strong, he could skate, just a great player overall. Long stick, long reach, long hair. ... He was big in Czech. Everybody still talks about Jagr in Czech. He's still big. If he tried to be president of the country, he would be. Everybody just loves him. At age 40, he found out there's a Facebook out there, and he's done a pretty good job on the Facebook, too [laughs].\"\nRay Ferraro, C, retired/analyst: \"My first recollection is of him at the [1990] draft with this really long hair and that awkward Penguins hat on. Playing against him was instantly impossible -- he was too big and had too big a reach, plus an amazing skill set. I always felt he was such a great passer that is overshadowed by his scoring ability, and then all of a sudden he was among the best scorers every year.\"\nAlex Pietrangelo, D, St. Louis Blues: \"When he was in Pittsburgh, that was a bit before me, but Washington and the Rangers, that's when I remember him playing. It blows my mind. I'm 27. What is he, 44 [now 45]? I don't think I'll be able to walk when I'm 44. The way that guy still goes, it's unbelievable. It really is impressive the way he can continue to play. The best part about it is that he's playing at a level still that not many people can play at. He continues to impress. ... That's just great for the game.\"\nBill Guerin, RW, assistant GM, Pittsburgh Penguins: \"I first met Jagr at the World Junior Championships in Finland. It was his draft year coming up, I think. Social media wasn't around, the internet wasn't around, so you couldn't brush up on guys. And just seeing this kid on the Czech team. Bobby Holik had been taken 10th overall, so he was the big guy on the team, and then you saw this Jagr kid, and you were, 'Who the hell is that?' And then you see him getting drafted pretty high, and then just from there you go, 'Oh, that's the kid from the World Juniors', and then he just kept going. I think it's amazing what he's doing. I love it. One of the reasons I love what he's doing is he just loves the game. He doesn't need the money. He doesn't need the points. He just loves the game.\"\nBrendan Shanahan, LW, Toronto Maple Leafs president:?\"I just think it's interesting how he came back with such an appreciation for the NHL and the game. I think going away for a couple of years resparked the love for the game and an appreciation for the NHL. He just seems to be having so much more fun with it than he was before he left. ... When you play a long time in the NHL, there's a point in your career where you're like, 'I've seen this all before.' He stepped away from the NHL, but what makes him so unique is that he was so talented, he was able to come back. Not that he was retired overseas, but I think it was good for his body, good for his mind, and he's just like a kid again.\"\nTuukka Rask, G, Boston Bruins:?\"I played against him in the Czech Republic during the lockout. It's amazing that he still finds it fun to play the game, because it's a grinding game, and the season is long, you travel a lot, so to do that for over 25 years is very respectable. He still seems to be having fun, so who knows how long he'll keep playing.\"\nMatt Cullen, C, Pittsburgh Penguins:?\"I remember playing with him with the Rangers, and the thing that stood out to me the most was how hard he worked on his game. I didn't know a whole lot about him other than that he was a pretty unique talent and just an unbelievable combination of size and skill. I was always just really impressed with the way that he was at the rink before I ever got there -- and I'm usually one of the first guys -- and he was always there and often doing something, whether it was in the pool working on his hands or out on the ice. I was just really impressed with his commitment to his game and improving his game. You don't see that sort of dedication in a guy, especially as it gets later in his career, and a guy who's been at the top for so long, so it was pretty impressive to see that. So that was something that always struck me and something that always impressed. He would be in the pool up to here [points to chest] and he would just have his stick with maybe weights on it and he would stickhandle underwater, just to have some resistance. I didn't ask a whole ton of questions because some of it was just, 'Holy cow.' He was committed. He was a hard worker.\"\nTrevor Daley, D, Pittsburgh Penguins:?\"The mullet. The hair, of course. The hair, his number, the swagger he had about him. Just as a young kid growing up watching the? Pittsburgh Penguins, every time you got to see Jaromir Jagr, he was just different than anyone else. Obviously, I had the chance to be around him and spend some time with him [while with the? Dallas Stars]. He's so dedicated to his craft and what he does. You pick that up right away about him. You look at his age and what he's doing today, it's all because of how much he enjoys the game, how much he loves the game and then the work that he puts into the game is why he's still playing. In Dallas, he lived right next to the practice rink, and after games he would go back to the practice rink, open it up and make the Zamboni driver pass him pucks. Nothing really surprises me with that guy. He's just a guy that really loves the game, and it doesn't surprise me he's still playing.\"\nMichael Frolik, RW,? Calgary Flames:?\"He's from the same hometown [as] me, so I kind of meet him in the summer sometimes. But the first time, I was pretty young. I think when I was 6 years old, he came to skate with us and be on the ice with us. I remember it was pretty cool. We're not buddies or anything like that. I think he doesn't have many friends in hockey, I think he kind of separates from hockey a little bit [with his] friends. I have the big respect for him, and it's cool to have a chance to play with him on the national team and at Olympics, so it was pretty cool to see what he does off the ice and in the room.\"\nJay Bouwmeester, D, St. Louis Blues:?\"He was old when I came into the league and he's still going. He'll probably be still playing when I'm done, too. But he was a guy that was a lot bigger than you ever thought he was. Just big and wide body, stick his butt out in your face and when you're a 19-year-old defenseman like I was, there's not a whole lot you can do about that. And he's still doing it. His talent level, and what he's doing even now ... that's crazy. He's got some good genes, for sure, for his body to hang in there.\"\nDavid Backes, C, Boston Bruins:?\"I don't know if I've had many face-to-face conversations with him, but [my first memory is] NHL '94 on Super Nintendo as a 10-year-old. I did pretty darn good. The Penguins were dynamite in that game, and if you went across the crease as Jagr on your backhand, you scored every time. He's still doing that.\"\n-- Scott Burnside,?Pierre LeBrun,?Joe McDonald, Craig Custance",
    "source_domain": "abcnews.go.com",
    "title": "This week's Big Question: What are your earliest memories of Jaromir Jagr?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/weeks-big-question-earliest-memories-jaromir-jagr/story?id=45507559"
}