{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:46:46+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Gas prices, at $2.84 per gallon, are hitting their highest point in four years in the U.S.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Fholiday-gas-prices-spike-year-high-56359929.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_benitez4_0714_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Holiday gas prices spike to 4-year high\nso many of yre traveling for the holiday. An estimated 40 million ICANs hitting the road. Well, a little bitf bad news. You'll face Pai at the pump a gas prices are hitting their highest point I fou years. ABC' gio Benitez is at a station here in New York with more on why and how you can keep your gas costs wn. Good morning T you, O. Reporter: Yeah, good morning, Paula. Get ready to spend. Right in new Yorty at this station this one has some of T highest pces in the country. 9 a gallon forular unleaded but let's take a look at theional average becau in the u.s.,e're looking at 2.84 gallon, 58 cents higher than the fourth of july year so where prices this high? In partom oil producing entries have had unexpd ous and unctainty over U.S. Efforts to sanion Iranian the lowest prices, south Carolina, alaba, misssippi, the high Washington, California and Hawaii, if you live there you're spending about $1 more. Paula. Yikes.these prices. Okay, so I'm assuming a lot of us are looking for ways to save on fuel and any suggestions? Reporter: Look, right N the biggest thing you can D can focus on that ac because T less you useit, the mor you're Goin save, right? You don't want have windows open during your drive bec that's going to cause a lot stress on the car and you're going to end up spending a more on ga If I have max on with windows down I'm Doi a lot of things G. Thank you. To anotheroliday concern as millions of Americans\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Holiday gas prices spike to 4-year high",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/holiday-gas-prices-spike-year-high-56359929"
}