{
    "authors": [
        "Abc News",
        "More M.L."
    ],
    "date_download": "2018-03-19 22:31:18+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Kevin Esterly, 45, and Amy Yu, 16, were found Saturday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmom-teenage-girl-fled-mexico-married-man-regrets%2Fstory%3Fid%3D53836326.json",
    "image_url": "https://s.abcnews.com/images/US/amy-yu-family-3-ht-jt-180317_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When the frantic search for a 16-year-old girl culminated on Saturday with U.S. Marshals and Mexican authorities finding her at the Mexican port town of Puerto Morelos, her mother was relieved.\n\"I'm really happy. Please let everyone know,\" Amy Yu's mother, Mui Luu, told ABC News.\nShe had feared the worst after her daughter ran off with a 45-year-old married man named Kevin Esterly.\nAfter they were finally found, they were taken to Miami Saturday night.\nJust days before receiving the good news, however, Luu gave an extensive interview to ABC News admitting her regret for arguing with her daughter before her disappearance and her anger at Esterly.\n\"Nobody can help,\" Luu said about her daughter's return. \"They just hide and hide. It's so difficult to find them.\"\nCourtesy Miu Luu\nHer daughter vanished with what Luu described as \"a little bit of jewelry, her passport and a couple hundred dollars.\"\nThe mother said she regretted fighting with her daughter before she fled.\n\"The last day, I called Amy and we talked I yelled at her, and so she got mad,\" Luu said.\nCourtesy U.S. Marshals Service\nThe sophomore student was signed out of Lehigh Valley Academy on March 5 by Esterly, according to the Allentown Police Department. Esterly, a cement contractor, allegedly claimed to be her stepfather and, according to an affidavit of probable cause filed by the Lehigh County Deputy District Attorney Matthew Falk, he \"fraudulently signed her out of school\" early at least 10 times between December and Feb. 9.\nBut this time, authorities said Esterly withdrew $4,000 from his wife's bank account and caught a one-way flight to Cancun, Mexico, by way of Dallas along with Amy.\nWhile she is back home, any kind of homecoming with Amy is being delayed because the youth is staying at a Pennsylvania hospital, her mother said.\nMeanwhile, Esterly remains behind bars in Miami and faces a felony charge of custodial interference.\nDuring a short hearing on Monday, Esterly didn't fight extradition back to Lehigh County.\n“I’d like to go back to Pennsylvania as soon as possible,\" he told the judge.\nIn the throes of worry and reflection, Luu wondered if she could have done more to keep Amy away from from the married man.\n\"Every day she would go out -- sometimes for two hours and I ask her 'Why do you go out? Every day you go out!'\" she said she told Amy. \"Sometime she would be gone overnight....\n\"It's difficult teaching the teenagers because they won't listen to the parents,\" she added.\nAllentown Police Department\nLuu said that she had been raising Amy and her brother, John, by herself ever since their biological father went to China.\n\"He left to go back to China and he can't come back,\" she said.\nFor almost a decade, Luu's daughter attended a Lehigh county church.\nIt was at this church that Luu said Amy forged a friendship with one of Esterly's four daughters.\n\"I know him from church, both him and his family [for] many years,\" Luu told ABC News in an earlier interview before Amy was found. \"He had four daughters and wife and his daughter is just one year less than Amy.\nJohn Waldron, the attorney for Esterly's wife, Stacey Esterly, told to ABC News that over several years Amy became like a \"fifth daughter\" to their family.\nLuu agreed, saying for Amy, Kevin Esterly was \"dad\" and his wife was \"mom.\"\nBut Luu said she found the relationship strange and confronted the couple.\n\"I ask him and I ask his wife, 'Why does she call you mom and dad?' and they say 'It's normal,'\" Luu recalled.\nBut the patriarchal relationship became inappropriate over \"eight or nine months\" when Stacey Esterly said she learned her husband was allegedly having sex with Amy, according to Waldron.\n\"She tried to prevent Kevin on almost a daily basis from having contact with Amy,\" Waldron said, adding that Stacey Esterly didn't report him to authorities at first because she was concerned about fracturing her family.\nMiami Dade County County Jail\nWaldron said that Stacey Esterly eventually started to feel more uncomfortable with the relationship.\n\"It was reaching a breaking point, which is part of the reason why Kevin ultimately took off with Amy,\" he said. \"Because he knew that Stacey was going to take more drastic measures with the authorities.\"\nMeanwhile, Luu is questioning how she could have trusted Esterly for so many years.\n\"This guy is so bad,\" she said. \"I never thought he would act like that.\"",
    "source_domain": "abcnews.go.com",
    "title": "Mom of teenage girl who fled to Mexico with married man regrets fight with daughter",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/mom-teenage-girl-fled-mexico-married-man-regrets/story?id=53836326"
}