{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 04:15:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The Latest: Moore's wife: 'One of our attorneys is a Jew'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-rnc-official-quits-groups-support-moore-51717961.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_0d01a624084f4b7180fafe984c6afdb6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the Alabama Senate race (all times local):\n8:30 p.m.\nThe wife of Republican Senate candidate Roy Moore is defending her husband against accusations of bigotry by pointing out that one of their attorneys \"is a Jew.\"\nKayla Moore made the comment at a rally for her husband in rural Alabama Monday night.\nShe says the \"fake news\" has falsely accused her husband of being against women in office and black and Jewish people.\nShe adds: \"Well, one of our attorneys is a Jew. We have very close friends who are Jewish and rabbis.\"\nKayla Moore says she wanted to clear the record for the large media presence at her husband's final rally before Tuesday's vote.\n——\n8:20 p.m.\nAlabama Republican Roy Moore is using his closing campaign rally to lash out at sexual misconduct accusations against him.\nSpeaking at a Monday night rally, Moore is urging his supporters to get to the polls Tuesday and calling the article that first raised allegations against him \"disgusting.\"\nMoore, 70, faces allegations of sexual misconduct involving teenage girls decades ago.\nMoore says, \"If you don't believe in my character, don't vote for me.\"\nMoore, who was twice removed as state Chief Justice for thwarting court orders regarding the Ten Commandments and same-sex marriage, argued the nation must \"go back to God.\"\nHe says, \"I want America great and I want America good and we can't be good until we go back to God,\" Moore said.\n——\n8:10 p.m.\nAbout 50 protesters gathered outside Republican Roy Moore's final rally of the U.S. Senate race in Alabama.\nThe group on Monday night chanted \"Country over party, vote Doug Jones\" and \"Don't let a pedophile in office.\"\nMany carried Jones signs. Some women were dressed as handmaids — from the novel and TV drama \"The Handmaid's Tale\" — to symbolize Moore's accusers, whom they said are being silenced.\nMoore has been accused of sexual misconduct with teenagers when he was in his 30s.\nChristina Evans, 24, says being a GOP candidate in a Republican state should not excuse Moore's behavior.\n———\n8 p.m.\nDemocratic Senate candidate Doug Jones says it's time for Alabama voters to say \"enough is enough.\"\nHe says his campaign against Republican Roy Moore is about the state choosing \"the right path\" rather than following a history he says is marred with bad choices.\nJones notes Moore was twice tossed off the Alabama Supreme Court for ignoring federal law and has since been accused of molesting and trying to date teenage girls when he was in his 30s.\nThe Democrat says \"decency\" demands not supporting Moore.\nGiven Alabama's conservative bent, Jones needs support from Republicans to win Tuesday. He is reminding voters that Alabama Sen. Richard Shelby has publicly confirmed he wrote in another Republican on his ballot rather than back Moore.\n———\n7:30 p.m.\nFormer professional basketball star Charles Barkley says Alabama voters must send Democrat Doug Jones to the Senate to assure the rest of the nation \"we're not a bunch of damn idiots.\"\nAn Alabama native, Barkley says Republican Roy Moore would continue to embarrass a state that has a history of politicians garnering negative attention.\nBarkley is speaking at Jones' final campaign rally before polls open Tuesday morning.\nHe took aim at Moore's top celebrity campaigner, Steve Bannon. President Donald Trump's former adviser was also in Alabama on Monday.\nBarkley called Bannon a \"white separatist nationalist\" and said he and Moore are courting voters who hold Alabama back.\nBarkley is from outside Birmingham. He has commented over the years on Alabama politics, periodically entertaining the idea of running for governor.\n———\n7:15 p.m.\nFormer White House strategist Steve Bannon says Alabama's special election for a U.S. Senate seat is an \"up-or-down vote between the Trump miracle and the nullification project.\"\nBannon is speaking at a campaign rally for Republican candidate Roy Moore on the night before the election.\nHe says, \"This is greater than Judge Moore and even greater than the people of Alabama.\"\nThe decor at the \"Drain the Swamp\" rally in rural southeast Alabama features a plastic alligator and plants. Other conservative icons on the agenda included Rep. Louie Gohmert of Texas and former sheriff David Clarke of Wisconsin.\nBannon's former boss, President Donald Trump, said in a robocall Monday to Alabama voters that he badly needs Moore's vote in the Senate.\n——\n2:10 p.m.\nRepublican Roy Moore is casting himself as a victim in the Alabama U.S. Senate race.\nIn a call to a conservative talk radio show in Montgomery on Monday, Moore took aim at a political group called Highway 31, which has run ads hammering Moore over alleged sexual misconduct involving teen girls. The group hasn't disclosed its donors as it supports Democrat Doug Jones.\nMoore says the ads have been \"ugly.\" He laments the tone of the campaign and says he's been the recipient of vicious, unfounded attacks.\nStill, Moore is expressing confidence in Tuesday's outcome.\nHe also claimed a potential surprising variable: support within the black community that leans overwhelmingly Democratic in Alabama.\n———\n1:25 p.m.\nA House Democrat wants to know what preventative steps are being taken to protect teenage pages if Alabama elects Roy Moore.\nWisconsin Rep. Gwen Moore wrote to Senate Sergeant at Arms Frank Larkin saying she was urgently concerned that young men and women working as pages would need protection if Moore wins on Tuesday.\nMoore faces several allegations of sexual misconduct, including the accusation that he molested a 14-year-old girl decades ago when he was in his 30s. He has denied the accusations.\nSenate pages must be high school juniors, at least 16 years old, and attend school. Their duties include delivering legislation and correspondence at the Capitol. They attend classes in the morning.\nMoore wrote that Congress has an obligation to keep the pages safe.\n———\n10:15 a.m.\nDemocratic candidate Doug Jones says Republican Roy Moore is hiding in the closing days of Alabama's U.S. Senate campaign.\nJones stopped by a breakfast spot in Birmingham early Monday to greet voters. So many media members were present that only a few other people could get inside.\nJones chided Republican Roy Moore for being out of sight ahead of Tuesday's election. He says Moore was out of state over the weekend.\nMoore was in Montgomery on Sunday afternoon, but his campaign hasn't responded to questions about his whereabouts over the rest of the weekend.\n———\n9:19 a.m.\nFormer President Barack Obama and former Vice President Joe Biden have recorded calls urging turnout in Alabama's heated race for U.S. Senate.\nA person familiar with the campaign said Monday that Obama had recorded a message in support of Democrat Doug Jones. Jones is attempting to become the first Alabama Democrat elected to the U.S. Senate in 25 years. He is locked in a heated battle with Republican Roy Moore.\nBiden held a rally for Jones in Birmingham, Ala. earlier this year and has also recorded a call for Jones.\nThe Jones camp is sending out dozens of types of calls on the eve of the election to urge turnout. They include a news clip in which Republican Sen. Richard Shelby said that Alabama deserves better than Moore.\nPresident Donald Trump has recorded a call urging people to vote for Moore.\n———\n8:45 a.m.\nAn official has quit the Republican National Committee over the GOP's support of Alabama Republican Senate candidate Roy Moore, who faces accusations of sexual assault and harassment.\nJoyce Simmons, the GOP national committeewoman from Nebraska, emailed the 168-member governing body Monday to inform them that she had tendered her resignation. She writes: \"I strongly disagree with the recent RNC financial support directed to the Alabama Republican Party for use in the Roy Moore race.\"\nSimmons adds that she wishes she could have continued her service \"to the national Republican Party that I used to know well.'\nThe RNC had pulled support from Moore after the allegations surfaced against him last month. But the organization re-entered the race once President Donald Trump endorsed Moore, citing the need for a Republican in the seat.\n———\n3:35 a.m.\nRepublican Roy Moore and Democrat Doug Jones are making their final pushes ahead of Tuesday's special Senate election in Alabama.\nJones and Democrats are framing the election as a way for Alabama to reject its history of politicians with baggage that hampers the state.\nRepublicans say it is about keeping a conservative hold on Alabama and not giving Democrats any opportunity to derail President Donald Trump's agenda before the 2018 midterms.\nIn truth, the matchup is a mix of Alabama's history and the partisan divides plaguing Washington.\nJones says it would be disastrous to elect Moore after the former judge was accused of sexual misconduct with teenage girls. Moore denies the charges.\nMoore and other Republicans say Jones would be a puppet of liberal Democratic leaders out of step with Alabama.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Moore's wife: 'One of our attorneys is a Jew'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-rnc-official-quits-groups-support-moore-51717961"
}