{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:46:43+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Dozens of shark sightings have been reported on both coasts, with 11 great white sharks spotted off Cape Cod and three in San Diego.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Famid-dozens-sightings-girl-bitten-shark-myrtle-beach-56359930.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_whit_johnson2_0716_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Amid dozens of sightings, girl bitten by shark in Myrtle Beach\nThank you. To anotheroliday concern as millions of Americans hit the beach, sh, the latest scareou're looking at in a popular van spot, Myrtle Beach and a girl injured innattack. The after caught on cell phone video. This comes amid dozens of shark sightings othcoasts. Reporter: Thean said S heard scs. The fami of this girl crying for help. Then she claims she saw a Finn the water where the was swimming headed over to that shark bite. Reporter: Iturned terrifying for this young girl repoedly bit by a shark. A rescue teen tending to her leg. The starred screangshark, SHAR Reporter:his is just the latest I summer beach season. On CAPD, 11 great whi sharks seen offsre in the past week. One beach temporarily clothed. This S spotted by the U.S. Ast guard off the coast of Maine Tuesday and in Diego, three sharks reported just a week after a sharkk ae out of awoman's canoe. Fell tug on mypaddle. That's when I screamed like a little girl. Reporter: But back at Myrtle Beach it wasn't eh to keep beachgoers out ofsurf. What'so shocking after man minutes a lot of people went in the water. Reporter: The South Carolina department of nal resources saysblk-tipped ark, bull ks and tiger sharks are all common alonghe stretch of coastline and all can pose a threat to PEOP.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Amid dozens of sightings, girl bitten by shark in Myrtle Beach",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/amid-dozens-sightings-girl-bitten-shark-myrtle-beach-56359930"
}