{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 13:20:21+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The Latest: Boeing's North Charleston plant votes on union",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-boeings-north-charleston-plant-votes-union-45505056.json",
    "image_url": "http://abcnews.go.com/US/wireStory/latest-boeings-north-charleston-plant-votes-union-45505056",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the vote by employees of Boeing's plant in North Charleston on whether to join a union (all times local):\n6:45 a.m.\nVoting is underway as thousands of workers at Boeing's South Carolina plant decide if they want to unionize.\nPolling places opened early Wednesday morning throughout the aviation giant's sprawling facility in North Charleston. A second wave of voting takes place this afternoon.\nNearly 3,000 production workers are eligible to vote in the election to determine if they'll be represented by the International Association of Machinists and Aerospace Workers. The union initially petitioned for a vote in 2015 but called off that election because of what the union called a toxic atmosphere and political interference.\nThe global aviation giant came to South Carolina in part because of the state's minuscule union presence. Labor experts say a \"yes\" vote would have repercussions throughout the South, potentially inspiring other workers to think about unionizing.\n———\n4:10 a.m.\nNearly 3,000 production workers at Boeing's South Carolina plant are deciding if they want to unionize, writing the next chapter in efforts to organize labor in large manufacturing plants across the South.\nIf successful, Wednesday's balloting on whether employees should join the International Association of Machinists and Aerospace Workers would send a significant message to politicians both in the region and Washington that workers here are demanding the same protections and benefits as their colleagues in other areas.\nAnd, to the leaders trying to recruit businesses by promoting their states' lack of union presence, it'd make their jobs more difficult.\nLabor experts say a \"yes\" vote would have repercussions throughout the South, potentially inspiring other workers to think about unionizing.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Boeing's North Charleston plant votes on union",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-boeings-north-charleston-plant-votes-union-45505056"
}