{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:59:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Tupac Shakur was mourned in the Brooklyn, New York, church he attended as a boy, mourned by those who see him as a victim in a society where murder is the leading cause of death for young black men.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fvideo%2Fsept-15-1996-remembering-tupac-shakur-48044588.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/170614_abc_archives_tupac_shakur_memorial_1996_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Sept. 15, 1996: Remembering Tupac Shakur\nWho we are. But Bob. To park Circor was mourned today at the Brooklyn church he attended as a boy. Mourned by those who see him as a victim and a society where murder is the leading cause of death for young black men this a wake up. Call this opportunity to kind of check ourselves as a community and understand violence. And a lifestyle that isn't as responsible as could be could lead to this kind of thing. I think it. All of that court lived what he called the fog lights surviving another shooting three years ago arrested frequently. If convicted of sexual abuse and assault. His gangster rap lyrics exploded with the rage and rough life lived on the edge. We knew we miss them but Bob they don't love it was just on the like that is. Unfortunately in the hood that's where a lot of laws in their lives and and his alleged that same way. But critics say he dangerously glorified violence and profanity that makes it very high. Com the kind of message that is being cents. So young children like this and younger who can you know fulfills lyrics from start to menace but may not know they ain't easy. Check horrors murder had all the markings of a gang style hit. But police so far stymied in part because they've received almost no help from members associates who may have witnessed the killing police now fear retaliation. And worry the crime may never be solved. This mural on Manhattan's lower east side reflects the feeling of the many who do not we Porsche core. People who believe he was just another violent rapper who died the way he lived proving tragically that violence will only lead to more violence. Antonio Mora ABC news New York.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Sept. 15, 1996: Remembering Tupac Shakur",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/video/sept-15-1996-remembering-tupac-shakur-48044588"
}