{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 19:56:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Jets' Forte on those who think team is tanking: 'Bring it'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjets-forte-team-tanking-bring-48039234.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_a1eef9d5ed6a4c888b2675974d55f65b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Matt Forte remains focused only on winning, no matter what anyone else thinks.\nSo, when some New York Jets fans suggest the team is tanking the upcoming season — or, should — to get a high draft pick next spring, the veteran running back completely disagrees with the notion.\n\"It's a good thing we don't operate off of what the fans think and what everybody on the outside thinks,\" Forte said Wednesday before the team's second minicamp practice. \"What we think as a team, that's what's going to happen. And none of us on the team think that we're going to tank.\n\"So all I have to say about that is: Bring it.\"\nThe Jets are coming off a 5-11 season and parted ways with several productive and popular veterans in the offseason to cut some big salaries. Gone are the likes of Darrelle Revis, Brandon Marshall, Eric Decker, Nick Mangold, David Harris and Nick Folk.\nWhen asked if he thinks the Jets have a competitive roster, Forte laughed.\n\"What kind of question is that?\" he said. \"This is a professional football team. We have athletes on this team. In the league, it's not about the team that has the most talent on the roster. It's about the guys who have a brotherhood together. They play on the field, not next to each other, they play for each other. They make sacrifices on the field so the other guys can make plays.\n\"That's the kind of culture that we've been creating throughout the offseason here.\"\nThe 31-year-old Forte is one of the few remaining vets. And he hasn't been assured that he'll be around for this season.\n\"I don't worry about stuff like that,\" said Forte, whose 813 yards rushing in his first season with the Jets were the lowest of his career. \"Nobody has come to me about any of that stuff. I'm pretty sure if they did, my agent would've called me. I go out and practice every day to attain a goal, which is reaching the championship and being the best I can be.\"\nForte echoed the sentiments of coach Todd Bowles, who on Tuesday dismissed the \"tanking\" notion.\n\"Lucky for me, I don't read the media,\" Bowles said, \"but my expectations are high and the team's expectations are high and that's really all that counts.\"\nWhen asked what he's looking to accomplish in a season with such gloomy outside predictions, Bowles insisted nothing has changed.\n\"I'm trying to get to the playoffs and win a Super Bowl,\" the coach said. \"It's no different than any other year.\"\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Jets' Forte on those who think team is tanking: 'Bring it'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/jets-forte-team-tanking-bring-48039234"
}