{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 10:28:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Son's love of basketball helps him cope with father's death",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fsons-love-basketball-helps-cope-fathers-death%2Fstory%3Fid%3D48036451.json",
    "image_url": "http://a.abcnews.com/images/Sports/abc-Gym-CU-er-170612_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sam Perkins has an almost encyclopedic knowledge of basketball -- specifically, America East men’s basketball. Once you get him talking about the collegiate athletic conference, it’s hard to get him to stop.\nIt’s this passion that led Sam to create the website One-Bid Wonders, which through 2015 was one of the few sites covering America East men’s basketball. Not only was it a home for the rabid America East fan to get their fix of news and in-depth reporting, but it also became an outlet for Sam to reconnect with his deceased father, Jack Perkins, who taught Sam everything he knew about basketball. Jack made a tradition of taking Sam and his younger brother Noah to America East games.\n“One-Bid Wonders was my connection to my dad, going through my fingertips out there onto the worldwide web,” Sam says.\nWHAT TO KNOW Sam Perkins grew up sharing his father’s passion for the underdogs of college basketball - the America East Conference. When his father tragically passed away, Sam sought to keep his father's memory alive by \"chasing his father's ghost” through devoting himself to the game that once brought them close together.\nSam, 32, grew up in Cambridge, Mass., where he played a bit of basketball, but was mostly a baseball player. He says that while growing up, he always worried about his parents.\n“I was a really nervous little kid,” says Sam. “And my anxiety was related [to the idea] that something was going to happen to my parents, but especially him [his dad].”\n“ ” it was really a great experience to get to be around him and my brother and to feel like it was an adventure to be going to these games.\nAs a boy, Sam always looked for assurances from his dad that everything was going to be okay, and that nothing was ever going to happen to his parents. But Jack Perkins never gave his son those false assurances.\n“He said, ‘the way that this works is that I'm not always going to be around,’” says Sam. “’The way it's supposed to work is that I die before you do. But a part of me is always going to be there with you.’”\nFrom an early age, Jack Perkins would pack his two sons in the car and drive over two hours east to Amherst, Mass., to attend games at his alma mater, the University of Massachusetts. At these games, he would describe more than just the stats and the rules of the game to his sons.\n“He wasn't someone that was yelling or cheering, but he would explain the game to me,” Sam says. “He’d tell me about the different players, he told me about their backgrounds. He’d tell me about kind of the narrative and it was really a great experience to get to be around him and my brother, and to feel like it was an adventure to be going to these games. That was how I became a fan.”\n“He was a really good dad. He would always take us to the park to play basketball, he was my basketball coach,” says Noah. “He was a really good guy, but I guess I would describe him as complicated.”\nJack Perkins stood 6’6” with a lean frame, and was a talented basketball player in college. He was a systems analyst for the U.S. Department of Transportation, where he earned a decent paycheck. His two sons remember him having a great sense of humor and a healthy appetite for knowledge, but they also always felt their dad had an underlying sadness.\n“He had this crazy sense of humor, but I could also tell that there would be times when he wasn't super happy,” says Sam. “I know that he would have rather done something else for work... he wasn't inspired by his work. It gave him a good paycheck, good benefits as a government job, but it wasn't what he wanted to do...I know he had this plan for a while that when he retired he wanted to try and become like a history teacher in a middle school somewhere.”\n“I think he wanted to be a writer, but he ended up working for the Department of Transportation,” say Noah. “When my mom and dad divorced, I think that really took a toll on him, and for me -- I was five when they got divorced.”\nBy the time Sam was in high school, the trips to Amherst to catch a UMass game became less frequent. The team wasn’t as good, and not worth the long drive for the Perkins family. At that point, Sam was a teenager and looking for more independence. Jack Perkins decided to go more local for his basketball fix and got into the America East men’s basketball, with two teams right next door in Boston: Boston University and Northeastern University.\nAmerica East is one of the smaller conferences in Division-I men’s basketball, sporting nine teams, with only one team making it into the National Collegiate Athletic Association finals every year.\n“America East basketball is very small-time in the grand landscape of the college basketball scene. “It is tiny programs. It’s kids playing in front of empty seats. They're not playing on national TV. They're not household names. So, these are the underdogs. These are the David’s of the world definitely,” Sam says, referring to the story of David and Goliath. “Except they're like the David’s without a slingshot.”\nWill Brown, head coach of the University at Albany’s men’s basketball team, part of the America East Conference, agrees.\n“We’re not recruiting the McDonald’s All-American or the top 50 player nationally,” he says. “I think the elite programs in the country, they can handpick who they want.”\nJack brought his two sons to check out the America East, and Sam fell in love immediately.\n“I think at first I was like what is this rinky-dink,” says Sam. “Then when the guys started playing, I loved it because of how hard they were playing, and it was actually a really good level of basketball. They were guys that that you could relate to more. And it was just it was great to reconnect with that experience of doing something with my dad and with my brother.”\n“ ” I kept going to games because I didn't know what else to do.\nAfter attending a memorable 2003 America East Championship game, where the University of Vermont upset Boston University, Jack bought tickets for him and his boys to attend the first game of the following season for Boston University.\nBut just a week before that opening game, tragedy struck when Jack was hit by a van while riding his bicycle home from work.\n“We got a call from the hospital my mom answered,” says Sam. “She was like, we have to go get your brother, your dad was in a car accident, he got hit by a car. We don't know much what happened.”\n“I remember I just started high school, this happened in November, I was in science class,” says Noah. “I remember the principal came to get me from class, and I'm thinking maybe I'm in trouble. He handed me a cell phone, and he’s like, ‘you have to call your mom.’ And so, I called my mom, and she’s crying on the phone and she's like, ‘it's your dad. You know there's been an accident.’”\nWhen the brothers arrived at the hospital they saw the man they idolized their whole life lying on a hospital bed, badly bruised and coming in and out of a coma.\n“By the time we got there he'd been out of surgery,” says Sam. “Just looking at him, his face was so swollen... he didn't look like my dad. And they really couldn't tell us what was going to happen or not. They said he's got bleeding in the brain, with the rundown of ‘we really don't know, it kind of takes a while to see how do these things.’\n“But I had these tickets that my dad and my brother and myself are supposed to go to the opening game, and my brother wasn't up for going,” he added.\n“For me, I just needed to not talk about it, and not be around the American East, and things that were big reminders of our dad,” says Noah. “For [Sam], it was like the exact opposite.”\nRight after that first game, Sam went straight to his father’s hospital bedside and told him all about it.\n“It was really tough for a while to see him, feeding tube in, breathing tube in and all during that time when he was in the hospital, basically in and out of a coma,” Sam said. “I kept going to games because I didn't know what else to do.”\nThen, in early January of 2004, after being in a coma for two months, Sam and his brother made the tough decision to take Jack off life support.\n“My dad used to always joke around with me because we start watching “The Simpsons” together when I was in grade school,” Sam recalls. “He used to always say, ‘if I ever become Grandpa Simpson I want you to take me out into a field and shoot me, because I don't want to live life like that.’ So that always stayed in the back of my mind. He wouldn't have wanted to be a vegetable. So we took him off life support. Then he was gone.”\nAfter his father’s death in January, Sam kept going to America East games and finished college, graduating in 2007 with a degree in English from the University of Massachusetts Boston. Not knowing exactly what he wanted to do with his life, and still grieving, he began writing about America East basketball and hustling to sell his articles to local papers and online blogs.\n“I just started pestering publications: ‘Hey, can I cover the America East, you don't have anyone writing about it,’” Sam recalls. “And I wound up being able to freelance and write for these different publications and then that's when I really got to know the players and the coaches.”\nThen in 2010, while at a wedding, he met Matt Whitrock, who was attending Boston University and wrote for the student paper. They both shared a love of America East basketball, and kept in touch after that wedding.\n“One night we were just talking and somehow the idea came out,” says Sam. “We should launch a website covering this league, because we're both really into that like narrative aspect of it. And so, then that summer we did it, for the following year 2010-2011. And One-Bid Wonders was born.”\nUsing his own money, Sam drove all over the northeast U.S., covering games and writing in-depth profiles of players and coaches of the conference for One-Bid Wonders. For years, he loved every moment of it.\nFour years after it was launched, One-Bid Wonders began to take off; one of Sam’s most-trafficked pieces received about 70,000 views. Soon he found investors, which enabled Sam to hire more writers for the site, and he even was able to pay himself a salary. But even with added support, he was spread thin.\n“ ” it just went from really helping me to keep moving forward to then it started hindering me that last year.\n“Once there was a paycheck involved in it, that passion really went, because I felt like the expectations started to become unreasonable,” says Sam. “I was writing an insane amount. The month of January I wrote 32 feature stories in one month. That is absurd. We're talking 32 well-researched, interview, going in-depth writing, 2,000, 3,000, 3,500 words for each of these stories. No one does that. No one anywhere writes that much. Sports Illustrated, you're doing like, one a month, like at the pinnacle of sports journalism. You're not doing 32 of those.\n“And the viewership started growing, but it was never enough,” Sam continues. “I would write a great story, one that I should've been so proud about, and it was immediately onto the next one and I wasn't taking pride in my work. I wasn't sleeping. My health was deteriorating, and it just was getting to be too much. I was just like you know what, I think this is the end, because it's making me not love the thing that I've loved for so long.”\nSam also started to not feel his father as much at the games he attended, and not as much in the work he was producing. In August 2015, One-Bid Wonders was officially done.\n“All that time I spent there, it was helping me to start to move forward again in life,” says Sam. “And I feel like that last year of it I stopped moving forward again, because I started worrying so much about everything else associated with it -- bills and paychecks and views, and investors and all this stuff. So it just went from really helping me to keep moving forward, to then hindering me that last year.”\nNoah says that he saw a sense of sadness when his brother shuttered the site.\n“It was something he put so much of himself into for so long,” Noah says. “But I also do think that there was a sense of relief, in the sense that it was freeing for him. To be able to get away from, I guess, chasing the ghost of our dad.”\nAfter that final year running One-Bid Wonders, Sam completely divorced himself from America East basketball -- not attending or watching a single game, and not reading anything about the conference or players.\n“I had 13 years of amazing experiences and emotions and feelings with the America East,” says Sam. “I felt like that one year of doing it as my job, like it was completely overshadowing them, so I just needed a break.”\nAlmost two years after the closing of One-Bid Wonders, Sam decided to go back and watch the America East again, and says that the positive feelings he used to experience watching those games began to come back again. Today he’s a dad, and works as a special-ed school teacher. He believes he has found his passion in life.\nHe has also been able to spiritually reconnect with his father, finding him outside of the America East and One-Bid Wonders.\n“I was a little worried I guess that last year that I had lost that connection with my dad,” Sam says. “But I have reconnected with him. I have my son now. He's eight months old, he's named Jack, and I feel my dad when I'm with my son. I'm trying to be a good dad, and I'm trying to remember how my dad was as a father, and the lessons he imparted on me by the way he raised me, and the kind of dad that he was.\n“I don't know if I'll ever be on his level as a dad but,” he adds. “if I can be a quarter of the dad that he was, I'll be doing a pretty good job.”",
    "source_domain": "abcnews.go.com",
    "title": "Son's love of basketball helps him cope with father's death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/sons-love-basketball-helps-cope-fathers-death/story?id=48036451"
}