{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:33:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Pipe bomb strapped to man explodes in NYC subway, injuring 2",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fnypd-responding-report-times-square-area-explosion-51715050.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_8d60f5a82c0c4aefb6f1e30472283d20_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A pipe bomb strapped to a man went off in the New York City subway near Times Square on Monday, injuring the suspect and another person at the height of the morning rush hour, law enforcement officials said.\nThe man and the other person were being treated for non-life-threatening injuries. The officials spoke to The Associated Press on condition of anonymity because they were not authorized to speak publicly about the incident.\nPolice say the explosion happened in an underground passageway under 42nd Street between 7th and 8th Avenues. The 7:30 a.m. blast filled the passageway, crowded with throngs of Monday morning commuters, with smoke.\nThe explosion triggered a massive emergency response by police and fire both above and below ground, tangling subway and bus service at the nearby Port Authority bus terminal.\nVideo from above the \"Crossroads of the World\" showed lines of police and emergency vehicles, their lights flashing, lining the streets and no other vehicle traffic moving.\nEverything around the Port Authority area was shut down — a surreal scene of still at what would ordinarily be a bustling rush hour.\nNew Jersey Transit buses headed to the Port Authority were diverting to other locations. NJ Transit said buses were taking passengers to Secaucus and Hoboken, where they could take trains into the city.\nWhite House Press Secretary Sarah Sanders tweeted that President Donald Trump had been briefed on the explosion.",
    "source_domain": "abcnews.go.com",
    "title": "Pipe bomb strapped to man explodes in NYC subway, injuring 2",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/nypd-responding-report-times-square-area-explosion-51715050"
}