{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 23:12:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Berkshire Hathaway sells off GE stake, boosts BNY Mellon",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fberkshire-hathaway-sells-off-ge-stake-boosts-bny-49215679.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/berkshire-hathaway-sells-off-ge-stake-boosts-bny-49215679",
    "language": "en",
    "localpath": null,
    "maintext": "Warren Buffett's company has eliminated its stake in General Electric and boosted its investment in the Bank of New York Mellon Corp.\nBerkshire Hathaway revealed those moves and several other changes to its U.S. stock portfolio in a filing with the Securities and Exchange Commission on Monday.\nBerkshire didn't list any GE shares in its holdings at the end of June. Previously, it owned 10.6 million shares.\nBuffett's Omaha, Nebraska-based company increased its stake in BNY Mellon to 50.2 million shares from 33 million in March.\nBesides those big changes, Berkshire adjusted its airline investments by trimming its stakes in American Airlines, Delta and United Continental. Berkshire didn't change its investment in Southwest Airlines.\nMany investors follow what Berkshire buys and sells because of Buffett's remarkably successful record over more than five decades. Berkshire officials don't generally comment on the quarterly filings or the reasons for their portfolio moves.\nAnd these quarterly filings don't make clear who made all the investments. Buffett handles the biggest investments in Berkshire's portfolio, such as Coca-Cola, Wells Fargo and IBM. He has said that investments of less than $1 billion are likely to be the work of Berkshire's two other investment managers.\nBerkshire also increased its Apple investment to 130.2 million shares, up slightly from 129 million shares in March.\nBerkshire also continued reducing its stake in IBM to 54 million shares from 64.6 million in March. Previously, Berkshire held more than 80 million IBM shares, but Buffett said the company hadn't performed as he expected.\nBesides investments, Berkshire owns more than 90 companies, including insurance, retail, manufacturing, railroad and candy companies.",
    "source_domain": "abcnews.go.com",
    "title": "Berkshire Hathaway sells off GE stake, boosts BNY Mellon",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/berkshire-hathaway-sells-off-ge-stake-boosts-bny-49215679"
}