{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:22:37+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Peterson, convicted of murdering his pregnant wife and unborn child nearly 15 years ago, reveals in a new A&E documentary he was \"staggered\" by the conviction and \"had no idea it was coming.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fscott-peterson-breaks-silence-murder-conviction-49201787.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_macedo_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Scott Peterson breaks his silence on his murder conviction\nFirst this half hour we turn to those never before heard phone calls from a murder mystery gripping the nation for the past 15 years. Scott Peterson speaking out from death row after being convicted for killing his wife Laci Peterson while she was eight months pregnant. A new A&E series taking a fresh look and Diane Macedo has details. Good morning. After more than a decade Scott Peterson is breaking his silence on everything from his guilty verdict to why he kept calling his mistress even after his wife disappeared. It's just one of many interviews featured in this series aimed at shedding a whole new light on a case we thought we knew. I was staggered by it. I had no idea it was coming. Reporter: That's the voice of Scott Peterson in a brand-new interview talking from death row about the moment he was found guilty of murdering his wife and unborn child. A jury just convicted him of guilty. Reporter: Now an A&E series takes a new look at the case. Laci Peterson eight months pregnant disappeared in 2002 on Christmas eve. Scott told police he had been fishing that day. She will be giving birth real soon. That's the best way we can do it all. Reporter: He hasn't spoken out about it since his conviction. What made him now. His case is under appeal and felt like a moment for him and his lawyer to step up and say something about the case. Want to talk about the murder first. Oh, it was crazy there. It was just amazing, horrible physical reaction that I had. I couldn't feel my feet on the floor. I couldn't feel the chair I was sitting in. My vision was even a little blurry. Reporter: The series revisits most of the key players including amber Frey whose bombshell admission changed everything. Scott told me he was not married. Reporter: A ref dags Peterson discusses in a 2004 audiotape that was never released until now. Why did you talk to amber after Laci had gone missing? The overriding reason throughout it all was she starts giving media interview, there is no more search for Laci and conner. I'd just seen what happened to the search for Chandra levy. There was no more search for her. Every hour I could buy to keep the search going is all solved if I bring Laci and conner home. Reporter: The effect the media had on the case and evidence potentially overlooked like witnesses who claim to have seen Laci after she went missing. Can you give us any examples of moments people might notice that may change their minds? I think when you listen to the witnesses who said they saw Laci in the park that would be a kind of surprise. I wasn't the last one to see Laci that day. There were so many witnesses that saw her walking in the neighborhood after I left. Reporter: Still producers say this is not an exoneration piece and that they look at all sides of the case. What are you hoping to accomplish with this series? I want people to say, what actually happened here. The documentary series \"The murder of Laci Peterson\" premieres tomorrow night on A&E. Laci's family, the prosecutor and lead detective declined to participate in that documentary and now I ask fundamental that might make it one-sided the executive producer said they did everything to make sure that side of the story is also represented here. Okay. Good to know there, Diane. Thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Scott Peterson breaks his silence on his murder conviction",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/scott-peterson-breaks-silence-murder-conviction-49201787"
}