{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 01:46:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "In Pacific, rising tensions evoke troubling nuclear legacy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpacific-rising-tensions-evoke-troubling-nuclear-legacy-50337350.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_c22ab166897d4e5d9c9a16d92e0d536e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As a young boy growing up on Bikini Atoll, Alson Kelen spent idyllic days playing on the beach and fishing.\nHis grandfather built canoes and his father tended the land. With fewer than 150 people on the remote Pacific island it was a close community, he says, with few signs of the former U.S. nuclear testing program other than the concrete bunkers he was told to avoid and the sunken ships in the lagoon.\nBut in 1978, when Kelen was 10, officials evacuated everybody. It turned out they'd been premature in declaring the Marshall Islands atoll safe again for humans. Radiation levels were still dangerously high.\nMore than 70 years after the first tests, the atoll remains contaminated today. It's part of a troubling nuclear legacy that continues to affect islands and people across the Pacific long after the U.S., Britain and France stopped their testing programs there.\nAs nuclear tensions rise in the Asia-Pacific region, and in the South Pacific in particular, Kelen and others are reflecting on that legacy anew.\nNorth Korea has discussed testing a hydrogen bomb in the Pacific after earlier firing a missile over Japan and threatening Guam. U.S. President Donald Trump has threatened to \"totally destroy North Korea\" if provoked and called leader Kim Jong Un \"Rocket Man.\" The dictator has responded by calling Trump a \"mentally deranged U.S. dotard.\"\nKelen says that if the threats do escalate to a nuclear test or even an attack, \"it would be a huge, huge disaster.\"\nThe 49-year-old says he has no idea if his exposure to radiation during the four years he lived on Bikini as a boy has affected his health. He says scientists used to test him and his family regularly, but stopped within a couple of years of them leaving the atoll.\nScientists have calculated that about 1.6 percent of all cancers developed by Marshallese people exposed to radiation can be attributed to the nuclear tests. For some islanders who were close to the blasts, the rate rises to 55 percent.\nThe nuclear tests exacted an enormous social toll on Bikini residents and their children, who are now scattered across the Marshall Islands and beyond and have been left without a homeland. Kelen says they've lost the ancestral land that's central to their identity.\n\"Ninety percent of Bikinians have never seen Bikini. It's a legend; it's a fairy tale,\" he said. \"They know more about Hawaii and the U.S. mainland than Bikini.\"\nThe U.S. government first asked Bikini residents to leave temporarily in 1946. It then conducted a series of tests over a dozen years, including detonating a massive hydrogen bomb hundreds of times more powerful than the nuclear bombs the U.S. dropped on Japan during World War II.\nThe inhabitants were moved to other islands that proved inhospitable. Kelen's family eventually ended up in Majuro, the capital. He says his parents always planned to return to Bikini but got to spend just four years there before being told to leave again. Kelen's father died two years ago and his mother, now 93, is too old to travel.\n\"They told us we were relocated from Bikini for the good of mankind, to bring peace to the world. But I think nuclear is the same as climate change,\" Kelen said. \"It benefits the big countries and ruins the small countries.\"\nBikini residents have received some compensation from the United States. But many people, including Marshall Islands President Hilda Heine, say it's not enough.\nHeine said in a speech this year that the removal of the Bikini residents produced \"inconsolable grief, terror and righteous anger\" that hadn't diminished in the seven decades since, and had been exacerbated by the U.S. being dishonest about the extent of the radiation and its effects.\nFive thousand kilometers (3,000 miles) away in Tahiti, French Polynesia, Roland Oldham is also grappling with nuclear testing's legacy.\nHe is president of Moruroa e tatou, an organization that represents victims of French tests at Moruroa and Fangataufa atolls. The nuclear tests lasted 30 years, ending in 1996, the year the United Nations adopted the Comprehensive Nuclear Test Ban Treaty.\nStudies have shown that people in the region during the tests had an increased risk of developing thyroid cancer. But information on radiation exposure remains classified, making it hard to estimate the risks.\nOldham says those who worked directly on the testing program suffered high rates of cancer and other health problems. He says it's difficult to get good statistics on the health effects on the broader community because of the continuing secrecy.\nMuch of the later testing was carried out underground, but some radiation has leaked. Oldham fears the problem could get much worse because parts of the atolls are in danger of subsiding.\nOldham, 66, says he sailed around Moruroa while completing his military service with the French Navy in 1970. He says he never saw or felt anything, and doesn't know if he was exposed to radiation or the extent of that exposure.\nOldham says the heated rhetoric between the leaders of North Korea and the United States has made much of the Pacific vulnerable at the moment because of U.S. military bases in places like Guam, Japan and South Korea.\n\"The day the two guys throw a punch at each other,\" he said, \"the whole area will be suffering.\"\nHe says he worries that mankind is headed toward its own destruction by nuclear weapons.\n\"At some stage I want to be sick, when I observe the things happening in front of my eyes,\" he said. \"What a world. What a crazy mess.\"",
    "source_domain": "abcnews.go.com",
    "title": "In Pacific, rising tensions evoke troubling nuclear legacy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/pacific-rising-tensions-evoke-troubling-nuclear-legacy-50337350"
}