{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:21:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "18 dead in suspected jihadist attack on Burkina Faso eatery",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2F18-killed-attack-restaurant-burkina-faso-capital-49200608.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_1663dd5767c8495bb0954bf07e2b63de_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hours after suspected Islamic extremists opened fire as patrons dined at the popular restaurant where she worked as a waitress, Amy Sawadogo was still wandering around barefoot at a crisis center asking about her colleagues.\n\"I just want to go to the hospital and see who is still alive,\" the distraught young woman, who was still dressed in her uniform, said early Monday. \"I am calling them in vain, no response.\"\nThe death toll rose to 18 and authorities said many of the victims were children dining with their families on a Sunday night at the Aziz Istanbul restaurant when horror struck once again in Burkina Faso's capital of Ouagadougou. At least 22 people were wounded.\nLess than two years ago, jihadists killed 30 people in a similar attack at the nearby Cappuccino cafe, which only recently reopened in a city where fear of another attack has been high.\nEight of the dead in Sunday's attack were citizens of Burkina Faso, authorities said. Three Lebanese and two Canadians were also killed, according to the victims' respective foreign ministries. Other victims came from Kuwait, Senegal, Nigeria, Turkey and France, state prosecutor Maizan Sereme said.\nThe attack began around 9 p.m. Sunday when the Aziz Istanbul, an upscale Turkish restaurant patronized by many foreigners, was packed with diners. Two young men wearing jeans and jackets drove up on motorcycles and began indiscriminately shooting at the people inside with Kalashnikovs, witnesses told The Associated Press.\n\"I heard a noise when they smashed a car with their motorbike and before I understood what happened they started shooting at the customers on the terrace,\" said Assane Guebre, who had been keeping an eye on customers' cars parked outside.\n\"They were close to me, and I still don't know how they did not hit me first,\" said Guebre, whose hands were still bleeding from the cuts he suffered when he threw himself to the ground to avoid the bullets.\nGunfire rang out long into the night before the country's special forces ended the attack after nearly seven hours. Initially authorities had said there were three or four assailants. However, government spokesman Remy Danguinou told reporters early Monday that two attackers had been killed by the authorities.\nThere was no immediate claim of responsibility but the attack bore the hallmarks of the January 2016 assault on the Cappuccino — gunmen opening fire on diners at a restaurant popular with foreigners, prompting a massive search for the culprits as gunfire and explosions continued into the night.\nPresident Roch Marc Christian Kabore declared three days of national mourning. \"The fight against terrorism is a long-term battle,\" he said in a statement Monday. \"That's why I'm calling for vigilance, solidarity and unity of the whole nation in order to face the cowardice of our adversaries.\"\nIn Paris, the office of French President Emmanuel Macron said he discussed the attack in a call with his Burkina Faso counterpart. The leaders agreed that it was urgent to accelerate the deployment of a new 5,000-strong anti-terror force in the Sahel, a statement said. With contributions from Mali, Mauritania, Niger, Burkina Faso and Chad — known as the G5 — the force is to deploy by September.\nAt least five members of Burkina Faso's security forces were among the wounded, and another member on leave at the time was among the dead, the state prosecutor said.\nBurkina Faso, a landlocked nation in West Africa, is one of the poorest countries in the world. It shares a northern border with Mali, which has long battled Islamic extremists.\nIn the 2016 attack the attackers were of foreign origin, according to al-Qaida in the Islamic Maghreb, which claimed responsibility for those killings along with the jihadist group known as Al Mourabitoun. But the terror threat in Burkina Faso is increasingly homegrown, experts say.\nThe northern border region near Mali is now the home of a local preacher, Ibrahim Malam Dicko, who radicalized and has claimed responsibility for recent deadly attacks against troops and civilians. His association, Ansarul Islam, is now considered a terrorist group by Burkina Faso's government.\n———\nAssociated Press writers Krista Larson in Dakar, Senegal; John Leicester in Paris and Rob Gillies in Toronto contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "18 dead in suspected jihadist attack on Burkina Faso eatery",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/18-killed-attack-restaurant-burkina-faso-capital-49200608"
}