{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 18:48:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "The Latest: Pelosi calls birth control decision a 'new low'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-pelosi-calls-birth-control-decision-low-50328854.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/latest-pelosi-calls-birth-control-decision-low-50328854",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the Trump administration's change of policy on birth control (all times local):\n1:05 p.m.\nThe top Democrat in the House says the Trump administration's decision allowing more employers to opt out of providing no-cost birth control to women is despicable.\nMinority Leader Nancy Pelosi says in a statement: \"This administration's contempt for women reaches a new low with this appalling decision to enable employers and health plans to deny women basic coverage for contraception.\"\nThe California lawmaker says Barack Obama's Affordable Care Act ensured access to preventive care for millions of women. She says Republicans, including House GOP lawmakers, have launched a \"sickening attack\" on women's health.\nHouse Speaker Paul Ryan welcomed the decision, calling it \"a landmark day for religious liberty.\"\n———\n11:20 a.m.\nThe Trump administration is allowing more employers to opt out of providing no-cost birth control to women by claiming religious and moral objections.\nThe administration has issued a long-expected revision to Obama-era rules. The rules require most companies to provide birth control as preventive care for women, at no additional cost. Under the Affordable Care Act, preventive services are supposed to be free of charge to employees and their dependents.\nThe Trump administration's revision issued Friday expands a religious exemption that previously applied to houses of worship, religiously affiliated nonprofit groups and closely held private companies.\nThe share of women employees paying for birth control pills has plunged to under 4 percent, from 21 percent, since contraception became a covered preventive health benefit, according to the Kaiser Family Foundation.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Pelosi calls birth control decision a 'new low'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-pelosi-calls-birth-control-decision-low-50328854"
}