{
    "authors": [
        "Abc News",
        "Stephen Iervolino"
    ],
    "date_download": "2017-06-14 20:55:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Gloria Estefan's 'incomparable' mother dies at 88",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fgloria-estefans-incomparable-mother-dies-88%2Fstory%3Fid%3D48040401.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-estefan-fajardo-rc-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Gloria Estefan's mother, Gloria Fajardo, has died at 88 years old.\nOn Facebook Tuesday evening, the singer wrote, \"Tonight at 8:19 pm we lost my dearest mother.\"\nShe added that when her \"incomparable\" mom passed, she was \"filled with peace and surrounded by her daughters, grandchildren, sons-in-law, niece, the three girls who cared for her with so much affection, family and her closest friends.\"\nEstefan said she believes it was a sign that her mother passed at 8:19 p.m. because her grandmother Consuelo died 32 years ago on August 19 -- 8/19.\n\"[She] wanted to make us clear that she was going very well accompanied by my grandmother and our dear father, José Manuel,\" Estefan wrote. \"I will miss her every moment of every day and thank her for having been an amazing mother, woman and model to follow for so many people.\"\nGloria then thanked her fans for the love, prayers and messages they sent during her mother's decline.\n\"I want you to know that I let you know in every moment, of all the love and light you were sending and she appreciated and absorbed every one of those beautiful feelings,\" she added. \"Thank you for being in your hearts and tenderly holding hands.\"\nLast week, the singer canceled her July 15 concert to care for her mother.",
    "source_domain": "abcnews.go.com",
    "title": "Gloria Estefan's 'incomparable' mother dies at 88",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/gloria-estefans-incomparable-mother-dies-88/story?id=48040401"
}