{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 02:53:05+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "The memo listed several officials involved in applying for the warrant, including Deputy Attorney General Rod Rosenstein.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fclassified-gop-memo-focuses-warrant-monitor-carter-page-52809072.json",
    "image_url": "http://a.abcnews.com/images/Politics/180202_wn_karl3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Classified GOP memo focuses on warrant to monitor Carter Page communications\nvery busy Friday night, and we begin with the firestorm over that classified memo written by congressional Republicans. President trump declassifying it, describing, quote, grave concerns from the FBI, and from Christopher WRAY. The president tonight calling the alleged aver described in the memo, quote, a disgrace. Democrats say it is misleading and an attempt to undermine Robert Mueller who wants to interview the president. What is in the memo? Here's ABC's chief white house correspondent, Jonathan Karl, tonight. Reporter: Before the public even saw the newly declassified Republican memo, president trump was portraying it as a bombshell. I think it's terrible, if you want to know the truth. I think it's a disgrace, what's going on in this country I think it's a disgrace. A lot of people should be ashamed of themselves and much worse than that. Reporter: The controversial memo is written by the Republican staff of the house intelligence committee, chaired by Devin nunes, a close trump ally. It focuses entirely on one narrow aspect of the Russia investigation, a warrant to monitor the communications of Carter page, a former trump campaign foreign policy advisor and the Obama justice department went to a secret intelligence court to apply for the warrant in October, 2016. According to the Republican memo, an essential part of the application was the now infamous dossier on Russian election meddling and team trump written by former British spy Christopher Steele. The memo claims the judge who approved the warrant was never told the dossier was paid for by the democratic national committee and the Clinton campaign, and that the judge never knew that Steele allegedly told a senior justice official that he was \"Desperate that Donald Trump not get elected and was passionate about him not being president.\" The memo says that former deputy FBI director Andrew Mccabe told the house intelligence committee that, \"No surveillance warrant would have been sought without the Steele dossier information.\" But Democrats on the committee say that's misleading. As they have cherry picked information from the FISA application they've also cherry picked information from Mr. Mccabe. Reporter: Democrat Adam Schiff says Mccabe portrayed the dossier as one of many key pieces of information used in getting the warrant to monitor Carter page. As ABC news has previously reported, page was on the FBI's radar since 2013 because of his suspicious contacts with Russian operatives. In 2016, when the trump campaign was pressed to list their foreign policy advisers, page's name was on their short list. But last year page's Russia ties came under growing scrutiny including questions about whether R met with the Russian ambassador at the Republican convention. Did you meet sergey kislyak in Cleveland? Did you talk to him? I'm not going to deny I talked to him. Reporter: Page has denied any wrongdoing, but the president has distanced himself. I don't think I've ever spoken to him or met him. And he said he was a very low level member of, I think, a committee for a short period of time. I don't think I ever met him. It's possible I walked into a room and he was sitting there, but I don't think I ever met him. Reporter: The Republican memo released today lists several current and former law enforcement officials involved in applying for the surveillance warrant including former FBI director James Comey and deputy attorney general rod Rosenstein, the official overseeing Robert Mueller's special counsel investigation into Russian meddling. Several people close to the president tell ABC news, trump has been deeply frustrated with Rosenstein. Does it make you more likely to fire Rosenstein? You figure that one out. Let's go live to Jon Karl at the white house tonight. We just heard president trump, but tonight the white house insists there are no discussions of firing rod Rosenstein? Reporter: That is the official word here at the white house tonight, but the tension is real. Rosenstein joined with Christopher WRAY, the FBI director, in pleading that the white house not release this Republican memo, and the president lashed out at the leadership of the justice department and the FBI, tweeting that, quote, they have politicized the sacred investigative process in favor of Democrats. Keep in find those are people who are lifelong Republicans appointed by president trump. Jon Karl leading us off tonight.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Classified GOP memo focuses on warrant to monitor Carter Page communications",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/classified-gop-memo-focuses-warrant-monitor-carter-page-52809072"
}