{
    "authors": [
        "Abc News",
        "Linsey Davis",
        "Lesley Messer",
        "More Linsey",
        "More Lesley"
    ],
    "date_download": "2017-06-14 22:26:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "What's next for Bill Cosby?",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fbill-cosby-comedian%2Fstory%3Fid%3D48009634.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/ap-bill-cosby-jc-170613_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Over the past three days, the jury in Bill Cosby's criminal trial has deliberated whether the comedian is guilty of drugging and sexually assaulting Andrea Constand in 2004.\nIf they find Cosby guilty, Judge Steven T. O’Neill, who has presided over the case, would be expected to hand down a sentence within 60 to 90 days -- though the defense is likely to appeal any conviction.\nCosby has been charged with three counts of aggravated indecent assault, each of which carries a maximum penalty of 10 years in prison and a $25,000 fine, but no minimum. Cosby has pleaded not guilty in the Constand case, and has repeatedly denied allegations of wrongdoing made against him, as well as coercing any of his accusers.\nABC News Senior Legal Correspondent and analyst Sunny Hostin has said it is likely that Cosby, 79, would serve the sentences concurrently if he's convicted.\n\"A 30-year consecutive sentence would be a life sentence,\" she said. \"I also think given his age, the judge may not sentence him to the max with one caveat: if the judge takes into account all of the other allegations, which will be included in the pre-sentencing report, the sentence may be more severe.\"\nThere would be other consequences to a conviction, as well. Cosby would be required to register as a sex offender, Montgomery County District Attorney spokeswoman Kate Delano told ABC News, and would undergo sexual violent predator analysis to determine how long he would need to remain registered, as well as a more typical pre-sentencing investigation.\nDelano also said that if Cosby were to be convicted of any of the three felony counts, Montgomery County District Attorney and lead prosecutor Kevin Steele could move immediately to revoke his bail and incarcerate him. O'Neill would rule on the next steps.\nHowever, if the jury finds that Cosby is not guilty, he could leave the courtroom a free man for the rest of his life, as there are no other known allegations against him in which the statute of limitations hasn't expired. The jury could also split the verdict, handing up - in the messiest imaginable scenario - one guilty, one not guilty and one hung jury. Any deadlocked verdict count is dropped, as it would be with a not guilty verdict, but the D.A. could refile the same count for future prosecution.\nWith a jury deadlocked on all three counts, Cosby could also walk out of court. The district attorney could retry the case, but prosecutors would not likely move for an immediate retrial on the spot, according to Delano. Between the former Montgomery County district attorney's 2005 decision not to charge Cosby and other factors, the grounds for appeal could increase with a hung jury.\n\"The initial D.A. decided the case could not be proven beyond a reasonable doubt and declined to bring charges [and] this case was very much a campaign promise by the current D.A.,\" Hostin added.\nCosby has pleaded not guilty to the felony charge, and has claimed that in 2004, he and Constand had a consensual sexual encounter. He also said in a deposition from a decade-old civil suit that he gave her Benadryl to help her relax and \"be able to go to sleep after our necking session.\"\nConstand testified last week that the drug Cosby gave her rendered her unable to stop his advances, though she said she tried.\n\"In my head I was trying to get my hands to move or my legs to move, but I was frozen and those [mental] messages didn’t get there and I was very limp, so I wasn’t able to fight him anyway,\" she said. \"I wanted it to stop.\"\nThe prosecution rested its case on Friday, four days after the trial began. The defense called one witness to the stand this past Monday morning and rested its case after less than 10 minutes.\nThe jury has been deliberating since Monday evening, and since they began, they have revisited quotes from Cosby's deposition about his encounter with Constand. They have also asked for further definition of the language in count three, specifically the phrase \"without her knowledge.\" Count three pertains to whether Cosby administered \"drugs, intoxicants or other means for the purpose of preventing resistance\" without Constand's knowledge.\nLate Tuesday afternoon, they requested a readback of Constand's initial report to police in Canada in January 2005. Late Wednesday afternoon, they asked to have Constand's testimony from the witness stand about the night of the alleged attack read back to them by the court reporter, and then returned to deliberations.",
    "source_domain": "abcnews.go.com",
    "title": "Bill Cosby: What's next for the comedian",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/bill-cosby-comedian/story?id=48009634"
}