{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 18:16:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Notre Dame, Wisconsin to meet at Lambeau, Soldier fields",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fnotre-dame-wisconsin-meet-lambeau-soldier-fields-49210893.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/notre-dame-wisconsin-meet-lambeau-soldier-fields-49210893",
    "language": "en",
    "localpath": null,
    "maintext": "Notre Dame and Wisconsin will play at Lambeau Field in Green Bay, Wisconsin, in 2020 and Soldier Field in Chicago in 2021.\nThe schools made a joint announcement on Monday in Chicago. The two-game series marks the first meeting between the Fighting Irish and Badgers since 1964.\nNotre Dame athletic director Jack Swarbrick says the games will be part of school's Shamrock Series in which the Irish regularly play at a neutral site and break out alternative uniforms.\n\"These things are always a Rubik's Cube when you're trying to figure out how to put them together,\" Swarbrick said. \"One piece of it moves, then you've got to go back and try and refigure it. We had to stick with it. In so many regards, it came together exactly as we wanted it.\"\nThe first game will be played at the home of the Green Bay Packers, on Oct. 3, 2020. Lambeau Field is named after Curly Lambeau, the former Notre Dame player who went on to found, coach and play for the Green Bay Packers.\nThe site will shift to the home of the Chicago Bears on Sept. 25, 2021. The Lambeau Field game will count as a Wisconsin home game and the Soldier Field game will be part of Notre Dame's NBC television package.\n\"We at Wisconsin are honored to have the privilege to play a program with the rich tradition of Notre Dame. It's been a while in the works. It's taken a while to put this together, but I'm very excited about it,\" said Wisconsin athletic director Barry Alvarez, who was an assistant coach at Notre Dame under Lou Holtz in the late 1980s.\nThe schools are located a four-hour drive apart, but haven't played since Notre Dame beat Wisconsin 31-7 in what was the first game as Fighting Irish head coach for recently deceased Ara Parseghian.\n\"There's so many connections here. Especially meaningful for me in this month to have this announcement come shortly after the passing of Ara Parseghian,\" Swarbrick said.\nThe teams have met 14 times overall with the Irish leading 8-6.\nThe Badgers most recently played at Lambeau Field to start the 2016 season and beat LSU 16-14. It was just the second college football game ever played at Lambeau and the first matching Division I teams.\nWisconsin last played at Solider in Field in 2011 against Northern Illinois and won 49-7. Notre Dame has played 12 games at Soldier Field, most recently in 2012 when the Irish routed Miami 41-3 in a Shamrock Series matchup. The Irish are 10-0-2 at Soldier Field.\n———\nMore college football coverage: http://collegefootball.ap.org/",
    "source_domain": "abcnews.go.com",
    "title": "Notre Dame, Wisconsin to meet at Lambeau, Soldier fields",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/notre-dame-wisconsin-meet-lambeau-soldier-fields-49210893"
}