{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 11:34:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Softbank adds Fortress Investment to growing empire",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fsoftbank-adds-fortress-investment-growing-tech-empire-45503725.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/softbank-adds-fortress-investment-growing-tech-empire-45503725",
    "language": "en",
    "localpath": null,
    "maintext": "The $3.3 billion acquisition by SoftBank Group Corp., the Japanese telecommunications, internet and solar energy giant, of Fortress Investment Group marks tycoon Masayoshi Son's latest step in building an investment empire.\nSon said the deal, announced by both sides Wednesday, will immediately contribute to his strategy for growth and complement his Softbank Vision Fund plan for investing in leading technologies including artificial intelligence and the \"internet of Things,\" which links devices through the Internet.\n\"Fortress' excellent track record speaks for itself, and we look forward to benefiting from its leadership, broad-based expertise and world-class investment platform,\" Son said in a statement.\nTokyo-based Softbank has been aggressive in global acquisitions and has been seeking partners for its private fund for technology investments that it says may grow to $100 billion. Son appears determined to deliver on his promise to President Donald Trump to invest $50 billion in U.S. startups and create 50,000 jobs.\nIn buying New York-based Fortress, he is betting more on Fortress's wide ranging expertise and heft in global investment than on gaining any edge in the technology sector: the U.S. investment house has largely focused on finance and real estate, leisure industries, transport and other infrastructure.\nPrivate equity accounts for nearly two-thirds of the company's investments.\nSoftbank's shares jumped 1.6 percent Wednesday in Tokyo trading. Shares in Fortress were up 6.5 percent late Tuesday.\nSoftbank also owns the U.S. wireless company Sprint Corp. and Britain's ARM Holdings, which is known as an innovator in the \"internet of things,\" and in technology used in smartphones.\nFortress said its senior professionals will stay to keep up its fund performance.\nFortress co-chairmen Pete Briger and Wes Edens praised Son as \"visionary.\" They said the companies have much in common, and the deal will benefit shareholders.\n\"We join a company with tremendous scale and resources, and a culture completely aligned with our focus on performance, service and innovation,\" they said in a joint statement.\nSoftBank, the first carrier to offer the iPhone in Japan, also sells the Pepper human-shaped companion robot. The company, founded in 1981, has within its investment empire financial technology and ride-booking services.\nLast week, the company reported its October-December profit soared to about 40 times what it was a year ago.\n———\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\nHer work can be found at http://bigstory.ap.org/content/yuri-kageyama",
    "source_domain": "abcnews.go.com",
    "title": "Softbank adds Fortress Investment to growing empire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/softbank-adds-fortress-investment-growing-tech-empire-45503725"
}