{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:36:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Mandy Patinkin describes new Homeland role on Powerhouse Politics podcast.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fhomeland-star-mandy-patinkin-describes-terrifying-reality-powerhouse%2Fstory%3Fid%3D54695074.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_gostream_powerhousepolitics_patinkin_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Award-winning movie and television actor Mandy Patinkin portrays the national security adviser in the Showtime original series Homeland, and his character's had a bumpy past.\nOver the various seasons, he has been kidnapped by the Pakistanis, jailed by an American president, taken hostage by U.S. extremists, witnessed colleagues killed in terror attacks, and then was fired as CIA director.\nThis season he’s working under a president who is at war with the intelligence community, the Russians are manipulating the news, and some people think the commander in chief might be mentally unstable.\nWith a Mona Lisa-like smile, Patinkin reminds \"Powerhouse Politics\" podcast hosts Jon Karl and Rick Klein that truth can sometimes seem stranger than fiction. “Remember I’m in a fictional show. This is a real show you report on a daily basis.”\nPlay\nBut how do the Homeland storylines have such eerie parallels to the daily headlines? Patinkin described “spy camp,” where the show producers and actors meet in Washington, D.C., and immerse themselves in the intelligence field. One of the brains they pick is Ret. Gen. Michael Hayden, former CIA head and director of the National Security Agency.\n“We meet in a room in Georgetown for 10 to 12 hours a day two to three hours per person. The ‘who's who’ of the intelligence community comes through the door, and we ask them questions. But they're no different than the questions that everybody who wakes up in the world ask themselves every morning. What are you most concerned about? What do you think is their greatest concern?” Patinkin adds that he’s not just listening to the answers. He’s observing their body language. “I'm watching their behavior. I'm not that interested in the specifics that they're talking about, as much as their behavior.”\nPatinkin talked about a moment when an intelligence expert was describing how different it was to brief President Donald Trump on national security than his predecessors. And what scared this seasoned security pro? “He said I've spent my life in the Oval Office, every day for years and years, briefing the president. And I know the difference that takes place between a candidate and a president. And I was certain when I met with you those months ago, that change that this office makes on a human being would insert itself into this individual who had been elected. I was certain that it would have an effect on that man. And it hasn't.”\nThat confession rattled the Homeland star. “To admit that he hadn't seen that change in his nature. Terrifying. That's a powerful moment.”\nIn real life, Patinkin worries about a segment of society that is experiencing dramatic changes with a new administration – international refugees. He’s recently back from Uganda where he visited refugee camps with the International Rescue Committee. “And people say, ‘Why do you care about this?’ Why do I care about it? Because none of us would be standing here if our country hadn't welcome our ancestors. That's why we're here every one of us in this country. And to forget that is to forget why you're breathing.”\nAnd he points at the politicians to make changes. “We have to we have to change the diplomacy. Remember why we're here. And remember our moral ethical fabric and nature as human beings, and encourage our leaders to do something about that.”\nSo any chance for a happy ending in the final season of Homeland? Without any spoilers, he “begged” the writers for a hopeful note to end on. “Please give a poetic possibility. A moral to the end of our story, a moral that would guide us or lead us to something more hopeful and optimistic. That is what I've asked for, and this year I got my wish. You will see it in the final episode.” Stay tuned.",
    "source_domain": "abcnews.go.com",
    "title": "Homeland star Mandy Patinkin describes a 'terrifying' reality: Powerhouse Politics",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/homeland-star-mandy-patinkin-describes-terrifying-reality-powerhouse/story?id=54695074"
}