{
    "authors": [
        "Abc News",
        "Sabina Ghebremedhin",
        "More Joi-Marie",
        "More Sabina"
    ],
    "date_download": "2018-02-03 23:12:34+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Uma Thurman tell columnist that Harvey Weinstein 'attacked' her: 'He pushed me down'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fuma-thurman-tells-columnist-harvey-weinstein-attacked-kinds%2Fstory%3Fid%3D52816586.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/uma-thurman-gty-jt-180203_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Uma Thurman finally shared what she says happened between her and Harvey Weinstein, after writing \"stay tuned\" in an Instagram post about the #MeToo movement last November.\nInterested in Harvey Weinstein? Add Harvey Weinstein as an interest to stay up to date on the latest Harvey Weinstein news, video, and analysis from ABC News. Add Interest\nNew York Times columnist Maureen Dowd said in a lengthy opinion piece that Thurman, 47, told her that she knew Weinstein, 65, “pretty well before he attacked me.”\nThe Oscar-nominated actress had previously worked with Weinstein when she starred in the 1994 film \"Pulp Fiction,\" which was the first film financed by Weinstein's then-company, Miramax. Thurman told the Times that the two got to know each other after the film's success, according to Dowd's piece.\n\"He used to spend hours talking to me about material and complimenting my mind and validating me. It possibly made me overlook warning signs,\" Thurman told Dowd, according to the opinion piece.\nOwen Hoffmann/Patrick McMullan via Getty Image\nBut later, Dowd reports that Thurman said, after an uncomfortable incident in a Paris hotel room where she felt he tried to lure her into a steam room, she was attacked in the Savoy Hotel in London.\n\"It was such a bat to the head. He pushed me down. He tried to shove himself on me. He tried to expose himself. He did all kinds of unpleasant things,\" Thurman said, according to Dowd's report. \"But he didn’t actually put his back into it and force me. You’re like an animal wriggling away, like a lizard. I was doing anything I could to get the train back on the track. My track. Not his track.\"\nNoting that she was staying with her friend, Robert De Niro’s longtime makeup artist, Ilona Herman, Thurman claims that the next day a \"26-inch-wide vulgar bunch of roses\" arrived to Herman's home in Fulham, the op-ed columnist wrote.\nPressefoto Kindermann/ullstein bild via Getty Images\n\"They were yellow. And I opened the note like it was a soiled diaper and it just said, ‘You have great instincts,'\" Thurman claimed, according to Dowd.\nThurman also went on to tell Dowd that Weinstein threatened to derail her career in another hotel meeting, according to the opinion piece.\nThurman joins a chorus of women in Hollywood -- including Oscar winners Angelina Jolie, Gwyneth Paltrow and Mira Sorvino -- who've accused the disgraced producer of sexually assaulting or harassing them.\nIn a statement to ABC News in response to claims attributed to Thurman in Dowd's New York Times opinion piece, a rep for Weinstein said, \"We have pulled a number of images that demonstrate the strong relationship Mr. Weinstein and Ms. Thurman had had over the years and we wish the New York Times would have published them.\"\n\"Mr. Weinstein acknowledges making an awkward pass 25 years ago at Ms. Thurman in England after misreading her signals, after a flirtatious exchange in Paris, for which he immediately apologized and deeply regrets,\" the statement continued. \"However, her claims about being physically assaulted are untrue. And this is the first time we have heard those details.\n\"There was no physical contact during Mr. Weinstein’s awkward pass and Mr. Weinstein is saddened and puzzled as to 'why' Ms. Thurman, someone he considers a colleague and a friend, waited 25 years to make these allegations public, noting that he and Ms. Thurman have shared a very close and mutually beneficial working relationship where they have made several very successful film projects together.\n\"This is the first time we are hearing that she considered Mr. Weinstein an enemy and the pictures of their history tell a completely different story. There will be more are detailed response later from Mr. Weinstein’s attorney, Ben Brafman,\" the statement concluded.\nIn a statement to the New York Times, Weinstein denied ever trying to hurt Thurman's career, adding that he thought Thurman is “a brilliant actress.\"\nBefore Saturday's opinion piece, Thurman hinted about a sour relationship with Weinstein in an Instagram post, in which she wished her fans a happy Thanksgiving \"except you Harvey, and all your wicked conspirators.\"\nThe actress also told Access Hollywood, in an October interview about sexual harassment in Hollywood that she would talk about it soon, but was \"waiting to feel less angry.\"\nWeinstein's attorney, Ben Brafman, on Saturday afternoon issued a statement that echoes Weinstein's and said statements attributed to Thurman in the Times opinion piece would be examined to see whether legal action would be appropriate.\n\"Harvey is stunned and saddened by what he claims to be false accusations by Uma Thurman, someone he has worked closely with for more than two decades. Mr. Weinstein acknowledges making an awkward pass at Ms. Thurman 25 years ago, which he regrets and immediately apologized for,\" the lawyer's statement says. \"Why Ms. Thurman would wait 25 years to publicly discuss this incident and why according to Weinstein, she would embellish what really happened to include false accusations of attempted physical assault is a mystery to Weinstein and his attorneys. Ms. Thurman's statements to the Times are being carefully examined and investigated before deciding whether any legal action against her would be appropriate.\"",
    "source_domain": "abcnews.go.com",
    "title": "Uma Thurman tells columnist that Harvey Weinstein 'attacked' her: 'He did all kinds of unpleasant things'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/uma-thurman-tells-columnist-harvey-weinstein-attacked-kinds/story?id=52816586"
}