{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 05:00:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Summer of hype: Mayweather, McGregor know how to sell a show",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fsummer-hype-mayweather-mcgregor-sell-show-48048113.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_a4b509e61b374f44ba770f1611f6fde5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Nobody truly knows whether Floyd Mayweather's boxing match with Conor McGregor will turn out to be a unique spectacle or an overhyped debacle.\nThe only certainty is that the next 2? months of hype will be a masterpiece of fight promotion from two of the best ever to play that game.\nMayweather and McGregor revealed their plan Wednesday to fight Aug. 26 in Las Vegas . In an appropriate move for a fight that grew into reality after two years of verbal jousting and several months of social-media skewering, the two titans of their respective sports confirmed the news on their Instagram accounts.\nAnd in another preview of what everyone should expect during their summer of promotion, McGregor's post included his photo opposite Floyd Mayweather Sr., the boxer's 64-year-old father, with a straight-faced caption: \"THE FIGHT IS ON.\"\nFew athletes in recent sports history have sold their sports better than the imperious Mayweather and the loquacious McGregor.\nBoth fighters have spent years crafting outlandish public personae characterized by a few common themes: cartoonish arrogance, a fetishistic obsession with money and an eagerness to make reckless pronouncements about their opponents, their opponents' fans — and, increasingly, each other.\nThey'll use those gifts to ratchet up the hype during a hot summer culminating in their desert showdown. Along the way, they might even sell the skeptical portion of the public on a fight that — as even its promoters acknowledge — could turn out to be a colossal mismatch.\nMayweather apparently learned about McGregor's verbal skills even before his fighting acumen, according to Mayweather adviser Leonard Ellerbe. McGregor rapidly rose from obscurity to multi-division UFC dominance only because he coupled his mixed martial arts skills with attention-grabbing soundbites.\n\"This kid, he's been making a lot of noise,\" Ellerbe said Wednesday, recalling the reason that he first introduced Mayweather to video of McGregor's punching power.\nMayweather and McGregor have traded innumerable shots online and through the media while this fight evolved from a preposterous barroom fantasy discussion into a real thing.\nMcGregor even talked about it back in 2015, when he told Esquire that he would \"kill (Mayweather) in less than 30 seconds\" and affirmed his interest in the bout while appearing on Conan O'Brien's talk show.\nMcGregor ignited the hype in May 2016 by posting a mock-up of a fight poster on Twitter. Mayweather responded three weeks later with his own less polished version of a poster , and the unbeaten champion claimed he had started the rumors of a McGregor bout.\nWith little to lose and immeasurable wealth and fame to gain, McGregor used his public platform in promoting his UFC bouts last year to take repeated jabs at the 40-year-old Mayweather's age, declining skills and unwillingness to end his retirement.\nMcGregor turns 29 next month, making him decidedly middle-aged in pro sports, yet he takes humorous delight in painting himself as a raw youngster going against a grizzled old-timer .\nAs recently as December, Ellerbe said a Mayweather-McGregor fight would never happen because the UFC's top brass wouldn't allow it. UFC President Dana White also acknowledges he was once lukewarm about the possibility, believing Mayweather wouldn't risk his legacy.\nAnd then in January, McGregor posted a cartoon on Instagram in which he stood over a flattened Mayweather, holding both fighters' championship belts aloft. As a bonus, McGregor's caption read: \"Call me CJ Watson!\" in a biting reference to the former NBA guard who had a relationship with Josie Harris, the mother of Mayweather's children.\nMayweather replied eight days later with an Instagram post of an infographic comparing the fighters' net worth. In the caption, Mayweather instructed McGregor: \"Before you ask for $25 million, be worth more than $25 million.\"\nVegas sports books introduced a betting line on the bout in February.\nMayweather had clearly warmed to the idea of fighting McGregor by March, when he told fans in Britain that he would come out of his latest retirement to take on the challenge. That same month, McGregor showed up in a fur coat at fellow Irishman Michael Conlan's boxing debut at Madison Square Garden and harangued the assembled media with a rant punctuated by his latest catchphrase: \"I am boxing!\"\nAfter posting a video on April 20 in which he shadowboxed and insulted Mayweather's courage, McGregor took a brief break from his social media pursuit of Mayweather after his first son was born in May .\nMayweather went back to his usual retirement m?tier: Posting photos of himself surrounded by the trappings of outlandish wealth .\nAnd then the megafight was on , after remarkably simple negotiations among the UFC, Mayweather Promotions and Showtime.\nA national press tour is expected to kick off soon. Mayweather and McGregor will spend the summer showing off their promotional gifts for a fight that started as a social media argument — and became the main event of the year.",
    "source_domain": "abcnews.go.com",
    "title": "Summer of hype: Mayweather, McGregor know how to sell a show",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/summer-hype-mayweather-mcgregor-sell-show-48048113"
}