{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 06:23:44+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "High-tech US plants offer jobs even as the laid-off struggle",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fhigh-tech-us-plants-offer-jobs-laid-off-49220544.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_95f4ef7fa4c248d2b83d809c55cb4e29_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Herbie Mays is 3M proud, and it shows — in the 3M shirt he wears; in the 3M ring he earned after three decades at the company's plant in suburban Cincinnati; in the way he shows off a card from a 3M supervisor, praising Mays as \"a GREAT employee.\"\nBut it's all nostalgia.?\nMays' last day at 3M was in March. Bent on cutting costs and refocusing its portfolio, the company decided to close the plant that made bandages, knee braces and other health care supplies and move work to its plant in Mexico.\nAt 62, Mays is unemployed and wants to work, though on the face of it he has plenty of opportunities. Barely 10 miles from his ranch-style brick home in this blue-collar city, GE Aviation has been expanding — and hiring.\nIn the state-of-the-art laboratory in a World War II-era building the size of 27 football fields, workers use breakthrough technology to build jet engines that run on less fuel at higher temperatures. Bright flashes flare out as GE workers run tests with a robotic arm that can withstand 2,000 degrees (1,090 Celsius).\nThe open jobs there are among 30,000 manufacturing positions available across Ohio. But Mays, like many of Ohio's unemployed, doesn't have the needed skills.\n\"If you don't keep up with the times,\" he said, \"you're out of luck.\"\nThis is the paradox of American manufacturing jobs in 2017. Donald Trump won the presidency in great measure because he pledged to stop American jobs and manufacturing from going overseas. His message helped him capture Ohio and other Rust Belt states with the support of Mays and other blue-collar voters.\nIt's true that many jobs have gone overseas, to places where workers are willing to toil for less money. Yet at the same time, American manufacturers have actually added nearly a million jobs in the past seven years. And federal statistics show nearly 390,000 such jobs open.\nThe problem? Many of these are not the same jobs that for decades sustained the working class. More and more factory jobs now demand education, technical know-how or specialized skills. And many of the workers set adrift from low-tech factories lack such qualifications. Meanwhile, the dearth of qualified applicants has forced some manufacturers to pay more to fill those jobs.\nTraining opportunities are limited, particularly for older workers.\n\"The United States trails virtually all its industrial competitors in public and private spending on training,\" said Scott Paul, president of the Alliance of American Manufacturing, adding that corporate spending on training has declined over the past two decades.\nAnd though industry experts advocate more funding for retraining, the track record for such programs has been mixed. Not enough participate. Returning to school for up to two years can mean accepting much-reduced income during that time, sometimes an impossible step for older workers with families or nearing retirement.\nStill, there are efforts underway to bridge the \"skills gap,\" and lessons to be learned from how it has been done successfully overseas. Many political leaders and CEOs are promoting apprenticeships and other training programs as a way to help address the problem.\nJaylen Britton, 18, studied robotics through Butler Tech's program at Colerain High School near Cincinnati, and is not planning right away to attend a four-year college. He took an apprenticeship with Charlotte, North Carolina-based Duke Energy and will earn a two-year degree while working for the power company.\nHe expects his apprenticeship to prepare him to benefit from automation rather than fall victim to it.\n\"If you evolve with the robots that are evolving, you'll grow with whatever is growing,\" Britton said.\n———\nAfter years of job losses, filling 2 million new American manufacturing jobs in the next decade — the number forecast in a report by Deloitte Consulting and the American Manufacturing Institute — might seem easy. It's not.\nThat's because factory automation has changed what companies need from their employees.\nAssembly-line workers now need to run, operate and troubleshoot computer-directed machinery. Manufacturers maintain complex websites with thousands of product and pricing options to be updated and maintained. And where forklifts are still driven by people, drivers often use software programs that track inventory.\n\"There are more computers on the manufacturing floor than machine tools and other types of equipment,\" said Judy Marks, CEO of Siemens USA.\nSiemens, which makes turbines, medical equipment and HVAC systems, employs 7,500 software developers — nearly 15 percent of its U.S. workforce.\nLast year, software developer was the second-most-common job advertised by manufacturing companies, behind only sales, according to data provided by Burning Glass Technologies, a company that analyzes labor market data.\nOnce-simple household appliances are now loaded with sensors and internet-enabled semiconductors. The shift has been particularly dramatic among automakers, with their expanded use of complicated onboard computers. Five years ago, they posted just as many jobs for mechanical engineers as for software developers. By last year, a sharp change had occurred. There were twice as many openings for software jobs as for mechanical engineers, according to Burning Glass.\nVicki Holt is CEO of Proto Labs, which employs roughly 1,000 workers, including 120 software developers, to make components for the auto, aerospace and medical device industries. Holt said \"advanced manufacturing\" — employing \"hand-held computers, scanners, using Google Glass\" — is a trend that will accelerate with growing use of robotics.\nBut when it comes to robotics, American industry is only beginning to catch up with much of the rest of the world. In Germany and Japan, higher labor costs and aging populations have spurred faster adoption of industrial automation.\nWorkers in many European and Asian countries are more likely to already be working with robots than U.S. workers, studies show. China is now the fastest-growing robotics buyer.\n\"The Chinese and Europeans and South Koreans are aggressively embracing robotics,\" said Howie Choset, a professor of robotics at Carnegie Mellon University in Pittsburgh. \"We definitely are at a point where we have to keep up or get left behind.\"\nChoset is chief technology officer for the Advanced Robotics Manufacturing Institute, a new public-private partnership to help U.S. companies adopt robot technologies, create and retain jobs in the sector, and help American workers compete with low-wage workers overseas.\nIn other countries that have forged ahead, robotics and advanced automation have created solid jobs while increasing efficiencies for manufacturers.\nThe Japanese have long embraced automation, and robots are increasingly becoming a part of everyday life. Sales of \"companion robots\" for households are surging. A tradition of \"lifetime employment\" by major Japanese companies means they try to retrain, not replace, workers.\nOn the Danish coast, a few hours from Copenhagen, Novozymes employs thousands to make enzymes for detergents, baking and other uses.\nJesper Haugaard, the vice president of Novozymes' European unit, said automation has allowed the company to keep production — and jobs — close to the market, rather than outsourcing to China, where labor costs might be cheaper but transport and duties would outweigh the benefits.\nHenrik Olsen, 61, remembers his early years at Novozymes doing manual lifting all day among workers who were \"only arms and legs that followed the recipe.\" There were fears of job loss when automation came, but today, he's an operator seated behind a row of computers, with \"a better day at work and much more interesting job.\"\nDan Piil Petersen is another operator in the control room, where abbreviations for tasks adorn two whiteboards posted above dozens of monitors with graphic representations of the enzyme-making process. The six people in the air-conditioned room wore white T-shirts with the company logo and white pants.\n\"No stains,\" Petersen said, smiling as he moved his hands down his spotless uniform.\n———\nIn the United States, Trump continues to make promises about adding manufacturing jobs. In blue-collar Youngstown, Ohio, he talked about passing by big factories whose jobs \"have left Ohio\" on his way to a July 25 rally, then told people not to sell their homes because the jobs are \"coming back. They're all coming back.\"\nBut U.S. Sen. Rob Portman, an Ohio Republican and a former U.S. trade representative, insisted in an interview: \"We're not going to see the kind of manufacturing renaissance that we all want in this country unless we focus on skills training.\"\nOtherwise, Portman warned, there could be another wave of jobs going offshore.\n\"Companies will vote with their feet,\" he said.\nLabor Secretary Alexander Acosta, in a visit to a Detroit factory in June, acknowledged the need to address the \"skills gap\" by developing advanced computing skills. And when Trump visited Pewaukee, Wisconsin, in June with his secretaries of education and labor and daughter Ivanka, he touted the value of training while doing.\n\"Apprenticeships teach striving Americans the skills they need to operate incredible machines,\" Trump said. \"This is not the old days. This is new and computerized and complicated.\"\nOf the 146 million jobs in the United States, only about 0.35 percent — or slightly more than a half-million — were filled by active apprentices in 2016. Filling millions of open jobs through apprenticeships would require a substantial increase in government resources. So far, the Trump administration has called for more funding but hasn't made any progress securing the funding from Congress.\nApprenticeships are much more common at some European companies, notably German firms. At Germany-based Stihl Inc.'s plant in Virginia Beach, Virginia, for example, A.J. Scherman is learning to be a \"mechatronics technician.\" Mechatronics combines electrical and mechanical engineering, as well as computer skills.\nStihl makes chain saws, leaf blowers and weed trimmers at the factory. Once he has completed his final year in Stihl's four-year apprenticeship program, Scherman will read diagnostic software on computer screens attached to each robot to repair and upgrade them. If necessary, he'll hook up a laptop to program changes.\nScherman, 37 and with only a high-school degree, wanted to earn more money when his daughter was born, so he took a chance with a mid-life career change. Previously, he worked 80-hour weeks putting together special events, including Stihl's company picnic.\nScherman is also earning a college degree as part of the apprenticeship. Thanks to financial aid from Stihl, he'll finish with zero debt.\nThe prospect of increasing automation doesn't faze him. After all, he'll be a robot repairman.\n\"We're safe, because we're the guys who fix the robots when they malfunction,\" Scherman said. \"We're going to need people to fix the more advanced systems.\"\nThere are assembly lines at the Stihl plant, but human workers are interspersed with computers and robotics. Two robot arms in one corner of the plant tie cords to the black pull handles used to start the company's outdoor power tools, a mundane job formerly done by people.\nSelf-driving forklifts with flashing lights and constant beeping sounds, akin to R2-D2 from \"Star Wars,\" navigate around corners and through doors. They are programmed to slow down when people are nearby.\nSkip Johnson, Stihl's apprenticeship coordinator, said the company has succeeded in attracting young people. The key is getting bright students into the plant, where they see that the grimy, dusty factories they learned about in books and movies are giving way to clean operations using futuristic technology.\n\"When they actually come here and they see the robots and how they interact and the programming involved, it's almost like a laser light show,\" said Johnson, 56. \"They just come in here and they're wide-eyed.\"\nThe company says it has never laid off a worker because of automation.\n———\nThere are American success stories in automation. Lou Morales, who trains young apprentices at the Festo Corp. plant in suburban Cincinnati, understands the negative images associated with manufacturing that cause many young people — often steered by their parents — to shun the sector as a career. Years ago, he showed up at his steel mill at Glen Cove, New York, to find he no longer had a job. It had shut down.\n\"I've never seen so many padlocks in my life,\" recalled Morales, 60.\nBut now he assures young people that their \"future is endless\" in manufacturing because new kinds of jobs are being created and the skills they are learning are in high demand.\nU.S. manufacturing workers, excluding managers, make an average of $44,000 a year, according to government data. That's just 2.8 percent higher, adjusted for inflation, than a decade ago after years of shifting of jobs overseas or to nonunion states. And it compares with a much higher 8 percent gain for the labor force as a whole over the past decade.\nBut a typical mechatronics engineer with a four-year degree can earn $97,000 a year; a typical software developer makes just over $100,000.\nFesto Didactic, the education arm of Germany-based Festo, last year launched two-year mechatronics apprenticeship programs in Ohio with Sinclair Community College, and is already expanding its U.S. apprenticeship offerings.\nAt Festo's plant in Mason, a northeast Cincinnati suburb, the floors are clean, the aisles uncluttered. The plant remains mostly quiet as workers monitor a sophisticated robotic distribution system that self-adjusts its work flow to prevent backups.\n\"This kind of factory has nothing to do with the factory we knew in the 1960s or 1980 or even 2000,\" said Yannick Schilly, who heads global supply for Festo's North American business.\nAt GE Aviation, internships and co-ops with colleges attract younger prospective employees, while veteran workers are retrained.\nWith a machining background, Terry Cox, 54, works in testing of ceramic matrix composites, which make engines more durable, heat-resistant and efficient.\n\"It's the design of the future,\" Cox said. \"There is a lot of opportunity here.\"\nBut there's not much demand locally these days for the kind of repetitive tasks, such as sewing-type work, that Herbie Mays has done. He picked through personal papers on his dining room table one recent morning, grumbling about jobs going to Mexico.\n\"I guess those people overseas who make $12 a day, you can't compete against them,\" he said. But he acknowledged there are \"plenty of jobs out here. ... What you have to do is get training or education.\"\nHe'd like to do that, but he also needs work to supplement his benefits.\nHe sighed.\n\"I've been fighting to figure out the best thing to do ... and haven't came up with no answers.\"\n———\nRugaber reported from Virginia Beach and Washington, D.C. Contributing to this report were Associated Press business writer Yuri Kageyama in Tokyo, AP writer Jan M. Olsen in Kalundborg, Denmark; AP videojournalist Mike Householder in Detroit, and AP photographer John Minchillo in Cincinnati. Follow Dan Sewell at http://twitter.com/dansewell\n?\nThis is part of the first installment of Future of Work, an Associated Press series that will explore how workplaces across the U.S. and the world are being transformed by technology and global pressures. As more employers move, shrink or revamp their work sites, many employees are struggling to adapt. At the same time, workers with in-demand skills or knowledge are benefiting. Advanced training, education or know-how is becoming a required ticket to the 21st-century workplace.",
    "source_domain": "abcnews.go.com",
    "title": "High-tech US plants offer jobs even as the laid-off struggle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/high-tech-us-plants-offer-jobs-laid-off-49220544"
}