{
    "authors": [
        "Abc News",
        "More Blair"
    ],
    "date_download": "2017-08-14 18:15:51+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Meet the sisters who love strapping on their in-line skates.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fline-skating-nuns-cruise-corpus-christi-texas%2Fstory%3Fid%3D49206320.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/ice-nuns-3-abc-er-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In-line skating was a \"habit\" a couple of nuns thought they might have to give up when they took their vow of obedience, chastity and poverty.\n\"When I entered, I left my Rollerblades at home, thinking, 'I'm not going to use them,'\" Sister Caritas Sparke told ABC affiliate KIII.\nBut Sister Caritas was mistaken.\nKIII\nThe \"Solt Sisters,\" named for their church's acronym -- the Society of Our Lady of the Most Holy Trinity -- cruise around the Bayfront area of Corpus Christi, Texas, and certainly attract a lot of attention from visitors and residents alike.\n\"Most often, you get a shocked look,\" Sister Caritas told KIII.\nWeekly, these \"holy rollers\" wear their full habit, strap on their in-line skates, coast down the coast and pose for selfies when asked.\nKIII\nEven professional skaters have taken notice.\n\"We did meet a group of roller derby women ... and it was actually really cool,\" Sister Mary Elezibaeth Albers told KIII. \"They invited us to their roller derby match.\"\nBoth Sister Mary Elezibaeth and Sister Caritas hope them skating around shows a different side to the convent than most people are used to.\n\"I think they think we're probably pretty cool,\" Sister Caritas said, laughing to KIII.",
    "source_domain": "abcnews.go.com",
    "title": "In-line skating nuns cruise around Corpus Christi, Texas",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/line-skating-nuns-cruise-corpus-christi-texas/story?id=49206320"
}