{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 07:22:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Indonesian capital votes in test for moderate values",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Findonesian-capital-votes-test-moderate-values-45502622.json",
    "image_url": "http://abcnews.go.com/International/wireStory/indonesian-capital-votes-test-moderate-values-45502622",
    "language": "en",
    "localpath": null,
    "maintext": "After months of acrimonious campaigning, the capital of predominantly Muslim Indonesia on Wednesday faced a stark choice: elect an outspoken minority Christian who has made progress in cleaning up the chaotic city or heed the urgings of influential conservative clerics to vote in a Muslim.\nThe more than 13,000 polling booths closed at 1 p.m. and quick-count results based on a sample of the vote are expected in several hours. The election is one of dozens taking place across Indonesia. More than 7 million were eligible to vote in Jakarta, the capital.\nIncumbent Gov. Basuki \"Ahok\" Tjahaja Purnama, an ethnic Chinese Christian on trial for alleged blasphemy, is vying against Agus Harimurti Yudhoyono, who is the son of a former president, and Anies Rasyid Baswedan, a moderate now courting the votes of conservative and hard-line Muslims.\nReligion and race, rather than the slew of problems that face a car-clogged and sinking Jakarta, dominated the campaign and transformed the election into a high-stakes tussle between conservatives, who want Islam to be ascendant in politics and society, and moderates. Ahok's chances appeared dashed after blasphemy accusations led to criminal charges and trial but he has recently rebounded in opinion polls. If convicted, he faces up to five years in prison.\nHadiyul Umam, a civil servant, said voting for Ahok would go against everything he believes in.\n\"As a Muslim, I believe that non-Muslims are not allowed to lead Muslims in this country, and personally, I do not like the way Ahok leads, which is not pro-poor people and his words were disrespectful and rude,\" he said.\nAhok's blasphemy trial and the ease with which hard-liners attracted several hundred thousand to protest against him in Jakarta have undermined Indonesia's reputation for practicing a moderate form of Islam and shaken the centrist government of President Joko \"Jokowi\" Widodo.\nCalls for Ahok to be killed and anti-Chinese sentiment were disturbing elements of the protests, one of which turned violent, with dozens injured and one person dying from the effects of tear gas.\nDefeat for Ahok would also be a defeat for Indonesia's moderate political and religious leaders and further embolden hard-liners, who say a non-Muslim should not lead Muslims. The governorship is also seen as a launching pad into national politics and possibly the presidency.\nThere will be a runoff election in April if none of the candidates gets the 50 percent plus one vote required for an outright win. One scenario is that Ahok proceeds to the runoff but is defeated by anti-Ahok voters uniting behind the remaining Muslim candidate.\nJokowi voted in a neighborhood of central Jakarta and called for national unity.\n\"Differences of political choice should not to divide us,\" he said. \"After this election, we want everything to be back as brothers, we all need to maintain our unity and integrity.\"\nAhok had been popular because of his drive to eliminate corruption from the Jakarta administration and his efforts to make the city more livable.\nBut brutal demolitions of some of the slum neighborhoods that are home to millions and ill-considered outspokenness proved to be his Achilles' heel. Opponents seized their moment last year when a video surfaced of Ahok telling voters they were being deceived if they believed a specific verse in the Quran prohibited Muslims from electing a non-Muslim as leader.\n\"I voted for Ahok because he is already showing results of real work and honesty,\" said Sriyana Dewi, as she left a polling booth with her 7-old-month son in a sling.\n———\nAssociated Press writer Ali Kotarumalos contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Indonesian capital votes in test for moderate values",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/indonesian-capital-votes-test-moderate-values-45502622"
}