{
    "authors": [
        "Abc News",
        "John Verhovek",
        "More Emily",
        "More John"
    ],
    "date_download": "2018-04-25 04:31:49+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:00:00",
    "description": "Republican Debbie Lesko won Arizona's special election on Tuesday in a contest both parties were watching as a barometer of political strength ahead of the November.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Frepublican-lesko-projected-winner-arizona-special-election-gop%2Fstory%3Fid%3D54707313.json",
    "image_url": "https://s.abcnews.com/images/Politics/lesko-ap-er-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Republican Debbie Lesko is the projected winner of Arizona's special election on Tuesday in a contest both parties were watching as a barometer of political strength ahead of the November midterm election.\nDemocrat Hiral Tiperneni performed strongly, which bolsters the party's argument that enthusiasm remains high for their candidates and helps reinforce their argument that a so-called \"blue wave\" is coming this fall.\nShortly after 11 p.m. ET, Lesko had 52.7 percent of the vote, compared to Tiperneni's 46.9 percent, with 74 percent of precincts reporting. The Associated Press called the race.\nTiperneni said she would not concede on Tuesday night.\nAnita Snow/AP\nBut both Democrats and Republicans will dissect the details of the contest — specifically the final margin between the two candidates.\nArizona has a competitive Senate race this fall and how independents broke in Tuesday's contest along with how many Republicans crossed over to vote for Tiperneni will be poured over for any indication of how voters may go in November.\nThe early returns also indicated the Democrats' record of overperformance in special elections continues although the large number of white, older, Republican-leaning voters in the district, which is a popular one for retirees, made it tough for Tiperneni to prevail.\nEven with the numbers against her, Republicans spent heavy and hard in this contest to secure the win.\nUnlike the March special election in Pennsylvania, where there was a strong suburban population, the 8th Congressional District in Arizona, has a history of being reliably red. Former Rep. Trent Franks, in his three times on the ballot, won with more than 25 percent of the vote.\nLesko’s victory only gives her the seat for the remainder of this year.\nBoth she and Tipirneni are expected to run again. First, each of them has to get through the August 28 primary for the right to compete in November.\nIn Tuesday's contest, which was triggered by Frank's resignation from Congress last year, Tiperneni outpaced Lesko in campaign fundraising by over $100,000, but outside groups invested heavily in the Republican.\nThe Republican National Committee (RNC), National Republican Campaign Committee (NRCC) and the Congressional Leadership Fund (CLF) poured over $1.3 million into the race from primary to election day, according to FEC filings, while Democratic outside groups spent just over $300,000.\n“Debbie is a strong conservative whose values truly reflect those of the voters in Arizona’s Eighth District,” NRCC Chairman Steve Stivers said in a statement Tuesday night. “The NRCC was proud to support her and our targeted and early investments proved to be a difference maker in the race.”\nRoss D. Franklin/AP\nOne GOP strategist called the Republican spending in the race an “education campaign” to remind voters the special election was taking place.\nTrump carried Arizona's 8th Congressional District, which lies to the northwest of Phoenix and was once the home base for Maricopa County Sheriff Joe Arpaio, by 21 points in the 2016 presidential election and the population in the district is older than most, with a median age of 43 according to U.S. Census Bureau data.\nThe average median age for congressional districts in Arizona is 38, and the 8th Congressional District is the second oldest in a state with a significant retiree population.\nRepublicans will face tough contests in much less demographically favorable districts come November and still face two more special elections in the coming months.\nThere will be a special election in Texas' 27th Congressional District on June 30th to replace the seat vacated by Rep. Blake Farenthold, and a special election in Ohio's 12th congressional district on August 7th.",
    "source_domain": "abcnews.go.com",
    "title": "Republican Lesko projected winner of Arizona special election in GOP stronghold",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/republican-lesko-projected-winner-arizona-special-election-gop/story?id=54707313"
}