{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2017-08-14 21:17:51+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "A Missouri dad has received a special tattoo to help his son cope with year-old burn scars.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fman-tattoo-replica-year-sons-burn-scars%2Fstory%3Fid%3D49156460.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/dad-tattoo-ht-hb-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Missouri dad has received a special tattoo to help his 9-year-old son cope with year-old burn scars.\nIn 2016, Landon Thomas accidentally fell into a bonfire at home and badly burned his right leg and foot, his father, Joel Thomas, told ABC News.\n\"At first, he had to wear compression socks to help him heal and even after, he wore long socks to hide [the scars],\" said Thomas, 31, of Festus, Missouri.\nJoel Thomas\nKTVI\nTo give his son a boost of confidence, Thomas said he offered to get a tattoo that would match the scars Landon sustained.\nThomas then put in an application to the show \"Ink Master\" on the Spike network. Two weeks ago, an episode of Thomas receiving his tattoo with Landon by his side aired.\nJoel Thomas\nA spokeswoman for Spike told ABC News that Thomas was tattooed by “Ink Master” competitors Jessy Knuckles and Allisin Riot, employees of Pinz and Needlez tattoo shop in Maryland.\n“Joel and Landon were exactly the story we were hoping to tell: a dedicated and loving parent who wants to show his son that scars are what make you unique,” Ink Master's executive producer Andrea Richter wrote to ABC News in an email.\nThomas’ fiancé Melissa Kuhlmann called Thomas’ tattoo a “beautiful reminder” of the bond between father and son.\n“I don’t know many people that would purposely scar themselves,” Kuhlmann told ABC News. “Joel would do anything for his children.”\nThomas' scar tattoo is complete with Landon's initials.\n\"[Landon] loves it,\" Thomas said of the tattoo. \"The fact that I was willing to carry that along with him--that load of the scar and the pain of something that happened in his life, it made us a lot closer.\"",
    "source_domain": "abcnews.go.com",
    "title": "Man gets tattoo replica of 9-year-old son’s burn scars",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/man-tattoo-replica-year-sons-burn-scars/story?id=49156460"
}