{
    "authors": [
        "Abc News",
        "More Nicole"
    ],
    "date_download": "2017-02-15 14:59:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Shailene Woodley is starring in the highly-anticipated HBO show \"Big Little Lies.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fshailene-woodley-starring-reese-witherspoon-nicole-kidman-big%2Fstory%3Fid%3D45506009.json",
    "image_url": "http://a.abcnews.com/images/GMA/170215_gma_break_woodley2_0833_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Shailene Woodley is starring in the highly-anticipated HBO show \"Big Little Lies.\"\nThe actress appeared on \"Good Morning America\" today and shared what it was like working with Reese Witherspoon and Nicole Kidman, who also star in the seven-part limited series.\n\"It was so boring, you know,\" Woodley joked of the collaboration. \"It was amazing. Nicole and Reese have been in this industry for so long and they actually genuinely still love acting and still love what they do to the point where they're producing their own content and their creating their own projects and that's how this how came about. It was a book that Reese fell in love with and she wanted to explore the inner psyches of women, which you don't really see in cinema or television.\"\nThe dark, comedic drama focuses on three mothers who live in Monterey, California, a town where conflicts and secrets are exposed.\n\"Big Little Lies\" is based on the New York Times bestselling book of the same name by author Liane Moriarty.\n\"There's a lot of really big lies that are littered throughout the show,\" Woodley said. \"It's about a group of mothers who come together via their first grade children and you get to explore the relationship dynamics between moms and their spouses, moms and their children, moms and other moms.\"\n\"Big Little Lies\" premieres this Sunday at 9 p.m. ET on HBO.",
    "source_domain": "abcnews.go.com",
    "title": "Shailene Woodley on starring with Reese Witherspoon, Nicole Kidman in 'Big Little Lies'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/shailene-woodley-starring-reese-witherspoon-nicole-kidman-big/story?id=45506009"
}