{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 20:53:19+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fwhite-house-tweets-draw-ire-political-content-56356587.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_3d8afaca913a43bebefc540c96abbe43_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The White House is using its official Twitter handle to target Democratic lawmakers who have criticized President Donald Trump's immigration policies, drawing complaints that government resources are being used to undercut potential 2020 presidential rivals.\nThe White House Twitter handle, which has more than 17.3 million followers, falsely accused California Sen. Kamala Harris on Monday of \"supporting the animals of MS-13,\" a violent gang that the president has sought to eradicate.\nIn a separate tweet, the White House account erroneously asserted Massachusetts Sen. Elizabeth Warren was \"supporting criminals moving weapons, drugs, and victims\" across the border.\nWatchdog groups said the use of the Twitter handle didn't appear to violate any government laws but represented a politicization of the social media accounts at a time when Republicans and Democrats are engaged in a vigorous debate over the nation's immigration laws and the separation of migrant children from their families at the U.S.-Mexican border.\nResponding on Twitter, Harris pointed to her work as a prosecutor who \"went after gangs and transnational criminal organizations. That's being a leader on public safety. What is not, is ripping babies from their mothers.\" Warren assailed Trump's immigration policies during a rally last Saturday, saying Trump seemed to think \"the only way to have immigration rules is to rip parents from their families, is to treat rape victims and refugees like terrorists and to put children in cages. This is ugly. This is wrong.\"\nThe White House Twitter account is separate from Trump's personal account, which has more than 53 million followers and is used daily by the president. The White House account is similar to Trump's official presidential account, @POTUS, and tweets from the three accounts are preserved under the Presidential Records Act.\nIn separate tweets on Tuesday, the @WhiteHouse account tweeted at Democratic Rep. Mark Pocan of Wisconsin, accusing him of supporting human smuggling, and Democratic Rep. Earl Blumenauer of Oregon, claiming he was protecting drug smugglers. The two lawmakers recently proposed legislation to abolish Immigration and Customs Enforcement, or ICE.\nPocan responded that if Trump \"truly cared about victims of human trafficking, he would put an end to his ongoing assault on immigrants.\" Blumenauer said in a statement, \"Before tweeting, they should reunite the families they needlessly tore apart. Even people at ICE understand significant changes need to be made.\"\nThe White House did not immediately respond to the lawmakers, but officials pointed to a June 2015 tweet issued by the White House account during President Barack Obama's second term. The tweet was directed against the Twitter handle of Senate Majority Leader Mitch McConnell, R-Ky., taking issue with his characterization of the \"Obamacare\" law as a broken promise.\nGovernment ethics experts said the White House tweets did not appear to be violations of the Hatch Act, which prohibits federal employees from engaging in political activity on the job. \"It may be a violation of ethical norms or civility, but not the Hatch Act,\" said Jordan Libowitz, a spokesman for Citizens for Responsibility and Ethics in Washington.",
    "source_domain": "abcnews.go.com",
    "title": "White House tweets draw ire over their political content",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/wireStory/white-house-tweets-draw-ire-political-content-56356587"
}