{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:59:24+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Duke figured things out before everything fell apart",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fduke-figured-things-fell%2Fstory%3Fid%3D45508093.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0215/dm_170215_MLB_Verlander_on_Tigers_chances/dm_170215_MLB_Verlander_on_Tigers_chances_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "DURHAM, N.C. -- Mike Krzyzewski would later call it a \"team-building\" meeting. Amile Jefferson said it was a chance to \"put everything on the table.\"\nHowever you want to define it, the call to Krzyzewski's house was not for cookies and milk. Recovering from back surgery, Krzyzewski was out of commission but not out of the loop. He was still plenty involved with his team, still more than aware of what was and wasn't working.\nAfter a two-point loss to NC State on Jan. 23, it was clear things at Duke weren't working.\nSo the Hall of Famer called his team together. He temporarily banned them from their own locker room and barred them from wearing Duke gear,?insisting these players earn the right to wear their university's name again.\nNeither the come-to-K meeting and figurative undressing nor the literal undressing is unusual. Krzyzewski isn't the first coach to use this motivational ploy, and he likely won't be the last. Even Krzyzewski has been down this road before. Associate head coach Jeff Capel told a local radio station about returning to the Duke locker room during the 1993-94 season to find the place stripped bare, right down to a rolled-up carpet.\nBut this Duke team wasn't supposed to need a call to the principal's office. This season was supposed to be magical, with experience and youth meeting in a sweet ride to a national title. Instead, with injuries robbing the Blue Devils of continuity and Grayson Allen's third tripping incident in a calendar year denying them peace, Duke hit a tipping point with that home loss to the Wolfpack.\nDuke was on the brink.\n\"This has been one of the most different seasons I've had at Duke, to put it that way,'' said Jefferson, a fifth-year senior. \"Having expectations and having them altered, it's been hard.''\nDuke appears to have stepped back from the edge, with the meeting serving as the before-and-after marker. Before the meeting, the Blue Devils had lost three of four. Since the meeting, they've won five in a row, including an emotional victory against North Carolina six days ago at Cameron Indoor Stadium.\nBut how the Devils got there, how such a promising season went off the rails for nearly a month is a fascinating case study in just how fragile success can be.\n\"It's like with your own kids: You try to teach them to live in their moment,'' Krzyzewski said. \"It's not about your big brother's moment or your parents' moment. It's your moment.''\nConversations with several people associated with the program and interviews with people at Duke reveal just how close Duke was to missing out on that moment.\nON DEC. 21, in an otherwise inconsequential romp against an inconsequential opponent, Duke's season went haywire. Grayson Allen tripped Elon's Steven Santa Ana. At that point, despite injuries to three freshmen from its prized recruiting class -- an unexpected preseason knee surgery for Harry Giles, a foot sprain for Jayson Tatum and a leg injury for Marques Bolden -- everything was still going reasonably well for the Blue Devils. They'd won all but one of their first 13 games and comfortably settled in at No. 5 in the polls.\nNow, with the roller coaster steadying, the Blue Devils and Krzyzewski talk about the myriad injuries -- only Luke Kennard and Matt Jones have played in every game -- as the reason it has taken a while for Duke to get on track. No doubt the revolving lineup and limited numbers in practice have taken their toll. The competition level, too, changed right after that Elon game. Instead of Elon and Tennessee State, the Blue Devils were playing Virginia Tech, Louisville and Florida State.\nBut everything really changed the moment Allen sent Santa Ana sprawling. A team that looked connected and content suddenly looked disconnected and discontented. When Krzyzewski called that meeting, it wasn't just because the Blue Devils were losing. It was because of how they were losing.\nNo one was angry at all at Allen. If anything, his teammates were worried about him, how he was doing and how he was handling the endless stream of negative attention.\nThey were, however, tired of the fallout. The aftermath of his actions -- the constant scrutiny on him, Krzyzewski and the team, not to mention how it turned Allen into a far more cautious player -- impacted the entire program.\n\"It just wore people out,'' a source with knowledge of the situation said.\nThe other part, as naive as it might sound, was that no one saw it coming. Throughout the course of his Hall of Fame career, Krzyzewski's integrity and ethics rarely have been called into question, his reputation spilling over to Duke's program. The Blue Devils simply don't invite a lot of legitimate criticism. Now not only was the program coming under fire, but also Krzyzewski was facing some of the harshest criticism of his career. People were loudly questioning how he handled Allen, in the past and immediately following Allen's latest incident with Santa Ana.\nStill, the players and staff -- really, everyone at Duke -- believed the fury would die down. Sure, life on the road would be tough, but for Duke it is always tough. The national glare, they thought, would fade. Instead, Allen became the most watched player in the sport, his every move played and replayed in slow motion.\nDid he trip someone? Did he push someone?\nOn Jan. 10, against Florida State, as he dove for a loose ball out of bounds, Allen appeared to shove Seminole assistant Dennis Gates. Four days later, Allen and Louisville's Donovan Mitchell got tangled up going for a loose ball, and Mitchell appeared to smack Allen in the nose. Nine days after that, in the loss against NC State, Allen cut through the Wolfpack huddle en route to his own bench and got tangled up with the Wolfpack's Terry Henderson. Five days later against Wake Forest, he connected with Brandon Childress on an out-of-bounds play.\nEach time, Allen was defended, either by the other party involved or the league office. Gates put out a statement saying he didn't believe Allen's push was intentional, that it was part of the natural flow of the game. The ACC ruled Mitchell's slap inadvertent. Replays showed Childress, not Allen, instigating the jawing at Wake. In fact, it was Childress who was hit with a technical foul. But because of his reputation, it was Allen who drew the attention.\n\"It's been a lot,'' Allen told ESPN.com after the North Carolina game.\nOften when people talk about how a negative event will hurt a team, how it could be a \"distraction,\" it's little more than a buzzword, with reality rarely matching the expected chaos. This was a gigantic distraction. Already behind in building team chemistry because of the rash of injuries, the Blue Devils felt backed into a corner, defensive for their teammate and their program.\n\"You try to handle whatever is going on in an even keel,'' Krzyzewski said. \"Whether it's a 20-game winning streak, a national championship or an elimination in the first round of the NCAA tournament. And that's what I've tried to do with this team.''\nAsked if he thought the team had handled all of the attention well, Jones paused.\n\"Um ... maybe,'' the senior guard said, sounding more uncertain than certain. \"We've just been through so much.''\nVirtually everyone ESPN.com spoke to said no one questioned Krzyzewski's decision to suspend Allen just one game. People at Duke knew what outsiders didn't: that from the moment Krzyzewski yanked Allen out of his own locker room and into Elon's to apologize to Santa Ana, there had been plenty of meetings, conversations and actions taken, along with the public suspension and loss of his captaincy.\nKrzyzewski's rationale, too, was complicated by his own impending health crisis. About to face back surgery that would sideline him for about a month, the coach recognized that Capel would have a complicated enough job and didn't want him to answer repeated questions about Allen's status without having the authority to reinstate him.\nBut the Grayson Allen who returned to the court wasn't the same guy who left. Allen is naturally gifted, an athletic wing with a shooter's touch. His motor, though, has always been his separator. It runs high, fueling him to work harder in practice and on his own and play harder in games. He feeds off his own emotions as much as his teammates do. The way he played was as instrumental to Duke's 2015 national championship as the 16 points he scored against Wisconsin.\nHe was, though, keenly aware that everyone was now watching his every move. He lost his fire, dialed back his edge, given the spotlight, afraid that a hard play would be misconstrued as a dirty play. He was, it seemed, trying to prove to people who he was or who he wasn't, instead of just simply playing.\n\"That's what was heartbreaking,'' a source said. \"He couldn't be himself.''\nAfter the North Carolina win, Allen said he was having fun playing basketball again. Asked if he'd had fun all season, Allen smirked.\n\"I'm not interested in a tell-all right now, but uh, no,'' he said.\nAllen averaged just 13.5 points and shot only 7-of-28 from beyond the arc in the six games after his suspension. Moved to point guard, he seemed more content to distribute than dictate -- not exactly the role he was born to. He was tentative.\nTHE BLUE DEVILS HAVE BANDED TOGETHER,?trying to shut out the noise as they make their crucial march to March.\nThe season, after all, is hardly over, and if the past five games are any indication, Duke might have the biggest upside of any team in the country. Tatum, arguably the furthest along among the freshmen, has learned to be more than just a scorer, dishing out 12 assists and pulling down 41 rebounds during the win streak. Giles continues to show flashes of his potential, and Kennard remains equal parts steady and spectacular.\nBut the real difference has been Allen. He's averaging 21.5 points per game during the win streak, but it goes deeper than the box score. He looks different, less tentative and no longer worried that his next move will be the wrong move.\n\"It feels good to just be out there playing the game that I love -- and loving it,\" Allen said after the win against North Carolina. \"Really just having fun with it, whether my shot falls or not. That's how I grew up playing the game. Just loving to compete. It feels good to do just that.\"",
    "source_domain": "abcnews.go.com",
    "title": "Duke figured things out before everything fell apart",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/duke-figured-things-fell/story?id=45508093"
}