{
    "authors": [
        "Abc News",
        "More Morgan"
    ],
    "date_download": "2018-02-02 22:28:03+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Two puppies rescued from storm-ravaged Puerto Rico will star in the Puppy Bowl on Super Bowl Sunday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fpuppies-rescued-hurricane-star-puppy-bowl%2Fstory%3Fid%3D52793216.json",
    "image_url": "http://a.abcnews.com/images/US/puppy-superbowl-rc-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two puppies rescued from storm-ravaged Puerto Rico will star in the Puppy Bowl on Super Bowl Sunday.\nInterested in Hurricanes? Add Hurricanes as an interest to stay up to date on the latest Hurricanes news, video, and analysis from ABC News. Add Interest\nKaleb Jr. and Archer, two mixed-breeds, are among more than 1,000 dogs that have been transported to safety from Puerto Rico by rescue group The Sato Project since Hurricane Maria roared ashore the U.S. territory.\nAnimal Planet/Keith Barraclough\nAnimal Planet/Keith Barraclough\nSince 2001, The Sato Project has been rescuing abandoned and abused dogs from Puerto Rico, where limited spay and neuter practices have lead to unwanted litters of puppies. The organization, which gets its name from the Puerto Rican slang for stray dog, \"sato,\" typically focuses its efforts on an area known as Dead Dog Beach in Yabucoa municipality in the southeast corner of the island, where many unwanted canines are dumped.\nBut the situation was exacerbated when Maria made landfall in Puerto Rico as a Category 4 hurricane on Sept. 20, according to Christina Beckles, founder and president of The Sato Project. Now, the group is rescuing dogs from all over the island.\n\"The amount of dogs that need help now is beyond anything I've ever seen before in all those years of rescue,\" Beckles told ABC News in a telephone interview Friday.\nRicardo Arduengo/AFP/Getty Images\nHurricane Maria ravaged homes and knocked out the island's entire power grid. The government of Puerto Rico put the official death toll as a result of Maria at 64. But after some independent analyses found the count was likely significantly higher, Puerto Rico's governor ordered a review of all deaths that have occurred since the storm struck.\nWithout power and access to clean water for weeks following the hurricane, animal welfare groups like The Sato Project were unable to provide veterinary services on the island, such as spaying and neutering. And with all commercial airline cargo space sequestered by FEMA and the U.S. military, The Sato Project couldn't to fly a dog weighing more than 20 pounds off the island.\nThough the group's operations are back up and running, Beckles said the influx of puppy litters born in the storm's aftermath is overwhelming.\n\"Now we're seeing the effect of that. We're getting more puppies than I have ever seen before,\" Beckles said. \"I truly feel that we have lost seven years of work with Maria, which is heartbreaking.\"\nGerald Herbert/AP Photo\nIt's been more than four months since the storm hit, yet nearly half a million customers were still without power in Puerto Rico at the end of January, according to the U.S. Army Corps of Engineers. Ninety-six percent of the island has access to drinking water, according to the Puerto Rican government, though a \"boil water\" advisory remains in effect.\nFEMA announced Tuesday that the agency’s food and water aid to Puerto Rico is no longer needed for emergency operations, citing the restoration of the commercial food and water supply chain and the availability of private suppliers.\nThe devastation wrought by Hurricane Maria has forced tens of thousands of people who were living in Puerto Rico to come to the U.S. mainland. Hunter College's Center for Puerto Rican Studies estimates that Puerto Rico will lose up to 470,335 residents, or 14 percent of its population, from 2017 to 2019.\n\"We have the hundreds of thousands of dogs that were already stray and abandoned on the streets, and now those numbers are increasing because people are abandoning their dogs as they leave the island or they can't afford to care for them,\" Beckles said. \"And it's not ending anytime soon.\"\nThe Sato Project\nOn average, the Sato Project rescues and rehabilitates about 350 dogs every year in Puerto Rico and flies them to New York for adoption. The organization has donated generators, emergency veterinary supplies, more than 200 dogs beds and over 50,000 pounds of dog food in the aftermath of Hurricane Maria.\nIn addition to finding forever homes for rescued pups, The Sato Project has reunited 183 owned dogs with their families since the storm. One of the dogs was a medical support animal owned by a diabetic woman, who had to leave her home in Puerto Rico behind because she didn't have access to insulin after the hurricane. She had been in two diabetic comas without her beloved companion at her side to sense her sugar levels.\nThe Sato Project\nThe two puppies featured in this year's Puppy Bowl on Animal Planet have already found loving homes in New York. Kaleb Jr. has been renamed Murphy by his adoptive mom and Archer's new family has renamed him Maddox.\nThe four-legged all-stars will go paw-to-paw in Sunday's furry competition with other puppies rescued from areas devastated by natural disasters last year. Animal Planet worked with 48 different animal shelters and rescue organizations from 25 U.S. states and territories to fill the adorable rosters of Team Fluff and Team Ruff.\n\"There's no need to ever buy a dog,\" Beckles said. \"You can find whatever dog your heart desires at your local shelter.\"\nABC News' Erin Dooley and Joshua Hoyos contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Puppies rescued after hurricane to star in Puppy Bowl",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/puppies-rescued-hurricane-star-puppy-bowl/story?id=52793216"
}