{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 09:08:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Toyota hopes revamped plug-in sells better than first model",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ftoyota-hopes-revamped-plug-sells-model-45502663.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/toyota-hopes-revamped-plug-sells-model-45502663",
    "language": "en",
    "localpath": null,
    "maintext": "Toyota has revamped its plug-in hybrid with a longer cruising range and quicker charging, including from a regular home plug, hoping it will sell better than the first model from five years ago that officials acknowledged had flopped.\nJapanese automaker Toyota Motor Corp.'s Prius PHV plug-in went on sale in Japan on Wednesday. Sales in the U.S. started late last year, and it is set to launch in Europe and other countries in March.\nToyota hopes to sell 2,500 PHV cars in Japan a month. It gave no overseas targets. It sold only 22,000 of the earlier PHVs.\nThe lackluster sales contrast with Toyota's leadership in hybrid vehicles; it has sold 10 million globally since the first Prius went on sale in 1997.\nNearly half of the vehicles Toyota sells in Japan are hybrid models. Toyota, which also makes the Camry sedan, offers hybrids across the entire spectrum of models, including sport-utility vehicles and Lexus luxury cars.\nBut Toyota suffered a setback in another ecological technology, fuel cells, which run on hydrogen fuel. All 2,800 Mirai fuel-cell vehicles on roads — 1,200 in the U.S., 1,500 in Japan and 140 in Europe — were recalled globally Wednesday for defective software.\nIf the gas pedal is pushed fully after the vehicle makes a long descent using cruise control, a surge in voltage can cause the fuel system to stop running, according to Toyota.\nA hybrid switches between a gas engine and an electric motor. A plug-in hybrid can travel further as a pure electric vehicle, which is zero-emission, but needs recharging when its battery is spent.\nThe cruising range of the new plug-in as an EV is 68.2 kilometers (42.4 miles), about five times the earlier model's 26.4 kilometers (16.4 miles).\nIt also charges about twice as fast, in two hours and 20 minutes, from a 200-volt outlet and in 14 hours at a 100-volt outlet. At a special charging machine, it reaches an 80 percent charge in just 20 minutes.\nToyota Chairman Takeshi Uchiyamada, known as \"the father of the Prius,\" said he had no idea how long it will take for global plug-in sales to reach a million.\nHe acknowledged hybrid sales have suffered as the recent drop in gas prices helped sales of sport-utility vehicles. But in the long run, consumers will opt for ecological vehicles because of growing worries about the environment, he said.\nBy 2050, Toyota foresees reducing emissions by 90 percent from 2010 levels — meaning that almost every vehicle on roads will be running on some kind of green technology, be it hybrids, electric, plug-in or fuel cell.\n\"PHV is key to that step in making eco-cars widespread,\" Uchiyamada said. \"This is a product we are proud of.\"\n———\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\nHer work can be found at http://bigstory.ap.org/content/yuri-kageyama",
    "source_domain": "abcnews.go.com",
    "title": "Toyota hopes revamped plug-in sells better than first model",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/toyota-hopes-revamped-plug-sells-model-45502663"
}