{
    "authors": [
        "Abc News",
        "More Geneva"
    ],
    "date_download": "2017-04-18 03:12:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "New ICE numbers show an uptick in immigration-related arrests since Trump took office, compared to last year in the same timeframe.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fimmigration-related-arrests-ice-increase-president-trump%2Fstory%3Fid%3D46847044.json",
    "image_url": "http://a.abcnews.com/images/Politics/Immigration_Raids_California_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Immigration-related arrests were up nearly 33 percent in the first months of Donald Trump's presidency compared to the same time period last year, according to new data released by U.S. Immigration and Customs Enforcement(ICE).\nICE made 21,362 arrests from Jan. 20 through March 13 of this year, up from 16,104 arrests during the same window in 2016. Immigration arrests of non-criminals more than doubled since last year from 2,278 in 2016 to 5,441 this year.\nStrict immigration enforcement was a campaign promise of then-candidate Trump, who regularly called for building a wall on the U.S.-Mexico border and deporting undocumented immigrants.\nThe Trump administration has since given more leeway to immigration officers on the ground, emphasizing that all unauthorized immigrants are subject to deportation and even butting heads with local police departments who have said they won't fully cooperate with federal immigration authorities.\nICE \"focuses its enforcement resources on individuals who pose a threat to national security, public safety and border security,\" an ICE spokesperson said in a statement when the numbers were released. \"ICE will no longer exempt classes or categories of removable aliens from potential enforcement. All of those in violation of the immigration laws may be subject to immigration arrest, detention and, if found removable by final order, removal from the United States.\"\nDespite the increase over last year, however, total immigration arrests were nonetheless down 27 percent in 2017 from the 29,238 during the same time frame in 2014 under President Obama. Similarly, arrests of non-criminals were also down this year from 7,483 in 2014.\nThere were 15,921 criminal arrests in 2017 compared to 13,826 during the same period last year. But this year's figures were also down by 26.7 percent from 21,745 in 2014.\nThe Washington Post was the first to report these numbers.\nICE \"detainers,\" an official request to keep potentially unauthorized immigrants in custody following a local criminal arrest, followed a similar pattern -- they've been up since Trump took office, but down from 2014. There were 22,161 detainers at the beginning of 2017, up around 75 percent from last year but down eight percent from 2014.\nMeanwhile, ICE immigration arrests out of the Dallas region saw the biggest spike, nearly doubling since last year. The Boston, Atlanta, Baltimore and Detroit regions also had over 50 percent increases.\nIn another sign that more resources since last year are going towards immigration enforcement, the average ICE daily detention population -- representing the average number of people who are in ICE custody -- was higher than every other yearly average going back as far as 2001. As of April 8, 2017, the average daily detention population was 40,467 people.\nFiscal year 2016 had the highest average population with 34,376 people. The lowest was in FY 2005 with an average population of 19,718 people. That year also had the lowest number of funded beds.\nSince 2012, ICE has had funding for 34,000 detention beds.\nICE has not provided year-to-date numbers, so it's possible that the yearly average will be lower than the current daily average.",
    "source_domain": "abcnews.go.com",
    "title": "Immigration-related arrests by ICE increase under President Trump",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/immigration-related-arrests-ice-increase-president-trump/story?id=46847044"
}