{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 19:09:43+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Trump to pitch tax plan; Treasury offers rosy estimate",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Ftreasury-gop-tax-bill-generate-18t-revenue-51719689.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/treasury-gop-tax-bill-generate-18t-revenue-51719689",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump on Wednesday will try to sell the American people on an unpopular Republican tax overhaul that his administration claims will generate about $1.8 trillion in new revenue — a figure that a top Democratic lawmaker dismissed as \"fake math.\"\nThe White House said Monday that Trump's pitch will focus on how the GOP tax reform plan will lead to a brighter future for taxpayers and their families, according to spokeswoman Lindsay Walters. House and Senate negotiators are rushing to finalize a bill and deliver the measure to Trump before Christmas.\nTrump and Republican leaders in Congress have promoted the massive tax plan by promising the tax cuts will boost the economy. Public polling shows many Americans are unhappy with the proposal. The House and Senate tax bills combine steep tax cuts for corporations with more modest reductions for individuals.\nThe administration's new, rosy estimate of new revenue from the tax plan over 10 years is a lot higher than nonpartisan congressional analysts have projected. The Joint Committee on Taxation estimates that growth stimulated by the anticipated tax cuts will generate some $408 billion in additional tax revenue over 10 years.\nThe new Treasury Department analysis says about half the expected increase in economic growth likely will result from tax benefits for corporations.\nSenate Democratic Leader Chuck Schumer, D-N.Y., called the analysis \"nothing more than one page of fake math.\"\n\"It's clear the White House and Republicans are grasping at straws to prove the unprovable and garner votes for a bill that nearly every single independent analysis has concluded will blow up the deficit and generate almost no additional economic activity to make up for it,\" Schumer said.\nIt's a momentous week for the tax legislation. The Republicans are determined to deliver the first revamp of the nation's tax code in three decades and prove they can govern after their failure to dismantle Barack Obama's health care law this past summer. Voters who will decide which party holds the majority in next year's midterms elections are watching.\nGOP leaders in Congress aim to iron out differences between the $1.5 trillion House and Senate tax bills, to pass a final blended package.\nTrump on Sunday offered an upbeat assessment.\n\"Getting closer and closer on the Tax Cut Bill. Shaping up even better than projected,\" Trump tweeted on his way to his golf club in West Palm Beach, Florida. \"House and Senate working very hard and smart. End result will be not only important, but SPECIAL!\"\nThe House and Senate bills would cut taxes by about $1.5 trillion over the next decade while adding billions to the $20 trillion deficit. They would double the standard deduction used by most Americans to $12,000 for individuals and $24,000 for couples.\nRepublican leaders have struggled to placate GOP lawmakers from high-tax states like California, New York and New Jersey whose constituents would be hit hard by the elimination of the prized federal deduction for state and local taxes. Repeal of the deduction added up to $1.3 trillion in revenue over a decade that could be used for deep tax cuts.\nLawmakers finally settled on a compromise in both bills — full repeal of the state and local deductions for income and sales taxes, but homeowners would be able to deduct up to $10,000 in local property taxes.\n\"I feel very confident we're going to get this done ... at the end of the day we're going to get this to the president's desk and he's going to sign it,\" House Majority Leader Kevin McCarthy, R-Calif., said Sunday in an interview on Fox News Channel.\nJust a few weeks ago, lawmakers were unyielding on their insistence that the corporate tax rate be slashed from 35 percent to 20 percent. Now, one way to finance the changes on state and local taxes would be to cut the corporate tax rate to 21 or 22 percent instead.\n——\nThis story was corrected to reflect the Joint Committee on Taxation's estimate of revenue from the tax plan, $408 billion.\n———\nAssociated Press writer Jill Colvin contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Trump to pitch tax plan; Treasury offers rosy estimate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/treasury-gop-tax-bill-generate-18t-revenue-51719689"
}