{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2017-08-14 19:46:46+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Rebecca Hayes and David Ward explain why they never got the chance 21 years ago.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fheartwarming-reason-parents-newborn-photos-21-year-son%2Fstory%3Fid%3D49206092.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/parents1-ht-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One newborn photographer never got a chance to give her own child the posed photos that new moms and dads love. So she decided that despite 21 years passing, she'd finally take \"newborn\" photos of her first son.\nRebecca Hayes told ABC News that she got the idea to take the silly photos of her son, Clayton Jensvold, back in March right after photographing one of her clients.\n\"I threw it out there just sort of joking around,\" she recalled.\nChaotic Perfection Photography\nHayes, 38, had no idea that her partner and high school sweetheart David Ward would completely be on board. Their son, which Hayes had at 16 years old, was also game to her delight.\n\"He’s got a really quick wit and dry sense of humor and so he’s a hard read,\" Hayes said of her son, \"but with this he just like sat up, saying, 'We have to do this.'\"\nChaotic Perfection Photography\nIt was especially important for the couple, who dated for years in an Orange, California, high school before breaking up after they discovered they were expecting.\n\"It got a little bit complicated and we just parted ways,\" Hayes explained.\nThe two both went on to marry and have children in those relationships. Still, after the death of Hayes' husband in 2013, she reconnected with her high school sweetheart, who helped her cope.\nIt was perfect timing as Ward, 40, would soon need to lean on her once his wife was diagnosed with cancer in 2015. She passed away a year later.\nChaotic Perfection Photography\n\"We didn’t know any other people who had passed so young so we had each other,\" Hayes said. \"Then one day we looked at each other and said, 'What the hell?'\"\nThe two have been dating since January.\nWard added of the full-circle moment, \"It's weird but it's a good weird.\"",
    "source_domain": "abcnews.go.com",
    "title": "The heartwarming reason why parents took newborn photos with 21-year-old son",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/heartwarming-reason-parents-newborn-photos-21-year-son/story?id=49206092"
}