{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:47:25+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Video shifts initial view of fatal Nashville police shooting",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fvideo-shifts-initial-view-fatal-nashville-police-shooting-45492202.json",
    "image_url": "http://abcnews.go.com/US/wireStory/video-shifts-initial-view-fatal-nashville-police-shooting-45492202",
    "language": "en",
    "localpath": null,
    "maintext": "Newly obtained surveillance video has caused Nashville police to revise their account of a traffic stop on Friday that ended with a white officer shooting and killing an armed African-American man.\nPolice say footage first made available Tuesday shows there was no initial physical confrontation between Jocques Scott Clemmons and Nashville Officer Josh Lippert right after Clemmons ran a stop sign and they both exited their cars.\nBased on a different video, police first believed Clemmons \"abruptly charged at Officer Lippert, making full contact with his body.\"\nInstead, the latest video angle shows Clemmons ran toward Lippert to get around him, stopped short of the officer, and then turned around and ran in the opposite direction, police said.\nIn a follow pursuit by the officer Clemmons, 31, refused orders to drop the loaded pistol before Lippert fired at him, police said.\nThe new information comes amid outcry from Clemmons' family questioning the police's claims and the officer's actions. A protest march through downtown Nashville is planned for Tuesday evening.\n\"As part of the full and accountable investigation into this matter, it is important that the community know of this new development,\" Nashville Police Chief Steve Anderson said in a news release. \"The investigation is active and progressing. We are engaging with the FBI. Citizens have my assurance that the investigation will be fair, objective and complete.\"\nPolice were initially depending on a surveillance tape from Friday that was filmed further away and from a different angle that \"created the impression of contact\" between the two men.\nSurveillance video released by police appears to show that, after a scuffle, Clemmons was moving away with his back turned to Officer Lippert when Clemmons was shot. Clemmons appeared to be trying to get in between two parked cars. He was shot in the back and died at the hospital Friday.\nLippert has been suspended 20 days over his five years as a Nashville officer. Some of those were in incidents where he used force, according to his personnel file.\nLippert used physical force to take a person out of a car during an October 2015 traffic stop, earning him an eight-day suspension, records show. Lippert's decision to use force \"unnecessarily escalated the encounter when the motorist had indicated he was willing to voluntarily step from the car if a supervisor was present,\" a disciplinary report states.\nIn June 2013 outside a Nashville bar, Lippert punched in the face and pepper sprayed a drunk man who had begun fighting with him after Lippert decided to switch out the handcuffs on the man.\nLippert's \"actions created the necessity to use force against an intoxicated subject,\" according to a disciplinary report that suspended him for three vacation days.\nThe shooting death of Clemmons has heightened calls from the NAACP and American Civil Liberties Union for quick action on implementing city plans to equip Nashville police with body cameras. Mayor Megan Barry plans to ask for $12 million for the cameras in the 2017-18 budget.\nAdditionally, ACLU of Tennessee is asking for the formation of \"an independent civilian review board, with robust power to investigate and hold law enforcement accountable.\"\nU.S. Attorney David Rivera has said his office will work with the FBI and the Civil Rights Division of the Department of Justice in monitoring the case.",
    "source_domain": "abcnews.go.com",
    "title": "Video shifts initial view of fatal Nashville police shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/video-shifts-initial-view-fatal-nashville-police-shooting-45492202"
}