{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 07:48:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Ivanka Inc. goes to Washington: A timeline",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fivanka-washington-timeline-46856337.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/WireAP_d3d2a0db8d0346acb5eafb7eaaf20df6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As Ivanka Trump builds a new political career as an adviser to her father, the commercial engine of her lifestyle brand is going strong. Sales, by some measures, have reached record highs this year.\nTrump founded the brand in 2007 and still owns it, but stepped back from management and put its assets in a family-run trust before taking on an official role at the White House. Despite efforts to distance herself from her business to address ethical concerns, Trump remains, for many, the living embodiment of the brand that bears her name.\nJuly 20, 2016: Ivanka Trump forms four new companies in Delaware to handle licensing contracts for baby products and costume jewelry.\nJuly 21, 2016: Donald Trump accepts Republican nomination for president.\nJuly 22, 2016: \"Shop Ivanka's look from her #RNC speech,\" @IvankaTrump tweets, along with a link to her collection's $138 blush sheath dress at Macy's online.\nSept. 29, 2016: Her company announces two new licensing agreements, for affordable fashion jewelry and baby accessories.\nNov. 8, 2016: Donald Trump wins the election. Sales of Ivanka merchandise on Lyst.com, a large e-commerce platform, bump 46 percent higher for the month.\nNov. 13, 2016: Ivanka Trump appears on \"60 Minutes\" to discuss her father's electoral win. Her jewelry company emails a \"style alert\" to reporters noting that she wore one of her \"favorite\" bangles, a $10,800 bracelet from her own collection, on the show. Ensuing criticism prompts the brand to apologize.\nDec. 4, 2016: The New York Times reports that Ivanka Trump sat in on a meeting with her father and the prime minister of Japan, as her company negotiated a licensing deal with a firm the Japanese government owned a large stake in. The deal was put on hold, according to Abigail Klem, who now runs Ivanka Trump's brand.\nDec. 27, 2016: Ivanka Trump Marks LLC applies for five new trademarks covering purses, wallets and other leather goods in Puerto Rico, and clothing, including swimsuits and lingerie in the U.S., public records show.\nJan. 11, 2017: Ivanka Trump announces she will take a \"formal leave of absence\" from executive positions at the Trump Organization and her lifestyle brand.\nJan. 20, 2017: Donald Trump becomes the 45th president of the United States.\nFeb. 8, 2017: Ivanka's company applies for two more clothing trademarks in the Philippines, where it already holds three marks, according to the Intellectual Property Office of the Philippines.\nFeb. 9, 2017: Speaking on the morning show \"Fox and Friends,\" White House counselor Kellyanne Conway encourages viewers to, \"go buy Ivanka's stuff,\" boasting about giving the brand \"a free commercial.\" It apparently worked, sparking a 771 percent surge in the brand's sales that month on Lyst.com over Feb. 2016. The White House later \"counseled\" Conway for inappropriately promoting the brand.\nFeb. 13, 2017: Trump meets with Canadian Prime Minister Justin Trudeau at the White House.\nFeb. 20, 2017: Ivanka Trump Marks LLC wins preliminary approval for a trademark covering branded leather handbags in China, where the company has 52 pending or registered trademarks listed in the government trademark database.\nFeb. 22, 2017: Ivanka Trump Marks LLC applies for another trademark, covering perfume, among other things, in Canada, where it holds 22 pending or registered marks, according to the Canadian Intellectual Property Office.\nMarch 1, 2017: Ivanka Trump Marks LLC applies for another new trademark in the Philippines, covering clothes and shoes.\nMarch 3, 2017: Ivanka Trump is photographed disembarking from Air Force One in a stripe asymmetrical skirt from her own collection, available on Lyst.com for $45.\nMarch 29, 2017: Ivanka Trump joins her father's administration as an unpaid employee.\nApril 6, 2017: Ivanka Trump and her husband, Jared Kushner, sit next to Chinese President Xi Jinping and his wife, Peng Liyuan, at a state dinner at Mar-a-Lago. That same day, China grants her company preliminary approval for three trademarks that confer monopoly rights to sell Ivanka brand jewelry, bags and spa services in the world's second-largest economy.\n——\nAssociated Press researcher Fu Ting in Shanghai and reporters Anne D'Innocenzio in New York, Teresa Cerojano in Manila and Danica Coto in San Juan, Puerto Rico, contributed to this report.\n———\nFollow Kinetz on Twitter at twitter.com/ekinetz",
    "source_domain": "abcnews.go.com",
    "title": "Ivanka Inc. goes to Washington: A timeline",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/ivanka-washington-timeline-46856337"
}