{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:52:18+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Lawsuit: Autistic student raped classmate while aide napped",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flawsuit-autistic-student-raped-classmate-aide-napped-45495295.json",
    "image_url": "http://abcnews.go.com/International/wireStory/lawsuit-autistic-student-raped-classmate-aide-napped-45495295",
    "language": "en",
    "localpath": null,
    "maintext": "An autistic high school student raped a classmate while the adult assigned to monitor him was taking a nap, said a federal lawsuit accusing Hawaii's statewide school district of negligence.\nThe autistic student had a full-time one-on-one aide because he was known to be violent, the lawsuit filed Monday said. The aide was asleep when the 2012 attack happened during Pearl City High School band practice, the lawsuit said.\nThe Associated Press doesn't typically name victims of sexual assault. The 10th-grade girl was in the back of the band at the percussion section when the larger 11th-grader raped her there and then again in a curtained area of the auditorium.\nThe aide was sleeping in the audience section of the auditorium, the lawsuit said.\nState Department of Education spokeswoman Donalyn Dela Cruz declined to comment on pending litigation. Kyle Miyashiro, who was a vice principal at the time and is named as a defendant, referred questions to the school's principal who didn't immediately respond Tuesday. The aide, Bryan Simpson, is also named as a defendant and no longer works at the school, Miyashiro said. Simpson couldn't be reached for comment.\nThe girl reported the rape to her mother and police, said her attorney Peter Hsieh. The autistic student was prosecuted in family court and convicted of two counts of first-degree sexual assault, Hsieh said.\n\"She dropped out of high school. She couldn't finish because of what happened to her,\" Hsieh said. But she later earned a GED diploma and is now studying bioengineering at the University of Hawaii, he said.\n\"She's basically turned an adverse situation as a motivator for her,\" he said, adding that it was her decision to pursue a civil lawsuit.\nIn a separate, similar case, a jury last year determined that the Department of Education failed to protect a special education student who said she was raped by a special education classmate at Waianae High School. The jury awarded the girl and her mother about $810,000 in damages, but the state appealed. The case is before the 9th U.S. Circuit Court of Appeals, said Hsieh, who also handled that case.\nThe two lawsuits send a \"loud message that there is a lack of proper training and supervision of teachers, aides and assistants,\" Hsieh said, \"especially when it comes to children who have a history of violence.\"\n———\nFollow Jennifer Sinco Kelleher at http://www.twitter.com/JenHapa. Her work can be found at http://bigstory.ap.org/content/jennifer-sinco-kelleher.",
    "source_domain": "abcnews.go.com",
    "title": "Lawsuit: Autistic student raped classmate while aide napped",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/lawsuit-autistic-student-raped-classmate-aide-napped-45495295"
}