{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 16:03:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The Latest: New Jersey increases transit security",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-pipe-bomb-explodes-underground-passageway-51717174.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_8d60f5a82c0c4aefb6f1e30472283d20_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the explosion in Manhattan in an underground passageway (all times local):\n11:55 a.m.\nNew Jersey Gov. Chris Christie says he has ordered extra security at mass transit hubs in his state following the pipe bomb explosion in a passageway near Times Square in Manhattan.\nNew Jersey Transit buses have resumed normal service Monday into New York City's Port Authority Bus Terminal.\nNew York City also has reopened its subways amid heightened city-wide security after a man with a pipe bomb strapped to him caused an explosion in an underground passageway in the Times Square area during the morning rush hour.\nLaw enforcement officials tell The Associated Press that Akayed Ullah was inspired by the Islamic State Group, but apparently had no direct contact with the terrorist group. The officials spoke on condition of anonymity because they were not authorized to speak publicly about the suspect or incident.\nThe suspect had burns on his abdomen and also to his hands. Three others suffered minor injuries, including headaches and ringing in the ears.\n———\n10:20 a.m.\nNew York City has reopened its subways amid heightened city-wide security after a man with a pipe bomb strapped to him caused an explosion in an underground passageway in the Times Square area during the morning rush hour.\nMetropolitan Transportation Authority Chairman Joseph Lhota (LOH'-tuh) says trains on the Seventh and Eighth avenue lines were still bypassing the Times Square corridor as the investigation proceeded Monday morning. But he says overall service is back to normal.\nLaw enforcement officials tell The Associated Press that Akayed Ullah was inspired by the Islamic State Group, but apparently had no direct contact with the terrorist group. The officials spoke on condition of anonymity because they were not authorized to speak publicly about the suspect or incident.\nPolice say he attached the device to his body with Velcro and zip ties.\n— By Colleen Long\n———\n10 a.m.\nNew York City police say they are combing through video of the bombing in the subway system.\nThey say the suspect meant to set off the bomb, but it's not clear if he meant to do so in a passageway in the Times Square area where it went off Monday during the morning rush hour.\nTwenty-seven-year-old Akayed Ullah is in police custody. Officials say he sustained burns to his abdomen and hands and cuts after the crude pipe bomb exploded.\nLaw enforcement officials say Ullah was inspired by the Islamic State, but apparently had no direct contact with the terrorist group. The officials spoke on condition of anonymity because they were not authorized to speak publicly about the suspect or incident.\n— By Colleen Long\n———\n9:55 a.m.\nPolice have identified the 27-year-old man who detonated an explosive device strapped to his body in the New York City subway.\nPolice say Akayed Ullah intentionally exploded the crude device in a passageway under Times Square during the morning rush hour Monday. They say he is in custody. They say the device is a crudely-made pipe bomb.\nAuthorities called the incident an attempted terrorist attack. Three others suffered minor injuries, including headaches and ringing in the ears.\nThe suspect had burns on his abdomen and also to his hands.\nLaw enforcement officials say he was inspired by the Islamic State, but had apparently not had any direct contact with the terror group.\n———\n9:45 a.m.\nPolice Commissioner James O'Neill says the device that exploded in the New York City subway was a terror-related incident.\nA 27-year-old man had a crude pipe bomb strapped to him and it went off in a passageway from Seventh and Eighth Avenues near Times Square.\nThree people suffered minor non-life-threatening injuries. The suspect was also injured and was taken into custody.\nMayor Bill de Blasio says the device that exploded in the New York City subway was an attempted terrorist attack. He says it's lucky the suspect didn't achieve his ultimate goals.\nLaw enforcement officials say he was inspired by the Islamic State, but had apparently not had any direct contact with the terror group.\n———\n9:40 a.m.\nA photo published by the New York Post from the scene of the Manhattan subway explosion shows a bearded man crumpled on the ground with his shirt apparently blown off and a police officer holding the man's hands behind his back.\nSoot covers the man's bare midriff.\nThe Fire Department of New York says four people, including the suspect, have been hurt following the pipe bomb explosion at the height of the morning rush hour Monday.\nNone of the injuries are believed to be life-threatening.\nA law enforcement official tells The Associated Press that a man had a pipe bomb strapped to him when it went off. The official spoke on condition of anonymity because they were not authorized to speak on the incident.\n———\n9:30 a.m.\nThe Fire Department of New York says four people, including the suspect, have been hurt following a pipe bomb explosion in a New York City subway at the height of the morning rush hour.\nFire officials say Monday none of the injuries are believed to be life-threatening.\nPolice say the pipe bomb explosion inside the subway happened in an underground passageway between Seventh and Eighth Avenues on 42nd Street.\nA law enforcement official tells The Associated Press that a man had a pipe bomb strapped to him when it went off. The official spoke on condition of anonymity because they were not authorized to speak on the incident.\n———\n9:15 a.m.\nPolice say the pipe bomb explosion inside the New York City subway happened in an underground passageway between Seventh and Eighth Avenues on 42nd Street.\nThe explosion filled the passageway with smoke while it was crowded with throngs of Monday morning commuters.\nA law enforcement official tells The Associated Press that a man had a pipe bomb strapped to him when it went off. The official spoke on condition of anonymity because they were not authorized to speak on the incident.\nThe person was arrested and has non-life-threatening injuries. Another person on the platform sustained non-life-threatening injuries.\nThe Port Authority Bus Terminal, the nation's largest bus hub, was shut down, along with the eight subway lines and all streets around Times Square.\n———\n8:45 a.m.\nA law enforcement official tells The Associated Press that a man had a pipe bomb strapped to him when it went off on a New York City subway platform.\nThe explosion happened around 7:30 a.m. Monday. Details were still developing.\nThe person was arrested and has non-life-threatening injuries. Another person on the platform sustained non-life-threatening injuries\nThe official spoke to The Associated Press on condition of anonymity because they were not authorized to speak publicly about the incident.\nWhite House Press Secretary Sarah Sanders has tweeted that President Trump has been briefed on the explosion.\n———\n8:40 a.m.\nNew Jersey Transit buses headed to the Port Authority Bus Terminal are diverting to other locations following an explosion in New York City.\nNJ Transit says buses are taking passengers to Secaucus and Hoboken. From there, they can take trains or PATH into the city.\nTrains, PATH, light rail and ferries are honoring bus tickets into New York.\nThe explosion happened around 7:30 a.m. Monday. Details were still developing.\nPassengers were evacuated as a precaution from the subway line where the explosion happened, near 40th Street and Eighth Avenue.\nA person was arrested and has non-life-threatening injuries.\n———\n8:25 a.m.\nA law enforcement official says what is believed to be an explosive device has been set off on Manhattan subway platform.\nThe explosion happened around 7:30 a.m. Monday. Details were still developing.\nA person was arrested and has non-life-threatening injuries.\nThere was no immediate word of any other injuries.\nThe official spoke to The Associated Press on condition of anonymity because they were not authorized to speak publicly about the incident.\nPassengers were evacuated as a precaution from the subway line where the explosion happened, near 40th Street and Eighth Avenue.\n— Associated Press writer Colleen Long\n———\n8 a.m.\nThe New York Police Department says it is responding to a report of an explosion near Times Square.\nThe response is centered in the area of the Port Authority bus terminal.\nIt's led to delays along some of the subway lines that pass beneath the bus terminal.\nSome passengers have been evacuated as a precaution.\nThere were no immediate reports of injuries.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: New Jersey increases transit security",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-pipe-bomb-explodes-underground-passageway-51717174"
}