{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:14:55+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Duke hits another roadblock with Coach K forced to sit",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fduke-hits-roadblock-coach-forced-sit%2Fstory%3Fid%3D44514917.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170102_ncf_goodman_krzyzewski_back_surgery_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The top player in the Duke Blue Devils' freshman class missed 11 games with an unexpected preseason knee surgery. Two other wheels in that hot rod of a rookie crew also missed time with injury. With one ill-timed foot-jerk reaction, its Wooden Award candidate earned himself an indefinite ride on the bench and the end of his team captaincy.\nAnd now its Hall of Fame coach is out for up to four weeks.\nStill think Duke gets all the breaks?\nWhat began as a charmed season for the Blue Devils, starting atop the preseason polls thanks to an embarrassing largesse of talent and experience, has devolved into a whirling dervish of chaos in Durham.\nAnd make no mistake this latest injury report --? Mike Krzyzewski will have back surgery to repair a herniated disc on Friday and could miss up to four weeks?--?is the most significant.\nKrzyzewski may not have scored a point or dished an assist in more than four decades but he is the one absence you simply cannot X and O around. No disrespect to Jeff Capel, who will slide over to Krzyzewski's seat and who has been a successful head coach, but you don't simply call up the next guy on the bench to replace your Hall of Fame, 1,000-plus game-winning greatest coach of all time.\nEspecially not now.\nWith Grayson Allen's tripping tendency still a hot-button issue and his punishment still open-ended with the jaws of the ACC season about to open wide, what Duke desperately needs right now is stability. There's not a more reliable visage in college hoops than Krzyzewski's poker face.\nTwelve Final Four appearances, five national titles and three gold medals tend to act like a soothing balm to even the most frenetic teams.\nNot that the Blue Devils are in a tailspin. Truth be told, considering all of the upheaval, their 12-2 record is pretty remarkable.\nBut they are at a critical and potentially vulnerable juncture.The school said Krzyzewski could be out for up to four weeks, which could mean missed dates with three ranked opponents (Louisville, Florida State and Notre Dame) and potentially four road games.\nAnd that's being conservative and sticking strictly to the four-week window. Back injuries, however, can be notoriously tricky and Krzyzewski, who has lived with one for decades, needs to put himself above the team here. He owes it to himself to heal properly.\nBut while he recovers it will fall to Capel to navigate Duke through this tricky period. The Blue Devils are coming off a humbling 14-point loss to Virginia Tech. While it would be easy to pin the loss on the absence of Allen, that would also both discredit the Hokies and overlook the fact that Duke couldn't defend a doorpost. Virginia Tech shot 61 percent from beyond the arc, the Blue Devils' defense so porous Krzyzewski went to a zone.\nThat needs to be fixed -- and quickly. The reality is that the calendar may say January, but for the Blue Devils it's more like mid-November. Earlier this season Krzyzewski said his team could barely hold a normal practice, what with all of the guys out (Allen missed time with a toe injury, too). That the bulk of the injuries have hit unseasoned freshmen doesn't help. As good as they are, Harry Giles, who has played in just three games and Jayson Tatum and Marques Bolden, who have appeared in six apiece, are still working through the learning curve.\nAnd now they've lost their teacher.\nSome would argue that coaches don't score a bucket, don't pull down a rebound and their effect on a team, especially on a well-greased machine of a team such as Duke, is minimal. But there's a reason that Kentucky went from zero to 90 as fast as you can say Billy Gillispie to John Calipari. And there's a reason Syracuse went from 4-5 a year ago under Mike Hopkins to the Final Four once Jim Boeheim returned from suspension.\nAnyone can draw up a play on a whiteboard or shove a practice plan in their hip pocket.\nBut if it were that easy, everyone would be Nick Saban or Bill Belichick.\nOr Mike Krzyzewski.\nIn 1995, Krzyzewski missed the final 19 games of the season, and a 9-3 Blue Devil start was followed by a 4-15 nosedive. After a particularly devastating two-point loss to Maryland, the Duke point guard at the time said, \"When [Krzyzewski} was with us, we felt like we could win those games.'\nThe point guard's name was Jeff Capel.\nNow it's Capel's turn to sub in for his old coach.\nIn a charmed season turned chaotic for Duke this will be the biggest challenge for the Blue Devils yet.",
    "source_domain": "abcnews.go.com",
    "title": "Duke hits another roadblock with Coach K forced to sit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/duke-hits-roadblock-coach-forced-sit/story?id=44514917"
}