{
    "authors": [
        "Abc News",
        "More Benjamin"
    ],
    "date_download": "2017-06-14 23:46:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Members of Congress receive threats following shooting",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fmembers-congress-receive-threats-security-shooting%2Fstory%3Fid%3D48044076.json",
    "image_url": "http://a.abcnews.com/images/US/ap_us_security_04_washington_jc_160322_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The shooting at the Republican congressional baseball team's practice Wednesday in Virginia has reignited a long-simmering debate on Capitol Hill this year about the threats against members and increasing security.\nFor months, Republicans have expressed concerns about safety at town hall events. In February, Rep. Dave Reichert, R-Washington, a former sheriff, briefed House Republicans on safety measures for district offices amid health care protests.\nRep. Al Green, D-Texas, has recently faced death threats after calling for Trump's impeachment on the House floor.\nRep. Andre Carson, D-Ind., one of two Muslim-American members of Congress, told ABC News he \"regularly\" receives death threats.\nBoth Democrats, along with other members, receive local law enforcement protection at home.\nMembers on both sides of the aisle reported a new series of threats today after the shooting – which prompted new debate about whether members need additional security.\nGreen told ABC News that the House Sergeant at Arms and Capitol Police leadership briefed members this morning on security in the closed door session, and questions about adding protection to members in Washington and at home were raised.\n\"There’s an evaluation in terms of what the security needs are,\" Green said.\nSome Democrats reported threatening calls to their offices after the shooting today.\n\"A lot of members are talking about receiving calls in their offices that the ‘Dems are next’,\" Carson told ABC News after the closed-door meeting this afternoon.\nRep. Claudia Tenney, R-New York, received a threatening email this morning after the shooting, where House Majority Whip Steve Scalise, R-Louisiana was injured, according to an aide.\n\"Did you NOT expect this? When you take away ordinary peoples very lives in order to pay off the wealthiest among us, your own lives are forfeit. Certainly, your souls and morality were lost long before. Good Riddance,\" the note reads. Tenney’s office reported the note to Capitol Police.\nRep. Pat Meehan, R-Penn. said the shooting has raised questions about future events - including the upcoming congressional picnic at the White House.\n“You’re going to have members and families and oftentimes there are long lines and you have lines of members of Congress just sitting outside exposed,\" he said.\nRep. Barry Loudermilk, R-Ga., who was at the practice today and tended to Scalise, suggested members should be allowed \"reciprocity\" for concealed carry in Washington.\n\"If this had happened in Georgia, it wouldn’t have gotten too far. I had a staff member in his car, maybe 20 yards behind the shooter pinned in his car, who, back in Georgia, carries a 9 mm in his car,” Loudermilk said. “He had a clear shot.”\nRep. Chris Collins, R-N.Y., told WKBW, an ABC affiliate in Buffalo, New York, that he would also consider carrying a gun in public after today.\n“I have a carry permit. I will be carrying when I’m out and about,” Collins said.",
    "source_domain": "abcnews.go.com",
    "title": "Members of Congress receive threats, consider security following shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/members-congress-receive-threats-security-shooting/story?id=48044076"
}