{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 07:32:07+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "The documentary series \"Tom vs. Time\" follows the quarterback as he balances his personal life with his time on the field.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fscenes-england-patriots-quarterback-tom-brady-52809991.json",
    "image_url": "http://a.abcnews.com/images/Nightline/180203_ntl_tom_brady_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for A behind the scenes look at New England Patriots quarterback Tom Brady\nIn sports the greatest advantage is often the gift of youth. The NBA's freakish next star is just 23. Baseball's biggest hitter, 25. Gymnastic's golden champion, barely 20. But in super bowl LII this weekend, all eyes are on someone who is actually the big 4-0. I think Tom Brady is the greatest football player we've ever had. Love him or hate him no one can deny his accomplishments. Tom Brady is the oldest quarterback ever to start in a super bowl in a sport where the average age 26 and career just 3 years. Brady is a anomaly. In the lead up to the super bowl the notoriously private Brady opens up in the Facebook D orks C U series. Did you win or did you lose that's the story. Tom versus time. I see myself doing it better than I've ever done it so why should I stop. Sharing his mental game. When I get out there going to see my techniques. They're wrauching daddy. His home. What a handsome hubby. Say boom. His family life with super model wife Gisele bundchen. Six or seven of years he is reallyed and I take on 100%, I take the kids to school, I become a lot more present. But exposing his personal life came with a down side after a Boston radio personality was suspended -- after refearing to Brady's daughter. And internet attention on a kiss between Brady and his son is making waves. This series focuses on Brady's fanatical commitment to preparation her alloweding his tb-12 movement which he feels led to his longevity from physical workouts and massages to his unorthodox diet down to special made path ams to help recovery. He found thing that's work for him. I want those path jamas that restore you in the sleep. I do too. Not sure if I feel better in the morning. Not sure I do either but he really truly believes it and wants to share his belief. Playing quarterback for the new England patriots is not a job for Tom Brady it's like what he was put on the planet to do. That seemed unlikely in 2000 when Brady was chosen 199th overall in the NFL draft. He was not physically imposing. Anybody in the patriots who tells you they knew Tom Brady would become most accomplished quarterback ever and future hall of famer ever is lying because if they knew wouldn't have waited until the sixth round to pick him. Didn't have that huge hundred million dollar contract or press conferences, Tom was just one of zbl us. The early 2000 marked the rise of super bowl nation. He said no one has won three in a row. We had just won the super bowl, don't think we even had the parade yet but he was already talking about another. 18-0 record in super bowl 42. Ten years ago Brady's patriots made history going undefeated all the way to the super bowl meeting the New York giants, there he came face to face with Michael Strahan who delivered a devastating sack. Denied by Strahan. What do you remember about that moment. To sack Tom Brady not something many people get to do. It's Tom Brady I'm on the ground with Tom Brady and only person who gets this close it Gisele. Know what I I'm saying. It was really special. I can now say oh, yeah I sack that guy. Strahan is also an executive producer on \"Tom versus time\" and despite that legendary hit he and Brady are now friends. What's Tom like off the field, off camera, you're friends? He's fun. It will be March and he won't drink sometimes, be like I'm not drinking, I'm like why, well, I'm training, but it doesn't stop him from having fun. Because he will literally do 80s karaoke hip hop. Yeah. Didn't the say he was good, by loves it. Ha, ha. But he's a fun guy. He's a good guy. He says he would like to play until his mid 40s now you're 46, could you imagine playing football right now? In the mind, may feel it. But body's not having it I can't imagine it but if anything can do it is him. Deflategate. Deflategate. Following new developments in deflategate. Last season Brady was suspended four games for deflategate. I have no knowledge of anything. No knowledge of any wrongdoing. Brady finds his man. But in the end triumph as Brady orchestrated the greatest come back in super bowl history against the falcons. Patriots win the super bowl! Each year the questions when will the time come to hang up the Jersey. Why's everyone want me to retire so bad. I don't need exterior motivati motivatio motivations, the ones inside me are enough. Brady has defied age in the sport in elite company with the laichs of Roger Federer and Michael Phelps and Serena Williams. People can dislike the patriots how good they've been for how long and dislike Brady for how good he's been, also admire the heck out of them and him because here he is still doing it. His wife Gisele made no bones about him retiring. Oh, she's ready. About eight years can ago she said Michael I want you to talk to my husband. I think she sees the down side of playing for so long. Thinking about issues. Thinking about the concussions are now in the forefront of everybody's mind. She's just looking out for the wife who loves her husband. But ultimately the decision is up to him. How long can he keep it up only Tom knows. I wish I did at 22 years old what I have been doing for last ten years. Create this version of me at 40 that I think is a lot better than when I was 22. He says he's not stopping any time soon. You want to do this until you're 45. Yeah, forever. In the meantime laser focus Brady has eyes only on his opponent on Sunday, the eagles and potential sixth super bowl ring to cement his single legacy. He has a fire inside him that you don't really see in his position all the time but it's in him all the time that's why he'sback in the super bowl because he's pretty much Superman. For new yorom New York.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "A behind the scenes look at New England Patriots quarterback Tom Brady",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/scenes-england-patriots-quarterback-tom-brady-52809991"
}