{
    "authors": [
        "Abc News",
        "Bill Hutchinson",
        "More Chris",
        "More Bill"
    ],
    "date_download": "2018-04-24 21:03:12+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "In a scorched-earth defense strategy, Bill Cosby’s attorneys banked on a backlash to the growing #MeToo movement, describing it Tuesday as a mob mentality.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fbill-cosbys-lawyer-tells-jury-verdict-hinge-metoo%2Fstory%3Fid%3D54689744.json",
    "image_url": "https://s.abcnews.com/images/US/bill-cosby-ap-jef-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In a scorched-earth defense strategy, Bill Cosby’s attorneys banked on a backlash to the growing #MeToo movement, describing it Tuesday as a mob mentality “primarily based on emotion and anger” and comparing the prosecution of the comedian to lynchings, witch hunts and McCarthyism.\n“When you join a movement based primarily on emotion and anger, you don’t change a damned thing,” defense attorney Kathleen Bliss told jurors during a closing argument in a Montgomery County, Pennsylvania, courtroom. “Which is why each single case must be examined on its merits. All of the evidence must be weighed.\"\nShe said the case boils down to whether the jury believes Andrea Constand, Cosby's primary accuser, who testified that he drugged and sexually assaulted her in 2004 at his suburban Pennsylvania home.\nMatt Slocum/AP\n\"The bottom line here is that if you don’t believe Andrea Constand, you must acquit Mr. Cosby,\" Bliss said.\nCosby, 80, is being retried on three felony counts of aggravated indecent assault for allegedly drugging and sexually assaulting Constand, 44, a former director of operations for the women’s basketball team at Temple University, where Cosby was a trustee and major financial donor. His first trial ended in a mistrial in June when a jury failed to reach a verdict.\nThe high-tension courtroom drama began shortly before the jury took their seats around 10 a.m., when Cosby's wife of 54 years, Camille Cosby, entered the courtroom in designer sunglasses and a bright orange kaftan and approached her husband at the defense table.\nMaking her first appearance in court since last year's closing arguments, she gave her husband a kiss and a light embrace as he smiled and whispered in her ear, before taking her seat in the front row.\nDuring the retrial, five additional women shared strikingly similar allegations of being drugged and molested by the entertainer despite the statute of limitations having long run out for potential criminal prosecution in those cases.\nIn a withering indictment of both the #MeToo movement against the abuse and sexual harassment of women and the numerous female witnesses who testified against Cosby, Bliss told jurors that \"questioning an accuser is not shaming a victim.\"\n\"Yes, we do have to deal with sexual assault,\" Bliss said in her summation. \"We do. It's a worldwide problem. But questioning an accuser is not shaming a victim. Gut feelings are not rational decisions. Mob rule is not due process, and just as we have had horrible, horrible crimes in our history, we've also had horrible, horrible periods of time where emotion and hatred and fear overwhelmed us: witch hunts, lynchings, McCarthyism.\"\nBliss took aim at the prosecution's first witness, Dr. Barbara Ziv, an expert on sexual assault, who set the stage for the state's case by testifying that virtually all the challenges to Constand's story can be explained by a cultural misunderstanding in the United States that she described as \"rape myths.\"\n\"Most of what people believe ... about sexual assault is wrong,\" Ziv testified, explaining that statistically, the majority of sexual assault victims do not follow what would seem like rational behavior expected of other types of crime victims.\nZiv said the majority of sexual assault victims fail to make timely reports, are often hazy on details and facts, do not fight back during the assault, often fail to confront their perpetrator, and frequently return to and maintain contact with the perpetrator.\nBliss characterized Ziv's testimony as nonsense.\n\"We are not snowflakes,\" she told jurors. \"We are not delicate flowers, and so this 'rape myth' that someone like Dr. Ziv would ask you to buy into -- where if she says X, it's rape; if she says Y it's rape; if she says Z, it's rape.\n\"As women, we don’t abandon facts or science or truth. As men and women, we reject gossip and speculation and false promises,\" Bliss said.\nIn rebukes of the five additional accusers who took the stand to recount similar claims of being drugged and sexually assaulted by Cosby, Bliss said they were all fabricating stories for attention, money or fame.\nShe said one of the accusers, former model Janice Dickinson, sounded “as though she slept with every man on the planet.”\nShe said the women came forward way too late to be believed.\n\"The cast of five accusers ... talked about what they now claim -- more than 30 years later -- happened to them. How unfair is that? Digging up stuff from three decades ago?\n\"You can believe one of them, all of them, or not believe any of them,\" Bliss continued. \"This case is about Andrea Constand.\"\nDominick Reuter/AFP/Getty Images\nShe also mocked the notion that the over-the-counter antihistamine Benadryl could knock out and incapacitate a person. Cosby told Constand and her mother that is what he gave her prior to the alleged incident, according to his deposition in a civil case Constand filed against him in 2005.\n\"It's Benadryl!\" Bliss declared. \"There is not a scintilla of scientific evidence that would back up the symptoms that are claimed here.\"\nProsecutors suspect but cannot prove that Cosby gave Constand something stronger, and have suggested by highlighting portions of a deposition the comedian gave in 2005 and 2006 that he drugged her with quaaludes, a now-illegal narcotic popular in the 1970s as a party drug with the street name \"disco biscuits.\"\nCosby acknowledged in a 2005 deposition that he carried the drug to give to women with their consent prior to sexual encounters in the 1970s.\nBliss told jurors that they were about to make “one of the most important decisions you're ever going to make in your lives. You're going to decide the fate of Mr. Cosby.\"\nShe added: \"There's no credible, objective, tangible evidence -- no forensic evidence -- to suggest that [Cosby] drugged Ms. Constand.\"\nThe defense team’s closing argument was split between Bliss and lead defense attorney Tom Mesereau, who outlined what he called \"12 lies\" by Andrea Constand, remarking at one point, \"You need pliers to pull the truth out of this woman.\"\nMesereau told the jury that \"you are dealing with a pathological liar.\"\nThe prosecution’s closing arguments will commence this afternoon.",
    "source_domain": "abcnews.go.com",
    "title": "Bill Cosby's lawyer tells jury verdict should not hinge on #MeToo movement",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/bill-cosbys-lawyer-tells-jury-verdict-hinge-metoo/story?id=54689744"
}