{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 22:04:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "ABC News' political team analyzes today's White House press briefing.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fbriefing-room-terror-attack-yorks-times-square-51725393.json",
    "image_url": "http://a.abcnews.com/images/US/171211_vod_briefing_room_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'The Briefing Room': Terror attack near New York's Times Square\nHappy Monday welcomed briefing room coming your life in Washington bureau. While there's got to be sent today where life. Why I don't think I'm getting nowhere where we're under construction here everybody we are actually getting ready for our big election night Gil that we've done means. Every other month lately we've got like chains aren't clear on state I now with the big one. Alabama we are all focused on that we're going to be talking about the right before we leave you but just Catherine and I today for this short condensed version here and and really. For a Monday as somebody said a white hot tents briefing from Sarah Sanders there you'll let's dive right in here because the big focus and he sort. Everybody con thing going back there. Had been. The accusations right we've been talking about it for weeks now that other members a congress. Now it's coming back to the White House and these women who over the years have accused. President trump of sexual misconduct we know that during the campaign there were upwards of a dozen women that came forward. You sort three women go public again this morning the White House being questioned it and then as we go through city. Those have been answered through the election process. Look that's a line that's coming from this White House they sit at the this was litigated during the election I'm only president trump knows what he did or didn't do and the American people decided that right but how long John is outlined. Really going to hold here you see these allegations and from more you know. More women coming out against members of congress and with white mourn Alabama a big topic tomorrow. It all members of his own administration now breaking. With the White House and with the president on as he'll light us line here is that all these women who came out against the president are lying and making really doesn't really. No and that was amazing shoes on CBS's face the nation yesterday. She was asked about the accusations and then basically which he said is it any. Woman that has an accusation against president or anybody for that matter. Think should be heard. She said that they should be heard and she added that we should all be willing to listen to these wanton. A departure from. The president's overreaction the president has been obviously defensive and denied these allegations and I departure from what they've. What the president has been that is saying about when Mars so you saw that Sanders didn't really answer that question when presented with. What Nikki Haley had them she said you know as the president has has said he thinks it's a good thing these women are coming word but it's of trying to have it both ways here ray yeah you know are are their stories. Accurate. And he saw us saving asked there on the as well as the White House line on this that all of these women are lying and Sarah Sanders has also been asked about. Why Morse accusers whom the president cast some doubt on that on Friday is so rarely. You know that's the mind that we're hearing coming out of this White House but these these aren't going away. No and that this is also a topic that we know in any in speaking to White House sources and even doing the scene. No one really wants to dive into this topic for maybe they really want to keep this is far away from the White House is humanly possible but. The moment for the president engaged with Al Franken and question that photo you mile or member before he announced his intentions to leave congress at the end of the year. The White House still headfirst into this battle with that tweet several weeks ago. Right exactly and I know that when frank now additions were coming out some people as you can use stepping inside the White House said. You know I I don't think the president should respond to this because why can he was spotted about one hand and not. On acknowledged the allegations against one more and that's a political learning exactly makes the political right away and and that's the argument here. And the questions about facing everyday and you know it's it's something and the press have answered to and he. Hasn't answered. About Al Franken yet nearly shouted questions at him. The White House really haven't answered many questions and activity believe that this was the right decision right I'm for him for the resigning and what kind of domino effect. Well let's put them Alabama because you have this special election tomorrow the polls are all over the place not put that Fox News poll out today that Verizon Jones up by Tannen I mean other polls had more quickly coming back up being average tuition on line to Sorin 3% right in the margin there are critics that this is a tight one right and the president did not endorse Roy Moore from the beginning he went Luther strange. Who was as most people would say did this seat for picking right. Yeah CA area but but but this is one where now the president is only he is the air he's defending judge Maureen obesity if they're true whatever but he ease their supporting the press. This Kennedy might show what happens here. Hunt or. That's a good quest for but what happens next. He supported or more he just that recorded robocalls parent for a and he said go Roy Moore. He's obviously that he was campaigning in out of ammo they just twenty miles away. Come the from there after his endorsement of more so you know I think we just see how. How it all plays out and you know if more ends up winning Smart and obviously the president is going to have you know answer. More questions on and really how. It will Libyan ethics investigation or what's next here and in our time. What does the president support right that he supports he's at its investigations were fright and Brothers that. You know what's the line here's Larry you know he he's still be facing all sorts of on questions on that still but I think you're pretty Heatley is very hesitant to jump into this at first and their Lyonnais is still that. The president believes if these allegations are true. Roy Moore should step aside at the same time reeling it diving right and is saying boat rowing marred do it we can't afford. To lose a vote on tax of one million immigrants we need. To help make America great again that the lineup robot. Bart we're gonna leave it there is a lot to get to go we wanna remind you tomorrow night you can tune into ABC news right here on FaceBook on dot com on your phones wherever it might be anywhere also missing Dax. Now I got everything our bosses over there so I have to check with him but make sure its union Mary Bruce in the entire political team be leading coverage right here any BC. Beginning at 830 tomorrow night for Catherine folders I'm John San Suu Kyi next time who knows maybe will shop on a sidewalk somewhere they can't find a studio. Have a great day.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'The Briefing Room': Terror attack near New York's Times Square",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/briefing-room-terror-attack-yorks-times-square-51725393"
}