{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 21:53:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Isaiah Thomas expected to play Game 2, then return home to family",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fisaiah-thomas-expected-play-game-return-home-family%2Fstory%3Fid%3D46849614.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170417_nba_stevens_on_thomas_plans_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "WALTHAM, Mass. -- Isaiah Thomas remained with the Boston Celtics on Monday, and coach Brad Stevens said he expects that the All-Star guard will play Tuesday in Game 2 against the Chicago Bulls before traveling to be with his family after the death of his sister.\nThomas scored 33 points in the Celtics' playoff-opening loss Sunday, one day after 22-year-old Chyna Thomas died in a single-car accident on an interstate?in their home state of Washington.\n\"His plan, as of right now -- and, again, subject to him changing if he wants -- is that he'll be here [Tuesday] night and then will go to Tacoma after,\" Stevens said. \"So either after the game [Tuesday] night or Wednesday morning.\"\nThe Celtics have two days off before Game 3 Friday against the Bulls in Chicago.\nStevens said memorial services for Thomas' sister had not been finalized but suggested the entire team would make an effort to attend.\nThe Celtics are doing everything they can to help Thomas navigate this difficult phase, especially while he's on the opposite coast from much of his family.\n\"He's trying his best to compartmentalize when he's here to work on what he needs to work on, but I'm sure that's difficult,\" Stevens said. \"But we were together for some film, some walk-through, and we'll be back together [Tuesday]. I think he's as good as he can be.\"\nAdded Stevens: \"It's really tough when he's sitting there, and some of his family's back in Seattle, and some of them came here to mourn with him. I think the next extension of your family is who you're around every day, your team, and so these guys are really terrific teammates. They care about one another and they support one another. Obviously, that's what you'd hope you have in a team. It's probably not always the case.\"\nThomas has leaned heavily on teammate Avery Bradley, a fellow Tacoma native, in recent days.\n\"Me and Isaiah have known each other since we were kids, since we were 11, 12 years old. So we're just family,\" Bradley said. \"And no matter what goes on, we're always going to have each other's back. We're always going to be there for one another. And I think he knows that and I know the same about him.\n\"We're always going to support each other. Not to say our teammates aren't going to support us as well, but we're family so it's different. I'm going to be there for him no matter what.\"\nBradley found inspiration in the way Thomas performed in Game 1.\n\"It takes a lot of [guts] for somebody to go through that and still be able to come out and perform at a high level,\" Bradley said. \"Even though he wasn't screaming or the usual Isaiah, he still went out there and fought hard. And it made us want to fight harder for him. We just made some mistakes that are fixable and we'll have a chance to do it [in Game 2].\"",
    "source_domain": "abcnews.go.com",
    "title": "Isaiah Thomas expected to play Game 2, then return home to family",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/isaiah-thomas-expected-play-game-return-home-family/story?id=46849614"
}