{
    "authors": [
        "Abc News",
        "Lesley Messer",
        "More Andrea",
        "More Lesley"
    ],
    "date_download": "2018-05-31 00:30:30+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Lamar is reportedly the first non-classical or jazz artist to receive the honor.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fkendrick-lamar-accepts-beautiful-pulitzer-prize-music%2Fstory%3Fid%3D55546462.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/kendrick-lamar-01-as-ap-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The announcement was made some time ago, but on Wednesday, Kendrick Lamar attended a ceremony at New York City's Columbia University to accept his Pulitzer Prize for music for his 2017 album \"DAMN.\"\nThe 30-year-old is the first rapper to receive the award.\nIn addition to the recognition, Lamar will take home a $15,000 prize.\n\"It's an honor,\" he said on the official livestream of the event. \"I've been writing my whole life, so to get this type of recognition -- it's beautiful.\"\nBebeto Matthews/AP Photo\nLast month, when it was announced that Lamar had been chosen as the winner of the Pulitzer Prize for music, the judging committee gushed that \"DAMN.\" was \"a virtuosic song collection unified by its vernacular authenticity and rhythmic dynamism that offers affecting vignettes capturing the complexity of modern African-American life.\" Earlier in the year, it won five Grammys, though Lamar lost the coveted album of the year award to Bruno Mars.\n\"My musicality has been driving me since I was 4 years old. It's just pieces of me, man, and how I execute it is the ultimate challenge,\" Lamar told Rolling Stone last year of the album. \"Going from [his previous album] 'To Pimp a Butterfly' to 'DAMN.,' that s--- could have crashed and burned if it wasn't executed right. So I had to be real careful on my subject matter and how I weave in and out of the topics, where it still organically feels like me.\"",
    "source_domain": "abcnews.go.com",
    "title": "Kendrick Lamar accepts 'beautiful' Pulitzer Prize",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/kendrick-lamar-accepts-beautiful-pulitzer-prize-music/story?id=55546462"
}