{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:21:31+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The Latest: Workers rush repairs at dam as storm approaches",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-workers-rush-repairs-dam-storm-approaches-45510123.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_f350ea4edb924b2084dc81d0ac1f114f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on problems with an emergency spillway at the nation's tallest dam (all times local):\n7:25 a.m.\nThe Oroville Reservoir is continuing to drain as state water officials scrambled to reduce the lake's level ahead of impending storms.\nThe Los Angeles Times reports (http://lat.ms/2lKMK5I) that the reservoir was down 20 feet since it reached capacity on Sunday when it overflowed and sparked an evacuation order for nearly 200,000 people south of the dam.\nOfficials say the lake is draining at 100,000 cubic feet per second, reducing the reservoir about a foot every three hours. The Department of Water Resources wants to drop the reservoir's level 50 feet overall by Sunday.\nForecasts call for 2-4 inches of rain and snow in the foothills and mountains starting Wednesday night or early Thursday. But the storm was looking colder than initially projected, meaning less rain and less runoff than last week's storms.\n—————\n12:30 a.m.\nThe stress of evacuation and an uncertain future were enough for Donald Azevedo and his family to opt to stay a few more nights in an emergency shelter rather than risk having to do it all again.\nThe family was among the nearly 200,000 Californians who live downstream from the country's tallest dam who were told they could return home but warned they may have to flee again if repairs made to the battered Oroville Dam spillways don't hold.\nThe fixes could be put to their first test later this week with the first of a series of small storms forecast for the region expected to reach the area Wednesday night.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Workers rush repairs at dam as storm approaches",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-workers-rush-repairs-dam-storm-approaches-45510123"
}