{
    "authors": [
        "Abc News",
        "More Conor"
    ],
    "date_download": "2018-04-24 22:35:45+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Iran has repeatedly ruled out any \"new\" agreement.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-macrons-iran-deal-analysis%2Fstory%3Fid%3D54703023.json",
    "image_url": "https://s.abcnews.com/images/Politics/trump-macron-press-conference-gty-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump started his day with French President Emmanuel Macron bashing the Iran nuclear deal as \"insane\" and \"ridiculous,\" but hours later at a joint press conference, both leaders floated the idea of a \"new\" Iran deal.\nInterested in Iran? Add Iran as an interest to stay up to date on the latest Iran news, video, and analysis from ABC News. Add Interest\nWhile Tehran has repeatedly ruled out any new agreement, it is possible that after months of negotiations, Trump and Macron have come that much closer to a side agreement between the U.S. and European signatories to the nuclear deal.\n\"The discussions we've had together make it possible to open the way, to pave the way for a new agreement,\" Macron said during their press conference, adding that this proposed agreement would tackle Iran's nuclear activity in the short and long term, its ballistic missile program, and its influence in Syria, Yemen, Lebanon, and Iraq.\n\"I think we will have a great shot at doing a much bigger maybe-deal, maybe-not-deal,\" Trump added. \"We're going to find out, but we'll know fairly soon.\"\nIs some sort of grand deal in the works? It's unclear. But so far, the U.S. has only been hammering out an agreement with German, French, and British diplomats to find fixes to what Trump sees as the Iran deal's flaws ahead of a self-imposed May 12 deadline – or else Trump will let sanctions snap back against Iran and possibly destroy the deal.\nTRUMP'S DEMANDS FOR THE DEAL\nThe clock has been ticking towards that May 12 deadline after Trump waived sanctions in January. He warned that this – his fourth extension of the deal – would be the last unless European allies worked with the U.S. to fix those deficiencies. The next sanctions waivers will have to be signed May 12, or else certain sanctions automatically snap back.\n\"Either fix the deal’s disastrous flaws, or the United States will withdraw,\" Trump said in a statement at the time. \"This is a last chance.\"\nIn particular, he demanded that European allies agree to sanctions on Iran's ballistic missile program, ramping up inspections of all Iranian sites, and eliminating expiration dates for the limits on Iran's enrichment levels.\n\"In the absence of such an agreement, the United States will not again waive sanctions in order to stay in the Iran nuclear deal. And if at any time I judge that such an agreement is not within reach, I will withdraw from the deal immediately,\" Trump said. \"No one should doubt my word.\"\nWHERE TALKS WITH EUROPEANS STAND\nSince that announcement, French, German, and British diplomats have been meeting with a State Department team to negotiate that side agreement.\nLed by the State Department's policy planning director Brian Hook, the U.S. team has met the Europeans on three occasions and held more discussions via teleconference, according to the State Department.\nA senior State Department official told reporters Sunday that it's still \"too early to tell\" if they will be able to reach an agreement. Both sides have said there is consensus on ballistic missiles and inspections, but they are stuck on the expiration dates – what are sometimes known as \"sunset clauses.\"\nThis kind of side agreement would face another hurdle -- the European Union. Although a high-level European Union representative has been attending their meetings as an observer, according to a State Department official, the parties may have to turn around after they reach consensus and then try to get EU-wide support for it. Only if all member countries agree can EU sanctions move forward, and Italy, in particular, is reportedly still skeptical.\nBut even if the Europeans and U.S. parties come together, it's unclear whether Trump will accept their progress as enough. On Sunday, the senior official would only say, \"The President will be presented with a range of options so that he can make a decision.\"\nWHAT COULD HAPPEN NEXT\n\"Nobody knows what I'm going to do on the 12th,\" Trump said Tuesday. \"Although, Mr. President, you have a pretty good idea,\" he added to Macron, just moments after the French president said, \"I do not know what President Trump will decide regarding the JCPOA.\" JCPOA is an acronym for the deal's formal name, the Joint Comprehensive Plan of Action.\nWhile the goal of the side agreement would be to contain Iran's \"malign\" activities but keep the Iran nuclear deal in place, Trump actually seemed interested in getting rid of the old deal entirely because of its \"decayed foundation\": \"It's a bad deal. It's a bad structure. It's falling down.\"\nIn its ashes, he seems to expect a new deal would arise: \"We'll see also, if I do what some people expect, whether or not it will be possible to do a new deal with solid foundations.\"\nHOW IRAN MAY RESPOND\nBut the Iranians have long said there will be no new deal.\n\"You reach an agreement, you keep that agreement, you implement that agreement. You don't ask for more,\" Iranian Foreign Minister Javad Zarif told National Public Radio's Steve Inskeep Tuesday, accusing the U.S. of violating its side of the deal.\nIran may restart its nuclear program if the U.S. withdraws, Zarif said Sunday, telling CBS News, \"Obviously the rest of the world cannot ask us to unilaterally and one-sidedly implement a deal that has already been broken.\" But Iran will never pursue a nuclear weapon, he added.\nIran's President Hassan Rouhani had even tougher words, warning Tuesday of \"severe consequences\" if the U.S. withdraws.\n\"I am telling those in the White House that if they do not live up to their commitments, the Iranian government will firmly react,\" Rouhani said in a speech broadcast live on state television.",
    "source_domain": "abcnews.go.com",
    "title": "What Trump and Macron's 'new' Iran deal could look like: ANALYSIS",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-macrons-iran-deal-analysis/story?id=54703023"
}