{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 20:16:07+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcourt-filing-claims-education-dept-illegally-ssn-data-53857578.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_c91597ba405c466fa61d352363228e8c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A group of former students defrauded by for-profit colleges is claiming in court that the Education Department illegally obtained and used their Social Security data to limit their student loan relief.\nThe Education Department announced in December that it will start granting some former students at the now-defunct Corinthian Colleges only partial federal student loan forgiveness in part to save taxpayers' money. The agency said it will use students' earnings data to determine how much of their loans to forgive.\nSome students have already received noticed from the department they will see only 50 percent or less of their loan wiped out, the Associated Press reported last week.\nBut a motion filed by several former Corinthian students over the weekend claims that the agency had obtained the figures from the Social Security Administration in violation of several laws as well as the Constitution. Attorneys with the Project on Predatory Student Lending at Harvard University representing the students say the agency should have turned to the students for their data as well as notified them of its actions in order to give them a chance to react.\nThe department \"has secretly and illegally coopted Social Security data to try to argue for something less than the complete cancellation and refund that these borrowers are due,\" said attorney Joshua Rovenger.\nThe motion, filed in federal court in California, is asking that the notices of partial relief be rescinded. The filing is part of a larger suit against the department.\nThe Education Department declined to comment on pending litigation.\nThe Social Security Administration did not return requests for comment.\nThe Obama administration went hard after for-profit colleges accused of fraud, closing down Corinthian and other major chains and tightening regulations for those schools. The administration also spent $550 million to fully forgive student loans for tens of thousands of students.\nEducation Secretary Betsy DeVos has set out to overhaul the sector. She says the Obama regulations were unfair and is writing new ones. She says her new system of partial loan forgiveness will be fairer to students and taxpayers.\nTens of thousands more students are currently waiting for the agency to decide their cases.",
    "source_domain": "abcnews.go.com",
    "title": "Court filing claims Education Dept illegally got SSN data",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/court-filing-claims-education-dept-illegally-ssn-data-53857578"
}