{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 21:14:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fflorida-governor-signs-major-bill-combat-opioid-epidemic-53857925.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_d373fc1dc92b40bfb289c2efc7be8213_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Gov. Rick Scott on Monday signed Florida's opioid legislation into law, a move seen by many as a good first step in combating a crisis that has claimed at least 16 lives a day in the Sunshine State.\n\"What it does take is a pretty comprehensive approach to addressing the epidemic,\" said Mark Fontaine, Executive Director for the Florida Alcohol and Drug Abuse Association. \"It has education programs and helps control the measures for availability.\"\nThe legislation includes tougher limits on most painkiller prescriptions, more money for treatment programs and requirements for physicians to check the state's prescription database. The Republican governor and the state Legislature had made passing opioid legislation a priority of the recently concluded session.\nOpioid-related deaths across Florida have jumped 35 percent from 2015 to 2016, according to the Florida Department of Law Enforcement. Opioids were identified as either the cause of death or were present in the deceased person's body in 5,725 cases in 2016. The 2017 figures are still being compiled.\n\"I don't think anyone wakes up in the morning with the goal of becoming an addict. This will make a big difference in reducing the number of addicts,\" said Scott, who signed the bill at the Manatee County Sheriff's Office in Bradenton.\nManatee County suffered the highest ratio of deaths in Florida in 2016 from fentanyl analogs — synthetic versions of fentanyl that can be 5,000 times more lethal than heroin.\nHouse speaker Richard Corcoran, who attended the signing, said the measure is one of the first in Florida that attempts to combat the opioids crisis at the front end by limiting supplies and by doctors' checks on the prescription database.\nThe new laws, which take effect July 1, also contains some of the nation's toughest mandates on initial prescriptions for Schedule II painkillers such as Oxycontin and Fentanyl. The initial limit would be three days, but doctors could prescribe up to seven days for acute pain exceptions. It does not place medication limits for trauma cases, chronic pain, cancer and terminal illnesses.\nFlorida is the 25th state since 2016 that has passed legislation that imposes some limits or guidelines on opioid prescriptions. Only two others — Kentucky and Minnesota — have statutory limits of three or four days.\nFraser Cobbe, who represents the Florida Orthopedic Society, said doctors would have liked to see the limit extended to 10 days for surgeries not related to traumatic injuries, like hip and other joint replacements.\n\"The concern is major surgery was not addressed or focused on the human element,\" Cobbe said.\nCobbe said his organization is putting most of its focus on informing members about the new regulations with checking the state's prescription database as well as the requirements for doctors to complete a 2-hour continuing education course on responsibly prescribing opioids.\nThe state's Prescription Drug Monitoring Program will receive a software upgrade that should make it easier to integrate into a patient's medical file as well as making it easier to track medication history nationwide — a move designed to prevent someone near state lines from trying to doctor shop for multiple prescriptions.\nThere are some critics though who think the $65 million in the state budget signed by Scott last Friday does not go far enough in properly funding law enforcement and treatment programs.\nDemocratic gubernatorial candidate Gwen Graham said in a statement that Scott and the Legislature must join other five other states in suing drug manufacturers and hold them more accountable.\nScott's signing came hours before President Donald Trump spoke Monday in New Hampshire about federal steps to combat opioid addiction. Florida Attorney General Pam Bondi was a member of the president's opioid commission.",
    "source_domain": "abcnews.go.com",
    "title": "Florida governor signs major bill to combat opioid epidemic",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/florida-governor-signs-major-bill-combat-opioid-epidemic-53857925"
}