{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 05:04:09+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fpoll-seniors-ready-skype-docs-worry-care-quality-55552073.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_5976d266008f493b8a5aee35bd3bec9e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Every morning, 92-year-old Sidney Kramer wraps a blood pressure cuff around his arm and steps on a scale, and readings of his heart health beam to a team of nurses — and to his daughter's smartphone — miles from his Maryland home.\nRed flags? A nurse immediately calls, a form of telemedicine that is helping Kramer live independently by keeping his congestive heart failure under tight control.\n\"It's reassuring both psychologically and physically. The way he's put it to me, it's like having a doctor appointment every morning,\" said Miriam Dubin, Kramer's daughter.\nThe vast majority of older Americans and their caregivers are ready to give virtual health care a try: Nearly 9 in 10 adults age 40 and over would be comfortable using at least one type of telemedicine for themselves or an aging loved one, says a new poll from The Associated Press-NORC Center for Public Affairs Research.\nBut they want to make sure that an e-visit or other remote care is just as good as they'd get in person, and that their health information stays private, according to the survey released Thursday.\nLong considered an option mainly for improving access to health care in rural areas with few doctors, telemedicine is gaining ground with tech-savvy younger consumers — they text their physician with questions or Skype with a mild complaint. For seniors with chronic illnesses or mobility problems that make simply reaching a doctor's office an ordeal, telehealth could be more than a convenience. The graying population is raising serious questions about how the nation will provide enough quality long-term care.\nBut while private insurance often covers a video visit or other digital health care, seniors have had a harder time because Medicare tightly restricts what it will pay for.\nThat's starting to change, with a law Congress passed last winter that expands Medicare coverage for such options as video visits to diagnose stroke symptoms or check on home dialysis patients. Also, Medicare Advantage programs used by a third of beneficiaries can start offering additional telehealth options.\n\"While the interest is huge, one of the big barriers remains reimbursement,\" said Johns Hopkins University telemedicine chief Dr. Ingrid Zimmer-Galler, who has turned to grants to help fund such services as telepsychiatry for dementia patients. The new law \"is really a huge step in the right direction. It certainly doesn't cover everything.\"\nCosts are a major issue for people who need ongoing living assistance. Less than a third of adults age 40 and over have set aside any money for their future long term care needs, the AP-NORC survey shows, and more than half mistakenly think they'll be able to rely on Medicare to help cover nursing care or home health aides.\nTelemedicine will have to replace in-person care, not add to it, to help with those costs, cautioned Zimmer-Galler.\nAs access for seniors promises to grow, the AP-NORC Center poll shows widespread interest in telehealth. More than half of adults of all ages would be comfortable with a video visit via Skype or FaceTime to discuss medications, for ongoing care of a chronic illness or even for an urgent health concern.\nIn fact, adults 40 and older are just as open to at least some forms of telemedicine as those under 40, with one exception: The older crowd is slightly less comfortable discussing health care by text.\nAmong caregivers, 87 percent say they'd be interested in using at least one form of telemedicine for that person's medical needs.\n\"I think the parents would be happier at home instead of being in the doctor's office waiting an hour to see a doctor for 15 minutes,\" said Don Withey of Courtland, New York, who helps his 92-year-old father and 89-year-old mother get to their appointments. But, \"we don't know much more about it other than the fact you can talk to a doctor over the computer or smartphone.\"\nJust 12 percent of adults say they wouldn't use any form of telemedicine.\nThere are concerns. More than 30 percent of people worry about privacy or the security or health information. About half fear that telemedicine could lead to lower-quality care, the poll found.\n\"It's not about having a video screen or Skype in the home or even a blood pressure cuff in the home. It's about the team that's behind it and the clinicians who are supporting the care of that patient,\" said Rachel DeSantis, chief of staff at Johns Hopkins Home Care Group, which provides the 92-year-old Kramer's remote monitoring.\nThe Hopkins program provides no-cost monitoring for a month or two to select high-risk patients after a hospitalization because research found it reduces their chances of readmission.\nWhen the monitor recorded Kramer's weight creeping up one week, nurses immediately knew it was fluid build-up, a heart failure symptom that needed quick treatment. The machine is programmed for some educational feedback, too.\nDubin says her dad learned quickly when to cut back. \"If he enjoys a pastrami sandwich one day, he can see his numbers may be higher the next day.\"\nDubin says the reassurance was worth privately paying, about $250 a month, to keep the monitoring once Kramer's initial time in the program ended.\n———\nThe survey was conducted March 13 to April 5 by The Associated Press-NORC Center for Public Affairs Research, with funding from the SCAN Foundation.\nIt involved interviews in English and Spanish with 1,945 adults, including 1,522 adults age 40 and over, who are members of NORC's probability-based AmeriSpeak panel, which is designed to be representative of the U.S. population. Results from the full survey have a margin of sampling error of plus or minus 3.3 percentage points.\n———\nOnline:\nAP-NORC long term care polls: http://www.longtermcarepoll.org/",
    "source_domain": "abcnews.go.com",
    "title": "Poll: Seniors ready to Skype docs, worry about care quality",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Technology/wireStory/poll-seniors-ready-skype-docs-worry-care-quality-55552073"
}