{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:17:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Hot or Not: Washington's Kuznetsov tops under-24 rankings, while Winnipeg's Laine stumbles",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fhot-washingtons-kuznetsov-tops-24-rankings-winnipegs-laine%2Fstory%3Fid%3D45507592.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r177141_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Here's our weekly look at the fortunes of some of the game's brightest young stars ages 24 and under.\nHot\nEvgeny Kuznetsov, C, Washington Capitals\nThe Caps are cooking, having won 11 in a row at home. They've scored at least five goals in 10 of those games, opening up space at the top of the Metropolitan Division standings. Any discussion about Washington's ability to finally break through in the postseason has to focus on the 24-year-old Kuznetsov, who struggled during the playoffs last year and got off to a slow start this season. But Kuznetsov has been terrific of late, with five goals and four assists in his past seven games. The 26th overall pick in 2010 has points in 11 of his past 13 games.\nMikko Rantanen, RW, Colorado Avalanche\nThere hasn't been much to smile about in Denver this season, as the Avs look destined to finish dead last in the league. But let's give credit where it's due: Colorado has played solid hockey of late and it must give management solace to see Rantanen, 20, getting into a groove with four goals -- one a winner -- ?and two assists in his past five games. The 10th overall pick in 2015 is one of few untouchables on an Avalanche roster that could see serious turnover before the March 1 trade deadline.\nSeth Jones, D, Columbus Blue Jackets\nThe Blue Jackets have the fourth-best winning percentage in the NHL and remain very much in the hunt for home-ice advantage in the playoffs -- and who thought back in September we'd be saying that? Columbus is fifth in goals allowed per game and Jones remains an integral cog to the team's defensive scheme, leading all Blue Jackets with 23:36 in average ice time per game. He has also picked up the offensive pace, with three goals -- including a winner -- and three assists in his past six games.\nNot\nPatrik Laine, RW, Winnipeg Jets\nAn interesting storyline came out of Winnipeg earlier this week when head coach Paul Maurice demoted Laine to the fourth line after a couple of giveaways that ultimately led to a? Minnesota Wild?victory against the Jets. Laine is still second in the league in rookie scoring, with 23 goals, and in spite of going pointless in his past two games, he had points in eight straight games before. Still, we'll see how Laine responds to tough love as the Jets try to stay in the playoff hunt.\nAlex Galchenyuk, C, Montreal Canadiens\nAfter missing more than a month with a recurring knee injury, it's been slow going for Galchenyuk, a talented 22-year-old whom the Habs drafted with the No. 3 pick in 2012. Before netting the overtime winner in Arizona on Thursday, Galchenyuk had just five points in his previous nine games -- and three of those came in one game. He was not a plus player in any of his past 10 games. If the Habs are going to be the Stanley Cup threat some believe them to be, Galchenyuk needs to return the early-season form that propelled him into a No. 1 center role with the Atlantic-Division leading Canadiens.\nSam Reinhart, C/RW, Buffalo Sabres\nAfter a stretch that saw the 21-year-old Reinhart record points in seven of 10 games, sometimes playing the wing with center Jack Eichel, the 2014 second overall pick's production tailed off. Reinhart has just two goals and six points in his past 14 games. The Sabres are quickly sinking beneath the playoff surface and will need their offense to kick into gear if they're going to return to relevance in the Eastern Conference. The talented sophomore will be a big part of that process.\nYoung guns showdown\nNick Schmaltz, LW, Chicago Blackhawks versus Leon Draisaitl, RW/C? Edmonton Oilers\nAt Edmonton, Saturday, Feb. 11\nSchmaltz isn't necessarily a household name, but the 20-year-old has been playing on the Blackhawks' top line with red-hot Jonathan Toews and Marian Hossa?-- and, after a stint in the minors, he appears ready to embrace the opportunity. Meanwhile, Draisaitl, a natural center, has been a revelation this season, with 20 goals and 27 assists. The 21-year-old has been skating on the right side with Patrick Maroon and a guy named Connor McDavid, and together they've posed?a special kind of threat to opposing teams.",
    "source_domain": "abcnews.go.com",
    "title": "Hot or Not: Washington's Kuznetsov tops under-24 rankings, while Winnipeg's Laine stumbles",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/hot-washingtons-kuznetsov-tops-24-rankings-winnipegs-laine/story?id=45507592"
}