{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 06:36:56+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Rodgers-Manning Headlines NFL's Wild-Card Weekend",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Frodgers-manning-headlines-nfls-wild-card-weekend-44507532.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/rodgers-manning-headlines-nfls-wild-card-weekend-44507532",
    "language": "en",
    "localpath": null,
    "maintext": "Aaron Rodgers vs. Eli Manning will headline the NFL's wild-card weekend.\nRodgers tossed four touchdown passes to help the Green Bay Packers capture the NFC North title with a 31-24 victory over the Detroit Lions on Sunday night. The Packers (10-6) will host the Giants (11-5) next Sunday while the Lions (9-7) visit Seattle (10-5-1) on Saturday night.\nNew York's 19-10 win at Washington eliminated the Redskins (8-7-1) and allowed the Packers and Lions to secure playoff spots before their game kicked off. But the teams are heading in opposite directions. The Packers have won six in a row while the Lions lost three straight.\nEarlier in the day, Matt Ryan and the Atlanta Falcons (11-5) secured a first-round bye with a 38-32 win over New Orleans. The Seahawks beat San Francisco 25-23 and earned the No. 3 seed.\nThe Cowboys (13-3) already locked up the NFC's No. 1 seed before they played last week.\nIn the AFC, Tom Brady and the Patriots (14-2) beat Miami 35-14 to secure the No. 1 seed and home-field advantage throughout the playoffs. The Chiefs (12-4) clinched a first-round bye thanks to Denver's win over Oakland coupled with their victory over San Diego.\nThe Raiders (12-4) fell from No. 2 to the fifth spot and will open the playoffs on the road at Houston (9-7). That matchup could feature rookie quarterback Connor Cook making his first career start for the Raiders after they lost Derek Carr last week and backup Matt McGloin went down in the second quarter against the Broncos.\nThe Texans also have uncertainty at quarterback. Tom Savage sustained a concussion in a loss at Tennessee and was replaced by former starter Brock Osweiler.\nThe Steelers (11-5) will host the Dolphins (10-6) in the AFC's other wild-card game.\nHere's a look at the playoff teams by seed:\nAFC\n1. NEW ENGLAND PATRIOTS: Brady and coach Bill Belichick will begin their quest for a fifth Super Bowl championship against either Houston, Oakland or Miami on Jan. 14 at 8:15 p.m.\n2. KANSAS CITY CHIEFS: Coach Andy Reid is 3-0 in divisional playoff games when his team has a bye. All three wins came with the Eagles. The Chiefs open against Pittsburgh, Houston or Oakland on Jan. 15 at 1:05 p.m.\n3. PITTSBURGH STEELERS: Ben Roethlisberger, Le'Veon Bell and Antonio Brown had an early bye. They sat out an overtime win over Cleveland in preparation for the Dolphins next Sunday at 1:05 p.m.\n4. HOUSTON TEXANS: They need to sort out their quarterback issues before the Raiders visit next Saturday at 4:35 p.m. Oakland beat Houston 27-20 in Mexico City on Nov. 21.\n5. OAKLAND RAIDERS: Carr's season-ending injury deflated a team making its first playoff appearance since losing the 2003 Super Bowl to Tampa Bay.\n6. MIAMI DOLPHINS: It's unknown whether QB Ryan Tannehill will return from injury when the Dolphins play their first playoff game in eight years. Matt Moore was 2-1 in Tannehill's absence.\nNFC\n1. DALLAS COWBOYS: Dak Prescott only played two series and Ezekiel Elliott sat out a loss at Philadelphia to get ready for the playoffs. The Cowboys will open against Green Bay, New York or Detroit on Jan. 15 at 4:40 p.m.\n2. ATLANTA FALCONS: They will host Seattle, Green Bay or New York on Jan. 14 at 4:35 p.m.\n3. SEATTLE SEAHAWKS: Russell Wilson and the Seahawks start their drive for a third NFC championship title in four seasons against the Lions next Saturday at 8:15 p.m.\n4. GREEN BAY PACKERS: Rodgers has the Packers riding high into the playoffs. They were a No. 6 seed in 2010 when the last won a Super Bowl. Green Bay plays the Giants in this season's final wild-card game next Sunday at 4:40 p.m.\n5. NEW YORK GIANTS: Were locked into the No. 5 seed, but Manning played the entire game and the Giants knocked out the Redskins. Manning has won two playoff games at Lambeau Field, beating Brett Favre and the Packers in a frigid NFC championship game following the 2007 season.\n6. DETROIT LIONS: Wilson, Richard Sherman and The 12s stand in the way of Detroit's first playoff win since the 1991 season.\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL\n———\nFollow Rob Maaddi on Twitter: https://twitter.com/AP—RobMaaddi",
    "source_domain": "abcnews.go.com",
    "title": "Rodgers-Manning Headlines NFL's Wild-Card Weekend",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/rodgers-manning-headlines-nfls-wild-card-weekend-44507532"
}