{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:32:03+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The executive producer of \"Roseanne\" reportedly said writers had just started working on the next season.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Froseanne-barr-defense-show-cancellation-im-racist-55547353.json",
    "image_url": "https://s.abcnews.com/images/WNT/180530_wn_gutman3_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Roseanne Barr on the defense after show cancellation: 'I'm not a racist'\nto have you with us here O a Wednesday night. And we begin with the firestorm sunding Roseanne Barr. Today, bming her words on ambien. The making of ambien was not having it D there were other tweets the stress, whose show been canceled by ABC, taking aim at some of H costars. Tonight,hat the president is now tweeting,n the wf the Roseanne ar and the white house wasssed on why, in his own tweet, the president did not dress what Roseanne today. ABC's Matt gutma leading us of again GHT. Reporter: Fewer than 24 hours after Roseanne Barr's racist eet that led to her show being canceled -- hat's up,deplorable? Reporter: -- Comparing presid Obama's former top aide on an ape, roads Anne was back otter. Now blaming thweet on ambien. \"Is 2:00 in the morning and S ambien tweeting. I went too far tonight, the makf ambien firing back. \"W all pharmaceutical tments have side effects, racism is not a known side effect.\" Today, even after trying blame ambien - After my night time meds kick in, I'm L dead until 7:00 A.M. Reporter: -- Roseanne thenretweeted an image of a character from \" of the apes\" wialerie Jarrett's image next to it.night, president trumpo lebrated Roseanne before -- Look atroseanne, I called her yesterday. Lo at her rati look at her ratings. Repor -- has so far not tweeting about Disney CEO iger, the head of ABC's parent company, after iger caljarrett personally to Apolo for Roseanne's racist tweet. And this morning, the president tweeting, \"H N Calle president Donald. Trump to apologize for the horrible stents made and said about me on maybe I just didn't get the call?\" Ignori Roseanne's words completely. When pressed ois today, E white house first complned of a double standard, before eventually sg no one I defeseanne. The president is simply calling out the media bias, no one efending wt she said. Reporter: Roseanne firiff Moren 200 tweets since losing her show, and vowin to leave twitter.en turning ome of her costars. Writing to actor Michael fi W called he tweet \"Repible,\" \"You throw me under the bus, nice.\" And to Sara T, who called the comment \"Abhorrent,\" she replied, \"Wow, unreal.\"'s been all over the map with it. I wish she H just said, I'm sorry, or, like, youknow, Valerie Jarrett said, this could be a learning moment. Reporter: And tonight, the executive producer of the show, David Caplan, telling \"The Hollywood reporter and the writers had justurned to work on the next season. Was their first day back. Stunned oseanne's tweet. And now many of them out of a job. Even so, when asked their reaction, Caplan said, \"The reactias universal disgust.\" Adding, \"We were horrified by it and we also knew it meant for the show.\" When it came to racism, \"There was noger any way to accept what she was saying.\" GHT, Roseanne Ng, \"I feel B for POTUS. He goes through this every ngle day.\" And even today, as she retweeted that \"Planetthe apes\" image next to Valerie Jarrett, Roseanne Barr still insisting she's no bigot. \"I'm not a racist, I never was and I nevell be.\" And Matt Gutman back with us GHT. And Matt, as you point out, Roseanne Barr lashing out on Twitter. The writers,roducers in the meantime haveexpressed disappment, because original mission of the show, and why it was a meback hit, has now been lost in all Thi Reporter: That's right, David. As Roseanne's message TD from con Trilt to combative, E cast arew who worked onhow that we have spo with S that what is most crushing to T is that the showing the plight of mid class families across America. Th now fear that that has been lostamidst all ofs controversy. David? M Gutman leading us off again tonight. Matt, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Roseanne Barr on the defense after show cancellation: 'I'm not a racist'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/WNT/video/roseanne-barr-defense-show-cancellation-im-racist-55547353"
}