{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:11:04+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Protection Sought for New Mexico Park's Geothermal Deposits",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fprotection-sought-mexico-parks-geothermal-deposits-44514762.json",
    "image_url": "http://abcnews.go.com/US/wireStory/protection-sought-mexico-parks-geothermal-deposits-44514762",
    "language": "en",
    "localpath": null,
    "maintext": "Underground pockets of boiling water and steam in a northern New Mexico national preserve that represent the heart of an ancient collapsed volcano could get extra federal protection under a new effort by the National Park Service aimed at limiting or preventing tapping the geothermal energy from neighboring land.\nFederal officials said last week that the Valles Caldera National Preserve would become the 17th U.S. park unit with designated thermal features if approved. A monthlong public comment period will end Jan. 26.\nYellowstone, Crater Lake and Hawaii Volcanoes already are on the list of parks with federally protected geothermal features.\nDubbed the \"Yellowstone of the Southwest,\" Valles Calderas is home to vast grasslands, the remnants of one of North America's few super volcanoes and one of New Mexico's most famous elk herds. The bear-claw shaped ring of mountain peaks that form the caldera also is culturally significant to neighboring Native American tribes.\nIts visible geothermal features are nowhere near as striking as Yellowstone's geysers and consist mainly of above-ground, pungent smelling sulphur springs.\nThe nearly 140-square-mile preserve was purchased by the federal government in 2000 and managed as a working ranch for years. The Park Service took over preserve management in 2015.\nThe last privately-owned mineral rights within the preserve were taken over by the federal government about a decade ago to protect against geothermal development within Valles Caldera's boundaries.\nPark officials said the proposed designation would address geothermal development just outside the preserve's boundaries by requiring federal agencies to work with the Park Service to determine if proposed drilling to tap adjacent geothermal resources would adversely affect the preserve's geothermal reserves.\nThe idea of tapping the steam beneath the preserve dates back decades, with the energy crisis of the 1970s spurring the first major wave of interest in the nation's geothermal resources .\nThe U.S. Department of Energy, Union Oil Co. and Public Service Co. of New Mexico spent millions of dollars looking into the feasibility of developing a geothermal power plant on what was then private property. The idea was ultimately abandoned in the 1980s.\nExperts have said the caldera is still hot enough to produce steam and could generate electricity if harnessed.\nIn 2005, Texas-based GeoProducts — which owned the last of the private rights — threatened that unless the government agreed to what the mineral rights owners believed was a fair market price, the company would build a full-scale geothermal power plant in the southwest corner of the preserve, along with transmission lines to export the electricity.\nLater that year, then-President George Bush signed legislation aimed at settling the dispute over the mineral rights. Government lawyers followed up with a condemnation lawsuit that gave the government control over the mineral rights needed to tap the park's geothermal reserves.\nInterest in New Mexico's geothermal resources has increased again recently as the state works to wean itself from fossil fuels and boost renewable energy development.\nIn 2012, Gov. Susana Martinez signed legislation to ease the process for companies trying to develop geothermal resources.\nMore recently, another effort to encourage geothermal development happened when regulatory authority was shifted from the state's Oil Conservation Division to the Energy Conservation and Management Division.\nThe state's first utility-scale geothermal power plant opened in 2014 in southern New Mexico and supplies power to Public Service Co. of New Mexico, the state's largest electricity utility.",
    "source_domain": "abcnews.go.com",
    "title": "Protection Sought for New Mexico Park's Geothermal Deposits",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/protection-sought-mexico-parks-geothermal-deposits-44514762"
}