{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 11:53:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "UN temporarily pausing aid to eastern Mosul due to security",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fbriefly-pauses-aid-iraqs-mosul-amid-security-concerns-45504915.json",
    "image_url": "http://abcnews.go.com/International/wireStory/briefly-pauses-aid-iraqs-mosul-amid-security-concerns-45504915",
    "language": "en",
    "localpath": null,
    "maintext": "The United Nations announced on Wednesday it was temporarily pausing aid operations to neighborhoods in the eastern half of the Iraqi city of Mosul as attacks by the Islamic State group continue to inflict heavy civilian casualties there.\nLise Grande, the U.N. Humanitarian Coordinator for Iraq, said U.N. agencies \"made the decision that until security improves, it will be difficult for us to provide assistance.\" She spoke during a visit to a camp for Iraqis displaced from Mosul on Wednesday.\nWhile Mosul's eastern half was declared \"fully liberated\" last month, and a semblance of normalcy returned to many areas with schools, shops and restaurants reopening, some neighborhoods continue to be hit by insurgent and counterattacks claimed by IS.\nThe Islamic State group is still firmly in control of the western half of the city, across the Tigris River that roughly splits Iraq's second-largest city into two sections.\nThe pause in U.N. aide comes as Iraqi forces are moving into positions ahead of an anticipated assault on Mosul's western half that is still firmly under IS control.\n\"We have every confidence that the authorities will provide security, as soon as it improves, the United Nations agencies will be there to deliver assistance,\" Grande added.\nA recently reopened restaurant in an eastern Mosul neighborhood was hit by a suicide bombing claimed by IS on Friday that killed four people. A clinic in Mosul's Zahra neighborhood said it will continue to receive dozens of injured civilians every day from mortar and IS drone attacks.\nMuch of Mosul's east is still within range of mortar attacks from IS-held neighborhood on the western bank of the Tigris.\nThe humanitarian situation in Mosul's liberated neighborhoods is also critical. Thousands of residents lack access to drinking water and fuel for cooking and heating.\nThe announcement from the U.N. comes as Iraqi forces are moving into position ahead of an anticipated assault on Mosul's western half in what's expected to be the final, decisive battle to free the entire city of IS militants.",
    "source_domain": "abcnews.go.com",
    "title": "UN temporarily pausing aid to eastern Mosul due to security",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/briefly-pauses-aid-iraqs-mosul-amid-security-concerns-45504915"
}