{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 12:39:49+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Nadal in Australia, Still Aiming to Contend for Major Titles",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fnadal-australia-aiming-contend-major-titles-44509338.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/nadal-australia-aiming-contend-major-titles-44509338",
    "language": "en",
    "localpath": null,
    "maintext": "Rafael Nadal cuddled a koala on the banks of the river, something that has become a customary photo opportunity for celebrity players on debut at the Brisbane International.\nThe 14-time major winner has altered his preparation for the Australian Open, hoping a change of venues for the warmup tournaments will bring a change of luck at the season's first Grand Slam tournament after a shocking first-round exit in 2016.\nNadal kicked off his season with a win in an exhibition tournament in Abu Dhabi on New Year's Eve, then headed directly to Australia to fine-tune at the Brisbane International in preference to remaining in the Gulf for the event in Doha.\n\"I played well in Abu Dhabi ... I played three good matches, and that's important for me,\" Nadal said Monday after the brief meet-and-greet with a local politician and a native marsupial. \"I really hope the good matches I played in Abu Dhabi helps me for here.\"\nThe 30-year-old Spaniard is playing in Brisbane for the first time, replacing Roger Federer as the tournament's male draw card. He has a tricky opener against Alexandr Dolgopolov and, if he gets through that, a potential quarterfinal against top-seeded Milos Raonic, the defending champion.\nNadal is coming off a left wrist injury that curtailed his 2016 season, and thinks the extra time in Australia will help him prepare to win his first major title since the 2014 French Open.\nUntil last year, he had reached the quarterfinals or better at every Australian Open he had contested since 2007, including victory in '09 and runs to the final in 2012 and '14.\nThe wrist injury last year forced Nadal to withdraw from the French Open before the third round and skip Wimbledon. He won the Olympic doubles gold medal for Spain in Rio de Janeiro, but he struggled with the pain and didn't win a title on a surface other than clay in 2016.\n\"Last year that I was playing great, I get injured in the worst moment possible,\" he said. \"I'm happy to be back on the competition again. Abu Dhabi was a good start. I need to continue that way.\"\nDespite his struggles with injury and the recent dominance of Andy Murray and Novak Djokovic, Nadal thinks he can still contend for the Grand Slam titles.\n\"Being here in Brisbane is good news for me,\" he said, two weeks before the Australian Open starts. \"I don't know if that's going to help me or not — I can tell you after Melbourne, I cannot predict the future.\n\"The only thing I can say is if I am healthy, I believe that I can do it. If not, I (would) be at home fishing.\"",
    "source_domain": "abcnews.go.com",
    "title": "Nadal in Australia, Still Aiming to Contend for Major Titles",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/nadal-australia-aiming-contend-major-titles-44509338"
}