{
    "authors": [
        "Abc News",
        "More Erin"
    ],
    "date_download": "2017-04-18 00:57:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Two people en route to their wedding told ABC affiliate KHOU that United kicked them off a flight to Costa Rica after they moved to different seats.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTravel%2Fdao-video-houston-couple-complains-booted-en-route%2Fstory%3Fid%3D46845403.json",
    "image_url": "http://a.abcnews.com/images/Video/GTY-united-airlines-appletv-ml-170411_31x13_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In the wake of one of United Airlines' biggest PR fiascoes — a video of a bloodied passenger yanked from his seat that quickly went viral — other United customers are complaining about alleged mistreatment by the airline.\nTwo people from Utah en route to their wedding on Saturday told ABC affiliate KHOU that United kicked them off a flight to Costa Rica after they moved up a few rows to avoid disturbing a man they said was sleeping in their assigned seats. The couple, Michael Hohl and Amber Maxwell, said the incident took place on United Airlines Flight 1737 between Houston and Liberia, Costa Rica.\n\"They said it was not their problem. Their words exactly — not their problem,\" Hohl said. \"Life goes on, but the way United handled this was absolutely absurd.\"\nAccording to Hohl and a statement United provided to ABC News, the incident began when the two, who purchased seats in economy class, moved to upgraded seating. The two moved from a standard row in the economy cabin to economy-plus seats, which have a few extra inches of legroom. What happened when crew members noticed that the two had changed their seats is a matter of dispute.\nHohl said he and his fiancee offered to pay for the upgraded seating. United said the passengers were \"offered the opportunity to pay the difference in fare\" but \"declined\" to do so.\nHe said the two eventually moved back to their assigned row, while the airline contends they refused to follow crew member instructions to return to the seats they purchased.\nHohl said they were escorted off the aircraft by federal air marshals, but United and the TSA, which runs the air marshal service, denies that marshals or any other law enforcement personnel were involved.\n\"We're disappointed anytime a customer has an experience that doesn't measure up to their expectations,\" United said in a statement. The airline added that it offered Hohl and Maxwell a discounted hotel rate and rebooked them on a flight the next day.\nHohl warned, \"They're going to start losing money if they keep treating their patrons like this.\"\nThe high-profile video of David Dao, the passenger bumped off the flight and dragged down the aisle last week — as well as other incidents that have come to light since then — have struck a chord with consumers. In the immediate aftermath of the Dao video, United stock dipped.\nIn a statement on Monday, United CEO Oscar Munoz called the Dao incident \"a humbling experience\" and said it would \"prove to be a watershed moment\" for the company.\nThe incident puts the airline in a particularly precarious position when it comes to dealing with aggrieved passengers.\nImmediately dismissing customers' concerns could put United at risk of being called tone-deaf — an accusation leveled against Munoz after he initially defended his employees and accused Dao of being \"disruptive and belligerent.\"\n(He later said on ABC's \"Good Morning America\" that his initial response failed to communicate \"what we were feeling ... shame and embarrassment.\" He apologized publicly to Dao, saying, \"No one should be treated that way, period.\")\nHowever, as ABC's legal analyst Dan Abrams pointed out, quickly settling lawsuits with passengers could encourage more of them.",
    "source_domain": "abcnews.go.com",
    "title": "After Dao video, passengers complain of being booted en route to their wedding",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Travel/dao-video-houston-couple-complains-booted-en-route/story?id=46845403"
}