{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:57:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "The Latest: WH officials say Trump won't fire Rosenstein",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Flatest-trump-accuses-fbi-doj-favoring-dems-52789113.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_79b98e76bd174a438bf4602ecf88af1f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on President Donald Trump and the FBI (all times local):\n5:20 p.m.\nTwo White House officials say President Donald Trump is not considering firing Deputy Attorney General Rod Rosenstein.\nEarlier Friday, Trump declined to express confidence in the Justice Department's second-in-command.\nThe officials say there is no consideration or expectation for Rosenstein to leave the job. They were not authorized to discuss internal deliberations publicly and spoke on condition of anonymity.\nTrump cleared the way — over Rosenstein's objection — for the release of a GOP memo that alleges misconduct by the Justice Department and the FBI.\nRosenstein oversees special counsel Robert Mueller, and has been a growing target for the president's frustration with Mueller's ongoing probe into potential collusion by Trump affiliates with Russian nationals during the 2016 presidential campaign.\n— Zeke Miller\n——\n4 p.m.\nVice President Mike Pence is giving no hint of the controversy engrossing Washington as he campaigns for a congressional candidate in Pennsylvania.\nPence is urging supporters to \"have faith\" in President Donald Trump and other elected leaders \"who are out there standing with the president.\"\nBut the vice president isn't mentioning the ongoing investigation of the Trump campaign's ties to Russia. He is saying nothing about a House Intelligence Committee memo intended to cast doubt on the FBI's inquiry.\nRepublican lawmakers on Friday released a memo they wrote alleging surveillance abuses at the FBI. Trump declassified the memo earlier Friday.\nPence is in the Pittsburgh area Friday to tout Republican congressional candidate Rick Saccone and to highlight the tax overhaul Trump signed in December.\n——\n2:45 p.m.\nAttorney General Jeff Sessions says he'll make sure Congress' concerns are examined about the FBI investigation into possible cooperation between Russia and the Trump campaign.\nSessions issued a statement Friday after Republican lawmakers released a memo they wrote alleging surveillance abuses at the FBI. President Donald Trump declassified the memo earlier Friday.\nSessions says he will \"forward to appropriate DOJ components all information I receive from Congress regarding this.\" Sessions did not elaborate, but the Justice Department's inspector general is tasked with investigating employee misconduct.\nSessions says he has faith in department employees but that \"no department is perfect.\" He says he'is \"determined that we will fully and fairly ascertain the truth.\"\nSessions has recused himself from the Russia probe, citing his own ties to Trump's campaign.\n———\n2:30 p.m.\nThe White House says a newly released GOP memo raises \"serious concerns\" about the Department of Justice and the FBI's handling of the Russia investigation.\nPress secretary Sarah Sanders sent out a statement saying, \"The memorandum raises serious concerns about the integrity of decisions made at the highest levels of the Department of Justice and the FBI to use the Government's most intrusive surveillance tools against American citizens.\"\nTrump allowed the memo to be released over the objections of the FBI and Justice Department.\nWhile she's critical of the FBI's leadership, Sanders says President Donald Trump \"is especially grateful to the hardworking rank-and-file public servants\" at the agencies.\nSanders says the White House \"stands ready\" to work with Congress to consider allowing the release of a memo prepared by Democrats on the House Intelligence Committee.\n———\n2:10 p.m.\nFormer FBI Director James Comey says a newly released Republican-written memo doesn't add up to much.\nComey asks on Twitter, \"That's it?\"\nHe calls the memo \"dishonest and misleading\" and not worth the damage it's done to public trust in U.S. intelligence agencies.\nThe memo was declassified by President Donald Trump and released Friday by House Republicans. It claims the FBI abused its surveillance powers in the Russia investigation.\nTrump fired Comey last May.\nThe White House initially said the firing was due to Comey's handling of the investigation into Democrat Hillary Clinton's email. But Trump later indicated it was about the FBI's Russia probe.\nSpecial counsel Robert Mueller has been scrutinizing Comey's firing as he investigates possible obstruction of justice.\n———\n2 p.m.\nThe top Democrat on the Senate Intelligence Committee is challenging the accuracy of a memo released Friday by House Republicans.\nPresident Donald Trump declassified the memo Friday, and Republicans released it in an effort to prove surveillance abuses at the FBI.\nVirginia Sen. Mark Warner says he read the classified documents that formed the basis for the memo, and \"they simply do not support its conclusions.\"\nOnly two members of the House intelligence panel, one Republican and one Democrat, have read those underlying documents.\nWarner says the act of declassifying information could make it harder for the intelligence committees to conduct oversight and could endanger Americans overseas.\nNorth Carolina Republican Sen. Richard Burr chairs the Senate Intelligence Committee. A spokeswoman says he's not commenting comment on the memo.\n———\n1:20 p.m.\nHouse Democrats are angry about the release of a classified GOP memo intended to show surveillance abuses at the FBI. They say it's an underhanded effort to protect President Donald Trump and discredit the investigations into Russian election meddling.\nDemocrats on the House intelligence panel had tried to block the memo's release. They say it mischaracterizes the motivations behind a 2016 surveillance warrant on Trump campaign official Carter Page.\nThey also criticized House Intelligence Committee Chairman Devin Nunes for not having read the classified material that formed the basis for the memo.\nHouse Democratic Leader Nancy Pelosi says that by disclosing classified information, Trump had \"sent his friend Putin a bouquet.\" She's referring to Russian President Vladimir Putin.\nDemocrats on the House Judiciary committee said House Republicans are \"accomplices\" to obstruction of justice.\n———\n12:50 p.m.\nAttorney General Jeff Sessions is defending his deputy in the face of criticism from the president.\nSessions broke from prepared remarks in a speech Friday on human trafficking. He praised Deputy Attorney General Rod Rosenstein (ROH'-zen-styn) as well as the department's No. 3 official, Rachel Brand.\nSessions says both are experienced lawyers and \"represent the kind of quality and leadership that we want in the department.\"\nThat's a departure from President Donald Trump, who was asked Friday whether he has confidence in Rosenstein. Trump said, \"You figure that one out.\"\nThe criticism stems from a newly declassified GOP memo alleging the FBI abused surveillance powers in its investigation into possible cooperation between Russia and the Trump campaign.\nTrump said, \"A lot of people should be ashamed of themselves.\"\n———\n12:45 p.m.\nThe White House says President Donald Trump declassified the controversial GOP memo alleging FBI impropriety because the public interest outweighs any classification concerns.\nThe White House counsel says in a letter, \"In light of the significant public interest in the memorandum, the President has authorized the declassification of the Memorandum.\"\nThe FBI and Department of Justice both opposed the memo's release, and the FBI says it has \"grave concerns\" about the memo's accuracy.\n———\n12:40 p.m.\nHouse Intelligence Committee Republicans say they found \"serious violations of the public trust\" by intelligence and law enforcement agencies investigating Russian interference in the 2016 campaign.\nThat's according to committee chairman Devin Nunes (NOO'-nehs). The California Republican sent out a statement after his committee released a controversial memo detailing what he says are abuses of power at the FBI and Department of Justice.\nNunes says he hopes the release \"will shine a light on this alarming series of events\" and spur \"reforms that allow the American people to have full faith and confidence in their governing institutions.\"\nThe FBI had warned against releasing the memo. Democrats say the allegations are made solely to discredit the investigation.\n———\n12:25 p.m.\nThe Republican-led House Intelligence Committee has released a memo based on classified information that alleges the FBI abused U.S. government surveillance powers in its investigation into Russian election interference.\nPresident Donald Trump cleared the way for publication of the controversial memo despite objections from the FBI. The four-page memo was drafted by Republicans on the committee chaired by Rep. Devin Nunes of California.\nThe FBI, Justice Department and Democrats have furiously lobbied Trump to stop the release. They say it could harm national security and mislead the public. Republicans on the committee have said they believe they've uncovered serious misconduct that needs to be made public.\n———\n12:02 p.m.\nPresident Donald Trump says a newly declassified GOP memo alleging FBI abuses shows, \"A lot of people should be ashamed of themselves.\"\nTrump tells reporters Friday: \"The memo was sent to Congress, it was declassified. Congress will do whatever they're going to do. But I think it's a disgrace what's happened in our country.\"\nTrump's decision to declassify the memo clears the way for the public release of the document. The memo was prepared by Republicans on the House Intelligence Committee based on classified information and alleges the FBI abused U.S. government surveillance powers in its investigation into Russian election interference.\nThe FBI says it has \"grave concerns\" about the memo's accuracy.\n———\n11:55 a.m.\nThe White House says it has declassified a GOP-authored memo on the Russia probe. That clears the way for the House Intelligence Committee to release the document, which is based on classified information and alleges the FBI abused U.S. government surveillance powers in its investigation into Russian election interference.\nPrincipal Deputy Press Secretary Raj Shah says President Donald Trump cleared the way for publication of the controversial memo, despite objections from the FBI. The four-page memo was drafted by Republicans on the committee chaired by Rep. Devin Nunes of California.\nThe FBI, Justice Department and Democrats have furiously lobbied Trump to stop the release. They say it could harm national security and mislead the public. Republicans on the committee have said they believe they've uncovered serious misconduct that needs to be made public.\n———\n7:12 a.m.\nPresident Donald Trump is lashing out at Democrats, as he criticizes the FBI over the investigation of potential ties between Russia and his 2016 campaign.\nTrump tweeted a quote from the head of the conservative group Judicial Watch Friday morning.\nHe tweeted: \"'You had Hillary Clinton and the Democratic Party try to hide the fact that they gave money to GPS Fusion to create a Dossier which was used by their allies in the Obama Administration to convince a Court misleadingly, by all accounts, to spy on the Trump Team.' Tom Fitton, JW\"\nFitton appeared on \"Fox and Friends\" Friday.\nTrump is expected to clear the way for the publication of a classified memo on the Russia investigation that Republicans say shows improper use of surveillance by the FBI.\n———\n6:45 a.m.\nPresident Donald Trump is accusing the FBI and Justice Department of playing politics \"in favor of Democrats and against Republicans.\"\nTrump tweets: \"The top Leadership and Investigators of the FBI and the Justice Department have politicized the sacred investigative process in favor of Democrats and against Republicans - something which would have been unthinkable just a short time ago. Rank & File are great people!\"\nWhite House officials say President Donald Trump will allow the publication of a classified memo prepared by Republicans accusing the FBI of abusive surveillance tactics in the Russia investigation.\nThe memo is said to allege FBI misconduct in the initial stages of its investigation of potential ties between Russia and Trump's 2016 campaign.\n————\n12:19 a.m.\nWhite House officials say President Donald Trump will clear the way for the publication of a classified memo on the Russia investigation.\nThe memo, prepared by Republicans on the House intelligence committee, is said to allege FBI misconduct in the initial stages of its investigation of potential ties between Russia and Trump's 2016 campaign.\nTrump's Justice Department furiously lobbied Trump to stop the release, saying it could harm national security and mislead the public.\nA White House official said Congress would probably be informed of the decision Friday. A second official said Trump was likely to declassify the congressional memo but the precise method for making it public was still being figured out. The officials were not authorized to be quoted about private deliberations and spoke on condition of anonymity.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: WH officials say Trump won't fire Rosenstein",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/latest-trump-accuses-fbi-doj-favoring-dems-52789113"
}