{
    "authors": [
        "Abc News",
        "More Allan"
    ],
    "date_download": "2018-07-04 15:59:52+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Sure, you've got Miley Cyrus' \"Party in the U.S.A.,\" but what about these?",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fpatriotic-songs-forgotten-july-playlist%2Fstory%3Fid%3D56363612.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/u2-band-gty-thg-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Fourth of July is a time to get away from the hustle and bustle of everyday life to enjoy barbecues, fireworks, and time with friends.\nBut the question of what to play at your Independence Day celebration can be a tricky one.\nYou may have already added songs like Miley Cyrus' \"Party in the U.S.A.,\" Katy Perry's \"Firework,\" or the Guess Who classic \"American Woman\" to your playlist. Or perhaps you've taken a more current route and are listening to Childish Gambino's new anthem, \"This Is America,\" or Sting and Shaggy's \"Dreaming in the U.S.A.\" Still, to help you round things out, here are a few patriotic numbers you may have forgotten to help you celebrate the holiday.\n“America” – Simon & Garfunkel (1968) This anthem, taken from the album “Bookends,” perfectly captures a couple trying to find themselves in the midst of a journey. Its classic, soaring melody creates a sense of open-ended optimism.\n“American Girls” – Counting Crows (2002) Taken from 2002’s “Hard Candy,” this is easily Counting Crows’ bounciest and most glee-filled single. Sheryl Crow’s background vocals further add to this song’s beach-ready brightness.\n“American Soul” U2 Featuring Kendrick Lamar (2017) This is U2’s rallying cry to the country featuring a sermon-like intro from Kendrick Lamar.\n“Bleed American” – Jimmy Eat World (2001) This thunderous alt-rock classic is a hard-hitting anthem to the American work ethic. Perhaps it contains a touch of menace, but it will get the party started.\n“4th of July, Asbury Park (Sandy)” – Bruce Springsteen (1973) This is one of Springsteen’s best tracks, anchored by a strong sense of lyrical detail and thick with romanticism. You can almost feel the boardwalk breeze as you listen.\n“American Baby” – The Dave Matthews Band (2005) This song is full of emotional tension and tight orchestration. Perhaps it is more intense than bright, but it sounds downright cinematic in its approach.\n“Kids in America” Kim Wilde (1981) A synth-pop anthem to youthful boredom, this hit from Kim Wilde became essential listening in the early '80s. Blending a danceable beat and a seething punk attitude this song (in either version) still packs a punch.\n“Firecracker” Ryan Adams (2001) Taken from his alt-country classic, “Gold,” this Dylan-esque workout has a strong Americana core as Adams pleads, “I just want to be your firecracker,” using the imagery as a metaphor for unabashed passion.\n“American Girl” Tom Petty & the Heartbreakers (1976) All you have to do is hear the first few seconds of the guitar riff and you’ll no doubt be filled with a sense of youthful enthusiasm. Few songs are this iconic.",
    "source_domain": "abcnews.go.com",
    "title": "9 patriotic songs you may have forgotten for your July 4 playlist",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/patriotic-songs-forgotten-july-playlist/story?id=56363612"
}