{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 05:37:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "New Zealand space launch scrubbed from remote launch site",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fzealand-space-launch-scrubbed-remote-launch-site-51732095.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_4671e4487e1343a59fdc692e80d83fed_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A space launch was scrubbed Tuesday from a remote launch site in New Zealand after an engine glitch caused engineers to abort the flight.\nThe command to abort came two seconds after the engine of the Rocket Lab Electron rocket fired on its launch pad at Mahia Peninsula on North Island's east coast.\nThere was no immediate explanation for the launch attempt being called off, although mission control said the problem had been reported as the engine built toward liftoff .\nIn a tweet, Rocket Lab said the launch of the rocket nicknamed \"'Still Testing' (was) scrubbed for the day while team reviews data.\"\nIt said in a statement that the weather is not favorable for a launch on Wednesday, so a new launch would be attempted \"no earlier than\" Thursday afternoon.\nThe 23-meter (75-foot) rocket had three satellites on board for Tuesday's launch, each about the size of a shoebox.\nFounded by New Zealander Peter Beck, the company last May reached space with its first test launch, only to abort the mission when a communication glitch occurred.\nRocket Lab has official approval to conduct three test launches and sees an emerging market in delivering lots of small devices, some not much bigger than a smartphone, into low Earth orbit.\nThe satellites would be used for everything from monitoring crops to providing internet service.\nThe company hopes to begin commercial launches next year and eventually launch one rocket every week.",
    "source_domain": "abcnews.go.com",
    "title": "New Zealand space launch scrubbed from remote launch site",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/zealand-space-launch-scrubbed-remote-launch-site-51732095"
}