{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:27:38+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Father of three daughters not punished for trying to attack Larry Nassar in court",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ffather-daughters-punished-attack-larry-nassar-court%2Fstory%3Fid%3D52806236.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180202_father_tries_to_attack_nassar896_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CHARLOTTE, Mich. -- A father who had to be restrained by law enforcement officers after attempting to physically attack convicted sexual predator Larry Nassar during a sentencing hearing earlier Friday will not be punished for contempt of court, a judge said.\nRandall Margraves rushed at Nassar in an Eaton County courtroom after two of Margraves' three daughters provided impact statements outlining how the former doctor sexually assaulted them.?The third gave her statement in an Ingham County courthouse in late January.\nMargraves reached a table where Nassar and two of his attorneys were seated before he was tackled by a host of law enforcement officers in the courtroom.\n\"Give me one minute with that bastard,\" Margraves said as Nassar was taken from the room.\nAfter his two daughters spoke Friday morning, Margraves asked Judge Janice Cunningham whether \"a distraught father\" could address the court. He asked the judge, as part of her sentencing, to \"grant me five minutes in a locked room with this demon.\" The judge said she could not do that.\nMargraves then asked for one minute alone with Nassar. When the judge told him that wasn't possible, he told her that he would have to take his time in the courtroom.\nMargraves then rushed at Nassar, who sat in an orange jumpsuit, shackled at the ankles.\nNassar and his attorneys were escorted from the courtroom while officers subdued Margraves.\nAs officers led Margraves from the courtroom, he yelled that others haven't had to live with what he has. It's unclear to whom he was directing his comments.\nImpact statements resumed in the courtroom after a roughly 30-minute break.\nMargraves, after spending time in a holding cell for the remainder of Friday morning's impact statements, later appeared before Cunningham and apologized for his actions.\n\"I'm not here to upstage my daughters,\" Margraves told the judge. \"I'm here to help them heal.\"\nHe said he didn't know what his daughters would say during their impact statements and lost control of his emotions when he saw Nassar shaking his head, as if to disagree with part of the statements.\n\"I cannot tolerate or condone vigilantism or any type of action that comes down to an eye for an eye, tooth for a tooth,\" Cunningham told Margraves. \"... No way this court is going to issue any type of punishment, considering the circumstances.\"\nAfter Margraves was first taken away from the courtroom after attempting to get to Nassar, Cunningham addressed the courtroom, apologizing to the gallery for having to \"experience\" the incident.\n\"My heart started beating fast and my legs felt shaky because of that quick eruption of violence,\" Cunningham told the courtroom. \"... To have watched the pain and suffering that loved ones have gone through is unimaginable. If it is hard and difficult for me to hear what his daughters have to say, I can't imagine what it is like for a parent.\n\"No one is making any excuses for what the defendant did in this case. However, these are legal proceedings, and the criminal justice system is doing what it's supposed to do.\"\nNassar was sentenced to up to 175 years in state prison for seven counts of first-degree criminal sexual conduct in the first of his two sentencing hearings last week. This hearing is to decide his sentence for three other counts of criminal sexual conduct.\nFriday's incident was the first attempt to physically harm Nassar.\nMore than 250 women have filed police reports saying that Nassar sexually abused them. Most of them say Nassar used his authority as a well-respected sports doctor at Michigan State University and USA Gymnastics to sexually abuse girls and young women.\nAssistant attorney general Angela Povilaitis addressed the gallery of women and their families waiting to provide impact statements Friday. Roughly 190 impact statements have been submitted in the two courtrooms so far this month.\n\"This is letting him have power over us,\" Povilaitis said to others in the courtroom. \"We cannot behave like this. I understand Mr. Margraves' frustration, but you can't do this.\"\nCunningham will sentence Nassar for his crimes in Eaton County on Monday after his attorneys and the prosecution present closing arguments. Nassar will have a chance to address the court before he speaks; he is not required to say anything.\nImpact statements came to an end Friday afternoon. In two different counties over the course of nine days in court, 204 different individuals provided statements. Several others submitted statements for the judges' consideration that were not read in court.",
    "source_domain": "abcnews.go.com",
    "title": "Father of three daughters not punished for trying to attack Larry Nassar in court",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/father-daughters-punished-attack-larry-nassar-court/story?id=52806236"
}