{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:52:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Ex-leader of northern Chinese province sentenced for graft",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fleader-northern-chinese-province-sentenced-graft-45501660.json",
    "image_url": "http://abcnews.go.com/International/wireStory/leader-northern-chinese-province-sentenced-graft-45501660",
    "language": "en",
    "localpath": null,
    "maintext": "The former Communist Party chief of the major northern Chinese province of Hebei has been sentenced to 15 years in prison on corruption charges, a court announced Wednesday, as President Xi Jinping's anti-graft campaign continues to claim high-profile targets.\nIn handing down the sentence to Zhou Benshun, the Intermediate People's Court in the southeastern port city of Xiamen said he had been given relatively lenient treatment in return for cooperating with investigators and handing over the proceeds of his corruption.\nIt said Zhou, 64, abused his position for personal gain while serving as the top official in the province just outside Beijing and in lower level jobs between 2000 and 2015. He and his relatives had scooped up a total of more than 40 million yuan ($5.8 million) in bribes and kickbacks resulting from real estate and construction deals, safety approvals, bank loans and work promotions, the court said.\nAlong with turning over his ill-gotten gains, Zhou had 2 million yuan ($300,000) of his personal assets confiscated and handed over to the state treasury. He had been placed under investigation in July 2015 and expelled from the ruling party shortly afterward.\nXi has vowed to end corruption and government waste, although critics have accused him on occasion of using the campaign to attack political rivals.\nThousands of officeholders have been investigated as part of the drive, which has brought down a pair of high-ranking generals, a former member of the party's all-powerful Politburo Standing Committee, and a number of other high-ranking local and central government officials.",
    "source_domain": "abcnews.go.com",
    "title": "Ex-leader of northern Chinese province sentenced for graft",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/leader-northern-chinese-province-sentenced-graft-45501660"
}