{
    "authors": [
        "Abc News",
        "More Elizabeth"
    ],
    "date_download": "2017-08-14 17:45:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Iranian drone buzzes US aircraft over Persian Gulf",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Firanian-drone-buzzes-us-aircraft-persian-gulf%2Fstory%3Fid%3D49209499.json",
    "image_url": "http://abcnews.go.com/International/iranian-drone-buzzes-us-aircraft-persian-gulf/story?id=49209499",
    "language": "en",
    "localpath": null,
    "maintext": "An Iranian drone came within 1,000 feet of U.S. aircraft during fixed-wing flight operations on the USS Nimitz in the Persian Gulf Sunday, officials said.\nThe U.S. Navy characterized the approach of the Iranian drone as \"unsafe and unprofessional,\" adding that the drone failed to use navigation lights at night, which \"created a dangerous situation with the potential for collision.\"\nThe drone \"made several passes in close proximity to Nimitz and its escort ships during active flight operations, coming within 1,000 feet of U.S. aircraft\" and was unresponsive to repeated radio calls to establish communications, the Navy said in a statement today. - This is the 14th unsafe and/or unprofessional interaction between U.S. and Iranian maritime forces in 2017.\nAn Iranian drone came within 100 feet of a U.S. Navy F/A-18 fighter jet last week that was waiting to land on the Nimitz aircraft carrier in the Persian Gulf.\nThat jet was in a holding pattern about 1,000 feet above the Nimitz when the unarmed drone performed an \"unsafe and unprofessional altitude change\" in its vicinity, a U.S. official said. The Iranian drone came 100 feet underneath and 200 feet horizontally from the U.S. jet, the official said.\nSimilar to Sunday's incident, the drone did not respond to warnings in the form of radio calls, prompting the jet to maneuver to avoid a collision, a second official told ABC News last week.",
    "source_domain": "abcnews.go.com",
    "title": "Iranian drone buzzes US aircraft over Persian Gulf",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/iranian-drone-buzzes-us-aircraft-persian-gulf/story?id=49209499"
}