{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:41:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "\"The View\" co-hosts discuss several incidents on United Airlines in the past week, including the controversial treatment of David Dao.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTravel%2Fvideo%2Funited-airlines-suffers-public-relations-crisis-46846391.json",
    "image_url": "http://a.abcnews.com/images/Travel/170417_view_united0_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for United Airlines suffers a public relations crisis\nWell yeah requested that I don't even know I'm just going belly up as a united Arab his 1010. Now and nest. I can't. I think he conduct by apple wantonly removing the passenger David Dow was actually end up owning united airline yeah. And done that contaminant has seen hard fine while video last to Angela. Just give me give me that he knew I had little community. Are now the same. Way. That same day on another united flight a passenger was Don why is the lobby it again. Will now. I don't want to hold my head and having. An already parents courtly and elements and it's. And Latin. They aren't but wait there's an off. A couple who was going to their destination weddings. Were on a plane that was not the whole game. And someone was laid out in the season they want someone some man is anonymous and almanac. And and then wash those wasn't really really know exactly yet that was an upgraded section because of what happened. Land on my if they could upgrade yeah and east said no I have a must treat here for a united statement these passengers repeatedly attempted to sit and upgraded seating. Which they did not purchase and they would not follow crew instructions to return to their sign seats we've been in touch with them and have read. Re booked about yeah I freaky it's flat. And something major happens in the news does not memo go out to everyone who works the united just saying look. We need a big mistake here we have to be on god we have to do things properly. These things keep happening in the topped because the CEO was so tone deaf when he first came out of all Dokic and called doctor Dow belligerent and argumentative. And then sort of had to backtrack and an out of them what I see you he suffered a broken nose a concussion and lost his tooth ninety. Well everybody isn't really clear answers so everyone is really clear here is how this is supposed to go. If you have been allowed. To board the plane they cannot force you. To give up your seat but you have paid your seat and you up on war. Yeah they can ask if you will given up they cannot take if I am actually given up Chris sandy doesn't it doesn't matter if they don't have the right to know what they did that night in Florida is not cultural and he's also going to all that police department. And I'll. Suck it slot friendly skies. They detained until united we apologize in advance. It was interesting to me when we were on hey this last weekend and have this was happening. The doctor apparently set I have to see patients on Monday ice I can not. Miss the day at work and I asked my husband. Because Monday's his surgical day acted to do he was like I would not a god now. That would not and I'm not well I. Yeah what could point out is if you already boarded. I would do not have to. Unless you are being belligerent unless you are threatening people and I'm Don something if you know just the passenger in this and we need seeds. I've the united and all you on the Gaza fly make the money weren't getting off yes they stopped that you want twelve seats have yeah. I. Flags prince is messy. Problem vacate watt very good track.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "United Airlines suffers a public relations crisis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Travel/video/united-airlines-suffers-public-relations-crisis-46846391"
}