{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 23:54:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "The erroneous alert resulted in panic across the state.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fhawaii-employee-false-missile-alert-100-percent-real-52808046.json",
    "image_url": "http://a.abcnews.com/images/US/180202_vod_orig_hawaii_missile_interview_MIX_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Hawaii employee who sent false missile alert: 'I was 100 percent sure it was real'\nOn asserted morning. Came it's a work. 01 and two. Our team logged on for a logging on to are workstations. And we receive a call. Our supervisors aren't in the office at the time. So a they call. This picked up by one of my coworkers. Soil here the the beginning of the message coming across because. What we're supposed to do was hit speakerphone on this on the line so everyone can hear the message. So. The the message the video message was lost. Sports exercise exercise applause. So. Within them that all the messages said this is not a troll. Then at the end noted here exercise either. And the message so it. It was 100% sure that it was real. And did put us trained to do spores. Make in this election to notify the public. Most of the time we knew ahead of time that that the review the natural when the phone rang I had my back to the though the phone calls flying into my computer. And the protocol is that the person answering the call presses the speakerphone. Bond so everyone in the office can hear the message. That didn't happen so when let's look at the receiver. So the message beating a message was. Was not be able to hurt. And office. They put their use tear down so I heard. Muddled message. And the end of it. So this is not a troll and exercise wasn't so at all I didn't hear exercise. The word exercise from the message or my coworkers. Those commitments it was real house a 100% sure was real it was just. I did Barros trying to do and immediately afterwards. I was very emotional vote. What happened and just the system want my team has occurred in answering phone calls from the public phones are ringing off the it was it was just a body blow for me it was very very difficult for emotional. I was. I felt terrible no call. What happened in. I just felt that the time. Who's doing what. Doing what was right don't don't allows trained to do when. But it was afterwards it was system. Is very tough no one asked me what my. About about it at all and ask me what happened. Until three days after. The fact when it went on as required to put. A written statement. Down from on my boss. So the whole day and no one asked me what happened. There relied on. Information from other people. I'm not the cut passed. To the media what's been. Utter hell list last few weeks. You know reading the newspapers. And seeing false information about their own. It's pretty it's very hurtful and and I feel lot of guilt from. From what's happened. Last several weeks. And it's it's been tough because. I can't share without anyone. Don't feel alone about it. So from my family and I just so. Trying to have to put the truth out there. Instead of phone. What the has been put out there who just. These so false things have been said.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Hawaii employee who sent false missile alert: 'I was 100 percent sure it was real'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/hawaii-employee-false-missile-alert-100-percent-real-52808046"
}