{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 05:48:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Today in History",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-45501491.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-45501491",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Wednesday, Feb. 15, the 46th day of 2017. There are 319 days left in the year.\nToday's Highlight in History:\nOn Feb. 15, 1867, \"On the Beautiful Blue Danube,\" a waltz by Johann Strauss (the Younger), was publicly performed for the first time by the Vienna Men's Choral Society, garnering a polite, if decidedly less than enthusiastic, audience response. (A revised orchestral version proved much more successful.)\nOn this date:\nIn 1764, the site of present-day St. Louis was established by Pierre Laclede and Auguste Chouteau.\nIn 1898, the U.S. battleship Maine mysteriously blew up in Havana Harbor, killing more than 260 crew members and bringing the United States closer to war with Spain.\nIn 1933, President-elect Franklin D. Roosevelt escaped an assassination attempt in Miami that mortally wounded Chicago Mayor Anton J. Cermak; gunman Giuseppe Zangara was executed more than four weeks later.\nIn 1942, the British colony Singapore surrendered to Japanese forces during World War II.\nIn 1952, a funeral was held at Windsor Castle for Britain's King George VI, who had died nine days earlier.\nIn 1961, 73 people, including an 18-member U.S. figure skating team en route to the World Championships in Czechoslovakia, were killed in the crash of a Sabena Airlines Boeing 707 in Belgium.\nIn 1967, the rock band Chicago was founded by Walter Parazaider, Terry Kath, Danny Seraphine, Lee Loughnane (LOK'-nayn), James Pankow and Robert Lamm; the group originally called itself The Big Thing.\nIn 1971, Britain and Ireland \"decimalised\" their currencies, making one pound equal to 100 new pence instead of 240 pence.\nIn 1982, 84 men were killed when a huge oil-drilling rig, the Ocean Ranger, sank off the coast of Newfoundland during a fierce storm.\nIn 1989, the Soviet Union announced that the last of its troops had left Afghanistan, after more than nine years of military intervention.\nIn 1992, a Milwaukee jury found that Jeffrey Dahmer was sane when he killed and mutilated 15 men and boys. (The decision meant that Dahmer, who had already pleaded guilty to the murders, would receive a mandatory life sentence for each count; Dahmer was beaten to death in prison in 1994.)\nIn 2002, a private funeral was held at Windsor Castle for Britain's Princess Margaret, who had died six days earlier at age 71.\nTen years ago: National Guardsmen in Humvees ferried food, fuel and baby supplies to hundreds of motorists stranded for nearly a day on a 50-mile stretch of Interstate 78 in eastern Pennsylvania because of a monster storm. The U.S. Mint unveiled the new presidential $1 coin. Oscar-winning songwriter Ray Evans died in Los Angeles at age 92.\nFive years ago: Congressional negotiators sealed an agreement on legislation to renew a payroll tax cut for 160 million workers and jobless benefits for millions more. In defiant swipes at its foes, Iran said it was dramatically closer to mastering the production of nuclear fuel even as the U.S. weighed tougher pressure on the Tehran government.\nOne year ago: President Barack Obama opened a meeting in Rancho Mirage, California, of leaders from the Association of Southeast Asian Nations, calling the landmark gathering on U.S. soil a reflection of his personal commitment to an enduring partnership with the diverse group of countries. Taylor Swift's \"1989\" brought the singer her second Grammy Award win for album of the year; Mark Ronson and Bruno Mars earned top record for \"Uptown Funk,\" while Ed Sheeran won song of the year for \"Thinking Out Loud.\" Vanity, a Prince protege who renounced her sexy stage persona to become a Christian minister, died in Fremont, California at age 57. Her real name was Denise Matthews.\nToday's Birthdays: Former Illinois Congressman John Anderson is 95. Actress Claire Bloom is 86. Author Susan Brownmiller is 82. Songwriter Brian Holland is 76. Rock musician Mick Avory (The Kinks) is 73. Jazz musician Henry Threadgill is 73. Actress-model Marisa Berenson is 70. Actress Jane Seymour is 66. Singer Melissa Manchester is 66. Actress Lynn Whitfield is 64. \"Simpsons\" creator Matt Groening (GREE'-ning) is 63. Model Janice Dickinson is 62. Actor Christopher McDonald is 62. Reggae singer Ali Campbell is 58. Actor Joseph R. Gannascoli is 58. Musician Mikey Craig (Culture Club) is 57. College and Pro Football Hall of Famer Darrell Green is 57. Actor/comedian Steven Michael Quezada (TV: \"Breaking Bad\") is 54. Country singer Michael Reynolds (Pinmonkey) is 53. Actor Michael Easton is 50. Rock musician Stevie Benton (Drowning Pool) is 46. Actress Renee O'Connor is 46. Actress Sarah Wynter is 44. Olympic gold medal swimmer Amy Van Dyken-Rouen is 44. Actress-director Miranda July is 43. Rock singer Brandon Boyd (Incubus) is 41. Rock musician Ronnie Vannucci (The Killers) is 41. Singer-songwriter-musician Conor Oberst (Bright Eyes) is 37. Actress Ashley Lyn Cafagna is 34. Blues-rock musician Gary Clark Jr. is 33. Actress Natalie Morales is 32. Actress Amber Riley is 31.\nThought for Today: \"Nothing is mine, I have only nothing but it is enough, it is beautiful and it is all mine.\" — Katherine Anne Porter, American author (1894-1980).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-45501491"
}