{
    "authors": [
        "Abc News",
        "More Alexa"
    ],
    "date_download": "2018-07-04 09:46:44+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "\"The Handmaid's Tale\" star talked about her career and almost becoming a doctor.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fhandmaids-tale-star-ann-dowd-finding-aunt-lydia%2Fstory%3Fid%3D56348147.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/ann-dowd3-ht-ml-180702_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When Ann Dowd read the first script for Hulu's \"The Handmaid's Tale,\" she immediately felt connected to the character Aunt Lydia.\n\"I was very curious about Lydia. [Showrunner Bruce Miller] had said she was a teacher -- that clicked for me. I love teaching,\" Dowd said in an interview for ABC News' \"Popcorn With Peter Travers.\" \"I just signed on right away. There was no hesitation.\"\nGeorge Kraychyk/Hulu\nSure, Dowd knows that Aunt Lydia, the woman in charge of making sure the handmaids do their job of bearing children in dystopian Republic of Gilead, has done some bad things. Those include torturing women, inciting murder and using a cattle prod on humans.\nBut Dowd follows what she said is the golden rule of acting: \"Not to judge.\"\n\"What seemed clear is that she does love these girls and is devoted to them ... as troubled as she is and as flawed as her take on love is,\" she said.\nJeff Swartz/ABC News\nDowd has a theory about what Aunt Lydia was like before Gilead.\n\"I think she went to those early meetings in the basement when Gilead was taking shape,\" she said. \"[She probably said], 'Listen, just count me in. I know how to teach. Give me those handmaids. I'll get it straightened out in a very short period of time.'\"\nAs much as Aunt Lydia is influenced by some aspects of her own experiences with Catholic nuns as a child, Dowd said there are parts of Aunt Lydia inside of her as well, especially when it comes to her three children.\nShe said she's tried her Aunt Lydia voice with her 13-year-old.\n\"I'll be like, 'What do I see in the room on the floor? What am I look at there?' Like if it's a wrecked room or it's messy,\" she joked. \"And this is what I get back: 'I don't know, Mom. What do you see?' In other words, like, 'Wrap it up. You're confused. We're home now. [Aunt Lydia] doesn't live here.'\"\nChristopher Polk/Getty Images\nDowd recalled one instance in which she said she lost her temper and brought out her inner Aunt Lydia at a supermarket in New York City, when someone yelled at her oldest son, who is on the autism spectrum.\n\"She said, 'He needs to go to the nuthouse.' And the switch went off.\"\n\"I was very calm, and she was older,\" Dowd said. \"She had long, white, straggly hair. And I stood in front of her, and I knew that I had lost it and I had become very still. And I'm thinking, 'Your children are around you so get it together.'\"\n\"I said, 'I'm going to take your hair. I'm going to wrap it around your neck. And I'm going to pull,'\" Dowd recalled.\n\"She stepped back … I said, 'That's my son. Don't ever do that again. Ever.' And she said, 'Oh. Well, I mean--' And I said, 'No, no. You should be frightened of me. Because I will find you.'\"\nDowd said she has seen the woman since the incident, but that \"I just sort of put my head down,\" she said, laughing.\n\"Now when I tell that story, normally we laugh,\" she continued. \"But it really was not funny to her at all or me for that matter.\"\nBruce Glikas/FilmMagic via Getty Images, FILE\nThough her performance as Aunt Lydia earned her an Emmy award for best supporting actress in 2017, Dowd almost pursued a very different kind of career.\nShe grew up one of seven in an Irish-Catholic family in Holyoke, Massachusetts. Though she developed her love for acting with school plays, she eventually decided to study pre-med at the College of the Holy Cross, where her father and grandfather went, after she learned her father was dying.\nWhile Dowd was in school, she continued to appear in plays, and she credits two of her teachers and her roommate for helping her decide on a career change.\n\"There's this real value in following something you love,\" Dowd said.\nDownload the \"Popcorn With Peter Travers\" podcasts on Apple Podcasts, Spotify, Tunein, Google Play Music and Stitcher.\nDowd also had the support of someone close to her.\n\"I remember saying to my grandmother, 'Grandma, I'm going to be an actress.' And she said -- she's a very beautiful person -- she said, 'Oh no dear, that's a hobby. And you'll enjoy it, as a hobby,'\" Dowd said.\n\"Then I took a beat and I said, 'But grandma, those are the gifts I was given.' And she said, 'You're absolutely right. You go be an actress. I'll say my prayers for you,'\" she continued. \"And that was the last of any conflict there, so. Lucky.\"",
    "source_domain": "abcnews.go.com",
    "title": "'The Handmaid's Tale' star Ann Dowd on finding her inner Aunt Lydia when something happened to her son",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/handmaids-tale-star-ann-dowd-finding-aunt-lydia/story?id=56348147"
}