{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 19:46:10+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fnyc-launches-investigation-kushner-cos-false-filings-53855256.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_74c39132288143b0bc3db5b55dcc1e27_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A New York City council member launched an investigation into the Kushner Cos.' routine filing of paperwork falsely claiming zero rent-regulated tenants in its buildings, saying that the deception should have been uncovered long ago because the documents are online for all to see.\nThe Department of Buildings should have spotted the falsified numbers because they were contradicted by tax documents filed with another city agency, said Councilman Ritchie Torres.\nThe Associated Press reported Sunday that a tenants rights watchdog found that the Kushner Cos. had filed more than 80 documents for 34 buildings across the city stating it had no rent-regulated units in its buildings when, in fact, it had hundreds.\nThe falsified documents allowed the Kushner Cos. to escape extra scrutiny during construction projects between 2013 and 2016, when the family real estate developer was run by Jared Kushner, who is now senior adviser to his father-in-law, President Donald Trump. The Housing Rights Initiative, a watchdog group, said the falsified documents made it easier for the Kushner Cos. to harass rent-regulated tenants so that it could push out low-paying tenants out and replace them with higher paying ones.\nOne tenant of a Queens building once owned by Kushner Cos. said the company drove many of his neighbors to leave.\n\"It was noisy, there were complaints, I got mice,\" said mailman Rudolph Romano, adding that he also bristled at a 60 percent rent increase, a hike the Kushner Cos. contends was initiated by the previous landlord. \"They cleaned the place out. I watched the whole building leave.\"\nTorres said the city bears some of the blame.\n\"The scandal is not only the deception of Kushner Cos., the scandal is the dysfunction of the city bureaucracy,\" said Torres, chair of the city council's investigations committee. He added, \"The right hand of city government didn't know what the left hand was doing.\"\nThe Kushner Cos. said in a printed release Monday that \"the investigation is trying to create an issue where none exists. Kushner Companies did not intentionally falsify DOB filings in an effort to harass any tenants.\" It added, \"If mistakes or typographical errors are identified, corrective action is taken immediately with no financial benefit to the company.\"\nThe company had said in a previous statement that it outsources the preparation of such documents to third parties, and those are reviewed by independent counsel.\nFor its part, the New York buildings department said it disciplined a contractor who filed false documents while working on two Kushner buildings currently under investigation by a tenant-harassment task force. It added that the department is also ramping up its monitoring of construction.\nHousing Rights Initiative found the more than 80 applications for construction permits filed by the Kushner Cos. stating that there were zero rent-regulated tenants. But tax documents show more than 300 rent-regulated units. Nearly all the permit applications were signed by a Kushner employee, sometimes by its chief operating officer. None were signed by Jared Kushner himself.\nHad the Kushner Cos. disclosed those rent-regulated tenants, it could have triggered stricter oversight of construction crews by the city, including possibly unscheduled \"sweeps\" on site by inspectors to keep the company from harassing tenants and getting them to leave.\nInstead, current and former tenants of three buildings once owned by the Kushner Cos. told the AP that they were subjected to extensive construction, with banging, drilling, dust and leaking water that they believe were part of targeted harassment to get them to leave and clear the way for higher-paying renters.\nTax records show those rent-regulated units that numbered as many as 94 when Kushner took over fell to 25 by 2016. The Kushner Cos. sold the three buildings last year for $60 million, nearly 50 percent more than it paid.\n\"Kushner Cos. made the lives of many of its tenants a living hell,\" said Aaron Carr, founder of Housing Rights Initiative, which is joining with the Torres committee in the Kushner investigation. Construction harassment is \"a tool designed to make the lives of rent stabilized tenants so unbearable, so intolerable that they are forced to give up the most valuable thing one can have in the midst of an affordable housing crisis, affordability.\"\nSubmitting false documents to the city's Department of Buildings for construction permits is a misdemeanor, which can carry fines of up to $25,000. But real estate experts say it is often flouted with little to no consequences. Landlords who do so get off with no more than a demand from the city, sometimes a year or more later, to file an \"amended\" form with the correct numbers.\nHousing Rights Initiative found the Kushner Cos. filed dozens of amended forms for the buildings mentioned in the documents, most of them a year to two later.\nIn a statement, the city's Department of Buildings spokesman Joseph Soldevere said, \"We won't tolerate landlords who use construction to harass tenants — no matter who they are.\"\nExactly how much money the Kushner Cos. earned from the buildings mentioned in the documents is unclear. Of those 34 buildings, only the three in Queens and a fourth in Brooklyn appear to have been sold. The company also likely made money by reducing the number of rent-regulated tenants and bringing in those who would pay more.\nJared Kushner, who stepped down as CEO of the Kushner Cos. last year before taking on his advisory role at the White House, sold off part of his real estate holdings as required under government ethics rules. But he retained stakes in many properties, including Westminster Management, the Kushner Cos. subsidiary that oversees its residential properties. A financial disclosure last year showed he still owns a stake in Westminster and earned $1.6 million from it.\n———\nCondon can be reached at http://twitter.com/BernardFCondon.",
    "source_domain": "abcnews.go.com",
    "title": "NYC launches investigation into Kushner Cos. false filings",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/nyc-launches-investigation-kushner-cos-false-filings-53855256"
}