{
    "authors": [
        "Abc News",
        "More Luis"
    ],
    "date_download": "2017-02-15 14:55:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Russian spy ship 30 miles from US Navy sub base",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Frussian-spy-ship-30-miles-us-navy-base%2Fstory%3Fid%3D45507034.json",
    "image_url": "http://a.abcnews.com/images/International/AP_Viktor-Leonov-rc-170215_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Russian spy ship is now 30 miles south of New London, Connecticut, where a U.S. Navy submarine base is located.\nThe Viktor Leonov, a Russian intelligence gathering ship, had been making its way north along the East Coast of the United States. On Monday the vessel was 70 miles off the coast of Delaware.\nU.S. officials have said that the spy ship was likely headed to a location near Connecticut in international waters where it could be close to the submarine base in New London. U.S. territorial waters extend 12 miles from shore to the vessel.\nAccording to a U.S. official, the Leonov is currently \"loitering\" about 30 miles south of New London.\nThe Leonov is equipped with communications and signal intelligence gathering equipment.\nIn recent years Russian spy ships have been spotted operating near King's Bay, Georgia, the Navy's other submarine base along the East Coast.\nThe Leonov was in the mid-Atlantic about a month ago, apparently headed to the Caribbean.\nIn early February the ship made a port of call in Kingston, Jamaica, before taking a path that took it north to the United States.\nIf the ship follows past Russian practice, it will head back to Cuba after completing its mission in the Northeast.",
    "source_domain": "abcnews.go.com",
    "title": "Russian spy ship 30 miles from US Navy sub base",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/russian-spy-ship-30-miles-us-navy-base/story?id=45507034"
}