{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:23+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmacron-parties-fela-kutis-afrika-shrine-nigeria-56360151.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_cc6a8b4409b742c983e8cda5ad1de4b5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "French President Emmanuel Macron shook up his two-day visit to Nigeria with a stop at the New Afrika Shrine, a concert hall founded by the late music legend Fela Kuti where partying Nigerians gather, though the usual gyrating dancers and marijuana were absent.\nMacron, who was an intern in Nigeria at age 23, used the colorful evening at the Lagos nightclub to launch the 2020 Season of African Cultures in France.\n\"What happens in the shrine remains in the shrine,\" Macron said to cheers from the crowd.\nThe French leader also held talks with Nigerian President Muhammadu Buhari on security in Africa's Lake Chad and Sahel regions as the extremist threat grows from Boko Haram and groups linked to al-Qaida and the Islamic State organization.\n\"We have to increase the pressure and operations against jihadists. France will remain present in the Sahel as long as necessary,\" Macron told reporters. France's Barkhane in West and Central Africa is its largest overseas military operation.\nNigeria, Africa's most populous country, has faced the Boko Haram insurgency since 2009, with more than 20,000 people killed and thousands abducted.\nIshola Williams, a retired Nigerian military general, told The Associated Press that despite gains in international cooperation to fight extremism, \"such terrorist acts like suicide bombings will remain a key challenge.\"\nMacron's visit also highlighted economic issues, with a $475 million agreement signed for France to fund projects in three Nigerian states including Lagos, the commercial capital.\nOn Wednesday, the French president was inaugurating an Alliance Francaise cultural center in Lagos and meeting young Nigerian entrepreneurs.\n———\nFollow Africa news at https://twitter.com/AP—Africa",
    "source_domain": "abcnews.go.com",
    "title": "Macron parties at Fela Kuti's New Afrika Shrine in Nigeria",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/macron-parties-fela-kutis-afrika-shrine-nigeria-56360151"
}