{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:57:28+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Family roots for Brady run deep and strong in Minnesota",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ffamily-roots-brady-run-deep-strong-minnesota-52807214.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_911ca3c2b536456685bfbfe6b3579411_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tom Brady has never lost in Minnesota, with his latest game in the land of lakes this weekend at the Super Bowl of course looming as the largest yet.\nWell, long before all this football success, Brady actually endured a couple of memorable failures in the state. They came during those treasured visits to his family's farm outside the tiny town of Browerville.\nFirst, there was his grandfather's dog, Tippy. Little Tommy ignored the advice of his elders one day and decided to feed Tippy a bone.\n\"I bent down to give him a kiss, and he bit through my lip,\" Brady said. \"That was pretty rough.\"\nThen there was his ill-fated debut with chewing tobacco, which he persuaded his uncles to let him sample during the half-hour ride back to the farm from their fishing expedition on the lake.\n\"They said, 'Look, if we give it to you, you can't spit it out until you get home,' Of course they give it to me, and within five minutes I'm outside of the car, throwing up all over the place,\" Brady said. \"And I don't think I've had much chewing tobacco since then.\"\nBrady spent plenty more time in central Minnesota as he aged into a star quarterback and eventually one of the most famous people on the planet. He still makes a priority to visit in the offseasons with his wife and children, trying to continue a tradition he reflected upon fondly and often during news conferences this week.\n\"I've come here my entire life since I was a baby. I've been coming to Minnesota in summers and winters. I loved the experience. I loved the life here,\" Brady said. \"Some of my greatest memories as a kid were coming here and milking cows with my grandpa; hanging out in his silos and in the haystack above his barn; going out to where he would pasteurize the milk and pull the cream off the top of the milk in the morning; and shooting his (.22-caliber rifle) at targets in the backyard, and catching sunfish with my uncles. It was great. I love being here. It's a great state. Obviously, I love the people. Being that my mom's from here, I'm proud of that.\"\nGalynn Johnson was the middle child between two boys, the 1961 homecoming queen at Browerville High School who moved to California and met Tom Brady, who would later add senior to his name when a certain five-time Super Bowl winner was born. The couple returned to Todd County, where the prairie meets the forest a little less than a 2?-hour drive northwest of downtown Minneapolis, in 1969 for their wedding.\nBrady and the Patriots will play the Philadelphia Eagles on Sunday, when several family members will be in attendance at U.S. Bank Stadium.\n\"These tickets are pretty tough to come by,\" Brady said. \"But I'm trying my best to accommodate everyone. It is very special.\"\nThe group will include Paul Johnson, who at age 50 is 10 years older than his quarterback cousin. He's an entrepreneur who has stayed around his whole life. After CBS announcer Jim Nantz mentioned Browerville to Brady during New England's AFC championship celebration, Johnson has been the subject of a barrage of media coverage that's highly unusual for a quiet burg of 793 people.\n\"It's fun. I wouldn't want to be a celebrity, I know that,\" Johnson said, conducting an interview with The Associated Press from his ice-fishing shack on one of the region's bounty of frozen lakes, with the clinking of his propane tank audible in the background. \"We're just so proud of him.\"\nThe Johnsons of Browerville quickly became Patriots fans after Brady was drafted in 2000, veering away from the home-state Vikings.\n\"We clearly remember the game where Drew Bledsoe got hurt,\" Johnson said, \"and the rest is history.\"\nJohnson's 22-year-old son, Benton, is a University of St. Thomas senior in St. Paul who was fortunate enough to get on the ticket list for Sunday, too. This will be his first in-person Super Bowl, but he and his 25-year-old sister, Kenley, have been lifelong fans of the Patriots.\n\"It was probably the coolest thing on earth to say that Tom Brady was your cousin,\" said Benton, who always carried photo evidence of his relation to disprove any doubting peers at school.\nEven for young Benton, visits to Browerville from the Brady clan made a major impression.\n\"It was always like, 'Mom, when are they coming?'\" Benton said. \"I always told my parents I would move to California because I just loved seeing them and the stories they would tell.\"\nBrady's mother underwent breast cancer treatments in 2016 and made a stirring appearance on the field this season before New England's game against the Atlanta Falcons . Brady has beamed this week every time he's spoken about his family, proudly reporting that his mom remains cancer free.\n\"My parents mean everything to me,\" Brady said. \"They've been here by my side every step of the way.\"\n———\nFor more AP NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Family roots for Brady run deep and strong in Minnesota",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/family-roots-brady-run-deep-strong-minnesota-52807214"
}