{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 20:45:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "The Latest: Italian gunman had far-right extremist ties",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-victims-italy-shootings-foreigners-52814657.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_e6c684b97e9c4cd1b65ab18575718175_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on drive-by shootings in Italy (all times local):\n9:10 p.m.\nItaly's interior minister says the suspected gunman in the drive-by shootings of six African immigrants was immersed in \"racial hatred\" and had an extreme-right background with both neo-Nazi and neo-Fascist ties.\nInterior Minister Marco Minniti told reporters in the central Italian city of Macerata that the suspect had acted alone Saturday but planned the attack in advance.\nThe suspect, Luca Traini, ran unsuccessfully with the anti-migrant Northern League party in a local election last year, and previously had been associated with the neo-fascist Forza Nuova and Casa Pound.\nA photograph of Traini in police custody shows he has a tattoo associated with neo-Nazis on his forehead. According to the Anti-Defamation League, the Wolfsangel is an ancient runic symbol that was appropriated by Nazi Germany and later adopted by Neo-Nazis in Europe and the United States.\n———\n9 p.m.\nHospital officials say one of the six Africans wounded by a far-right Italian gunman has been treated for their injuries and released.\nAuthorities say five men and one woman were shot in a drive-by spree Saturday in the central Italian city of Macerata by suspect Luca Traini, 28. Italy's interior minister says the suspected gunman was immersed in \"racial hatred\" and had an extreme-right background with both neo-Nazi and neo-Fascist ties.\nOf the other five victims, authorities said late Saturday that one was in intensive care, while the others had either undergone surgery or were scheduled to have surgery.\n———\n5:45 p.m.\nItalian Premier Paolo Gentiloni has condemned the drive-by shooting spree targeting African immigrants in the central Italian city of Macerata, saying \"hatred and violence will not succeed in dividing us.\"\nGentiloni said Saturday that \"one thing is certain, that horrendous crimes and criminal behavior will be prosecuted and punished. This is the law.\"\nGentiloni also said Italy would be \"particularly severe against whoever thinks of nourishing this spiral of violence,\" adding \"we will stop it together.\"\nAn Italian man who has been politically active with the anti-migrant Northern League has been arrested in the drive-by shootings that wounded six people.\n———\n3:55 p.m.\nItalian authorities have identified the suspected gunman who shot six African foreigners in the Italian city of Macerata.\nThey say he is Luca Traini, a 28-year-old Italian with no previous record. The news agency ANSA reported that Traini had run as a candidate for the anti-migrant Northern League in a local election last year in the city of Corridonia. He did not win.\nA party spokesman was not immediately able to confirm the affiliation.\nA video posted by the newspaper il Resto di Carlino showed a man with an Italian flag draped over his shoulders being arrested by armed Carabinieri officers a short distance from where he apparently fled his car on foot.\nItalian news reports said the man did a Fascist salute as he was arrested, but no salute was visible in the video.\n———\n2:10 p.m.\nThe mayor of the Italian city of Macerata says six foreigners have been wounded in a series of drive-by shootings, one of them with life-threatening injuries.\nMayor Romano Carancini told Sky TG24 that the victims were five men and one woman.\nThe suspect was identified as a 28-year-old Italian with no previous record. A motive for the shootings wasn't immediately confirmed, but it comes just days after the dismembered body of an Italian teenager was found in the city. The main suspect is a Nigerian immigrant.\nCarancini confirmed that all of the victims in Saturday's shootings were black, and acknowledged that \"the closeness of these two events makes you imagine that there is a connection.\"\n———\n1:15 p.m.\nOfficials in a central Italian city have confirmed that a suspect in drive-by shootings against foreigners has been apprehended.\nThe city of Macerata's Twitter account says the gunman has been captured about two hours after he began a shooting rampage from a black automobile. Macerata was the scene of a gruesome killing earlier this week of a white Italian woman. The chief suspect in that killing is a Nigerian.\nAuthorities had warned citizens to stay inside Saturday while the shooter remained at large. The number of victims hasn't been confirmed.\n———\n1:05 p.m.\nItalian police say the victims of drive-by shootings in the central Italian city of Macerata are all foreigners, and the news agency ANSA say they are black.\nMacerata was the scene of the gruesome killing of a young white Italian woman this week, whose dismembered remains were found in two suitcases. The chief suspect is a Nigerian immigrant.\nPolice haven't said how many people have been wounded in the shootings. The news agency ANSA said two of the injured were black, and that witnesses reported that the car was seen in the area where the woman's body was found.\n———\n12:55 p.m.\nItalian police say a drive-by shooting has left wounded in the central city of Macerata, and authorities are warning citizens to remain indoors.\nPolice did not say how many were injured in the town, which has a population of 43,000.\nItalian news reports said that the car contained two people. Macerata's mayor has urged citizens to stay indoors Saturday while the suspects remain at-large. The ANSA news agency reported four victims have been wounded while Sky TG24 put the number of wounded at two.\nSky said the shooting started around 11 a.m. (1000 GMT; 5 a.m. EST), and that students were being kept inside schools which are open on Saturday and public transport had been halted.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Italian gunman had far-right extremist ties",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-victims-italy-shootings-foreigners-52814657"
}