{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 19:56:17+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fjudge-blocked-california-law-life-ending-drugs-now-55539065.json",
    "image_url": "https://abcnews.go.com/Health/wireStory/judge-blocked-california-law-life-ending-drugs-now-55539065",
    "language": "en",
    "localpath": null,
    "maintext": "A judge has thrown out a 2016 California law allowing terminally ill people to end their lives after finding that the Legislature unconstitutionally approved it during a special session.\nState Attorney General Xavier Becerra asked an appeals court to block and reverse last week's decision by Riverside County Superior Court Judge Daniel Ottolia.\nThe court denied the request to immediately block the ruling. But experts say Becerra has other legal options and could ask the state Supreme Court to weigh in to try to restore the law.\nFor now, there are many questions on the impact of the ruling. Here are some of them:\nWHAT DID THE LAW ALLOW?\nAdults could obtain a prescription for life-ending drugs if a doctor determined they had six months or less to live. To ensure they didn't have a change of heart, patients had to make two verbal requests at least 15 days apart and submit a written request.\nCalifornia health officials reported 111 terminally ill people took drugs to end their lives in the first six months the law was in effect.\nCompassion & Choices, a national organization that supports the law and wants it reinstated, estimated that 504 Californians requested prescriptions in the law's first year.\nThe next state report on the number of people who took the drugs is expected in July.\nWHAT DID THE JUDGE DECIDE?\nOttolia didn't address the legal issue of whether it was proper to allow people to end their own lives. Rather, he found the law should not have been passed during a special session in 2015.\nThose who supported the measure say state lawmakers were justified in taking up the issue because the session was devoted to health-related topics.\nThe appeals court that refused to block Ottolia's order has not yet considered the state's request to reverse the ruling. Ottolia on Wednesday rejected a request by Compassion & Choices to vacate his decision and scheduled a June 29 hearing on a similar request from the attorney general's office.\nWhat does all this mean for now?\n\"We are in the world that we were before the law went into effect,\" said Erwin Chemerinsky, dean of the law school at the University of California, Berkeley.\nWHAT HAPPENS TO THOSE WHO PLANNED TO USE THE LAW?\nPatients who have not obtained prescriptions for life-ending medications can't legally get them now, said Dr. Lonny Shavelson, whose practice was solely focused on those cases.\nShavelson said he still is meeting with patients and taking their initial requests for drugs but not issuing prescriptions. And he said he can't guarantee their requests will count toward the required waiting period should the law be restored.\nShavelson said patients who previously obtained prescriptions can take their medication if they choose to. But with the law not in effect, it's possible a medical examiner could declare the death a suicide, which could create challenges for family members claiming insurance payments.\n\"I am spending a lot of time calming down really freaked-out patients,\" he said.\nCOULD DOCTORS FACE PROSECUTION?\nShavelson said he and his colleagues met recently and determined they were no longer in business because of the judge's ruling. Similarly, Kaiser Permanente halted the health network's end-of-life program.\nWhat would happen to a doctor who wrote a prescription? Experts said that's largely up to prosecutors and can vary by jurisdiction.\nMatt Valliere, executive director of the Patients' Rights Action Fund that wants the law thrown out, said he believes doctors who write prescriptions can and should be prosecuted for assisting in a suicide, which is a felony under California law.\nKathryn Tucker, executive director of the End of Life Liberty Project, said she doubts prosecutors would go after doctors who continue to treat pre-existing patients. But she said she doesn't expect doctors to issue new prescriptions without greater legal certainty.\nCAN LAWMAKERS PASS ANOTHER LAW?\nIt's possible for lawmakers to propose another measure, but it took years for the state's now-blocked law to be passed. A new proposal on such an emotional issue would not sail through the Legislature.\nTucker said legal wrangling in the courts will likely take less time than another legislative push.\n\"What's at stake is of a very time-sensitive nature,\" she said.\nBecerra's office asked the appeals court to consider the case on a quicker timeframe than the average appeal.",
    "source_domain": "abcnews.go.com",
    "title": "Judge blocked California law on life-ending drugs. Now what?",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/wireStory/judge-blocked-california-law-life-ending-drugs-now-55539065"
}