{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2017-02-15 01:17:25+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Oklahoma bill would force women seeking abortions to get permission from baby's father",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Foklahoma-bill-force-women-seeking-abortions-permission-babys%2Fstory%3Fid%3D45490040.json",
    "image_url": "http://a.abcnews.com/images/US/gty-Oklahoma-city-capital-hb-170214_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Oklahoma state legislature has advanced a bill that would require pregnant women seeking abortions to get permission from the baby's father.\nThe Public Health Committee of the lower house of the state legislature approved the bill by 5-2, advancing it to the floor of the Oklahoma House of Representatives.\nThe legislation would require women to get written consent from the baby's father and to identify the father in writing to her physician before having an abortion. The measure would not apply in cases of rape, incest, or if the woman's life is in danger.\nIf the person identified as the father wants to contest paternity, he can demand a DNA test, according to the bill summary.\nThe bill's author, state Rep. Justin Humphrey, described pregnant women as \"hosts\" for fetuses in an interview with The Intercept, according to an article published Monday.\nHumphrey told The Intercept that he wanted the father to have a say. “I believe one of the breakdowns in our society is that we have excluded the man out of all of these types of decisions,\" he said.\nAs to women who want an abortion, Humphrey said, \"I’m like, hey, your body is your body, and be responsible with it. But after you’re irresponsible then don’t claim, well, I can just go and do this with another body, when you’re the host and you invited that in.\"\nHumphrey, a Republican, was elected in 2016. ABC News could not immediately reach Humphrey for comment.\nOklahoma House of Representatives\nThe bill has faced wide criticism, including the charge that it is unconstitutional under the 1992 Supreme Court ruling in Planned Parenthood v. Casey, which held that a Pennsylvania's spousal-notification provision imposed an undue burden on women seeking abortions and was therefore invalid.\nLaura McQuade, president and CEO of Planned Parenthood Great Plains, called Humphrey's comments describing women as hosts \"repugnant,\" adding that although they are \"indicative\" of the \"political and media climate in which we live,\" it is \"shocking\" someone would feel comfortable \"saying it out loud.\"\n\"This is an outrageous affront to women, women's autonomy and women's decisionmaking capacity,\" McQuade said of the bill.\nMcQuade contends the proposed law is unconstitutional under the 1992 court ruling. And he pointed to another Supreme Court decision last year in Whole Woman’s Health v. Hellerstedt, which McQuade said \"basically said that the state does not have the right to put in place barriers solely for the purpose of restricting abortion access.\"\n\"If it is medically unnecessary, or if the intent of the law is solely to block the access to abortion, it is unconstitutional,\" McQuade said.\nAbortion rights organization NARAL Pro-Choice America called the Oklahoma bill a \"dangerous escalation of efforts by a radical fringe to impose their rigid ideology on the rest of us.\"",
    "source_domain": "abcnews.go.com",
    "title": "Oklahoma bill that would force women seeking abortions to get permission from baby's father advances",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/oklahoma-bill-force-women-seeking-abortions-permission-babys/story?id=45490040"
}