{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:48:22+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fbiz-leaders-urge-early-elections-resolve-nicaragua-crisis-55537835.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_a26bf0a68bdb4e4e950ea640b1b3596d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A massive march in Nicaragua against President Daniel Ortega's government ended in violence Wednesday after gunmen opened fire on marchers.\nThe gunshots sent thousands of demonstrators running for cover in Managua, Nicaragua's capital, and there were unconfirmed reports of about a dozen people wounded.\nAn Associated Press photographer saw one person with a wound to the head carried off in a stretcher with a sheet covering his upper body, apparently dead.\nThe gunfire appeared to come from government supporters near the end of the march, but demonstrators armed with improvised bottle-rocket launchers also opened fire in the skirmish.\nHuman rights observers say more than 80 people have been killed amid a harsh crackdown by government security forces and allied civilian groups on protests that began in April, along with nearly 900 wounded and over 400 arrested.\nEarlier in the day, influential business leaders called for early elections to resolve weeks of deadly unrest.\nCarlos Pellas Chamorro, the country's most prominent businessman and believed to be the Central American nation's first billionaire, said in an interview with La Prensa newspaper that the Ortega government's political model is \"worn out.\" He called for the election of a new government through \"a free and transparent process.\"\n\"We must find an orderly solution, within the constitutional framework,\" Pellas added, \"which implies reforms that entail moving up the elections\" that right now are due to take place in 2021.\nPellas urged the immediate resignation of the entire electoral council, which has been accused of manipulating things to allow Ortega to consolidate power during his last 11 years in office.\nOrtega told a counter-demonstration that he wasn't leaving.\nOrtega most recently won re-election in November 2016, when opposition leaders had called for a boycott, alleged that the president had riged things in his favor and accused him of dynastic ambitions for picking first lady Rosario Murillo as his vice presidential running mate.\nGrupo Lafise Bancocentro, one of the largest conglomerates in Nicaragua, also called for the next presidential vote to be moved up.\n\"Let it be the will of the people through early elections that establishes justice, democracy and freedom in our country,\" read the statement signed by the group's president, Roberto Zamora.\nProtests that began in April over now-scrapped social security changes have since expanded into a broader movement seeking Ortega's exit.\nAmnesty International issued a report this week accusing authorities of a strategy of repression characterized by the excessive use of force, extrajudicial executions, control of the media and the use of para-political groups to quash protests.\nOn Wednesday, which was Mothers' Day in Nicaragua, mothers of the victims had organized a protest march along main streets in the capital, Managua.\nTalks sponsored by the Roman Catholic Church on ending the crisis were suspended indefinitely last week due to a lack of progress.\nPellas, whose fortune is estimated to be over $1.1 billion, is president of Grupo Pellas and has interests in sugar, automobiles, liquor, banking, health care and media, among other sectors.",
    "source_domain": "abcnews.go.com",
    "title": "Nicaragua march ends in shooting amid calls for early vote",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/biz-leaders-urge-early-elections-resolve-nicaragua-crisis-55537835"
}