{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:30:25+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "P.J. Fleck can use 'Row the Boat' with Golden Gophers",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fpj-fleck-row-boat-golden-gophers%2Fstory%3Fid%3D45510416.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170106_NCF_Fleck_SC_interview_Minnesota_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "New Minnesota football coach P.J. Fleck can now \"Row The Boat\" in the land of 10,000 lakes.\nSources said Fleck's agent Bryan Harlan reached an agreement Wednesday with Western Michigan for the university to transfer rights to the phrase, which was used by Fleck but trademarked by the university.\nThe trademark, filed by the university in May 2013 and registered in September 2015, will be transferred to Harlan's company, Harlan Sports, sources said. Harlan and Fleck are then expected to allow Minnesota to use the mark as it sees fit, including on merchandise, as long as Fleck is with the school.\nIn return, Fleck will give Western Michigan at least $50,000 through five payments of $10,000 to endow a scholarship for a football player.\nThe phrase started in February 2011 when Fleck's son Colt died of a heart condition. Fleck has said it is meant to signify a \"never give up\" attitude despite what life throws at you.\n\"I really hope because of what it means, that I have the ability to at least purchase it, take it with me, and continue to change other people's lives through tragedy, through adversity, in just a different area,\" Fleck told ESPN.com last month.\nFleck was hired by the Golden Gophers in January, after Western Michigan's magical run to the Cotton Bowl. He has a five-year, $18.5 million contract.",
    "source_domain": "abcnews.go.com",
    "title": "P.J. Fleck can use 'Row the Boat' with Golden Gophers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/pj-fleck-row-boat-golden-gophers/story?id=45510416"
}