{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:22:53+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The organizer of the white supremacist rally was mobbed while speaking out to \"condemn\" the violence, plus victims describe the moment a car rammed through demonstrators.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Feyewitnesses-describe-charlottesville-protests-left-dead-49201680.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_pilgrim5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Eyewitnesses describe Charlottesville protests that left 3 dead\nAs you can imagine there's a lot of news to get to, many still thinking about what happened over the weekend in charlottesville, Virginia. Just so tragic. Yes, it is, robin. We'll take a look at some of the images that are coming in overnight. Thousands uniting coast to coast from Los Angeles to Indianapolis to Brooklyn showing their solidarity with the victims of Saturday's attack. It took place during a violent rally in Virginia. White nationalists were holding that and there were counterprotesters and turning deadly. A 20-year-old suspect who was reportedly seen on video beforehand chanting \"White pourer\" driving into the crowd killing a woman and injuring 19 others and two state troopers losing their lives while trying to respond to the scene. We are learning new details about the victims and suspect now in custody and have team coverage starting with ABC's Eva pilgrim who is still there on the scene for us in charlottesville. Good morning, Eva. Reporter: Good morning, robin. You can see the memorial here growing at the crash site. Messages of love written on the pavement as this community tries to process what happened here this weekend. This morning, growing anger over the deadly Virginia protest that left one dead and 19 injured as hundreds of white nationalists clashed with counterprotesters Saturday. Turning the streets of charlottesville into a full-fledged battle zone. It all started Friday night when white supremacists stormed the university of Virginia's campus ahead of a protest over plans to remove a statue of Robert E. Lee. Then the Saturday protest they say had been coordinated with local police for months was met with opposition. The violent unrest turned deadly. Watch as this car plowed down the street straight into a sea of counterprotesters. The driver, 20-year-old James fields Jr. Quickly reversing barreling back over demonstrators. 32-year-old Heather Heyer was killed during what some are saying was a act after domestic terrorism. Her mother calling for peace. Heather's life was not about hate and this young man who ran my daughter down mistakenly believed that hate would change the world, and it doesn't. She actually died for something that she believed in. She was a fighter. She believed in equality and peace and love. Reporter: Marisa and her fiance Marcus were marching with Heather when the car came flying toward them. Heather was right in front of me. She was in front of my fiancee. Reporter: Marcus pushed Marisa and some others out of harm's way. This picture showing him hit by the car flipping in the air. People need to admit what went on yesterday was wrong. Reporter: This morning grapc images like this showing white nationalists beating 20-year-old de'andre Harris with sticks, going viral. We were walking down and they bum rushed us and they just beat me with the poles. Reporter: Adding to the chaos a freak helicopter crash killing two Virginia state troopers responding to the protests. Pilot Berke bates and lieutenant Jay Cullen. The unrest spilling over Sunday as Jason Kessler, the organizer of the unite the right rally spoke out. I would like to condemn any of the violence that happened yesterday. Reporter: But was suddenly mobbed. Kessler tackled to the ground as police escorted him to safety. Now, fields is expect to be in court this morning as are many of the demonstrators arrested over the weekend. Robin. Eva, many noted that over the weekend during those protests that they saw police officers just standing by and not doing anything as the protesters clashed and so some are asking did law enforcement do enough. Reporter: That's right, robin. There's been a lot of criticism as to if law enforcement should have done more to separate the two sides. The other big question, a lot of the streets in this downtown area were supposed to be closed until:00 P.M. That day. The question this morning, did that happen? Robin. A lot of questions. Eva, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Eyewitnesses describe Charlottesville protests that left 3 dead",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/eyewitnesses-describe-charlottesville-protests-left-dead-49201680"
}