{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 08:04:56+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fchurch-joins-australia-child-abuse-compensation-plan-55548522.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_4d4e0f1d18aa40e6b76071ad1f5702d8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Four in five victims of child sexual abuse in Australian institutions will be eligible for compensation after three churches, the Scouts movement and the YMCA joined a federal government redress plan, an official said on Thursday.\nThe Catholic Church, Australia's largest denomination, on Wednesday became the first non-government institution to commit to the 3.8 billion Australian dollar ($2.9 billion) national plan.\nThe Anglican Church, Salvation Army, Scouts Australia and the Young Men's Christian Association, better known as YMCA, committed to join on Thursday.\nFlanked by representatives of the churches and associations, Social Services Minister Dan Tehan said their participation meant that 80 percent of Australia's 60,000 known abuse victims were now covered by the plan.\n\"Can I thank the institutions who are here with us today for the leadership that they have shown, for owning up to past wrongs, for owning up for behavior which can only be described as despicable and deplorable ... for wanting to turn a page, to provide redress and make sure that those survivors get the justice that they deserve,\" Tehan said at Parliament House.\nThe Catholic Church estimates it alone will be liable for about AU$1 billion ($757 million) in compensation.\nArchbishop of Adelaide Philip Wilson last week became the most senior Catholic cleric in the world to be convicted of covering up child sex abuse. He faces a potential two-year prison term when he appears in court in June to be sentenced for protecting a pedophile priest in the 1970s.\nPope Francis' former finance minister, Cardinal George Pell, faces trial on sexual assault charges in Australia. The exact details and nature of the charges have not been disclosed to the public, though police have described them as \"historical\" sexual assaults, meaning they are alleged to have occurred decades ago.\nCatholic leaders have long backed a national redress plan but the churches, charities and other non-government institutions needed the state and territory governments to sign on first.\nWestern Australia would be the final state to join, although state Attorney-General John Quigley said the negotiations with the federal government could be finalized within two months.\nTehan said the plan was on track to begin on July 1 if legislation passes the Senate.\nThe plan will cover people who were sexually abused as children by institutional figures over decades. Payments will be capped at AU$150,000 ($113,000), with previously received compensation being deducted from any new amount.\nThe plan was recommended by the Royal Commission into Institutional Responses to Child Sexual Abuse, which made its final report in December.\nAustralia's longest-running royal commission — which is the country's highest form of inquiry — had been investigating since 2012 how institutions responded to sexual abuse of children in Australia over 90 years. The inquiry heard the testimonies of more than 8,000 survivors of child sex abuse. Of those who were abused in religious institution, 62 percent were Catholics.",
    "source_domain": "abcnews.go.com",
    "title": "Churches, Scouts and YMCA join Australian abuse redress plan",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/church-joins-australia-child-abuse-compensation-plan-55548522"
}