{
    "authors": [
        "Abc News",
        "Stephanie Ebbs",
        "More Erin",
        "More Stephanie"
    ],
    "date_download": "2018-02-02 22:27:41+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Ben Carson Jr. invited \"business associates,\" prompting ethics concerns.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Finvestigators-probing-ben-carsons-son-involvement-fathers-official%2Fstory%3Fid%3D52804921.json",
    "image_url": "http://a.abcnews.com/images/Politics/ben-carson-03-gty-rc-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Federal investigators are looking into why Housing and Urban Development Secretary Ben Carson included his son Ben Carson Jr. in an agency \"listening tour,\" despite objections from HUD attorneys, an Inspector General spokesperson confirmed to ABC News.\nInterested in Ben Carson? Add Ben Carson as an interest to stay up to date on the latest Ben Carson news, video, and analysis from ABC News. Add Interest\nCarson Jr., a Maryland businessman, invited several \"business associates\" to his father's Baltimore roundtable in June, which was meant to explore attitudes toward low-income housing.\nJoe Raedle/Getty Images\nAccording to a department memo, first reported by The Washington Post and obtained by ABC News, lawyers repeatedly warned against including Carson Jr.'s involvement, which they worried would \"gave the appearance that the secretary may be using his position for his son's private gain\" and run afoul of ethics rules.\nJoe Raedle/Getty Images\nCarson Jr. told lawyers \"nothing we would do would be in conflict\" and indicated he was comfortable that \"our businesses are being insulated,\" according to the memo.\nHis father, Secretary Carson, said that because his son was the largest employer in Maryland, it would be difficult to conduct a listening tour without including him.\nJoe Raedle/Getty Images\n\"My goal in Baltimore was to listen and help the people of Baltimore have access to safe, affordable housing,\" Secretary Carson said in a statement to ABC News this week.\n\"I try to be as inclusive as possible and talk with a wide variety of people because when it comes to increasing access to affordable housing, no rock should remain unturned,\" he continued, adding that he would call for an IG investigation \"to clear up any suspicion.\"",
    "source_domain": "abcnews.go.com",
    "title": "Investigators probing Ben Carson's son involvement in father's official business",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/investigators-probing-ben-carsons-son-involvement-fathers-official/story?id=52804921"
}