{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 22:41:52+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Atlanta: Concrete highway rupture sends motorcyclist flying",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fnorth-south-now-east-west-atlanta-highway-closes-46846491.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_f7fa022ce3ff44a69a61185162d6c041_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Another major highway through Atlanta was partially shut down on Monday, this one after underground utility work caused the pavement to rise up, break apart and send a passing motorcyclist flying through the air.\nWhile the east-west highway could reopen as soon as Tuesday, the rupture proved to be another headache for Atlanta area motorists already struggling with the collapse of an overpass on a key north-south route.\nWitnesses said the motorcyclist was riding in the carpool lane when the pavement suddenly rose up in front of him. Others rushed to his aid. DeKalb County spokesman Andrew Cauthen said he was hospitalized with multiple fractures.\nThe buckling was caused by a utility crew using machinery to bore a new natural gas pipeline under Interstate 20, authorities said.\nDeKalb County police spokeswoman Shiera Campbell said a pipeline being filled with concrete ruptured, and the concrete was forced upward.\nThe pressure the pavement to rise and break apart, creating a mound as high as six feet (two meters) or more in the High Occupancy Vehicle lane.\n\"Work was being performed in the area on behalf of Atlanta Gas Light,\" company spokeswoman Melissa Clontz said. \"This incident was not caused by and did not involve the release of natural gas.\"\nCounty spokeswoman Sarah Page said all westbound lanes were closed until further notice several miles southeast of downtown Atlanta. Westbound traffic was being diverted at Interstate 285, the city's perimeter highway.\nRepair crews were inspecting the area with ground-penetrating radar, said Natalie Dale, a spokeswoman for the Georgia Department of Transportation.\nShe said they are hoping to have a few of the adjacent lanes open Monday evening and the entire road open by noon on Tuesday.\nThis latest infrastructure problem added hassles to commutes already complicated by the collapse last month of an overpass on Interstate 85, due to a fire that police say was intentionally set.",
    "source_domain": "abcnews.go.com",
    "title": "Atlanta: Concrete highway rupture sends motorcyclist flying",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/north-south-now-east-west-atlanta-highway-closes-46846491"
}