{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 03:20:45+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Judge, Hicks, Sanchez homer to lift Yankees over Mets 4-2",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjudge-hicks-sanchez-homer-lift-yankees-mets-49219378.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_4ffaad6259ab4f0eae154efdd6e7e7e8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Aaron Judge hit a tying home run in the sixth inning, Aaron Hicks and Gary Sanchez went deep in the eighth and the New York Yankees rallied to beat the Mets 4-2 Monday night in the first of four Subway Series matchups this week.\nCurtis Granderson and Yoenis Cespedes homered in the third inning off Luis Cessa to give the Mets a 2-0 lead at Yankee Stadium.\nSanchez started the Yankees' comeback with a sacrifice fly in the fourth against starter Rafael Montero. Two innings later, Judge hit his AL-leading 36th home run — just his sixth since the All-Star break. The ball was dropped in the right-center field bleachers by a fan wearing a Judge jersey.\nHicks, who returned last week from an oblique injury, homered against Hansel Robles (7-4) leading off the eighth, his career-best 12th of the season. Sanchez connected two batters later against Erik Goeddel. With 20 homers, Sanchez matched his total in his rookie season last year.\nDavid Robertson (6-2) pitched a hitless eighth, and Dellin Betances finished a six-hitter for his seventh save, throwing a called third strike past Mets rookie Amed Rosario to end the game with a runner on.\nYankees manager Joe Girardi rested closer Aroldis Chapman, who took the loss after blowing a ninth-inning lead against Boston on Sunday night and threw 46 pitches over the previous three days.\nWith their ninth win in 13 games against the Mets, the Yankees closed within 4 1/2 games of the AL East-leading Red Sox.\nThe Yankees had lost two of three to Boston over the weekend. After the Subway Series, they go to Fenway Park for three games.\n\"I've been laughing because our rivalry week is actually 10 days long,\" Girardi said.\nWhile the Yankees weren't playing an AL East rival, the crowd had an edge for a matchup of crosstown teams.\n\"It's big, because one of my best friends in New York is a Mets fan and I don't want to listen to him,\" Girardi said.\nWith the Mets out of contention and experimenting with prospects, Rosario, a 21-year-old shortstop, and 22-year-old first baseman Dominic Smith made their Subway Series debuts.\n\"This is as close to the playoffs as it gets,\" said Mets outfielder Michael Conforto, who entered with 10 home runs in his previous 25 games. \"It's that kind of atmosphere here in the Subway Series, so we're pretty fired up for it.\"\nTwo injury-ravaged rotations led to a matchup of starting pitchers who had combined for a 1-11 record this season.\nCessa was recalled from Triple-A to start because Masahiro Tanaka is sidelined with right shoulder inflammation. The Mets acquired Cespedes from Detroit two years ago in a trade that sent Cessa to the Tigers, who later dealt him to the Yankees.\nCessa allowed five hits in 4 1/3 innings and reached 99 mph with his fastball. The right-hander left after two visits to the mound from a trainer, stretching his arm. He had discomfort behind his pitching shoulder and is scheduled for an MRI on Tuesday.\nGranderson, who played for the Yankees from 2010-13, sent a low slider into the second deck in right. Cespedes reached out for a high fastball and drove it to right-center, where it ticked off the glove of a leaping Judge, hit the top of the wall and bounced over.\nSanchez's sacrifice fly traveled only 273 feet. Cespedes' throw from left was up the third-base line, and the speedy Hicks made a nice feet-first slide to the inside of the plate to evade catcher Rene Rivera.\nMontero gave up five hits over six innings and is 0-4 in eight outings since winning at San Francisco on June 25.\nWHIFF\nJudge took a called third strike in the first inning and has fanned in 31 consecutive games, five shy of the major league record for a position player set by Adam Dunn during his last four games in 2011 and first 32 the following year.\nTRAINER'S ROOM\nMets: All-Star closer Jeurys Familia, recovering from surgery in May to repair a blocked artery near his right armpit, is to make his first minor league rehabilitation appearance on Tuesday in the rookie-level Gulf Coast League. ... RHP Matt Harvey (stress injury to right shoulder) will make a second rehab appearance this week, but the Mets haven't determined where. Sidelined since mid-June, Harvey threw 18 pitches in one inning for Class A Brooklyn on Saturday. \"Hopefully, we can get the pitch count up,\" manager Terry Collins said. ... RHP Noah Syndergaard, who hasn't pitched since April 30, is to throw a bullpen session Tuesday for the first time since tearing a lat muscle.\nUP NEXT\nRHP Jacob deGrom (13-5) starts Tuesday night for the Mets against RHP Sonny Gray (6-7). DeGrom pitched 6 2/3 scoreless innings to win at Philadelphia on Thursday, leaving after Nick Williams lined a single off his right triceps. Gray is 0-2 since the Yankees acquired him from Oakland, losing at Cleveland and Toronto.\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "Judge, Hicks, Sanchez homer to lift Yankees over Mets 4-2",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/judge-hicks-sanchez-homer-lift-yankees-mets-49219378"
}