{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 02:53:02+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Blaze Bernstein's parents say he was gay and may have been the victim of a hate crime.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fman-pleads-guilty-fatally-stabbing-high-school-classmate-52808976.json",
    "image_url": "http://a.abcnews.com/images/WNT/180202_wn_sandell_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Man pleads not guilty to fatally stabbing former high school classmate\nNext tonight here, the 20-year-old accused of killing former classmate, blaze Bernstein in a park. He was in court just a short time ago. What we learned from ABC's Clayton Sandell. Reporter: The 20-year old Samuel Woodward appeared in court this afternoon. Charged with stabbing to death 19-year-old blaze Bernstein. More than 20 times. Leaving his former high school classmate in a shallow grave. Bernstein's parents say their son was gay and may have been the victim of a hate crime. He was a gentle soul. He would never hurt anyone. Reporter: Today the prosecutor was avoiding questions about motive, but saying they are out for justice. We're not failing to pursue any charges. We're going to pursue every charge that's open. Reporter: But calling for new laws calling for punishments for the death penalty for murdering a victim because of their sexual identity. Look at the law, and looking at the law tells is it's not a special circumstance. We think it should be fixed. Reporter: Prosecutors also not commenting on a Republican report that Woodward joined a neo-nazi group in 2016, traveling to Texas for three days of military-style combat training. Today, prosecutors said that before wood ward was arrested, he changed his hair color and even used countersurveillance driving techniques to avoid being followed. The judge set his bail at $5 million, David?\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Man pleads not guilty to fatally stabbing former high school classmate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/man-pleads-guilty-fatally-stabbing-high-school-classmate-52808976"
}