{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 10:42:31+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "ABC News' Rachel Scott interviews Moser, an outspoken critic of President Donald Trump.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftexas-congressional-candidate-laura-moser-daca-hurricane-harvey-52814096.json",
    "image_url": "http://a.abcnews.com/images/Politics/180203_vod_laura_moser_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Texas congressional candidate Laura Moser on DACA, Hurricane Harvey and Women's March\nMid terms are. Actually approaching can you believe every to Scott your for ABC news we are just 35 days away from the first primary march 6. Now there are counting or may not but who is counting. Obviously Alan good to be held it in Texas congressional district number seven. Are noisy here with us reading that district think Sinatra being today thanks for having me excited to bigger. So this is such an interesting time for your checked and we're route one couple months away from hurricane Harvey a lot of feelings are still rebuilding. Changing demographics in this district and obviously dock which has been on everyone's minds lately. Talk about the state of this district right now on in the demographics omelets happening. Yeah you hit on a lot of hi you know points it is to it is a district very much and flocks a lot of people. Are out of their homes sell and not going to be back before the election and I not just in the march election but the November election. And obviously Texas has one of the highest percentages of doctor recipients in the country. And there's a lot of uncertainty about what has gonna happen and I would say most people in my district like must give on America supports. You know some start of path to legalized status for these kids. And be. Yeah it's it's that big it's a jump ball in many ways because in an average Texas democratic primary in the mid term year we can about 9000 people to vote. Because as I like to say Texas does not arrested as the nonvoting state we expect there to be a vastly higher turnout. This year for the reasons we all understand. But we don't really know what that will be sits very exciting lots of big question marks in the air. Gas and as the nation obviously has been you know a lot of eyes have been on doc a lot of talk has been line. Immigration but Harvey is one name that you cannot seem to forget especially for tax and because so many families are still rebuilding. And so much of that aid is still locked down you know the senate not approving. That ability to you guys the funding unique how much aid do you really think. That you need is there are still a long way to recovery for the people of Houston in people in taxes. Yeah I would argue the Harvey is not at the tip of errands tongs nationally it is a reality that we live with every hour in Houston but. Because of how horrible the storm season wisely because what happened. In California. With the wildfires and because we don't have federal government to really cares about helping people recover I think that it hasn't gotten the attention. That we need Greg Abbott not usually my favorite person the governor of Texas admitted. Did for about 61 billion dollars in federal aid. Did I mean it will be lucky to get a tiny fraction of that even if this bill does get through the senate I think we need most of that aid. And I as they say to people in Texas you know in sandy struck this part of the world. They had a really organized congressional delegation that worked with the city with accounting with the state and god. You know fifty billion dollars and supplemental. Appropriations that we needed. And so I think we need a lot of money. Not just her recovery but for actually preventing the same level of damage in the next storm and that's and we don't think about a lot in. Texas in in this country focusing on prevention rather than always rebuilding and Recovery Act after. In you know the president obviously that exceeded the union address is tonight he's going to be laying out his priorities what you want to see him talk about today. You know I'd be relieved if he didn't insult or denigrate the bass it's portions of our population you know I think that. I'm interested to see what has an infrastructure bill will look like if that is something you know he's mr. pretty hard during the election I haven't heard anything about it. Since I hope it is something that really helps our nation. And can attract bipartisan support so I'm optimistically looking forward to that. But you never know whatever he says in the state of the union vs what he'll tweet at 3 in the morning there's always that gap so now we'll say. His approval ratings have been lulled them on for this president within the first year or so and in return I think a lot of people have. You know challenge that anger into political activists and we've been seeing a lot of people an unprecedented amount of one in running this year for office why did you decide to take acts that. Yellow that's I mean you kind of answered it and the question I am one of those women who never ever ever had an army radar to run for office for even a second. That was really mobilized by the election of Donald Trump I am a mother of two young children one as a Carl. I want to be a model not just from a girl but for my boy to let them know that it's not okay to talk about women the way Donald Trump does that meant. We need more than 90% representation in congress and I. Until you know this meat to move men and everything that has followed the election Donald Trump I'm just proud to be a part of headwinds. All these other women all over the country we have a little secret sorority online and we're all gonna do it we're in this together and organ oil and. 389. Running in the house and loan I love it here those numbers are you know unprecedented we never seen I don't think. In recent history anything like this before. And the woman's march did you march this year I mean how was it you know being in the same place eight a year from last year when this whole movement. Yeah. I did our city our section Washington DC last year. I'm for the women's hearts in this year's in Houston and we organized. A rally through maker daily accent that I I'm no longer it directly involved with but I found a dead after the election we got. Other women who were involved in their assistance via through black lives matter ours sort of reproductive. Justice organizations. Or swing Texas seven laughed groups that are really involved in voter mobilization week got all these strong amazing women to give speeches about. What they were doing and why they were doing and kind of what their journey to resistance looked like and I was standing up there and I cried vice puppets because I was just so miffed at all we're all doing what we can and are little and big ways. And that's how organ and you know it's our country TO. And that's organ every claimant. And a lot of people you know are not creep politicians and I think that's way it is so striking a bow. A lot of women a lot of men to running. Even some of the year fellow opponents. You know doctors. Immigrants that have decided to run for office what are the challenges that. People face their first time running for office that may be don't have this long streak of political activism before or political office. Some firm merely definitely saying I think it's great the people from all lots of life are running. And I think we need more of that all across the board and it's really exciting what we're seeing but I was here for me I hadn't been a public speaker before. And you think I want to run for office that's really fine I'll I'll do that that's going to be great way to change the country but and then a number of let's just fix that have to. You know I run for office again when I win and run for reelection I should say there's so many kind of brass tacks that I want not have to re learn. But it really is so at this is a learning curve logistically of the people you mean and the people you know I thought well I'll just. Rainy amounts may friends and not give me money. And that's all hunted deer and the fact is he here that's not how our XE actually have to called total strangers. And that's still that's still learning curve for me. Saddam yeah I I think they're there early screenings for democratic candidates and I didn't powerful and but I would definitely recommend that people do in just to see some of the skills you have to master. And hiring people it's a very hard I have the world's best campaign manager. But in this season with so many people running there's. It's it's. Buyer's market against her it's it's harder to it's hard to find really town to give up because her seventh of running which is a great great problem to have. And this is a district that is brat and has been read for fifty years you're running against an income into that you know running for his tenth term. You know represented her uncle and it what is that like you know coming from this district that has this history of electing Republicans for a very long time. But you know everyone's pointing towards the fact that this district also voted for Clinton by a very small margin in the in the 2016 election. Yes so it's actually I. I always it's always been read this district it was just redistrict and in 1966 because it there the seventh impressionists and had a Democrat when it was in Waco which is nowhere near Houston so it's a red district. But it's also very educated district 60% college educated very moderate its its poppy Bush's district is James Baker's district. And these are not people who are trump voters. And some nice theory and war testing and on the ground right now I think you don't win elections by. Trying to get the sort of mythical five moderate voters are crossover. You win elections by talking to people honestly about your values and you this values you share with them and whether they are. Republican Democrat libertarian. Independence Day is if you can make people if you can help people to trust you. Then they will vote for you and the other issues and arguments in Texas it's just a matter of getting people to show up the turnout is so. Low that if we can get people excited and think maybe we'll get funding for this hurricane maybe you'll stop cutting people's health care benefits maybe we'll have someone who actually cares. About the lives of the people who live here than maybe they'll vote a different way. Do you think this state and the issues that are really you know polarizing the country right now with. You know it's disaster relief with the doc is that going to be enough to drive people how and have them get out Kendall in these elections acting normally don't vote in. I think a lot of people have a lot of fear for the future and a broader sense about. Houston yeah I mean I think disaster relief and infrastructure is totally lie for death in Houston and if we didn't know it already. Harvey drove that lesson hump so yes I think that alone. Is enough in my district there's a lot of women and mothers like me who might traditionally vote Republican her very worried about gun violence. And that's supposed to be an untouchable issue in Texas but I find that to be a winning issue. People who just think we regulate everything in this country except guns lake let's bring some sensible moms to the table to start. Talking about that so what's your priority she AG you have the opportunity to be elected sort of what is your goal what's your plan. So yes I would see my top two priorities which are intertwined our infrastructure and health care we have the highest number of a percentage of uninsured people in the whole country. And that is a huge drain on our tax dollars and so I'm trained to read configure the conversation and say. We need this money. It's just not a subsystem moral issue right it's an economic issue like where it's been and 25 cents of every. Dollar in property taxes for health care for uninsured people what if we get another money on infrastructure went up we had someone who really. Was thinking about how we planned our cities and making her see sustainable for the long term. And another issue is the changing you know oil and gas economy is summoned to really invest in helping Houston remain. This world capitals energy whether that means renewals or. You know fossil feel we need to move with the times and we need leaders who are forward thinking. You're running against a lot of different candidates. Lucy Fletcher endorsed by EMILY's List that make you nervous seeing these endorsements that are coming out especially as are getting closer and closer. The primary day. I'm not really because I have a lot of my own support and I'm not an institution on you now. I'm not a person who. It's hard for me to answer this that. No I haven't gotten a lot of great endorsements of my on and I have a volunteer network of 600 people I have a ton of social meaning of ours I have. I think today we might breach 9000 unique donations. To our campaign which is a time for our congressional race so I think that we need to rethink the kind of paradigms of the Democratic Party. The top down endorsements. Don't always lead to electoral victories of November and I'm running a very different kind of groceries candidacy and I'm excited to show. The democratic establishment that this is what's gonna win. So for any Texan that are listening out bearer he does anyone in general that. Is contemplating. Voting in the mid terms does it really matter and I really gonna make a difference. Would you say to people like. That are just even contemplating whether or not. Their voice matters I think a lot of people in America right now are feeling discouraged. I'm frankly. And obviously there is ill large portion that is also be very happy with the way that things are going in this country in the week that we are moving but politics aside whether or not who you're voting for what would you say to those people matters noted beating letter and even and it costs about. Well I think. We should just carry around an article about house of delegates race in Virginia that was decided by a draw from a hat. There is a difference of wine you know as a Thai election and that determined. Who controlled house of delegates in one of the largest states in the country and who. Democrats lost their chance to controlled by a hat dropped so every vote really really does count and that's really what we're babbling in Texas is apathy. And with the gerrymandering we have and the really restrictive voter registration laws and voter idealized people feel like why should I bother voting it's did. Result is predetermined and I want to tell people that if we all show up. There are more fuss out there decent Americans who share the same values and we just have to shop and make our voices heard. Well before we gal I have to ask about the buyer a photo of growing south. I got aired because. I went out looking you up and I was researching ad I remembered this photo going marrow of your daughter. And Olaf see your husband had worked pretty about an industry change and just cut it like there herself but the president's feet catalog is there what happened. Yeah I mean we all on sieve said that we did that riot and only client gets to say that. It wasn't that it wasn't up ticket deal. The time she was to look and she wanted to take off her dress and put on a seat and I said like. No no sweetie we're not gonna do that because in the way that you know you just want to get through the next moment. You wanted to get the picture of the president and get her out of there and she. Didn't want to hear about it said the second he liked and she threw herself you know she didn't want to be told now and like many two year olds she made herself known and you know. President Obama is as we all know he is exactly what he seems like on TV and in interviews and he just I did not for 12 think oh my god the president the United States is gonna judge me. Because he's the dad Fiat the end of the first lays a mom they understand that you get these situations and they kids will be kids. And anyway my daughter is a great inspiration to me and she is now five and see if we can all look far to voting for her for president one day. I left snap photos going to be just a valid part of her narrow Jack. He always spoke her mines. I love OK last question I love asking candidates to fund back something that. It did you don't know about China we talk a lot about the issues but anything that can help people really get to know who you are as a Paris and. That doesn't that question and high school and college and made a living on designing my own story. Is that because I worked my way I worked through college an aide to I was I'm and they still have some and wars I wore a necklace that I mean. I would still do it if I had time permanently I have to give you high. Children involved in handicraft. 35 days left to the I would not be exactly units are yeah I have not that is not entirely campaigns of carbon that is a fund fact that it's a good luck I always get stuck on that question so that I used to company arc and go you know into lake 32 street and 33 street as. Stores that serve wholesale deeds stores and stuff like that and yeah. Companies and highs clad go to parties and teach kids how to make stuff. Well we're so lucky to have grabbed you I love fun fact yes critic at people and hunger and. They are being creative. And while you're in New York City only a couple hours we appreciate you stopping by love being Hennessy flight back to Texas thank you so much we had a bumpy ride in the ninth when it down final countdown Harry thinks so it's no surfer congress dot com thinking am I appreciate it.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Texas congressional candidate Laura Moser on DACA, Hurricane Harvey and Women's March",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/texas-congressional-candidate-laura-moser-daca-hurricane-harvey-52814096"
}