{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 19:55:23+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Dixon County Sheriff Joe Bledsoe made an emotional appeal for the public's help in finding a person of interest believed to be connected to the shooting death of a sheriff's deputy.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fhearts-shattered-sheriff-pleads-deputys-death-55537263.json",
    "image_url": "https://s.abcnews.com/images/US/180530_vod_orig_sheriff_presser_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'Our hearts shattered': Sheriff pleads for help after deputy's death\nThere's not much I can site today other than our our hearts shattered with the assistance Lamar vest deputies. Vis a supervisor. He's worked his layup to sergeant on patrol. And he's one of the guys it puts it on the line every day to keep our communities safe and he was doing that again today we just all of a suspicious vehicle. And then you see what can transpire from something that. We think it's just a suspicious vehicle and people question a sometimes it while worse so old age. And while there's more than one dead deer while there are multiple cars this is a prime example of why we have to take care of each other take care of our citizens. We just as for your help. Negating the photo and information out. So that we can hold this person responsible and fully accountable. And it is my prayer. It is my prayer to god. That are court will be a chair to if you don't look. Thelma punishment he receives.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'Our hearts shattered': Sheriff pleads for help after deputy's death",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/video/hearts-shattered-sheriff-pleads-deputys-death-55537263"
}