{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2018-02-03 17:03:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Students erupt into dancing after finding out they’re going to see ‘Black Panther’",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fstudents-erupt-dancing-finding-theyre-black-panther%2Fstory%3Fid%3D52807213.json",
    "image_url": "http://a.abcnews.com/images/GMA/180202_vod_students_dancing_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tickets to see the highly anticipated film \"Black Panther\" are very hard to come by -- even star Lupita Nyong'o couldn't nab opening night tickets and she's starring in it.\nSo when students at Ron Clark Academy in Atlanta found out they were going to see the film, they erupted into dancing to an instrumental from the \"Black Panther\" soundtrack in a now-viral video on Twitter.\n\"They flipped out,\" Wade King, the school's director of curriculum and instruction, told ABC News. \"It was like an explosion of just pure joy.\"\nIMDB\nKing got the honor of telling the students Friday in their weekly school-wide meeting after he and fellow teacher Susan Barnes came up with the idea to marry the upcoming Marvel film with curriculum.\nStudents at Ron Clark will use the comic books to learn about imperial history, and African art. They'll even be using \"Black Panther\" in their math, science and gym curriculum, King said.\nABCNews.com\nBefore the kids found out their big surprise Friday, a few eighth-grade students opened their 30-minute meeting with an African-inspired spoken-word performance.\nSome of our Ya’heard poets from RCA setting the tone for our Black Panther integration! @ArauzingInk #ronclarkacademy #blackpanther pic.twitter.com/N1Obb588Jj — Wade King (@WadeKing7) February 2, 2018\nNow they're even more excited to learn about \"Black Panther\" in their curriculum, King said.\nMarvel Studios\n\"Everyone was super excited. It was just very emotional,\" he added. \"It was awesome just seeing them super excited about it.\"\nMarvel, like ABC News, is owned by the Disney Company.",
    "source_domain": "abcnews.go.com",
    "title": "Students erupt into dancing after finding out they’re going to see ‘Black Panther’",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/students-erupt-dancing-finding-theyre-black-panther/story?id=52807213"
}