{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 06:15:35+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Seahawks' Bennett plans to continue national anthem protest",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fseahawks-bennett-plans-continue-national-anthem-protest-49199892.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/seahawks-bennett-plans-continue-national-anthem-protest-49199892",
    "language": "en",
    "localpath": null,
    "maintext": "Seattle Seahawks defensive end Michael Bennett said Sunday he will sit during the national anthem this season to protest social injustice and segregation.\nBennett sat on the visiting bench during \"The Star-Spangled Banner\" before the Seahawks' preseason opener against the Los Angeles Rams, a decision he made prior to protests by white supremacists at the University of Virginia over the weekend. But what happened in Charlottesville, Virginia, including the death of a young woman when she was struck by a car deliberately driven into a group of counter-protesters on Saturday, solidified Bennett's decision.\n\"With everything that's been going on the last couple of months and especially after the last couple of days, seeing everything in Virginia, seeing what's going on out there earlier today in Seattle, I just wanted to be able to use my platform to be able to continue to speak over injustice,\" Bennett said.\n\"First of all, I want people to understand I love the military. My father was in the military. I love hot dogs like any other American. I love football like any other American, but I don't love segregation. I don't love riots. I don't love oppression. I don't love gender slander. I just want to see people have the equality that they deserve, and I want to be able to use this platform to continuously push the message of that, you know, and keep journeying out and keep finding out how unselfish can we be as a society.\"\nBennett was at least the third prominent NFL player to protest during the anthem in the first full week of preseason games. Oakland Raiders running back Marshawn Lynch, a former teammate of Bennett's in Seattle, also sat during the anthem. Los Angeles Rams defensive end Robert Quinn raised his right fist, continuing his approach from last season following then-San Francisco 49ers quarterback Colin Kaepernick's decision to kneel during the anthem.\nKaepernick is a free agent, and the controversy over his decision to protest the anthem and the form he used has not quelled, even as he remains unsigned.\nBennett said he is willing to deal with similar fallout.\n\"Of course I'm going to face backlash,\" Bennett said. \"This is bigger than me. This is bigger than football. This is bigger than anything that we have. This is about people. This is about bringing opportunities to people, giving people equality. This is bigger than a sport.\"\nBennett said he had spoken to several other NFL players about possible protests, but had not talked with Lynch yet. While he acknowledged the possibility of more widespread and formally organized protests happening later, Bennett wanted to express himself.\n\"I think everybody has a time where they feel like they need to be who they are and stand up for what they believe in,\" Bennett said.\nSeahawks coach Pete Carroll did not have a response to Bennett's actions, saying he only became aware of it after the game.\nBennett said the aim of his protest is to make people uncomfortable. In the process, he hopes to spur greater communication, understanding and involvement across racial, gender and socio-economic lines.\n\"Everyone is in their comfort zone right now,\" Bennett said. \"Get out there and become uncomfortable. Go out there and see what it's like out there in society right now.\"",
    "source_domain": "abcnews.go.com",
    "title": "Seahawks' Bennett plans to continue national anthem protest",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/seahawks-bennett-plans-continue-national-anthem-protest-49199892"
}