{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 17:23:05+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmotive-elusive-van-driver-kills-10-toronto-sidewalk-54681207.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_c8980cb1f86244479724df8a57de5d25_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The 25-year-old suspect who plowed a van into a crowded Toronto sidewalk was ordered held Tuesday on 10 counts of murder and 13 of attempted murder as Canadian authorities and the public sought to make sense of one of the deadliest mass killings in the country's modern history.\nAlek Minassian showed little emotion as he made a brief appearance in a Toronto courtroom in a white jumpsuit and handcuffs. The judge ordered him detained without bond and scheduled the next hearing for May 10.\nHis father, Vahe Minassian, cried and looked stunned inside the courtroom. Asked outside if he had any message for the families of the victims, he said quietly: \"I'm sorry.\"\nPolice, meanwhile, continued to gather evidence. About 20 officers made their way down the van's deadly path on Yonge Street, which remained closed to traffic on Tuesday and taped off with yellow crime scene tape. Nearby, mourners had put together a makeshift memorial to the victims.\n\"It was like he was playing a video game, trying to kill as many people as possible,\" said Panna Patel, 42, who stopped by the memorial and had been at the scene a day earlier, getting cash from an ATM. \"He was looking people directly in the eye, making eye contact, it was so scary. He wasn't remorseful at all.\"\nPrime Minister Justin Trudeau dismissed the possibility of terrorism, saying that authorities saw no national security element in the case.\nHe told a news conference that the incident \"hasn't changed the overall threat level in Canada,\" though it occurred as Cabinet ministers from the G7 nations were meeting in Toronto.\nAuthorities have not disclosed a possible motive, though \"the incident definitely looked deliberate,\" Police Chief Mark Saunders told reporters at a late-night news conference on Monday.\nSaunders said Minassian, who lives in the Toronto suburb of Richmond Hill, had not been known to police previously. An online social media profile described him as a college student.\nAuthorities released few details in the case, saying the investigation was still underway, with witnesses being interviewed and surveillance video being examined.\n\"We are looking very strongly to what the exact motivation was for this particular incident to take place,\" Saunders said. \"We need every single piece of this puzzle so we can have a fulsome picture and account as to exactly what took place here.\"\nThe driver was heading south on busy Yonge Street around 1:30 p.m. Monday, the streets crowded with people enjoying the first warm day of spring, when the van jumped onto the sidewalk.\nAli Shaker, who was driving near the van at the time, told Canadian broadcast outlet CP24 that the driver appeared to be moving deliberately through the crowd at more than 30 mph.\n\"He just went on the sidewalk,\" a distraught Shaker said. \"He just started hitting everybody, man. He hit every single person on the sidewalk. Anybody in his way he would hit.\"\nAnother witness, Peter Kang, told CTV News that the driver did not seem to make any effort to stop.\n\"If it was an accident he would have stopped,\" Kang said. \"But the person just went through the sidewalk. He could have stopped.\"\nVideo broadcast on several Canadian outlets showed police arresting the driver, dressed in dark clothes, after officers surrounded him and his rental Ryder van several blocks from where the incident occurred in the North York neighborhood of northern Toronto. He appeared to make some sort of gesture at the police with an object in his hand just before they ordered him to lie down on the ground and took him away.\nWitness Phil Zullo said that he saw police arresting the suspect and people \"strewn all over the road\" where the incident occurred.\n\"I must have seen about five, six people being resuscitated by bystanders and by ambulance drivers,\" Zullo said. \"It was awful. Brutal.\"\nPolice shut down the Yonge and Finch intersection following the incident and Toronto's transit agency suspended service on the subway line running through the area. The stretch of Yonge Street where the victims were struck was expected to stay blocked off for several days as police continue what is likely to be a lengthy investigation. Most businesses in the area were closed.\nTrudeau on Monday expressed his sympathies for those involved.\n\"We should all feel safe walking in our cities and communities,\" he said. \"We are monitoring this situation closely, and will continue working with our law enforcement partners around the country to ensure the safety and security of all Canadians.\"\nThe incident prompted police to beef up security and close several streets around the Air Canada Centre on Monday night for the Toronto-Boston NHL playoff game. Police tweeted that similar road closures may be in effect for the Toronto Raptors NBA playoff game on Wednesday night.\nThe incident occurred as Cabinet ministers from the major industrial countries were gathered in Canada to discuss a range of international issues in the run-up to the G7 meeting near Quebec City in June. Canadian Public Safety Minister Ralph Goodale called the incident a \"horrific attack\" and said the G7 foreign ministers extended their condolences.\n———\nAssociated Press writers Ben Fox in Miami, and Rob Gillies in Ocho Rios, Jamaica, contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Toronto driver charged with 10 counts of 1st degree murder",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/motive-elusive-van-driver-kills-10-toronto-sidewalk-54681207"
}