{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:52:30+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-national-security-threat-van-case-54688333.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_b00e058ca90d4f589bb1af046ec8d4c7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the incident in which a van plowed down a Toronto sidewalk, killing and injuring several people (all times local):\n11:05 a.m.\nThe president of Toronto's police union says an officer's behavior in arresting a suspect in Monday's deadly van attack was \"one shining moment\" in an otherwise horrific day.\nMike McCormack of the Toronto Police Association said Tuesday \"We're extremely proud of him,\" and adds, \"He may have prevented additional deaths.\"\nVideos circulating on social media show the officer confronting the suspect even as he points a dark object toward the officer.\nThe officer refuses to shoot and repeatedly yells for the man to get down.\nThe suspect warns he has a gun in his pocket.\nAnd he can be heard saying: \"Shoot me in the head.\"\nFrom a high-rise window, another video appears to show the suspect walking backward with his arms raised as the officer moves toward him.\nThe suspect eventually goes to the ground and street-level footage shows the officer kneeling over him as he lies on the pavement.\n———\n10:25 a.m.\nA judge in Canada has ordered the 25-year-old man suspected of plowing a van into pedestrians in north Toronto detained on 10 counts of first-degree murder and 13 of attempted murder.\nSuspect Alek Minassian learned of the charges in a brief initial hearing before a judge in Toronto on Tuesday.\nMinassian wore a white jail jumpsuit and had his hands handcuffed. He showed little emotion.\nHe was asked to say his name and if he understood an order not to have any contact with anyone injured in Monday's crash scene on a busy sidewalk.\nHe did not enter a plea to the charges and was ordered to return to court on May 10.\n———\n9:25 a.m.\nThe president of Invesco Canada says one of the financial company's employees was among those killed in when a van plowed into pedestrians in Toronto.\nPeter Intraligi says the company's \"thoughts and prayers\" were with \"all those impacted by this tragic event.\"\nThe company had earlier issued a statement saying two of its employees were affected.\nA new statement from Intraligi says \"I can now confirm that unfortunately one of our employees has succumbed to her injuries.\" He added: \"Out of respect for her and her family, we will not be providing any further comments.\"\nPolice are trying to determine why a driver plowed a rented van along a crowded sidewalk in Toronto, killing 10 people and injuring 15 in what many said seemed a deliberate attack.\n———\n8:55 a.m.\nCanadian Prime Minister Justin Trudeau says authorities see no national security element in the seeming attack on pedestrians in Canada's largest city.\nTrudeau says the incident \"hasn't changed the overall threat level in Canada,\" though it occurred as Cabinet ministers from the G7 nations are meeting in Toronto.\nTrudeau says Canada will do whatever it can to keep its citizens safe, while staying true to its values.\nSpeaking at a news conference Tuesday, he said, \"We cannot as Canadians choose to live in fear every single day as we go about our daily business.\"\nPolice are trying to determine why a driver plowed a rented van along a crowded sidewalk in Toronto, killing 10 people and injuring 15 in what many said seemed a deliberate attack.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Praise for officer who arrested Canada suspect",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-national-security-threat-van-case-54688333"
}