{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-15 04:51:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Bettis back from cancer treatment, Rockies blank Braves 3-0",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fbettis-back-cancer-treatment-rockies-blank-braves-49219777.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_f18d0da631a04ce3986675e67592dbda_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chad Bettis drew a standing ovation when he took the mound for the first time since cancer treatment, then threw seven impressive innings Monday night as the Colorado Rockies beat the Atlanta Braves 3-0.\nBettis scattered six hits, walked none and struck out two. He hadn't pitched in the majors since being diagnosed with testicular cancer in November.\nBettis had surgery for the condition, but tests in March showed the cancer had spread to his lymph nodes. He later underwent chemotherapy.\nThe crowd at Coors Field gave Bettis a big cheer as he went out to pitch the first inning. The Braves' best chance to score against him came when Ender Inciarte led off with a triple, but he was thrown out trying to stretch it to an inside-the-park home run.\nThe 28-year-old Bettis led Colorado in starts (32), wins (14) and innings (186) last season. He left for a pinch-hitter in the seventh with the game still scoreless.\nColorado scored three times in the eighth off Rex Brothers (2-3), who relieved starter Julio Teheran. The Rockies began the tied with Arizona for the top NL wild-card spot.\nMike Dunn (5-1) got the win and Greg Holland closed for his 35th save. Holland, who had blown his previous two save chances, gave up a single and walk in the ninth before getting the last out.\nTeheran allowed four hits and struck out eight in seven innings.\nCharlie Blackmon led off the Colorado eighth with a triple. After an intentional walk, Gerardo Parra singled through the drawn-in infield to put the Rockies ahead.\nCarlos Gonzalez's two-run single off Jason Motte gave Colorado some insurance.\nTRAINER'S ROOM\nBraves: OF Matt Kemp (right hamstring strain) did some running and is scheduled to do more Wednesday. He will take Thursday off but could play Friday against Cincinnati.\nRockies: OF/1B Ian Desmond (right calf strain) did some hitting and running on Colorado's recent road trip.\nCRISIS AVERTED\nThe Rockies got a scare Sunday when All-Star 3B Nolan Arenado, who leads the majors with 100 RBIs, left the game in Miami after being hit on the left hand with a pitch. He and the team feared he suffered a broken bone but X-rays showed only a bruise.\n\"I was a little surprised. I thought I broke it,\" Arenado said Monday. \"It got super tight right after. Last time I broke my finger, and I've broken bones before, it gets super tight and it usually comes out broken.\"\nHe didn't start but he pinch-hit in the seventh, fouling out to first.\n\"I'm good to go. It hurts but I've dealt with worse pain,\" he said. \"It's not as swollen as we thought it was going to be. It's just pain tolerance.\"\nBAYLOR TRIBUTE\nBefore the game, the Rockies honored Don Baylor, the club's first manager, with a video tribute and a moment of silence. Baylor, who managed Colorado in the first six seasons, passed away Aug. 7 at age 68 after a 14-year battle with multiple myeloma. The Rockies hung his jersey in their dugout.\nUP NEXT\nBraves: LHP Sean Newcomb (1-7, 4.45) will make his 12th start of the season on Tuesday.\nRockies: LHP Kyle Freeland (11-7, 3.70) will return from a left groin strain to make his first career start against Atlanta on Tuesday.",
    "source_domain": "abcnews.go.com",
    "title": "Bettis back from cancer treatment, Rockies blank Braves 3-0",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/bettis-back-cancer-treatment-rockies-blank-braves-49219777"
}