{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 15:41:47+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Less-is-more philosophy would serve Jay Monahan, PGA Tour well",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fphilosophy-serve-jay-monahan-pga-tour%2Fstory%3Fid%3D44511267.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r149850_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Whoever said you can never have too much of a good thing never watched the PGA Tour very closely. Last year, there was a one-week hiatus between the Ryder Cup and the next season; this year, there probably will be no such break between the Presidents Cup and the next one.\nThe result is a market too saturated from this never-ending schedule. Many players feel pressure to continue competing year-round due to fear of falling behind their peers. Even worse, fans never get a chance to miss it, because it never goes away.\nI not only believe new commissioner Jay Monahan should fix this issue, I think he will.\nWhen the FedEx Cup was first implemented, then-commish Tim Finchem spoke of the need to conclude before football season. Nice idea, but the Tour Championship still coincides with football, as does the start of the following PGA Tour campaign each year.\nAll of which leads to this suggestion for Monahan as he takes over in the role: shorten the FedEx Cup playoffs to three events instead of four (which will make it more imperative for the top players to play each of 'em) and conclude the festivities on Labor Day, preferably on the West Coast, where golf can receive a prime time audience on what is considered the last day of summer. Then don't come back until January, offering a true finale and beginning to each of the seasons that won't bleed into one another.\nThose within the confines of PGA Tour headquarters -- Monahan included -- will publicly contend that this scenario offers fewer playing opportunities for the membership and privately worry that it pushes away willing title sponsors.\nProblem solved. The fall events (which now include an Asian swing) can still be played as part of their own short season. Want more incentive for players? Broker a deal with the powers-that-be at Augusta National which will state that individual tournament winners don't receive Masters invitations, but the top-five on the short-season money/points list do.\nThat will keep players playing, which in turn will keep sponsors happy without blurring the lines for fans from one season to the next.\nEach day this week, ESPN.com will drop a few items into the suggestion box for new PGA Tour commissioner Jay Monahan, who started in his new job on Jan. 1, 2017. Next up: On Tuesday, Jan. 3, Bob Harig writes about announcing player fines and suspensions.",
    "source_domain": "abcnews.go.com",
    "title": "Less-is-more philosophy would serve Jay Monahan, PGA Tour well",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/philosophy-serve-jay-monahan-pga-tour/story?id=44511267"
}