{
    "authors": [
        "Abc News",
        "More Conor"
    ],
    "date_download": "2017-08-14 17:50:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Between North and South Korea, buffer zone with wildlife and the blare of propaganda",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fnorth-south-korea-buffer-zone-wildlife-blare-propaganda%2Fstory%3Fid%3D49205426.json",
    "image_url": "http://a.abcnews.com/images/International/north-korea3a-abc-ml-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The buzzing of cicadas seems at first to drown out any other noise. But then, the\nsound of a voice emerges. Through the insects’ din, there is a voice. It’s staccato, severe, almost angry. It’s the sound of propaganda.\nBlaring from speakers on the other side of one of the world’s most militarized borders are recordings from Kim Jong Un’s propaganda machine – speeches in support of the dear leader, stories of North Korea’s power and prestige, and instructions on how to be a good and loyal citizen.\nThis is the Joint Security Area of Korea’s Demilitarized Zone, perhaps the most famous border between two countries in the world.\nCreated in 1951 as a site for peace talks to end the Korean War, this special administrative zone is where the armed conflict was halted with an armistice signed by the North and South in 1953.\nThere’s never been a peace treaty or an end to hostility -- only a cessation of fighting.\nMention of the DMZ may spark familiar images of the famous light-blue buildings side by side, with soldiers on opposite sides of the line staring at each other across a row of cement blocks, with sand on the north side and gravel on the south.\nIn reality, the DMZ is very large, stretching the entire peninsula, and here at the Joint Security Area, there’s rarely more than a couple people from each side outside, except on a day like today when there are guests. Then, one side will send a small contingent of troops to stand guard as their visitors gingerly walk around, snapping selfies on their phones.\nIf the guests are important enough or draw lots of attention, North Korean soldiers will often rush out, peer through the windows, and snap some photos themselves. Secretary of State Rex Tillerson received that treatment this past February.\nKorea Pool/Yonhap via AP\nAmong those on guard on the southern side of the border are American soldiers. Between 60 and 80 of them live no more than a five-minute drive at Camp Bonifas in the DMZ, a United Nations Command post set up to monitor the armistice.\nThe security area itself is run by the UN Command and North Korea as an area for exchange, and until 1976, soldiers from both sides crossed the border in this area freely. It all changed that year after North Korean troops murdered two U.S. soldiers with an axe as they tried to cut down a tree; the weapon is still kept on display in a North Korean museum just across the border.\nThere haven’t been talks in the security area since 2013 – a sign of the sour relations.\nWhile this one area may be the iconic location, the DMZ is a buffer zone that stretches a mile and a quarter on either side of the border. When the North and South signed the armistice in 1953, they agreed to pull troops back that distance from the Military Demarcation Line, which meanders diagonally 155 miles across Korea near the 38th Parallel.\nABC News\nThe 38th Parallel is what most people remember, but it was the original division that cut the peninsula cleanly along the latitude line between Soviet and American influence before the war. The postwar line comes close to it though, and it has effectively divided the peninsula and its people in half ever since.\nAlong the border, now over six decades old, military activity is still forbidden, except at the Joint Security Area. It is a no man’s land that has become a haven for wildlife, with a resurgence of animals like the goral and the white-naped crane.\nThe DMZ has become surprisingly popular for tourists, too. From eco-tourists searching for rare flora and fauna to history buffs climbing into the defunct tunnels that North Korea built under the DMZ and into the South, thousands of visitors flock to the South Korean side to see attractions along the border.\nThere are those tunnels – four that have been discovered – that are as large as seven feet wide and thousands of feet long. Kim Il Sung, the grandfather of the North Korean state and its current leader Kim Jong Un, believed that a quick surprise invasion would be the best way to win a war, and as many as 2,000 of his soldiers could have flooded into the South every hour using one tunnel.\nAbove ground, the much wealthier South Korea has built observatories overlooking North Korea, who has tried to mask the poverty of its people by constructing propaganda villages – empty areas, but blaring the music or messages of the regime.\nABC News\nWhile the music or the propaganda may seem funny at times, it’s worth remembering that that armistice means there is no peace – and just behind the speakers, less than two miles away, lie 14,000 tubes of artillery aimed at the South and an army of over 1 million North Koreans devoted to their dear leader.\nSeventy percent of North Korea’s army is within 60 miles of the border, and 50 percent of its navy and air force are that close as well.\nOn the southern side, the might of the U.S. military backs up very capable South Korean armed forces. There are 28,500 Americans troops stationed in South Korea, not to mention the massive weaponry or the naval ships on rotation to the region.\nWith the two sides entrenched in this decades-old conflict – one that seems to be escalating with increasingly bellicose language from President Trump and Kim Jong Un – it seems like after all this time, those propaganda messages may be falling on deaf ears.",
    "source_domain": "abcnews.go.com",
    "title": "Between North and South Korea, a buffer zone with wildlife and the blare of propaganda",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/north-south-korea-buffer-zone-wildlife-blare-propaganda/story?id=49205426"
}