{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:20:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The Latest: Migrant exodus from Libya amid warm weather",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-migrant-exodus-libya-amid-warm-weather-46859590.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_c2db8b9f13ff4d0f9afe025ad882d57a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on migration issues in Europe (all times local):\n2:05 p.m.\nAid groups say the recent spike in Mediterranean migrant rescues corresponds with improved weather conditions and the looming start of beefed-up Libyan coast guard patrols that could block migrants from reaching Europe.\nOver Easter weekend, rescue ships plucked some 8,360 people from 55 different rubber dinghies and wooden boats off Libya's coast. Thirteen bodies were also recovered. While such numbers are not unusual, they come as Italy is due to deliver patrol boats to Libya in coming weeks as part of a new EU-blessed migration deal.\nAn International Organization of Migration spokesman says smugglers are telling customers: \"You have to hurry up and leave the country right now because otherwise in a couple of months you will be rescued by the Libyan coast guard and you will be sent back.\"\n———\n12:30 p.m.\nGerman authorities say there were 169 violent offenses against homes for asylum-seekers last year, almost as many as in 2015, though the figures sank as the year progressed.\nThe Federal Criminal Police Office said Tuesday that the number of violent offenses compared with 177 the previous years.\nIn all, authorities counted 994 offenses against asylum shelters in 2016, a little below the previous year's 1,031. The police office said that most of them had a far-right motive.\nJustice Minister Heiko Maas wrote on Twitter that the figures were \"deeply shameful.\"\nGermany saw a huge influx of asylum-seekers and other migrants in late 2015 and early 2016. That tailed off about a year ago, and the number of crimes targeting asylum homes declined over the course of the year.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Migrant exodus from Libya amid warm weather",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-migrant-exodus-libya-amid-warm-weather-46859590"
}