{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 22:02:21+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Liukin steps down as US women's gymnastics team coordinator",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fliukin-steps-us-womens-gymnastics-team-coordinator-52803245.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_9565a26d52084b3f8bc05e8865ecd0cb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The coordinator of the women's national team for USA Gymnastics has stepped down, the latest departure to rock the embattled organization in the wake of a sexual abuse scandal centered on former team doctor Larry Nassar.\nValeri Liukin said Friday he was stepping down after taking over for Martha Karolyi in September 2016.\nLiukin said in a statement that while he wanted to help turn the program around, \"the present climate causes me, and more importantly my family, far too much stress, difficulty and uncertainty.\"\nUSA Gymnastics did not immediately respond to a request for comment. Its board of directors stepped down earlier this week under pressure from the United States Olympic Committee.\nThe USOC announced Friday it hired a law firm to conduct an independent investigation into decades-long abuse by Nassar, a longtime doctor for USA Gymnastics and Michigan State University who is awaiting sentencing for assault charges against athletes at a Michigan gym. Nassar has already been sentenced to up to 175 years in prison on similar charges in a separate case completed last week and was previously sentenced to 60 years in prison on child pornography charges.\nLiukin, a four-time Olympic medalist while competing for the Soviet Union, is the father of 2008 Olympic all-around champion Nastia Liukin. He is the longtime owner of World Olympic Gymnastics Academy in Texas and served as the elite development coordinator for USA Gymnastics from 2013 until taking over for Karolyi shortly after the 2016 Olympics.\nLiukin says it's time for him to move in a different direction right now, but he will still support and encourage athletes and coaches from a different vantage point.",
    "source_domain": "abcnews.go.com",
    "title": "Liukin steps down as US women's gymnastics team coordinator",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/liukin-steps-us-womens-gymnastics-team-coordinator-52803245"
}