{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2017-08-14 22:32:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "At least one critic sees Trump's response to Charlottesville as a pattern.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-slow-call-white-nationalists-critics%2Fstory%3Fid%3D49205561.json",
    "image_url": "http://a.abcnews.com/images/Politics/president-trump-gty-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Though President Donald Trump condemned hate groups today following the violence in Charlottesville, Virginia, this past weekend, for some the remarks were too little, too late.\nTrump's immediate response to the violence, which left one dead Saturday after a driver rammed a car into a crowd of people in the midst of violent clashes over a white nationalist rally, was met with bipartisan backlash, particularly because he did not label the ramming an act of terrorism or include a denunciation of white supremacists.\nOne of the president's most vocal critics was Jonathan Greenblatt, the director and CEO of the Anti-Defamation League, who specifically singled out Trump for initially referring to the incident as an “egregious display of hatred, bigotry and violence on many sides.”\nSpeaking today to reporters, Greenblatt lambasted Trump for not taking a swift and strong stance against hate groups on Saturday, something he says the president has done repeatedly.\n\"We have seen a pattern of the president equivocating” when it comes to denouncing hate groups, including white supremacists and anti-Semitic groups, said Greenblatt.\nOne of the clearest examples of this came when then-candidate Trump did not immediately distance himself from the endorsement of David Duke, a former Louisiana lawmaker who was once grand wizard of the Knights of the Ku Klux Klan.\nAt first, Trump declined to disavow the support Duke, insisting during a CNN interview that he needed \"to look at the group\" first, despite being reminded of Duke’s long association with the KKK.\n\"Honestly, I don't know David Duke, I don't believe I've ever met him, I'm pretty sure I didn't meet him, and I just don't know anything about him,\" Trump told CNN on Feb. 28, 2016.\nHe later said he \"disavowed\" Duke and reiterated that throughout the week following the interview.\nAs I stated at the press conference on Friday regarding David Duke- I disavow. pic.twitter.com/OIXFKPUlz2 — Donald J. Trump (@realDonaldTrump) February 28, 2016\nHeidi Beirich, the director of the Southern Poverty Law Center’s Intelligence Project, which tracks hate groups, said that the disavowal of Duke, and the time that it took Trump to make that statement, is \"another example where he just kind of pussyfooted around something.\"\nBoth Beirich and Greenblatt referenced how Trump retweeted posts from users with handles like \"@WhiteGenocideTM\" and how he used memes recycled from white supremacist websites as examples of his lack of separation from such groups during the campaign.\nOther instances include the neo-Nazis and white supremacists sometimes spotted at Trump campaign events, a white nationalist super PAC making robocalls on Trump's behalf, and a prominent member of an alt-right group expressing his support of Trump.\nGreenblatt noted today on the call how a number of anti-Semitic sentiments were also expressed during the Charlottesville melee this weekend and pointed out that Trump has faced accusations of anti-Semitism before as well.\nTwo examples of that include the controversy surrounding the Trump campaign’s use of a picture on Twitter that showed Hillary Clinton’s face superimposed on a stack of money and a six-pointed star that many likened to a Star of David, and his administration’s release of a statement on International Holocaust Remembrance Day that failed to mention Jews.\nTrump has repeatedly denied that he is anti-Semitic or racist, regularly pointing to his close ties to the Jewish community. Trump's son-in-law Jared Kushner practices Orthodox Judaism, and the president's daughter Ivanka Trump converted when she married Kushner.\nKushner himself has defended his father-in-law in the past, saying in a statement in July 2016, \"I know that Donald does not at all subscribe to any racist or anti-Semitic thinking. I have personally seen him embrace people of all racial and religious backgrounds. The suggestion that he may be intolerant is not reflective of the Donald Trump I know.\"\nAnd in remarks today, Trump called out hate groups for their behavior, saying, \"Racism is evil. And those who cause violence in its name are criminals and thugs, including the [Ku Klux Klan], neo-Nazis, white supremacists and other hate groups that are repugnant to everything we hold dear as Americans.\" Trump again did not use the term \"terrorism\" to describe the incident, however.\nToday's comments were not enough for Greenblatt, who sees Trump's initial Charlottesville statement as a call to action.\n“This wasn’t a subtle dog whistle. This was like a bullhorn and a signal for them to try and rise,” Greenblatt said of Trump’s repeated instances of not taking swift action in condemning such hate groups.\nBeirich said that Trump \"waits too long\" to make his public criticisms, and when he does speak out, the earlier message resonates.\n\"What is so hard about saying 'I decry the neo-Nazis and the white supremacists that were in Charlottesville,'\" she said, referencing the first statement Trump made about the violence in Virginia on Saturday. \"He went out of his way to not decry neo-Nazis and white supremacists.\"\n\"When it comes to white supremacist terrorism, Donald Trump doesn't seem to care,\" she said.\nABC News' Candace Smith contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Trump has been slow to call out white nationalists before, critics say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-slow-call-white-nationalists-critics/story?id=49205561"
}