{
    "authors": [
        "Abc News",
        "More Stephanie"
    ],
    "date_download": "2018-03-19 19:26:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Sens. Gary Peters and Joni Ernst are asking the Office of Management and Budget to provide more detail about the administration's policies on travel spending.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fsenators-federal-budget-office-information-costly-cabinet-travel%2Fstory%3Fid%3D53853665.json",
    "image_url": "https://s.abcnews.com/images/US/breaking-news-graphic1-abc-ml-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Amid multiple investigations and controversies over the cost of travel by Trump administration officials, two senators are asking the Office of Management and Budget to provide more detail about the administration's policies on travel spending.\nSeveral members of Trump's cabinet have been under scrutiny for the cost of their travel and other expensive purchases. The president asked former Health and Human Services Secretary Tom Price to resign last September after reports that his travel on private planes cost more than $1 million of taxpayer money.\nSen. Gary Peters, D-Michigan, the ranking member of theFederal Spending Oversight and Emergency Management subcommittee, and Sen. Joni Ernst, R-Iowa, wrote to Office of Management and Budget Director Mick Mulvaney on Monday asking him to explain how the Trump administration is enforcing rules on the cost of government travel and whether OMB has reviewed any other relevant guidance or rules.\n\"It is our duty to provide oversight and ensure that taxpayer money is spent responsibly, without waste, fraud, or abuse,\" the senators wrote in the letter, which was reviewed by ABC News. \"As you have said yourself about past issues with Administration travel, “just because something is legal doesn’t make it right.” We owe it to the American people to ensure with the utmost vigilance that tax dollars are being spent appropriately.\"\nThe senators are also asking Mulvaney for documents on all travel approved by the White House Chief of Staff related to travel on government-owned or charter planes. OMB said in a memo issued after Price resigned that some travel would need to be approved by the chief of staff and that the chief of staff would provide further guidance on the use of government and private planes.\nThere are multiple investigations pending from congressional committees and agency watchdogs seeking more information about whether officials' travel spending followed all the relevant rules. The inspectors general at the Environmental Protection Agency and Department of Interior have ongoing investigations into travel spending and the IG from the Department of Veterans Affairs already published a report into Secretary David Shulkin's spending on a trip to Europe.\nFederal law says that government officials should use the least expensive travel option available and should use commercial flights, unless otherwise authorized.",
    "source_domain": "abcnews.go.com",
    "title": "Costly cabinet travel prompts senators to ask federal budget office to explain spending",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/senators-federal-budget-office-information-costly-cabinet-travel/story?id=53853665"
}