{
    "authors": [
        "Abc News",
        "Riley Beggin",
        "More Riley"
    ],
    "date_download": "2017-06-14 22:15:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Meet the 2 officers who prevented a 'massacre' at GOP baseball practice",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmeet-police-officers-prevented-massacre-gop-baseball-practice%2Fstory%3Fid%3D48037013.json",
    "image_url": "http://a.abcnews.com/images/US/gty-us-capitol-security-ps-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. Capitol Police officers David Bailey and Crystal Griner were identified by House Speaker Paul Ryan as the two special agents injured in the shooting at a congressional baseball practice in Alexandria, Virginia.\nBailey and Griner were protecting House Majority Whip Steve Scalise, currently the third-highest Republican in the House. Nine other members of Congress have protective details because of their positions. Special Agent Henry Cabrera was also protecting Scalise but was not injured in the shooting.\n\"I want to commend Special Agents Crystal Griner, David Bailey and Henry Cabrera for their heroic and appropriate response in protecting the members and others today,\" said Capitol Police Chief Matthew Verderosa.\nAccording to Verderosa, Griner was shot in the ankle and is in good condition in a hospital. Bailey sustained a minor injury, was treated and has been released.\nCongressional staffer Zack Barth, who was shot, has also been released from a hospital, according to a family spokesperson. Scalise and lobbyist Matt Mika remain in critical condition, according to MedStar Washington and a statement from Mika's family.\nRyan said he spoke with both special agents Wednesday morning.\n\"One was being treated, and one was about to go into surgery,\" he said. \"I expressed our profound gratitude to them.\"\n\"It is clear to me, based on various eyewitness accounts, that without these two heroes, Agent Bailey and Agent Griner, many lives would have been lost,\" said Ryan, who got a standing ovation in the House chamber.\nKentucky Sen. Rand Paul, one of the GOP lawmakers at the scene of the attack, said, \"Had they not been there, it would have been a massacre.\"\nThe Capitol Police occasionally assigns an officer to attend baseball practices, on a case-by-case basis.\n\"There's usually a Capitol Police officer in a car in a parking lot several hundred yards away but no one on near the field like the Scalise detail was,\" said Matt Dinkel, the spokesman for Rep. Mike Doyle, the Democratic team's coach. \"That was the situation today.\"\n\"The United States Capitol Police is dedicated to its mission to protect the U.S. Capitol, members of Congress, staff and the visiting public,\" said Verderosa, \"today we saw how our officers' extensive training and quick response saved lives.\"\nAt a press conference Wednesday afternoon, Rep. Roger Williams, R-Texas, choked up while crediting Griner and Bailey for preventing the deaths of the 25 elected officials on the field and the 15 staffers who joined them.\n\"There will be those who talk about what's wrong with America, but in this case, Officers Griner and Bailey, we saw what's right with America,\" Williams said. \"We saw two people risk their lives to save the lives of others. We saw courage in the face of death, and we saw examples of why all Americans should be grateful every day for law enforcement officers around this country.\"\nGriner and Bailey were widely praised for their role in preventing a massacre on the baseball field today.\nPraying for those injured at this morning's practice. I'm especially thankful to the US Capitol Police who risked their lived to protect us. — Mo Brooks (@RepMoBrooks) June 14, 2017\nAlways so grateful for the US Capitol Police officers. Their bravery saved lives in VA this morning. Thank you. — Chuck Schumer (@SenSchumer) June 14, 2017\n\"Many lives would have been lost if not for the heroic actions of the two Capitol Police officers who took down the gunman.\" -@POTUS — Vice President Pence (@VP) June 14, 2017\nIf you're around the Capitol, please thank the dedicated men and women of the @CapitolPolice. They always deserve it, but especially today. — Raja Krishnamoorthi (@CongressmanRaja) June 14, 2017\nCapitol Police deserve gratitude for heroism; stops shooter of GOP Congressmen in VA; thank God for sacrifice of law enforcement. — Gov. Mike Huckabee (@GovMikeHuckabee) June 14, 2017\nABC News' Ali Rogin, John Parkinson and Mary Bruce contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Meet the 2 police officers who prevented a 'massacre' at GOP baseball practice",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/meet-police-officers-prevented-massacre-gop-baseball-practice/story?id=48037013"
}