{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:55:21+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Pentagon chief Mattis makes clear that US committed to NATO",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fpentagon-chief-mattis-makes-clear-us-committed-nato-45507354.json",
    "image_url": "http://abcnews.go.com/International/wireStory/pentagon-chief-mattis-makes-clear-us-committed-nato-45507354",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. Defense Secretary Jim Mattis on Wednesday made clear that the United States was committed to NATO while also reinforcing the Trump administration's demand that allies pay their fair share.\nSpeaking at his first NATO defense minister's meeting, Mattis called the alliance \"a fundamental bedrock for the United States and for all the trans-Atlantic community.\"\nThat message, delivered as Mattis stood alongside NATO Secretary-General Jens Stoltenberg, comes amid mixed signals from President Donald Trump and as chaos swirls in Washington. The Pentagon chief made no references to the abrupt forced resignation Monday of Michael Flynn, the U.S. national security adviser, over his pre-inauguration discussions with Russia, and what the change may mean for U.S. policy toward Moscow.\n\"I haven't changed what I'm heading there for,\" Mattis told reporters traveling with him to the NATO gathering. \"It doesn't change my message at all.\"\nThe allies' interest and concern about the latest furor in Washington was evident early on as officials crowded around televisions at the NATO meeting to watch Mattis' initial appearance with Stoltenberg. Ministers immediately clustered around the retired Marine general as he entered the meeting room.\nIn public statements, however, NATO leaders brushed aside questions about the turmoil in Washington.\nStoltenberg said he has spoken to Trump twice on the phone, and has gotten the same reassurance from Mattis and U.S. Secretary of State Rex Tillerson.\n\"They have all conveyed the same message to me as they have conveyed to other leaders in NATO countries, and that is that the United States will stay committed to the trans-Atlantic partnership,\" Stoltenberg said.\nMattis also urged that \"all who benefit from the best defense in the world carry their proportionate share of the necessary cost to defend freedom.\" The U.S. wants allies to increase their military funding to the benchmark goal of 2 percent of gross domestic product. Some NATO members have been slowly moving toward that.\nHe also was expected to press for greater assistance, including additional trainers, in the military campaigns in Afghanistan and elsewhere.\nDuring his Senate confirmation hearing last month, Mattis said he wanted the U.S. to \"maintain the strongest possible relationship with NATO.\"\nTrump has criticized NATO as \"obsolete,\" repeatedly praised Russian President Vladimir Putin and threatened that the U.S. might not defend allies that don't fulfill their financial obligations as NATO members. It's all rattled European leaders, who are looking for some clarity from Mattis.\nSuch comments are playing into fears that Trump will ease U.S. sanctions imposed on Moscow after it annexed Ukraine's Crimea region in 2014 and supported an insurgency in eastern Ukraine. Another concern is lessened U.S. military support for Eastern European allies near Russia's border who worry about being the next target.\nIn recent weeks, Trump's public statements on NATO have softened somewhat.\nAfter meeting Trump, British Prime Minister Theresa May told reporters that he assured her he was \"100 percent\" behind NATO. A joint statement issued after Trump and German Chancellor Angela Merkel spoke by telephone said the two agreed on the \"fundamental importance that the NATO alliance has for trans-Atlantic relations\" and the need for all members to pay their fair share. Trump made similar comments in a call with French President Francois Hollande.\nOnly four countries other than the U.S. — Britain, Estonia, Greece and Poland — are meeting NATO's 2 percent spending target. Many are increasing their budgets in response to Russia's actions.\nStill, the U.S. spends more on its armed forces than all the others combined. Washington also pays more than 22 percent of NATO's commonly funded budget.\nThe U.S. also would like to see an increased NATO commitment in Afghanistan, where forces have been fighting the Taliban since the attacks of Sept. 11, 2001. Washington wants more trainers in Afghanistan, where about 8,400 American troops are still deployed.\nThere also will be discussions about how to accelerate the newer, U.S.-led campaign to defeat the Islamic State group in Iraq and Syria.",
    "source_domain": "abcnews.go.com",
    "title": "Pentagon chief Mattis makes clear that US committed to NATO",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/pentagon-chief-mattis-makes-clear-us-committed-nato-45507354"
}