{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 23:51:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Gunmen attack UN base in Mali, killing 7 and wounding 7",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fgunmen-attack-peacekeeping-sites-mali-killed-49210297.json",
    "image_url": "http://abcnews.go.com/International/wireStory/gunmen-attack-peacekeeping-sites-mali-killed-49210297",
    "language": "en",
    "localpath": null,
    "maintext": "Unidentified gunmen attacked the headquarters of the U.N. peacekeeping force in the northern Mali city of Timbuktu on Monday, killing seven people and injuring seven others in what the mission's chief called a \"terrorist\" attack.\nEarlier Monday, gunmen attacked two neighboring U.N. camps in Douentza in the Mopti region of central Mali, killing a Malian soldier and a U.N. peacekeeper and lightly wounding another peacekeeper. The head of the U.N. peacekeeping mission in Mali, Mahamat Saleh Annadif, also called that incident a terrorist attack.\nThe U.N. peacekeeping mission in Mali is the deadliest of the U.N.'s 16 global peacekeeping operations, and the death of the soldier in Douentza brought the number of U.N. peacekeepers killed in attacks this year to nine, according to the U.N. peacekeeping department. This was also one of the worst losses of mission employees.\nU.N. Secretary-General Antonio Guterres condemned the attack and stressed that attacks targeting U.N. peacekeepers \"may constitute war crimes under international law,\" U.N. deputy spokesman Farhan Haq said. Guterres commends \"the important efforts\" that Mali and four neighboring countries are making to combat terrorism and violent extremism and promote peace in the region, Haq added.\nIn the Timbuktu attack, the mission said five Malian security guards and a Malian contractor working for the mission were killed along with a member of the Malian gendarmerie. It said six U.N. peacekeepers were wounded, two seriously, along with one Malian security guard.\nThe mission, known as MINUSMA, said it dispatched a quick reaction force and attack helicopters to secure the Timbuktu headquarters. It said U.N. troops killed six assailants.\nIn Douentza, MINUSMA said a group of attackers fired on a U.N. camp from an adjacent hill and Malian troops returned fire. Another armed group shot at peacekeepers in a neighboring camp who also returned fire, the mission said. The U.N. mission said two attackers were killed in the exchanges.\nThe U.N. is looking into whether there was any connection between the two attacks.\nAnnadif, the MINUSMA commander, called for those responsible for \"these terrorist acts\" to be brought to justice.",
    "source_domain": "abcnews.go.com",
    "title": "Gunmen attack UN base in Mali, killing 7 and wounding 7",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/gunmen-attack-peacekeeping-sites-mali-killed-49210297"
}