{
    "authors": [
        "Abc News",
        "More Angela"
    ],
    "date_download": "2017-02-15 16:30:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Fred Armisen on 'Portlandia' ending: 'There are no goodbyes'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Ffred-armisen-portlandia-ending-goodbyes%2Fstory%3Fid%3D45485070.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-fred-armisen-01-as-170214_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Fred Armisen may be one of the most versatile performers on TV now. He's currently starring opposite Carrie Brownstein in the quirky IFC comedy series, “Portlandia,” which parodies life in Portland, Oregon.\nThe show is going strong after seven seasons but there are reports that the series will end soon. Armisen told ABC News that’s not necessarily the case.\n“People make announcements and then the next thing you know they’re getting back together. Bands break up and then they’re getting back together. So kind of casually we were like, ‘Oh maybe we’ll do eight seasons.’ And then it kind of became the official word,” Armisen said in an appearance on “Popcorn with Peter Travers.”\nDownload the all new \"Popcorn with Peter Travers\" podcast on iTunes, Google Play Music and Stitcher.\nWHAT TO KNOW Fred Armisen appears on Popcorn with Peter Travers\nHe added, “We’re like, ‘Eight seems like the right amount. And we have some control over it.’ But I keep seeing comedy groups get back together. Even at 'SNL' (Saturday Night Live) there’s a lot of reunions. I said goodbye to SNL. But then I’m on pretty frequently. And I was like, 'This is it, this is my last show ever.' So what I mean to say is there are no goodbyes.”\nMost fans will note the great chemistry on screen between Armisen and Brownstein.\n“We are constantly laughing. It’s really tough. And the crew isn’t amused by it. Because we’ll laugh and it’s not a cutesy thing,” Armisen, 50, told Peter Travers. “Because it’s a low budget show. We have to be there at 7. And we have to move on to the next sketch and the next sketch. And when we start laughing it is funny to no one,” he said.\nDavid Fazekas/ABC News\nWhen Travers asked why they haven’t taken that same chemistry off screen and become a real-life couple, Armisen explained their unique connection.\n“Well, we have such a close great relationship. It’s the best thing in my life,” he said. “My problem is with intimacy. That’s where I have my biggest problems. But with Carrie I have the most intimate relationship because of the absence of the physical part of it. It actually becomes very physical and very deep. And that’s one of the reasons I can forgive myself for my past, because I know that I am able. I have the capability to have a close relationship with someone.”\nBe sure to watch the video above for the full interview.",
    "source_domain": "abcnews.go.com",
    "title": "Fred Armisen on 'Portlandia' ending: 'There are no goodbyes'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/fred-armisen-portlandia-ending-goodbyes/story?id=45485070"
}