{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 13:49:08+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Erika Jayne: 'DWTS' is a 'completely different' than 'Real Housewives'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Ferika-jayne-dwts-completely-real-housewives%2Fstory%3Fid%3D46858478.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_dwts_0841_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"The Real Housewives of Beverly Hills\" star Erika Jayne and her professional partner Gleb Savchenko were eliminated halfway through season 24 after their impressive Disney-inspired Viennese Waltz to “Unforgettable” by Sia from “Finding Dory.”\n“It felt great. We ended on a high note,” Jayne, 45, said on “Good Morning America. “It was beautiful. It was emotional. We worked hard. I’m proud of us.”\nJayne compared her “Dancing” experience to “Housewives,” noting that they are “two completely different things.”\n“First off, everyone on ‘Dancing With the Stars’ is very nice and very warm and very sweet,” she said with a laugh. “Although you and I had it out a couple of times,” she said, referring to Savchenko. “But nothing like my other job. I had a great time.”\nWhen asked which of her “Real Housewives” co-stars would be the toughest judge on “DWTS,” she replied, “Every one of them.”\nShe also added that her co-star, Kyle Richards, would be a great competitor on the dance floor, but said she hopes Kenya Moore of “The Real Housewives of Atlanta” gets on the next season of “Dancing.”\n“She’d be great,” Jayne said of Moore. “Kenya, you’re next babe.”\nOne of the hardest parts of competing on “DWTS” was working with a partner, Jayne said.\n“Partnering is harder than you can imagine,” she explained. “I knew it was going to be tough. I knew it was going to be a challenge, I always said that. But it was really difficult to come into his space and learn and really be his student.”\n“It was tough, but I am so appreciative,” she added.\nNext week's episode of \"Dancing With the Stars\" features team dances with a theme of Boy Bands vs. Girl Groups.",
    "source_domain": "abcnews.go.com",
    "title": "Erika Jayne says 'DWTS' is a 'completely different' than 'Real Housewives'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/erika-jayne-dwts-completely-real-housewives/story?id=46858478"
}