{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 10:20:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Eurozone industry shows signs of slowing amid euro's rise",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Feurozone-industry-shows-signs-slowing-amid-euros-rise-49201506.json",
    "image_url": "http://abcnews.go.com/International/wireStory/eurozone-industry-shows-signs-slowing-amid-euros-rise-49201506",
    "language": "en",
    "localpath": null,
    "maintext": "Industrial output across the 19 countries that make up the eurozone fell in June, official figures showed Monday, in a development that likely illustrates the export-sapping impact of the rising euro.\nThe Eurostat statistics agency said output declined by 0.6 percent during the month, giving up half the previous month's gain. Though monthly figures can be volatile, the fall, the first since February, was in line with predictions in financial markets, with many economists warning about the implications of the euro's rise in recent months, particularly against the currencies of the eurozone's two biggest export markets, Britain and the U.S.\nAgainst the British pound, the euro's benefited from worries over Britain's scheduled exit from the European Union, with some market forecasters now predicting that the two currencies will soon be equal in value for the first time. On Monday, the euro was up a further 0.1 percent at 0.91 pound.\nThe euro has also risen about 10 percent against the dollar this year — to a 30-month high above $1.19 earlier this month — on the back of strong eurozone economic data, waning fears of a wave of populist politicians taking power across Europe, as well as uncertainty over the economic program of U.S. President Donald Trump.\nThe output figures point to a currency impact, particularly in Germany, the single currency bloc's powerhouse economy where production fell by 1.1 percent. Though a stronger currency shows that confidence is returning to the eurozone economy, it does have the potential to weigh on exporters as it increases the price of their goods in international markets, all other things being equal.\nDespite the June fall, industrial production was still a healthy 2.6 percent higher compared with a year earlier, though down on May's 3.9 percent annual rate.\nThe general trend, though, is clear. The eurozone economy is in a better position than it has been for years. Fears of a breakup of the currency bloc have subsided while growth has risen to the long-run average and has outstripped the U.S. so far this year. In the second quarter, the eurozone economy grew by a quarterly rate of 0.6 percent. Economists said the June industrial production figures are unlikely to prompt any revision to that rate in this Wednesday's update.\n\"All things considered, we remain optimistic about the eurozone economy, and forecast above-consensus growth of 2.2 percent this year and 2 percent in 2018,\" said Jack Allen, European economist at Capital Economics.",
    "source_domain": "abcnews.go.com",
    "title": "Eurozone industry shows signs of slowing amid euro's rise",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/eurozone-industry-shows-signs-slowing-amid-euros-rise-49201506"
}