{
    "authors": [
        "Abc News",
        "Michael Rothman",
        "More Michael"
    ],
    "date_download": "2017-12-11 20:34:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Mario Batali takes leave of absence, apologizes to those 'I have mistreated and hurt'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fmario-batali-takes-leave-absence-apologizes-mistreated-hurt%2Fstory%3Fid%3D51718005.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/mario-batali-gty-mem-171211_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Famed chef Mario Batali was asked to step away from \"The Chew\" while ABC reviews sexual misconduct allegations against him.\n\"We have asked Mario Batali to step away from 'The Chew' while we review the allegations that have just recently come to our attention,\" a network spokesperson confirmed for ABC News on Monday. \"ABC takes matters like this very seriously, as we are committed to a safe work environment. While we are unaware of any type of inappropriate behavior involving him and anyone affiliated with the show, we will swiftly address any alleged violations of our standards of conduct.\"\nBatali's leave of absence comes on the heels of a report from the blog Eater, in which multiple women alleged sexual harassment or misconduct by the chef.\nThe accusations, some from past employees, span almost 20 years and include alleged inappropriate touching or groping.\nIn a statement to ABC News, Batali did not deny the allegations but apologized to the people he has \"mistreated and hurt,\" his statement read. He said that in addition to his show, he will step away from the day-to-day operations of his restaurant group.\n\"I apologize to the people I have mistreated and hurt,\" Batali said in the statement. \"Although the identities of most of the individuals mentioned in these stories have not been revealed to me, much of the behavior described does, in fact, match up with ways I have acted. That behavior was wrong, and there are no excuses. I take full responsibility and am deeply sorry for any pain, humiliation or discomfort I have caused to my peers, employees, customers, friends and family.\"\nJeff Neira/ABC via Getty Images\nHe continued, \"I have work to do to try to regain the trust of those I have hurt and disappointed. For this reason, I am going to step away from day-to-day operations of my businesses. We built these restaurants so that our guests could have fun and indulge, but I took that too far in my own behavior. I won’t make that mistake again. I want any place I am associated with to feel comfortable and safe for the people who work or dine there.\"\n\"I know my actions have disappointed many people. The successes I have enjoyed are owned by everyone on my team. The failures are mine alone. To the people who have been at my side during this time – my family, my partners, my employees, my friends, my fans – I am grateful for your support and hopeful that I can regain your respect and trust. I will spend the next period of time trying to do that.\"\nMichael Loccisano/Getty Images for (Red)\nBatali's international hospitality group includes 10 restaurants in New York, four in Las Vegas, four in California, two in Connecticut and two in Singapore. The group also has two Italian markets in New York, one in Chicago and another in Boston.\nA spokesman for the Batali and Bastianich Hospitality Group told ABC News in a statement, \"Mr. Batali and we have agreed that he will step away from the company's operations, including the restaurants, and he has already done so.\"\n\"We have decided to take a further step beyond our current policies and practices to ensure all employees feel comfortable and empowered to report issues,\" the statement continued. \"If employees have claims they want to make against any corporate officers or owners specifically, they may now contact the outside corporate investigations firm T&M Protection Resources LLC, who has discretion to independently investigate complaints and report to outside counsel.\"",
    "source_domain": "abcnews.go.com",
    "title": "Mario Batali takes leave of absence, apologizes to those 'I have mistreated and hurt'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/mario-batali-takes-leave-absence-apologizes-mistreated-hurt/story?id=51718005"
}