{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 20:32:17+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "In a hearing in Manhattan on Wednesday, Judge Kimba Wood of the Southern District of New York set a June 15 deadline to complete their review, despite strenuous objections from Cohen's legal team.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fmichael-cohens-legal-team-racing-review-materials-seized-55538466.json",
    "image_url": "https://s.abcnews.com/images/Politics/180530_nwo_cohen_court_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Michael Cohen's legal team racing to review materials seized in FBI raids\nA federal judge here complained that Michael Cohen president trumps former personal attorney was not moving fast enough to review all of the materials seized. In a raid of his home and office last month she says he and his legal team has. Have to get it done by June 15 they're trying to decide which material are subject to the decline privilege. And which federal prosecutors can use as they try to decide whether Michael Cohen is guilty of the crime. But this hearing was dominated by Michael of an ID the attorney for stormy Daniels one of the women who was accused Donald Trump of having an affair about a decade ago. Haven't -- complain Michael coincide. Was leaking information. Coincide complained of an Audi was self aggrandizing and only. In its crippled this city. In the end the judge reminded of and Heidi that. And really didn't have standing to be intervening in the case she said she can't control what publicity he does outside of court but inside she told him. He is not to use this case as a platform. Aaron pitcher ski ABC news federal court New York.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Michael Cohen's legal team racing to review materials seized in FBI raids",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/video/michael-cohens-legal-team-racing-review-materials-seized-55538466"
}