{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:14:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Column: Silver helps make it a weekend to celebrate for NBA",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fcolumn-silver-helps-make-weekend-celebrate-nba-45502874.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/column-silver-helps-make-weekend-celebrate-nba-45502874",
    "language": "en",
    "localpath": null,
    "maintext": "The first signal that Adam Silver was more enlightened than the average commissioner came just months into his reign when he broke ranks with other sports leagues by calling for the legalization of sports betting.\nNot only that, the NBA commissioner suggested later, but the league wouldn't mind joining in the profits that nationwide legalized betting might bring.\nBold stuff, considering the NBA had for decades been in lockstep with Major League Baseball and the NFL in the belief that sports betting could destroy their empires. While baseball is now coming in line with a new way of thinking, Roger Goodell notably continues to rant about the evils of sports betting.\nThat Silver is not afraid to tackle social issues is also reflected in the decision to move this weekend's All-Star Game out of Charlotte because of the North Carolina law limiting protections for lesbian, gay and transgender people. Agree with him or not, it's hard to imagine the NFL taking such a stand — especially when it might lose some money because of it.\nThree years into his tenure, Silver is on a roll. The NBA Finals last year were the most watched in nearly 20 years, the league has a new national television deal that is ridiculously lucrative, and there is a new agreement with players that guarantees labor peace for at least six years.\nOwners are happily counting their growing profits. Players are ecstatic over contracts that could pay them more than $40 million a year.\nTo top it off, Silver even managed — at least temporarily — to keep Knicks owner James Dolan from making even more of a fool of himself than he has already in his dustup with former player Charles Oakley.\nGood times indeed, as the best players in the league prepare to gather in New Orleans for the All-Star Game that was taken from Charlotte. There's a lot to celebrate for both players and owners in a league that is not only healthy but thriving.\nSome of that came about because both players and owners realized only they can kill the golden goose that continues to provide well for both. The new labor agreement signed a few weeks ago ensures that players will continue to get about half of each team's basketball revenue in salaries, while the owners will see their franchises go up in value.\nAssuming it runs for the full seven-year length, the NBA will go for at least 13 years without any real labor issues. Revenues keep going up, and both owners and players seem to be satisfied with their share of a pie that keeps getting bigger.\nMeanwhile, the NBA is not haunted by concussions like the NFL. It's not tainted by steroids, like baseball. And the entertainment value on the court is at a level probably not seen since Magic Johnson and Larry Bird squared off against each other three decades ago.\nYes, there are still issues to address. Officiating is one of them, in a league where it's difficult to know just what a foul is despite efforts to be more transparent about calls late in games.\nToo many teams have no shot year after year at making the playoffs, which themselves have become somewhat predictable. Ticket prices are scary high, and it remains to be seen whether the $2.6 billion a year television package is sustainable in an era of cord cutting.\nIt's also hard to give Silver a pat on the back for changing the name of the development league to the NBA Gatorade League and for allowing ads to creep onto uniform fronts. And while Silver wants to be out front on the sports betting issue, there is still no one outside of Nevada legally betting on NBA games and no indication that will happen anytime soon.\nBut the NBA seems to be in good hands in a commissioner who learned a lot working under his predecessor, David Stern. That was evident on Monday when Silver moved quickly to get Oakley and Dolan in his office and, with an assist from Hall of Famer Michael Jordan, thrashed out a detente of sorts between the former player and the Knicks owner.\nAs NBA problems go, the spat between Oakley and Dolan was more of a sideshow than anything. Both bear some blame for the altercation, though it was Dolan who escalated it by issuing a ban on Oakley attending Knicks games and suggesting that he had anger issues or alcohol problems.\nIt could have been another distraction at the All-Star Game that no one wanted. But Silver moved quickly to make sure it wasn't, just as he moved quickly to move the game from Charlotte when it became clear the law was not going to be changed.\nThis weekend, the focus will be on the best players in the world, as it should always be.\nBut forgive the commissioner if he's called to take a little bow, too.\n———\nTim Dahlberg is a national sports columnist for The Associated Press. Write to him at tdahlberg@ap.org or http://twitter.com/timdahlberg",
    "source_domain": "abcnews.go.com",
    "title": "Column: Silver helps make it a weekend to celebrate for NBA",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/column-silver-helps-make-weekend-celebrate-nba-45502874"
}