{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 07:19:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Pick for Medicare post faces questions on Indiana contracts",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fpick-medicare-post-faces-questions-indiana-contracts-45502309.json",
    "image_url": "http://abcnews.go.com/US/wireStory/pick-medicare-post-faces-questions-indiana-contracts-45502309",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump's pick to oversee Medicare and Medicaid advised Vice President Mike Pence on health care issues while he was Indiana's governor, a post she maintained amid a web of business arrangements — including one that ethics experts say conflicted with her public duties.\nA review by The Associated Press found Seema Verma and her small Indianapolis-based firm made millions through consulting agreements with at least nine states while also working under contract for Hewlett Packard. The company holds a financial stake in the health care policies Verma's consulting work helped shape in Indiana and elsewhere.\nHer firm, SVC Inc., collected more than $6.6 million in consulting fees from the state of Indiana since 2011, records show. At the same time, records indicate she also received more than $1 million through a contract with Hewlett, the nation's largest operator of state Medicaid claims processing systems.\nLast year, her firm collected an additional $316,000 for work done for the state of Kentucky as a subcontractor for HP Enterprises, according to documents obtained by AP through public records requests.\nIn financial disclosures posted this week, Verma reported she has an agreement to sell SVC Inc. to Health Management Associates of Lansing, Michigan, within 90 days of her confirmation.\nIn a statement, a spokesman for Verma said there was no conflict of interest and added that she has the support of former officials who served with her under Pence.\nHer firm was \"completely transparent in regards to its relationship with HP and that there was never a conflict of interest,\" spokesman Marcus Barlow said in a statement.\nA spokesman for Pence did not respond to a request for comment.\nVerma faces a Senate Finance Committee hearing on Thursday. Democrats in Washington are aware of many of her consulting arrangements, and have broader concerns about her philosophy about government entitlement programs, lack of background in Medicare and inexperience leading a large organization.\nAs a trusted adviser to Pence, she had an office in the state government center and took on duties usually reserved for state administrators. Verma was also widely respected for her grasp on policy and designed a federal Medicaid waiver that allowed Pence to undertake his own conservative expansion of the program while still accepting money made available through the Affordable Care Act.\nVerma did not specifically address how she would handle decisions related to HP in a letter to the Department of Health and Human Services that was released this week. The letter outlined her plan for managing potential conflicts of interest should she be confirmed by the Senate to lead the Centers for Medicare & Medicaid Services. Her relationship with HP was first reported by the Indianapolis Star in 2014.\nLegal and ethics experts contacted by AP say Verma's work for Hewlett, and offshoot HP Enterprises, raised questions about where her loyalties lay — to the company, or to state taxpayers.\nRichard Painter, former President George W. Bush's chief ethics lawyer, called Verma's arrangement a \"conflict of interest\" that \"clearly should not happen and is definitely improper.\"\nSuch arrangements are typically prohibited for rank-and-file state employees under Indiana's ethics rules and laws, but they're murkier when it comes to consulting work. Contractors have often replaced state employees in a GOP bid to drive down the number of public employees, distinctions between the two can be hard to discern.\n\"She was cloaked with so much responsibility and so much authority, people thought she was a state employee,\" said Debra Minot, a former head of Indiana's Family and Social Services Agency under Pence who worked with Verma.\nIndiana University law professor David Orentlicher compared Verma's dual employment to an attorney who represents both the plaintiff and the defense in a lawsuit. It's also similar to federal contract negotiator with a side job for a company they regularly negotiate with, he said.\n\"If you have one person on both sides of the negotiating, they can't negotiate hard for both sides,\" said Orentlicher, a former Indiana Democratic state lawmaker.\nThere was at least one instance where Verma crossed the line in Indiana when she was dispatched by HP to help smooth over a billing dispute, said Minot.\n\"It was never clear to me until that moment that she, in essence, was representing both the agency and one of our very key contractors,\" said Minot, who was removed as head of the agency by Pence over her disagreements with Verma. \"It was just shocking to me that she could play both sides.\"\nState contracts show Verma's duties to Indiana and Hewlett have overlapped at times. One agreement she held with the state's social services agency required her to \"provide technical assistance\" to state contractors, as well as the governor's office. Another duty was \"contract development and negotiation\" with vendors, which included HP and HP Enterprises\nVerma reported her salary with SVC is $480,000 and her business income from the company as nearly $2.2 million.\n———\nJohnson reported from Chicago.",
    "source_domain": "abcnews.go.com",
    "title": "Pick for Medicare post faces questions on Indiana contracts",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/pick-medicare-post-faces-questions-indiana-contracts-45502309"
}