{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:09+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fsamsung-launches-2nd-appliance-line-carolina-facility-53853791.json",
    "image_url": "https://s.abcnews.com/images/Business/WireAP_26332ce32c08497da6cda0eb087d7103_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "South Korean-based appliance manufacturer Samsung announced the expansion of its production footprint in South Carolina on Monday, making progress on a plan to create nearly 1,000 jobs in the state by 2020.\nThe company officially launched a new line of top-loading washing machines at its facility in Newberry. That's in addition to a line of front-loading washing machines that the South Korean electronics company began making at the plant earlier this year.\nThe expansion comes less than a year after Samsung's June announcement that it would invest $380 million in South Carolina to manufacture home appliances, creating an estimated 950 jobs by 2020. So far, company officials say that they've hired about 650 employees who are now working on the two washing machine lines at a 450,000-square-foot plant.\nSamsung took over property that had belonged to Caterpillar, which announced in April 2016 that it was closing its electric generator packaging facility. The closure left more 300 people out of work, but Samsung said that about 10 percent of the 650 full-time employees currently working at the Newberry plant are former Caterpillar employees.\nSamsung has also hired some of the 6,000 workers left jobless following the scuttling of a reactor construction project at the V.C. Summer Nuclear Station in Jenkinsville, about 21 miles (34 km) away.\nSome retrofitting was needed to get Caterpillar's existing buildings in line with Samsung's designs, but Samsung plant manager Tony Fraley said that not having to start from scratch enabled Samsung to get two lines up and running in under a year. Much of the plant's production is focused on robotics, with robots ferrying specially designed trays of parts around the green- and orange-colored plant, and other robots retrieving the pieces and putting them together.\nThe process can be slower than at other manufacturing facilities, Fraley said, but more mechanization means higher productivity and also fewer scratches that can come along with human handling.\n\"Everything has automation built into it,\" Fraley told The Associated Press during a recent tour of the manufacturing plant and new production line.\nAbout 100 Samsung employees from South Korea are currently on-site helping get the new facility up and running, even able to write computer codes on the spot to help the plant run more smoothly. Eventually, Fraley said they will return to the company's headquarters, after training South Carolina employees on all of the technology needed to run the facility's high-tech machines.\n\"If something goes awry, they show us how to fix it,\" Fraley said. \"They show us how to troubleshoot it.\"\nBy this summer, Fraley said he expected the plant to be running at full capacity. Last year, Samsung announced a collaboration with the University of South Carolina and Clemson University in an effort to make the plant a center for customer service and research and development.\nWithout giving specifics, Samsung Electronics North America's President and CEO Tim Baxter told AP that the company hopes to add more production lines in the future, as well as establish a supply chain in the state so that Samsung doesn't have to import as many supplies.\n\"Clearly the plan is to build an eco-system,\" Baxter said in a recent interview. \"Obviously that doesn't happen overnight.\"\n————\nFollow Meg Kinnard on Twitter and see more of her work on apnews.com.",
    "source_domain": "abcnews.go.com",
    "title": "Samsung launches 2nd appliance line at S. Carolina facility",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/samsung-launches-2nd-appliance-line-carolina-facility-53853791"
}