{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 08:46:47+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "MLB ump Dale Scott retires rather than risk more concussions",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fmlb-ump-dale-scott-retires-risk-concussions-51733174.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_481b699bd2c6436eb2692f6041c9efcf_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As a big league umpire, Dale Scott saw maybe 1 million pitches from the field. His final call, it turned out, was the easiest of all.\nRather than risk yet another concussion, Scott has decided to retire at 58.\n\"I'm done,\" he told The Associated Press.\nThe veteran crew chief missed nearly the entire 2017 season after a foul ball off the bat of Baltimore slugger Mark Trumbo in Toronto on April 14 caught him hard in the mask, causing Scott's second concussion in nine months and fourth in five years.\nWithin a few days, while undergoing treatment for head, neck and shoulder injuries, Scott realized it was the end of a major league career that began in 1985 and included three World Series assignments, three All-Star Games and 91 postseason games.\n\"In fact, it was pretty easy,\" he said. \"I wasn't planning on this year being the last one. But I thought, this is a sign.\"\nEspecially when he asked three doctors about the possible long-term effects if he got jarred again.\n\"They said, 'We just don't know,'\" Scott said. \"But they told me that the more times you get hit, the more probability that you'll have issues.\"\nThis summer, he saw Bruno Mars and Green Day in concert, watched Fourth of July fireworks from a boat near his home in Portland, Oregon, and enjoyed more time with husband Michael Rausch.\nThey've been together since 1986 and were married in November 2013 in Palm Springs, California, by the city's mayor.\nScott came out as gay after the 2014 season. The next spring training, Reds outfielder Marlon Byrd gave Scott a big hug while trotting to the dugout.\n\"You're free, brother. I'm so proud of you,\" Byrd told him.\nSays Scott: \"I did feel free. I am who I am.\"\nScott's decision will resonate, said Billy Bean, Major League Baseball's vice president for social responsibility and inclusion. Bean came out as gay after his big league career ended in 1995.\n\"He has achieved everything in his umpiring career, and has carried himself with integrity and garnered the respect of his peers and MLB players,\" Bean said. \"I am filled with pride as I reflect on all of his accomplishments. He's a pro's pro, who's been a wonderful example to the LGBT community and all sports fans.\"\n\"Years ago, Dale reached out to me after my personal story went public,\" he said. \"If we had been able to have that conversation when I was still playing, I know it would have changed the course of my career. Dale's legacy will undoubtedly continue to inspire others to pursue their dreams, and I hope we see the results around MLB soon.\"\nScott worked 3,897 regular-season games and was a crew chief for 16 seasons, half his career.\n\"I was fortunate enough to have Dale as my crew chief for 10-plus years. A gifted umpire and true professional, he ran the crew with a smile as he mentored many of today's most successful umpires,\" fellow ump Dan Iassogna said.\n\"The courage that he showed in coming out while still working on the field is as much of an accomplishment as his many World Series and postseason assignments,\" he added.\nScott acknowledged his decision to retire might have been more difficult if his circumstances were different — say, he was 40 and hadn't worked the World Series.\nNow, he walks away with his health intact. And if there were any doubts, he keeps the video of that last violent concussion on his cellphone.\nMLB provides long-term disability for umpires who cannot work because of concussion effects, the same as it does for other permanent injuries.\nScott wonders about umpires who are cleared as part of the concussion protocol and then face the choice of continuing to work and risk further injury, or leaving the game.\n\"That needs to be addressed,\" he said. \"Maybe my situation can be a catalyst for that.\"\nHis future will include rooting like crazy for the Oregon Ducks and, having been a Top 40 AM radio DJ in high school, perhaps some voice work.\nScott also can look back on all the games he did: Among them, he was the plate umpire for Scott Erickson's no-hitter, he worked a season-opening series in Australia, and was the last umpire to eject hot-tempered manager Billy Martin.\nAnd there was that game at old County Stadium in 1986, when a big crowd turned out to welcome the hugely popular Gorman Thomas back to the Milwaukee Brewers.\nThe first time Thomas batted, Scott called strike three. The fading slugger went 0 for 4 and when he got rung up in his last at-bat, it was more than Thomas could take.\n\"It's my night,\" he pleaded with the rookie ump, \"not yours!\"",
    "source_domain": "abcnews.go.com",
    "title": "MLB ump Dale Scott retires rather than risk more concussions",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/mlb-ump-dale-scott-retires-risk-concussions-51733174"
}