{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 13:57:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "In drug crisis hotbed, hoping for action on Trump's words",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fdrug-crisis-hotbed-hoping-action-trumps-words-52815019.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_3bdb76757f204ad9b55bac026c4822e7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump heads to Ohio on Monday to make Cincinnati-area stops focusing on the new tax overhaul — though some in a state with one of the nation's highest overdose rates would rather hear more about his plans for the drug crisis.\nIn Newtown, outside Cincinnati, Police Chief Tom Synan said he found Trump's comments on opioids in his State of the Union address to be \"much of the same. There are very convincing words and there's yet to be very convincing actions.\"\nSynan, a law enforcement representative on the Cincinnati-based Hamilton County Heroin Coalition, wrote a column recently for The Cincinnati Enquirer calling for more urgency in the national response.\nTrump's declaration of a public health emergency in October, he wrote, hasn't been backed by more federal funding.\n\"We need that help to allow us get to the next level,\" Synan said in an interview. \"There are so many more things that could be done, so many more people we could help.\"\nThe White House didn't respond to a request for comment. Trump on Tuesday night had cited the deaths of 64,000 Americans from drug overdoses in 2016, a number expected to rise in 2017.\n\"It is terrible,\" Trump said. \"We have to do something about it.\"\nTrump said his administration is committed to fighting the problem and getting more treatment for those needing it. Stepped-up border security will help fight the drug influx, he said, and the nation needs to get \"much tougher\" on drug dealers to stop what he called \"this scourge.\"\nThe Ohio president of the Fraternal Order of Police, Jay McDonald, attended the State of the Union as a guest of Republican U.S. Sen. Rob Portman.\n\"I think he hit the nail on the head about the scope of the problem,\" said McDonald, of Marion in central Ohio. \"I like the fact he said we need to be tough on traffickers and provide treatment to those addicted.\"\nMcDonald said he'd like to see Trump and Ohio leaders address the \"drastic need for a proven prevention plan\" aimed at heading off youth involvement with drugs.\nHamilton County Heroin Coalition chairwoman Denise Driehaus, a Democratic county commissioner, said she would welcome a Trump visit to discuss what's needed from the federal government for the opioid battle.\n\"We'd ask him to partner with us,\" she said. \"We're limited by lack of resources.\"\nShe and Synan suggested federal, state and local authorities could coordinate for a \"one-stop shop\" to link drug users with treatment options, getting insurance, diversion programs and other needs. More federal funding and regulation and policy changes could expand capacity for treatment and recovery, they said.\nOhio reported 4,050 overdose deaths in 2016, the second-highest overdose death rate after neighboring West Virginia.\n———\nFollow Dan Sewell at http://www.twitter.com/dansewell",
    "source_domain": "abcnews.go.com",
    "title": "In drug crisis hotbed, hoping for action on Trump's words",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/drug-crisis-hotbed-hoping-action-trumps-words-52815019"
}