{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:57:41+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Scientists find massive Mayan society under Guatemala jungle",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fscientists-find-massive-mayan-society-guatemala-jungle-52810234.json",
    "image_url": "http://a.abcnews.com/images/Technology/WireAP_67082eba74b84a2aaee8356de53e2a7a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Researchers using a high-tech aerial mapping technique have found tens of thousands of previously undetected Mayan houses, buildings, defense works and pyramids in the dense jungle of Guatemala's Peten region, suggesting that millions more people lived there than previously thought.\nThe discoveries, which included industrial-sized agricultural fields and irrigation canals, were announced Thursday by an alliance of U.S., European and Guatemalan archaeologists working with Guatemala's Mayan Heritage and Nature Foundation.\nThe study estimates that roughly 10 million people may have lived within the Maya Lowlands, meaning that kind of massive food production might have been needed.\n\"That is two to three times more (inhabitants) than people were saying there were,\" said Marcello A. Canuto, a professor of Anthropology at Tulane University.\nResearchers used a mapping technique called LiDAR, which stands for Light Detection And Ranging. It bounces pulsed laser light off the ground, revealing contours hidden by dense foliage.\nThe images revealed that the Mayans altered the landscape in a much broader way than previously thought; in some areas, 95 percent of available land was cultivated.\n\"Their agriculture is much more intensive and therefore sustainable than we thought, and they were cultivating every inch of the land,\" said Francisco Estrada-Belli, a Research Assistant Professor at Tulane University, noting the ancient Mayas partly drained swampy areas that haven't been considered worth farming since.\nAnd the extensive defensive fences, ditch-and-rampart systems and irrigation canals suggest a highly organized workforce.\n\"There's state involvement here, because we see large canals being dug that are re-directing natural water flows,\" said Thomas Garrison, Assistant Professor of Anthropology at Ithaca College in New York.\nThe 810 square miles (2,100 square kilometers) of mapping done vastly expands the area that was intensively occupied by the Maya, whose culture flourished between roughly 1,000 BC and 900 AD. Their descendants still live in the region.\nThe mapping detected about 60,000 individual structures, including four major Mayan ceremonial centers with plazas and pyramids.\nGarrison said that this year he went to the field with the LiDAR data to look for one of the roads revealed. \"I found it, but if I had not had the LiDAR and known that that's what it was, I would have walked right over it, because of how dense the jungle is.\"\nGarrison noted that unlike some other ancient cultures, whose fields, roads and outbuildings have been destroyed by subsequent generations of farming, the jungle grew over abandoned Maya fields and structures, both hiding and preserving them.\n\"In this the jungle, which has hindered us in our discovery efforts for so long, has actually worked as this great preservative tool of the impact the culture had across the landscape,\" noted Garrison, who worked on the project and specializes in the city of El Zotz, near Tikal.\nLiDAR revealed a previously undetected structure between the two sites that Garrison says \"can't be called anything other than a Maya fortress.\"\n\"It's this hill-top citadel that has these ditch and rampart systems ... when I went there, one of these things in nine meters tall,\" he noted.\nIn a way, the structures were hiding in plain sight.\n\"As soon as we saw this we all felt a little sheepish,\" said Canuto said of the LiDAR images, \"because these were things that we had been walking over all the time.\"",
    "source_domain": "abcnews.go.com",
    "title": "Scientists find massive Mayan society under Guatemala jungle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/scientists-find-massive-mayan-society-guatemala-jungle-52810234"
}