{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:23:00+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Beach replenishment programs refill sand dunes to protect the shore from washing into the ocean around hurricane season, but one veteran New Jersey lifeguard is suggesting the programs also cause more rip currents.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fquestions-raised-beach-replenishment-programs-rip-currents-49201862.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_benitez3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for New questions raised about beach replenishment programs and rip currents\nBack now with that new warning about rip currents and questions about what may be behind a surge in drownings especially on the east coast. ABC's gio Benitez is on the beach in Asbury park, new Jersey, with more. Good morning, gio. Reporter: Michael, good morning to you. We're talking about massive dunes created to protect and restore beaches. But now with so many drownings this summer especially right here on the Jersey shore at least one lifeguard wonders if those dunes are causing rougher surf. They're the videos we seem to be seeing more and more of, strangers jumping into action pulling struggling beachgoers out of the ocean. Rip currents partially to blame for at least 59 deaths this summer alone. And they seem to be happening on every coast with recent deaths in Louisiana, Alabama and here in New Jersey. Six rip current-related eddies in just the past two months alone, that number is usually 1 to 3 per year. In July 80 strangers came together to form a human chain saving the lives of ten people swept out by vicious rip currents. I have never seen anything like it in my entire life because without them I wouldn't have my family. Reporter: This morning new questions about what could be causing all those rough waters. A lifeguard of 50 years on the Jersey shore telling \"The new York post\" he thinks beach replenishment programs which refill sand dunes to protect the shore are doing what they're intended to do but he thinks they can also create more rip currents. While noaa agrees man-made jetties and piers can create hot boxes areas where swimmers are particularly at risk, what really affects the currents are waves, wind, tides and the shape of the ocean floor. The U.S. Army corps of engineers which builds those dunes saying beachfill projects neither create nor worsen rip currents. Rip currents are going to occur with equal frequency in either a natural or completely man-made beach. Reporter: Nearly 100 people die in rip currents every year in the U.S., with more than 68,000 rip current rescues last year alone. One important technique to get out of one. Instead of swimly directly to shore we'll swim diagonally. Now I can feel sand and that's it. I'm out of it. Just because I swam diagonally instead of directly toward the shore. As we take a look at the beaches of Asbury park, New Jersey, a few tips for you. Officials say don't get in the water after dark when lifeguards leave and watch for those red and yellow warning flags, August happens to be the deadliest month for rip currents. Michael. All right, thank you, gio. Some great advice here. Be careful in the water. Keep all of that in mind.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "New questions raised about beach replenishment programs and rip currents",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/questions-raised-beach-replenishment-programs-rip-currents-49201862"
}