{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-04 02:33:38+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Tom Brady wins third NFL MVP; Rams' Todd Gurley finishes second",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ftom-brady-wins-nfl-mvp-rams-todd-gurley%2Fstory%3Fid%3D52821917.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_180203_NFL_feature_brady_mvp_enhanced_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "MINNEAPOLIS, Minn. -- Forget that Tom Brady shattered NFL records as a 40-year-old quarterback in the 2017 season, playing some of his best football in his 18-year career.\nBrady didn't just dominate the 40-year-old age bracket; his excellence extended across the entire NFL. And on Saturday, he became the oldest player to win the NFL's Most Valuable Player award.\nBrady earned 40 votes in balloting by a nationwide media panel, easily winning over Los Angeles Rams running back Todd Gurley (8) and Philadelphia Eagles quarterback Carson Wentz (2).\nPatriots wide receiver Julian Edelman accepted the award on Brady's behalf at the NFL Honors awards ceremony in Minneapolis.\n\"There's no quarterback I'd rather have on my team than Tom Brady,\" Pats coach Bill Belichick said leading up to Sunday's Super Bowl LII showdown against the Eagles. \"I'm glad I have him.\"\nBrady, who also was the NFL's MVP in 2007 and 2010, will try to win his sixth Super Bowl title Sunday. The last NFL MVP to win the Super Bowl was Kurt Warner in the 1999 season.\nVoted first-team All-Pro for the 2017 regular season, Brady was 385-of-581 for a league-high 4,577 yards, with 32 touchdowns and eight interceptions, while leading the Patriots to a 13-3 record.\nIn addition to being the oldest to win NFL MVP, Brady is the oldest QB to start in the Super Bowl and the oldest to lead the NFL in passing yards. Fran Tarkenton, with 3,468 yards in 1978 at age 38 with Minnesota, previously held the distinction.\nBrady's historic season at 40 has been a topic that has followed him all season, which he has embraced by highlighting his commitment to his craft and producing the documentary \"Tom vs. Time,\" with the first four installments released in the week leading up to Super Bowl LII.\n\"I learned that I need to invest in my body, and invest in the things that are going to make me feel good, or else I would have stopped playing 10 years ago,\" he said. \"I don't think there is any way you can continue to play if your body can't do it.\"\nBrady joined 12 other quarterbacks since the 1970 merger to start an NFL game past age 40. The oldest player to attempt a pass in a game was George Blanda at age 48 as a member of the Oakland Raiders in the final game of his career, on Dec. 21, 1975.\nBrady also became the fourth Patriots player to play at 40, joining quarterbacks Doug Flutie (43 in 2005) and Vinny Testaverde (43 in 2006) and linebacker Junior Seau (40 in 2009).\nAs for why he can continue to play, he said in the days leading up to Super Bowl LII: \"I just think I love the game. It's easy to do this when you love it. I think the point is: If you find something you love to do, it never feels like work. I found football, and I found it at a young age, and I just loved it. \"It's hard to explain -- I just love the preparation, I love the offseason, I love the film work. I think a big part of it is because my body feels good, and I've worked hard [at that]. ... I think for a lot of older players, their body doesn't respond. And football is no fun when you're hurting.\"\nOn Sunday, at 40 years and 185 days, Brady will become the oldest non-kicker to play in a Super Bowl.",
    "source_domain": "abcnews.go.com",
    "title": "Tom Brady wins third NFL MVP; Rams' Todd Gurley finishes second",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/tom-brady-wins-nfl-mvp-rams-todd-gurley/story?id=52821917"
}