{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 07:53:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Welcome to Vegas: Billboards ask for tips on gunman's motive",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fvegas-billboards-tips-gunmans-motive-50339431.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_ad44413fceb54340b62909d4f336516c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tourists coming to gamble and party on the Strip will soon find something other than bright lights welcoming them to \"Fabulous Las Vegas.\"\nBillboards will serve as a stark reminder that investigators remain stumped about what drove a gunman to mow down concertgoers from a perch in a high-rise casino hotel last Sunday.\n\"We still do not have a clear motive or reason why,\" a frustrated Clark County Undersheriff Kevin McMahill said Friday. \"We have looked at literally everything.\"\nInvestigators have chased 1,000 leads and examined Stephen Paddock's politics, his finances, any possible radicalization and his social behavior — typical investigative avenues that have helped uncover the motive in past shootings.\n\"We have been down each and every one of these paths,\" McMahill said. \"We all want answers.\"\nThe FBI announced that billboards would go up around the city asking anyone with information to dial 800-CALL-FBI.\n\"If you know something, say something,\" said Aaron Rouse, agent in charge of the Las Vegas FBI office. \"We will not stop until we have the truth.\"\nPaddock, a reclusive 64-year-old high-stakes gambler, rained bullets on the crowd at a country music festival from his 32nd-floor hotel suite, killing 58 and wounding hundreds before taking his own life.\nMcMahill said investigators had reviewed voluminous video from the casino and don't think Paddock had an accomplice in the shooting, but they want to know if anyone knew about his plot beforehand.\nIn their effort to find any hint of his motive, investigators were looking into whether he was with a prostitute days before the shooting, were scrutinizing cruises he took and were trying to make sense of a cryptic note with numbers jotted on it found in his hotel room, a federal official said.\nThe U.S. official briefed by federal law enforcement officers wasn't authorized to discuss the matter publicly and spoke to The Associated Press on condition of anonymity.\nThe official said investigators were interviewing other call girls for information and looking into at least a dozen cruises Paddock took in the last few years, including one to the Middle East.\nIt is unusual to have so few clues five days after a mass shooting. McMahill noted that in past mass killings or terrorist attacks, killers left notes, social media postings and information on a computer, or even phoned police.\n\"The lack of a social media footprint is likely intentional,\" said Erroll Southers, director of homegrown violent extremism studies at the University of Southern California. \"We're so used to, in the first 24 to 48 hours, being able to review social media posts. If they don't leave us a note behind or a manifesto behind, and we're not seeing that, that's what's making this longer.\"\nWhat officers have found is that Paddock planned his attack meticulously.\nHe requested an upper-floor room overlooking the festival, stockpiled 23 guns, a dozen of them modified to fire continuously like an automatic weapon, and set up cameras inside and outside his room to watch for approaching officers.\nIn a possible sign he was contemplating massacres at other sites, he also booked rooms overlooking the Lollapalooza festival in Chicago in August and the Life Is Beautiful show near the Vegas Strip in late September, according to authorities reconstructing his movements leading up to the deadliest mass shooting in modern U.S. history.\nHis arsenal also included tracer rounds that can improve a shooter's firing accuracy in the dark, a law enforcement official told the AP. It wasn't clear whether Paddock fired any of the illuminated bullets during the massacre.\nPaddock bought 1,000 rounds of the .308-caliber and .223-caliber tracer ammunition from a private buyer he met at a Phoenix gun show, a law enforcement official not authorized to comment on the investigation said on condition of anonymity.\nTracer rounds illuminate their path so a gunman can home in on targets at night. But they can also give away the shooter's position.\nVideo shot of the pandemonium that erupted when Paddock started strafing the festival showed a muzzle flash from his room at the Mandalay Bay resort, but bullets weren't visible in the night sky.\nMcMahill said investigators are looking into Paddock's mental health and any medications he was on.\nHis girlfriend, Marilou Danley, told FBI agents Wednesday that she had not noticed any changes in his mental state or seen indications he could become violent, according to a federal official who wasn't authorized to discuss the matter publicly and spoke to the AP on condition of anonymity.\nDanley said she was unaware of any plans Paddock had when he sent her overseas to see family in her native Philippines. She was out of the country at the time of the attacks and has been labeled a \"person of interest,\" though she's not in custody and is cooperating with authorities.\nBecause so few people knew Paddock well, investigators will have a harder time probing his background for clues or hints he may have dropped about his plans, Southers said.\nThere's \"no one to say who's he mad at, what his motive is,\" Southers said. \"The key to this case right now is the girlfriend.\"\n———\nMelley reported from Los Angeles. Associated Press writers Ken Ritter, Regina Garcia Cano and Josh Hoffner in Las Vegas; Jacques Billeaud in Phoenix; and Don Babwin and Michael Tarm in Chicago contributed to this report.\n———\nFor complete coverage of the Las Vegas shooting, click here: https://apnews.com/tag/LasVegasmassshooting.",
    "source_domain": "abcnews.go.com",
    "title": "Welcome to Vegas: Billboards ask for tips on gunman's motive",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/vegas-billboards-tips-gunmans-motive-50339431"
}