{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:57:01+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "UN rights chief alarmed over Burundi militia 'rape' song",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frights-chief-alarmed-burundi-militia-rape-song-46858671.json",
    "image_url": "http://abcnews.go.com/International/wireStory/rights-chief-alarmed-burundi-militia-rape-song-46858671",
    "language": "en",
    "localpath": null,
    "maintext": "The U.N.'s top human rights official said Tuesday he is alarmed by what appears to be a \"widespread pattern\" of rallies in Burundi in which members of a pro-government youth militia chant a call to \"impregnate\" or kill opponents.\nAn online video emerged this month of an incident in a rural province involving the Imbonerakure militia. It showed members singing in the local Kirundi language: \"Impregnate those opponents, so that they give birth to Imbonerakure.\"\nBurundi's ruling party criticized the song. The party normally supports the Imbonerakure, despite accusations of rights violations perpetrated by its members.\nThe U.N. human rights office cited reports of several similar incidents early this month.\n\"The grotesque rape chants by the young men of the Imbonerakure across several provinces in various parts of Burundi are deeply alarming — particularly because they confirm what we have been hearing from those who have fled Burundi about a campaign of fear and terror by this organized militia,\" the high commissioner for human rights, Zeid Ra'ad al-Hussein, said in a statement.\nZeid welcomed the governing party's condemnation but said reports senior officials were present at other rallies are \"very disturbing\" and called for an acknowledgement that the rally caught on camera \"was not an isolated incident.\"\nBurundi has been plagued by violence since President Pierre Nkurunziza successfully sought a disputed third term in 2015. Hundreds of people have been killed, and hundreds of thousands have fled the country.\nZeid said his office has received \"credible reports of grave human rights violations, including the systematic use of torture by security forces and nightly raids by the Imbonerakure into the homes of people who refuse to join the ruling party.\"",
    "source_domain": "abcnews.go.com",
    "title": "UN rights chief alarmed over Burundi militia 'rape' song",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/rights-chief-alarmed-burundi-militia-rape-song-46858671"
}