{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:18:58+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Frussia-offers-ukraine-probing-journalists-murder-55528440.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_c3f86ce03af340c8b076fd7b29883f20_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "To the gasps, whoops and applause of stunned colleagues, Russian journalist Arkady Babchenko walked into a news conference Wednesday, less than a day after police in the Ukrainian capital said he had been assassinated.\nAuthorities said his death had been staged to foil a plot on his life by Moscow's security services and one arrest was made. Russia denounced the faked killing as an outlandish attempt at defamation by its neighbor and foe.\nEven Babchenko's wife was unaware of the deception, and the 41-year-old Kremlin critic who fled to Ukraine 15 months ago apologized to her \"for the hell she had to go through in the past two days. There was no choice there, either.\"\nNeither Babchenko nor Ukrainian Security Service chief Vasyl Gritsak gave details of the sting operation or how they made his wife believe he was dead.\nKiev Police Chief Andriy Krishchenko had announced Babchenko's death Tuesday, saying the journalist's wife found him bleeding at their apartment building in Kiev but that he died en route to the hospital. Lawmaker Anton Gerashchenko, an adviser to the interior minister, said the assailant had waited on a staircase in the building and shot Babchenko in the back as he was going to buy bread.\nJust hours before the shooting was reported, Babchenko wrote on Facebook that he considered the day a \"second birthday\" because it was the fourth anniversary of his missing a flight on a Ukrainian military helicopter that later was shot down in the conflict between Ukraine and Moscow-backed separatists in the eastern part of the country.\nAt the start of Wednesday's news conference, Gritsak announced the journalist's murder had been solved and called the day Babchenko's \"third birthday.\"\nBabchenko, clad in a black sweatshirt, walked into the room as other reporters gasped and exclaimed their surprise, then broke into applause.\n\"I'm still alive,\" an uneasy-looking Babchenko said with a straight face. Then he apologized for the deception.\n\"I know that sickening feeling when you bury a colleague,\" he added.\nThe news conference produced mixed emotions.\n\"I was shocked. But then a feeling of happiness rose up,\" said Serhii Nuzhnenko, a freelance journalist.\nBabchenko said he was not allowed to go into the details of his false death. He said Ukraine's law enforcement had been aware of a contract on his head for two months. He said he was approached by the Ukrainian Security Service, or SBU, a month ago.\n\"The important thing is my life has been saved and other, bigger terrorist attacks have been thwarted,\" he said.\nIt also was unclear why authorities decided to go to such lengths to make it look as if Babchenko was dead.\nGritsak said investigators had identified a Ukrainian citizen who allegedly was paid $40,000 by the Russian security service to organize and carry out the hit. The unidentified Ukrainian man in turn allegedly hired an acquaintance to be the gunman, he added.\nThe suspected organizer of the alleged hit plot was detained Wednesday, Gritsak said, suggesting the bogus killing was aimed at flushing him out, and he showed a video of the arrest.\nKilling Babchenko was part of a larger alleged plot by Russian security services, Gritsak said. The Ukrainian man also was supposed to procure large quantities of weapons and explosives, including 300 AK-47 rifles and \"hundreds of kilos of explosives,\" to perpetrate acts of terror in Ukraine, he said.\nThe Russian Foreign Ministry said the Ukrainian government was \"fanning anti-Russian hysteria. We're confident our foreign partners and the relevant international agencies will draw correct conclusions from the whole situation.\"\nKonstantin Kosachev, head of the international affairs committee of the upper house of the Russian parliament, compared Ukraine's actions to Britain accusing Moscow of being behind the nerve gas poisonings of a Russian former spy and his daughter in England. Russia vehemently denies poisoning Sergei Skripal and his daughter, Yulia Skripal.\n\"The logic is the same — to defame Russia,\" Kosachev told the state news agency Tass.\nUkraine also faced a backlash from international journalism figures.\n\"I deplore the decision to spread false information on the life of a journalist. It is the duty of the state to provide correct information to the public,\" said Deniz Yazici of the media freedom office of the Organization for Security and Cooperation in Europe.\nReporters Without Borders director Christophe Deloire tweeted his \"deepest indignation at the discovery of the manipulation of the Ukrainian secret services. It is always deeply dangerous for states to play with the facts.\"\nSome wondered if the ruse would ultimately backfire, harming Ukraine's credibility or undermining concern about violence against journalists.\n\"There's one nuance — if somebody's shot now, nobody will believe it,\" noted journalist Mustafa Nayyem, who became a parliament member, told The Associated Press.\nBabchenko, one of Russia's best-known war reporters, fled the country in February 2017. He spoke and wrote about needed to leave Russia because of threats against him and his family. He said his home address was published online and the threats he received were made by phone, email and social media.\nMoscow's annexation of Crimea and support for separatists in eastern Ukraine were topics on which the journalist was scathingly critical of the Kremlin. His flight from Russia came several months after he wrote in a Facebook post that he wasn't sorry that members of a military band and state TV journalists died in a plane crash on their way to Russia's military base in Syria.\nSeveral Russian lawmakers said at the time that Babchenko should be stripped of his citizenship over the comment, and Russian state media called him a traitor.\nIlya Ponomarev, a former Russian lawmaker who also moved to Ukraine, said Babchenko continued being threatened after he settled last fall in Kiev, where he worked as a host for the Crimean Tatar TV station.\n———\nVasilyeva reported from Moscow. Jim Heintz in Moscow, Ayse Wieting in Istanbul, Turkey, and Geir Moulson in Berlin contributed.",
    "source_domain": "abcnews.go.com",
    "title": "'Slain' Russian journalist turns up alive at news conference",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/wireStory/russia-offers-ukraine-probing-journalists-murder-55528440"
}