{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 15:23:24+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "He says he was \"unable to contain himself: as he stared down the man accused of sexually assaulting his three daughters.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Ffather-apologizes-lunging-larry-nassar-court-52814770.json",
    "image_url": "http://a.abcnews.com/images/GMA/180203_gma_reshef_709_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Father apologizes after lunging at Larry Nassar in court\nto the chaotic and emotional scene in a courtroom. A distraught father lunging at Larry Nassar, the former olympic doctor convicted of sexually abusing scores of young female athletes. The father had just heard his own daughters read their victim impact statements. He has now apologized but saying he wants Nassar to go to, quote, one of the deepest, darkest, hottest pits in hell. Erielle reshef joins us with more. Reporter: It was a dramatic day the father saying he was unable to contain himself. Judge, would a disastronaut father is a chance to say something? You son of a . Reporter: Raw emotion boiling over in a Michigan courtroom. Grant me five minutes in a locked room with this demon. Would you do that? That is not -- Yes or no? No, sir -- Would you give me one minute? You know that I can't do that. That's not how our legal system. Well, I'm going to -- Randall margraves charging Larry Nassar during another sentencing hearing. Let me have that . Stay down. I want that -- The father of three girls who say they were molested by Nassar tackled, cuffed and held in contempt. Do not behave like that. No one can behave like this. I wanna -- Well, you haven't lived through it. No charges. The judge speaking in court. I'm you were here. I can't say that I understand. I don't know what it would be like to stand there as a father and know three of your girls were physically and emotionally injured by somebody sitting in a courtroom. Reporter: Margraves saying he was incensed watching Nassar shake his head. Now I have to live with the fact that I failed to protect my daughters. Reporter: He was sentenced in another jurisdiction to 40 to 17 175 years. Michigan state university where he worked is under intense scrutiny for his case and other alleged sexual misconduct and confirmed it was served a search warrant. The interim school president said he was surprised because his lawyers are already discussing about handing over potential materials and documentation. Wrenching story. Thank you, erielle, appreciate\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Father apologizes after lunging at Larry Nassar in court",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/father-apologizes-lunging-larry-nassar-court-52814770"
}