{
    "authors": [
        "Abc News",
        "David Rind",
        "Kelly Terez",
        "More Brad",
        "More David",
        "More Kelly"
    ],
    "date_download": "2018-07-04 15:59:39+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "It's Wednesday, July 4, 2018. Here are some of the stories we're talking about on ABC News' new daily podcast, \"Start Here.\"",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fstart-here-supreme-court-shortlist-focus%2Fstory%3Fid%3D56262105.json",
    "image_url": "https://s.abcnews.com/images/US/amy-coney-barrett-file-zp-jef-180629_hpMain_4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's Wednesday, July 4, 2018. Here are some of the stories we're talking about on ABC News' new daily podcast, \"Start Here.\"\n1. SCOTUS short list\nPresident Donald Trump has been meeting this week with potential Supreme Court candidates who will fill the seat Justice Anthony Kennedy will soon vacate. Trump said he would have a decision by Monday, but who's on his shortlist so far?\nAmelia Thomson-DeVeaux is with our partners at FiveThirtyEight, and she tells us whom we should keep an eye on.\n\"Start Here\" is a daily ABC News podcast hosted by Brad Mielke featuring original reporting on stories that are driving the national conversation. Listen for FREE on the ABC News app, Apple Podcasts, TuneIn, Spotify, Stitcher, Google Play Music, iHeartRadio -- or ask Alexa: \"Play 'Start Here.'\"\nFollow @StartHereABC on social for exclusive content, show updates and more: Twitter, Facebook, Instagram.\n2. A House divided\nHouse Minority Leader Nancy Pelosi has been the face of House Democrats for more than a decade, but the events of the last month, including the upset primary victory of Alexandria Ocasio-Cortez in New York, has only emboldened those who are calling on leadership to clean house.\nWe ask ABC News' John Parkinson, who covers the House, if Pelosi or someone else will be leading the party in the fall.\nREX via Shutterstock\n3. The Challenger's survivor\nThe space shuttle Challenger explosion in 1986 was a tragedy, but a hopeful story emerged from the wreckage. A soccer ball survived the disaster and spent years hiding in a school's display case before eventually being sent into space for a second time.\nABC News' Bob Woodruff, who created a documentary about the ball for E:60, tells us why the story is so unfamiliar and what it means for future generations.\nBob Pearson/AFP/Getty Images, FILE\n4. God Bless America\nThis year marks the 100th anniversary of \"God Bless America,\" but you may not know the surprising history of the iconic song and the immigrant who wrote it.\nAuthor Sheryl Kaskowitz tells us the story of the song: \"What you think is going to be a simple symbol of patriotism ... is gonna be a bit more complicated than you think.\"",
    "source_domain": "abcnews.go.com",
    "title": "'Start Here': Supreme Court shortlist comes into focus",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/start-here-supreme-court-shortlist-focus/story?id=56262105"
}