{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:48:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "London residents demand answers in deadly high-rise blaze",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flondon-residents-demands-answers-deadly-high-rise-blaze-48040472.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_876fd962a74d4d859a9bdb699220db1e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With smoke still swirling around the charred remains of Grenfell Tower in west London, residents and community leaders demanded to know Wednesday how a ferocious fire could have swept through the high-rise apartment block with such speed that it killed at least 12 people.\nThe anger was particularly strong since activists had warned just seven months ago that fire safety procedures were so lax that only a catastrophic blaze would bring the scrutiny needed to make the building safe.\nWHAT HAPPENED?\nFire and police officials have not specified what went wrong, but extensive video footage shows the flames climbing the exterior of the building at a remarkable pace.\n\"I've never seen a fire like that in my life,\" said Joe Ruane, the former deputy chief fire officer for U.S. Air Force bases in Britain. \"I've never seen that in a residential block.\"\nThe 24-story public housing complex is owned by the local government council in the borough of Kensington and Chelsea and was completed in the 1970s. It is managed by the Kensington and Chelsea Tenant Management Organization, which spent 10 million pounds ($12.8 million) refurbishing the building over the last two years.\nThe renovation project included installation of insulated exterior cladding, double-glazed windows and a communal heating system. Investigators need to look at what materials were used in the project and who approved their use, Ruane said. But he said the speed with which the fire spread suggests that more than one fire protection safeguard failed.\n\"It's not just one thing,\" Ruane said. \"It's multiple issues.\"\nWHAT WAS THE FIRE PROCEDURE AT THE BUILDING?\nSome residents suggested that Grenfell Tower's policies were to blame for the disaster.\nA newsletter put out by the building's tenant organization told tenants to follow a \"stay put\" policy and remain in their apartments during a fire unless the blaze was inside their apartment or in their hallway or until they were told to evacuate by officials.\nThis policy is in place \"because Grenfell was designed according to rigorous fire-safety standards,\" according to the 2014 newsletter about the renovation project. New front doors in each apartment could withstand a fire for up to 30 minutes, \"which gives plenty of time for the fire brigade to arrive,\" the newsletter said.\nThat policy, often followed in high-rise hotels, may be effective in lesser fires. In this case, however, the fire seemed to climb the exterior of the tower so quickly that it overwhelmed protective systems like fire doors. People who initially remained in place may have been unable to escape later because the hallways and fire escapes were filled with heavy smoke and flames.\nThe London Fire Brigade said crews were on the scene within six minutes of the first reports of the fire, but they were unable to reach people on higher floors to prevent fatalities.\nWHO IS TO BLAME?\nWhile investigations are underway to determine what went wrong, tenants said repeated complaints were ignored. Survivor Edward Daffarn said the Kensington and Chelsea Tenant Management Organization, or KCTMO, which manages the Grenfell Tower as well as other buildings in the area, is responsible because it ignored numerous warnings.\nThe management organization's annual accounts for the year ending March 31, 2016, indicate that the company has been cited for fire-safety issues in the past.\nFollowing an October 2015 arson fire at one of the buildings it manages, the 14-story Adair Tower, the London Fire Brigade issued an enforcement notice to install self-closing devices on the front doors of all 78 apartments and to improve fire safety in staircases used for escape, the organization said in the report.\nThe Fire Brigade issued a similar notice for another KCTMO-managed building, Hazelwood Tower. The upgrades were scheduled to be completed by 2016, the report said.\nThe Grenfell Tower disaster is uncomfortably similar to a fast-moving blaze at another London-area public housing project, Lakanal House, that killed six people, including three children, eight years ago. In that July 2009 fire, smoke and flames quickly engulfed the 14-story building. A coroner's inquest found that a series of failures contributed to the loss of life and made a number of recommendations to help prevent future disasters.\nInvestigators probing the Grenfell Tower fire will have to look at which of those recommendations were implemented in the building and which were not, said Jim Fitzpatrick, a former firefighter who now serves in the House of Commons.\n\"These will be matters for the scientists and the engineers ... to find out exactly how the fire started, why it spread so quickly and what could have been done to prevent it,\" Fitzpatrick told Sky News.\nA local community organization, the Grenfell Action Group, had warned about fire dangers at the building since 2013. In a series of blog posts, the group raised concerns about testing and maintenance of fire-fighting equipment and blocked emergency access to the site.\n\"All our warnings fell on deaf ears, and we predicted that a catastrophe like this was inevitable and just a matter of time,\" the group said in a blog post Wednesday.\nKCTMO said it is cooperating with investigators and that it was aware of tenant complaints. \"We always take all concerns seriously and these will form part of our forthcoming investigations,\" it said in a statement.\nThe Kensington and Chelsea Council promised a full investigation into Wednesday's tragedy and a public accounting. The UK government also ordered checks at tower blocks that have had or are going through similar renovations as those at Grenfell Tower.",
    "source_domain": "abcnews.go.com",
    "title": "London residents demand answers in deadly high-rise blaze",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/london-residents-demands-answers-deadly-high-rise-blaze-48040472"
}