{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 10:49:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The Latest: May blames 'game-playing' for UK election call",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flatest-pound-falls-amid-growing-uk-election-speculation-46857236.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_8203a57ae8794823bbd3aef4175522c6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the announcement that Prime Minister Theresa May is seeking to call a general election on June 8 (all times local):\n11:20 a.m.\nPrime Minister Theresa May has accused her opponents of \"political game-playing\" and undermining the country in the upcoming talks to exit the European Union.\nMay said Tuesday that the divisions in Parliament explained her change of heart on an early election. Since becoming prime minister last July in the aftermath of Britain's vote to leave the EU, May had consistently said she would not seek an early election.\nMay said she has concluded that the \"only way to guarantee certainty and security for years ahead is to hold this election.\"\nUnder the Fixed-Term Parliaments Act, the next general election date was to be in 2020. But an early election can take place if two-thirds of lawmakers in the House of Commons vote for it. The opposition Labour Party, which trails May's Conservative Party in opinion polls, has said it supports such a move.\n———\n11:15 a.m.\nPrime Minister Theresa May has said she is planning to call a general election for Thursday, June 8.\nIn a surprise statement in Downing Street, May said Parliament will be asked to vote for the election on Wednesday.\nMay's Conservative Party is way ahead of the main opposition Labour Party in opinion polls. A resounding win would bolster her mandate in upcoming talks with the European Union over the country's exit.\nShe said \"division in Westminster will risk our ability to make a success of Brexit.\"\n———\n10:45 a.m.\nThe British pound has fallen amid mounting speculation that Prime Minister Theresa May is planning to call an early general election.\nIn the wake of an announcement that May will make an unexpected statement in Downing Street at 11:15 a.m. (1015GMT), the pound was down 0.3 percent at $1.2525.\nMay's office says she will speak after the weekly meeting of her Cabinet.\nFXTM Vice President of Market Research, Jameel Ahmad says that \"truth be told, nobody is really that aware of what is going on but this uncertainty has caused a reaction.\"\n———\n10:30 a.m.\nBritish Prime Minister Theresa May is due to make an unexpected statement in Downing Street, triggering speculation that she plans to call an early election.\nMay's office says she will speak at 11:15 a.m. (1015GMT) Tuesday, after the weekly meeting of her Cabinet.\nSuch statements are generally reserved for major news, such as resignations and election calls.\nMay, who took office in July after predecessor David Cameron stepped down, could be tempted to go to the polls to secure her own mandate as she negotiates Britain's withdrawal from the European Union.\nBut she has previously said she will stay in office until the next scheduled national election, in 2020.\nUnder Britain's Fixed-Term Parliaments Act, the prime minister can call an election if two-thirds of lawmakers vote for it.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: May blames 'game-playing' for UK election call",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/latest-pound-falls-amid-growing-uk-election-speculation-46857236"
}