{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 17:32:41+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Celebrating the Fourth of July with a patriotic display of fireworks is a quintessential holiday activity.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Flegal-fireworks-state-fourth-july%2Fstory%3Fid%3D56326234.json",
    "image_url": "https://s.abcnews.com/images/US/GTY_fireworks_2_jt_160703_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Celebrating the Fourth of July with a patriotic display of fireworks is a quintessential holiday activity. But for those who want their own personal fireworks display, it might not always be a legal celebration.\nInterested in 4th of July? Add 4th of July as an interest to stay up to date on the latest 4th of July news, video, and analysis from ABC News. Add Interest\nThis year, all but one state has laws that allow for the sale of at least some type of firework devices. These laws range from some states only allowing sparklers and other types of novelty devices, to others that allow any kind of consumer-grade fireworks to be sold. Massachusetts is the only state that has a total blanket ban on all types of fireworks.\nEach state is free to make their own laws about the sale and use of fireworks, and those laws can vary wildly from state to state. The different types of consumer-grade fireworks are regulated by the U.S. Consumer Product Safety Commission (CPSC).\nIt’s important to note that while some fireworks may have been approved by your state government, your local government may have additional restrictions. The CPSC encourages you to check the local laws in your city, town, or county to make sure the fireworks you want to use are legal.\nSTOCK/Getty Images\nNew York is one state where the laws vary by county. While sparklers are legal in most parts of the state, they remain illegal in New York City, plus Columbia, Nassau, and Schenectady Counties. The State Office of Fire Prevention and Control lists hundreds of stores across the state where the legal devices can be sold.\nWhile California allows some types of consumer fireworks, they remain illegal in some parts of the state.\nDaniel Berlant, who oversees the fireworks program for the California Office of the State Fire Marshal, told ABC News that the agency tests all fireworks that are allowed in the state to make sure they don’t explode or have uncontrollable sparks. They also include in their public education campaign for the public and visitors information about their zero-tolerance policy towards illegal fireworks.\nMayor of Los Angeles Eric Garcetti tweeted on Monday a reminder about the city’s municipal fireworks ban, warning of the danger involved.\n#Fireworks are illegal in the City of Los Angeles and even small ones can cause a lot of damage. This watermelon was completely destroyed by a firework the size of a stick of gum. ?? This #FourthOfJuly be safe, find a professional show near you: https://t.co/gow9utbD5K pic.twitter.com/KHqrJZDVba — Mayor Eric Garcetti (@MayorOfLA) July 2, 2018\nState fire officials in California stress that they will be enforcing the laws against illegal fireworks. If convicted of having or using any illegal fireworks, a violator could face up to a $50,000 fine and a maximum of one year in prison.\nIn light of the wildfires burning across the state, officials in Colorado are urging residents to attend professional displays instead of setting off their own fireworks. In addition, some counties may have emergency bans on fireworks and open burning because of the potential for new wildfires to start. Officials urge those who do choose to use fireworks to make sure they do so legally and safely, by not lighting them near dry grass or brush, and by having a hose or bucket of water nearby.\nSTOCK/Getty Images\nFlorida’s law has a big loophole that was created as a result of a 2002 court case. The state has a law banning fireworks that aren’t sparklers to people who don’t fall under some limited exceptions, like railroad companies using them as signals, people using them for sporting or ceremonial events, or farmers looking to scare birds away from their crops. A Florida court ruled that a fireworks distributor could not be charged for illegally selling fireworks because the undercover detective that purchased them signed a form saying that he fell under one of the exceptions, and the seller was not required to verify that information. Since the Legislature hasn’t closed the loophole, it remains open to this day.\nPennsylvania recently overhauled their fireworks regulations for the first time since 1939. The state legislature passed a bill in October that legalized all types of consumer-grade fireworks. Previously, some of these could only be sold to out of state residents, according to the Pennsylvania State Police. The state also applies heavy taxes on the devices, adding a 12 percent tax on top of the sales tax. The proceeds go towards grants for first responders like EMS workers and firefighters.\nRegardless of what type of fireworks your state permits, the CPSC urges those celebrating Independence Day with any type of fireworks to do so carefully. Speaking at a safety event run by the Commission last week, Michael Spencer, who lost several fingers in a fireworks-related accident in 2015 shared his advice with the public.\n“Fireworks can be extremely dangerous, even if they are legal,” said Spencer. “My advice would be to leave them to the professionals.”",
    "source_domain": "abcnews.go.com",
    "title": "What to know about legal fireworks in your state this Fourth of July",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/legal-fireworks-state-fourth-july/story?id=56326234"
}