{
    "authors": [
        "Abc News",
        "Jordyn Phelps",
        "More Ali",
        "More Jordyn"
    ],
    "date_download": "2018-03-19 20:57:07+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Trump said other countries with \"zero tolerance\" don't have drug problems.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-calls-death-penalty-drug-dealers-country-ready%2Fstory%3Fid%3D53857260.json",
    "image_url": "https://s.abcnews.com/images/Politics/donald-trump-new-hampshire-03-gty-jc-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump doubled down on his call for the death penalty for drug dealers in a speech in New Hampshire Monday, making the case that such a zero-tolerance policy would fix the nation’s drug problem.\nInterested in Opioid Epidemic? Add Opioid Epidemic as an interest to stay up to date on the latest Opioid Epidemic news, video, and analysis from ABC News. Add Interest\n“We have to change the laws, and we're working on that right now. The Department of Justice is working very, very hard on that. But the ultimate penalty has to be the death penalty,\" Trump said. \"Maybe our country's not ready for that. It's possible, it's possible that our country is not ready for that,” he said.\n“Although personally, I can't understand that,” he continued.\n“You take a look at some of these countries where they don’t play games,” he said, not mentioning any by name. “They don’t have a drug problem.”\n\"We can have all the blue ribbon committees we want,\" Trump said, \"but if we don't get tough on drug dealers, we are wasting our time.\"\nAs he talked about punishing drug dealers, a woman yelled out from the audience: “What about compassion?” Trump seemed to not hear it or ignore it.\nSpencer Platt/Getty Images\nA White House release on Trump's initiative said the Justice Department would seek the death penalty, \"where appropriate under current law,\" against those convicted of dealing and trafficking in fentanyl and other opioids. Some experts have questioned whether the move would have much impact.\nFour months after declaring the opioid crisis a public health emergency, Trump said he came back to New Hampshire because he'd promised during the campaign to help the state deal with its opioid drug problem, noting the state's death rate from overdoses is double the national average.\nTrump's wife Melania introduced him saying she'd seen the effect of the \"crisis\" first-hand when visiting hospitals and treatment centers.\n\"I'm proud of this administration's effort to end this epidemic,\" she said.\nSpencer Platt/Getty Images\nLooking on in the audience were Attorney General Jeff Sessions and senior counselor Kellyanne Conway, who has taken the White House lead on the opioid issue.\nWhile Trump's speech took place in 2018, it was in many ways a throwback to the 1980s when the “Just Say No” campaign was a leading effort to combat the nation’s drug problem. The president said it’s time again to scare kids away from drugs through a well-funded commercial campaign.\n“It's the least expensive thing we can do, where you scare them from ending up like the people in the commercials. And will make them very, very bad commercials. Will make them pretty unsavory situations,” he said.\nHe also said he and first lady Melania Trump were introducing a new website, crisisnextdoor.gov, where people affected by the opioid crisis can share stories. Other new policy goals include cutting overall opioid prescriptions by one-third over the next three years and urging Congress to get rid of an old law prohibiting Medicaid from paying for care at some treatment facilities.\nTrump also related the opioid crisis to immigration, saying he will work to end sanctuary city policies and accusing Democrats of stonewalling progress on DACA because they want to stop construction of the border wall. There was a short chant of “Build the wall!”\n“They don't want to go with DACA because they don't care about DACA, but they're trying to tie the wall to DACA and DACA to the wall,” he said.\nTrump claimed 90 percent of illegal drugs come through the southern border. \"Eventually the Democrats will agree with us to build the wall to keep the damn drugs out!\"\nTrump said he would “probably” hold a “major news conference” at the White House in about a month to discuss dealing with how prescription drugs contribute to the overall drug addiction problem but did not give any further details.",
    "source_domain": "abcnews.go.com",
    "title": "Trump calls for death penalty for drug dealers but says country might not be ready",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-calls-death-penalty-drug-dealers-country-ready/story?id=53857260"
}