{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 23:11:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Israel intercepts Gaza rocket, retaliates with tank fire",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fisrael-retaliates-rocket-fire-gaza-airstrike-51723036.json",
    "image_url": "http://abcnews.go.com/International/wireStory/israel-retaliates-rocket-fire-gaza-airstrike-51723036",
    "language": "en",
    "localpath": null,
    "maintext": "The Israeli military said it intercepted a rocket launched at Israel from the Gaza Strip late Monday, a few hours after Israel bombed Hamas military positions in retaliation for rocket fire earlier in the evening.\nThe military said in a statement that the Iron Dome missile defense system shot down a rocket fired at Israel from the Palestinian territory. No injuries or damage were reported in Israel.\nShortly afterward, an Israeli tank responded by bombarding a Hamas military position in the northern Gaza Strip, the military said. No injuries were reported.\nEarlier, Israeli planes and tanks shelled the coastal territory after militants fired a rocket toward southern Israel, in what was the latest in a series of cross-border exchanges that have left at least four Palestinians dead since Friday.\nMonday's strikes came a day after Israel said it destroyed a tunnel built by Hamas that ran several hundred meters (yards) into Israeli territory. Hamas threatened Israel with a \"heavy price\" for demolishing the tunnel.\nPalestinians and Israeli forces have clashed across the West Bank and along the Gaza border following President Donald Trump's recognition of Jerusalem as Israel's capital. Palestinians were infuriated by the president's declaration last week, because they seek east Jerusalem as the capital of their future state.",
    "source_domain": "abcnews.go.com",
    "title": "Israel intercepts Gaza rocket, retaliates with tank fire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/israel-retaliates-rocket-fire-gaza-airstrike-51723036"
}