{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 00:41:39+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Michigan panel urges temporary shutdown of Mackinac pipeline",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmichigan-panel-urges-temporary-shutdown-mackinac-pipeline-51727504.json",
    "image_url": "http://abcnews.go.com/International/wireStory/michigan-panel-urges-temporary-shutdown-mackinac-pipeline-51727504",
    "language": "en",
    "localpath": null,
    "maintext": "A government safety panel on Monday urged the temporary shutdown of twin oil pipelines in the Straits of Mackinac until their operator can finish inspections and repair coating gaps, after some members expressed concerns over a recent deal between the state and Enbridge Inc.\nThe Michigan Pipeline Safety Advisory Board approved the non-binding resolution as members of Gov. Rick Snyder's administration who sit on the panel abstained from voting. Other non-binding resolutions call for temporarily halting the flow of oil during storms that produce sustained waves at least 3 feet (0.9 meter) high for longer than an hour, instead of an 8-foot (2.4-meter) threshold included in the agreement, and recommend that a \"more robust\" study of alternatives to Line 5 be completed.\nThe agreement, announced Nov. 27, sets an Aug. 15 deadline for determining the future of the nearly 5-mile-long (8-kilometer) segment beneath the channel where Lakes Huron and Michigan converge. Options include shutting down the pipeline or routing it through a tunnel beneath the lakebed where it now rests.\nBecause five or six members of the 16-person board voted for the measures while many others abstained, there was confusion over whether they had passed. Co-chairwoman Valerie Brader, executive director of the Michigan Agency for Energy, said she expected the Republican governor's administration to consider the resolutions as advisory while also taking note of the number of abstentions.\nBoard member Jennifer McKay of the Tip of the Mitt Watershed Council said she hopes the governor gives the resolutions \"due consideration\" and seeks amendments to the deal. Although the federal government regulates oil pipelines, Michigan owns the lake bottom and in 1953 granted an easement to the Canadian company allowing the pipeline to go there.\n\"We know we have coating gaps. It's a violation of the easement and it only makes sense to shut down the pipeline until Enbridge can adequately address and fix the coating issues to ensure we don't have any type of rupture or leak,\" she said.\nThe line transports about 23 million gallons (87 million liters) daily between Superior, Wisconsin, and Sarnia, Ontario.\nAt least four board members expressed frustration that Snyder struck the agreement without their input, contending it short-circuited the public process and signals that tunneling the pipeline is ultimately the state's preference. State officials on the board, however, said the deal is an interim one and is not intended to \"prejudge\" the fate of the pipeline.\n\"Certainly apologies if there was any perceived disrespect,\" said Michigan Department of Natural Resources Director Keith Creagh. \"As we heard about the entire length of the pipeline, there were some measures put into place ... to ensure that there was a higher standard essentially in the interim as this board contemplates the future of Line 5.\"\nSome board members, including a state Public Service Commission member and a representative for Attorney General Bill Schuette, said they had not had a chance to adequately study the resolutions at the meeting and they should have been circulated earlier.\nEnbridge spokesman Ryan Duffy said the company was evaluating the measures.\n\"We believe the Nov. 27 agreement between Enbridge and the State of Michigan benefits everyone who wants to protect communities and the environment around the Great Lakes,\" he said.\nWhile not ruling out a permanent shutdown, the agreement includes a series of steps intended to boost the underwater pipes' safety. Enbridge agreed to evaluate three options by June for routing the underwater segment through a tunnel or trench, on or beneath the lakebed — either using the existing pipes or building a new one.\nThe company promised steps to prevent the lines from being damaged by a ship anchor, expedite monitoring of the pipelines with cameras or other devices, and speed up methods for detecting potential ruptures and responding to spills.\nAdditionally, Enbridge said it would replace another section of Line 5 beneath the St. Clair River where it crosses the U.S.-Canadian border with a new pipe inside a tunnel after receiving federal and state permits.\nThe company has repeatedly insisted the underwater segment installed is in good condition and has never leaked. However, state officials and environmental groups have expressed alarm over recent disclosures of gaps in its exterior layer of protective enamel coating and unsupported spaces beneath the pipes.\n———\nFollow David Eggert on Twitter at https://twitter.com/DavidEggert00 . His work can be found at https://apnews.com/search/David%20Eggert .",
    "source_domain": "abcnews.go.com",
    "title": "Michigan panel urges temporary shutdown of Mackinac pipeline",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/michigan-panel-urges-temporary-shutdown-mackinac-pipeline-51727504"
}