{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 01:31:13+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fpurdues-isaac-haas-expected-play-tourney-brace%2Fstory%3Fid%3D53861755.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0319/dm_180319_NBA_CAVS_WOJ_ON_LUE/dm_180319_NBA_CAVS_WOJ_ON_LUE_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "WEST LAFAYETTE, Ind. -- Purdue center Isaac Haas appears to be done for the season, even if Purdue's medical team or its crack engineering department can create an elbow brace that allows him to play in the NCAA tournament.\nEven if the NCAA approves a protective device for Haas' fractured right elbow, coach Matt Painter said, there are still limitations and playing wouldn't be beneficial for Haas' health.\n\"He had the best brace you can have, and he couldn't shoot right-handed free throws with it,'' Painter said Monday. \"He wants to play. But at the end of the day, you have to put people out there who can help you.''\nThe 7-foot-2, 290-pound Haas was injured during the second half of Friday's win over Cal State Fullerton when he crashed hard to the floor while fighting for a rebound. The next day, the Boilermakers' trainers and doctors explored options to give the Alabama native a chance to come back. They fitted him with a bulky brace, which allowed Haas to run with his teammates at practice.\nBut the NCAA disallowed the contraption out of safety concerns for other players.\nEven if officials had allowed Haas to play with the device, Painter was concerned about his limitations -- the inability to make free throws and grab rebounds with both hands -- making him an even bigger target for opponents to challenge and foul.\n\"He's going to need surgery, and they're going to have to put a couple of pins in there,'' Painter said. \"They say it can't get worse unless he falls, but people who cover us know he falls all the time.''\nHaas did not speak with reporters Monday, and his absence in Sunday's second-round game didn't hurt Purdue (30-6), which beat Butler 76-73 to reach its second straight Sweet 16. Purdue faces Texas Tech (29-6) in Boston on Friday.\nBack on campus, word trickled down to Painter that some in the school's well-regarded engineering department were seeking a solution that would allow Haas to use both hands effectively.\n\"I think they're working on something, a class project or something,'' Painter said. \"But I really don't know.''\nPainter commended Haas for staying engaged and providing leadership since suffering the injury. The big senior was Purdue's second-leading scorer at 14.7 points and No. 2 rebounder at 5.7. He also blocked 46 shots.\nMatt Haarms, a 7-3 redshirt freshman, replaced Haas in the starting lineup while 6-10 Jacquil Taylor, who had been used sparingly this season, joined the rotation.",
    "source_domain": "abcnews.go.com",
    "title": "Purdue's Isaac Haas not expected to play in tourney, even with brace",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/purdues-isaac-haas-expected-play-tourney-brace/story?id=53861755"
}