{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 21:03:05+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Bill Cosby's attorneys asked a jury Tuesday to acquit the comedian.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fbill-cosbys-lawyer-tells-jury-verdict-hinge-metoo-54702753.json",
    "image_url": "https://s.abcnews.com/images/US/180424_nwo_cosby_trial_closing_arguements_MIX_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Bill Cosby's lawyer tells jury verdict should not hinge on #MeToo movement\nOver the past two weeks bill Cosby's but he did as the serial rapists and the victim of a con artist. Now the fate of America's data once again rests in the hands of the jury and hot and what's not telling the truth. Did you narration aquae Mexico happy up all these I just simply on the fact that you add. What is case of given to a jury last year it they deadlocked after six days of deliberations. This time both sides have given the jury much more to consider Cosby is charged with three counts of aggravated indecent assault. All stemming from one woman's allegation. If you Constance says causing knocked her out with the re pills before sexually assaulting her at his suburban Philadelphia mansion. In January 2004 copies T says they had a consensual relations. Shift in the original trial can't stand with only accuser the jury heard from. But this time prosecutors were allowed to call five additional women who testified in graphic detail. But the times they claim causing drove in sexually violated then in the eighties. Company's legal team attempted to undermine can't stand credibility claiming she's a pathological liar only after the money. Citing a civil sediment at nearly 3.4 million dollars she already received from Cosby. In blistering closing arguments the defense attacked them meet to movement comparing it to McCarthyism and lynchings. While this story is only considering Condit and allegations dozens of women have come forward accusing Conte of sexual assault. If convicted he faces up to thirty years in prison essentially a late sentence for the eighty year old comedian Maggie really ABC news Norris town Pennsylvania.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Bill Cosby's lawyer tells jury verdict should not hinge on #MeToo movement",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/bill-cosbys-lawyer-tells-jury-verdict-hinge-metoo-54702753"
}