{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 09:37:45+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Rodgers Caps Brilliant Run, Packers Beat Lions for NFC North",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Frodgers-caps-brilliant-run-packers-beat-lions-nfc-44508060.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/rodgers-caps-brilliant-run-packers-beat-lions-nfc-44508060",
    "language": "en",
    "localpath": null,
    "maintext": "Aaron Rodgers danced all over the Ford Field turf, avoiding sacks, keeping plays alive and eventually lifting Green Bay to the NFC North title.\nThe Packers' quarterback certainly looks healthy, and there wasn't much the Detroit Lions could do to stop him.\nRodgers threw for 300 yards and four touchdowns, and Green Bay beat the Lions 31-24 on Sunday night to edge Detroit by one game for the division. The Packers finished the regular season on a six-game winning streak, and Rodgers threw for 18 touchdowns with no interceptions in the final seven games.\nDetroit is also headed to the playoffs as a wild card.\nWhen his team was 4-6, Rodgers said he thought Green Bay could \"run the table\" — and the Packers did just that for the rest of the regular season.\n\"That's what you have to do sometimes as a leader. You have to exude confidence even in a situation where it seems to the outside world that confidence shouldn't exist, and that's kind of what I did,\" Rodgers said. \"I believe in myself and my abilities, but I also believe in this team.\"\nRodgers finished the regular season with 4,428 yards passing, with 40 touchdowns and seven interceptions. He's dealt with a sore right calf but showed no ill effects while smoothly eluding Detroit's pass rush all night.\nGreen Bay (10-6) will open the playoffs at home against the New York Giants next Sunday, and Detroit (9-7) plays at Seattle on Saturday.\nThe Lions were trying to win their first division title since 1993 but came up short, losing their final three games and settling for a wild card.\n\"Obviously, guys don't like to lose. They're competitors,\" Detroit coach Jim Caldwell said. \"But the fact of the matter is though that we have an opportunity. When you look at the alternative, this is 1,000 times better than that.\"\nHere are a few things we learned from the final game of the NFL regular season:\nON A ROLL\nGreen Bay's offense is operating at a very high level. The Packers have scored at least 30 points in four straight games, and they finished with 448 yards and 28 first downs against the Lions. From the second quarter on, it seemed like penalties were the only real obstacle for Green Bay.\nA STEP BELOW\nThe Lions could end up beating Seattle for their first postseason win in 25 years, but it would be an upset. Detroit is the lowest-seeded team in the NFC playoffs and hasn't measured up against the league's best. The Lions are 0-5 against other teams that are headed to the postseason.\nRUNNING THREATS\nThe Lions and Packers lean on their passing, but there were some hints of more balance Sunday. Detroit's Zach Zenner ran for 69 yards and a touchdown, and Green Bay's Aaron Ripkowski had 61 yards on only nine carries. The Packers rushed for 153 yards as a team.\nSWOON\nFor a second straight game, Detroit fell flat in the second half. Against Dallas, the Lions were tied 21-all at halftime before losing 42-21. Then Detroit led Green Bay 14-10 after two quarters before the Packers scored 21 of the game's next 24 points.\nSCARY MOMENT\nGreen Bay cornerback Quinten Rollins was carted off with a neck injury in the second half after tumbling out of bounds on the Detroit sideline. The Packers said he was conscious with movement and was being evaluated at the hospital.\n\"He was communicating and everything — looked positive before he left the field,\" coach Mike McCarthy said. \"I think with that, our players had confidence that he was going to be OK.\"\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL .\n———\nFollow Noah Trister at www.Twitter.com/noahtrister",
    "source_domain": "abcnews.go.com",
    "title": "Rodgers Caps Brilliant Run, Packers Beat Lions for NFC North",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/rodgers-caps-brilliant-run-packers-beat-lions-nfc-44508060"
}