{
    "authors": [
        "Abc News",
        "More Catherine"
    ],
    "date_download": "2017-12-11 14:33:48+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "5 years after tragedy, families of Sandy Hook victims work to prevent gun violence",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fyears-tragedy-families-sandy-hook-victims-work-prevent%2Fstory%3Fid%3D51704423.json",
    "image_url": "http://a.abcnews.com/images/US/sandy-hook-shooting-victims-gty-rc-171002_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Five years after a mass shooting at a Connecticut elementary school horrified the nation, some family members of victims reflected on how their lives have changed since the tragedy, as they work together to prevent future acts of gun violence.\nInterested in Sandy Hook? Add Sandy Hook as an interest to stay up to date on the latest Sandy Hook news, video, and analysis from ABC News. Add Interest\n\"We simply don't want other parents to be in our position. We know that these acts of violence are preventable,\" Nicole Hockley, whose son, Dylan, was killed at Sandy Hook Elementary School in Newtown five years ago, told ABC News' Amy Robach. \"We feel responsible to teach people how to prevent them from happening.\"\nHockley recalled how her Dylan, who had autism, loved to pretend to he was a butterfly.\nThe Hockley Family/AP Photo\n\"He would flap his arms up and down whenever he got excited, which was pretty much all the time, and I asked him once, 'Why do you flap?' and he said, 'because I'm a beautiful butterfly,'\" she said.\n\"At his funeral I talked about how the theory of a butterfly flapping its wings on one side of the world can cause a hurricane on the other side,\" Hockley said. \"I thought about Dylan as our butterfly to help create change in our country, positive, transformative change.\"\nJason DeCrow/AP, FILE\nHockley co-founded the Sandy Hook Promise, a nonprofit organization that uses educational programs to help prevent acts of gun violence before they occur.\nFather vows to 'invest every fiber of my being' to 'prevent that from happening again'\nJessica Hill/AP\nThe community of Newtown was thrust into the national spotlight five years ago this week when it was rocked by tragedy after a gunman opened fire at Sandy Hook Elementary School. Twenty students -- between the ages of 6 and 7 -- and six educators were killed.\nThe shooting drew many immediate calls for reform or action to prevent a similar tragedy from ever happening again. Just this October, however, the U.S. suffered the deadliest mass shooting in history when a gunman killed 59 people at a country music festival in Las Vegas, Nevada.\nMark Barden, who also co-founded Sandy Hook Promise after his son, Daniel, was killed at the elementary school, told ABC News that he \"made a very deliberate decision to invest every fiber of my being into trying to prevent that from happening again.\"\nBarden recalled his son as \"an exceptionally sweet, compassionate little soul.\"\nJessica Hill/AP\n\"My one little Daniel has in his life affected so many people in a positive way, but in his murder I can't even tell you,\" Barden said.\n\"We're training people, students, parents, teachers, how to recognize the warning signs that people give off before they hurt themselves before they hurt someone else,\" Barden said.\n'I hope she would be very proud,' husband says of his wife\nBill Sherlach/AP Photo\nBill Sherlach told ABC News that the work he is doing now to prevent mass shootings is in honor of his wife, Mary Sherlach, who worked as a psychologist at Sandy Hook Elementary school where she was murdered.\n\"I hope she would be very proud,\" Bill Sherlach said. \"We're making a lot of lemonade ... we've been given a whole lot of lemons, and we're just making a whole lot of lemonade, and doing everything we can, to hopefully make her proud of us.\"\nRobert F. Bukaty/AP Photo\nSherlach added that they have been told that their work has prevented school shootings.\n\"We've already done it,\" he said. \"There's been a number of school shootings that we know we've thwarted.\n'For Dylan, I will always keep going,' mother says of son\nPat Eaton-Robb/AP\nSandy Hook Promise released a new video today, approximately five years after the tragedy. The public service announcement calls on viewers to learn the warning signs exhibited by those who may act violently towards themselves or others, and to take action to prevent acts of violence before they occur.\nThe PSA, called \"Tomorrow's News,\" depicts mock news coverage of a school shooting from the day before it occurred, to illustrate how it possibly could have been prevented.\n\"It's easy to know the right thing to do after it's too late to do anything,\" Greg Hahn, the chief creative officer at BBDO New York, the advertising firm that helped create the video, said in a statement.\n\"In this PSA, we illustrate that when it comes to gun violence prevention, the stakes are too high to let that continue to be the case,\" Hahn added.\nHockley told ABC News that \"it is not a comfortable piece to watch.\"\n\"But you know what? Gun violence isn't comfortable,\" she added.\nHockley said that the tireless work she is doing with Sandy Hook Promise is all in honor of Dylan, and to ensure that no other parent has to lose their child in the same way she did.\n\"For Dylan, I will always keep going,\" Hockley said. \"And to ensure that more moms and dads out there can continue to hug their kids every single night for the rest of their lives, I will keep going.\"",
    "source_domain": "abcnews.go.com",
    "title": "5 years after tragedy, families of Sandy Hook victims work to prevent gun violence, make lost loved ones 'proud'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/years-tragedy-families-sandy-hook-victims-work-prevent/story?id=51704423"
}