{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 21:11:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Suspect Steve Stephens hasn't been seen since the Sunday afternoon shooting.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fmanhunt-cleveland-facebook-murder-suspect-expands-national-search-46848943.json",
    "image_url": "http://a.abcnews.com/images/US/1704_wews_cleveland_police_presser_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Manhunt for Cleveland Facebook murder suspect expands to national search\nWell we want to announce that. There will be there is an award. To 50000 dollars for the rest. Mr. Steve Stephens. Which comes to money comes from me if that ATF and who Marshal service. But also wanted to emphasize that. That we are steel engaged in a very aggressive. Am very. Focus. Attempt to find. Steve Stevens in and bring him to justice we rule emphasize again the need. For the community to give us support they've been very supportive. As they do when this incident and we as within the continued support. As the mayor stated. The new developments are the are war that's being offered. Thanks our federal partners in crime stoppers we appreciate. But also. Were still in points need to turn himself. Definitely two contact the relative or friend because there are a lot of folks out there that wanna talked. Want to get this resolved peacefully. So Steve if you're out there listening. Call someone. Whether it's a friend or family member. Or pastor our res. Now is. Basically all of this country. Our federal partners. Our local partners. Reached out to their contacts all of the country. And this is what we would consider. A national search.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Manhunt for Cleveland Facebook murder suspect expands to national search",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/manhunt-cleveland-facebook-murder-suspect-expands-national-search-46848943"
}