{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 21:18:52+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "AP Interview: Ex-UN chief says Trump must rethink on climate",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fchief-trump-causing-global-leadership-vacuum-48038841.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_584bd0808c454f338516f6cf6b4f0128_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Donald Trump should stand \"on the right side of history\" by reconsidering the decision to pull the United States out of the Paris climate change accord, former United Nations chief Ban Ki-moon said Wednesday.\n\"If the U.S. withdraws, this has a much bigger political impact. I'm afraid that any leadership vacuum could be filled by others, and this is not what we want to see,\" Ban said Wednesday in an interview with The Associated Press. He called the choice made by the U.S. president \"misguided\" and said that it responded to \"a short-term vision.\"\nHe also called on the public to raise its voice and said that commitment to the agreement from governors, mayors, business leaders and civil society in the U.S. was \"very encouraging.\"\nFor almost a decade, Ban spearheaded negotiations to combat climate change that eventually led to the pledge of keeping global temperatures from rising another degree Celsius by 2100.\nNearly 200 countries, including the U.S., signed the agreement in December 2015.\n\"I sincerely hope that President Trump stands on the right side of history,\" Ban said in Madrid.\nAs the world's largest economy, the United States is the planet's number two polluter after China, accounting for 14 percent of global emissions.\n\"The decision has implications and effects politically and psychologically much larger than 14 percent, because smaller countries have traditionally followed Washington's leadership\" said Ban, calling on the U.S. leader to show \"global vision.\"\nOn Wednesday, Ban joined more than 50 former world leaders who criticized the current U.S. administration's view on climate change and warned of \"unpredictable and possibly regrettable\" consequences. They also called on other signatories of the Paris agreement to \"show greater urgency and commitment in the fight against global warming.\"\nThe leaders represented about half of the members of the Club de Madrid alliance, which Ban joined recently as an honorary member.\nAmong the signatories were former Chilean President and former U.N. envoy for climate change Ricardo Lagos, Nobel Peace winner and former East Timor leader Jose Manuel Ramos-Horta and former New Zealand Prime Minister Helen Clark, who also headed the U.N.'s development agency.\nBan also referred to the situation in the Korean Peninsula as \"very worrisome\" following Pyongyang's continuing of weapons launches, against U.N. Security Council resolutions, including recent anti-ship missiles.\nThe former South Korean foreign minister said the testing of ballistic technology is putting Kim Jong Un's regime \"on the verge\" of being able to develop a nuclear-tipped long-range missile.\n\"Never before since the Korean War has the level of tension been so high,\" Ban said, calling on North Korea \"to stop all provocations\" in order for the international community to restart a dialogue.\nHe also said that the leaders of the U.S. and South Korea should come up with solutions to reduce the tension in the Korean Peninsula during a summit in Washington in late June.\n———\nThis story has been corrected to show that the U.S. is the world's No. 2 polluter, after China.",
    "source_domain": "abcnews.go.com",
    "title": "AP Interview: Ex-UN chief says Trump must rethink on climate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/chief-trump-causing-global-leadership-vacuum-48038841"
}