{
    "authors": [
        "Abc News",
        "More Adam"
    ],
    "date_download": "2017-02-15 05:14:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Trump associates communicated with suspected Russian intel officers: sources",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Ftrump-associates-communicated-suspected-russian-intelligence-officials-ahead%2Fstory%3Fid%3D45500891.json",
    "image_url": "http://a.abcnews.com/images/International/gty-trump-flynn-2-er-170210_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. authorities were concerned with and probing communications between associates of President Donald Trump and suspected Russian intelligence officials in the leadup to the 2016 presidential election, sources familiar with the matter confirm to ABC News.\nThe news comes just a day after Trump's national security adviser, Michael Flynn, resigned amid questions about conversations he had with the Russian ambassador during the transition and continuing inquiries about the administration's relationship with Russia.\nThe New York Times first reported the alleged “repeated contacts” between the associates and Russians in the year leading up to the election. U.S. officials speaking with the Times noted however that there was no evidence of cooperation between the campaign and the Russians to “influence the election.”\nA U.S. intelligence report released in January previously noted that Russian President Vladimir Putin ordered a campaign to undermine the November’s presidential election and steer American voters to Trump.\nIn January, Trump denied that he or anyone in his campaign had contact with Russia leading up to the election when asked by ABC News' Cecilia Vega. He has also denied having anything to do with Russia at all.\nRussia has never tried to use leverage over me. I HAVE NOTHING TO DO WITH RUSSIA - NO DEALS, NO LOANS, NO NOTHING! — Donald J. Trump (@realDonaldTrump) January 11, 2017\nAnd today, White House press secretary Sean Spicer was asked a similar question by ABC News' Jonathan Karl.\nSpicer at first discussed Flynn, but when pressed said: \"I don't have any -- I -- there's nothing that would conclude me that anything different has changed with respect to that time period.\"",
    "source_domain": "abcnews.go.com",
    "title": "Trump associates communicated with suspected Russian intelligence officials ahead of election: sources",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/trump-associates-communicated-suspected-russian-intelligence-officials-ahead/story?id=45500891"
}