{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 07:15:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Local China government suspends plant project after protests",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Flocal-china-government-suspends-plant-project-protests-45502032.json",
    "image_url": "http://abcnews.go.com/International/wireStory/local-china-government-suspends-plant-project-protests-45502032",
    "language": "en",
    "localpath": null,
    "maintext": "The government of an oil city near China's border with Russia said Wednesday that it was suspending an aluminum plant project following street protests by some residents over pollution fears, in the latest sign of rising environmental consciousness among some Chinese.\nOn Tuesday, more than 200 protesters faced off against dozens of police officers outside the Daqing government headquarters and chanted no to the plant planned by aluminum producer Zhongwang Holdings Ltd. A resident reached by phone, who asked not to be identified for fear of reprisals, said that protests had been taking place since earlier this month.\nThe Daqing city government and Zhongwang signed an agreement to cooperate on the plant in 2011. It is still in the planning stages and both say it would create more than 30,000 jobs.\nBut following the protests, the city government said in an online statement that it had agreed with Zhongwang to suspend the project and would make a decision on whether to continue \"based on a broad consensus of citizens.\"\nSuch environmental protests are becoming increasingly common as China's middle-class demands a cleaner environment and becomes more aware of health risks.\nTo contain unrest, local governments in China often announce suspensions to chemical and other projects following protests, and then quietly restart them months later.\nTackling the problem of pollution after decades of breakneck economic growth remains a serious challenge for the ruling Communist Party, with air pollution alone blamed for 1.4 million premature deaths in China every year, according to estimates by researchers at Germany's Max Planck institute.\nHowever, Hong Kong-listed Zhongwang earlier issued a statement saying that its production processes met international environmental standards.",
    "source_domain": "abcnews.go.com",
    "title": "Local China government suspends plant project after protests",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/local-china-government-suspends-plant-project-protests-45502032"
}