{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:00:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Rapper is appealing decade-old gun and drug convictions.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fcourt-orders-judge-free-rapper-meek-mill-bail-54702519.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/WireAP_6dc49fd7b3ae488a987cfed305f362c6_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pennsylvania's highest court on Tuesday ordered a judge to free rapper Meek Mill on bail while he appeals decade-old gun and drug convictions, following a five-month campaign by his supporters to get him out.\nThe Supreme Court directed a Philadelphia judge who had jailed him to immediately issue an order releasing him on unsecured bail, though it wasn't immediately clear how soon he would get out.\nMill was sentenced in November to 2-4 years in prison for probation violations.\nDozens of people gathered outside the prison near Philadelphia in hopes of seeing him walk free.\nA team of lawyers and public relations consultants had waged an all-out battle to get him freed, leveling fierce criticism at the judge as a stream of high-powered figures and celebrities visited him in jail outside Philadelphia, including actor Kevin Hart just hours before the Supreme Court ruling.\nMill issued a statement saying the past months had been \"a nightmare,\" and thanked his many supporters and visitors, who included Philadelphia Mayor Jim Kenney and New England Patriots owner Robert Kraft.\n\"Although I'm blessed to have the resources to fight this unjust situation, I understand that many people of color across the country don't have that luxury and I plan to use my platform to shine a light on those issues,\" Mill said.\nHe said he would now focus his attention on getting his convictions overturned, and that he looks forward to resuming his music career.\nEarlier this month, in a major victory for Mill, prosecutors said they agreed with his lawyers that he should get a new trial because of questions raised about the arresting officer. The now-retired officer was among a list of police officers the prosecutor's office has sought to keep off the witness stand in cases across the city because of credibility questions.\nA spokesman for District Attorney Larry Krasner said late Tuesday that the Supreme Court's decision on Meek Mill's release was consistent with the position taken by their office.\nMill's attorney, Joe Tacopina, thanked the high court.\n\"Meek was unjustly convicted and should not have spent a single day in jail,\" Tacopina said.\nIn an opinion earlier this month, Judge Genece Brinkley, who sent Mill to prison for the probation violations, strongly defended herself against accusations by the defense she was waging a vendetta against the rapper. She said the court \"has impartially and without prejudice presided over numerous proceedings in this matter since 2008.\"\nThe Supreme Court denied a defense request to move the case to another judge, but said the presiding judge could opt to remove herself.",
    "source_domain": "abcnews.go.com",
    "title": "Court orders judge to free rapper Meek Mill on bail",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/court-orders-judge-free-rapper-meek-mill-bail-54702519"
}