{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 05:50:35+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Clerical abuse scandal hits Argentine president's school",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fclerical-abuse-scandal-hits-argentine-presidents-school-49199613.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_05d346d8dcef4a82a66582f911af55ee_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rufino Varela was a distraught, confused 12-year-old when he went looking for help from the school chaplain to tell him he'd been sexually abused by a mason at his family's home.\nInstead of aiding, Varela says, the Rev. Finnlugh Mac Conastair took off the boy's pants, flogged him and fondled him in a room below the chapel at one of Argentina's most prestigious schools. Then, the Irish priest known by many as \"Father Alfredo,\" offered him candy and told him that they should keep it as a secret with God.\n\"I had come looking for help, but I felt that it was a punishment from God,\" Varela said. \"I came back to the classroom, holding back tears, went home and never spoke about it.\"\nThe secret was kept for nearly four decades. But in recent months, Varela's decision to break his silence has led several other former students to denounce clerical abuse at a school that has educated President Mauricio Macri and many other members of Argentina's elite.\nThe case is one of several that have shown the church has not been spared sexual scandals even in the home territory of Pope Francis, who has pledged a zero-tolerance policy against abuses that have rocked the church around the world.\nWhile the pope had no connection with the abuse at the time — he led the Argentine branch of the Jesuit order with no relationship to the school — Varela said he received a call from the pontiff this year after revealing the abuse publicly.\nThe Cardenal Newman school was launched in Argentina in 1948 by the Christian Brothers, a religious order founded two centuries ago to focus on educating disadvantaged youth. In recent years, it has faced abuse claims at many of the schools it has opened worldwide.\nAt the time of Varela's 1977 encounter with Mac Conastair, the socially conservative church school had evolved into something of a refuge for children of the rich.\nVarela said he decided to confront Newman authorities about the abuse after he heard that the school planned to add a crown to the lion in its coat of arms in honor of Macri, a 1976 graduate who was elected president in 2015.\n\"Instead of a crown, it would give me more comfort to see a whip or a crown of thorns,\" Varela said in a letter to the rector. \"This would be in remembrance of the aberrations that many others suffered.\"\nVarela said Newman's rector, Alberto Olivero, then met with him, offered psychological treatment and tried to dissuade him from going public with the story. The school refused to comment and referred questioners to written statements.\nFrustrated at the lack of public acknowledgement, Varela said, he spoke to Argentina's La Nacion newspaper in December 2016. He also began writing about it on Facebook.\nIn February, his phone rang and Pope Francis was on the line. The pontiff expressed his solidarity and apologized on behalf of the church. \"He told me that I needed to understand that I was a very important part of a broken link,\" Varela said.\nThe Vatican doesn't confirm or deny such calls, saying they are part of Francis' pastoral activities.\nVarela said about 20 other former students have contacted him to describe similar abuse carried out by Mac Conastair, a Passionist, and by at least one Christian Brother priest at the school. At least four of the ex-students repeated accounts of witnessing or suffering abuse to The Associated Press, though it is not clear if the others had reported the incidents earlier. Both of the priests have died.\nPedro Ellis told the AP he was about 14 years old when Mac Conastair called him into his room. With the excuse of giving him a sex talk, he asked him to get naked and lie down on his bed.\n\"He touched my buttocks and then, he introduced one or two fingers inside my rectum,\" Ellis told the Associated Press.\nEllis, now 52, said that he's considering seeking compensation for the abuse.\nJulio Castano said the chaplain he'd seen as \"God's representative on earth\" called him into his room in 1979 and fondled the then 12-year-old.\n\"I decided it was now time to tell it, so we can get this off our backs,\" said Castano, who until then, had not told anyone else publicly or informed the school.\nAnother former student alleged that the Brother John Derham sat him on his lap in the school library and kissed him on the mouth. A fourth ex-student, Guillermo Newbery, 68, told the AP that he witnessed Derham make students sit on his lap during his class, saying he would \"caress students excessively, rubbed them and hugged them inappropriately.\"\nNewbery said he told his parents in 1963 and they reported it to the school's Parent Association. Derham died in 1986.\nAfter Varela spoke to the press, Olivero sent a letter addressed to the Newman community and acknowledged the abuse of at least one student 40 years ago.\nA copy of the letter was posted on the school gate. Without naming anyone, it said that the Christian Brothers apologized \"for the abuse that all former students could have suffered as a result of the inadequate and unjustified behavior\" of the chaplain.\nThe head of the Christian Brothers for Latin America, Hugo Caceres, sent Varela a letter expressing \"solidarity and Christian compassion\" for all abuse victims.\nAt the time of Varela's abuse, the rector was John Burke, an Irishman who was in charge of Newman from 1979-1996. Burke was later named member of a Christian Brothers committee for safeguarding children in Europe.\nBurke confirms he learned of the abuse in 1980, but said he didn't know the identity of the victim until Varela went public.\n\"Towards the end of the school year of 1980, I was made aware of a complaint of inappropriate behavior by the college chaplain towards a pupil whose identity was not known or revealed to me,\" Burke said in a statement to the AP.\nIt wasn't clear how Burke had learned of the case, though Varela said that he once told lay brother Desmond Finnegan, who counseled him to remain quiet about the incident and pray for the elderly chaplain.\nIn an odd twist, Burke said he sought advice about the case from a lawyer who turned out to be Varela's father, a judge in charge of child protection cases.\n\"I can understand your shock at hearing that I had spoken with your father concerning the priest,\" Burke wrote in a June 2016 letter to Varela. Varela said his father died without ever learning of the abuse of his son.\nBurke told Varela that, \"I took immediate and what I judged to be appropriate measures to ensure the safety and wellbeing of all the pupils in the school and of every person who had contact with the chaplain.\"\nThe measures included \"immediate removal of the chaplain by his religious superior and the Bishop of the Diocese.\"\nRecords obtained by the AP show that Mac Conastair was transferred to the San Cayetano vicary, but it's unknown whether he had contact with other children before he died in 1997.\nClerical abuse experts say Burke's action was significant because in the 1970's there were no church rules for reporting such crimes.\n\"It sounds like at least John Burke took some action and the bishop forced the priest out of the school,\" said Maeve Lewis, executive director of victims group One in Four. \"That happened here (in Ireland) all the time and no one brought it to the attention of their bishop.\"\nBut Varela remained frustrated at the failure of Burke, the school and the Brothers to acknowledge the \"abhorrent sexual and psychological abuses\" in public.\n\"I am not the only victim of Newman School. We both know it,\" Varela wrote in a letter to Burke in October 2016. He also criticized for former rector for failing to mention the abuse when he spoke at an annual alumni dinner attended by Macri that month.\nA video published online by Newman's alumni association five years ago, shows Burke referring to Derham as his novice master and praising him as \"the most extraordinary person.\"\nIn March 2017, the church held a Mass to apologize to Varela and any other victims.\n\"The church has asked for pardon and I renew that request here, in my diocese, to all those people who have been victims of abuse, whether as children or youths, by members of our hierarchy,\" San Isidro Bishop Oscar Ojeda said in his homily.\nHe said church leaders have a duty to bring such cases before both civilian and canonical courts — a reference to procedures adopted in response to an avalanche of complaints that church leaders had long been too slow in responding to abuse cases.\nIn Argentina, two priests and three other men were arrested last year and charged with sexually abusing more about 20 students at the Antonio Provolo Institute, a school for the hearing impaired. One of the priests had been accused of abusing students at Provolo's Verona, Italy, school, and was even identified to Francis as an abuser in a letter in 2014, but no action was taken against him by the Vatican.\nThe Champagnat school founded by the Marist Brothers in downtown Buenos Aires recently reported that a lay brother allegedly abused a former student 38 years ago. The elite school, whose alumni include former Argentina President Fernando de la Rua, said the brother had carried out directorial duties at the school over the last decade. It said an investigation had been launched and that the person, who was not named, had been sent to a nursing home for \"old and sick brothers.\"\nVarela said he expects more from the church.\n\"You ask yourself: Why are these people still free?\" Varela said.\n——\nAssociated Press writer Nicole Winfield in the Vatican contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Clerical abuse scandal hits Argentine president's school",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/clerical-abuse-scandal-hits-argentine-presidents-school-49199613"
}