{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:52:34+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fus-agency-cracks-juul-cigarette-popular-schools-54691068.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/us-agency-cracks-juul-cigarette-popular-schools-54691068",
    "language": "en",
    "localpath": null,
    "maintext": "Federal health officials are cracking down on underage use of a popular e-cigarette brand following months of complaints from parents, politicians and school administrators.\nThe Food and Drug Administration said Tuesday it has issued warnings to 40 retail and online stores as part of a nationwide operation against illegal sales of Juul to children.\nFDA regulators also are asking manufacturer Juul Labs to turn over documents about the design, marketing and ingredients of its devices. The rare request particularly focuses on whether certain product features are directly appealing to young people.\nLike other e-cigarettes, Juul is an electronic device that turns liquid — usually containing nicotine — into an inhalable vapor. Thanks in part to its resemblance to a small computer flash drive, Juul has become popular with some teenagers as a discreet way to vape at school and in public.\nHealth advocates have worried about the popularity of vaping products among kids and the potential impact on adult smoking rates in the future. A recent government-commissioned report found \"substantial evidence\" that young people who use e-cigarettes are more likely to try cigarettes.\nFDA Commissioner Scott Gottlieb said the agency plans additional actions in coming weeks.\n\"This isn't the only product that we're looking at, and this isn't the only action we're going to be taking to target youth access to tobacco products, and e-cigarettes, in particular,\" Gottlieb said in an interview.\nJuul sales have exploded over the past two years and the brand now accounts for 55 percent of the U.S. market for e-cigarettes, according to industry figures. That's up from just 5 percent of the market in 2016.\nThe San Francisco-based company said in a statement it agrees with the FDA that underage of its products is \"unacceptable.\"\n\"We already have in place programs to identify and act upon these violations at retail and online marketplaces, and we will have more aggressive plans to announce in the coming days,\" the statement read.\nJuul Labs says it monitors retailers to ensure they are following the law. Its age verification system searches public records and sometimes requires customers to upload a photo ID.\nE-cigarettes have grown into a $4 billion industry in the U.S. despite little research on their long-term effects, including whether they are helpful in helping smokers quit cigarettes.\nThat's the sales pitch made by Juul and many other e-cigarette manufacturers: \"Juul delivers nicotine satisfaction akin to a cigarette in a format that's as simple and easy to use,\" states the company's website. A Juul \"starter kit\" can be ordered online for $49.99. The company's website is intended to only sell to customers ages 21 and up.\nThe FDA gained authority to regulate e-cigarettes in 2016, but anti-smoking advocates have criticized the agency for not policing the space more aggressively to stop companies from appealing to underage users, particularly with flavors like mango, cool cucumber and creme brulee.\n\"These are very positive steps and demonstrate that FDA recognizes the problem of youth use is very serious,\" said Matthew Myers, of the Campaign for Tobacco-Free Kids. \"But they don't address the biggest issue that the FDA is not been enforcing its own rules.\"\nMyers' group contends that Juul and several other e-cigarette companies have recently launched new flavors and varieties without seeking FDA authorization. That step is mandatory under the FDA regulations put in place summer of 2016.\n———\nThe Associated Press Health & Science Department receives support from the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content.",
    "source_domain": "abcnews.go.com",
    "title": "US agency cracks down on Juul e-cigarette popular in schools",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/us-agency-cracks-juul-cigarette-popular-schools-54691068"
}