{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 18:16:10+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Auburn names Jarrett Stidham starting quarterback",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fauburn-names-jarrett-stidham-starting-quarterback%2Fstory%3Fid%3D49209167.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0813/dm_170813_MLB_Coley_Harvey_on_Harpers_injury/dm_170813_MLB_Coley_Harvey_on_Harpers_injury_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jarrett Stidham is officially Auburn's next starting quarterback.\nThe school made the announcement on Monday, ending weeks of speculation that the former Baylor quarterback was the frontrunner to start at the position ahead of last year's starter Sean White.\nAuburn coach Gus Malzahn tweeted the news: \"The team is excited for Jarrett and ready for the season!\"\nThe announcement comes on the heels of Auburn's second scrimmage on Saturday.\nWhite tweeted that he was \"all in,\" despite not winning the starting job.\nStidham started three games as a true freshman at Baylor in 2015, completing 75 of 109 passes for 1,265 yards, 12 touchdowns and two interceptions. After the firing of coach Art Briles, Stidham announced that he was leaving the program. He attended a junior college but didn't play football last season before signing with Auburn.\nThe 6-foot-3, 214-pound sophomore has the accuracy and mobility to be a good fit in Malzahn's system. He earned A-Day Offensive MVP this spring in his first showcase in front of Auburn fans, completing 16 of 20 passes for 267 yards.\nAuburn opens the season on Sept. 2 against Georgia Southern before traveling to defending national champion Clemson in Week 2.",
    "source_domain": "abcnews.go.com",
    "title": "Auburn names Jarrett Stidham starting quarterback",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/auburn-names-jarrett-stidham-starting-quarterback/story?id=49209167"
}