{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:57:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Leonard's 37 points lead Spurs by Grizzlies 96-82",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fleonards-37-points-lead-spurs-grizzlies-96-82%2Fstory%3Fid%3D46855225.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170418_NBA_One-Play_Leonard_layup_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "SAN ANTONIO -- The Spurs responded to another late-game meltdown as they have all season: relying on a little 3-point shooting and a whole lot of Kawhi Leonard. They also got an assist from the officials, according to Memphis coach David Fizdale. Leonard had a postseason career-high 37 points and added 11 rebounds, and San Antonio beat the Memphis Grizzlies 96-82 on Monday night to take a 2-0 lead in their first-round series. Game 3 is Thursday night in Memphis. San Antonio led for all but 13 seconds in winning its 10th consecutive postseason game over Memphis. \"This team has character, besides the talent and the desire to win,\" Spurs center Pau Gasol said. \"We have to keep that up every single night. We responded well when they made their run, and that's the mindset we have to have every night.\" Leonard finished 9 for 14 from the field and was 19 for 19 on free throws. Leonard attempted more free throws than Memphis had as a team, which infuriated Fizdale. \"We don't get the respect that these guys deserve because Mike Conley doesn't go crazy, he has class and he just plays the game,\" Fizdale said. \"But I'm not going to let them treat us that way. I know (Spurs coach Gregg Popovich has) got pedigree and I'm a young rookie, but they are not going to rook us. That's unacceptable, that was unprofessional. My guys dug in that game and earned the right to be in that game, and they did not even give us a chance.\" Memphis closed within 75-71 early in the fourth quarter, but San Antonio responded with 3-pointers by Parker and Pau Gasol in rebuilding their double-digit lead. The Grizzlies forced seven turnovers while outscoring the Spurs 34-19 in the opening 16 minutes of the second half. Conley, Marc Gasol and Zach Randolph accounted for 21 points. Conley finished with 24 points, Randolph had 18 points and Marc Gasol added 12 points for the Grizzlies. Tony Parker added 15 points for the Spurs, who had three others score in double figures. San Antonio had a better start than in Game 1. Leonard made sure of that. Leonard opened the game by making his first three shots and four free throws as the Spurs built a 13-point lead, the same deficit they faced in the opening period Saturday. Unlike Game 1, there was no coming back from that deficit for Memphis. San Antonio had a 26-point lead in the first half on the strength of its outside shooting. The Spurs only had 12 points in the paint, but got two 3-pointers from Parker and Danny Green, in building a 26-point lead in the first half. TIP-INS Grizzlies: Memphis was 2-0 at home against San Antonio in the regular season, winning by an 11-point average. ... Vince Carter was assessed a technical foul in the first half after attempting to head-butt Kyle Anderson. Carter was upset he nearly fell on the opposite end of the court, believing Anderson had pushed him from behind. ... Randolph had his 21st double-double this season and his first of this postseason after being limited to six points and three rebounds in Game 1. Spurs: LaMarcus Aldridge has scored in double figures in each of his 12 playoff games with the Spurs. He became the fifth player since 2006 to score 1,000 points in his first 46 playoff games, joining Stephen Curry, Kevin Durant, James Harden and Russell Westbrook. ... Danny Green has 162 3-pointers in the postseason, passing Bruce Bowen (161) for second in franchise history behind Manu Ginobili's 309. ... Popovich has 160 postseason victories, which is third in league history behind Phil Jackson (229) and Pat Riley (171). PATIENTLY WAITING Memphis forward Tony Allen remains out with a right calf injury, and Fizdale is still unsure if Allen will return in the opening round. \"I just take it game by game,\" Fizdale said. \"Honestly, I don't want to get too far ahead, get too up or too down when it comes to that situation. I'm just hoping for the best.\" --- More AP NBA: https://apnews.com/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "Leonard's 37 points lead Spurs by Grizzlies 96-82",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/leonards-37-points-lead-spurs-grizzlies-96-82/story?id=46855225"
}