{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 21:57:55+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Judge temporarily halts deportation of Indonesian Christians",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fjudge-temporarily-halts-deportation-indonesian-christians-52815687.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_4ea93f69e91c4c70b41929c4e491460e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A federal judge has temporarily halted deportation proceedings against Indonesian Christians who are in the U.S. illegally but are seeking to gain legal status, including a man honored for his work helping to rebuild more than 200 homes after Superstorm Sandy.\nThe order Friday was issued by U.S. District Judge Esther Salas in Newark in response to a lawsuit filed by the American Civil Liberties Union and applies to Indonesians who have orders of removal dating to before 2009.\nThe order affects roughly 50 people in New Jersey who had identified themselves to Immigration and Customs Enforcement in 2009 as part of a program to obtain work authorization and stays of deportation, according to the ACLU and Seth Kaper-Dale, co-pastor of a church where some of the immigrants sought sanctuary.\nThe lawsuit came after several enforcement actions by immigration authorities in New Jersey that targeted Indonesian Christians and rekindled fears in a community that includes people who left Indonesia years ago to escape religious persecution.\nTwo men were arrested last month after they dropped their children off at school. Harry Pangemanan, who has been in the country since 1993 and lives with his wife and two daughters in central New Jersey, sought sanctuary at the Reformed Church of Highland Park, where he is an elder and where he spent nine months in 2012 under similar circumstances.\nTwo other men, Arthur Jemmy and Yohanes Tasik, already were living there to avoid detention.\nSalas ordered both sides to file briefs over the next month.\nA spokesman for ICE's Newark office didn't immediately return a message seeking comment.\nPangemanan has been staying in a room that doubles as a children's library at the church and had to move his belongings when the library is in use. His family joined him recently after their home was broken into and vandalized after his name was included in news reports.\n\"We are trying to stay strong as a family, take one day at a time,\" he said in an interview with The Associated Press last week. \"You do your best today, do something useful, and tomorrow is in god's hands.\"\nPangemanan came to the country in 1993 on a tourist visa that was to lapse in five years, he said. His wife came in 1998 during a period of turmoil in Indonesia when Christians were being targeted. They cite that as one reason for not going back.\n\"A thousand churches were burned to the ground between 1996 and 2003,\" said Kaper-Dale, of the Highland Park church. \"Some islands are safer than others, but it's too simple to say it's safe now.\"\nPangemanan concedes he didn't know enough about immigration law when he first arrived, and wasn't aware he had one year to apply for asylum. At the time, it didn't seem to matter.\n\"Nobody asked you, as long as you are a good man, you work hard and help your company, and you pay your taxes,\" he said. \"You're working like everybody else, you don't bother anybody. Then everything changed after Sept. 11.\"\nWorking through the church after Sandy devastated the New Jersey coast in 2012, Pangemanan organized more than 2,000 volunteers, matching their skills with the needs of homeowners whose homes had been destroyed. He said he traveled to other areas of the country to perform similar work, including the Carolinas, West Virginia and Texas.\nA system put in place after Sept. 11 required non-citizen men and boys from predominantly Arab or Muslim-majority countries to register and be photographed and fingerprinted.\nPangemanan and Jemmy said they complied, and have repeatedly tried to gain legal status since then, without success.",
    "source_domain": "abcnews.go.com",
    "title": "Judge temporarily halts deportation of Indonesian Christians",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/judge-temporarily-halts-deportation-indonesian-christians-52815687"
}