{
    "authors": [
        "Abc News",
        "Ben Gittleson",
        "More Paul",
        "More Ben"
    ],
    "date_download": "2017-04-17 19:22:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "North Korea vows further missile tests: Report",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fnorth-korea-vows-missile-tests-bbc%2Fstory%3Fid%3D46846018.json",
    "image_url": "http://a.abcnews.com/images/International/ap-nk-1-er-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "North Korea will conduct \"more missile tests on a weekly, monthly and yearly basis,\" a senior official from the country has told BBC News.\nVice Foreign Minister Han Song-Ryol also said that any U.S. military intervention would result in \"all out war.\"\nHan's heated rhetoric on Monday was matched by North Korea's permanent representative to the United Nations, Ambassador Kim In Ryong, who said that \"thermonuclear war may break out at any moment on the [Korean] peninsula and pose a serious threat to the world's peace and security.\"\nThe North Korean officials' comments came hours after U.S. Vice President Mike Pence said that the \"era of strategic patience\" with the North Korean government was over.\n\"President Trump has made it clear that the patience of the United States and our allies in this region has run out and we want to see change. We want to see North Korea abandon its reckless path of the development of nuclear weapons, and also its continual use and testing of ballistic missiles is unacceptable,\" Pence said during a visit to the demilitarized zone that separates North and South Korea.\nPence was speaking in South Korea shortly after a failed North Korean missile test.\nIn recent weeks, U.S. Pacific Command instructed the U.S.S. Carl Vinson naval strike group to head to the region in a show of force meant to deter North Korea from conducting further missile or nuclear tests.\nSpencer Platt/Getty Images\nAmbassador Kim, North Korea's U.N. representative, said that deploying the U.S. strike group to the region was a \"reckless move\" and suggested that the U.S. was focused on invading North Korea.\nExperts, however, cast doubt on claims that open conflict was imminent.\nCol. Steve Ganyard, an ABC News contributor and former State Department official, said that North Korea can not afford weekly tests, but that \"they will keep up appearances until things quiet down.\"\n\"I see no indications of an impending military strike as it would require a lot of diplomatic and military ground work that doesn't seem to be underway,\" Ganyard said.\nRobert Kelly, an associate professor of political science at Pusan University in South Korea, speaking on Sunday night, said that the failed missile test was \"probably the best possible outcome,\" because the North Koreans \"got to say that they made trouble,\" while \"the Americans were sort of let off the hook of having to find some kind of response.\"\nThis is a developing story. Please check back for the latest.\nABC News' Luis Martinez contributed to this report from the Pentagon.",
    "source_domain": "abcnews.go.com",
    "title": "North Korea vows further missile tests: BBC",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/north-korea-vows-missile-tests-bbc/story?id=46846018"
}