{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 22:46:39+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fshort-term-rates-rise-weekly-us-treasury-auction-53860036.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/short-term-rates-rise-weekly-us-treasury-auction-53860036",
    "language": "en",
    "localpath": null,
    "maintext": "Interest rates on short-term Treasury bills rose in Monday's auction to their highest levels since August 2008.\nThe Treasury Department auctioned $51 billion in three-month bills at a discount rate of 1.780 percent, up from 1.670 percent last week. Another $45 billion in six-month bills was auctioned at a discount rate of 1.950 percent, up from 1.850 percent last week.\nThe three-month rate was the highest since those bills averaged 1.850 percent on Aug. 18, 2008. The six-month rate was the highest since those bills averaged 1.980 percent also on Aug. 18, 2008.\nThe discount rates reflect that the bills sell for less than face value. For a $10,000 bill, the three-month price was $9,955.00 while a six-month bill sold for $9,901.42. That would equal an annualized rate of 1.813 percent for the three-month bills and 1.997 percent for the six-month bills.\nSeparately, the Federal Reserve said Monday that the average yield for one-year Treasury bills, a popular index for making changes in adjustable rate mortgages, edged up to 2.08 percent Friday, up from 2.05 percent at the beginning of last week on March 12.",
    "source_domain": "abcnews.go.com",
    "title": "Short-term rates rise at weekly US Treasury auction",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/short-term-rates-rise-weekly-us-treasury-auction-53860036"
}