{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 10:46:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Celebrate Tax Day 2017 with these deals and freebies",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2Fcelebrate-tax-day-2017-deals-freebies%2Fstory%3Fid%3D46838401.json",
    "image_url": "http://a.abcnews.com/images/Business/GTY-IncomeTaxes-jrl-170330_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The deadline for filing taxes has been extended this year to today, April 18, but that doesn't eliminate the stress. To alleviate the pain from meeting this dreaded deadline, some companies are offering deals that everyone can enjoy.\nWhether you are expecting a refund from Uncle Sam or not, Tax Day is now synonymous with deep discounts across the U.S. on products from food to flights.\nCheck out the list below for some fun Tax Day deals and treats.\nTax Day deals: Food and drinks\nBertucci's: Small pizzas will cost just $4.18 at lunch time, and for dinner the Italian restaurant chain offers cheese, margherita or pepperoni pizzas for just $10.40 each.\nBruegger's Bagels: The popular bagel chain is offering a deal it claims is \"better than a refund.\" Customers can buy the big bagel bundle for $10.40 -- a discount of $3.50.\nCapriotti's: The sandwich shop will offer its medium-size sandwiches for the same price as small ones on April, 18.\nFirehouse Subs: Enjoy a free medium sub when you buy a medium or large sub, chips and a drink, valid April, 18 to April, 20.\nThis Tax Day, get a free medium sub when you purchase a medium or large sub, chips and drink. pic.twitter.com/hbCyaTBHwW — Firehouse Subs (@FirehouseSubs) April 14, 2017\nGreat American Cookies: Pick up a free birthday cake cookie on Tax Day -- no purchase necessary.\nHungry Howie's: The famed flavored-crust pizza joint is offering anyone who buys a large one-topping pizza at full price the deal of getting a medium single-topping pizza for only 18 cents. Use the promo code TAXDAY, which is valid for online and carryout purchases April, 17 to April, 19 at participating locations.\nKona Ice: The company is celebrating April 18 with its fourth annual \"Chill Out\" day by offer free shaved ice with the slogan, \"No taxation without relaxation.\"\nSchlotzsky's: Get a free small \"The Original\" sandwich on Tuesday with the purchase of chips and a medium drink.\nWorld of Beer: Enjoy $5 off your check or a free select draught on Tax Day at participating venues, where legal.\nNonfood deals\nJet Blue: If you owe taxes to \"the man\" this year the airline is offering entry to its contest for a free return flight. By clicking \"yes\" on the company's online form, customers will be entered to win one of 1,000 flights. Entries are allowed once per day before April 25. For more rules and discounts, see tje website..\nPlanet Fitness: Relax with a free HydroMassage at participating gyms with coupon available online. Offer is good through April 22.\nNew York Yankees: Fans can snag tickets for $4.18 and $10.40 with offer code TAXDAY when you purchase seats online before April 19.",
    "source_domain": "abcnews.go.com",
    "title": "Celebrate Tax Day 2017 with these deals and freebies",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/celebrate-tax-day-2017-deals-freebies/story?id=46838401"
}