{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 21:27:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "UCF kicker's YouTube profits may be violation of NCAA rules",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fucf-kickers-youtube-profits-violation-ncaa-rules-48043650.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/ucf-kickers-youtube-profits-violation-ncaa-rules-48043650",
    "language": "en",
    "localpath": null,
    "maintext": "A UCF football player may have to choose between continuing to play college football and building his brand on YouTube.\nSophomore kicker Donald De La Haye said in a video he may have to decide whether to remain with the Knights football team or pursue his passion as a YouTube personality after meeting with the school's compliance office last week. He could be violating NCAA rules by receiving money from the advertising revenue off his YouTube videos that chronicle his life as a college student and as a college football player.\nDe La Haye has nearly 56,000 subscribers on YouTube and his latest video detailing his battle to keep his channel going had 113,042 views as of Wednesday afternoon. YouTube pays video creators a percentage of the ad revenue profits.\nDe La Haye, who could not be reached for comment on Wednesday, discussed his dilemma in his most recent YouTube video posted on Monday.\n\"Some people upstairs aren't happy with my videos and they like I'm in violation of NCAA rules and whatnot,\" De La Haye said in the video. \"I don't understand but who am I to say what is in the rulebook and what is not.\"\nThe school released a vague statement Wednesday, leaving it unclear whether De La Haye can continue publishing his videos.\n\"UCF athletics is committed to rules compliance,\" the statement read. \"Our compliance staff strives to make sure our student-athletes are informed about all pertinent NCAA bylaws.\"\nA person with knowledge of the situation said that De La Haye was not told in last week's meeting that he has to discontinue making the video. The person was told the meeting was the first in a series of discussions that the player will have with the compliance office. The person spoke to The Associated Press on condition of anonymity because details of the meeting with De La Haye have not been publicly released.\nThe NCAA referred all comments to UCF, saying that it has not received a waiver from the school in regards to the matter.\nNCAA rules prohibit student-athletes from profiting from their likeness or status as student-athletes because it violates amateur guidelines. NCAA bylaw 12.4.4 regarding self-employment states a student-athlete may establish his or her own business, provided the student-athlete's name, photograph, appearance or athletics reputation are not used to promote the business.\nDe La Haye, a marketing major, said in that video posted Monday that he created the channel as a way to further his career. He went on to say it is means to make a little extra money, money the Costa Rica native said his family needs.\n\"Basically, I'm not allowed to make any money off my YouTube videos,\" he said. \"So I'm working hard — basically like a job filming, editing, creating ideas — and I'm not allowed to make any money. And if I do bad things will happen.\"\nDe La Haye, who seems to have a huge personality in the videos he creates, begins the video discussing his dilemma and an impending meeting with a school compliance worker in between taking bites of a hamburger. With a use of a time lapse element, later in the 10:39 video he discusses the meeting with the compliance worker and he says he is disappointed with the decision he believes he must now make.\n\"I feel like they are making me pick between my passion and what I love to do, make videos, entertain and be creative and my other passion playing football,\" said De La Haye, a kickoff specialist who appeared all 13 of the Knights games last season. \"I've really got some decisions to make and not a lot of time to make those decisions.\"\n———\nMore college football: http://collegefootball.ap.org",
    "source_domain": "abcnews.go.com",
    "title": "UCF kicker's YouTube profits may be violation of NCAA rules",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/ucf-kickers-youtube-profits-violation-ncaa-rules-48043650"
}