{
    "authors": [
        "Abc News",
        "Kateri Jochum",
        "More Ben"
    ],
    "date_download": "2017-08-14 21:17:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "A spokesman for German Chancellor Angela Merkel called the violence in Charlottesville this weekend “absolutely repulsive.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fgermany-responds-charlottesville-violence-sharp-condemnation%2Fstory%3Fid%3D49210521.json",
    "image_url": "http://a.abcnews.com/images/International/nazi-flag-charlottesville-protest-rd-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The violence in Charlottesville this weekend was “absolutely repulsive,” a spokesman for German Chancellor Angela Merkel said today, as other German politicians condemned the neo-Nazi sympathies on display in the Virginia city and President Donald Trump’s response.\n\"The scenes at the right-wing extremist march were absolutely repulsive – the racism, anti-Semitism and hate on display were in their most naked and evil form,\" the spokesman, Steffen Seibert, said, according to a statement from the German chancellor’s office. He said what happened there was “diametrically opposed to the political goals of the chancellor and the entire German government.\"\nThe entire German government “stands in solidarity with those who peacefully stand up to aggressive, right-extremist positions,” Seibert said. He added that Merkel’s “thoughts are with the family and friends of the woman who died as well as with the other victims, who we hope will completely recover.”\nSeveral leading politicians condemned the violence, and a couple called out President Trump for not immediately condemning the neo-Nazis, Ku Klux Klan members and other white nationalists who marched and clashed with counterprotesters in Charlottesville on Friday and Saturday.\n“What happened in the U.S. is Nazi terror, that’s the only way to describe it and to call it,” Martin Schulz, the head of the Social Democratic Party and a candidate for chancellor, said today. “It’s shocking that the president of the United States of America has remained silent about this kind of terror, or makes comments that would allow those who committed these acts of violence there to feel encouraged.”\nAnother member of Schulz’s party, German Ministry of Justice Heiko Maas, echoed that criticism.\n“His half-hearted dithering on the right-wing extremist violence is fatal,” Maas tweeted. “All democrats should find unambiguous words to stand up against racism. Those who can't demonstrate a definitive stand must reckon with the fact that they are empowering neo-Nazis.”\nTrump on Saturday blamed “many sides” for the violence, which killed one woman and injured at least 19 others. Today, after two days of criticism for his failure to call out white nationalists by name, he specifically denounced “the KKK, neo-Nazis, white supremacists and other hate groups that are repugnant to everything we hold dear as Americans.”\nGermany has strict laws against displaying Nazi symbols and slogans. Even suggesting support for Nazi ideas is taboo.\nAnti-immigrant sentiment in the country, however, has led to the rise of the right-wing, populist Alternative für Deutschland Party. But support for the party has reportedly slipped in recent months, after an AfD politician criticized Germany’s tradition of taking responsibility for the Holocaust and other crimes of the Nazi era.",
    "source_domain": "abcnews.go.com",
    "title": "Germany responds to Charlottesville violence with sharp condemnation",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/germany-responds-charlottesville-violence-sharp-condemnation/story?id=49210521"
}