{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 15:34:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Police try out new database for documenting opioid overdoses",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fpolice-database-documenting-opioid-overdoses-49206409.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/police-database-documenting-opioid-overdoses-49206409",
    "language": "en",
    "localpath": null,
    "maintext": "Police in Massachusetts are testing a new database for documenting opioid overdoses they hope will help departments share information in real time and get people into treatment.\nThe database was developed by criminal justice experts Sean Varano at Roger Williams University in Rhode Island, and Pam Kelley with Kelley Research Associates in Massachusetts.\nIt's an innovative approach, Varano said, because agencies typically rely on older public health data about fatal overdoses and don't know the prevalence of nonfatal overdoses and because it gives them a quick way to communicate about that data.\n\"This is really a death prevention project,\" Varano said. \"That sounds like hyperbole, but when someone overdoses today and they're not in treatment, their chances of dying in the next month are exponentially greater. So how do we understand that and play a role so they don't die?\"\nIt works like this: When a department is called to an overdose, it's recorded in the system. The system then alerts the department to do a follow-up outreach visit. If the victim is from a neighboring community, that police department is notified.\nThe 27 police departments in Plymouth County, Massachusetts, are using it. They have all agreed that within 24 hours of a nonfatal overdose, a non-uniformed officer and recovery coach will go to the person's house to discuss treatment and offer resources to their family.\n\"We know people suffering from the crisis don't just overdose in their town,\" said East Bridgewater Police Chief Scott Allen. \"And if we're not sharing that information in real time, we're missing opportunities to get people into treatment.\"\nGiven the skyrocketing number of overdoses, Allen said the departments had no choice but to figure out what they could do to help people. He stressed that the visits serve to offer people access to treatment and services they may not know about, and they won't be prosecuted for possession because of the state's Good Samaritan law.\nMore than 1,000 people have overdosed in the county so far this year, Allen added. He said he's looking at the data for increases because that could indicate that more people are using fentanyl, a powerful synthetic opioid.\nAllen is also speaking with police departments in other parts of the country interested in the new database. Allen and Plymouth Police Chief Michael Botieri brought police chiefs together to implement the system in their county.\nPresident Donald Trump said last week that he will officially declare the opioid crisis a \"national emergency,\" and he pledged to ramp up government efforts to combat the epidemic.\nMore than 33,000 people died from drug overdoses involving opioids nationwide in 2015, and preliminary data for the first three quarters of 2016 indicate that the drug overdose death rate is still increasing, according to the White House Office of National Drug Control Policy.",
    "source_domain": "abcnews.go.com",
    "title": "Police try out new database for documenting opioid overdoses",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/police-database-documenting-opioid-overdoses-49206409"
}