{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:49:03+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Trump said that no concessions have been made during negotiations with North Korea, that he still wants troops out of Syria and that he still hates the Iran nuclear deal.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrump-talks-north-korea-denuclearization-syria-troop-withdrawal-54699029.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_vod_orig_trump_macron_press_conference_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump talks North Korea denuclearization, Syria troop withdrawal, Iran nuclear deal\nMeetings are being set up. And I wanted to see. Of North Korea a lot of concessions have already been made we have made no concessions despite some of the media saying that I've made concessions I don't I haven't even discussed a concession. Other than the fact that meeting is a great thing. And I'm sure that. A lot of other people would have liked to have had the position we're having. I will say this would put the strongest sanctions on a country that we ever have put on any country by far it means they get rid of the nukes. Very simple they get rid of their nukes and nobody else would say. Be very easy for me to make a simple deal and claimed victory I don't wanna do that I want them to get Greta the next the end result is we'll see. May be good things will happen in May be were all wasting a lot of time. But hopefully it'll be good for everybody concerned. As far as Syria is concerned. I would love to get out I'd love to bring our. Incredible warriors back home they've done a great job we've essentially. Just absolutely obliterated crisis in Iraq. And in Syria. And we've done a big favor to neighboring countries frankly but we've also done a favor for our country. Would that being said. Emmanuel and myself have discussed. The fact that we don't want to give Iran. Open season to the Mediterranean. Especially since we really control it to a large extent we really have controlled it and we've set control on it. So we'll see what happens but we're going to be coming home. Relatively soon we finished. At least almost our work with respect to crisis in Syria nicest in Iraq. And we have done a job that nobody has been able to do. But what that being said I do wanna come home but I wanna come home also. With. Having accomplished what we have to accomplish so we are discussing Syria as part of and over real deal so we want to come home. World becoming home. But we want to have a very very strong we want to leave a strong and lasting footprint and that was a very big part of our discussion we will in fact. Wearing lots of people home. We will have. A strong blockage to the Mediterranean which to me is very important. Because if we don't you have around going right. To the Mediterranean. Gonna have that. But there is a chance and nobody knows what I'm going to do. On the twelfth. Although Mr. President you have a pretty good idea. But we'll see but we'll see also. If I do what some people expect. Whether or not it will be possible to do. A new deal with solid foundations because this is a deal with decayed foundations it's a bad deal. To bad structure. It's falling down should have never ever. Been made. Blame. Congress blame. A lot of people for. But it should have never been made. And we're to see what happens on the twelfth but I will say if Iran threatens us in anyway. They will pay a price like few countries have ever paid.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump talks North Korea denuclearization, Syria troop withdrawal and Iran nuclear deal Video",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trump-talks-north-korea-denuclearization-syria-troop-withdrawal-54699029"
}