{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 22:44:42+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Waiting for Congress, Mnuchin makes 2nd emergency debt move",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fwaiting-congress-mnuchin-makes-2nd-emergency-debt-move-51725610.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/waiting-congress-mnuchin-makes-2nd-emergency-debt-move-51725610",
    "language": "en",
    "localpath": null,
    "maintext": "Treasury Secretary Steven Mnuchin said Monday he is making a second emergency move to keep the government from going above the debt limit while awaiting congressional action to raise the threshold.\nIn a letter to congressional leaders, Mnuchin said he will not be able to fully invest in a large civil service retirement and disability fund. Skipped investments will be restored once the debt limit has been raised, he said.\nIn September, Congress agreed to suspend the debt limit, allowing the government to borrow as much as it needed. But that suspension ended Friday.\nThe government said the debt subject to limit stood at $20.46 trillion on Friday. Mnuchin has said he will employ various \"extraordinary measures\" to buy time until Congress raises the limit.\nThe Congressional Budget Office estimated in a recent report that Mnuchin has enough maneuvering room to stay under the limit until late March or early April.\nIf Congress has not acted before Mnuchin has exhausted his bookkeeping maneuvers, the government would be unable to borrow the money it needs to meet its day-to-day obligations, including sending out Social Security and other benefit checks and making interest payments on the national debt.\nIn August 2011, a standoff between Congress and the Obama administration over raising the borrowing limit came down to the wire and prompted the Standard & Poor's credit rating agency to impose the first-ever downgrade of the government's credit rating.\nRaising the debt limit is a separate issue from the need for Congress to pass a spending bill to cover government operations. A failure to pass a spending bill triggers a partial government shutdown but does not carry the potential catastrophic market disruptions that a failure to raise the debt limit poses.\nIn his new letter, Mnuchin said, \"I respectfully urge Congress to protect the full faith and credit of the United States by acting to increase the statutory debt limit as soon as possible.\"",
    "source_domain": "abcnews.go.com",
    "title": "Waiting for Congress, Mnuchin makes 2nd emergency debt move",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/waiting-congress-mnuchin-makes-2nd-emergency-debt-move-51725610"
}