{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:39+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fitaly-seizes-spanish-rescue-boat-defied-libyan-threats-53846718.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_e18feaa93fc84cccb508e70390da4de1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The head of a Spanish aid group said Monday he fears that human trafficking charges may be brought against his staff after they refused to hand over rescued migrants to the Libyan coast guard during a tense high-seas standoff and then took them to Italy.\nProactiva Open Arms founder and director Oscar Camps told reporters in Barcelona, Spain, that Italy has impounded his organization's rescue boat Open Arms and he is worried the ship might not be returned.\n\"This is no joke,\" Camps said. His organization is based in Barcelona.\nThe case comes amid strong reluctance in Italy to take in any more migrants who human traffickers launch in unseaworthy boats from Libya and other North African shores. International efforts have been increasingly aimed at stemming the migrant flow across the Mediterranean.\nThe rescue vessel was sequestered by Italy on Sunday in the Sicilian port of Pozzallo, a day after it docked and the rescued migrants came ashore.\nItalian authorities say they are investigating the rescue group for suspected criminal association and aiding illegal immigration.\nProactiva said the investigation stems from the group's refusal Thursday to hand over to Libya's coast guard 218 migrants it had just saved in international waters 70 nautical miles from the Libyan coast.\nCamps said as the Libyan coast guard approached, some migrants panicked and began screaming and jumped from their boat into the sea. The Libyan coast guard was \"very aggressive\" toward the Open Arms crew, Camps said, adding that his organization had \"a legal duty\" to save the migrants in the sea.\nAnabel Montes, speaking by videoconference from the impounded Open Arms vessel in Italy, said the armed Libyan coast guard issued death threats to the aid workers.\n\"We had never reached such an extreme situation like this one in which they were threatening us, saying that they were going to kill us,\" she said.\nShe and the Open Arms' captain are under investigation by the Italian prosecutors. A third person, who hasn't been identified, is also being investigated.\nThe aid group spent three hours negotiating with the Libyans, Camps said. In the meantime, a vessel sent by Maltese authorities evacuated a critically ill 3-month-old baby and its mother.\nCamps said the crew contacted the Spanish and Italian navies but got no help from them.\nOn Friday evening, the Italian coast guard said it gave the Spanish boat permission to dock in Pozzallo, given the poor condition of the migrants and the worsening weather at sea.\nOf the vessel's 19 crew members, three are remaining in Italy to testify and the rest are heading back to Spain, Camps said.\nTrying to stem the flow of migrants toward its shores, Italy has supplied Libya with patrol boats and training. Critics say the plan enriches the unreliable Libyan coast guard and sends vulnerable migrants back into slave-like conditions in Libya.\nItaly, whose efforts have been backed by the European Union, says it is working with U.N. authorities to ensure humane conditions in Libya for the migrants, many of whom are kept as virtual prisoners, and who cite inadequate food, unsanitary living conditions, sexual assault, beatings and other forms of torture while awaiting the chance to be smuggled out by boat.\nIn Brussels, EU Commission spokeswoman Natasha Bertaud told reporters: \"We welcome the fact that the boat was able to be unloaded on Friday and that the migrants aboard received the treatment that they needed.\"\n\"We are entirely aware that an Italian code of conduct exists aimed exactly at avoiding this kind of situation, and we call on all parties in the future to respect not just international law but also this Italian code of conduct,\" she said.\nItaly last year demanded that NGOs which operate rescue vessels sign on a code of conduct, but some humanitarian organizations declined to do so. Among their objections was a provision that would allow armed police on board rescue vessels.\nA few others, including Proactiva Open Arms, did sign on and continued to operate migrant rescue missions at sea.\nSome aid groups had decided to suspend Mediterranean rescue missions because of what they described as an increase in hostility from the Italian-backed Libyan coast guard, including incidents in which the Libyans fired upon rescue boats.\nThe Italian government is coming under increasing public pressure at home to solve the migrant crisis, especially since EU partners have refused to take any significant number of migrants off Italy's hands.\nIn Italy's parliamentary election this month, the biggest voter-getters were political forces that railed against the government's handling of the migrant crisis, including the populist 5-Star Movement, which campaigned by saying Italy should not remain \"the refugee camp of Europe.\"\n———\nHatton reported from Lisbon. Lorne Cook contributed from Brussels.",
    "source_domain": "abcnews.go.com",
    "title": "Spanish aid group fears migrant trafficking charges in Italy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/italy-seizes-spanish-rescue-boat-defied-libyan-threats-53846718"
}