{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:45:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Those who want to expose the dire health care situation are afraid to speak and the government sees the press reporting on it as the enemy.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Finside-venezuelas-repressive-regime-part-45502623.json",
    "image_url": "http://a.abcnews.com/images/Nightline/170215_ntl_venezuela_2_1255_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Inside Venezuela's Repressive Regime: Part 2\nWe drove through the mountains from Caracas to Valencia to meet a doctor here determined to show us the horrors that lay inside a hospital controlled by the iron fist of the government. If you take us in, it will be easier for us to get in than if we drive? Yes. He and his fellow doctors earnestly and deeply want to get the word out how bad the situation is. He doesn't want his face or name shown. But he's determined to show us what is going on inside the main hospital for this city of 2 million people. Right here you can see dozens people outside. And a lot of trash has built up. More patients being brought in. We follow him into the pediatric ward. Hospitals provide two things. They provide the bed and the doctor. Everything else has to be provided by the patient or their family. And that's what's so incredible. Down to the surgical gowns the doctors wear, and even soap to scrub in. And then we saw these children. It was already 11:00 at night and all of them were moaning. Writhing in their beds. Nurses were just standing there. There was nothing they could do. All of these children waiting for medication and additional testing. A little boy called janaico. He's been there over six weeks. It was just heartbreaking. Little malie has been suffering convulsions for months. Her family had to provide everything. She's been here six weeks and that is very expensive. As we're trying to leave, somebody pointed us out. They said, those guys are filming. Another guard closed the door to make sure that nobody left. They demanded our go pro, iPhone, and started asking us what we were doing. We said we were doing a story about the suffering of children. Reporting is not a crime in Venezuela, but they can make it a crime. That's what they did. After they found my Mike pack, they handcuffed us. That's when I realized that we're not going home. I was ordered onto the back of a pickup and they drove me through these darkened streets to the police station. They demand that I open the phone. I say, I'm not going to do it unless I get to call the embassy or ABC news. And then a guy comes in with a dip stick. Just kind of tapping it against his hand. I'm thinking, in the middle of the night what is an officer doing here with a dip stick? And then it dawns on me that this is intimidation. What followed were hours of questioning. The police denying me a phone call and representation. After browbeating me, intimidating me, suddenly the two started to chaunch. Change. I was made to understand what they really wanted was a bribe. But then I'm told Venezuela's dreaded secret police, the sebin, would have to be alerted. It was very scary and we took it very seriously. Because -- they are the most notorious agency in Venezuela. You think of the sebin, you think the stasi, the kgb. One of the things we underestimate is the degree to which Venezuela as a government views the U.S. As their enemy. It's a cold war where they are concerned and they see U.S. Spying in every corner. They asked, are you CIA? For the next three days, they questioned me. Asked me to open my phone and trolled my social media history. I was never harmed, but -- I was dungeon. It was always a constant reminder of where we could be sent if we fell afoul of these agents. On the fifth night, I was released. I left with only the clothes on my back. Our Our thanks to Matt Gutman and his team for their extraordinaryrting and\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Inside Venezuela's Repressive Regime: Part 2",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/inside-venezuelas-repressive-regime-part-45502623"
}