{
    "authors": [
        "Abc News",
        "More Calvin"
    ],
    "date_download": "2018-02-02 22:28:00+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Super Bowl shines red glare on the often-mangled 'Star-Spangled Banner'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fsuper-bowl-shines-red-glare-mangled-star-spangled%2Fstory%3Fid%3D52800672.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/national-anthem-whitney-hosuton-01-as-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Herbert Hoover must be spinning in his grave from the havoc he wreaked by signing a congressional act 87 years ago making “The Star-Spangled Banner” the official national anthem of the United States.\nDespite the now generally flawless Super Bowl renditions, Hoover gave license to crooners and wailers alike to have their way with the song, as comedian Roseanne Barr once undid. It has been thoroughly butchered enough times over the years to raise questions about the sanity of all but those blessed with the truest voices and sharpest memories, like the late Whitney Houston, who dare risk the public shame and humiliation.\nBut that hasn’t stopped them, and even the most accomplished of performers like Steven Tyler have fallen painfully short (see other videos below).\nPlay\nMangled lyrics and cracked voices aside, \"The Star-Spangled Banner” -- written in Baltimore Sept. 14, 1814, as poem “Defense of Fort M'Henry,” by lawyer Francis Scott Key -- has been the national anthem since March 3, 1931.\nThat’s more than enough time, unintentionally or otherwise, to trample all over its majesty. Here are other examples:\n(And please let us know if we’ve missed any.)\nPlay\nPlay\nPlay\nPlay\nPlay",
    "source_domain": "abcnews.go.com",
    "title": "Super Bowl shines red glare on the often-mangled 'Star-Spangled Banner'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/super-bowl-shines-red-glare-mangled-star-spangled/story?id=52800672"
}