{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 19:26:12+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fcraig-kimbrel-infant-daughters-heart-surgery-toughest-thing%2Fstory%3Fid%3D53856066.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0319/dm_180319_NBA_CAVS_WOJ_ON_LUE/dm_180319_NBA_CAVS_WOJ_ON_LUE_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With his infant daughter's condition improving following heart surgery, Craig Kimbrel rejoined the Boston Red Sox on Monday, threw live batting practice and declared he will be ready for Opening Day next week.\n\"There's no denying it's been the toughest thing we've ever been through,\" Kimbrel said in a news conference at the team's spring training facility. \"In the last week, her recovery has been unbelievable, and she's showing great signs.\"\nKimbrel's daughter, Lydia Joy, was born in November with a heart condition. Three weeks ago, the All-Star closer left the Red Sox with the team's permission to be with Lydia for the second of three surgeries at Boston Children's Hospital. While he was away, teammates wore red T-shirts with the slogan #LydiaStrong as a show of support for the Kimbrels.\nLydia is expected to be released from the hospital within a few weeks, according to Kimbrel. The third surgery won't take place until she's 3 or 4 years old to \"straighten up her anatomy so she can grow as a normal child,\" he said.\nIn an emotional news conference, Kimbrel expressed his gratitude to the medical staff at Boston Children's Hospital, in addition to the Red Sox for allowing him to leave camp. Kimbrel, a free agent after this season, also noted that he feels fortunate to have access to the medical care in Boston.\n\"My wife and I talk about it all the time,\" he said. \"We're very strong in our faith. We believe that everything in life happens for a reason, even if we don't understand it at the time.\"\nAlthough Kimbrel spent most of the past few weeks at the hospital, he was able to steal a few hours each day to work out and throw, usually at nearby Babson College. A few days ago, he threw live batting practice, after Babson coach Matt Noone arranged for hitters to stand in.\n\"My family comes first and then baseball comes,\" Kimbrel said. \"Stepping away for a few hours was definitely a release. It did help to get in the weight room. It did help to throw the ball. But that's not going to take away the emotions we went through in the hospital.\n\"She's in a good, comfortable place for me to be down here. If she wasn't, I wouldn't be here.\"",
    "source_domain": "abcnews.go.com",
    "title": "Craig Kimbrel: Infant daughter's heart surgery 'toughest thing' his family has been through",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/craig-kimbrel-infant-daughters-heart-surgery-toughest-thing/story?id=53856066"
}