{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 04:55:19+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fchinas-xi-strikes-nationalistic-tone-parliament-address-53864137.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_c4dcf748ea884bb298449e0be477b87c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Chinese President Xi Jinping struck a strongly nationalistic tone in his closing address Tuesday to the annual session of the ceremonial parliament, saying China would never allow \"one inch\" of territory to be separated from it.\nSpeaking before the nearly 3,000 members of the National People's Congress who had earlier abolished term limits on his rule, Xi declared that the Chinese people were now \"closer now than at any time in history to realizing the great rejuvenation of the Chinese nation.\n\"Maintaining national sovereignty, territorial integrity and complete unification of the motherland is the common aspiration of all Chinese,\" Xi said.\n\"In the face of national righteousness and the tide of history, all attempts or tricks aimed at dividing the motherland are doomed to failure,\" Xi said to loud applause. \"All will receive the condemnation of the people and the punishment of history.\"\nThe Chinese people have the will and ability to \"foil all activities to divide the nation\" and are united in their belief that \"every inch of our great motherland absolutely cannot and absolutely will not be separated from China,\" Xi said.\nReferring to self-governing Taiwan, Xi said the mainland would continue outreach to advance the cause of \"peaceful unification\" with the island, whose 23 million residents are strongly in favor of maintaining their de-facto independent status.\nThe session had earlier approved a range of new appointments, including that of key Xi ally Wang Qishan as vice president. New ministers were also appointed and a law passed establishing a powerful new anti-corruption body to oversee the civil service.\nXi also invoked China's historical achievements in governance and culture and stressed the importance of national unity as it strove to reach new goals in poverty alleviation and economic development in coming years.\nHe stressed the absolute leadership of the ruling Communist Party — of which he is head — in all aspects of Chinese life, including over the 2 million-member armed forces.\nXi pledged to would lead China's 1.3 billion people into a brighter future based on its own socialist system, saying, \"As long as we sincerely unite and work together, there will be no power that can stop the Chinese people from realizing their dreams!\"\nXi pledged to expand the Belt and Road, his signature foreign policy initiative of building ports, bridges and railways connecting Europe with Asia — but in an apparent response to the project's critics, said China wasn't seeking hegemony.\n\"China's development does not pose a threat to any country,\" he said.\n\"Only those who habitually threaten others will look at everyone else as threats,\" Xi added.\nThis year's session has been dominated by the rubber-stamp body's historic move on March 11 to scrap a constitutional two-term limit on the presidency dating from 1982, enabling Xi, already China's most powerful leader in decades, to rule indefinitely.\nWhile delegates overwhelmingly supported the move, critics and some analysts say it raises concerns about a return to one-man-rule — and greater political repression within an already highly controlled polity.\n\"There is a distinct danger now that there may well be a return to the Maoist style of leadership symbolized by the dissolution of collective responsibility and the concentration of power under one person,\" said Joseph Cheng, a long-time observer of Chinese politics now retired from the City University of Hong Kong.\nThe broad strokes of what Xi plans to do with these expanded powers were laid down over the weekend as he moved to appoint his trusted allies into key positions that appear, in part, set to further sideline Li, officially China's No. 2 leader.\nOne of them is Wang, reportedly an early acquaintance of Xi's and former anti-corruption czar who is expected to play a key role in managing trade tensions with the United States. The vice presidency is normally a ceremonial post but Wang's real standing can be seen in official events in which he is seated in eighth place in hierarchical order after the seven-man, all-powerful Politburo Standing Committee.\nAnother is longtime Xi adviser Liu He, who was appointed as one of four vice premiers and is expected to oversee a broad range of economic and financial issues.\nChief among Xi's priorities is controlling financial risk without derailing the economy. Regulators have been warning about ballooning debt that caused international ratings agencies to cut China's credit rating last year.\n\"He knows that if there's a financial crisis it will damage his credibility and legitimacy very much because he has no one else to blame,\" Cheng said. \"People will blame him.\"",
    "source_domain": "abcnews.go.com",
    "title": "China's Xi strikes nationalistic tone in parliament address",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/chinas-xi-strikes-nationalistic-tone-parliament-address-53864137"
}