{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 15:53:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "US factory output rose in January for 2nd straight month",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-factory-output-rose-january-2nd-straight-month-45508056.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/us-factory-output-rose-january-2nd-straight-month-45508056",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. manufacturers cranked out more steel, machinery and electronics last month as factories appear to be rebounding after two years of stagnation.\nFactory output rose 0.2 percent in January, its second straight increase, the Federal Reserve said Wednesday . While modest, the gain is equal to the industry's growth in all of 2016.\nManufacturers are benefiting from increased spending by businesses on industrial machinery and other equipment. Oil and gas drillers are building new rigs now that energy prices have stabilized after falling sharply two years ago. Cutbacks by drillers had caused orders for steel pipe and other drilling equipment to plummet. And weak overseas economies in Europe and China also cut into exports.\nYet those trends have largely reversed. Mining production rose 2.8 percent last month, pushed higher by a solid gain in oil and gas drilling.\nUtility production fell 5.7 percent last month, as unseasonably warm weather reduced demand for heating. A broader measure of industrial production, which includes manufacturing, mining and utilities, dropped 0.3 percent.\nOther measures of manufacturing output show steady improvement. Factories expanded at the fastest pace in more than two years last month, according to a private survey of purchasing managers. That survey also found that factories are hiring more.\nAnd a separate gauge of new orders for U.S. factory goods rose in December at a solid pace, lifted by greater business spending on big-ticket items such as machinery and computers.\nA strong dollar has weighed on exports because it makes U.S. goods more expensive overseas, though manufacturers appear to be adjusting to the currency's strength.",
    "source_domain": "abcnews.go.com",
    "title": "US factory output rose in January for 2nd straight month",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-factory-output-rose-january-2nd-straight-month-45508056"
}