{
    "authors": [
        "Abc News",
        "More Blair"
    ],
    "date_download": "2017-04-18 04:43:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "A horse trapped in a mud pit was freed thanks to some Florida firefighters.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fflorida-firefighters-rescue-horse-trapped-mud-pit%2Fstory%3Fid%3D46847201.json",
    "image_url": "http://a.abcnews.com/images/US/ht-horse-mud02-hb-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A horse that was trapped in a mud pit in southeastern Florida has been freed, thanks to some diligent firefighters.\nPalm Beach County firefighters received a call early Monday morning about a horse stuck in the mud in The Acreage, Florida, an unincorporated area near West Palm Beach. When they first arrived on the scene, firefighters found the horse stuck in the mud up to its belly.\n#BreakingNews @PBCFR on location of horse stuck in mud in #acreage #specialoperations & Battalion 2 crews working on freeing horse pic.twitter.com/IQk1zyl9Ut — PBC Fire Rescue (@PBCFR) April 17, 2017\n\"Firefighters ... started working on digging the horse from the mud using hand tools and keeping the scared horse calm during the rescue,\" Captain Albert Borroto, public information officer with the Palm Beach County Fire Rescue, told ABC News.\nAccording to firefighters, a local veterinarian sedated the horse in order to get it out safely.\nHorse Cmd *update* straps are around horse, #firefighters preparing to start pulling horse from mud pic.twitter.com/LvX0p7glue — PBC Fire Rescue (@PBCFR) April 17, 2017\n\"Using training learned in equestrian rescue classes, the crews were able to get the rescue straps around the animal and prepare to pull it from the mud with a pulley system,\" Borroto said.\nHorse Cmd *update2* Vet on location has sedated horse, #firefighters pulling horse from mud pic.twitter.com/eKjWGDpYIx — PBC Fire Rescue (@PBCFR) April 17, 2017\nIt took about an hour to get the horse out.\n\"The 25-year-old horse named Skip was evaluated by the veterinarian and is doing well,\" Borroto said.\nHorse Cmd*update3* horse safely out of mud, sedation has worn off and he is being evaluated by veterinarian on location pic.twitter.com/YaVXz9ubNn — PBC Fire Rescue (@PBCFR) April 17, 2017\nAuthorities have not released how the horse became stuck in the mud or if it has been claimed by someone in the area.",
    "source_domain": "abcnews.go.com",
    "title": "Florida firefighters rescue horse trapped in mud pit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/florida-firefighters-rescue-horse-trapped-mud-pit/story?id=46847201"
}