{
    "authors": [
        "Abc News",
        "More Samson"
    ],
    "date_download": "2018-03-19 20:57:20+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The BBC fired back, claiming McEnroe has a completely different role.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Fmartina-navratilova-john-mcenroe-paid-10-times-wimbledon%2Fstory%3Fid%3D53853790.json",
    "image_url": "https://s.abcnews.com/images/International/martina-navratilova-ap-jt-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Eighteen-time grand slam champion Martina Navratilova has criticized the BBC for paying John McEnroe at least 10 times more than her during its coverage of the Wimbledon championship.\nDuring an interview for a TV program investigating gender pay discrepancy within the United Kingdom, Navratilova revealed that she was “shocked” and “not happy” to learn that McEnroe was being paid between $210,000 and $280,000 while she earned just $21,000.\nMatthew Stockman/Getty Images, FILE\nThe BBC said in a statement that the relative pay packets reflected completely different roles, adding that McEnroe and Navratilova are “simply not comparable,” and that “gender isn’t a factor” in their pay.\nThe BBC added that “along with Sue Barker,” McEnroe is “the face of our Wimbledon coverage” and said his contract is far more all-encompassing than that of Navratilova, who is an occasional contributor “contracted to carry out a fixed volume of work and paid per appearance.”\nIn contrast, McEnroe is expected to be on call for the duration of the tournament, was on air every day and was a commentator on live matches “12 of the 13 days,” in addition to having a whole host of TV, radio and press duties, the BBC said. Navratilova commentated on three live matches over the tournament, as well as “four highlights appearances, one short video and two other short studio appearances.”\nKevin Lamarque/Reuters, FILE\nWhen questioned in the interview over the BBC’s likely response that McEnroe did more work than her, Navratilova replied “10 times as much? I don’t think so.”\nBut the BBC statement said McEnroe has contractual obligations that extend beyond his time on screen, including the stipulation that he not work with any other U.K. broadcaster without the express permission of the BBC.\nSue Barker, whom the BBC named as the “face of Wimbledon” alongside McEnroe, earns between $420,000 and $490,000. However, she works throughout the year on various TV productions, whereas McEnroe is only contracted during the Wimbledon fortnight, the BBC said.\nThe BBC has been mired in controversy over its pay discrepancies ever since it published the earnings figures of its top-earning (over $210,000) on air stars.\nOnly a third were women, and the top seven were all male.",
    "source_domain": "abcnews.go.com",
    "title": "Martina Navratilova says John McEnroe was paid 10 times as much for Wimbledon commentary",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/martina-navratilova-john-mcenroe-paid-10-times-wimbledon/story?id=53853790"
}