{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 07:20:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Australian inquiry: Priests should report abuse confessions",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Faustralian-inquiry-priests-report-abuse-confessions-49199891.json",
    "image_url": "http://abcnews.go.com/International/wireStory/australian-inquiry-priests-report-abuse-confessions-49199891",
    "language": "en",
    "localpath": null,
    "maintext": "Priests who fail to tell police about suspected child sexual abuse should face criminal charges, even when they learn of abuse during a confidential religious confession, Australia's most powerful investigative authority recommended on Monday.\nAustralia's Royal Commission into Institutional Responses to Child Sexual Abuse — the nation's highest form of inquiry — recommended that all states and territories in Australia introduce legislation that would make it a criminal offense for people to fail to report child sexual abuse in an institutional setting. Clergy who find out about sexual abuse during a religious confession would not be exempt from the law.\n\"The right to practice one's religious beliefs must accommodate civil society's obligation to provide for the safety of all and, in particular, children's safety from sexual abuse,\" the commission wrote in a report released Monday. \"Institutions directed to caring for and providing services for children, including religious institutions, must provide an environment where children are safe from sexual abuse. Reporting information relevant to child sexual abuse to the police is critical to ensuring the safety of children.\"\nCurrent laws on reporting knowledge of crimes vary across Australia. In some jurisdictions, information received during religious confessions — which are considered highly confidential by churches — is considered privileged, and thus exempt from mandatory reporting requirements.\nThe royal commission has been investigating since 2013 how churches and other institutions responded to the sexual abuse of children in Australia over the last several decades. The reporting requirement it urged Australia to adopt was one of 85 recommendations it made in a report aimed at revamping the criminal justice system to ensure fairer treatment of victims of child sexual abuse.\nThe reporting mandate would apply to people who failed to tell police that they knew, suspected or even should have suspected that an adult associated with their institution was sexually abusing a child.\nIf such a law was actually imposed in Australia, priests would ostensibly have to choose between following criminal law or canon law, which forbids them from revealing anything they hear during confession.\nIn its report, the commission acknowledged the significance placed upon the confidentiality of religious confessions, particularly by the Catholic Church. But the commission also said it had learned of cases in which abusers had confessed to clergy that they had sexually assaulted children and then went on to reoffend, before seeking forgiveness yet again.\nThe issue of whether religious confessions should be considered privileged has long plagued governments and courts across the world.\nIn the United States, the Louisiana state Supreme Court ruled last year that state law does not require a priest to notify authorities after hearing evidence of child abuse from a child making a confession. That ruling came amid a lawsuit against Catholic authorities by parents who say their daughter was sexually abused by a parishioner at a local church.\nIreland introduced legislation in 2012 that made it a legal requirement to report knowledge of crimes against children, and made no exemption for priests who received information about crimes during confession. How that law has been applied since then, though, is unclear; Australia's royal commission noted in its report that the issue has yet to be tested in Ireland's courts.\nCathy Kezelman, president of the Australian victims' advocacy group, Blue Knot Foundation, applauded the commission's recommendations.\n\"The recommendation around religious confession is most welcome, as although Blue Knot Foundation respects the right of all religions to practice their religion, children must be protected from the insidious crime of child sexual abuse,\" Kezelman said in a statement. \"There should be no exemption in that regard, the confessional included.\"",
    "source_domain": "abcnews.go.com",
    "title": "Australian inquiry: Priests should report abuse confessions",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/australian-inquiry-priests-report-abuse-confessions-49199891"
}