{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 04:14:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Another Republican, Rep. Jason Chaffetz, chair of the House Oversight Committee, is coming under scrutiny for not investigating Flynn's talks with Russia.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Frepublican-sen-john-mccain-trump-administration-significant-disarray-45499496.json",
    "image_url": "http://a.abcnews.com/images/WNT/170214_wn_bruce_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Republican Sen. John McCain says the Trump administration is in 'significant disarray'\nYou can imagine the reaction pouring in from Democrats and Republicans. Republican senator John McCain saying this is an administration in significant disarray. ABC's Mary Bruce tonight. Reporter: Amid growing question about the trump team's ties to Russia, from senate Republicans tonight, deep concern. Obviously there's an administration that's in significant disarray as far as national security is concerned. Reporter: Top Republicans like senate majority leader Mitch Mcconnell say it's, quote, highly likely, the senate will investigate Michael Flynn's conversations with Russian officials. Will you call on Flynn to testify? We won't exclude that. Reporter: But some Republicans are more reluctant. That seems to have resolved itself with the white house taking some decisive action. Reporter: Congressman Jason Chaffetz, the chair of the house oversight committee, vigorously led the investigation into Hillary Clinton's e-mails, but says he has no plans to investigate Flynn's ties to Russia. We've been asking for months for basic oversight. Our chairman Jason Chaffetz has not lifted one finger. Reporter: Chaffetz is, however, investigating whether white house counselor kellyanne Conway crossed a line by promoting Ivanka Trump's brand on television. She is just -- it's a wonderful line. I own some of it. I'm going to give a free commercial here. Go buy it online! Reporter: Today, the office of government ethics said there is \"Strong reason to believe\" Conway violated ethics rules and recommended \"Disciplinary action against her.\" This as Chaffetz demands answers into these pictures -- the president and the Japanese prime minister at mar-a-lago, huddling with advisors after learning North Korea launched a missile, club members witnessing it all, some posting pictures on Facebook raising security questions. So you'll look at mar-a-lago, you'll look at kellyanne Conway and the ivanka brand, but not the trump team's ties to Russia? At this point, I am holding out all my options. Holding out options, Mary Bruce. Live on the hill tonight, and how likely is it we'll see general Flynn called to the hill to testify? Reporter: Through growing calls to call him to testify, and the chair of intelligence committee says he plans to cast a wide net in this investigation looking into all contacts between the trump team and the Russians, David. Mary Bruce on capitol hill for us. Mary, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Republican Sen. John McCain says the Trump administration is in 'significant disarray'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/republican-sen-john-mccain-trump-administration-significant-disarray-45499496"
}