{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 08:03:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "A stronger Medicaid emerges from GOP health overhaul debate",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fstronger-medicaid-emerges-gop-health-overhaul-debate-49201163.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_45db7c5554f247c7b27647d7799447cb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Medicaid, a 1960s Great Society pillar long reviled by conservatives, seems to have emerged even stronger after the Republican failure to pass health overhaul legislation.\nThe federal-state health insurance program for low-income Americans hasn't achieved the status of Social Security and Medicare, considered practically untouchable by politicians, like an electrified \"third rail.\" But it has grown to cover about 1 in 5 U.S. residents, ranging from newborns to Alzheimer's patients in nursing homes, and even young adults trying to shake addiction. Middle-class working people are now more likely to personally know someone who's covered.\nIncreased participation — and acceptance — means any new GOP attempt to address problems with the Affordable Care Act would be unlikely to achieve deep Medicaid cuts.\n\"This was an important moment to show that people do understand and appreciate what Medicaid does,\" said Matt Salo, executive director of the National Association of Medicaid Directors, a nonpartisan group that represents state officials. \"The more people understand what Medicaid is and what it does for them, the less interested they are in seeing it undermined.\"\nWith Republicans in control of the White House, both chambers of Congress, and 34 out of 50 governorships, it would have been hard to imagine a more politically advantageous alignment for a conservative overhaul of Medicaid.\nPresident Barack Obama's Affordable Care Act expanded Medicaid to cover more low-income adults, many of them working jobs without health insurance. Thirty-one states have accepted the ACA's expansion, covering about 11 million people.\nThe GOP bills would have phased out funding for the Obama expansion, but they also placed a limit on future federal spending for the entire program — a step now seen as overreach.\nThe per-beneficiary spending caps in the House and Senate bills translated to deep cuts that divided Republicans.\nAlso, GOP governors who had expanded the program couldn't swallow the idea of denying coverage to hundreds of thousands of constituents. Some Republican governors went public with their opposition, while others quietly warned their congressional delegations about dire consequences.\n\"I think there is a recognition among many that Medicaid is not just a welfare program but an underpinning of our social system,\" said Diane Rowland of the Kaiser Family Foundation.\nAn AP-NORC poll taken last month found the public overwhelmingly opposed to GOP Medicaid cuts, by 62-22.\n\"You just can't do this to people who are in situations that they didn't put themselves in,\" said Sara Hayden of Half Moon Bay, California. Unable to work as a data journalist due to complications of rheumatoid arthritis, she was able to get health insurance when her state expanded Medicaid.\nHayden estimates that one of the medications she takes for the disease would cost about $16,000 a month if she were uninsured. She pays nothing with Medi-Cal, as the Medicaid program is known in California.\n\"If they are going to repeal and replace, then I am dead in the water,\" she said.\nBrian Kline of Quakertown, Pennsylvania, works as a customer service representative, and got coverage after his state expanded Medicaid in 2015. Early last year he was diagnosed with colon cancer following a colonoscopy. After treatment that Medicaid paid for, his last CT scan was clear.\n\"You just wonder if the Republican bill had passed...what would have happened to me?\" said Kline. \"Would I have had access to my doctors and the tests to make sure my cancer didn't come back? I'm not sure what the answer to that question would have been.\"\nMany Republicans view Obama's Medicaid expansion as promoting wasteful spending, because the federal government pays no less than 90 percent of the cost of care, a higher matching rate than Washington provides for the rest of the program.\n\"That is not a good recipe for encouraging states to implement better, lower-cost models of care,\" said Mark McClellan, who oversaw Medicare and Medicaid under former President George W. Bush.\nNonetheless, the debate showed Congress can't just elbow its way to a Medicaid overhaul.\n'You are going to have to be gentle and thoughtful, working in a bipartisan way to see what ideas will reach across the aisle,\" said Republican economist Gail Wilensky, also a former Medicare and Medicaid administrator.\nThe push for Medicaid changes will now shift to the states. Some on the political right are seeking federal approval for work requirements and drug testing. But activists in the 19 states that have not yet expanded their programs are contemplating revived campaigns.\nAn area that could find bipartisan support is health promotion, since Medicaid beneficiaries tend to have higher rates of smoking and other harmful lifestyle factors.\nKatherine Hempstead, who directs health insurance research for the nonpartisan Robert Wood Johnson Foundation says Medicaid has come out a \"winner\" in the debate.\n\"Medicaid has shown itself to be very much appreciated by a broader constituency than we might have originally thought,\" she said. \"And that is an important takeaway.\"",
    "source_domain": "abcnews.go.com",
    "title": "A stronger Medicaid emerges from GOP health overhaul debate",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/stronger-medicaid-emerges-gop-health-overhaul-debate-49201163"
}