{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 21:45:49+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Cody Garbrandt beats Dominick Cruz for UFC bantamweight belt",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fcody-garbrandt-beats-dominick-cruz-ufc-bantamweight-belt%2Fstory%3Fid%3D44515857.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_161231_mma_garbrandt_cruz_hl_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "LAS VEGAS -- The UFC has crowned a new bantamweight champion -- and perhaps its next mega star.\nCody Garbrandt claimed the 135-pound title -- and defeated the best fighter in the history of the division -- at UFC 207 on Friday, out-pointing Dominick Cruz in a five-round title fight. The championship bout co-headlined the pay-per-view event inside T-Mobile Arena.\nThe victory comes less than two years after Garbrandt made his UFC debut as a relatively unknown 23-year-old. All three judges scored the bout in his favor: 48-46, 48-46 and 48-47.\nThe fight featured an emotional buildup, with Cruz and Garbrandt going back and forth in the days prior. On Thursday, there was a minor physical altercation between Garbrandt and Cruz's teammate and UFC featherweight Jeremy Stephens.\n\"I thrive on that fire,\" Garbrandt said. \"That's what I grew up in -- fighting. That's all I know. I don't know anything else but fighting. Hats off to Dominick and [his team] Alliance MMA for making me a better fighter tonight. He's tough as hell.\"\nFighting out of Team Alpha Male in Sacramento, California, Garbrandt entered the contest on a run of three consecutive first-round knockouts. His best shot ahead of the bout seemed to be one big punch, but he proved capable of meeting Cruz in every area.\nIn the opening moments, he slipped several Cruz punches, then shuffled and smiled. The taunting continued throughout. He pointed at Cruz after knocking him down in the fourth round, repeatedly placed his hands on his hips and talked in Cruz's direction.\nCruz's reputation is built on being unpredictable, but Garbrandt seemed to know where he was at every step. He buckled him with a right hand in the third round and then dropped him multiple times in the fourth. He opened a massive cut over Cruz's left eye with punches.\nCruz's eyes rolled back after one right hand and he appeared to go out momentarily.\nOriginally from Ohio, Garbrandt is a former amateur boxer. His father spent much of Garbrandt's childhood in prison.\nGarbrandt walked to the Octagon with Maddux Maple, a little boy he befriended years ago who was battling leukemia. The two made a promise Maple would defeat the disease and Garbrandt would win a UFC championship. Maple's cancer has gone into full remission.\nThe win sets up a potential fight between Garbrandt and T.J. Dillashaw, a former champion and teammate. Dillashaw defeated John Lineker via unanimous decision at UFC 207.",
    "source_domain": "abcnews.go.com",
    "title": "Cody Garbrandt beats Dominick Cruz for UFC bantamweight belt",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/cody-garbrandt-beats-dominick-cruz-ufc-bantamweight-belt/story?id=44515857"
}