{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 23:58:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "A casino regular, quiet but prickly, unleashes a rampage",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fcasino-regular-quiet-prickly-unleashes-rampage-50336321.json",
    "image_url": "http://abcnews.go.com/US/wireStory/casino-regular-quiet-prickly-unleashes-rampage-50336321",
    "language": "en",
    "localpath": null,
    "maintext": "Stephen Paddock kept a cigar at hand, even though he didn't smoke. But he was quick to notice those who did.\nThen Paddock, a denizen of hazy casinos, would light his cigar and aim the smoke into the faces of those whose puffing annoyed him.\n\"He was the king of microaggression,\" his brother, Eric, said.\nLast week, Stephen Paddock returned to The Strip, where he spent countless hours playing high-limit video poker, and eyed the fun-seekers crowding his oasis. But this time he did so from a 32nd floor casino hotel suite. Then he smashed open a pair of windows with a hammer and opened fire with a carefully assembled arsenal, killing 58 fans gathered at an outdoor concert and injuring 500 more before killing himself.\nInvestigators and those who knew the 64-year-old say they cannot fathom what drove him to slaughter or point to any specific grievance that might have set him off.\nBut details that have surfaced so far about him are clues, at least, to his mindset. Most mass shooters are younger. But Paddock — a one-time IRS agent and the son of a notorious bank robber — was the product of decades of experience and rumination.\nPaddock was the oldest of four brothers. When he was 7, his father, Benjamin Hoskins Paddock, tried to run down an FBI agent during a pursuit in Las Vegas. After the elder Paddock was caught and charged with a string of Phoenix bank robberies, agents searched the family's home in Tucson, Arizona. A neighbor took little Stephen swimming while agents looked for evidence.\nBenjamin Paddock was sentenced to 20 years in prison. But he escaped and spent a decade on the run.\n\"He reportedly has suicidal tendencies and should be considered armed and dangerous,\" the FBI warned.\nPaddock's mother moved with her sons to Southern California, where she worked as a secretary and raised the boys on her own.\nAt John H. Francis Polytechnic High School, Paddock was a brainy kid with an \"irreverence toward authority,\" said Richard Alarcon, a former classmate who later served on the Los Angeles City Council.\nFor a school contest, Paddock and other students were assigned to design bridges without using glue.\nPaddock's bridge \"was like a brick, he put so much glue in it,\" Alarcon said. \"He didn't care ... It was like he just wanted to build the best bridge ever, regardless of what the rules were.\"\nPaddock earned a degree in business administration from California State University, Northridge, in 1977, then spent a decade working for the federal government, including six years as an IRS agent. He married and divorced twice, remaining on good terms with both former wives, family member say, and left government for a defense contractor.\nAround the same time, he began investing in real estate. Eric Paddock said that together with his gambling exploits, the investments made his brother a multimillionaire.\nAt Reno's Atlantis Casino, Paddock met Marilou Danley, a high-limit hostess there from 2010 to 2013, and they became a couple. In a statement released by her lawyer, Danley said Paddock sent her to the Philippines weeks before the shooting and described him as \"a kind, caring, quiet man ... I hoped for a quiet future together with him.\"\nDanley said Paddock wired her $100,000 and told her to buy a house for her family in the Philippines.\nBut workers at a casino Starbucks that the couple frequented say Paddock often scolded his girlfriend in public. Others who crossed paths with Paddock in recent months described him as despondent.\nWhen Paddock came into a Reno car dealership late this summer, he told salesman Scott Armstrong he was depressed and had relationship troubles.\n\"When's the last time somebody told you their life was miserable? It sticks with you,\" Armstrong said.\nStill, investigators said they are finding little to explain what drove him to mass murder. He had no known criminal record, and investigators have not disclosed any evidence that he struggled financially or otherwise.\nPaddock could sit for hours in front of video poker machines, often placing bets of $100 or more, rarely talking with anyone else but clearly conscious of his surroundings, said John Weinreich, a former executive casino host at Reno's Atlantis.\nHe said Paddock had a habit of staring at other people, as if silently challenging them to a contest.\n\"It was just his demeanor. It was like, 'I'm here. Don't cross me. Don't look at me too long,'\" Weinreich said.\nEric Paddock said his brother was generous with the privileges the casinos bestowed. He recalled how during one trip to Las Vegas, Stephen ordered them a sushi meal that must've been worth $1,000, but was paid for by a casino. Soon after, though, Stephen Paddock turned abruptly and demanded that his brother go get him a sandwich.\n\"That's the cost of being with Steve,\" he said.\nEric Paddock said he knew his brother owned a few handguns. But investigators say Paddock had bought 33 firearms in the last year alone, mostly rifles.\nWhen Paddock visited B&S Guns in Garland, Texas, last year he asked about ways to modify a gun to make it easier to pull the trigger, owner Paul Peddle said. Danley, who was walking with a cane at the time, played with Peddle's puppies while her boyfriend asked questions. And when it was time to go, Paddock walked helped her into the car.\n\"He was very charismatic with her, very sweet,\" Peddle said.\nWhen Paddock checked into the Mandalay Bay Resort and Casino last week, he requested a room on a higher floor, but was told nothing was available. Then a room freed up and managers moved him to a suite on the 32nd floor.\nOn the house.\n———\nCooper reported from Reno, Nevada; Balsamo from Las Vegas, and Geller from New York. Also contributing were reporters Astrid Galvan in Tucson, Arizona; Ken Ritter in Las Vegas, Claudia Lauer in Garland, Texas; Tamara Lush and Terrance Harris in Orlando, Florida; Don Thompson in Sacramento, California; Eric Tucker in Washington, D.C.; and news researcher Rhonda Shafner in New York.",
    "source_domain": "abcnews.go.com",
    "title": "A casino regular, quiet but prickly, unleashes a rampage",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/casino-regular-quiet-prickly-unleashes-rampage-50336321"
}