{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 11:03:41+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Marines seek young, tough recruits in Super Bowl ad",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fmarines-seek-young-tough-recruits-super-bowl-ad-52812522.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_4f26d8e3e03346e4a66c93e153c84925_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For the first time in 30 years, the U.S. Marine Corps will be airing an ad during a Super Bowl, using an online-only spot Sunday to target a young, tough, tech-savvy audience for potential recruits who are looking for a challenge.\nThe high-powered, battle-heavy, 30-second ad shows Marines deploying off ships in amphibious vehicles, dropping bombs from aircraft and hurling a shoulder-launched drone into the air.\n\"It's not just the ships, the armor or the aircraft. It's something more. It's the will to fight and determination to win found inside each and every Marine that answers a nation's call,\" the announcer says, as the camera follows a squad of Marines storming off helicopters into a mock firefight while explosions erupt around them.\nThe goal, said Maj. Gen. Paul Kennedy, head of the Marine Corps Recruiting Command, is to reach a key demographic — young men and women who have faced and conquered challenges in their life, probably played combat sports like wrestling or rugby, and have a bit of that fighting spirit.\nNetwork television viewers of the game won't see the Marine spot. But those watching through online streaming services — which charge a fraction of the advertising price — will see it twice.\n\"I'm not trying to enlist fathers or mothers, I'm trying to enlist 18 to 24 year olds,\" said Kennedy. \"And they tend to be cord cutters. They take in entertainment differently and they tend to do it on a device rather than a television.\"\nThe Marine Corps would not provide the exact cost because the specific pricing is proprietary. But the online ad represents a savings of nearly 85 percent over the broadcast price. Thirty-second slots are going for more than $5 million for broadcast airtime alone. And the online ad — which can be viewed on www.marines.com — is expected to reach more than 20 million viewers.\nAs the military services struggle to meet recruitment goals in these times of low unemployment, they are competing for many of the same young people — physically fit high school graduates who can score 50 or higher on the military's aptitude test.\nThe Marine Corps is on target to meet its recruitment goal of about 38,000 for the fiscal year ending Sept. 30. But recruiters have historically found that the months of February through May are the toughest for finding new enlistments. By this time, many high school seniors have decided what they will do, or what college they will attend.\nSo Kennedy is hoping the ad will reach some who may still be open to serving in the Marine Corps. Targeting the streaming broadcast has now become a more effective option as viewership online grows, he said, and is the best way to reach more young people while spending less money.\n\"I don't have unlimited funds,\" he said. \"And this is probably the most-watched event, as we move into the toughest months of recruiting.\"\nThe visuals in the ad, he said, go to the heart of what Marines do, deliberately focusing on the fight rather than some of the intangibles such as the potential for paid college tuition, bonuses or other incentives. And they are designed to attract people who are tough and resilient — key words the Marines use repeatedly to describe the force.\nThe battle scenes were filmed on the West Coast with actual Marines participating in a military exercise called Dawn Blitz in order to show more realistic scenarios. The ad also shows Marines deployed on the USS Essex, an amphibious assault ship, which was off the California coast for training, to mimic a deployment near the shores of an adversary.\n\"This ad talks to the fighting spirit of young people that have come up through high school,\" Kennedy said. \"We want young, tough, smart warriors that want to continue to seek challenges, and we're seeking them from men and women from all walks of life.\"",
    "source_domain": "abcnews.go.com",
    "title": "Marines seek young, tough recruits in Super Bowl ad",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/marines-seek-young-tough-recruits-super-bowl-ad-52812522"
}