{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:33:35+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Police and emergency personnel responded this morning to the Port Authority Bus Terminal in New York to investigate reports of an \"explosion.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fnyc-police-respond-reports-explosion-port-authority-bus-51715051.json",
    "image_url": "http://a.abcnews.com/images/US/171211_abc_spec_rep_port_authority_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for NYC police respond to reports of explosion at Port Authority Bus Terminal\nThis is an ABC news. And we're coming on the air right now because there's been an explosion at the Port Authority bus terminal here in New York just about a half mile hear from Times Square you see the scene. Right there police reporting an explosion believed to be according to police sources from a pipe bomb. A suspect reported to be in 'cause he would district ABC's GOP NATO's on the scene at the Port Authority bus terminal. Hey dork right now we're seeing a lot program Yorker who locked locked the police are all walks going here if you don't Port Authority and order authority is the lady took what terminal here in New York City. It goes on perp walk the block. And right now police say they're over audit report. That I Walt end or cold here that a little topical pipe bomb detonated have to wait. Below ground over Port Authority so that's where all of the puppet and don't eat well but we don't note that looked. You know boss or your beat but the open who has been so few people look we're out of Port Authority you know that one person had been cut the lead at the quarry equally important. All you you heard right out the work but holy crap video they are confident that we can say quite doubt doubt that a court as you know. If you're rapid alert gulf according out there and all of the exploit could only those who. We have had no question about that meantime subways have been diverted away from the terminal. That's right and you could be equally that the Baltic we have low traffic area directly at the time of the morning or you have people going to work all be commuter. Rely on Port Authority the people are dead police are doing their best try to get people away from the area just to make sure that they have the Balkan period. That is a live look at the scene at the Port Authority bus terminal here in New York City or deport an explosion. Earlier this morning as we just heard from police won custody. I won one suspect is in custody right now some people have been injured. Just getting the report seeing right now we're gonna stay on top of this all morning long we've got that on Good Morning America. This has been a special. From BP.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "NYC police respond to reports of explosion at Port Authority Bus Terminal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/nyc-police-respond-reports-explosion-port-authority-bus-51715051"
}