{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 06:23:10+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fauthorities-closer-finding-austin-bomber-53866756.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_cefc98505b0f4e9fa5a418f8516d0053_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "William Grote says the latest attack by a suspected serial bomber that has terrorized Austin for weeks left what appeared to be nails embedded in his grandson's knees.\nPolice and federal agents said that the blast Sunday night triggered along a street by a nearly invisible tripwire suggests a \"higher level of sophistication\" than they have seen before in three early package bombs left on doorsteps, and means the carnage is now random, rather than targeted at someone in particular.\nTwo people are dead and four injured, and authorities don't appear closer to making any arrests in the four bombings that have rocked the capital city.\nAuthorities haven't identified the latest victims, but Grote told The Associated Press that his grandson was one of the two men wounded in southwest Austin's quiet Travis Country neighborhood. They suffered what police said were significant injuries and remained hospitalized in stable condition.\nGrote said his grandson is cognizant but still in a lot of pain. He said the night of the bombing, one of the victims was riding a bike in the street and the other was on a sidewalk when they crossed a trapwire that he said knocked \"them both off their feet.\"\n\"It was so dark they couldn't tell and they tripped,\" he said. \"They didn't see it. It was a wire. And it blew up.\"\nGrote said his son, who lives about 100 yards (91 meters) away from the blast, heard the explosion and raced outside. \"Both of them were kind of bleeding profusely,\" Grote said.\nThat was a departure from the three earlier bombings, which involved parcels left on doorsteps that detonated when moved or opened.\nThe tripwire twist heightened the fear around Austin, a town famous for its cool, hipster attitude.\n\"It's creepy,\" said Erin Mays, 33. \"I'm not a scared person, but this feels very next-door-neighbor kind of stuff.\"\nAuthorities repeated prior warnings about not touching unexpected packages and also issued new ones to be wary of any stray object left in public, especially one with wires protruding.\n\"We're very concerned that with tripwires, a child could be walking down a sidewalk and hit something,\" Christopher Combs, FBI agent in charge of the bureau's San Antonio division, said in an interview.\nPolice originally pointed to possible hate crimes, but the victims have now been black, Hispanic and white and from different parts of the increasingly diverse city. Domestic terrorism is among the variety of possible motives investigators are looking at.\nLocal and state police and hundreds of federal agents are investigating, and the reward for information leading to an arrest has climbed to $115,000.\n\"We are clearly dealing with what we believe to be a serial bomber at this point,\" Austin police Chief Brian Manley said, citing similarities among the four bombs. He would not elaborate, though, saying he didn't want to undermine the investigation.\nWhile the first three bombings all occurred east of Interstate 35, a section of town that tends to be more heavily minority and less affluent, Sunday's was west of the highway. The differences in where the blasts have occurred, the lack of a motive and other unknowns make it harder to draw conclusions about a possible pattern, further unnerving a city on edge.\nThad Holt, 76, said he is now watching his steps as he makes his way through a section of town near the latest attack. \"I think everybody can now say, 'Oh, that's like my neighborhood,'\" he said.\nFred Milanowski, agent in charge of the Houston division of the federal Bureau of Alcohol, Tobacco, Firearms and Explosives, said the latest bomb was anchored to a metal yard sign near the head of a hiking trail.\n\"It was a thin wire or filament, kind of like fishing line,\" he said. \"It would have been very difficult for someone to see.\"\nMilanowski said authorities have checked more than 500 leads. Police asked anyone with surveillance cameras at their homes to come forward with the footage on the chance it captured suspicious vehicles or people.\nNoel Holmes, whose house is about a mile away, was stunned by how loud Sunday's explosion was.\n\"It sounded like a very nearby cannon,\" Holmes said. \"We went out and heard all the sirens, but it was eerie. You didn't feel like you should be outside at all.\"\nSpring break ended Monday for the University of Texas and many area school districts. University police warned returning students to be alert and to tell their classmates about the danger, saying, \"We must look out for one another.\" None of the four attacks happened close to the campus near the heart of Austin.\nThe PGA's Dell Technologies Match Play tournament is scheduled to begin in Austin on Wednesday, and dozens of the world's top golfers were to begin arriving.\n\"I'm pretty sure the tour has enough security to keep things safe in here. But this is scary what's happening,\" said golfer Jhonattan Vegas, already in town.\nAndrew Zimmerman, a 44-year-old coffee shop worker, said the use of a tripwire adds a new level of suspected professionalism and makes it harder to guard against such attacks.\n\"This makes me sick,\" he said.\n———\nAssociated Press writer Jim Vertuno contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Austin carnage now random; an arrest doesn't appear close",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/authorities-closer-finding-austin-bomber-53866756"
}