{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:42+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Flatest-driving-tests-halted-pedestrian-dies-53854123.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/latest-driving-tests-halted-pedestrian-dies-53854123",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the pedestrian death involving a self-driving vehicle in Tempe (all times local):\n10:35 a.m.\nUber says it has suspended all of its self-driving testing following what is believed to be the first fatal pedestrian crash involving the vehicles.\nThe self-driving testing has been taking place in Phoenix, Pittsburgh, San Francisco and Toronto.\nAutomakers and tech companies are competing to be first with the technology.\nPolice in the Phoenix suburb of Tempe say one of Uber's self-driving vehicles struck and killed a pedestrian on Sunday night.\nInvestigators say the vehicle was in autonomous mode with an operator behind the wheel when the woman walking outside of a crosswalk was hit.\nThe woman died of her injuries at a hospital.\nUber CEO Dara Khosrowshahi expressed condolences on his Twitter account the company is working with local law enforcement on the investigation.\n10:15 a.m.\nPolice in a Phoenix suburb say one of Uber's self-driving vehicles has struck and killed a pedestrian.\nPolice in the city of Tempe said Monday that the vehicle was in autonomous mode with an operator behind the wheel when the woman walking outside of a crosswalk was hit.\nSgt. Ronald Elcock says in an email that the crash happened overnight but did not say whether it occurred Sunday night or Monday morning.\nThe woman died of her injuries at a hospital and her name was not made public.\nUber has been testing the self-driving vehicles in Tempe and Phoenix for months.\nUber says on Twitter that it is \"fully cooperating\" with the investigation and expressed condolences to the family of the victim.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Self-driving tests halted after pedestrian dies",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/latest-driving-tests-halted-pedestrian-dies-53854123"
}