{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 01:26:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "The president changes his tone when he addressed the nation, pointing to the importance of bravery and unity.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ftrump-addresses-nation-moving-speech-gunman-opens-fire-48046313.json",
    "image_url": "http://a.abcnews.com/images/WNT/170614_wn_vega_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump addresses the nation with a moving speech after gunman opens fire on members of Congress\nPresident trump speaking to the nation, acknowledging the deep divide. Urging calm today. I want to bring in Cecilia Vega. This was a bit of a test of sort for the president after a shooting like this. We may have our differences, but we do well in times like these to remember that everyone who serves in our nation's capitol is here because above all they love our country. We can all agree that we are blessed to be Americans. That our children deserve to grow up in a nation of safety and peace. Cecilia, you heard from those lawmakers in the report just beforehand here on the hill. One told me we have in fact reached that breaking point. Americans have to come together despite their political views, is the white house aware of that. They certainly are and in this call of unity is stretching from the white house down to capitol hill and frankly both sides of the aisle. The question right now is, this is coming at time in terms of deep division in the country. Cecilia, as the president deals with tone, he's also dealing with a new headline breaking late today, the Washington post now reporting that Robert Mueller the special counsel could be investigating the president for possible obstruction of justice. Essentially the president trump is now part of this investigation personally, they're looking into possible obstruction of justice. Former FBI director James Comey just kre lently testified the president he was not under investigation. Under his tenure. We did just get a statement from the president's legal team, they called this a leak that's outrageous and illegal.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump addresses the nation with a moving speech after gunman opens fire on members of Congress",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/trump-addresses-nation-moving-speech-gunman-opens-fire-48046313"
}