{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 06:36:56+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Rodgers-Led Packers Beat Lions 31-24 to Win NFC North",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Frodgers-led-packers-beat-lions-31-24-win-44506972.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/rodgers-led-packers-beat-lions-31-24-win-44506972",
    "language": "en",
    "localpath": null,
    "maintext": "Aaron Rodgers was right.\nThe Green Bay Packers ran the table, just as their star quarterback said they could, by capping a six-game winning streak with an NFC North-clinching 31-24 victory over the Detroit Lions on Sunday night.\n\"This wasn't just a shot in the dark,\" said Rodgers, who threw three of his four touchdown passes in the second half. \"It was an optimistic belief in my teammates.\"\nThe Packers (10-6) were undefeated after losing four straight games midway through the season, when Rodgers shared his bold thoughts, to win the division for the fifth time in six years. Like his team, Rodgers has been perfect during the streak with 15 TD passes and no interceptions. He will lead fourth-seeded Green Bay at home Sunday against the fifth-seeded New York Giants in an NFC wild-card game in its eighth straight postseason appearance.\n\"We have bigger aspirations,\" Packers coach Mike McCarthy said. \"This is the first step.\"\nDetroit (9-7) dropped its last three games after it had a two-game lead in the NFC North, spoiling its shot at winning a division title for the first time since 1993.\nThe Lions, though, will be in the playoffs for the second time in three years with coach Jim Caldwell because the Giants beat the Washington Redskins earlier in the day. The sixth-seeded Lions will play at third-seeded Seattle on Saturday night in a wild-card game.\n\"If you're in, you've got a chance,\" Caldwell said.\nRodgers , who was 27 of 39 for 300 yards, threw a go-ahead, 3-yard TD pass to Davante Adams with 9:23 left in the third quarter. Rodgers connected with Geronimo Allison and Adams in the end zone in the fourth quarter to give Green Bay a 14-point lead in a game it trailed 14-7 at halftime.\nTHE OTHER QB\nThe Lions had a slim shot to comeback from a fourth-quarter deficit to win, as they did eight times this season, when Matthew Stafford connected with Anquan Boldin for a 35-yard touchdown pass with 13 seconds left. The Packers dashed Detroit's hopes by recovering the onside kick and Rodgers had only to kneel once to seal the victory.\nStafford put Detroit ahead by a touchdown with a 3-yard pass to Golden Tate with 23 seconds left in the second quarter after Zach Zenner tied it with a 1-yard run.\nStafford was 26 of 41 for 347 yards with two TDs and an interception. He made some fantastic passes and some he sailed over wide-open receivers.\nRODGERS RUNS\nRodgers ran for 42 yards, his third-highest total of the season, on 10 carries. By design, he converted a third-and-1 from the Green Bay 34 with a 13-yard run a bootleg. Rodgers also used his feet to escape sacks and to give his receivers time to get open.\nMISSED OPPORTUNITIES\nStafford failed to connect with Tate when he was all by himself midway through the first quarter, wasting a chance to make a big play to possibly score on Detroit's second drive.\n\"That one was close to being really good,\" Stafford said. \"You're going to hit some, you're going to miss some.\"\nEarly in the scoreless second period, Detroit's Matt Prater missed a 39-yard field goal. Green Bay linebacker Clay Matthews also missed an opportunity, dropping one of Stafford's passes that he could've possibly returned for a score.\nMATTHEW'S MILESTONE\nStafford surpassed 30,000 yards passing for his career, becoming the fastest quarterback to reach the mark. He did it in his 109th game Sunday night against Green Bay. The previous record was held by Dan Marino and Kurt Warner, who did it in 114 games. With a chance to lead the Lions to a signature win, however, Stafford came up short to add to his legacy that he beats bad teams and loses against winning teams.\nINJURIES\nPackers: Two cornerbacks — Quinten Rollins (neck) and Makinton Dorleant (knee) — were carted off the field minutes apart late in the third quarter and another cornerback — Damarious Randall (knee) — left the game with an injury in the second half. Rollins, who was conscious and able to move, was taken to a hospital. Receiver Randall Cobb (ankle), running back James Starks (concussion) and center JC Tretter (knee) were inactive with injuries.\nLions: Cornerback Asa Jackson left the game with an ankle injury. Receiver Marin Jones was evaluated late in the game for a concussion, but returned to play. Cornerback Darius Slay returned from a one-game absence with a hamstring injury. Right tackle Riley Reiff was out with a hip injury and was missed, especially when Nick Perry got past his replacement, Corey Robinson, for a possession-ending sack in the third quarter. Robinson left the game with an apparent injury in the second half and\nUP NEXT\nPackers: Green Bay will play the Giants at Lambeau Field, where it beat them 23-16 in Week 5.\nLions: Detroit, which has won only one playoff game since winning the 1957 NFL title, will face long odds to advance on the road against the Seahawks.\n———\nFor more NFL coverage: www.pro32.ap.org and http://twitter.com/AP—NFL\n———\nFollow Larry Lage at www.twitter.com/larrylage",
    "source_domain": "abcnews.go.com",
    "title": "Rodgers-Led Packers Beat Lions 31-24 to Win NFC North",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/rodgers-led-packers-beat-lions-31-24-win-44506972"
}