{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 19:50:02+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Family Sues Apple, Claims FaceTime Distracted Driver in Fatal Crash",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Ffamily-sues-apple-claiming-facetime-distracted-driver-crash%2Fstory%3Fid%3D44506168.json",
    "image_url": "http://a.abcnews.com/images/GMA/170102_gma_davis2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Texas couple is suing Apple, claiming that its FaceTime app distracted a driver who rammed into the couple's car, killing their 5-year-old daughter.\nParents James and Bethany Modisette are suing Apple for damages on the basis that the electronics giant failed to install and implement a \"safer, alternative design\" for FaceTime that would have helped to prevent a driver from using the app while traveling at highway speed, court documents show.\nThe lawsuit filed Dec. 23 in California Superior Court in Santa Clara County also claims that Apple failed \"to warn users that the product was likely to be dangerous when used or misused\" or to instruct on its safe usage.\nThe fatal accident occurred Christmas Eve in 2014 near Dallas, when, according to the lawsuit, the Modisette family was driving in a Toyota Camry, with daughter Moriah, 5, in a booster seat in the left rear passenger seat and her sister, Isabella, next to her in the right rear seat.\nThe Modisettes had slowed or stopped their car due to police activity ahead of them on the highway that had caused traffic to back up, according to the suit.\nAnother driver, Garrett Wilhelm, traveling in his Toyota 4Runner in the same direction and behind the Modisette car, allegedly had his attention diverted by his use of the FaceTime app, the suit says.\n\"As a result of that distraction, his Toyota 4Runner, while traveling at full highway speed (65 mph), struck the Modisette family car from behind, causing it to be propelled forward, rotate, and come to a final rest at an angle facing the wrong direction in the right lane of traffic,\" the suit says.\nWilhelm's car then \"continued its trajectory by rolling up and over the driver's side of the Modisette car,\" the suit claims.\nThe crash caused extensive damage to the driver's side of the Modisettes' car, and rescue workers had to extract both the father and 5-year-old Moriah from the car, the suit says.\nThe father was in critical condition after the crash while the mother and daughter Isabella were taken to a regional medical center to be treated for injuries. Moriah was airlifted to the area children's hospital where she later died from her injuries, according to the suit.\n\"Wilhelm told police at the scene that he was using FaceTime on his iPhone at the time of the crash, and the police located his iPhone at the crash scene with the FaceTime application still active,\" the suit claims.\nThe Modisettes contend in their suit that, \"At the time of the collision in question, the iPhone utilized by Wilhelm contained the necessary hardware (to be configured with software) to automatically disable or 'lock-out' the ability to use [FaceTime] ... However, Apple failed to configure the iPhone to automatically ‘lock-out’ the ability to utilize ‘FaceTime’ while driving at highway speeds, despite having the technical capability to do so.”\nWilhelm was indicted on manslaughter charges by a grand jury in Denton County, Texas, according to the Denton Record-Chronicle. He has been out of jail on bail since August, and a jury trial in the case is scheduled for Feb. 27, the Record-Chronicle reports.\nWilhelm’s lawyer, Ricky Perritt, issued the follow statement: \"The Wilhelm family offers their thoughts and prayers for the family of the young lady who lost her life in this tragic accident. We are confident that after all the facts are brought out in Court, it will be shown that the use of a cellular device did not contribute and Mr. Wilhelm did not commit a crime ... it was simply an accident.\"\nABC News reached out to Apple but did not receive a comment on the case.",
    "source_domain": "abcnews.go.com",
    "title": "Family Sues Apple, Claiming FaceTime Distracted Driver in Crash That Killed 5-Year-Old Daughter",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/family-sues-apple-claiming-facetime-distracted-driver-crash/story?id=44506168"
}