{
    "authors": [
        "Abc News",
        "More Andrea"
    ],
    "date_download": "2018-03-19 20:57:04+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "\"There's been a lot of smiles this morning,\" the superintendent said.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Ftexas-high-school-reopens-1st-time-hurricane-harvey%2Fstory%3Fid%3D53849820.json",
    "image_url": "https://s.abcnews.com/images/US/kingwood-hurricane-harvey-1-gty-thg-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One Houston high school that was heavily damaged from Hurricane Harvey reopened today for the first time since the storm struck last August.\nInterested in Hurricane Harvey? Add Hurricane Harvey as an interest to stay up to date on the latest Hurricane Harvey news, video, and analysis from ABC News. Add Interest\n\"There's been a lot of smiles this morning,\" Kingwood High School superintendent Elizabeth Fagen told ABC News. \"Students were yelling, 'We're so excited!'\"\nThe Kingwood, Texas, school, located about 30 miles north of Houston, was closed for over six months after flooding from the hurricane damaged the split-level building.\nThe storm caused \"millions of dollars in damage,\" a spokesperson for the school district told ABC News.\nBrett Coomer/Houston Chronicle via AP\nAll 2,782 Kingwood students were sent to another school in the district as repairs were taking place.\n\"All the ceramic tile was removed down to the concrete slab,\" Fagen said of the flooring, and the walls and doors on the first and second floors had to be replaced.\nThe renovations included security enhancements and a brand new gym, theater, and pool, which is still under construction.\nJuan Lozano/AP, FILE\nNext weekend the high school is hosting an open house for the community to come and see the renovations.\n\"We have people in our community still working through it, but I couldn't be prouder of the way people here have handled the situation,\" Fagen said.",
    "source_domain": "abcnews.go.com",
    "title": "Texas high school reopens for the 1st time since Hurricane Harvey",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/texas-high-school-reopens-1st-time-hurricane-harvey/story?id=53849820"
}