{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-05-30 19:55:17+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The boy was treated by multiple doctors multiple times, the suit says.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fmother-sues-legoland-son-allegedly-developed-rash-face%2Fstory%3Fid%3D55531458.json",
    "image_url": "https://s.abcnews.com/images/US/HT_Best_Family_Hotel_01_jrl_160520_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "What was meant to be a fun day at an amusement park turned into a years-long source of unsolved medical issues and emotional distress for one young boy in Florida, according to a new lawsuit.\nA mother is suing Legoland over claims that her son suffered long-lasting rashes to his face after getting it painted during a visit to the park.\nThe suit alleges that the boy, who is a minor, started to \"complain that his face was itching and burning\" after the visit.\nHis mother \"took him to the doctor because she noticed that his skin started to break out in a rash, scattered about his cheeks,\" the suit states.\nThe doctor prescribed medication for treatment of the rash but it did not work, the suit states, as the rash reportedly \"continued to spread\" to include the boy's cheeks as well as around his mouth and nose.\n\"The rash continued to spread out of control, causing dark spots and discoloration,\" according to the lawsuit.\nThe boy continued to return to the doctor \"several\" times and has received \"23 months of various treatments and prescriptions,\" including eczema cream, but his \"skin condition continues to worsen, and the doctors became baffled as to why the rash and discoloration would not go away,\" the suit states.\nMarjie Lambert/Miami Herald/MCT via Getty Images FILE\nThe doctor reportedly solicited a second opinion, and further examination led to the conclusion that the spread of the rash was too even and uniform for it to be eczema, which does not normally follow such patterns. The doctor said that it suggested that something had to have been placed on the boy's skin, and \"at that moment\" the mother remembered that her son had his face painted while visiting Legoland \"right before he developed the rash,\" the suit states.\n\"The paint used on his face at Legoland that has caused him great pain and suffering, as well as two years of humiliation by other child [sic] and deep emotional distress,\" the suit states.\nABC News' requests for comment from the lawyer who filed the suit were not immediately returned.\nThe suit claims one count of negligence and one count of negligent infliction of emotional distress against Legoland and the associated entertainment groups.\nLegoland representatives did not immediately respond to ABC News' request for comment, but they told NBC Orlando affiliate WESH on Tuesday that they had not been contacted about the lawsuit.\n\"We take all matters relating to the well-being of our guests seriously. We have not been contacted regarding this legal matter and therefore cannot comment at this time,\" Legoland officials told WESH.",
    "source_domain": "abcnews.go.com",
    "title": "Mother sues Legoland after son allegedly developed rash from face painting",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/mother-sues-legoland-son-allegedly-developed-rash-face/story?id=55531458"
}