{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 23:59:12+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "The Latest: Expert says shooter's behavior makes probe hard",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Flatest-australian-police-assist-danley-investigation-50319311.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_d4a95b3e9918454eb875456b8cecd3a9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the mass shooting in Las Vegas (all times local):\n3:15 p.m.\nLas Vegas shooter Stephen Craig Paddock's anti-social personality will only hamper investigators as they try to figure to piece together what led to the shooting.\n\"It's extremely difficult,\" said Erroll Southers, the director of homegrown violent extremism studies at the University of Southern California.\n\"The lack of a social media footprint is likely intentional,\" Southers said. \"We're so used to in the first 24 to 48 hours being able to review social media posts. If they don't leave us a note behind or a manifesto behind, and we're not seeing that, that's what's making this longer.\n\"What's really puzzling is that we've seen him with similar kinds of activity — booking rooms in other places — so you have to ask yourself the reason he picked Las Vegas and not somewhere else.\"\nPaddock fired indiscriminately Sunday from his upper-level room at the Mandalay Bay hotel casino at people attending a country music festival below, killing dozens and injuring nearly 500 people. The 64-year-old Paddock killed himself as authorities closed in.\nBecause so few people knew Paddock well, investigators will likely have an even harder time sorting through his background to try to uncover any possible leads, Southers said.\n\"You don't have any cases of leakage — no one to say who's he mad at, what his motive is,\" Southers said. \"The key to this case right now is the girlfriend.\"\n\"The reason you want to engage in a terror attack is you want to bring attention to an extremist ideology, you want publicity,\" he said. \"You want people to be afraid of what you believe what you do.\"\n———\n1:35 p.m.\nAuthorities are planning to put up billboards in Las Vegas to seek more tips as they investigate the deadliest shooting rampage in modern U.S. history.\nUndersheriff Kevin McMahill also revealed at a news conference Friday afternoon that police are confident there was not another shooter in Stephen Paddock's room.\nPaddock fired indiscriminately Sunday from his upper-level room at the Mandalay Bay hotel casino at people attending a country music festival below, killing dozens and injuring nearly 500 people. The 64-year-old Paddock killed himself as authorities closed in.\nMcMahill also said that authorities don't have any information that anyone else used Paddock's room key.\nHe says authorities are interested in Paddock's medical history and are looking into that.\n———\n1:20 p.m.\nAuthorities say they still don't have a clear motive for the Las Vegas shooting rampage.\nUndersheriff Kevin C. McMahill provided an update on the investigation Friday. He says authorities have looked at gunman Stephen Paddock's personal life, political affiliation, economic situation and any potential radicalization.\nHe says authorities are aware the Islamic State group has claimed responsibility for the attack, but so far there is no evidence that it had a role.\nHe says authorities will continue to investigate those areas as well as look into leads and tips that come in.\nPaddock unleased gunfire Sunday from the 32nd floor of the Mandalay Bay hotel casino on the Las Vegas Strip, killing dozens and injuring nearly 500 people. He killed himself as police closed in.\n———\n12:10 p.m.\nMassachusetts could be moving quickly to outlaw so-called \"bump stock\" devices used by the Las Vegas shooter.\nDemocratic and Republican lawmakers have both filed bills to ban the devices. Republican Gov. Charlie Baker said he supports a ban.\nThe devices fit over the stock and grip of a semi-automatic rifle and allow the weapon to fire continuously, some 400 to 800 rounds in a single minute.\nState Rep. David Linsky, a Natick Democrat, has filed legislation that would outlaw any devices that increase the rate of discharge of a weapon and ban the sale of large capacity-feeding devices.\nRepublican Senate Leader Bruce Tarr of Gloucester has sponsored a bill that would prohibit devices that effectively turn rifles and shotguns into weapons with firing capabilities similar to machine guns.\n———\n11:40 a.m.\nScott Armstrong, a Reno, Nevada, car dealer, said Paddock confided in him about relationship troubles when the would-be gunman stopped in looking to buy a car about two months ago.\n\"Somehow or another we ended up talking about bad relationships, and he confided that he was depressed and his life was miserable,\" Armstrong said. \"It just struck me as really odd that somebody would say that.\"\nPaddock, unshaven and dressed casually but not disheveled, didn't elaborate on his relationship troubles, and Armstrong didn't pry. He didn't smile, and he \"wasn't very pleasant to talk to,\" he said.\n\"I could tell he was really down or something,\" Armstrong said. \"I just told him, I said, 'Hey I've been in some bad relationships myself. It'll get better. Tomorrow will be a better day than today.' \"\nArmstrong said he's talked with FBI agents about his recollection.\nOthers who have interacted with Paddock have described him as a quiet and confident man who did not engage in deep conversations. Armstrong said he's baffled by why he was so open with a stranger, but \"my job is to put people with ease and try to help them buy a car.\"\nHow is he so certain Paddock is the downtrodden man who visited him?\n\"When's the last time somebody told you their life was miserable? It sticks with you,\" he said\n———\n11:20 a.m.\nA gun show that was scheduled to take place this weekend in a casino off the Las Vegas Strip has been canceled following last Sunday's mass shooting.\nBoyd Gaming Corp. spokesman David Strow said Friday the decision to cancel the gun show at the Eastside Cannery Casino was made mutually with the show's promoter, Western Trails Show Promotions.\nIt was scheduled to take place on Saturday and Sunday and has been held at least five times in the past.\nDozens of people were killed and hundreds were injured Sunday night when Stephen Paddock opened fire from the windows of his 32nd floor hotel room and rained bullets on a country music festival attended by thousands.\n———\n10:20 a.m.\nA law enforcement official says Las Vegas shooter Stephen Paddock bought 1,000 rounds of tracer ammunition a month ago from a private seller he met at a Phoenix gun show.\nThe official says investigators searching the hotel room Paddock used as a sniper's perch found tracer rounds and a document with the name of the Mesa, Arizona, man who sold him the ammunition.\nThe official is involved in the shooting investigation and spoke anonymously because the official was not authorized to disclose case information.\nTracer bullets contain a pyrotechnic charge that illuminates the path of fired bullets so shooters can see whether their aim is correct.\nThe official says Paddock met the man in Phoenix on Sept. 9 and 10 and that the sale took place at the man's Mesa home.\nThe tracer ammunition that Paddock bought were .308-caliber and .223-caliber rounds.\nThe official did not know whether Paddock used tracer rounds during the attack.\nThe official declined to identify the seller.\n———\n9:30 a.m.\nSome New York state lawmakers want to make it illegal in the state to buy, sell or possess devices known as bump stocks that allow semi-automatic rifles to mimic the rapid fire of automatic weapons.\nAuthorities found 12 of the devices fitted to guns in the hotel room of Las Vegas shooter Stephen Paddock.\nIt is illegal to use bump stocks in New York state but a loophole in the law makes it legal to buy, sell or possess the devices.\nLegislation introduced this week would immediately ban bump stock sales and prohibit possession of them over time.\nDemocratic Assemblywoman Pat Fahy of Albany says it's illogical to allow the sale and possession of a device that cannot be used legally.\nThe bill has bipartisan support. Lawmakers will reconvene in Albany in January.\n———\n7:15 a.m.\nBoston Police Commissioner William Evans says authorities will step up security for concerts and sporting events in the city following the shooting in Las Vegas.\nOfficials have said there is no credible threat to Boston.\nBut Evans said the FBI told him Wednesday that agents turned up evidence that Las Vegas shooter Stephen Paddock researched sites in and around Fenway Park and the Boston Center for the Arts.\nThe Red Sox have said they're working with officials to beef up security.\nEvans said security would be boosted for events including a Bruno Mars concert, a City Hall Plaza concert, road races and Red Sox games.\nHe says police also plan to meet with hotel officials in coming days to discuss ways for them to increase security.\n———\n12:13 a.m.\nAustralian police are assisting their U.S. counterparts on the investigation into Las Vegas shooter's girlfriend Marilou Danley.\nThe Australian Broadcasting Corporation reports that Philippines-born Danley became an Australian citizen after moving to the Gold Coast in Queensland state and marrying a local man. ABC says she lived there for some 10 years until the late 1980s.\nAustralian Federal Police Commissioner Andrew Colvin said Friday that as an Australian citizen, Danley was entitled to consular assistance.\nAustralian police and government officials have not elaborated on Danley's time or citizenship in Australia.\nColvin says the Australian authorities are \"working very closely with our partners in the U.S.\"\nAustralia's foreign affairs department said Friday it is aware she is \"a person of interest\" and described her case as \"a matter for U.S. law enforcement.\"\n———\n12:01 a.m.\nInvestigators are probing the Las Vegas gunman's interest in other music festivals in the months before he killed 58 people and injured nearly 500 at an outdoor country concert.\nThey say Stephen Paddock rented rooms in high-rises overlooking the Lollapalooza festival in Chicago in August and over the Life is Beautiful festival near the Vegas Strip in September. Boston police say Fenway Park has come up in the investigation, but didn't elaborate.\nOn Thursday night, thousands gathered in Las Vegas to honor one of the victims who was killed, Officer Charleston Hartfield.\nHartfield was also a husband and father of two, and an Iraq War veteran.\nHis friend Sgt. Ryan Fryman told the crowd Hartfield was \"the greatest American I have ever known.\"",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Expert says shooter's behavior makes probe hard",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/latest-australian-police-assist-danley-investigation-50319311"
}