{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 21:16:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fbermuda-police-spokesman-authorities-found-body-amid-search-53858610.json",
    "image_url": "https://s.abcnews.com/images/US/WireAP_2738a72887994029ac2d512cda22e98e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on the American student reported missing in Bermuda (all times local):\n5:50 p.m.\nPolice officials in Bermuda are confirming that they have found the body of missing U.S. student Mark Dombroski.\nActing Assistant Commissioner James Howard of the Bermuda Police Services declined to provide certain details, include how authorities believe he may have died during a visit to the British Island territory.\nThe discovery of his body was announced at a news conference in the British island territory after a day of searching that involved members of the 19-year-old's family, volunteers and local authorities.\n———\n5:30 p.m.\nA police spokesman in Bermuda says authorities have found a body amid a search for a U.S. student who disappeared after a rugby tournament on the British island territory.\nSpokesman Dwayne Caines did not disclose any details about the discovery and did not confirm that the body was that of 19-year-old Mark Dombroski.\nThe Bermuda Police Service said a news conference would be held later Monday.\nAuthorities and members of Dombroski's family had been searching Bermuda for the young man in a wooded area known as The Arboretum. It was near a sports center where Dombroski was competing as a member of the rugby team at Saint Joseph's University in Philadelphia.\nHe was last seen early Sunday after a night of socializing.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Bermuda police confirm found body of US student",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/bermuda-police-spokesman-authorities-found-body-amid-search-53858610"
}