{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 16:04:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Parents of transgender students appeal to Trump on bathrooms",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fparents-transgender-students-appeal-trump-bathrooms-45503418.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_3189b7a8ced747c89cb857110d0b6a10_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hundreds of parents across the country have called on President Donald Trump to embrace Obama-era protections for transgender students that call for letting them use school bathrooms in accordance with their gender identity.\nIn a letter sent to the president by the Human Rights Campaign late Tuesday, more than 780 parents stressed that \"all students deserve equal access to a safe, welcoming school and a high quality education no matter who they are.\"\nThe call follows a decision by the Trump administration last week to abandon a defense of the guidelines issued by the Obama administration. A court issued an injunction against those guidelines last summer in response to a lawsuit filed by 13 states. President Barack Obama appealed the injunction, but the Trump administration decided to back off from the appeal.\nParents of transgender students say that revoking the right of students to use school bathrooms according to their gender identity amounts to discrimination and it creates a hostile learning environment for transgender students. \"These policies are wrong, they hurt our children, and they violate the principle of equal education,\" the letter said.\nConservative activists firmly oppose the idea, saying it endangers the privacy and safety of other students.\nNewly confirmed Education Secretary Betsy DeVos has not voiced a position on the bathrooms controversy other than to say that she is against discrimination and will support all students.\nDuring the election campaign Trump said that transgender students can use the bathroom they like.",
    "source_domain": "abcnews.go.com",
    "title": "Parents of transgender students appeal to Trump on bathrooms",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/parents-transgender-students-appeal-trump-bathrooms-45503418"
}