{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 02:34:52+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Plus, four women accuse celebrity chef Mario Batali of sexual misconduct.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fhouston-police-standoff-man-accused-threatening-construction-crew-51727808.json",
    "image_url": "http://a.abcnews.com/images/WNT/171211_wn_index1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Houston police standoff with man accused of threatening construction crew\nThe index of other news. The police standoff in Houston. Officers surrounding a home. Nearby schools on lockdown for a time. The suspect accused of threatening a construction crew with a rifle. The man crawling across the lawn as he surrendered 90 minutes later. Tonight, Mario batali is accused of sexual misconduct. A restaurant website reporting four women coming forward with allegations against the celebrity chef spanning a 0-year period. The women including a chef and three former employees claiming batali touched them inappropriately. He is stepping aside from his restaurants and ABC asking him to take a leave from \"The chew\" while it reviews the claims. In a statement, batali saying, quote, I apologize to the people I have mistreated and hurt. And the mystery in space tonight. For the first time, astronomers tracking an interstellar asteroid. It may be up to 600 feet long. Astronomers want to know if it is proof of alien technology. They plan to scan for radio waves this week. It was first detected by astronomers in Hawaii.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Houston police standoff with man accused of threatening construction crew",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/houston-police-standoff-man-accused-threatening-construction-crew-51727808"
}