{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 18:16:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Federer withdraws from Cincinnati; Nadal to become new No. 1",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ffederer-withdraws-cincinnati-nadal-49209780.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_3d71eccea4ea4a029a1a7c28201aff7d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Wimbledon champion Roger Federer withdrew Monday from the Western & Southern Open, which he has won seven times, citing a back injury.\nTournament officials announced Federer's withdrawal on the first full day of matches at the event in Cincinnati.\nThe 19-time major champion said in a statement that he \"tweaked\" his back last week at the Rogers Cup in Montreal, where he lost Sunday to Alexander Zverev in the final.\nThe Swiss star, No. 3 in the ATP Tour rankings, becomes the fifth of the top six players to skip Cincinnati because of injuries. He joins top-ranked Andy Murray, No. 4 Stan Wawrinka, fifth-ranked Novak Djokovic and sixth-ranked Marin Cilic, the defending champion.\nFederer's withdrawal means Rafael Nadal will return to No. 1 when new ATP rankings are released on Aug. 21. The Spaniard will be No. 1 for the first time since July 6, 2014.\nNadal has spent 141 weeks as the men's No. 1 player.\nIn early first-round men's play Monday, Richard Gasquet and wild card Tommy Paul advanced in straight sets. Gasquet eased past qualifier John-Patrick Smith 6-4, 6-4, while Paul beat fellow American Donald Young 6-4, 7-6 (4). Ivo Karlovic needed three sets to knock out Jiri Vesely 6-3, 3-6, 7-5.\nIn women's action, 14th-seeded Petra Kvitova shook off a first-set loss to beat Anett Kontaveit 1-6, 7-6 (2), 6-3, while Beatriz Haddad Maia advanced with a 6-3, 6-2 win over Lauren Davis.",
    "source_domain": "abcnews.go.com",
    "title": "Federer withdraws from Cincinnati; Nadal to become new No. 1",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/federer-withdraws-cincinnati-nadal-49209780"
}