{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 00:32:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fvirginia-set-expand-medicaid-senate-oks-proposal-55546890.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_e9dab237a9814a5e96e891185a58d30a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Republican-controlled Virginia General Assembly gave final approval Wednesday evening to a state budget expanding Medicaid coverage to the state's poor, acting swiftly after the Senate broke years of partisan gridlock on the issue.\nThe House of Delegates voted Wednesday only about an hour after the state Senate voted in favor of expansion. Several Republicans in both chambers joined with Democrats to support Medicaid expansion.\nThe House had previously endorsed expansion, while the Senate had held out in opposition until Wednesday.\nDemocratic Gov. Ralph Northam is expected to sign the budget in coming days that continues the plan. Expanding Medicaid was a key provision of then-President Barack Obama's health care overhaul, and a tally from the Kaiser Family Foundation shows Virginia will become the 33rd state to approve Medicaid expansion.\nSenate passage came by a 23-17 vote with four Republicans joining Democrats for passage. The House quickly followed about an hour later with a lopsided 67-31 final endorsement.\nWednesday's voting marked the end of a more than four-year battle over whether Virginia should expand the publicly funded health care program for the poor. A fight over Medicaid expansion led to a standoff over the state budget in 2014 and again this year.\nVirginia Democrats have pushed for years to expand Medicaid, saying their state should not pass up the roughly $2 billion in extra federal funding the program would bring to the state. Republicans had previously blocked past expansion efforts, saying the long-term costs were unsustainable.\nThose arguments were again replayed in the final hours before Virginia's partisan battle was finally ended.\nSen. Ben Chafin, a Republican lawmaker from Virginia's economically depressed southwest coal country, announced his support for expansion on the Senate floor. He said his rural area needed expansion to help bolster its hospitals and provide care for constituents in need.\n\"I came to the conclusion that no just wasn't the answer anymore,\" Chafin said.\nBut several Republican senators remained strongly opposed, saying Medicaid costs would eventually overwhelm the rest of the state's budget needs for schools and public safety.\n\"This is raising the cost of health care and will do nothing to help the people of Virginia,\" said GOP Sen. Mark Obenshain.\nExpanding Medicaid to cover more low-income families was a key provision of the Affordable Care Act secured by then-President Barack Obama.\nA federal-state collaboration originally meant for poor families and severely disabled people, Medicaid has grown to become the largest government health insurance program, now covering 1 in 5 people. Obama's health care overhaul gave states the option of expanding Medicaid to cover more low-income adults.\nThe GOP-controlled General Assembly's support for Medicaid comes despite Trump administration rejections.\nPresident Donald Trump has vigorously sought to negate his predecessor's health law. Yet ironically, his administration's embrace of work requirements for low-income people on Medicaid prompted lawmakers in some conservative states to resurrect plans to expand health care for the poor.\nLast year, Virginia saw its state legislature reshaped by an anti-Trump wave as Democrats made unexpectedly large gains in the state House. And a failure by the GOP-led Congress to repeal and replace the health law helped spur several of Virginia's Republican state legislators to flip positions.\nDemocrats campaigned heavily on expanding Medicaid last year and some House Republicans were eager to take the issue off the table before next year's election, when both House and Senate seats are up.",
    "source_domain": "abcnews.go.com",
    "title": "Gridlock over: Virginia lawmakers approve Medicaid expansion",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/wireStory/virginia-set-expand-medicaid-senate-oks-proposal-55546890"
}