{
    "authors": [
        "Abc News",
        "More Carolyn"
    ],
    "date_download": "2017-01-02 17:58:51+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "For the second week in a row, Queen Elizabeth II was a no-show at church due to a bad cold, sparking increased concerns about her health.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fqueen-elizabeth-ii-misses-church-raising-health-concerns%2Fstory%3Fid%3D44509709.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/GTY-queen-elizabeth-II-jt-161225_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For the second week in a row, Queen Elizabeth II was a no-show at church with a bad cold that forced her to skip the New Year’s Day holiday service, according to the palace.\n“The Queen does not yet feel ready to attend church as she is still recuperating from a heavy cold,” Buckingham Palace said in a statement Sunday.\nThe Queen also missed the royal family’s traditional Christmas service at St. Mary Magdalene Church on the Sandringham estate due to a cold. That was reportedly the first time in 28 years the Queen did not attend the Christmas service. On New Years Day, he stayed inside again prompting increased concerns about her health.\nJoe Giddens/AP Photo\nPrincess Anne, the monarch’s daughter, reassured well-wishers who braved the cold, rainy weather Sunday outside the church that the queen was on the mend.\nQueen Elizabeth was last seen more than two weeks ago to pre-record her annual Christmas message. Her prolonged absence since has heightened speculation and concern about the severity and extent of her illness.\nThe Queen: \"I wish you all a very happy Christmas\" #QueensSpeech pic.twitter.com/KHn3CWD1e4 — The Royal Family (@RoyalFamily) December 25, 2016\nRoyal sources are saying, however, that the palace is simply being cautious and practical given the cold weather, and that the queen is said to be up and about working inside the warmth of her home.\n“We’re talking about a 90-year-old woman with a lingering cold,” ABC News contributor on the royal family, Victoria Murphy, said. “She didn’t want to be standing inside a cold church for up to an hour braving that terrible rain and didn’t want to risk getting worse and she was advised by her doctors to not take the risk.”\nBefore Christmas, the Queen and Prince Philip postponed their trip to Sandringham by 24 hours because they were ill. They later elected to take a helicopter instead of boarding the royal train in London as they typically do each year.\nPrince Philip, who was also suffering from a cold, according to the palace, was well enough to make the traditional walk to church with the rest of the family on Christmas while the queen remained at home.\nThe public will have to wait one more week for a glimpse of their monarch. Her next scheduled public appearance is at church next Sunday, if she's well enough to attend.",
    "source_domain": "abcnews.go.com",
    "title": "Queen Elizabeth II Misses Church Again, Raising Health Concerns",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/queen-elizabeth-ii-misses-church-raising-health-concerns/story?id=44509709"
}