{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 17:03:49+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Gorsuch asks his first questions from Supreme Court bench",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fgorsuch-asks-questions-supreme-court-bench-46842342.json",
    "image_url": "http://a.abcnews.com/images/Politics/WireAP_391dff0554ef4bbda849c734a43517f5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Supreme Court Justice Neil Gorsuch wasn't shy Monday about making his voice heard as he took his seat on the bench for the first time to hear arguments.\nThe new justice took less than 15 minutes before asking questions during an employment discrimination case. Gorsuch and his colleagues were hearing cases for the first time since President Donald Trump's pick was sworn in April 10.\nThe case before the justices involved a technical issue about the process for a federal worker to appeal his discrimination claim. Gorsuch asked the worker's lawyer Christopher Landau four questions in a row about the wording of a statute, saying he was \"sorry for taking up so much time.\"\nGorsuch later sparred with Justice Department lawyer Brian Fletcher over the meaning of the Civil Service Reform Act, sticking to his reputation for focusing on the text of the law.\n\"Wouldn't it be a lot easier if we just followed the plain text of the statute,\" Gorsuch asked.\nIt was the first of three hour-long arguments the high court was set to hear on Monday. The court is back to its full contingent of nine members after being short-handed since Justice Antonin Scalia's death more than 14 months ago.\nThe session started with Chief Justice John Roberts welcoming Gorsuch and wishing him \"a long and happy career in our common calling.\"\nGorsuch responded briefly to thank Roberts for the \"warm welcome.\"\nGorsuch took his seat at the end of the bench next to Justice Sonia Sotomayor, with the two sharing a laugh together before arguments began.",
    "source_domain": "abcnews.go.com",
    "title": "Gorsuch asks his first questions from Supreme Court bench",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/gorsuch-asks-questions-supreme-court-bench-46842342"
}