{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:35:42+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "A Massachusetts mother is speaking out after her child's preschool issued a restriction on kids using the words \"best friend.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fmom-speaks-preschools-decision-dissuade-students-term-best%2Fstory%3Fid%3D54695395.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/children-gty-02-jpo-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Is it bad to have a best friend?\nOne Massachusetts mother is speaking out after her child's preschool issued a restriction on kids using the term.\nChristine Hartwell told ABC News that in early March, her 4-year-old daughter Julia came home from Pentucket Workshop Preschool in Georgetown and informed her that the teacher told her that she is no longer allowed to use the term \"best friend.\"\nUnaware that this was a new policy, Hartwell said that she spent several days reaching out to Julia's school to find out what had ensued.\n\"I spoke to the assistant director and I said, 'My daughter is very upset; before I address it with her, I need to know in the context of what happened, what was said and how did it happen,'\" Hartwell recalled.\nHartwell said that the assistant director and the director of the preschool told her that Julia used the term \"best friend\" in a loving way, but that it can be \"exclusive and hurt other children,\" which is why they asked her to refrain from saying it again.\nSTOCK PHOTO/Getty Images\n\"I said, 'Do you see [that with] this policy, this all-inclusive philosophy, my child was excluded?'\" Hartwell said. \"My child was shamed. My child was made to feel sad. My child was made to feel like she did something wrong.\"\nThe preschool allegedly told Hartwell that Julia would be persuaded to not use the term \"best friend\" while she's amongst a larger group of children. But Hartwell argued that her daughter is only 4 years old, and using the words \"best friend\" is something that she does often.\n\"She calls so many children on a daily basis her best friend,\" Hartwell explained. \"I'm her 'best mom,' There's a 'best teacher.' This is developmentally appropriate langauge that children use. She's 4. For many kids, their hearts are open.\"\nShe went on, \"I don't want my daughter to think or feel that is a bad thing. We have been teaching her for four years to be inclusive, to be loving, to be kind. She's so social. She's going to say this again. I don't understand how to 'police it' or how to ramify it to tell them to stop because this is what 4-year-olds do.\"\nRachel Simmons, leadership development specialist at the Wurtele Center for Leadership at Smith College in Massachusetts and author of “Odd Girl Out,” said that you cannot make a child's behavior change by making a word go away.\n\"It might have been easier for this school just to talk about what a good healthy best friend looks like instead of telling kids not do it at all,\" Simmons said in a statement to ABC News. \"By telling kids not say that word, it is probably going to make kids worry more about who their best friend is or isn't or wanting to have one just so they can be part of something taboo.\"\nSimmons added, \"What this school is doing ... is misguided because it is focusing on a word and not the behavior. And it is in the behavior where our kids really have the potential to change.\"\nAfter speaking with school officials, Hartwell said she suggested having an open forum or a larger parent-teacher conference to discuss new rule of placing a ban on the term \"best friend.\"\nHartwell alleges that the school declined to participate or allow her to utilize the parent email list to organize such a meeting.\n\"If this is their philosophy, make it known, make it official and or have a discussion with parents,\" Hartwell said. \"Let them say their piece. You are dealing with their children.\"\nPentucket Workshop Preschool declined ABC News' request for a comment.\nIn a letter addressed to Hartwell, the school maintained its decision to \"dissuade\" children from using the term \"best friend\" at their facility. Hartwell shared the letter with ABC News.\n\"It has been our experience (which spans decades) that the use of the term 'best friend' even when used in a loving way, can lead other children to feel excluded. We feel that instead of encouraging children to have best friends, which can ultimately lead to the ormation of 'cliques' and 'outsiders,' it is much more developmentally helpful to encourage children to have a broader group of friends, and foster inclusion at this particular age. As part of our philosophy we do encourage the children to have a broad group of friends.\"\nHartwell said she has since pulled her child out of the preschool.",
    "source_domain": "abcnews.go.com",
    "title": "Mom speaks out on preschool's decision to 'dissuade' students from using term 'best friend'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Family/mom-speaks-preschools-decision-dissuade-students-term-best/story?id=54695395"
}