{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:52:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Authorities suspended operations at two popular tourist spots, including the lobby bar at Playa Del Carmen's Iberostar Paraiso Resort, where Abbey Conner, a 20-year-old from Wisconsin, drowned after consuming alcohol.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fillicit-alcohol-seized-popular-mexico-restaurants-clubs-49201828.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_janis_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Illicit alcohol seized at popular Mexico restaurants, clubs\nNow to that major seizure of illicit alcohol in Mexico suspending operations at spots and taking in alcohol from places including that resort where a 20-year-old American tourist died and Linzie Janis has new developments. Good morning, Linzie. Reporter: When 20-year-old abbey conner drowned at that resort this past January her family urged authorities there to launch an investigation into contaminated booze. Now, Mexico apparently taking massive action in this latest seizure taking 10,000 gallons from just one company that supplies those resorts. Overnight, Mexican authorities sweeping through 31 of the most popular nightclubs and restaurants in cancun and playa del Carmen suspending operations at two of them after unsanitary alcohol was found. One suspended the lobby bar at the eye beer resort where abbey conner drowned after she and her brother consumed shots in the hotel pool. Last month Austin spoke with ABC's gio Benitez about the moments before he blacked out. The bartender pours out a line of shots and they come all the way down and I take one and everyone else does. And the last thing I remember was just like we are right now sitting here talking and lights went out and I woke up in the ambulance. So you went from fine to blacked out. Yep. In seconds. Like I said I felt completely Normal. Reporter: A guest found both of them floating face down in the pool. Abbey rushed to the hospital but it was too late. The conner family wondered if tainted alcohol, a toxic mix of cheap ingredients could be partially to blame. Other families started to come forward recalling how they suddenly blacked out after a few drinks at various resorts. Mexican officials say they've seized 1.4 million gallons of tainted alcohol from Mexican businesses including resorts, clubs, bars, warehouses and manufacturers in the past seven years. This video shows one of the largest seizures in 2015. 260,000 gallons taken from a warehouse in just one day. This morning abbey's mom telling the associated press this is awesome and huge and said there's a lot that needs to be cleaned up there and looked into further so that family is very pleased with this latest. Bless that family for wanting to help other families so something like this doesn't happen to them. So something good comes out of it. Coming up a new rip current warning after dozens of deaths\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Illicit alcohol seized at popular Mexico restaurants, clubs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/illicit-alcohol-seized-popular-mexico-restaurants-clubs-49201828"
}