{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 14:18:41+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The Oklahoma couple will be renewing their vows this summer.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FFamily%2Fvideo%2Fcouple-redo-wedding-wife-amnesia-give-memory-56361813.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_spencer3_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Couple to redo wedding after wife gets amnesia to 'give her that memory'\nday. Gig We're going T continue with ummerf lo. A tragic accident turned a couple's life side down causing her toorget the man she was mar to for 12 ye he refused to G up on their loved now they're renewing their wedding vows and Thi is their story. Is morning saying \"I do\" again. Jeff and Angela Hartung renewingvows five years after S developed sia-like symptoms th a tragic like sptom robbing her of eve memory she had. Afte years of marriage she hit B a car sufng an acute traumatic brain injury. The pictures that I've seen show thaty face wt through the windshield. She didn't see H and he didn't -- his lights weren't on and idn't see her and, you , she was struckl speed. Reporter: Wg up one month later butver a decade O her memory gone. Not evenecognizing her hband was by here every day waiting for her to wakeup. Well, she WOU look at me and ask why I was in theroom. She just learned to trust became I was there E day all Y. The siton could have been Y orter: Angela awo not rememberinr father and her first husband both passed away. The mother of fourhinking her teenage children weretill lers. I'm sad that I don remember raising the children. Orter: But Jeff he opped at nothio make her falln love W him all over again. I felt like I was dating her all overagain. It is N. Itfun dating again he's just anwesome man. Reporter:tors telling thehartungs her memory L was much like amnesia and she would ly never get those memories back. But that hasn't stopped the hags from making new memories. Wing their vows in front of their closestrids and families in ntral park, a memoryther of them will ever forget isn't that an incredible story. H a Goodman. She didn't recognize H but learned to trust him because he was by her sidvery single day through it all. Ang story. K you. All right, CING up, we are\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Couple to redo wedding after wife gets amnesia to 'give her that memory'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Family/video/couple-redo-wedding-wife-amnesia-give-memory-56361813"
}