{
    "authors": [
        "Abc News",
        "More Veronica"
    ],
    "date_download": "2017-08-14 19:46:50+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "VP Mike Pence: US not going to stand by while Venezuela 'crumbles'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvp-mike-pence-us-stand-venezuela-crumbles%2Fstory%3Fid%3D49205354.json",
    "image_url": "http://a.abcnews.com/images/Politics/mike-pence-columbia-epa-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Vice President Mike Pence, speaking from Colombia, emphasized today the U.S. has \"many options\" when it comes to dealing with the crisis in Venezuela.\n\"What's appropriate is for the United States of America to make it clear that we have, as the president said, many options on Venezuela,\" Pence said in an interview with NBC News. \"We're simply not going to tolerate seeing Venezuela collapse into dictatorship.\"\n\"President Trump has made it clear - we’re simply not going to stand by while Venezuela crumbles,\" he continued.\nVenezuela has recently been rocked by violent protests and political unrest. In a controversial vote in July, Venezuelan President Nicolas Maduro installed a constitutional assembly of his supporters, with the power to rewrite the country's constitution.\nTrump's national security adviser H.R. McMaster later labeled Maduro a \"dictator\" and called into question the freedom of the country's elections. Treasury Secretary Steve Mnuchin also announced economic sanctions targeting Maduro's \"regime.\"\nAccording to The Associated Press, more than 120 people have died during four months of protests.\nPresident Donald Trump told reporters last Friday at his golf club in Bedminster, New Jersey, that he's not going to rule out military intervention in the country.\n\"We have many options for Venezuela. And, by the way, I'm not going to rule out a military option,\" Trump said.\nAfter meeting with Venezuelan families and local faith leaders Monday morning in Cartagena, Colombia, Pence told reporters traveling with him in Latin America that the U.S. stands with the families fleeing Venezuela.\nPence also stressed that the U.S. is “absolutely determined to bring the full measure of American economic and diplomatic power to bear until we see democracy restored in Venezuela.”\nThe vice president argued that a failed state in Venezuela “threatens” U.S. security and prosperity and would lead to an increase of illegal immigration on the southern border.\nABC News' Adam Kelsey contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "VP Mike Pence: US not going to stand by while Venezuela 'crumbles'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/vp-mike-pence-us-stand-venezuela-crumbles/story?id=49205354"
}