{
    "authors": [
        "Abc News",
        "More Meghan"
    ],
    "date_download": "2018-05-30 18:21:02+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Police have released the name and picture of someone believed to be connected.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fhearts-shattered-sheriff-pleads-manhunt-person-interest-deputys%2Fstory%3Fid%3D55535099.json",
    "image_url": "https://abcnews.go.com/US/hearts-shattered-sheriff-pleads-manhunt-person-interest-deputys/story?id=55535099",
    "language": "en",
    "localpath": null,
    "maintext": "A Tennessee sheriff made an emotional appeal for the public's help in finding a person of interest believed to be connected to the shooting death of a sheriff's deputy during a traffic stop.\n\"Our hearts shattered with this,\" Dixon County Sheriff Joe Bledsoe said at a news conference this afternoon.\nThe deputy who was killed has not yet been publicly identified by the sheriff's department, but Bledsoe said he was \"one of our best deputies.\"\n\"He's one of the guys that puts it on the line every day to keep our community safe,\" Bledsoe said of the slain deputy.\nThe Tennessee Bureau of Investigation has released the name and a photo of the person of interest in the case, whom they have identified as Steven Wiggins.\nThe agency wrote on Twitter that Wiggins is \"believed to be armed and dangerous,\" and called for the public's help to find him.\nNEW PICTURE: Here's a more recent photograph of Steven Wiggins, from a 2017 arrest in Williamson County. pic.twitter.com/qDSMgKBNMN — TBI (@TBInvestigation) May 30, 2018\nBledsoe said that the deputy came into contact with Wiggins after he responded to a call about a suspicious vehicle.\nWiggins has been added to the state's Top 10 Most Wanted list along with a $2,500 reward for information.\nOn the Top 10 listing, it states that he is wanted for aggravated assault and theft, while also being a person of interest in the killing of the unidentified Dickson County deputy.\nWe've also added Wiggins to our Top 10 Most Wanted list. There is now a reward of up to $2,500 for information leading to his arrest. pic.twitter.com/vnERWldSXQ — TBI (@TBInvestigation) May 30, 2018\nTBI records show that Wiggins is 31 years old and has previously been arrested for multiple cases of assault and domestic assault, as well as cases involving aggravated kidnapping, false imprisonment, leaving the scene of an accident, unlawful possession of a weapon and theft.\nBledsoe said that a member of the deputy's family has been told of his death, and they are \"devastated, just like we are.\"\n\"Even though our hearts [are] broken, we're driven right now with a focus and resolve that this person is captured,\" Bledsoe said.",
    "source_domain": "abcnews.go.com",
    "title": "'Our hearts shattered': Sheriff pleads for help in manhunt for person of interest in deputy's death",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/hearts-shattered-sheriff-pleads-manhunt-person-interest-deputys/story?id=55535099"
}