{
    "authors": [
        "Abc News",
        "Joshua Hoyos",
        "More Victor",
        "More Joshua"
    ],
    "date_download": "2018-05-30 21:26:24+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Hurricane Maria's true death toll in Puerto Rico may be 70 times higher.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fsan-juan-mayor-deaths-hurricane-maria-haunt%2Fstory%3Fid%3D55534319.json",
    "image_url": "https://s.abcnews.com/images/US/puerto-rico-hurricane-season-02-ap-mt-180526_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "San Juan mayor Carmen Yulin Cruz called Tuesday’s announcement of new death toll estimates in Puerto Rico following Hurricane Maria “a day of collective mourning” for the weather-battered island.\nInterested in ? Add as an interest to stay up to date on the latest news, video, and analysis from ABC News. Add Interest\n“It was a very painful day… but it came to put a number on what we already know – that the total death toll was not correct and that the government was not telling the truth,” Yulin Cruz told ABC News.\nResearchers at the Harvard T.H. Chan School of Public Health estimated that between Sept. 20 and Dec. 31, there were 4,645 \"excess deaths,\" according to the report in the New England Journal of Medicine.\nThe researchers say the death toll may be more than 70 times the official estimate. Puerto Rico's official government death toll currently stands at 64.\n“This number [is] for “when government don’t do what they are supposed to do,” the mayor said as she pointed to a hat bearing the numbers 4,645 as a reminder of the hurricane’s deadly toll. (flipped this sentence around).\n“It isn’t the smiles of the ones I got to that will haunt me forever, it is the pain of those we didn’t get to that will stick with me forever,” an emotional Yulin Cruz said.\nAlvin Baez/Reuters, FILE\nThe Harvard report relied on household surveys to generate the estimate, which researchers said had a margin of error of plus or minus 3,852, meaning the actual number of deaths could be as low as 793 or as high as 8,498. However. Researchers said the likely figure is about 5,000. The mayor of Puerto Rico’s capital has been a fierce critic of the Trump administration. In the days following Maria, Trump visited the island and said “every death is a horror.\n“But if you look at a real catastrophe like Katrina, and you look at the tremendous hundreds and hundreds and hundreds of people that died, and you look at what happened here,” he continued, “sixteen versus literally thousands of people.” “Not one tweet from a man that tweets about the sunrise…to say, people of Puerto Rico, we are sorry, “ a frustrated Yulin Cruz said.\n“Don’t accept the blame, because Lord knows he is incapable of doing,” she said of Trump. “But just say sorry, I’m sorry that lives were lost.”\nCarlos Garcia Rawlins/Reuters\nThe Atlantic hurricane season starts on Friday – something that Yulin Cruz says the island is not equipped to handle again.\n“Puerto Rico is not prepared…we’ve learned about the things we fell short and we are in a better position to handle them,” she said. “We hope that we do not have to handle them anymore,” she said.\nHer “4,645“ hat is just one of the small reminders she keeps more than eight months after Maria.\n“I wrote with chalk on my wall ‘NEVER AGAIN’ and the number 4,645,” she said.\n“These are people – grandparents and mothers and children that will never be able to live because others weren’t able to help them survive.”",
    "source_domain": "abcnews.go.com",
    "title": "San Juan mayor says that deaths following Hurricane Maria still haunt her",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/san-juan-mayor-deaths-hurricane-maria-haunt/story?id=55534319"
}