{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:14:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "US to hold UN human rights meeting _ after deal with Russia",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fus-hold-human-rights-meeting-deal-russia-46851038.json",
    "image_url": "http://abcnews.go.com/US/wireStory/us-hold-human-rights-meeting-deal-russia-46851038",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. Ambassador Nikki Haley was determined to hold a Security Council meeting on the importance of human rights to international peace and security and it will happen on Tuesday — but only after the U.S. addressed objections from Russia, China and other council members.\nHaley told reporters at the start of the U.S. presidency of the U.N.'s most powerful body in early April that she wanted a meeting that didn't \"point fingers at anyone\" but looked at underlying human rights issues that lead to conflict and unrest.\nAs examples, she cited student protests against Syrian President Bashar Assad that sparked the six-year conflict, the self-immolation of a Tunisian fruit vendor who was harassed by police and not able to work that sparked nationwide demonstrations, and massive rights violations in North Korea.\nBut Russia's deputy U.N. ambassador Petr Iliichev took issue with the premise of the proposed debate saying: \"A general statement that international peace and security are threatened by human rights violations is not true.\"\nHe also argued that other U.N. bodies including the Geneva-based Human Rights Council and the General Assembly already deal with human rights. \"Why are we taking everything to the Security Council? Then those bodies should be dismantled,\" Iliichev said.\nHaley said the U.S. wanted the debate on April 18, with Secretary-General Antonio Guterres briefing.\nBut it wasn't on the Security Council \"program of work\" for the month because that needs unanimous agreement of all 15 council members, which the U.S. didn't have.\nThat set the stage for two weeks of behind the scenes discussions to see how the U.S. could get a meeting.\nThe United States initially wanted the debate under a new agenda item for the council entitled \"Human Rights and International Peace and Security\" — which would mean that item could be raised again and again in the council.\nThe U.S. Mission circulated a \"concept paper\" saying this would give council members the opportunity to reflect on the way the council addresses human rights in its work \"for the first time.\"\nSince the late 1980s, the Security Council has focused on human rights issues as drivers in numerous situations, and it has authorized human rights experts and monitors for most of the U.N. peacekeeping and political missions it has authorized. The council, however, has never had a so-called \"thematic debate\" on human rights related to the Security Council's main mission of promoting international peace and security.\nIn order for the U.S. to get its new agenda item approved it would have had to hold a procedural vote at the start of Tuesday's meeting and get nine \"yes\" votes to go ahead. But council diplomats said it appeared the U.S. might have only eight \"yes\" votes and seven \"no\" votes — Russia, China, Egypt, Bolivia, Ethiopia, Khazakhstan and possibly Senegal.\nSo the United States agreed to a compromise.\nIn a note on Tuesday's meeting, the U.S. Mission to the United Nations said Monday it is being held under an old agenda item: \"Maintenance of international peace and security,\" with a focus on \"human rights and prevention of armed conflict.\"\nThat means no procedural vote is required and all 15 council members are now on board with the debate.",
    "source_domain": "abcnews.go.com",
    "title": "US to hold UN human rights meeting _ after deal with Russia",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/us-hold-human-rights-meeting-deal-russia-46851038"
}