{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 06:57:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Preds beat Chicago 3-2, push Hawks to brink of elimination",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fpreds-beat-chicago-push-hawks-brink-elimination-46855038.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_87685b9c1f3f4040821ba569727d42cb_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Nashville Predators are at a point they've never been before in franchise history, and now they have a chance to keep their first-round series from going back to Chicago.\nThey can thank a 20-year-old playing the fourth postseason game of his career for putting them in that position.\nKevin Fiala scored on a backhander 16:44 into overtime , and the Predators rallied from a 2-0 deficit in the third period to push the Blackhawks to the brink of elimination with a 3-2 victory early Tuesday morning in Game 3 of the first-round series.\n\"That's good for him, a young kid in a big situation like that,\" Nashville coach Peter Laviolette said of Fiala scoring his second career playoff goal. \"I thought he handled it well.\"\nThe Predators have never won the first three games of any playoff series, and they got here by outscoring the Western Conference's No. 1 seed 9-2. Even with the Blackhawks finally ending their scoring drought in this series, it wasn't enough as Filip Forsberg scored twice in the third period to force overtime.\n\"Obviously, we want to close it out at home, but we've got to focus just the same way we focused on this one and prepare the same,\" Nashville goaltender Pekka Rinne said.\nRinne made 34 saves, even with his franchise playoff scoreless streak ending early in the second period at 141 minutes, 5 seconds.\nGame 4 is Thursday night in Nashville.\nDennis Rasmussen and Patrick Kane each scored the first goals this series for Chicago.\nBut the Blackhawks, winners of three Stanley Cup titles in the past seven years, now trail 0-3 for the first time since the 2011 quarterfinals as a No. 8 seed. They lost that series in seven games to Vancouver.\n\"That was a long time ago,\" Chicago coach Joel Quenneville said.\nAsked if this group can bounce back, Quenneville had a short answer: \"We're going to have to.\"\nChicago captain Jonathan Toews called it a very disappointing loss. His personal goal drought is now 12 straight postseason games, though he did have an assist.\n\"We got to find a way to put pressure on them, got to make them realize that winning a fourth game is the toughest for any team in any series,\" Toews said.\nFiala finally converted on his third chance in overtime. Crawford got a glove on a puck nearly midway through the extra period off Fiala's shot from the high slot. Crawford also got his left toe on a shot from Fiala in the slot with 6:00 left.\nThen James Neal found Fiala with a pass, and he beat Crawford to send fans home shortly after midnight local time.\n\"It was a great save by Crawford,\" Fiala said of the toe save by the Chicago goalie. \"I was pretty angry, I could have finished it there, but never mind, we won.\"\nThe Predators brought out the star power with country singer Carrie Underwood, married to Nashville captain Mike Fisher, to sing the national anthem. Five catfish also were tossed onto the ice before the puck dropped and combined with a late start for a very loud standing-room only crowd of 17,204.\nNashville outshot Chicago 49-36.\nRinne's shutout streak ended when Rasmussen scored the first postseason goal of his career 65 seconds into the second period. He beat Rinne glove-side off an assist from Marcus Kruger. The goal also snapped a scoreless skid for Chicago that spanned 177:45 back to their first-round loss to St. Louis last postseason.\nThen the Blackhawks quickly made it a 2-0 lead with a power-play goal by Kane. He scored the 50th postseason goal of his career with a wrister from the right circle at 11:15 of the second, taking advantage of Marcus Kruger standing in front of Rinne.\nForsberg started the rally. He scored on a wrister hitting the puck in the air past Crawford, who was caught having turned around in the crease, at 4:24. Blackhawks forward Richard Panik argued the puck went off the netting, but the play was called a good goal after a review.\n\"It went off the shoulder and then off the glass and then straight in, so I didn't really see why they were talking,\" Forsberg said.\nThen Forsberg tied it up at 14:08 with a wrister off Ryan Ellis' shot from the point. Officials also reviewed for Arvidsson interfering with Crawford outside the crease before ruling another good goal.\n\"I don't know,\" Crawford said when asked about interference. \"Game's over.\"\nNOTES: This is Nashville's third straight overtime win at home in the playoffs. The Predators won Games 4 and 6 versus San Jose in the second round last year. ... Kane became the fourth Chicago player with 50 career goals, joining Bobby Hull, Denis Savard and Stan Mikita. This was Kane's 126th playoff game.\n———\nMore AP NHL: https://apnews.com/tag/NHLhockey",
    "source_domain": "abcnews.go.com",
    "title": "Preds beat Chicago 3-2, push Hawks to brink of elimination",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/preds-beat-chicago-push-hawks-brink-elimination-46855038"
}