{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 10:39:34+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Asian investors embrace bitcoin, but regulators are wary",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fasian-investors-embrace-bitcoin-regulators-wary-51712527.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_2087202e05814402a577d911323d636f_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The weekend launch of a U.S. futures contract for bitcoin reflects widespread acceptance of the virtual currency, especially among investors in Asia, though regulators are wary.\nJapan and South Korea are among the world's top five markets for bitcoin trading, according to sites that track trading volume by currency. Here's a glance at the digital currency's rise in some of the region's major markets:\n———\nJAPAN:\nJapan was home to one of the earliest bitcoin communities, but it was started by expatriate residents and kept a low profile. Until a few years ago, bitcoin and other virtual currencies were left alone by regulators.\nFollowing the failure of a bitcoin exchange called Mt. Gox, new laws were enacted to regulate bitcoin and other virtual currencies. Japan is the only major advanced economy with a licensing regime for digital currency intermediaries such as exchanges and payment providers.\nThat has helped make Japan the world's biggest market for speculative virtual currency trading, said Thomas Glucksmann, Hong Kong-based head of marketing for Gatecoin, a virtual currency exchange.\n\"There was very little interest back than at all and now it's a complete 360,\" said Glucksmann. \"It's the biggest market, everybody's talking about it.\"\nBig Japanese banks have gotten involved, investing in bitcoin exchanges or letting them open bank accounts while developing their own related services. Some retailers accept payment in bitcoin.\nMany Japanese are familiar with currency trading since Japan is the world's biggest retail foreign exchange market.\n\"You have people like hairdressers and housewives, people like that investing in crypto, in addition to the bigger players in Japan,\" said Glucksmann, who used to work at a bitcoin exchange in Japan. \"So the regulations have helped to fuel a lot of the legitimacy in the Japanese market.\"\n———\nSOUTH KOREA:\nAbout a year and half ago, South Korea emerged as a very large market for speculative trading activities thanks to investors' high risk appetite and fears of missing out.\nNow, just as the government prepares to regulate virtual currencies, big financial institutions are starting to get in on the action. Shinhan Bank is planning to offer virtual currency services like a bitcoin wallet,\nWorried over risks of speculative trading, in September South Korea banned initial coin offerings, or raising money through bitcoin or other virtual currencies.\nSenior officials at South Korea's financial watchdog have compared speculative trading in bitcoin to a \"Ponzi scheme\" and say they are mulling a ban.\n\"We will not let financial institutions handle transactions related to virtual currencies,\" said Kim Yongbeom, vice chairman at Financial Services Commission, according to a media pool report Monday. \"The price of virtual currencies rises because of the expectation that the next person will buy it at the desired price and this is quite like a Ponzi scheme.\"\nChairman Choi Jong-gu said one option is a total ban on virtual currencies, which would require revising existing legislation or enacting new laws.\nStill, bitcoin sells for a 20-30 percent premium in South Korean compared to other places, and this has spurred offshore trading to take advantage of arbitrage opportunities as South Koreans buy bitcoin overseas and sell them back home.\n———\nCHINA:\nFor a brief time, China dominated bitcoin trading, at one point reportedly accounting for as much as 90 percent of volume. That dried up after Beijing tightened controls.\nThe lively bitcoin market had been set up by bitcoin miners, who had set up data centers taking advantage of China's cheap electricity and hardware to handle the intensive computing processes needed to \"mine\" new bitcoin.\nChina started cracked down on such activities last year just as the price of bitcoin began to surge. In September, regulators ordered all exchanges to shut down, banning initial coin offerings.\nChina's bitcoin exchanges have since migrated overseas or shifted to over-the-counter trading where exchanges match buyers and sellers who then connect through chat apps like Telegram. Payment is made in cash or through bank transfers and the exchange collects a fee.\nSome mainland China exchanges have refocused their efforts on their Hong Kong operations, said Leo Weese, president of the Bitcoin Association of Hong Kong. He estimates there are about 10,000 bitcoin users in the Asian financial hub, including 1,000-2,000 active investors who have significant holdings or work for bitcoin related companies.\nWeese estimates that bitcoin prices are 5-8 percent higher in mainland China than Hong Kong. Speculators who can get around China's strict capital controls to profit from the price difference are driving some trading activity in the city, Weese said.\n\"For them it's a way to make money,\" he said. \"They can buy the bitcoin in Hong Kong cheaply and they can sell them at a premium in China.\"\n———\nSOUTHEAST ASIA:\nBitcoin's rising popularity in Indonesia has alarmed the country's central bank, which said last week it would ban it as a payment method next year.\nBank Indonesia spokesman Agusman Zainal said more a \"assertive rule\" on virtual currencies is planned.\nHe said the bank is concerned bitcoin might be used for fraud or other illegal activities like terrorism, money laundering, prostitution, drug trafficking.\n\"In the context of the payment system, bitcoin is not a valid means of payment,\" Zainal said. \"The reason for prohibiting is in order to implement prudential principles, safeguard business competition, risk control and consumer protection.\"\n————\nAP Writers Niniek Karmini in Jakarta and Youkyung Lee in Seoul contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Asian investors embrace bitcoin, but regulators are wary",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/asian-investors-embrace-bitcoin-regulators-wary-51712527"
}