{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 16:17:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Keiynan Lonsdale talks his new track \"Lay It on Me.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fvideo%2Fflash-star-keiynan-lonsdale-music-career-49207426.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/170614_gostream_flashmusic1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'The Flash' star Keiynan Lonsdale on his music career\nThat and in music now because like a thin multi talented multi accident checked their music. It's amazing even teams that had an assault start because I'm always and so to find out with actors who. Are also talented and and other mediums. Where you a music person firstly an actor first this kind of like jell together. Let's that it dancing slipped since those two. That's assessed by Jackson's of that sort of stuck him in the the dean of fully and by the time I was like eleven I thought to write songs but I couldn't sing. It's that the. Like ago I was so bad that my moments like units who kicked it. It wasn't just like a team. Around that age that are this defined my voice and in high school excited to be on the crosses. The really had his view myself as like. The creative lesson that I mean I view room is creative with it they note. The yes that is negated what I have no limits. It doesn't matter like. I do this right now it is my job doesn't mean like there's been an intimate nights doing this so the next dale that we can do something else though. If I could Payne had hit from yeah I really despondent create as much as possible with that's what makes field. Most like me. Yes your most recent single land on it yet what he tells of about it what yes. Actually. I received the music from the has he's got Sweden let's really young talented. Guy and they were looking for a song riders. And vocalist and I submitted mighty lyrics and and I can think they would go for it doesn't so it's I imagine myself being you know I think it and they love what I did and then. That was that it years the and Hugh Leon finally in got a lot of traction. Los that it performed actually. In the Bronx you say that you and your music festival however that it was the musical elements yet it was it was really cool. Isn't that I've never that's those the first time performing a song. And then there were people of the front thing in the lyrics back to me. That's my first ever experience of that costs you know it's not gonna trip it is the Israeli troop the F that's a just felt like a joke like. Because I saw one guy and he CEOs like that's so funny that he knows the lyrics and then all of a sudden like everyone in the front like new with that it. And is this like. Is that it's very surreal because. Yeah in heaven like righting of according forbidden in. 910 years that I mean take music seriously. Through the just now that stuff is this news. Prequel with it's now evident that spaces. Yes it's very beautiful to have that responds. And suppress these you said a minute ago that he. Weren't able to sing when he first started as your voices in the grade boys. To see you basically just kind of home that that you were able to the what I was like I was. Recording in my room just under us every day trying to rights owns. Associate to sing in front of people like it is here and mom it's enough to shake you definitely don't mean if that does the. It was honest I remember even there was a time when like someone maybe sing on the bus notably twelve. And an era it laughed like and I couldn't basically you know younger jaish. So I was looted time. To be honest. Exaggeration and then think Jessica. I knew that I wanted to scene and so I said why no it then it now but it with a century and it just kept listening to myself back of an immigrant like that he. Kentucky here in like the little control. And he's got soundly influences. Of Seko with Michael Jackson. So. Frank ocean. Inspired by les. Billion if at that I guess. I could feel the influence is to in the dress that fit this nice he. Once I discovered him which was really is now works I was just like well you can just do whatever you want them makes life way more interest. Literally have no limits and love that. That's that's the very bow yes. What's it's that's the case for everyone in that it took mere really it actually and it took me to this year to really understand. And that's very helpful with this music the yes of the stuff that and that I am doing now it's even differently the is in the pop Rome. But the message is very. Very simple answers about love and freedom being limitless. Not just that the use for everyone's. Hopefully. I think there's a shift in the world right now people's values slowly. Yeah. At a changing in India was dying to understand and appreciate. Each other little boy now sells animals. That's what it's. Is that what happened ease of use are an appreciation and knows this year's what happened more come poignant music and and doing double time you know what I had to become comfortable with myself at. You know my whole life I just been working so high trying to you like the best of trying. You know because being successful to meet men significance. Like those that the most successfully and more significant hand in the world. But but then that was like driving into the ground. You know because it does I think to everywhere. And then so I decided well you know why I'm like afraid to leave my house in Weatherford to do anything friends and quietly in. I should just go out and have a life and really benches and say yes to opportunities. And I did did that purely for myself and what came of that with the kind of inspiration. It's the more life by live. The more I'm able to then write about it and. Just feel more secure interests that want to my head to Iowa and that what it works that I couldn't hold off people very well you could that's the secret from thing and that's. I love the fact your point five's it's that's period that. Your maturity is its way years beyond. Myself for anybody. Years are seniors I mean they is that going the year Twitter feed insecurity it's this it's and it's amazing. Oh think of us I think it's it's an interesting mix of being like. That you would also like a little kid and the variety that is accepting that I think is this book helps me. And Andrew I guess and on this what's next where what's next musically what's what's next. Yeah and it put up my my single. Which I'm making an album basically yes that it this'll be the first single from the album. That's in the very soon and I showed a music video for that. Like almost two months ago. Just in editing it and in the final touches to make obvious that eclectic. And oh yeah but it's thicker but that's exciting. Then because ups if Romaine seasoned for now yes you guessed it doesn't look but the other things in the DC universe Tilly and its chemical and see flash. On the big screen not grant Basra but that's financial singles and also to kind of be involved in and and have fans. Yeah. I mean in the it's very separate you know I will to separate that we don't you know it's going with that I think quick. The flash collects. This beautiful pieces. In expression. Fantasy. I think. That's going natives it could be made it than what has we'll get to see different. Versions of whatever that lets them. There's a reason people need to swung one way and they can go and his that you hear huge fan of I love watching the show I hope the movie you know justly turns out rate monitors that now it looks. Through Austin I'm really excited for I think and as a fan you just one. Awesome content. That's what's gonna happen if that's the so yet. As low as much better explained by yourself and myself but in fact that that. But I think you for joining us I mean this is a with a with a blast. You're just like bursting with talent and happiness as it's as the labeled anti air. So keen and for myself. They're eager to join us as well as an ABC news.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'The Flash' star Keiynan Lonsdale on his music career",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/video/flash-star-keiynan-lonsdale-music-career-49207426"
}