{
    "authors": [
        "Abc News",
        "More Veronica"
    ],
    "date_download": "2017-08-14 12:14:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The Note: Trump’s silence on white nationalism is deafening",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fnote-trumps-silence-white-nationalism-deafening%2Fstory%3Fid%3D49202140.json",
    "image_url": "http://a.abcnews.com/images/Politics/donald-trump-ap-jt-170813_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "WHAT YOU NEED TO KNOW TODAY\nAttorney General Jeff Sessions joined \"Good Morning America\" today and said the fatal Charlottesville, Virginia, car crash \"does meet the definition\" of domestic terrorism. \"This is an unequivocally unacceptable and evil attack that cannot be accepted in America,\" Sessions said.\nThe talk of the town today: Why isn't President Trump explicitly condemning white supremacy and extremist groups himself after the deadly protests in Charlottesville, Virginia, over the weekend?\nTrump returns to Washington, D.C., to sign a memorandum directing the Office of the U.S. Trade Representative to consider investigating China's intellectual property practices.\nTrump gets some face time with chief of staff John Kelly and meets with his National Economic Council before heading to New York City to work out of Trump Tower.\nThis still happening? Trump announced Friday he'll hold a \"pretty big press conference\" today but such a news conference isn't listed on his public schedule.\nAmerica's top general, Joseph Dunford, chairman of the Joint Chiefs of Staff, heads to South Korea amid the growing threat from North Korea and after President Trump's tweet that military solutions to deal with North Korea are \"locked and loaded.\"\nTHE TAKE with ABC News' MaryAlice Parks\nThe White House over the weekend said the president condemned all forms of bigotry, which obviously included white supremacy and neo-Nazism. Words matter and many Americans only heard resounding silence and vagueness from their commander in chief. This is a president known for direct and specific judgment of others, who criticized his predecessor for not naming another form of extremism explicitly enough. These facts made the president's ambiguous response to the hatred and violence in Charlottesville all the more shocking and disappointing to members of his own party. Given his past statements about minorities and white nationalists' seemingly unequivocal support of him, some will now rightly question whether the president's hazy comments were not simply tone-deaf but calculating. Racist hate groups clearly feel emboldened in the country today and will continue to unless leaders put an end to it. It is too easy to say this president ceded moral authority. As the president, he always influences the country when he speaks. He chooses whom to empower. The president could still act by devoting law enforcement resources to countering white extremist groups or further disassociating himself from supporters and advisers sympathetic to white nationalists.\nQUOTE OF THE DAY\n\"We have no tolerance for hate and violence from white supremacists, neo-Nazis or the KKK.\" -- Vice President Mike Pence\nNEED TO READ with ABC News' Daksha Sthipam\nScaramucci: Bannon's \"toleration\" of white nationalism is \"inexcusable.\" Former White House communications director Anthony Scaramucci Sunday hit at White House strategist Steve Bannon for his controversial views, a day after the violent white nationalist rally in Charlottesville. When asked whether he thought Bannon was a white supremacist or a white nationalist, Scaramucci said the toleration of white supremacy by Bannon is \"inexcusable.\" http://abcn.ws/2uCGy0A\nAny attack to incite fear \"is terrorism\": Trump's national security adviser on Charlottesville. President Trump's national security adviser, H.R. McMaster, appeared to go further than the president by suggesting that the car-ramming in Charlottesville, Virginia, that left a woman dead Saturday may be domestic terrorism. \"Anytime that you commit an attack against people to incite fear, it meets the definition of terrorism,\" McMaster said on \"This Week\". http://abcn.ws/2wHS6AX\nWhite House says Trump \"condemns\" white supremacists, KKK, neo-Nazi and all extremist groups. A White House said Sunday that President Donald Trump \"condemns all forms of violence, bigotry and hatred,\" including white supremacy in the wake of the violence in Charlottesville, Virginia, Saturday. The new statement Sunday came a day after the president was widely criticized for not explicitly condemning white supremacy. http://abcn.ws/2uAlLi0\nNorth Korea warns Trump to \"talk and act properly.\" The war of words between the U.S. and North Korea continued on Saturday. \"If the Trump administration does not want the American empire to meet its tragic doom in its tenure, they had better talk and act properly,\" North Korea said in a statement distributed through state-run media, where it also called the unrest a \"tragicomedy in the making.\" http://abcn.ws/2vqV0eC\n\"We're holding Pyongyang to account.\" Op-ed from Defense Secretary James Mattis and Rex Tillerson. The Wall Street Journal\nTrump's campaign releases abrasive ad a day after he called for national unity. New York Magazine\nThe Note is a daily ABC News feature that highlights the key political moments of the day ahead. Please check back tomorrow for the latest.",
    "source_domain": "abcnews.go.com",
    "title": "The Note: Trump’s silence on white nationalism is deafening",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/note-trumps-silence-white-nationalism-deafening/story?id=49202140"
}