{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:51:48+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "White House special events chef and Army veteran Andre Rush knows how to man the grill and flex for a cause.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FFood%2Fwhite-house-chef-andre-rush-flexes-viral-biceps%2Fstory%3Fid%3D56348545.json",
    "image_url": "https://abcnews.go.com/GMA/Food/white-house-chef-andre-rush-flexes-viral-biceps/story?id=56348545",
    "language": "en",
    "localpath": null,
    "maintext": "White House special events chef and Army veteran Andre Rush knows how to man the grill and flex while he's at it.\nRush's enormous 24-inch biceps went viral in June when reporters noticed the buff chef preparing a meal at the White House for Trump's Ramadan event and tweeted out the photos. Turns out he's a bit of a renaissance man and was often regarded as the Army's strongest chef by lifting over 700 lbs, as well as being a master ice carver, pastry chef, chocolatier, and an array of other specialties.\nChefs outside the West Wing prepping for tonight’s White House iftar. President Trump will host 30-40 guests to celebrate the Muslim holy month of Ramadan. pic.twitter.com/0uzr6A1uKw — Vivian Salama (@vmsalama) June 6, 2018\nRush, who served over 23 years in the United States Army, is putting his biceps towards a cause that's close to his heart.\nThis Fourth of July, he teamed up with the USO's #Flex4Forces campaign, which invites Americans to show support for service members by flexing their biceps on social media, and asks others to do the same and make a donation.\n#FLEX4FORCES I challenge EVERYONE ON HERE, Military, friends,retired, https://t.co/85nkEG9q8a your support for your military!USO post your flex! Don’t be scared, ?? help those that help so many others!https://t.co/Dz78BSUQPI #flex4forces flexing all over the world! #nomagicpill pic.twitter.com/FWLcRV5ii8 — @realChefRush (@realchefrush) July 3, 2018\nTens of thousands of Americans have participated so far to show their support for service members, including celebrities like Dwayne \"The Rock\" Johnson, Jessica Biel, Chris Pratt, Elizabeth Banks, Tim McGraw, Zosia Mammet and many more.\nRush flexed for \"GMA\" and nominated Arnold Schwarzenegger to take part in the challenge next. He also shared some of his favorite grilled dishes that you can try all summer long. Get the recipes below.\nA post shared by Good Morning America (@goodmorningamerica) on Jul 4, 2018 at 4:00am PDT\nChef Rush's Grilled Salmon\nIngredients\n2 1/2 pounds salmon fillets/steaks\n2 oz lemon juice/zest\n1 bulb fresh garlic\n2 tablespoons pepper\n1 teaspoon Kosher salt\n1 1/2 cup soy sauce\n1 cup brown sugar\n1 cup water\n1/2 cup vegetable oil\n1 tablespoon sesame oil\nDirections\nSeason salmon fillets/Steak with lemon pepper, garlic powder, and salt.\nIn a small bowl, whisk together soy sauce, brown sugar, water, and vegetable oil and sesame oil until sugar is dissolved. Place the salmon in a large container or bag with mixture, seal, and make sure you turn to coat. Refrigerate for a minimum of 1 hour.\nPreheat grill for medium heat.\nLightly oil grill. Place salmon on the preheated grill, and discard marinade. Cook salmon for 6 to 8 minutes each side depending on thickness, or until flakes.\nChef Rush’s Fillet Steak with Chimichurri\nIngredients\n1/3 beef Fillet Tenderloin (whole)\n2 tablespoons Sea Salt\n2 tablespoons fresh cracked Pepper\n2 sprigs rosemary\n1 tablespoon oil\nIngredients for the Chimichurri sauce\n1 snd 1/4 cup flat-leaf parsley with steams\n4 cloves garlic, chopped roughly\n3 tablespoons oregano leaves,fresh\n3 tablespoons red wine vinegar\n1/2 teaspoon salt\n6 tablespoons extra virgin olive oil\nDirections\nRub oil over tenderloin, and sprinkle even amounts of salt and pepper.\nPut Tenderloin on the grill at medium heat, and turn every 4-6 minutes till internal temperature is 135F /52C.\nRemove tenderloin from grill and let rest 5-10 minutes before slicing.",
    "source_domain": "abcnews.go.com",
    "title": "White House chef Andre Rush flexes his viral biceps for veterans this Fourth of July",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Food/white-house-chef-andre-rush-flexes-viral-biceps/story?id=56348545"
}