{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:21:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The Latest: Globes television drama actor nominees announced",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Flatest-kristen-bell-stays-warm-globes-noms-51715174.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_c7d132eeeaea45db9d3dfd7d5497c497_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on nominations for the 75th annual Golden Globe Awards (all times local):\n6:15 a.m.\nThe Golden Globes nominations for best actress in a television drama have been announced. They are: Caitriona Balfe, \"Outlander\"; Claire Foy, \"The Crown\"; Maggie Gyllenhaal, \"The Deuce\"; Katherine Langford, \"13 Reasons Why\" and Elisabeth Moss, \"The Handmaid's Tale.\"\nThe nominees for best actor in a television drama are: Jason Bateman, \"Ozark\"; Sterling K. Brown, \"This Is Us\"; Freddie Highmore, \"The Good Doctor\"; Bob Odenkirk, \"Better Call Saul\" and Liev Schreiber, \"Ray Donovan.\"\n———\n6:05 a.m.\nThe Golden Globes nominations for best actress in a film comedy or musical have been announced. They are: Judi Dench, \"Victoria & Abdul\"; Helen Mirren, \"The Leisure Seeker\"; Margot Robbie, \"I, Tonya\"; Saoirse Ronan, \"Lady Bird\"; Emma Stone, \"Battle of the Sexes.\"\nThe nominees for best performance by an actor in a film comedy or musical are: Steve Carell, \"Battle Of The Sexes\"; Ansel Elgort, \"Baby Driver\"; James Franco, \"The Disaster Artist\"; Hugh Jackman \"The Greatest Showman\" and Daniel Kaluuya, \"Get Out.\"\n———\n6:00 a.m.\nGuillermo del Toro's Cold War-era fairytale \"The Shape of Water\" swam away with a leading seven nominations from the Golden Globes, while the HBO drama \"Big Little Lies\" led the television nominees with six nods.\nThe nominees for best picture drama are: \"Call Me By Your Name,\" ''Dunkirk,\" ''The Post,\" The Shape of Water\" and \"Three Billboards Outside Ebbing, Missouri.\"\nThe nominees for best picture comedy or musical are: \"The Disaster Artist,\" ''Get Out,\" ''Lady Bird,\" ''The Greatest Showman,\" and \"I, Tonya.\"\nThe Globes are the most prominent platform yet in Hollywood's awards season to confront the post-Harvey Weinstein landscape. Among the supporting actor nominees is Christopher Plummer, who has replaced Kevin Spacey in Ridley Scott's \"All the Money in the World.\" Scott, too, was nominated for best director.\n———\n5:55 a.m.\nThe Golden Globe nominees for best motion picture drama actress have been announced in Beverly Hills, California. They are: Jessica Chastain, \"Molly's Game\"; Sally Hawkins, \"The Shape of Water\"; Frances McDormand, \"Three Billboards Outside Ebbing, Missouri\"; Meryl Streep, \"The Post\" and Michelle Williams, \"All the Money in the World.\"\nThe nominees for best actor in a motion picture are: \"Timothee Chalamet, \"Call Me By Your Name\"; Daniel Day-Lewis, \"Phantom Thread\"; Tom Hanks, \"The Post\"; Gary Oldman, \"Darkest Hour\" and Denzel Washington, \"Roman J. Israel, ESQ.\"\n———\n5:47 a.m.\nThe Golden Globe nominees for best motion picture drama have been announced in Beverly Hills, California. They are: They are \"Call Me By Your Name,\" ''Dunkirk,\" ''The Post,\" The Shape of Water\" and \"Three Billboards Outside Ebbing, Missouri.\"\n———\n5:45 a.m.\nThe Golden Globe nominees for best motion picture comedy or musical have been announced in Beverly Hills, California. They are: \"The Disaster Artist,\" ''Get Out,\" ''The Greatest Showman,\" ''Lady Bird\" and \"I, Tonya.\"\n———\n5:40 a.m.\nThe Golden Globe nominees for the best television drama series have been announced in Beverly Hills, California. They are: \"The Crown,\" ''The Handmaid's Tale,\" ''This Is Us,\" ''Stranger Things\" and \"Game of Thrones.\"\n———\n5:35 a.m.\nThe Golden Globe nominees for best actor in a television comedy or musical have been announced in Beverly Hills, California. They are: Anthony Anderson, \"black-ish\"; Aziz Ansari, \"Master of None\"; Kevin Bacon, \"I Love Dick\"; William H. Macy, \"Shameless\" and Eric McCormack, \"Will & Grace.\"\n———\n5:30 a.m.\nThe Golden Globe nominees for best actress in a television comedy or musical have been announced in Beverly Hills, California. They are: Pamela Adlon, \"Better Things\"; Alison Brie, \"Glow\"; Rachel Brosnahan, \"The Marvelous Mrs. Maisel\"; Issa Rae, \"Insecure\" and Frankie Shaw, \"Smilf.\"\n———\n5:28 a.m.\nThe Golden Globe nominees for best limited television series or movie have been announced in Beverly Hills, California. They are: \"Big Little Lies,\" ''Fargo,\" ''Feud: Bette and Joan,\" ''The Sinner\" and \"Top of the Lake: China Girl.\"\n———\n5:25 a.m.\nThe Golden Globe nominees for best animated feature film have been announced in Beverly Hills, California. They are: \"The Boss Baby,\" ''The Breadwinner,\" ''Coco,\" ''Ferdinand\" and \"Loving Vincent.\"\n———\n5:22 a.m.\nThe Golden Globe nominees for foreign language film have been announced in Beverly Hills, California. They are \"Fantastic Woman,\" ''First They Killed My Father,\" \"In the Fade,\" ''Loveless\" and \"The Square.\"\n———\n5:20 a.m.\nThe reading of Golden Globe nominations has begun in Beverly Hills, California. The nominees for best TV comedy series are: \"black-ish,\" ''The Marvelous Mrs. Maisel,\" ''Master of None,\" ''Smilf\" and \"Will & Grace.\"\n———\n5 a.m.\nDecked in a large cozy sweater, actress Kristen Bell is sipping coffee and staying warm before she takes the stage to announce the nominees for the 75th Golden Globe Awards.\nJournalists gathered early Monday at the Beverly Hilton Hotel for the reading of the nominations, which honor acting and other work in film and television.\nThe hotel is a flurry of activity in these early hours with publicists and members of the press chatting and grabbing a little bite of fruit, bagels and croissants before the nominations announcement begins.\nPhotographers and camera crews took test shots of the stage where Bell, Alfre Woodard, Garrett Hedlund, and Sharon Stone will read the nominations in 25 categories beginning at 5:15 a.m.\nThe Golden Globe will be hosted Jan. 7 by Seth Meyers and broadcast by NBC from the Beverly Hilton.\n———\n12 a.m.\nNominations for the 75th annual Golden Globe Awards will be announced Monday morning from Beverly Hills, California.\nThe nominations will begin at 8:15 a.m. Eastern, with a second batch of nominees announced live on NBC's \"Today\" show. Among the favorites are Steven Spielberg's \"The Post\" and Christopher Nolan's \"Dunkirk.\"\nIn the television categories \"The Handmaid's Tale\" and \"Big Little Lies\" could be in for a big morning.\nThe Golden Globe will be hosted Jan. 7 by Seth Meyers and broadcast by NBC from the Beverly Hilton Hotel.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Globes television drama actor nominees announced",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/latest-kristen-bell-stays-warm-globes-noms-51715174"
}