{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 06:40:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "India launches more than 100 satellites into orbit",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Findia-launches-100-satellites-orbit-45502218.json",
    "image_url": "http://abcnews.go.com/Technology/wireStory/india-launches-100-satellites-orbit-45502218",
    "language": "en",
    "localpath": null,
    "maintext": "India's space agency said it successfully launched more than 100 foreign nano satellites into orbit Wednesday aboard a single rocket.\nThe Indian Space Research Organization said the nano satellites — those weighing less than 10 kilograms (22 pounds) — were sent into orbit on board its polar satellite launch vehicle in southern India.\nThe agency said the launching of the 104 satellites was a record, overtaking Russia's feat of sending 37 satellites in a single launch in 2014.\nThe nano satellites belong to various companies in the United States, the United Arab Emirates, Israel, the Netherlands and Kazakhstan, according to the ISRO.\n\"All 104 satellites were successfully placed in orbit,\" the Press Trust of India news agency quoted ISRO Chairman A.S. Kiran Kumar as saying. They included an Indian earth observation satellite.\nPrime Minister Narendra Modi tweeted that the \"remarkable feat by ISRO is yet another proud moment for our space scientific community and the nation.\"\nIndia has been striving to become a player in the multibillion-dollar space launch market, and has successfully placed light satellites into orbit in recent years. It hopes to eventually send astronauts into space.\nIn September 2014, India successfully guided a spacecraft into orbit around Mars. Only the United States, the former Soviet Union and the European Space Agency had been able to previously do that.",
    "source_domain": "abcnews.go.com",
    "title": "India launches more than 100 satellites into orbit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/india-launches-100-satellites-orbit-45502218"
}