{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:26:08+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Gregory Roberts of Sonoma State University creates pottery from the remains of homes burnt down in the recent wildfire.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fpotter-creates-art-wildfires-ashes-52808706.json",
    "image_url": "http://a.abcnews.com/images/US/180202_kgo_ashes_pottery_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Potter creates art out of wildfire's ashes\nBut those of us who suffered loss in the north they fires this is the price of the memories rulers and ash. Richard Palmer of Rincon valley misses more than the old college honor property that contact. When the fires burned in ashes fell last October. Paint and shared loss rained down on him. Not even Gregory Roberts can imagine at that time how he might take this and the ashes and make something positive from them. This would be village potter. In this is like and this seemed like a great way to do. Gregory runs the art department at Sonoma State University he's an expert at ceramics so. After the fire he went on social media asking burn victims to bring him their ashes for transformation into clay. The response to his Sonoma ash project. Overwhelming. All I've done is drop off my ashes on a porch with interesting I don't know any of these people. For every bag time on the wheels. Mud through his hands and eventually a container then we looked pretty much the same in every one of these earns is different because every single one of the concerns. Comes from a different home. With a different story with different contacts. Dogs pets. You know some of these were my you know my my. My aide. Grandparents ashes were sort of lost it in the melee and so. There they might be in here somewhere. For the record Gregory has yet to go to work on bag number 44 from Bridget cottage he will really put it. Us. You loan. A quandary brought on by at and commonly kind gesture by a village potter taking the remnants of pain and making beauty from it. In Santa Rosa Wayne Freedman ABC 7 NEWS.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Potter creates art out of wildfire's ashes",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/potter-creates-art-wildfires-ashes-52808706"
}