{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 19:17:41+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Netflix wins 'Scandal' creator Rhimes in blow to Disney, ABC",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fscandal-creator-shonda-rhimes-making-shows-netflix-49200502.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_ba6bdb78dda84ce19c673feb80599619_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Netflix has lured Shonda Rhimes, the well-regarded creator of TV series \"Scandal\" and \"Grey's Anatomy,\" from ABC — announcing its scoop just days after ABC owner Disney laid out plans to pull programming from Netflix.\nNetflix said Rhimes' Shondaland production company is moving to Netflix for a multi-year deal. New ideas and projects from Rhimes and her producing partner, Betsy Beers, will be available on the streaming service.\nBut her existing, well-known shows — \"Grey's Anatomy,\" ''Scandal\" and \"How to Get Away With Murder\" — will remain on the network. Upcoming Shondaland projects already in the works, like the drama \"For the People\" and a \"Grey's\" spinoff, will also still stay with ABC. Rhimes has had exclusive deals with ABC Studios for nearly 15 years.\nABC Entertainment president Channing Dungey said \"fans can rest assured\" that the network's Thursday night lineup of Rhimes-produced shows \"remains intact and will be as buzzed about as ever.\" Rhimes' shows have been among ABC's top-rated series.\n\"I'm proud to have given a home to what have become some of the most celebrated and talked about shows on television,\" Dungey said in an emailed statement.\nFinancial terms of the Netflix deal weren't disclosed, nor were details on how long Rhimes and her company will produce series for Netflix.\nThe announcement late Sunday came just days after Disney said it was creating a new streaming service of its own for kids and launching an online-subscription version of ESPN.\nDisney said it will pull Disney and Pixar movies and shows from Netflix for the new service aimed at kids, expected to launch in 2019. ABC shows won't be included, but Disney has hinted that it could shift more content to this new model. Disney is also launching an ESPN streaming service, without pro football and basketball, early next year. It has said it might also sell the full ESPN channel directly to viewers online if viewership disintegrates; currently, a cable or satellite subscription is required.\nDisney is setting itself up for the future as ratings for traditional TV have suffered. Competition for viewers is increasing and attention is shifting online, where video can be watched on a viewer's schedule — an option Netflix has taught viewers to love.\nABC ended the traditional TV season in May at the No. 3 slot among the big broadcasters and down 9 percent in the ratings, according to Nielsen. It's rebooting \"Roseanne\" and \"American Idol\" in the 2017-18 season and bringing back popular comedies \"black-ish\" and \"Modern Family.\"\nNetflix continues to invest in more original programming to win those eyeballs. It's not competing with just cable anymore. Traditional TV companies have launched or are planning a slew of streaming services , and tech companies like Amazon and Google's YouTube have as well. In the past few weeks, Netflix has signed up David Letterman and bought a comic book publisher to turn its characters into movies and shows.\nRhimes wrote in a statement that she was grateful to ABC for giving her career a start, but she was looking forward to expanding her audience and \"creative identity\" with Netflix. \"Starting today, we are thrilled to begin creating new Shondaland stories with Netflix,\" she wrote.\nShe said that she and Netflix Chief Content Officer Ted Sarandos had developed a plan for the next phase of Rhimes' career. She said Netflix offered her and her team \"limitless possibilities.\"\n\"I've gotten the chance to know Shonda and she's a true Netflixer at heart — she loves TV and films, she cares passionately about her work, and she delivers for her audience,\" Sarandos wrote.\nRhimes, 47, has been nominated for three Emmy Awards, all for her work on \"Grey's Anatomy.\" The long-running series begins its 14th season next month. \"Scandal\" will return for its seventh and final season in October.",
    "source_domain": "abcnews.go.com",
    "title": "Netflix wins 'Scandal' creator Rhimes in blow to Disney, ABC",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/scandal-creator-shonda-rhimes-making-shows-netflix-49200502"
}