{
    "authors": [
        "Abc News",
        "More Katie"
    ],
    "date_download": "2017-06-14 22:26:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Police departments battle in dance-off",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fpolice-departments-battle-dance-off-twitter-showdown%2Fstory%3Fid%3D48034717.json",
    "image_url": "http://abcnews.go.com/Entertainment/police-departments-battle-dance-off-twitter-showdown/story?id=48034717",
    "language": "en",
    "localpath": null,
    "maintext": "A social media dance-off is growing among police departments thanks to a Twitter showdown that was started on National Best Friends Day.\nThe friendly competition started last week when the National Sheriff’s Association tweeted about National Best Friends Day and tagged a few police departments across the country.\nAngela Sands, public information officer for the Lincoln Police Department in Lincoln, Nebraska, noticed that her department was not included and replied on Twitter.\n“My reply was, ‘You guys didn’t invite us to Best Friends Day,’” Sands told ABC News.\nSands’ tweet started a thread among the police departments, to which she later posted a GIF of people dancing. When that GIF was poked fun at, Sands replied that the police departments should post videos of their own officers dancing.\nBellevue Police Department, in nearby Bellevue, Nebraska, was specifically given a deadline of June 9 to post a video.\nSands meanwhile recruited one of her fellow Lincoln officers, Courtney Leaver, to show off her own dancing skills. Leaver came in on her day off to film a short dance to \"No Boys Allowed\" by Keri Hilson Buyou that was shared on Twitter.\nWhen Bellevue went past their deadline to post a video, Sands again took to Twitter to egg them on.\n@PapillionPD can you do a welfare check on @BellevuePolice they're ignoring the whole internet — Lincoln Police (@Lincoln_Police) June 9, 2017\nThe Belleveu Police Department, which did not reply to ABC News' request for comment, delivered their own video on Monday to Missy Elliott's \"Pep Rally.\"\nWorth the wait!! @BellevuePolice pulled it off & rocked it! Respect from #LPD for accepting the cop dance off challenge! https://t.co/940i9KM4zL — Lincoln Police (@Lincoln_Police) June 13, 2017\nSands said her officers found the cop dance challenge \"hilarious.\" Officer Leaver has been recognized and stopped in the street for her dance moves, while other officers have texted Sands that they want to do a Beyonce-style video next.\n\"One of my goals was to help humanize cops because we do witness traumatic events and it’s a very stressful job,\" Sands said. \"I think for our own mental and physical safety we become very guarded, and I think the public needs to see this side of us that we rarely get to show.\"",
    "source_domain": "abcnews.go.com",
    "title": "Police departments battle in dance-off",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/police-departments-battle-dance-off-twitter-showdown/story?id=48034717"
}