{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 04:51:09+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fsweet-science-putting-corn-syrup-work-earths-origins-53866046.json",
    "image_url": "https://s.abcnews.com/images/Technology/WireAP_eb60c4513ae24d32b6d1096e726b0ced_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "How has the Earth evolved, and what's in store for the future? It's a sticky question that has graduate student Loes van Dam covered in corn syrup by the end of a day in the lab.\nShe thought using a computer model would be limiting. So she designed and built a large tank, filled it with 2,000 pounds (907 kilograms) of corn syrup, and added six counter-rotating belts to study how tectonic plates drift and shift.\nThe corn syrup represents the Earth's mantle, which melts to form magma at volcanoes and ridges. The belts are the drifting and shifting tectonic plates. Their intersection is the ocean ridge.\nSyrup in the tank, which measures 5 feet (1.5 meters) wide, 5 feet (1.5 meters) long and 1? feet (0.3 meters) tall, slowly moves as the belts pull apart. Cameras record the flow in what van Dam has named the \"ridge zone replicator.\" One minute of each experiment equals more than a million years in time, to show how tectonic plates move mantle material.\n\"It's really cool that with our little experiments, we get clues about how this process has been going on in the past and why those plates are positioned the way they are now,\" said van Dam, who studies geological oceanography at the University of Rhode Island's Graduate School of Oceanography in Narragansett.\nHow plates drift is not thoroughly understood, and computer simulations have difficulty capturing it. Her experiments aim to show how plate tectonics created the sea floor over billions of years, and how those forces are at work today.\n\"We can understand the flow at all points in the syrup. We're not limited to measuring at a few points, like in a numerical simulation,\" she said.\nHer experiments are showing that the lava that erupts from volcanoes to form new sea floor may originate at a shallower depth in the Earth than geologists currently think. The model shows more horizontal flow of mantle material than previous models have shown.\nThat may tell researchers more about the chemical makeup of the Earth's interior, said URI Professor Chris Kincaid, an expert in geophysical oceanography.\nTo his knowledge, he said, it's the first 3-D model of a mid-ocean ridge system that can migrate in any direction.\n\"She's trying to put together a clearer picture of the evolution of the Earth,\" he said. \"If you're trying to understand how the Earth is changing in the future, you need to know that.\"\nVan Dam, 23 and born in Rotterdam, Netherlands, moved to Novato, California, when she was young. She always picked up rocks that fascinated her and got her first introduction to plate tectonics in a third-grade earth science class.\nThe research is funded with a grant from the National Science Foundation.",
    "source_domain": "abcnews.go.com",
    "title": "Sweet science: Putting corn syrup to work on Earth's origins",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Technology/wireStory/sweet-science-putting-corn-syrup-work-earths-origins-53866046"
}