{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 16:55:52+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The estate is \"extremely disappointed in Kanye's choice.\"",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fwhitney-houston-estate-slams-kanye-west-photo-late%2Fstory%3Fid%3D55532120.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/whitney-houston-gty-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The estate of singing icon Whitney Houston is officially responding to Kanye West's use of a photo of her bathroom on the cover of an album he produced.\nInterested in Whitney Houston? Add Whitney Houston as an interest to stay up to date on the latest Whitney Houston news, video, and analysis from ABC News. Add Interest\nThe rapper and producer used the photo, which depicts the messy bathroom vanity strewn with items including what could have been drug paraphernalia, for the cover of Pusha T's album, \"Daytona,\" released on his label GOOD Music.\nHouston was found dead at the Beverly Hilton Hotel in 2012. Prescription drugs were found near her body and bottles of alcohol were found in an adjacent room. She was 48. The photo used was reportedly taken years before her death.\nHouston's estate has come forward and said they are \"extremely disappointed in Kanye's choice,\" in a statement to Entertainment Tonight.\nalbum 1 PUSHA T DAYTONA dropping 2mrw pic.twitter.com/M1UPvax5fa — KANYE WEST (@kanyewest) May 24, 2018\n\"Even in Whitney’s death, we see that no one is exempt from the harsh realities of the world,\" the statement continues.\nHouston's estate did not immediately respond to ABC News' request for further comment.\nThe estate is not the first entity or person to speak out again West using this photo. When the album dropped last week, Houston's cousin Damon Elliott told People magazine that the usage of the image was hurtful.\nHe said he found out when his daughter called him in a panic.\n\"She sent me this picture from the album cover and I immediately got sick to my stomach because it took me right back to six years ago,\" the music producer told the magazine. \"To do something for a publicity stunt to sell records, it’s absolutely disgusting. It hurt my family and my daughter. It’s petty. It’s tacky.\"\n\"I’ve watched the train wreck happening,\" Elliott added, referring to West's recent headlines, \"but I didn’t think he’d go this far in invading someone’s family privacy.\"\nThe controversial photo came at high price. Pusha T said West told him he paid $85,000 for the rights to use the photo.\nIn an interview last week with Angie Martinez, Pusha T explained that the West decided to change the cover last minute. In fact, the original artwork was supposed to be a picture of him.\n\"One a.m., my phone rings. No caller I.D.,\" the rapper said in the interview. \"[West said], 'Hey, yeah, I think we should change the artwork.' And, 'I like this other artwork. And this other artwork is 85 grand.' I said, 'Hey, I don't want to pay for that and I wasn’t even going to ask you to pay for that. We picked what we picked, it’s here, it’s ready.' 'No, this is what people need to see to go along with this music. Im'ma pay for that.'\"",
    "source_domain": "abcnews.go.com",
    "title": "Whitney Houston estate slams Kanye West for using photo of late singer's bathroom",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/whitney-houston-estate-slams-kanye-west-photo-late/story?id=55532120"
}