{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 12:41:34+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "The Thomas fire, the worst of five major fires burning in California, continues to spread and has already scorched an area larger than New York City.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fwildfire-now-5th-largest-california-history-51713450.json",
    "image_url": "http://a.abcnews.com/images/GMA/171211_gma_gutman2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Wildfire now the 5th largest in California history\nWe are also watching those wildfires out west. Right now five are burning across California, the largest the Thomas fire charring nearly 230,000 acres, an area larger than New York City and Matt Gutman is there in the middle of it all in Santa Barbara county. Good morning to you, Matt. Reporter: Hey, good morning, Michael. You see those images you understand why firefighters say going up against this fire, the Thomas fire, is like battling a hurricane and just this weekend 2,000 additional firefighters brought out here and I want you to see from our second camera the massive array of fire trucks behind me. Hundreds of them here, hundreds more on the fire lines, 8500 firefighters in total from ten states. This morning, an out-of-control wildfire making history in southern California. We're facing a new reality in the state. Reporter: The Thomas fire is now the fifth largest to ever burn in the state. Now surging from Ventura to Santa Barbara county. It's really terrifying. Reporter: The wildfire charring another 50,000 acres on Sunday alone. Leaping over painstakingly cut fire lines. Watch this time-lapsed video showing a plume of smoke rising like a mushroom cloud over Ventura county and Santa Barbara in just 30 minutes breaking out exactly a week ago engulfs tens of thousands of acres this a matter of hours. Look at how big that did and how dangerous it is. Reporter: Over the past 24 hours the fire consuming an area about the size of Washington, D.C. We've been watching this fire move along this ridge all day long. Now, the good news for firefighters is that the wind here has subsided but there is so much dry brush out there that fire keeps moving relentlessly. Over 700 structures destroyed. Some residents returning home this morning to homes reduced to a ashes. Oh, my god. Oh, my god. Reporter: Tens of thousands of residents still evacuated. Authorizes evacuating 5,000 more people overnight. The fire burned down the entire backyard. So I'm ready to go. Reporter: Among them is actor Rob Lowe who lives in Santa Barbra streisa Barbara. Praying for the people in my area hope everybody is getting out safe like we are. Reporter: Oprah Winfrey taking to Twitter with a heartfelt message writing peace be still is my prayer tonight for all the fires raining through my community and beyond. Containment had reached 15% but by Sunday the flames jumping the fire lines causing containment to drop to 10%. Now, one reason this fire has been so stubborn and relentless is because these areas have not burned in nearly 100 years. Now there have been hundreds of millions of dollars in damage. Power is out for 85,000 people in Santa Barbara county and more fallout. Many schools are closed until the new year. Guys. Boy, it is going in so many different directions.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Wildfire now the 5th largest in California history",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/wildfire-now-5th-largest-california-history-51713450"
}