{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 08:21:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Linsey, a 2015 runner-up on \"The Voice,\" told People magazine she had been bitten by a brown recluse spider and had a horrible reaction.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FNightline%2Fvideo%2Fsinger-meghan-linsey-explains-horrific-venomous-spider-bite-46855689.json",
    "image_url": "http://a.abcnews.com/images/Nightline/170418_ntl_meghan_0104_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Singer Meghan Linsey explains horrific venomous spider bite on her face\nYou know when Peter parker was bitten by a radioactive spider he got super strength and ajill agility. But when she was bit by a poisonous spider, things got ugly. It's the tough of nightmares, waking up tie a poisonous spider in your bed. I had a stinging sensation on my face. I looked on my right hand. I was holding a dead spider. Country star and voice runner-up Megan Lindsey found love isn't the only thing that hurts. ??? Ooh love hurts ??? when she was bitten this February by a rare brown recluse spider. It was the craziest thing, for nine days, I woke up. Full body rash. Pain mine face. Night sweats. Fever. Her face swole. Necrosis seen on Instagram. I share a lot on line and with my fans. I think when you are that vulnerable you tend to grow. The eternal optimist, Lindsay found the silver lining in a scary situation. I have gotten really good at covering it with makeup. That's a positive thing. Now back on tour, Lindsay is grateful to be on the road again. I feel like this made me a stronger person. And really endeared me to more people that I could ever have\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Singer Meghan Linsey explains horrific venomous spider bite on her face",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Nightline/video/singer-meghan-linsey-explains-horrific-venomous-spider-bite-46855689"
}