{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 18:20:46+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "An excerpt from Sen. Elizabeth Warren's new book, \"This Fight Is Our Fight.\"",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fbook-excerpt-sen-elizabeth-warrens-fight-fight%2Fstory%3Fid%3D55535744.json",
    "image_url": "https://s.abcnews.com/images/Politics/elizaberth-warren-this-is-our-fight1--ht-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An excerpt from the 2018 afterword to \"This Fight Is Our Fight\" by Elizabeth Warren, published with permission.\nOn a Tuesday evening in February 2017, I stood up on the floor of the U.S. Senate and launched into a review of the record of President Donald Trump’s nominee for Attorney General, Senator Jeff Sessions. Part way into my speech, I started reading a letter written by Coretta Scott King. Mrs. King’s letter was sharp and eloquent.\nShe began with a description of how, as Alabama’s U.S. Attorney, Jeff Sessions had “used the awesome power of his office to chill the free exercise of the vote by black citizens.” She described his “hostility to the enforcement of those laws” that protect the right to vote. She gave voice to the fears of elderly black men and women who had been subjected to intimidation and threats. And the events she described hadn’t happened a hundred years ago during Reconstruction—they had occurred in the 1980s.\nI was still only a little ways into Mrs. King’s letter when I heard three loud bangs.\nStartled, I stopped reading and looked up. Senator Steve Daines of Montana had just slammed down the Presiding Officer’s gavel.\nReading from a sheet of paper, Senator Daines said, “The Senator is reminded that it is a violation of Rule XIX of the Standing Rules of the Senate to impute to another Senator or Senators any conduct or motive unworthy or unbecoming a Senator.”\nSoon Mitch McConnell, the Senate Majority Leader, hustled into the chamber and objected when I tried to continue my speech. Senator Daines mustered his full authority as Presiding Officer and commanded, “The Senator will take her seat.”\nI was stunned, but I was also determined that this would not happen, so I appealed the ruling of the Presiding Officer. This meant that every senator would have to come back to the chamber and vote—on the record—about whether to shut me up or to let me finish reading Mrs. King’s letter.\nWhile senators were gathering for a vote, I went into the hallway outside the Senate chamber. A Republican senator approached me and said the Majority Leader was willing to accept my public apology and, if I seemed sincere, he would drop the censure charge and I would be allowed to remain on the floor. I couldn’t read Coretta Scott King’s letter, of course, but by apologizing I would get out of trouble.\nNo, I said.\nWhat? the senator asked.\nNo, I said again. In fact, hell no.\nThe senator was obviously shocked. It was clear that Mitch was angry. “This isn’t good for you. This isn’t who you want to be.”\nSorry, I said, but this is who I am. I will not apologize for reading Mrs. King’s letter. And I will not sit down and shut up.\nBefore long the entire Senate voted on whether I would be forced to sit down and shut up. Just before the vote, Senator McConnell stood up to address the Senate and explained the issue this way:\nSenator Warren was giving a lengthy speech. She had appeared to violate the rule. She was warned. She was given an explanation. Nevertheless, she persisted.\nUltimately, every Republican voted to shut me up.\nI was instructed to leave the floor of the Senate and told that I would not be permitted to speak again until after the vote on the Sessions nomination had been completed.\nNow I was spitting mad. I walked straight out of the chamber, talked to my staff, and decided to read Mrs. King’s letter and live-stream a video of it. The lighting wasn’t great. The sound was a little hollow. But we made a video right then and there and put it out on social media. Last time I checked, nearly 13 million people had watched this video, and millions more had viewed Coretta Scott King’s words online.\n***\nWhen I look back, I think of it this way: That night in February wasn’t about me. First, it was about Coretta Scott King and her eloquent testimony describing the enduring legacy of racism and hate in America. And as so many events subsequently proved, she was right.\nBut that night in February was about something else as well. It was about every woman who has ever been told to sit down and shut up—and who is damn tired of it.\nNevertheless, she persisted. In the weeks and months that followed, women everywhere raised their voices and claimed Mitch McConnell’s words as their own. Those words turned up on T-shirts and pink hats. Coffee mugs and tote bags. Decorations for mortar boards at graduation and the title of a new children’s book. Women (and friends of women) had found another rallying cry.\nAnd here’s some more hopeful news. Ever since Donald Trump’s election, people all over the country have been volunteering, organizing, and digging in for a long fight against the Republican effort to tear our democracy apart.\nPeople all across the country have stepped up and said, Count me in. In the space of a few months, long-standing organizations like Planned Parenthood and Sierra Club have welcomed hundreds of thousands of new members. New organizations have sprung up, meeting in living rooms and church basements from Alaska to Florida. Online organizations have formed, grown, divided, re-formed, and grown some more. People have pitched in $10 here and $20 there and signed up to knock on doors and hold signs, putting some momentum behind candidates for office, both those already in the fight and those ready to jump in and run for office for the first time. Neighbors and strangers have been welcomed as people have come together with a common goal to make democracy work again.\nIn the spring and summer of 2017, I held more than a dozen town halls back home in Massachusetts. People stood in long lines, giving up beautiful afternoons and lovely evenings they might have spent out having fun somewhere else. They crowded into high school and college auditoriums, filling them to capacity and spilling over to cafeterias, classrooms and sometimes even parking lots outside. At every event, I got the same question: What more can I do?\nI held one of these town halls at a high school in Concord, Massachusetts. When I jumped up on the stage that evening the energy in the room was awesome. Fifteen hundred people had shown up, and they were ready to make change. Before I started speaking, I paused to look out at the crowd, and I felt a deep thrill. I saw it: here, right here, was democracy at work.\nThe questions were smart and thoughtful and sometimes funny. People asked about free speech, transgender people who serve in the military, and how to build an economy that works for everyone. But the question asked more than any other was a variation on “How can I make my voice heard in Washington?”\nI pushed and pulled, both on stage and afterwards, giving my best advice, urging everyone to speak out, and to keep speaking out again and again.\nLong after the town hall was over and the crowd had thinned out, a young man and woman came up for a picture. They laughed and talked about how glad they were to be there on that beautiful Friday night. They said they were both committed to the fight. Then the woman paused, glanced down and said quietly, “Here’s what I gave myself for my birthday.”\nShe held up her right arm. On the inside of her wrist in a neat script was a tattoo: Nevertheless, she persisted.\nAnd that’s what we will do. We will persist. We will persist, resist and fight every day for the astonishing gift we’ve inherited from the generations of Americans who came before us: our democracy.",
    "source_domain": "abcnews.go.com",
    "title": "Book excerpt: Sen. Elizabeth Warren's 'This Fight Is Our Fight'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/book-excerpt-sen-elizabeth-warrens-fight-fight/story?id=55535744"
}