{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:14:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "The Kremlin has denied that Flynn spoke to Moscow's ambassador about the U.S. sanctions against Russia for interference in the U.S. election.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fus-justice-department-alerted-president-trump-concerns-flynns-45498606.json",
    "image_url": "http://a.abcnews.com/images/WNT/170214_wn_thomas_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for US Justice Department alerted President Trump to concerns about Flynn's calls with Russian envoy\nAs Jon reported here, it was the U.S. Justice department that alerted the white house about their concern involving Flynn. Intelligence authorities going back and listening to those phone calls after something suspicious prompted them to do so. President Obama's sanctions kicking Russian diplomats out of the U.S., and Russia, mysteriously, no retaliation. ABC's justice correspondent, Pierre Thomas on the trail tonight. Reporter: Flynn's spectacular fall started with a hunch by the intelligence community. It began when president Obama issued those tough December sanctions, kicking Russian officials out of the U.S. For hacking the Democrats. Our goal continues to be to send a clear message to Russia. Reporter: But stunningly, Putin didn't retaliate, even inviting American children to a Kremlin party. Donald Trump tweeting at the time, \"I always new he was very smart.\" But suspicious of Putin's failure to counterpunch, the FBI and intelligence community started digging, uncovering the bombshell conversations between Flynn and the Russian ambassador. Acting attorney general Sally Yates and others wanted to notify the white house, but FBI chief James Comey was concerned that the investigation was at too sensitive a stage and could be compromised. But as trump surrogates repeatedly backed Flynn's version of events, Yates decided she had to act, warning white house officials that they had been misled. She worried Flynn was at risk of Russian blackmail. Today Sean spicer insisted then-president-elect trump never told Flynn to discuss the sanctions. Did the president instruct him to talk about sanctions? No, absolutely not. No, no, no. Reporter: Spicer also seemed to blame Yates for the delay in notifying the white house. Why did it take so long? I think the first question should be, where was the department of justice in this? They were aware of this. Reporter: Late today we also learned that the FBI interviewed Flynn the week after the inauguration. Sources declined to comment on what Flynn said, but if he wasn't completely honest, he could be accused of lying to the FBI, a felony. And Pierre Thomas with us live tonight from the FBI. A new interview published with general Flynn skpr, conducted yesterday while he had a job, and they said he crossed, quote, no lines and the president urged him to get out and talk more. Reporter: He insisted his conversation with the Russian ambassador was not about sanctions, but about the diplomats Obama expelled last year, and he said that the president expesed confidence in hear, even though Sean spicer said trust eroded to the point of his resignation a few hours later, David. You can imagine the reaction pouring in from Democrats and\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "US Justice Department alerted President Trump to concerns about Flynn's calls with Russian envoy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/us-justice-department-alerted-president-trump-concerns-flynns-45498606"
}