{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:20:58+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "China defends N. Korea trade after its trucks haul missiles",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fchina-defends-korea-trade-trucks-haul-missiles-46857599.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_3a3a2c805e524425aa02add15dbe4628_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "China defended its trade practices on Tuesday after Chinese-made vehicles were seen towing ballistic missiles during a North Korea military parade despite international sanctions against selling military hardware to Pyongyang.\nSaturday's parade honoring North Korea's country's founder, Kim Il Sung, came amid heightened tensions over the country's nuclear ambitions. It featured a senior official, Choe Ryong Hae, warning of \"all-out war\" if North Korea is attacked.\nPhotos provided by the North Korean government showed the submarine-launched missiles being pulled by trucks bearing the logo of the Chinese company Sinotruk.\nChinese Foreign Ministry spokesman Lu Kang said China conducts \"normal\" business with its neighbor North Korea while adhering to sanctions imposed beginning in 2006 by the U.N. Security Council.\n\"China has been performing its international obligations strictly, including those stipulated in the Security Council resolution. But meanwhile, we carry on normal economic exchanges and trade with all parties including North Korea,\" Lu said.\nChina accounts for an estimated 80 percent of North Korea's foreign trade, along with crucial food and fuel assistance.\nA sales manager for a Sinotruck dealer, Zhongnanhai, said the company exports about 1,000 trucks to North Korea every year under contracts that specify the vehicles are designed and manufactured for civilian use.\nZhongnanhai sells the trucks to a dealer in the border city of Dandong before they are resold to North Korea, he said.\n\"We fully comply with the government regulations. If they are used by North Korea for military purpose, they must have been modified by the North Korean side,\" said the sales manager, who would give only his surname, Wang.\nHe added that his company has \"no way to monitor and approve the use of the trucks by North Korea.\"\nInternational observers have warned that over the past decade North Korea has become adept at circumventing the U.N. sanctions, particularly so-called dual-use equipment that has both military and civilian applications.\nNorth Korea makes use of \"weak transshipment regulations, falsified cargo declarations and shipping documents, reflagging and disguised materials to import banned materials,\" according to a 2015 report for the European Union Institute for Security Studies.\n———\nAssociated Press news assistant Yu Bing contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "China defends N. Korea trade after its trucks haul missiles",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/china-defends-korea-trade-trucks-haul-missiles-46857599"
}