{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 20:55:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Nationals select Darren Baker, Jake Cousins in MLB draft",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fnationals-select-darren-baker-jake-cousins-mlb-draft%2Fstory%3Fid%3D48042769.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170614_MLB_Darren_Baker_in_World_Series_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "WASHINGTON -- The Washington Nationals?drafted the son of manager Dusty Baker and the cousin of Redskins quarterback Kirk Cousins?on Wednesday.\nThe Nationals announced they had selected Darren Baker in the 27th round of the MLB draft. An 18-year old shortstop out of Jesuit High School in Sacramento, California, Baker is already committed to play collegiately at Cal and is not expected to sign with the Nationals.\nThe younger Baker first hit the national radar during the 2002 World Series. Acting as bat boy for his father's Giants team, the then-3-year-old Darren was infamously swept away from home plate by San Francisco first baseman J.T. Snow on a scoring play in Game 5.\nDarren is currently in Washington D.C. with his father and the first-place Nationals. He was selected one round later than his dad, who was taken exactly 50 years ago in the 26th round of the 1967 draft by the Atlanta Braves.\nMeanwhile, Cousins was thrilled with the prospect of his cousin joining him in D.C.\nJake Cousins, a 23-year old right-handed pitcher out of the University of Pennsylvania, went 7-2 with a 3.15 ERA as a senior for the Quakers. The unanimous first-team All-Ivy selection, who is 6-foot-4, was taken by the Nationals in the 20th round.",
    "source_domain": "abcnews.go.com",
    "title": "Nationals select Darren Baker, Jake Cousins in MLB draft",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/nationals-select-darren-baker-jake-cousins-mlb-draft/story?id=48042769"
}