{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 05:06:04+00:00",
    "date_modify": null,
    "date_publish": "2017-01-01 00:00:00",
    "description": "Even Urban Meyer couldn't overcome Clemson's talent edge",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Furban-meyer-overcome-clemsons-talent-edge%2Fstory%3Fid%3D44506453.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_161231_NCF_Interview_Deshaun_Watson_SVP_interview_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "GLENDALE, Ariz. -- Urban Meyer is the winningest coach in college football. He has won three national championships, two at Florida and one at Ohio State. Yet when historians begin to dissect his career, they might view his work with the 2016 Buckeyes as one of his best efforts.\nThat's because No. 2 Clemson, behind the wizardry of quarterback Deshaun Watson and a fast, physical defense, exposed the No. 3 Ohio State team that Meyer brought to the PlayStation Fiesta Bowl as young and toothless. The Tigers won 31-0, and it was the first time that a Meyer team failed to score in his 15 seasons and 194 games as a head coach.\nThe victory gives Clemson a chance to redeem its loss to Alabama in the College Football Playoff National Championship a year ago on this same University of Phoenix Stadium grass. When Tigers head coach Dabo Swinney called a timeout with :50 to play, a frenzy of delight erupted on his sideline. Senior linebacker Ben Boulware bunny-hopped down the sideline in front of the roaring, orange-clad faithful above him.\n\"I felt I had the right to be a little bit excited,\" Boulware said in the locker room. \"We had been grinding for three long weeks. To go out there and shut them out, dominate an Ohio State team, I was exuberant. That was probably the highest I've ever jumped in my entire life, honestly. I think I rolled my ankle when I landed.\"\nOhio State's scoring streak ended at 295 games dating to a 28-0 loss to Michigan in 1993, so long ago that Meyer was coaching wide receivers at Colorado State at the time.\nThe Buckeyes' 12-1 record obscured the fact that they began this season with the fewest returning starters -- six -- in the FBS. Although the oddsmakers predicted a close game, the dominance of Clemson (13-1), especially at the line of scrimmage on both sides of the ball, drove home the difference in experience, with an emphasis that increased the longer the game went.\n\"I think that's the most yards they've given up all year,\" Swinney said of Ohio State. \"We had 470. Anytime we can have the balance we had -- 200-plus run and pass -- we're a hard team to handle, especially when you've got the best player in the country in Deshaun Watson making decisions out there for you.\"\nWatson, the junior who finished in the top three of Heisman Trophy voting the past two years, played well in his second career game at this stadium. Last season, in a 45-40 loss to Alabama, Watson accounted for 478 yards of total offense and four touchdown passes. On Saturday, Watson finished with 316 total yards, threw for one score and rushed for two more.\nHis 33-yard run in the second quarter defied belief, if not the laws of physics. Watson slid to left end with tight end Jordan Leggett running interference. When Leggett bodied up on safety Malik Hooker, Watson turned upfield, then started sliding to his right. One stutter step put him in the open field, and off he went to the right sideline, stepping out at the Ohio State 33.\nYes, he threw two picks, raising his season total to 17, but one came on his first pass of the night, when wide receiver Mike Williams slipped, and the other came because Hooker, the Buckeye All-American, plays center field as if he's Willie Mays. Like Mays did, Hooker wears No. 24.\nAfter Watson's second rushing touchdown, a 7-yarder in the third quarter through a hole blasted truck-wide by center Jay Guillermo and left guard Taylor Hearn, Watson did a little dance that he learned from NBA superstar LeBron James in front of the Ohio State fans.\n\"I'm a huge LeBron fan,\" Watson said. \"I know he likes Ohio State. So I had to do it.\"\nWatson didn't dominate alone. The box score is riddled with examples. It's not that Ohio State rushed for only 88 yards. It's that the Buckeyes attempted to run only 23 times. Freshman back Mike Weber had five carries and fumbled two of them. Clemson defensive linemen Christian Wilkins, Carlos Watkins and Clelin Ferrell combined for seven of the Tigers' 11 tackles for loss. The Tigers sacked Ohio State quarterback J.T. Barrett three times and hit him a lot more. Barrett completed 19 of 33 passes for only 127 yards.\nThree times in the first half, Ohio State had a third-and-1. Once, Barrett tried to run wide, and Ferrell threw him down for a loss of 6. On the second one, guard Billy Price got flagged for a false start. On the third, tight end Noah Brown drew the laundry for a hold.\nThat's how a team plays when it realizes that what it's doing is not enough. A long time ago, in a press box far, far away, former head coach and ESPN analyst Mike Gottfried said something to me as profound as it is simple: \"The team with the better players usually wins.\"\nThis was Clemson's night. This was Clemson's moment. The coaches sensed something good would happen.\n\"I didn't see that. We felt great. When I woke up this morning, I just got a really good feeling,\" defensive coordinator Brent Venables said. After the morning walkthrough, he said, \"You knew we were not going to beat ourselves. We might lose the game, but we're not going to beat ourselves.\"\nActually, Venables knew that Thursday night when he performed bed check at curfew.\n\"There's no, 'I wonder if they're going to be there,'\" Venables said. \"It's like, 'I hope I'm not waking them up.'\"",
    "source_domain": "abcnews.go.com",
    "title": "Even Urban Meyer couldn't overcome Clemson's talent edge",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/urban-meyer-overcome-clemsons-talent-edge/story?id=44506453"
}