{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 10:15:27+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "US official says Russia deployed missile in treaty violation",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fus-official-russia-deployed-missile-treaty-violation-45503452.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/us-official-russia-deployed-missile-treaty-violation-45503452",
    "language": "en",
    "localpath": null,
    "maintext": "Russia has deployed a cruise missile in violation of a Cold War-era arms control treaty, a Trump administration official says, a development that complicates the outlook for U.S.-Russia relations amid turmoil on the White House national security team.\nThe Obama administration three years ago accused the Russians of violating the 1987 Intermediate-Range Nuclear Forces Treaty by developing and testing the prohibited cruise missile, and officials had anticipated that Moscow eventually would deploy it. Russia denies that it has violated the INF treaty.\nU.S. intelligence agencies have assessed that the missile became operational late last year, said an administration official, who wasn't authorized to publicly discuss the matter and demanded anonymity.\nThe deployment may not immediately change the security picture in Europe, but the alleged treaty violation may arise when Defense Secretary Jim Mattis attends his first NATO meeting in Brussels on Wednesday. It also has stirred concern on Capitol Hill, where Sen. John McCain, the Senate Armed Services Committee chairman, called on the Trump administration to ensure U.S. nuclear forces in Europe are ready.\n\"Russia's deployment of nuclear-tipped ground-launched cruise missiles in violation of the INF treaty is a significant military threat to U.S. forces in Europe and our NATO allies,\" McCain, R-Ariz., said in a statement Tuesday. He said Russian President Vladimir Putin was \"testing\" Trump.\nTrump's White House is in a difficult moment, with no national security adviser following the forced resignation Monday night of Michael Flynn. He is accused of misleading Vice President Mike Pence about contacts with a Russian diplomat while President Barack Obama was still in office.\nMeanwhile, a U.S. defense official said Tuesday that a Russian intelligence-collection ship has been operating off the U.S. east coast, in international waters. The official was not authorized to discuss an intelligence matter and so spoke on condition of anonymity. The ship had made a port call in Cuba prior to moving north, where it has been monitored off the coast of Delaware, the official said.\nThe New York Times, which was first to report the missile deployment, said the Russians have two battalions of the prohibited cruise missile. One is at a missile test site at Kapustin Yar and one was moved in December from the test site to an operational base elsewhere in the country.\nThe State Department wouldn't confirm the report. It noted that last year it reported Russia was in violation of its treaty obligations not to possess, produce or flight-test a ground-launched cruise missile with a range of between 500 and 5,500 kilometers, or to possess or produce launchers for such missiles.\n\"The administration is undertaking an extensive review of Russia's ongoing INF treaty violation in order to assess the potential security implications for the United States and its allies and partners,\" State Department spokesman Mark Toner said.\nJohn Tierney, executive director of the Center for Arms Control and Non-Proliferation, said strategic stability on the European continent is at stake.\n\"If true, Russia's deployment of an illegal ground-launched cruise missile represents a very troubling development and should be roundly condemned,\" Tierney said.\nSen. Tom Cotton, an Arkansas Republican, sees little reason for the U.S. to continue adhering to the INF treaty, in light of Russia's violations. He has recommended building up U.S. nuclear forces in Europe, which currently include about 200 bombs that can be delivered by aircraft. The U.S. withdrew land-based nuclear-armed missiles from Europe as part of the INF deal.\nThe treaty has special significance in the recent history of arms control agreements. Signed in December 1987 by President Ronald Reagan and Soviet leader Mikhail Gorbachev, it has been credited with helping accelerate an end to the Cold War and lessening the danger of nuclear confrontation. It stands as the only arms treaty to eliminate an entire class of U.S. and Russian weapons — nuclear and conventional ground-launched ballistic and cruise missiles of intermediate range.\nThe Obama administration had argued for maintaining U.S. compliance with the treaty while urging the Russians to halt violations. At the same time, the Pentagon developed options to counter Russian cruise missile moves, some of which would have involved bold military action.\nAt his Senate confirmation hearing in February 2014, Ash Carter, who headed the Pentagon until last month, said disregard for treaty limitations was a \"two-way street,\" opening the way for the U.S. to respond in kind. He called Russia's violations consistent with its \"strategy of relying on nuclear weapons to offset U.S. and NATO conventional superiority.\"",
    "source_domain": "abcnews.go.com",
    "title": "US official says Russia deployed missile in treaty violation",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/us-official-russia-deployed-missile-treaty-violation-45503452"
}