{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 22:02:18+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "ABC News correspondents break down White House press secretary Sarah Sanders' press briefing.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fwhite-house-responds-spygate-claims-roseanne-cancellation-55541463.json",
    "image_url": "https://s.abcnews.com/images/Politics/180530_vod_briefingroom_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for White House responds to 'spygate' claims, 'Roseanne' cancellation\nEither everyone and welcome to the briefing room on the ABC news political director Rick Klein and we missed you it's been awhile guy since they are not yet had the pleasure having everything joined here by Devin Dwyer and Catherine folders we'll get Jon Karl. It was just in the briefing room. In a moment but yes it's been awhile since briefings and as a whole lot of topics to cover and I want to start with one that that broke. Yesterday the first time that we heard from a Republican who was part of those classified briefings last week the FBI was. Explaining. The the information that launched the initial investigation into the Russia and Russian battling. Almost at the same time that this interview with Trey Goudie was appearing on TV president trump was out there are once again talking about how they had infiltrated his campaign talk about Hillary Clinton and Barack Obama. Tree Goudie blew that out of the water yesterday said he didn't see anything inappropriate DeVon. The white house on the defense of a little bit today Jon Karl leading off the question what do you make how they're handling this. Well you know Republicans have been conspicuously silent since the president spend a leveling these accusations but these. Friday meeting with the Justice Department where they saw this classified information about this alleged FBI informant. Really was it was a moment you know of truth for the for Republicans president said it was very easily going to show. That his cases allegations were correct. And as you said Rick this was a bombshell last night on Fox News not only betray Goudie can mounts in the FBI did the right thing. Robert you had judgment Pollack Tonto. Prominent fox personality who the president listens to see the same thing called the claim baseless and when Jon Karl put those allegations those responses those rebuttals to sir Sanders today. As she basically didn't have a very good answer she basically said the president still believes what he believes he still sees this is a cause for concern. But she didn't have any evidence whatsoever to back up the president's claim. Yet and cause for concerns what they're saying now but but unless there's something else out there he is just spinning this did to spit and he's talking about it publicly even though there is nothing in the public record. That if anyone has seen anyone has brought forward to suggest that it's even closer. Through the right exactly he's the totally spinning and then the reporting that started this in the first place who wasn't didn't have anything to do with the spying. In the campaign that was a conservative media spin on it which then the president capitalized on so pretty remarkable that two of his staunchest supporters trade outing in just about time and we often. Quotes on Twitter are calling this baseless and that it pretty much throwing cold water on all of that. An intriguing also the president decides to tweak this morning trade Audi a quote withstand the quote from trade Goudie. But quoting him on Jeff Sessions and the and the issue of refusal and then adding at the end of this that they get Goudie saying only to the president which you've chosen another attorney general president says yes guided duke but. I wish I had IN and we were talking weather slowed a bit before I sell it you know week the president has often been. Expressed publicly his anger for Jeff Sessions recusing himself from the Russia probe but. Come out and just saying it actually yeah I wish I didn't choose another agent that's pretty new. And I think we can't we set the big picture here which Rudy Giuliani shed light on last week and some very very revealing comments in an interview he gave he said the president. Is pursuing this pushing this Fannie and this as a campaign ploy and as a defense mechanism against smaller probe and so that's why. All these little sort of conspiracy theories that you see the president pushing. Sort of big bubble up they burst up they go away because there's not a lot of raw evidence there to support them. On but Giuliani's admission about work with striking this is really about politics. Well speaking of politics and campaign plays the president was out on the trail last night in national I'd say he was in rare form but he was kind of in the form that you always see him. I think to look a little what the president had to say his new rallying cry for twenty for twenty team. If you want your communities to be said. If you want your schools to be said. India want you can't seem to be sent. Did you must go out and yet did Democrats. The hell out of office because there is no comments yet. And mother Nancy Pelosi. So I feel like the back. They had people infiltrating our camp now. They're gonna pay for. For the wall. I think it would Juliet okay. And we get we could spend the whole show up fact checking all of those planes but I want to talk that turn to Jon Karl who's in the briefing room a moment ago when the president. Unfurled a whole lot us strongman and out baseless accusations and flat out falsehoods. Needs you get a sense that this is this is the the new normal or the only normal we're gonna know for 48 in. We're gonna go lobs but a lot of. Our time fact checking of what I thought was extraordinary in that briefing is right at the beginning I asked. Sarah Sanders if the president was gonna retract his allegations about spies in this campaign now that we have heard. From one of the Republicans that was in for the classified briefings who saw all of the evidence. About what the FBI was doing in their in their Russian investigation. Tree Goudie has come out. And said these are baseless. Allegations that the FBI did exactly what the American people would have wanted to the FBI to do it had nothing to do with. Donald Trump and so I asked it is the president gonna retract those allegations and and Sarah said the president still has concerns. Still has concerns is not willing to back down an inch on any of this despite. The evidence that is then Aaron despite. The fact that you have somebody that was not only briefed on this by the FBI but somebody who has been an ally of this White House. Not not a political follow not one of the Democrats. That have been beating the war drums on this but somebody who is on essentially on the president's side saying there's no evidence to this allegation. And it is at a piece John with the president creating a reality that simply isn't real that the whole. List of things MS thirteen loving Nancy Pelosi a piece of that last night. Mexico's gonna pay for that long they're gonna love doing any these are not true this is not actually happening. That's the reality he's trying to paint it some of this conspiracy theory some of it is baseless accusations. Absolutely and and the president's been known to to do this and clearly when it comes with. When it comes to the investigation. We forward from Rudy Giuliani is outside counsel there's an explicit strategy to a road the credibility. Of the special counsel in the eyes of the American public. That this is part of that effort to a road the special counsel's. Credibility so that way and Robert Moore comes out with his report if it is damaging in anyway to the president. They will of already undermined the credibility of of all of the special counsel in the eyes of a good chunk of the American public put. But it's just odd I have to be I have to confess it's just ought to come in. To the briefing in debt asked. You know question that seems pretty basic you have. Again somebody who has seen the evidence somebody who is inclined to support the president. Say that there was no spying on the trump campaign. And the president. Continues to make that allegation I don't know where you go from here. And I think what's troubling to so many of us John who are advocates for the facts I know you're one of those people. Is would the impact that this seems to be have been on and on voters on the public opinion. Of the president third there's a lot of evidence that his. Conspiracies if you will are sticking their swaying people's opinions and you know you're a veteran of many campaigns in your following the democratic side of things as well Democrats are sort of scrambling. To figure out how to counter this when he speaks from the bully pulpit it's sort of its works. It doesn't in fact if you look at that rally in national last night. One of the big applause lines was when he which did this thing that this this allegation about. About spying the other ones that Rick mentioned the you calling Nancy Pelosi MS thirteen loving. Against something it's just not true I mean you might have it too close you may have a very different idea how to take on MS thirteen hundred deal with immigration. But she doesn't law of a murderous. Gang that's not that's natural but it was a big applause these are big applause line we've seen time and time again the president. Loves to feed off the energy of that crowd and when he's feelings customer needs me he keeps going with it. And John before we let you go want to move on to the did the the issue of North Korea be that the top North Korean official on US oil right now going to be meeting later today we believe in tomorrow with the secretary of state. Mike Pompeo John is a little bit weird because officially. If I'm not mistaken the summit still off. The president canceled it. Didn't he hasn't on canceled the the cancellation under. And coming guys. As single or whether it is the site and I like his is nonrefundable but it but the majority. It is a weird little split screen because now it seems like all systems are go even though officially this is an on the books it seems more likely than not is that your assessment of this on it happens. It certainly seems more likely than not you have you mentioned the meeting in New York very significant meeting. But you also have the meetings in Singapore with Joseph Hagan deputy chief of staff you also having third round of meetings. At the DMZ with US officials in North Korean officials. Looking at the the substance of a possible agreement. So you have you have a lot of activity going on the plans were in place for the summit to happen. But because it is so close. Because we're talking about something that. That that is happening. You don't less than two weeks. Anything can throw this off track so. It could stick could be derailed still the White House hasn't officially put it back on the schedule but they are calling it an expected summit. That's close to having it back on the schedule was you can be so I'm expecting a rate that yes the sum it's gonna happen I have not canceled my tickets. Devin can tell you by the way I believe this I believe that I have nonrefundable. Tickets so that I wouldn't do me a lot of good to cancel them in the first place. But yes I plan to be adding Singapore. Well we'll see with C over there whether you're gonna get a cover not. Jon Karl thanks sir thanks for joining today. Isn't the topic everyone is talking about the last 2436 hours. The president was silent on for awhile strangely silent I think a lot of us assume that he'd. He tee off at some point he did inspection at the rally last night but he didn't go to Twitter to DA and in his first comments about Roseanne who. Who show of course was was canceled by ABC yesterday. His response wasn't on the substance of Roseanne he avoided that instead it was criticism of our boss the head of the ahead of Disney Bob Iger. He seems to be suggesting that he is owed an apology. From from Bob Iger for things that have been said about him on ABC. Oh right any went in terra Sanders stay went down. A laundry list of examples center now how Kathy Griffin joined there are on the radio. And that have spoken poorly as she set up for the president. But you're right he is not comment on the substance we thought that he probably would during the rally given how. I'm he's praised Roseanne that in the past but instead he's really turning the attention to. Himself thumb another way to attack what he calls the fake news and that's all we've heard from him no no reaction of the substance just. Upset that he didn't get a phone call. But as we increase our centers had no one's defending Roseanne here but it is it is intriguing how the president turns this into the broader argument that he makes against the press. In this situation where it's it's hard to defend what I think almost everyone would view was indefensible comments by Roseanne. Instead taking attack both of attacking the media. Right did that they talk. What a double standard we can talk all they about a double standard in both directions with this White House. In terms of mistakes accuracy the facts. Presentation. But what I was struck by not only have they sort of left the substance of the Roseanne comments alone here I think Bob Iger swift. Cancellation which shocked everybody in the political world the entertainment world. Left no room no wiggle room for the president's supporters to sort of obfuscate the issue at the beginning in the front end. And sort of sucked all the oxygen out of it and so that is very agency last thanks to the president at a campaign rally and not they go there. Even a lot of supporters and and conservative television commentator is coming out against the says well people who heat I'm speaks to regularly so again. Still shocking and hasn't reacted to it and anyway and finally as we can confirm that there is he Kim summit happening at the White House today. It happens we can press Sheehan this is a weird one guys so hope we hope we can help unpack a little bit what's going on at the summit's about sentencing reform it's a strange cost this out. Submitted by this story this is a story of Kim Kardashian who is sort of adopted. A 62 year old grandmother who's been imprisoned life sentence without parole for fruit on drug charges. Are adopted this woman's case seeking a pardon from the president has befriended Jerryd crusher of all people. Who is this White House is advocate for prison reform and has been invited to come and meet. The great irony of course is the president thinks that anyone who there has said publicly that anyone who has been a drug dealer should be. Facing the death penalty. And here today his son in law. Kim Kardashian in in there talking about a pardon for this woman. Which by the way was an issue that President Obama was a big champion for. Right I'd I'll be interested to see if she. Needs that the president and anyway I'm in red they haven't confirmed that we don't know if that's scurrying back. Can be a good topic of conversation hadn't chased behind when he said previously he had his White House it's never sees this just. They have some surprise visitors as Fries yes all right that does it for this edition of the reviewer for Devin Dwyer Catherine Fuller's. I'm Rick Klein will be back here next time with another edition of the ready room.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "White House responds to 'spygate' claims, 'Roseanne' cancellation",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/video/white-house-responds-spygate-claims-roseanne-cancellation-55541463"
}