{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 16:40:06+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Katherine Faulders reports from the White House South Lawn on the 139th annual White House Easter Egg Roll.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Ftrump-family-hosts-1st-white-house-easter-egg-46843838.json",
    "image_url": "http://a.abcnews.com/images/US/170417_gostream_faulders_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump family hosts its 1st White House Easter Egg Roll\nI've economy BC's captured spotters think you for joining us on FaceBook live ABC news politics they abcnews.com. We're here at 139. Anniversary of the White House Easter raw you can see behind me the White House in the background were in a lovely frame here we have. Many families excited families waiting to take their picture here Lisa there was reason parlance here. Thrilled as usual it's a little rainy out here but we're still having a great time out to bring you along. Up here you could see in this White House Easter egg roll sign here again at 100 by 39 anniversary a about the longest lasting. White House tradition this year. Point one balance and gas are expected to attend a smaller than it was 30000 here but nonetheless. 40000 people on the South Lawn of the White House is. Quite the crowd you can see everybody's lining up tick and next to assigned now this tradition originated 150 years ago it's on Capitol Hill. Where children roll there eastern on Capitol Hill and members of I'm Capitol Hill wanted to and its political the president's backyard here right at the south on its feet White House behind us. Lots of fun games going on we have who aren't all we have. Easter egg dying car dying the president is expected here at 1030 it's raining. I'm so we should CD spoke about a 1030 but he's expected to. Molson Easter eggs over there and then may make his way down down the South Lawn here no this going on. For over. For a really really long time obviously over a hundred years congressman that the White House in 1978 this isn't and has only been canceled. Inclement weather think gosh we're still here today but I'm only for instant weather and during World War I and world words that. So is the longest lasting. Tradition here at the White House is as you can see you we're shooting some corn and very exciting kid. Over here. Yeah I kind of want to pick when it is up and if I can make it. Right area we're gonna try this. I don't ruin them in games out I think you've seen. I got on the board kind of as you can see lots of corn all happening here and I just knew this down there on the other side and his presidential podium. Right then that lots of kids obviously its order for lots of kids to take their photo behind that podium that penny and you see it. Sean Spicer the white house Press Secretary at pretty much every day here so. Lots of fun games where we didn't see any way down there they have soccer going and I believe the DC united team is down there. They're here because the president's son Barron is huge fan of soccer so they're down airplanes the lots of activities going on I would bring you up. As you can see lots of family and lots of not sensitive playing around here. Now this is where I believe the white house Press Secretary with reading to kids. Earlier I'm not sure anybody in their right now that he was reading an Easter booked up here you can see it lots of kids sitting on long the rain doesn't seem to be the tying them. And that's actually the attorney general eyes as attorney general Jeff Sessions. Let let's go to him and I can hear them yes thank them. Eight. Rain or third. Walgreen. Or moderates. Korea vote this morning you'd like to do that. This. The man is an Asian and I think. It is not easy. Being a bunch. In my life. Aren't. In the hunt for anything donated. Thank you turn itself uses this story you're ready. PJ. Funny money. We've fears that be enough life being alive. That is the it is my remaining. Yeah yeah me sixers 88. Eight. One day yeah it is to leave home. Oh on behalf on any horses begin. I wanted me. Oh yeah. Home there evil entity. Yeah you have to live with the prayers. I I. Really cool program. Thanks home where. And again. Turning to Enron Jeff Sessions meaning the kids with his wife.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump family hosts its 1st White House Easter Egg Roll",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/trump-family-hosts-1st-white-house-easter-egg-46843838"
}