{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:14:52+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "2017 home and away opponents for every NFL team",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2F2017-home-opponents-nfl-team%2Fstory%3Fid%3D44514571.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_r164152_576x324_16-9_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Now that the NFL regular season is over, the 2017 opponents for every team have been finalized. The dates and times of each game will be determined in the spring, when the full regular-season schedule is released.\nClick the links after each team to view the full lists.\nArizona Cardinals: Neither the Cardinals' road or home schedule will be easier than the other next season. It's 2016 playoff teams galore.? Full list .\nAtlanta Falcons:?With a first-place finish in the NFC South, the Falcons will face the first-place teams in both the NFC East and NFC West: Dallas and Seattle. The latter is Atlanta's only extended trip. Full list .\nBaltimore Ravens:?The Ravens defense will be tested again next season with a 2017 slate featuring five of the league's top quarterbacks. Full list .\nBuffalo Bills:?The Bills have the misfortune of playing the AFC West next season, including a road matchup with one of the two division's 2016 playoff teams. Full list .\nCarolina Panthers:?The Panthers have the potential for some cold games with trips to Chicago, Detroit, New England and New York (Jets). Full list.\nChicago Bears:?Strength of schedule is overrated. The Bears supposedly had one of the easiest 2016 schedules -- and they finished 3-13. On paper -- outside of the division -- Chicago's schedule appears palatable. Full list.\nCincinnati Bengals:?On the surface, this looks like a much easier schedule than in 2016, when the Bengals faced six playoff teams. Next season won't be a walk in the park, however. Full list.\nCleveland Browns:?Any team that stared down an 0-16 finish should consider any schedule tough. But overall, this is a Browns-friendly slate.? Full list .\nDallas Cowboys:?There hasn't been a repeat champion in the NFC East since 2003-04. And with?seven games against 2016 playoff teams on the docket for Dallas next year, it could be a challenge for the Cowboys to break that trend. Full list .\nDenver Broncos:?It could be a season of transition for the Broncos, but the Super Bowl 50 champs will get five of their toughest opponents at home in Denver. Full list .\nDetroit Lions: It's an intriguing lineup for the Lions, but one that is likely to be more difficult than the records of their opponents would indicate. Full list .\nGreen Bay Packers:?For the second straight year, the Packers won't have to play west of the Central time zone, making their travel about as light as possible. Full list .\nHouston Texans:?The Texans might not be able to rely on divisional play for five or more wins next season as? Andrew Luck?is no longer Houston's only threat in the AFC South. Full list .\nIndianapolis Colts:?The Colts have missed the playoffs in back-to-back seasons, but hope could be on the horizon with only four games vs. 2016 playoff teams -- two of which are against Houston. Full list .\nJacksonville Jaguars:?The Jaguars -- who will have a new head coach -- could be facing as many as six new head coaches in 2017. Full list .\nKansas City Chiefs:?The 2017 schedule will be no picnic for the Chiefs no matter how the games are ordered: They have eight games against 2016 playoff teams. Full list .\nLos Angeles Rams:?The Rams will lose a traditional home game for the second straight year by hosting Arizona from London. The 2017 schedule will be challenging but not as difficult as the one from 2016. Full list .\nMiami Dolphins:?This is not an easy schedule for Miami, which finished second in the AFC East. The Dolphins will get at least three tough games against the AFC West, one of the best divisions in the NFL. Full list .\nMinnesota Vikings:?The Vikings' schedule will include at least four games against playoff teams. It probably represents a step up in class after the Vikings faced the meager AFC South this season. Full list .\nNew England Patriots:?The Patriots will be traveling to Denver for the third straight regular season, and they will also take on the Falcons and Panthers at home.? Full list .\nNew Orleans Saints:?The opponents aren't any more overwhelming than in any typical year, but the locations could make for a grueling travel schedule with a pair of potential cold-weather games and trips as far east as London and as far west as Los Angeles. Full list .\nNew York Giants:?Get the frequent flier miles ready. The Giants will do a lot more traveling in 2017, making four trips to Denver and beyond. Full list .\nNew York Jets:?The AFC West, one of the best divisions in the league, is on the docket for the Jets next season with a road trip to Oakland.? Full list .\nOakland Raiders:?Could another trip to Mexico City be on the horizon for the Raiders? Either way, it'll be a marquee home slate in 2017, with four 2016 playoff teams coming to the Bay Area. Full list .\nPittsburgh Steelers: The Steelers get a slight upgrade to the schedule in 2017, with?only a few games that stand out as major challenges. Full list .\nPhiladelphia Eagles:?The Eagles have been fortunate to log a limited number of air miles during the past two seasons, but that will change with three West Coast trips. Full list .\nSan Diego Chargers:?The road schedule is tough for the Chargers, with five playoff teams and four games on the East Coast. But the home schedule has several winnable games. Full list .\nSan Francisco 49ers:?The best news for San Francisco is the NFC West has lost some of its luster. And while the?NFC East will?provide a stiff test for the 49ers, they also get the AFC South. Full list .\nSeattle Seahawks:?Even though it's a first-place schedule, the 2017 slate doesn't appear all that daunting at first glance. Full list .\nTampa Bay Buccaneers: Tampa Bay will need some momentum heading into a 2017 schedule that features four 2016 MVP candidates.? Full list .\nTennessee Titans: Next season looks manageable for the Titans, with only two opportunities for cold-weather games and at least?four games against teams with new coaches. Full list .\nWashington Redskins: Three home opponents with?10 wins in 2016, three others who were strong?Super Bowl contenders and three West Coast trips -- three reasons Washington's 2017 schedule doesn't look easy. Full list .",
    "source_domain": "abcnews.go.com",
    "title": "2017 home and away opponents for every NFL team",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/2017-home-opponents-nfl-team/story?id=44514571"
}