{
    "authors": [
        "Abc News",
        "More Karma"
    ],
    "date_download": "2017-08-15 06:20:48+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 00:00:00",
    "description": "CEOs quit Trump's manufacturing council amid backlash over Charlottesville response",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fceos-quit-trumps-manufacturing-council-amid-backlash-charlottesville%2Fstory%3Fid%3D49219652.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_e958dfbd596044a58fc2a79f65e2664a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Intel’s chief executive officer Brian Krzanich announced Monday that he would resign from President Donald Trump's American Manufacturing Council -- becoming the third CEO to do so in a day -- as the president dealt with criticism over how he responded to a deadly white nationalist rally in Charlottesville, Virginia over the weekend.\nKrzanich announced the resignation in a blog post on the chipmaker's website late Monday night.\n“I resigned to call attention to the serious harm our divided political climate is causing to critical issues, including the serious need to address the decline of American manufacturing,” Krzanich said. “Politics and political agendas have sidelined the important mission of rebuilding America’s manufacturing base.”\nKrzanich also said he had urged other leaders to condemn the white supremacists who took part in the Virginia rally.\n“I have already made clear my abhorrence at the recent hate-spawned violence in Charlottesville, and earlier today I called on all leaders to condemn the white supremacists and their ilk who marched and committed violence,” Krzanich said.\nI stand with others for equality and improving US competitiveness. Both require\nimproving in todays environment. https://t.co/RcjpGaFXBQ — Brian Krzanich (@bkrunner) August 15, 2017\nTrump has faced mounting pressure over his initial response to the rally on Saturday, which left one dead and 19 injured after a car-ramming attack. Police arrested James Alex Fields, 20, and charged him with second-degree murder in the incident.\nKevin Plank, CEO of athletic wear design company Under Armour, and Kenneth Frazier, head of Merck -- one of the largest pharmaceutical companies in the world -- also quit the 25-member advisory panel on Monday.\nPlank said he would resign because he did not want to engage in politics.\n“Under Armour engages in innovation and sports, not politics,” Plank said in a statement Monday evening. “I love our country and our company and will continue to focus my efforts on inspiring every person that they can do anything through the power of sport which promotes unity, diversity and inclusion.\"\nFrazier, who had been the only African-American CEO to serve on any of the president’s several business advisory groups, announced early Monday morning that he would step down “as a matter of personal conscience.”\n“America's leaders must honor our fundamental values by clearly rejecting expressions of hatred, bigotry, and group supremacy, which run counter to the American ideal that all people are created equal,” Frazier said. “As CEO of Merck and as a matter of personal conscience, I feel a responsibility to take a stand against intolerance and extremism.\"\nTrump slammed Frazier on Twitter a few hours after the announcement.\n“Now that Ken Frazier of Merck Pharma has resigned from President's Manufacturing Council,he will have more time to LOWER RIPOFF DRUG PRICES,” Trump said Monday morning.\n“@Merck Pharma is a leader in higher & higher drug prices while at the same time taking jobs out of the U.S. Bring jobs back & LOWER PRICES,” Trump wrote in a separate tweet.\nNow that Ken Frazier of Merck Pharma has resigned from President's Manufacturing Council,he will have more time to LOWER RIPOFF DRUG PRICES! — Donald J. Trump (@realDonaldTrump) August 14, 2017\n.@Merck Pharma is a leader in higher & higher drug prices while at the same time taking jobs out of the U.S. Bring jobs back & LOWER PRICES! — Donald J. Trump (@realDonaldTrump) August 14, 2017\nThe president came under fire on Saturday after he said both sides were to blame for the violence that occurred at the rally.\nTrump later denounced neo-Nazis and the Ku Klux Klan as “criminals and thugs” on Monday amid growing pressure from political leaders on both the right and left who criticized the president for not condemning the out hate groups by name.\nHe followed the remarks with a tweet saying \"Made additional remarks on Charlottesville and realize once again that the #Fake News Media will never be satisfied...truly bad people!\"",
    "source_domain": "abcnews.go.com",
    "title": "3 CEOs quit Trump's manufacturing council amid backlash over Charlottesville response",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/ceos-quit-trumps-manufacturing-council-amid-backlash-charlottesville/story?id=49219652"
}