{
    "authors": [
        "Abc News",
        "More Stephanie"
    ],
    "date_download": "2018-07-04 09:46:49+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Residents of Satellite Beach, Florida are worried that high levels of chemicals called PFOS and PFOA at a nearby Air Force base are connected to the cancer rate.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fflorida-community-raises-alarm-potential-cancer-link-water%2Fstory%3Fid%3D56340438.json",
    "image_url": "https://s.abcnews.com/images/Politics/Whitney-Prieto-ht-hb-180703_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Whitney Prieto was diagnosed last September with stage 2B triple negative breast cancer. She was 35, early in her pregnancy with twins and said she had no family history or genetic mutations that could make her especially susceptible to the serious disease.\nPrieto said that she knew of six or seven classmates from Satellite High School in Satellite Beach, Florida, who were also diagnosed with uncommon cancers when she was diagnosed but that she now knows of about 20 -- all at about the same time.\nShe said the types of cancer being diagnosed in her classmates, now in their 20s and 30s, raised a red flag, but particularly concerning was what she read in an article in the Military Times in April.\nAP\nThe article reported that wells used to monitor groundwater contaminants at nearby Patrick Air Force Base showed levels of chemicals from military firefighting foam higher than what the Environmental Protection Agency (EPA) considered safe.\nPrieto is demanding the state find out if the test results and cancer rates among her and her former classmates are connected.\n“We could all be linked because of this common source and from there it’s just, it’s amazing how many stories we have now,” she said, adding, “It’s alarming, it’s very alarming, and the information that’s come out in these citizen meetings, it’s eye-opening.”\nThe chemicals found in the groundwater wells at Patrick Air Force Base go by the acronyms PFOS and PFOA. Both are suspected of harming development in children, interfering with hormones or cholesterol levels, affecting the immune system or increasing the risk of cancer, according to the Centers for Disease Control.\nBut the situation in Satellite Beach is not clear cut. The EPA’s recommended limit for PFOS and PFOA is specific to drinking water, but the tests at Patrick Air Force Base involved groundwater at the base.\nA spokeswoman for the Florida Department of Environmental Protection told ABC News that drinking water systems in Brevard County, which includes Satellite Beach, tested negative for PFOS and PFOA.\nWhen potentially dangerous levels of PFOS and PFOA were discovered in drinking water supplies at 19 military installations the Air Force moved to clean them up. But it hasn’t yet done the same for groundwater unless nearby residents were also using it as drinking water.\nThe Air Force has been investigating PFOS and PFOA at all its facilities since about 2010 and began to replace firefighting foam that includes the chemicals.\nThe Air Force did not comment for this story but Maureen Sullivan, deputy assistant secretary of defense for environment, safety and occupational health, told Military Times the Defense Department has made changes at bases where drinking water was affected by contamination \"to cut off human exposure as soon as possible,\" but it could be years to address cleanup of the groundwater around the bases.\nWhitney Saller Prieto/Facebook\nThe science on connections between PFOS and PFOA exposure and cancer and other health problems is also not definitive.\nSome research has linked the chemicals to cancer in animals, including a recent government study that found they caused health problems in animals at exposure levels much lower than the EPA’s recommended limit.\nBut the same study said researchers can’t conclude that what happened with animals would be the same for humans.\nOne of Prieto’s classmates, Julie Greenwalt, was diagnosed with cancer of the appendix two years ago. A radiation oncologist, she is now recovered.\n“I definitely think it’s just so suspicious that all of us got diagnosed within a couple of years of each other, which means we were all exposed around the same time,” she told ABC News.\nGreenwalt said she’s become the face of residents’ concerns that there is a connection between PFAS and cancer, and that since the Military Times article, people have called her at her clinic saying they want to get their own water or blood tested. She said one resident was going door-to-door with the article to share it with neighbors who don’t use social media.\n“I feel like Erin Brockovich,” Greenwalt told ABC News, referring to the environmental activist whose fight with a utility company over contaminated water was the subject of a movie starring Julia Roberts.\nGreenwalt has been talking to the city of Satellite Beach and the state health and environmental departments -- all looking into citizens’ concerns.\nAnd while the Environmental Protection Agency is still working on regulations to address emerging concerns about PFOS and PFOA, around the country communities like Satellite Beach are dealing with fear.\nAlmost all Americans are exposed to some amount of these chemicals, according to a 2007 study, but recent testing by local governments and the Department of Defense has found hot spots where the levels are much higher.\nDangerous PFAS levels have been identified in at least 190 communities around the country and in tests at 126 military facilities, according to information compiled by researchers at Northeastern University and the Environmental Working Group, leading to calls for the government to regulate and clean up the chemicals.\nFor example, all 28 groundwater wells tested at Patrick Air Force Base, near where Prieto lives, showed potentially harmful levels of PFOS and PFOA, ranging from 71 parts per trillion -- just slightly over the EPA’s acceptable limit –- to as high as 4.3 million parts per trillion.\nAnd even though PFOS and PFOA chemicals haven’t been used in manufacturing in years, they have been found in groundwater and drinking water systems around the country.\nPFOS and PFOA chemicals got into the environment through firefighting foam the Air Force used starting in the 1970s. The chemicals, also used in hundreds of waterproofing products like nonstick pans, Teflon and Scotchguard, also have seeped into the water, soil or air from manufacturing facilities or spills.\nWhen the EPA calculated its recommendation of how much PFOS or PFOA it was safe for humans to consume through drinking water it actually had to factor in that the majority of people's exposure to the chemicals is through sources other than water, such as their diet, dust or even products used on carpets and furniture.\nIn Satellite Beach, Prieto and Greenwalt are speaking to more than 1,400 residents and past residents about their concerns that groundwater contamination is somehow related to their cancers or cancer in their family. The state environmental department and health agency are collecting information from residents to determine the next steps and the city has agreed to test more groundwater wells for PFOS and PFOA.\nPrieto said she is pushing to get their story out and make sure any connection between water contamination and cancer in the community isn't pushed under the rug.\n\"It's time to try to be heard, and bring awareness to this issue. I have a younger sister that went to that high school, the problem we have now is we're all being diagnosed at these young ages and there's no screening,\" she said.\n\"Unfortunately we're losing people and that shouldn't be happening.\"",
    "source_domain": "abcnews.go.com",
    "title": "Florida community raises alarm about potential cancer link to water contamination",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/florida-community-raises-alarm-potential-cancer-link-water/story?id=56340438"
}