{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 11:03:34+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Ionescu lifts No. 6 Oregon over No. 25 Cal 91-54",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fionescu-lifts-oregon-25-cal-91-54-52812692.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_b3279241d3eb4d27ac3de3ea1a7ae0ce_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Oregon coach Kelly Graves nearly ran out of superlatives to describe his team's performance after the No. 6 Ducks delivered just the way he drew it up.\nSabrina Ionescu had 28 points and 11 assists to lead Oregon over No. 25 California 91-54 on Friday night.\n\"I'm really pleased,\" Graves said. \"I thought we played a great game tonight at both ends of the floor.\"\nRuthy Hebard added 18 points and 11 rebounds for the Ducks (21-3, 10-1 Pac-12), who have won 13 of 14 games. Ionescu's double-double was her 11th of the season.\nIt was Oregon's largest margin of victory in a conference game this season. The Ducks already were outscoring their opponents by 21.4 points per game, tops in the Pac-12.\nSatou Sabally had 10 points and another freshman, Anneli Maley, had nine off the bench as nine Ducks scored.\n\"It feels good,\" Graves said. \"I think what makes this team really special is that on any given night, it's just another player and on some nights lots of different players.\n\"Cal is a very good team, and tonight we got them on their heels early and got going offensively. We took care of the ball, we rebounded well and we shot it well.\"\nJaelyn Brown led the Golden Bears (15-7, 6-5) with 14 points and Alaysia Styles added 12. Kristine Anigwe, California's leading scorer at 17.5 points per game, had just six to go with eight rebounds.\nAfter a sluggish first quarter, Oregon pulled away with a 10-0 run in the second to lead 46-29 at the break. Ionescu had 15 points in the first half. The Golden Bears were effective early with aggressive double-teams against Ionescu, but they weren't able to maintain it.\n\"We have the tools to do that for 40 minutes,\" California coach Lindsay Gottlieb said, \"but I think Oregon hitting a couple shots took us out of that mentality, and you can't do that against them.\n\"Any time Oregon found a little crack and scored, it took the wind out of us a little bit and didn't allow us to do it the high level we needed.\"\nThe Ducks dominated inside with a 40-28 rebound margin and 20-10 edge in second-chance points. They also turned 13 turnovers into 21 points.\nIonescu was 9 of 13 from the field and 4 of 7 from 3-point range as Oregon finished 34 of 66 overall for 51.5 percent. The Golden Bears shot just 21 of 55 for 38.2 percent.\n\"They were more disruptive defensively than I expected and used their length really well,\" Gottlieb said.\nBIG PICTURE\nOregon improved the nation's best home record to 14-0 after being bumped off the No. 4 line for the top seed in the Spokane Region by Notre Dame in Thursday's latest reveal by the NCAA selection committee. The Ducks are now fifth, with UConn, Mississippi State and Louisville holding the top three spots.\nCalifornia, which is trying to reach the NCAA Tournament for the sixth time in Lindsay Gottlieb's seventh season as coach, is 0-7 against top 25 teams and 0-2 against the top 10. The Golden Bears face their eighth ranked team Sunday at Oregon State.\nPOLL IMPLICATIONS\nOregon likely needs a sweep by beating No. 24 Stanford to keep its No. 6 ranking, highest in school history. The Ducks have been in the top 10 for 12 consecutive weeks.\nCalifornia will have to snap a six-game losing streak to Oregon State to hang on to its No. 25 ranking.\nSTAT OF THE NIGHT\nOregon topped its season averages for points (91), shooting percentage (51.5), 3-point percentage (47.4) and assists (23). The Ducks rank in the top 10 nationally in all four categories.\nSHE SAID IT\nGottlieb was the latest coach to come away impressed with Ionescu, the sophomore who leads the Pac-12 in scoring (19.8 ppg) and assists (7.7). \"Sabrina has an uncanny ability to make everyone around her better and make the offense flow,\" Gottlieb said. \"They have other good players as well who knocked down shots, but she puts a lot of pressure on your defense, and their team responds to that.\"\nUP NEXT\nCalifornia: Plays at No. 16 Oregon State on Sunday.\nOregon: Hosts No. 24 Stanford on Sunday.",
    "source_domain": "abcnews.go.com",
    "title": "Ionescu lifts No. 6 Oregon over No. 25 Cal 91-54",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/ionescu-lifts-oregon-25-cal-91-54-52812692"
}