{
    "authors": [
        "Abc News",
        "More Katie"
    ],
    "date_download": "2017-06-14 19:24:56+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Mom turns to Facebook to thank 'Walmart angel'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fmom-turns-facebook-find-walmart-angel-helped%2Fstory%3Fid%3D48034662.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/HT-collier-car-02-rc-170614_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jennifer Collier was trying to load groceries into her car while holding her 7-month-old daughter in 100 degree weather Monday when she said her keys became locked in her car.\nCollier, of New Columbia, Illinois, said she used the remote start feature on her car to begin cooling it off and then threw her keys and phone in the passenger seat while she loaded groceries from the local Walmart into the trunk of her car.\nShe quickly realized that her car doors had locked and only her trunk was open, meaning she would have to slide through a very tiny space to get to a door and unlock it.\nJennifer Collier\n\"I was just standing at the trunk of the car with my daughter thinking what do I do now,\" Collier recalled. \"I couldn’t call anybody because I didn’t have my phone.\"\n\"My first thought was to borrow a phone and call my husband, but he was out of town about an hour away,\" she said.\nCollier scanned the parking lot and recognized a woman who had commented that Ellie was \"beautiful\" while they were in the store. The woman was dressed in hospital scrubs so she thought would be a good person to ask for help.\n\"She came running up with her baby and said she needed help,\" said Stacie Nourie, the stranger Collier recognized from the store.\nCollier asked Nourie, an occupational therapy assistant who was on her way home from work, if she would hold Ellie while she tried to squeeze through to the front seat. Instead, Nourie volunteered to squeeze through herself and handed Collier her work ID badge so it wouldn’t get lost.\n\"I shimmied through the little hole and unlocked the door,\" Nourie said. \"I told her, 'We moms have to stick together. It’s no big deal.'\"\nCollier said Nourie, whose name she didn't know at the time, then disappeared before could say a proper thank you.\n\"She was this blonde, smiling angel who appeared out of nowhere and then disappeared just as quickly,\" Collier said.\nCollier took to Facebook, using the first name she remembered from Nourie's ID badge, to search for the woman she called her \"Walmart angel.\"\nNourie’s niece saw the post and texted her that she was going viral.\n\"She said, 'Aunt Stacie is that you?,' and I read it and said, 'Yes it is. How did you make that connection?'\" Nourie recalled. \"And she said, 'It just sounded like you.'\"\nStacie Nourie\nNourie got in touch through Facebook with Collier, who discovered she grew up in the same town, Metropolis, Illinois, where Nourie now lives. The two women have been in touch and Collier plans to give her a thank you gift soon.\n\"She’s the hero,\" Collier said of Nourie. \"We’re glad that the story had touched some people and hope it would inspire other people.\"\nNourie, a mother of two, said she is overwhelmed by the response and Collier’s gratitude.\n\"I just saw another mother in need and of course I was going to help her,\" she said. \"It’s just instinct to help as a parent, or as anyone really.\"",
    "source_domain": "abcnews.go.com",
    "title": "Mom turns to Facebook to find 'Walmart angel' who helped her",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/mom-turns-facebook-find-walmart-angel-helped/story?id=48034662"
}