{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-05-31 01:59:51+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Speaking of s-words, Williams said, \"Mine is ‘sure.’ My mom’s is ‘steadfast.'\"",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FStyle%2Fserena-williams-launches-themed-line-empower-women%2Fstory%3Fid%3D55548082.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/serena-williams-gty-mt-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "One day after Serena Williams made headlines for wearing a \"catsuit\" on the court at the French Open, the 23-time Grand Slam champion has launched a fashion line of her own.\nCalled \"Serena\" and sold exclusively online, pieces range from $35 to $250, according to Women's Wear Daily, and include athleisure wear, dresses, outerwear and more.\nWilliams told the fashion publication that she wanted to be sure to create a clothing that felt \"practical,\" but also one that focused on the concept of an s-word, including her name.\n“Everyone can have an ‘s’ word. Mine is ‘sure.’ My mom’s is ‘steadfast.’ A really good friend of mine who has been through a lot, her ‘s’ is ‘survivor,’” Williams explained to WWD. “This is a huge thing that I’m doing right now and a huge undertaking, and I need to be sure. And sometimes even when I walk out onto the court, I’m not sure, I’m not sure I’m going to win. I need to be more sure of myself and more confident in myself. And that’s coming from me. And I feel a lot of people can relate to that.”\nWilliams, 36, has worked in fashion before, having developed lines with HSN and Nike. However, this line is the first one she's done on her own, and she made sure not to rush the process, especially given her evolving personal life. Last September, Williams and her now-husband, Reddit co-founder Alexis Ohanian, welcomed their first child, daughter Alexis Olympia Ohanian Jr.\n“At one point I was going to come out with it in November before I got married, and I remember thinking, ‘I don’t want to do that because I want to be able to enjoy my honeymoon and enjoy the wedding,’ so we just kept putting it off and changing and adding, and I’m glad we waited,\" she said. \"Life is all about timing, right? I just feel now is the right timing. ... And with all the movements that are going on with women and young girls standing up and doing marches and talking about #MeToo, and standing up for their own rights -- that should be automatically [rights] we have -- but enforcing that and saying ‘these are our rights’ — it’s timing.”\nNow, Williams is hoping the clothing resonates with women like her, and inspires those who may need a boost every now and again.\n\"The customer is a girl or a woman who believes in herself, or wants to believe in herself; maybe she’s feeling unconfident that day,” she said. “And someone that is unapologetically themselves, and that maybe they stand out; maybe they stand out because they are strong or they’re beautiful or they want to not be the norm. Our woman is someone who looks at fashion as a compass to show who they are, to show what they are.”\nSerena, SerenaWilliams.com\nSerena, SerenaWilliams.com\nSerena, SerenaWilliams.com",
    "source_domain": "abcnews.go.com",
    "title": "Serena Williams launches an S-themed line to empower women",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Style/serena-williams-launches-themed-line-empower-women/story?id=55548082"
}