{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 08:27:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Memphis coach Fizdale blasts 'unprofessional' officiating",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fmemphis-coach-fizdale-blasts-unprofessional-officiating-46856201.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_fbf335038db44275a204aeccc56e5049_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Memphis coach David Fizdale blasted the officiating in Game 2 of the Grizzlies' first-round series against the Spurs, deeming it \"unprofessional\" and \"unacceptable\" before slamming his fist on a table and storming off.\nSan Antonio held off a late rally to beat Memphis 96-82 on Monday night to take a 2-0 lead in their first-round matchup.\nFizdale said the veteran crew of Danny Crawford, Rodney Mott and Bill Spooner \"did not even give us a chance\" to even the series. After initially saying he needed to \"have a glass of wine on the plane\" to analyze what happened, Fizdale unleashed a nearly two-minute tirade during a postgame interview that grew increasingly louder.\n\"It was a very poorly officiated basketball game,\" Fizdale said. \"Zach Randolph, the most rugged guy in the game, has zero free throws, but somehow Kawhi Leonard had 19 free throws?\"\nLeonard had a postseason career-high 37 points and made all 19 free-throw attempts. The Grizzlies took 15 free throws as a team against San Antonio's 32 even though Memphis attempted 35 shots in the paint, 17 more than the Spurs.\n\"I'm not a numbers guy, but that doesn't seem to add up,\" Fizdale said.\nAdding to Fizdale's consternation was the fact that Memphis rallied from a 26-point deficit in the second half and had an opportunity to win after a 29-point blowout in Game 1.\nThe Grizzlies closed within 75-71 early in the fourth quarter, but San Antonio responded with 3-pointers by Tony Parker and Pau Gasol in rebuilding their double-digit lead.\nLeonard shot all four of the Spurs free throws in the final quarter while the Grizzlies were limited to one on a three-point play by Marc Gasol.\n\"I felt like I got fouled the times that I went to the line,\" Leonard said. \"Memphis is a physical team throwing a lot of bodies at me. I guess I did something and the refs were paying attention and I was able to get to the line.\"\nThe trio of Crawford, Spooner and Mott have officiated more than 400 playoff games over careers that span more than two decades for each, but Fizdale was irate with their performance.\nFizdale wasn't sure if his status as a first-year coach or his team's decorum had anything to do with the lopsided numbers, but he wasn't happy with the result.\n\"Kawhi shot more free throws than our whole team, explain it to me,\" Fizdale said. \"We don't get the respect that these guys deserve because Mike Conley doesn't go crazy, he has class and he just plays the game. But I'm not going to let them treat us that way. I know (San Antonio coach Gregg Popovich has) got pedigree and I'm a young rookie, but they are not going to rook us.\n\"That's unacceptable, that was unprofessional. My guys dug in that game and earned the right to be in that game and they did not even give us a chance.\"\nGame 3 is Thursday night in Memphis.\n———\nMore AP basketball: https://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "Memphis coach Fizdale blasts 'unprofessional' officiating",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/memphis-coach-fizdale-blasts-unprofessional-officiating-46856201"
}