{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:56:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Few major Western leaders to attend Chinese summit",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmajor-western-leaders-attend-chinese-summit-46856672.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_5459285440f14fed8576c996b23ecbcc_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Leaders of 28 countries are set to attend a Chinese summit next month showcasing President Xi Jinping's signature foreign policy initiative, but few will hail from major Western countries.\nChinese Foreign Minister Wang Yi said Tuesday that Vladimir Putin of Russia, Recep Tayyip Erdogan of Turkey and Spain's Mariano Rajoy are among those slated to appear next month in Beijing to discuss Xi's \"One Belt, One Road\" program to stitch together the Eurasian continent with infrastructure investment.\nThe May 14-15 summit is seen as a measure of China's international prestige at a time when Xi has positioned China as a rising outward-looking regional power, and as questions have arisen over President Donald Trump's commitment to maintaining the United States' traditional global leadership.\nWang said leaders from France and Germany will not attend due to their domestic election schedules, not because they snubbed China.\n\"This is a positive, cooperative conference, it shouldn't be politicized,\" Wang told reporters in Beijing, in response to a question asking if China felt insulted by the absence of top leaders from the U.S. and its allies, including Japan, Britain and Australia.\nChina has sought to frame Xi's vision for the China-led development program as an inclusive, mutually beneficial project rather than a statement of geopolitical ambitions that should arouse Western suspicions. The program aims to build roads, railways, ports and other infrastructure along the ancient Silk Road's maritime and overland routes with close to $100 billion in funding.\nThe program is closely linked to the Asian Infrastructure Investment Bank, China's version of a global financial institution that faced similar Western skepticism upon its formation last year. In the year since, the bank has succeeded in attracting U.S. allies as members, including Germany, Canada and Britain, although Washington continues to maintain its distance.\nXi unveiled the first outlines of his Belt and Road plan as early as 2013, but the inaugural summit next month will provide the Chinese leader the most high-profile stage so far to deliver a focused pitch to a world audience.\n\"This is an economic cooperation forum, an international cooperation platform that everyone is paying attention to, supports and hopes to participate in,\" Wang said, characterizing the summit as an effort to uphold globalization.\nAside from Putin, other Chinese allies including Pakistani President Nawaz Sharif and Myanmar's Aung San Suu Kyi will attend, as will Philippine President Rodrigo Duterte, Indonesian President Joko Widodo and Italian Prime Minister Paolo Gentiloni, Wang said. British Finance Minister Philip Hammond will also attend in the place of Prime Minister Theresa May.",
    "source_domain": "abcnews.go.com",
    "title": "Few major Western leaders to attend Chinese summit",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/major-western-leaders-attend-chinese-summit-46856672"
}