{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 05:06:44+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Raiders' Matt McGloin (shoulder): I plan to be 100 percent for Texans",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fraiders-matt-mcgloin-shoulder-plan-100-percent-texans%2Fstory%3Fid%3D44506796.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170101_nfl_raiders_mcgloin_injury_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "DENVER -- Matt McGloin suffered an injury to his left shoulder in the Raiders' 24-6 loss to the Broncos?on Sunday,?putting Oakland's quarterback situation in an even tougher spot entering the playoffs.?\nMcGloin, making his first start since regular No. 1 Derek Carr broke his leg, was replaced by rookie Connor Cook.\nMcGloin was injured on a late hit by Broncos defensive end Jared Crick with less than two minutes left in the first half. Cook, the Raiders' fourth-round draft pick out of Michigan State, made his NFL debut after not being active all season, and he completed two of his first three passes for 8 yards.\n\"I wanted to play out there tonight,'' McGloin said. \"If I'm not 100 percent healthy, that's not what this team needs. I plan on being 100 percent healthy (for AFC wild-card opponent Houston).''\nCook finished 14 for 21 for 150 yards, with one touchdown and one interception. He also lost a fumble.\nMcGloin, meanwhile, was just 6 of 11 for 21 yards as the Raiders trailed 17-0 at halftime. He was originally ruled questionable to return as he went to the locker room after being worked on by trainers on the sidelines.\n\"I got hit pretty good (on) the play,\" said McGloin, whose record as a starter in the NFL fell to 1-6 with his sixth straight loss in his first start since 2013. \"I saw the hit on the replay and saw it was helmet to helmet. But sometimes that happens. You got to take those shots as the quarterback.\n\"I couldn't throw in a motion that I'm used to, my normal motion. I'll get in there bright and early tomorrow to get treatment to get ready.\"\nRaiders coach Jack Del Rio would not commit to a starting quarterback for next weekend's playoff game at Houston, though did intimate McGloin would get the nod if he was healthy.\n\"Obviously, (McGloin) has more experience in our system, a little bit longer,\" Del Rio said. \"But I thought Connor did a nice job, with the opportunities that he had.\"\nCook said the game came \"fast\" for him and that the Raiders ran plays he had never run before in practice. He had not dressed for a game all season until Sunday.\n\"Going the whole week not getting a lot of reps and just being thrown out there, it's just the name of the game,\" Cook said. \"When you're playing the quarterback spot, if one man goes down then it's next man up. I was frustrated I didn't get out there and get some reps. I was trying to get the timing down with the receivers, but it didn't go the way we wanted it to go.\"\nIf McGloin can't go, Cook would be the first quarterback to start a playoff game without starting a regular-season game in the Super Bowl era (since 1966), according to Elias Sports Bureau.\nThe Associated Press contributed to this report.?",
    "source_domain": "abcnews.go.com",
    "title": "Raiders' Matt McGloin (shoulder): I plan to be 100 percent for Texans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/raiders-matt-mcgloin-shoulder-plan-100-percent-texans/story?id=44506796"
}