{
    "authors": [
        "Abc News",
        "Emily Shapiro",
        "More Emily"
    ],
    "date_download": "2017-08-14 21:17:45+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Natalie Romero suffered injuries including a fracture in her skull.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fmother-uva-student-injured-charlottesville-attack-calls-daughter%2Fstory%3Fid%3D49209117.json",
    "image_url": "http://a.abcnews.com/images/US/ericka-chaves-ap-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The mother of a young woman injured when a car plowed into a group of people protesting a white nationalist rally in Charlottesville, Virginia, Saturday, called her daughter \"my hero.\"\nNatalie Romero, 20, had just completed her freshman year at the University of Virginia in Charlottesville, her mother, Ericka Chaves, said at a news conference today in Houston, Texas.\nChaves said that Romero, one of the many injured in the Saturday crash that killed one person, was left with a fracture in her skull, a badly damaged lip and a gash on her forehead.\nChaves said Romero's injuries are non-life-threatening and she is getting better but is not yet able to talk.\nChaves said she told her daughter, \"I love you. I want you home. Don’t cry.\"\nThe crash that killed a young woman and injured people including Chaves took place at a Unite the Right rally protesting Charlottesville's plan to remove a Confederate statue from a local park.\nThe rally was attended by neo-Nazis, skinheads and Ku Klux Klan members, and the white nationalists were met with hundreds of counter-protesters, which led to street brawls and violent clashes.\nYin Bogu/Xinhua/Newscom\nJames Alex Fields Jr., 20, is accused of plowing into counter-protesters, including Chaves. He has been charged with second-degree murder, three counts of malicious wounding and one count related to leaving the scene. He was denied bail this morning as he secures an attorney.\nChaves said her daughter told her she was going to protest the rally and she warned her to be careful. She said Romero sent her Snapchats while there.\nOn Friday night, Romero and her friends were at the university when people started throwing torches at the group, Chaves said. Romero and her group were also confronted on Saturday while marching and singing, Chaves said, claiming that police did not intervene.\nCharlottesville Mayor Michael Signer today defended the police response, telling ABC News, \"We had a thousand law enforcement personnel on the ground, in a city of 50,000 people, to deal with, thousands of people coming here. I am not going to criticize or second-guess our police.\"\nAfter President Donald Trump was criticized this weekend for not labeling the ramming an act of terrorism or denouncing the white supremacists, instead calling the incident \"violence on many sides,\" the president today condemned hate groups, including white supremacists, saying, \"racism is evil.\"\nChaves said today at the news conference, “I don’t want President Trump’s words. I want actions.”\nChaves said she is hoping today or Tuesday to learn if her daughter is well enough to travel via medical ambulance to Houston.\nChaves said her family is reaching out to government officials to help facilitate her daughter's travel back to Texas as the family does not have the funds to do so.\nSigner told ABC News today while this weekend was \"painful,\" \"we’re not going to let them define us.\"\n\"They’re not going to tell our story,\" he said. \"We’re going to tell our story. And outsiders -- their time has come and gone. This city is back on their feet and we’re gonna be better than ever despite this weekend.\"\nSigner compared his hopes for Charlottesville's recovery to the aftermath of Charleston church shooting in June 2015 that killed nine people. The gunman in that attack wanted to start a race war, but the tragedy instead united the city.\n\"There’s a memorial right now in front of Charlottesville City Hall that’s flowers and a heart that talks about the love that we have here. Those are the images that are going to replace these horrific ones from this weekend. That’s the work that we have as a country,\" Signer said. \"That’s what happened in Charleston. There were those horrible images of those people bloodied and killed and weeping from the church. But they were replaced quickly, steadily, by the work that started to happen. By people who said, 'You’re not going to tell our story for us. We’re going to tell our story.'\n\"And that’s what’s happening in this community. That’s my work as the mayor here -- is not to allow these hateful people who just don’t get this country to define us,\" he said. \"And they’re not going to define us.\"\nABC News' Eva Pilgrim, Allie Marzella and Allie Busalacchi contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Mother of UVA student injured in Charlottesville attack calls daughter 'my hero'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/mother-uva-student-injured-charlottesville-attack-calls-daughter/story?id=49209117"
}