{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 04:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "ABC News' Amna Nawaz is behind the scenes at the Westminster Kennel Club Dog Show just before the big event.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fmeet-dogs-competing-best-show-45500012.json",
    "image_url": "http://a.abcnews.com/images/US/170214_vod_best_in_show1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Meet the dogs competing for 'best in show'\nHey what's up everybody I'm on the live in New York we are apt. At the 141. Annual Westminster. Kennel Club dog show. These are the champions that your witness earlier you saw some of the other reading groups in the competition that are going down. Tonight's beat the big dogs the big winner as they come down to the group competition at sporting working and Harry air. And the big guns. Best in shows that we're down in the Pratt area right now and I'm with Greg Snyder at night doing that and you know we have here. We have late champion bull fields boundary waters and cool. His face and you guys congratulations and one that didn't read earlier yes we did. And you have a little bit up of close to a strict Ellen there don't you in the count in that category but we do today. I am with my 21 pastor read here Westminster and I count here for 33. I think it's. And always with this street rallies with an Irish voters think it's only about average waters in the study of about. Well I love I love there. You know they are totally Irish they're unpredictable. That you never know what's gonna happen. On potato. Maybe they're just they're just agree greeted. And so this is like tell us about lake. Well on the late. Name is five years old. And although he is my god I haven't had them all that long I just got in the December inspection owning them I own with two other winning. And and they started his career and it was time it is possible return and that he. Take a go ahead sue and I couldn't. He's he's here with me. Now I gotta tell you I don't know if you guys can see that great that you get a shot at that this is a packed area down here we're sort of in the bowels of Madison's her heart and all the other dogs here some are still in their crates getting ready for the competition late without getting groomed along with the mother only thing remaining stock home right now. Well wait at the declines and. It's nothing bothers absolutely and he's one. For this parade in many of them that this probably wouldn't be easiest thing. Late this links not bothered by it. Competition is coming up very shortly the group what do you doing now to get ready what's happened. Well I'm right now I'm just sort of weighing him down at his coat bringing out the best Carly should have a nice tight curl on the body shouldn't future. Nice they are on the body. News reports honestly some. Who owns the holy city. Lovely and killing unit of Rockingham laying here yup and you kind of straightening hair out of battle look. That's just this time just starting the process when a minute do it and done inside sort of just lifted the coat. And then I'll wedding gown and bring the curls back into. At the whole process it is takes a bit of time well he is lovely and good luck to you thank you very much thank you haven't paid. There and lake everybody let's move on here we're gonna move a little bit further down the line. Excuse me I mean get in the way at every once pictures here. I can see thousands of people show here. Dog lovers and fans alike. All great chance to speak at six yeah. Adorable puppies. I'm sorry I'm thinking different. Okay. You can see all the owners and handlers are always happy to answer questions they're happy to talk to people I am I. I'm nobody Eli nice to meet stand sneaky to rebound from New Hampshire rape and knew we had here this is it's Barak. Grants and busy bees Qatar. When it in her full name. Our cloning as Qatar and tell us about it's are. So that's how this could no italiano. She's an Italian I think Donna. Up land bird but all around personal dogs still do on anything from and a big gains net. Byrd sent rabbit says squirrels. And what is her crap like right now for the competition would you do get around it's my it's very easy they're must thus be a wash and Wear adopting the right field in the Washington where Washington win yet. Larry don't weigh as much crap as some dog's name. They have a very sports coats nothing really sticks and we'll get hurt at Brescia out make shares doesn't. Healthy bad everything that everything as a whites and what's the secret to making your dog has its moment Listerine. Stop every. That I that excitement there is hope and let's entirely like do you know she's just perfect to be that show not at a game here. I'm we know what hurts to be honest but and we found now I think just as we went along she not our first and Tony. But she is art. We think are pretty S been Downey and you're great I'll absolutely. And as she's gone along this season learn how to be in the show ring and what it's like what she needs that need of reform. And that's helped us enjoy it as well as herself and enjoy it. And we want to keep doing it with parents had even in the ring near before it was since I have not know. It's your first time to show it is my great passion but I'm not showing and I'm an owner and Indiana learn about my mom Holly's gonna show. You're going to be showing act I Ali. I Mario and it is your first time in the ring I'm now I let that top senior and I have for years when I was a young girl. And I haven't been back really to Westminster and 42 years sounds different and that includes here pretty teary what does it feel like to be back that's pretty exciting. What's gonna be even their before but when you like when you get in the rain that you got. Actually I don't get nervous any mart I think it's been nice night and is showing so much use as telling us senators and this is just a different now are now breathe and I just now allowed plan but I don't really get nervous anymore and it was abundantly in the green today of course I like to win. It's just out. This is just one minute docs isn't nice or. She is remaining still com and Levy announced a list like this services we always yet this is agreed they're very mountain. And when I go out hunting they stick with you they don't run away like a line expand the what are your hopes for its thing. Any placement would be nice has been Downey has never placed in the sporting group and Westminster Nancy make history with its are eating it. I'm sorry make history with a tie and I don't sound great but not now then I would be excited about. Doesn't sell it be and credible matter. I think he is lovely thank you so much for your time it's. Thank you know. Like yeah yeah. The well. What better way. And hey guys are you so much for being with that here. At the Westminster dog show don't forget the winner of tonight's competition is believed to be on Good Morning America tomorrow morning select companies to tonight. I that he winds and then catch them live tomorrow morning on TV the I'm confident about from the ABC news right now thanks for joining and in addition tonight I.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Meet the dogs competing for 'best in show'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/meet-dogs-competing-best-show-45500012"
}