{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:22:10+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The Senate is reviewing allegations Ronny Jackson created a hostile work environment.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fconfirmation-hearing-hold-trumps-va-pick-54705460.json",
    "image_url": "https://s.abcnews.com/images/WNT/180424_wn_bruce2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Confirmation hearing on hold for Trump's VA pick\ntonight, major new scrutiny for president trump's personal physician, who became his nominee for secretary of veterans affairs, Ronny Jackson, the current white house doctor. He was set to be questioned tomorrow. Tonight, that's now been put on hold. Amid serious allegations. Tonight, what he's accused of, and there is word coming in late today that the president has now met with him, and the president telling him, he will fight for him. Here's ABC's Mary Bruce. Reporter: Dogged by allegations of professional misconduct, tonight, the president's pick to lead the V.A. Under intense scrutiny. Is there any truth to these allegations? Will you withdraw your nomination? Admiral Ronny Jackson's confirmation hearing now on hold, as the senate reviews allegations he created a hostile work environment, and as white house physician, improperly dispensed medication, specifically the sleep aid ambien. The top Democrat on the committee says Jackson is also accused of being repeatedly drunk on duty when traveling with the president, though he didn't provide any evidence. On capitol hill today, Jackson insisted he's eager to answer the committee's questions. I'm looking forward to re-scheduling the hearing and getting the process moving. Reporter: Just moments later, the president asked what he knows. Well, I haven't heard of the particular allegations. But I will tell you, he's one of the finest people that I have met. I would definitely stand behind him. He's a fine man. Reporter: The president blamed partisan politics. But then, added this nudge -- suggesting, why bother moving forward? I wouldn't do it. What does he need it for? To be abused by a bunch of politicians? I really don't think personally he should do it, but it's totally his -- I would stand behind him. Totally his decision. Reporter: Even before these new allegations, there were questions about whether Jackson, the president's personal physician, is up to the task of leading the government's second-largest agency. I know there's an experience problem. Reporter: But the president and Jackson have hit it off. Just three months ago, Jackson offered this glowing review of trump's health. I told the president that if he had healthier diet over the last 20 years, he might live to be 200 years old. I don't know. I mean, he -- he has incredible -- he has incredible genes. Reporter: Even then, Jackson discussed prescribing sleep aides for long trips. I recommend that everyone on the plane take a sleep aid at certain times. Reporter: Tonight, even some Republicans say they need more time to review Jackson's nomination. I think the proper thing to do is not to reach any conclusions. Reporter: But critics say the white house failed to do its due diligence. It is really frustrating to me that this administration continues to not vet or sloppily send over a nominee that leaves us having to really vet them and look at serious questions. Reporter: So, the white house failed to properly vet him? Apparently, yes. Let's get to Mary Bruce. And Mary, you're learning that Ronny Jackson met with president trump late today. What have you heard? Reporter: He did, David. And the white house tells us today that despite what the president said today publicly, tonight, the president is planning to fight back. A senior official tells me that Jackson is getting rail roaded and that his record is impeccable. David, the white house says that Jackson has a clean bill of health here and that he has no plans to withdraw his nomination. David? Mary Bruce following the developments on the hill. Mary, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Confirmation hearing on hold for Trump's VA pick",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/confirmation-hearing-hold-trumps-va-pick-54705460"
}