{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 18:52:49+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "A friend says James Hodgkinson would \"never back down from anybody.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Ffriend-suspected-shooter-describes-happy-lucky-guy-48038174.json",
    "image_url": "http://a.abcnews.com/images/US/170614_vod_orig_suspect_friend_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Friend of suspected shooter describes 'happy-go-lucky guy'\nHe's a happy go lucky guy. He. And he it just took me by surprise of what happened. As a child you you rant to execute me I'm 65 previous two years older than me his Brothers the same age as me he was a two years ahead of me I went to high school with his brother about his political. That I. I don't know anything about that it is a political science and part of that house. Not that I know through the years he he he didn't back down things I mean he was in a few bites it. And stuff like that but nothing that would demonstrate violence as far as what he did it again I. What do you mean like Wally never backed down from anybody in a bar fired or whatever he. He stood his ground but it was thing and it's tough for what was political know it was something that malls. Guys. I just want to let people know that he wasn't evil. That he was I guess tired some of the politics of going on just like in this state we got politicians collecting a paycheck. And do an absolutely nothing for it I don't know his politics. But but I can see. How he's pretty well fed up with some other stuff I'm fed up with what's going on in this thing. He was passionately believe what you Coleman advocates role was with the school he was in control video digitally if you say no I'm not that I know. And not that I know. But whatever he believed in he stood behind it a 100%.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Friend of suspected shooter describes 'happy-go-lucky guy'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/friend-suspected-shooter-describes-happy-lucky-guy-48038174"
}