{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 22:58:26+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A video captured the awkward yet cute moment when Jordan McLinn attempted to give President Donald Trump a hug on Wednesday.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fyoung-boy-attempts-hug-president-trump-signing-act%2Fstory%3Fid%3D55543073.json",
    "image_url": "https://s.abcnews.com/images/Politics/trump-terminally-ill-bill-gty-jef-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A video captured the awkward yet cute moment when Jordan McLinn attempted to give President Donald Trump a hug on Wednesday.\nInterested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nHolding the signing pen in hand, McLinn received a hug and kiss on the forehead after a few attempts at trying to capture the president’s attention.\nThe instance occurred at the signing of the \"Right to Try Act\", a piece of legislation focused on allowing patients with terminal illnesses to have access to experimental treatments that may improve or even cure their condition.\n\"Right to try. That's such a great name,\" Trump said. \"Some bills, they don't have a good name. Really. But this is such a great name, from the first day I heard it. Right to try. And a lot of the trying is going to be successful. I really believe that. I really believe it.\"\nAlong with his mother, McLinn has been a continuous advocate of the passing of the bill across various states. McLinn, who hails, from Indianapolis has a deadly form of muscular dystrophy.\n\"The Right to Try Act\" will bear McLinn’s name and four other individuals.\n“Thanks to you, the countless American lives will ultimately be saved,” Trump said. “We'll be saving – I don't want to say thousands because I think it's going to be more. Thousands and thousands, hundreds of thousands. We're going to be saving tremendous numbers of lives.”\nPresident Trump also teased the coming drop in prescription drug prices and potential new actions to undercut the Affordable Care Act.\n“People will see for the first time ever in this country a major drop in the cause of prescription drugs. Right?” Trump asked of his HHS Secretary Alex Azar. “Mr. Secretary, that's already happening, right?”\nABC News' Alexander Mallin contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Young boy attempts to hug President Trump at the signing of the 'Right to Try Act'",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/young-boy-attempts-hug-president-trump-signing-act/story?id=55543073"
}