{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:26:05+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "The \"GMA\" anchor team discusses a \"Jeopardy!\" moment and takes a closer look at a video of a ticked-off basketball fan whose confrontation with a player went viral.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fgma-hot-list-jeopardy-contestants-stumped-football-category-52808197.json",
    "image_url": "http://a.abcnews.com/images/GMA/180202_gma_hotlist_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 'GMA' Hot List: 'Jeopardy!' contestants stumped by football category\n62 hot list from GMA today it's just after the Denver Nuggets but they're beating victory over Oklahoma City a fan you can see they're steps onto the court you can write in the faith of Oklahoma City Thunder star Russell Westbrook had never having kids who look different we were down you know lowered his friend. Throw stuff that they say things to you that if you were face to face would audit uniform one big woods. Talking football with the category but not only did all three contestants not get any of them right they didn't even bother to bug didn't. You think we should go to commercial. Looks like no your producer Molly did not know that Eli Manning with a quarterback that's child you know I'm sure she is really appreciating no right. The argument in the lockers give them 39 Mike always thought get obviously it in the perfect job he did. And I could sit down a little fits the development go out on the night and OK I haven't wizardry you who's your favorite team made of all time that Michael Strahan. If these fires and that's the GMA hot list from today we'll see you in the morning on GMA.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "'GMA' Hot List: 'Jeopardy!' contestants stumped by football category",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/gma-hot-list-jeopardy-contestants-stumped-football-category-52808197"
}