{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 03:16:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Mexico's latest captured ex-governor once his party's future",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmexicos-latest-captured-governor-partys-future-46850430.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_937ea0c191bc49a1ba46ebb2af57dca4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Mexico has a long history of corrupt fugitive governors, including one who was arrested in Italy just last week, but former Veracruz Gov. Javier Duarte stands out.\nSince his arrest in Guatemala Saturday, a video clip from 2012 has been circulating in which then-presidential candidate and now President Enrique Pena Nieto names Duarte as part of a new generation of politicians from the Institutional Revolutionary Party that will be its future.\nDuarte, 43, was part of a wave of PRI governors in 2010 that would later propel Pena Nieto — himself also a young PRI governor — into the presidency two years later.\nBut things spiraled out of control for Duarte and his collapsed state of Veracruz. On Monday, he was waiting in a Guatemalan military prison for his initial appearance before a judge scheduled for Wednesday and eventual extradition to Mexico. He was arrested at a hotel in Panajachel on Lake Atitlan where he was staying with his family.\nHow much Duarte allegedly stole from his state's coffers is still a matter of debate and the theft alone would not distinguish him from other looting governors.\nAlberto Olvera, a researcher at Veracruz University, said Duarte also did not stand out as a cunning politician or particularly brilliant thinker, but he left Veracruz with a staggering debt that Olvera put at over $1 billion and widespread violence, the scale of which is still being discovered in secret graves around the state.\n\"The Veracruz government in the time of Duarte spent much more than it had and to be able to spend incurred a growing debt,\" Olvera said. \"So it isn't just a problem of theft, but of misuse of public funds that has generated a financial catastrophe, a fiscal crisis unparalleled in the history of the state.\"\nAuthorities have been excavating secret graves in Veracruz, which was swept by a vicious wave of drug cartel violence, and last month had already found 253 skulls or complete bodies in one area. And at least 16 journalists were killed during Duarte's term alone, Olvera said.\nThe state's former police chief was arrested in February on charges of illegal enrichment. He has denied any wrongdoing.\nThe PRI stripped Duarte of his party rights in September. Duarte stepped down as governor on Oct. 12, weeks before the end of his term, to face the charges against him, but then promptly disappeared. The PRI lost Veracruz's governorship for the first time in its history last summer.\nIn late November, Mexico's Attorney General's Office said it had found about $20.5 million linked to Duarte that had been funneled to two businesses. The government said it froze more than 100 bank accounts and seized properties around the country tied to Duarte.\nIn February, Miguel Angel Yunes, Duarte's elected successor from an opposition party, stood in a warehouse with large framed portraits of Duarte and his wife conveniently in the background. He said an anonymous tip had led authorities to the warehouse where they found not only works of art and other collectibles, but also dozens of wheelchairs and boxes of school supplies and handwritten diaries allegedly kept by his wife that documented their properties around the world.\nIt is unclear what will happen to Duarte.\nYunes campaigned on a promise to lock him up. Pena Nieto is using the arrest of the man he once signaled as the future of the party as a sign that the PRI will not tolerate corruption.\nAnd Duarte is just one such test facing Pena Nieto. Another PRI governor from the class of 2010 wanted on corruption charges, Cesar Duarte of Chihuahua, no relation, is considered a fugitive and believed to be living in El Paso, Texas. And former PRI Gov. Tomas Yarrington of Tamaulipas state was arrested in Italy on April 9.\nOn Monday, Pena Nieto said the arrests of Duarte and Yarrington were a \"firm and overwhelming message from the Mexican state against impunity.\"\nBut Olvera is not counting on any resolution of Javier Duarte's case soon.\n\"The most likely thing is that ... Duarte's trial happens after the 2018 election,\" he said.\n——\nPerez contributed from Guatemala.",
    "source_domain": "abcnews.go.com",
    "title": "Mexico's latest captured ex-governor once his party's future",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/mexicos-latest-captured-governor-partys-future-46850430"
}