{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 10:43:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Man who shot congressman was living in van, called a loner",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fman-shot-congressman-living-van-called-loner-48050647.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_a588b88a7cc844af89106f992f02e030_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The gunman who wounded a top Republican congressman and several others during an early morning baseball practice had apparently been living out a white cargo van for months and was frequently seen working on a computer at a nearby YMCA, where he kept mostly to himself.\nJames T. Hodgkinson shot House Rep. Steve Scalise on Wednesday before he was fatally shot by police who had been guarding the House majority whip on the Alexandria, Virginia, baseball field, officials said.\nAuthorities believe the 66-year-old had been living out of a van in northern Virginia since March after leaving his southern Illinois home. The man expressed grievances online about President Donald Trump and Republicans, but authorities said they're still working to determine a motive.\nHodgkinson was spotted regularly over the past several weeks at the YMCA next to the site of the shooting, sitting with a computer in the lobby or at a table in an exercise area that looked out onto the baseball field.\nFormer Alexandria Mayor Bill Euille, who chatted with Hodgkinson at the gym, said he assumed the man was homeless because he wore pretty much the same outfit every day and carried a bag full of extra clothes. Hodgkinson rarely joined in the political discussions often set off by the television in the room and never showed any signs that he was troubled, Euille said.\n\"I never saw him get mad when people were talking good, bad or ugly about any of the political parties,\" Euille told The Associated Press. \"He was just a very calm, rational person, I thought,\" he said.\nStephen Brennwald, another YMCA member, said he never saw Hodgkinson talk to anyone and figured the man was a \"loner.\" Brennwald thought it was odd he never saw Hodgkinson exercise or wear workout clothes and considered asking a staffer about him but never did, he said.\n\"There's just no way that I would have guessed that this guy would be shooting at law enforcement and a congressman,\" said Brennwald, an attorney.\nHodgkinson, who was armed with a handgun and a rifle, died from multiple gunshot wounds to his torso, the FBI said. Federal investigators are working to trace his weapons to find out where they were purchased and other details about their history.\nTexas Rep. Roger Williams said one of his aides, Zack Barth, was shot but was doing well and expected to recover fully. Two Capitol Police officers sustained relatively minor injuries. A former congressional aide was hospitalized.\nThe FBI said authorities are speaking with people who knew Hodgkinson or who may have encountered him. FBI agent Tim Slater said the FBI needs the public's help in piecing together Hodgkinson's whereabouts and activities while he was in Alexandria.\n\"We're just not sure at this time\" how he spent his time, he said.\nKristina Scrimshaw, a bartender at the Pork Barrel BBQ restaurant a few blocks from the shooting scene, said Hodgkinson had become something of a regular in recent weeks. He always drank Budweiser from a can and drank alone, barely speaking to anyone, including the bartenders.\n\"I didn't like him from the beginning,\" she said. \"Nothing I can really put my finger on, but he was just not a pleasant person.\"\nThe gunman's brother told The New York Times that the man was upset about Trump's election and recently went to Washington to protest, but Michael Hodgkinson said he didn't know why the man stayed in the area.\n\"I know he wasn't happy with the way things were going, the election results and stuff,\" the shooter's brother told the newspaper.\nUntil recently, Hodgkinson ran a home-inspection business out of his house in southern Illinois.\nHis Facebook page shows he was a fan of Vermont Sen. Bernie Sanders, who last year made an unsuccessful bid for the Democratic presidential nomination. Sanders acknowledged Wednesday that Hodgkinson had apparently been among many volunteers on his 2016 campaign.\nA search of online newspapers shows that Hodgkinson frequently wrote letters to his local newspaper, the Belleville News-Democrat, which published nearly two dozen of them between 2010 and 2012. Many included complaints about the same theme: income inequality.\nHodgkinson also had arrests in his background for a series of minor offenses and at least one more serious matter. Court records show that his legal trouble started in the 1990s with arrests for resisting police and drunken driving.\nIn 2006, he was arrested on a battery charge after allegedly punching a woman in the face, then striking her boyfriend in the head with the wooden stock of a 12-gauge shotgun before firing a round at the man, according to a sheriff's department report.\nWhile trying to drive away from that confrontation, the report said, Hodgkinson used a pocket knife to cut a seat belt. The charges were dismissed later that year, according to the court clerk.\nThough no other legal problems are listed in St. Clair County, which includes Belleville, since 2011, Hodgkinson did come to the attention of local law enforcement as recently as last spring.\nOn March 24, Bill Schaumleffel recalled hearing shots being fired outside his house, which stands about 500 feet behind Hodgkinson's home. When he went outside, he saw Hodgkinson shooting a rifle into a cornfield. He was squeezing off five or six rounds at a time, according to the report of the incident, and fired about 50 shots in all.\n\"I yelled, 'Quit shooting toward the houses,'\" Schaumleffel said.\nWhen Hodgkinson refused to stop, Schaumleffel called the sheriff's department.\nSt. Clair County Sheriff Rick Watson said Wednesday that Hodgkinson showed the deputy all required firearms licenses and documentation for the high-powered hunting rifle, which he said he was simply using for target practice.\nThe deputy cautioned Hodgkinson about shooting around homes, given that the rounds can travel up to a mile. No charges were filed.\n———\nRicher reported from Richmond, Virginia. Sarah Rankin in Richmond; Matt Barakat in Alexandria, Virginia; Don Babwin in Chicago; John O'Connor in Springfield, Illinois; Jim Suhr in Kansas City, Missouri; Jake Pearson in Washington and Associated Press Researcher Rhonda Shafner in New York also contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Man who shot congressman was living in van, called a loner",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/man-shot-congressman-living-van-called-loner-48050647"
}