{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 23:45:38+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Jury finds man guilty in San Francisco quintuple homicide",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fjury-finds-man-guilty-san-francisco-quintuple-homicide-51726882.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_c504f2be24ad4397a46cc83d2009744b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A jury Monday found a 41-year-old man guilty of five counts of murder in the 2012 killings of a family found beaten to death with a hammer inside their San Francisco home.\nThe jury returned the verdict against Binh Thai Luc on Monday after six days of deliberations. Luc was also found guilty of five counts of attempted robbery and two counts of burglary.\nLuc, who was said to be deeply in debt and had already been served an eviction notice, was accused of killing the family in the midst of a robbery after losing money at a casino that night. Prosecutors said the Lei family kept thousands of dollars in cash in the home, and Luc had more than $6,500 with him when he was arrested.\nWhile no eyewitnesses placed Luc at the scene of the crime, the San Francisco Chronicle reported that blood from one of the victims was spattered on his jeans.\nHe was found guilty of killing Hua Shun Lei, 65; his wife, Wan Yi Wu, 62; their daughter, Ying Xue Lei, 37; their son, Vincent Lei, 32; and his wife, Chia Huei Chu, 30.\nVincent Lei's 12-year-old niece discovered the carnage that morning and ran out of the home screaming, \"Mommy, bodies! Bodies!\"\nA witness later heard the girl's mother, Nicole Lei, on the phone, yelling hysterically, \"They took the money! The money is gone!\" prosecutors said.\nDefense attorney Mark Goldrosen argued that someone else attacked the family, possibly a Chinatown gangster or former boyfriend of one of the victims. He said prosecutors never established a motive for the grisly crime.\nLuc served almost a decade in prison for robbery and assault with a deadly weapon for the 1996 armed robbery of a Chinese restaurant in San Jose. He was ordered to be deported to his native Vietnam upon his release, but the Vietnamese government didn't provide the documents needed to process his removal from the U.S., federal Immigration and Customs Enforcement previously said.\nICE officials released him into the community in 2006.",
    "source_domain": "abcnews.go.com",
    "title": "Jury finds man guilty in San Francisco quintuple homicide",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/jury-finds-man-guilty-san-francisco-quintuple-homicide-51726882"
}