{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 15:52:27+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fkids-rare-rapid-aging-disease-hope-study-drug-54691947.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_7f7d18ffb7894c779e5f84ba071f97c2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Children with a rare, incurable disease that causes rapid aging and early death may live longer if treated with an experimental drug first developed for cancer patients, a study suggests.\nThe small, preliminary study isn't proof the drug works and it found only a small benefit: Treated children with the disease progeria were more likely than others to survive during the two-year study. But some kids taking the drug in this and other studies have lived into their late teens. Researchers and others say the results suggest a potential breakthrough for a heartbreaking condition that typically kills kids before they reach adulthood.\n\"Anything we can do to try to provide them hope of a longer life is well worth doing and well worth celebrating,\" said Dr. Francis Collins, director of the National Institutes of Health, who was not part of the new study. A geneticist, Collins led laboratory experiments that in 2003 identified the genetic basis for the disease, formally known as Hutchinson-Gilford progeria.\nAmong 27 children with progeria who got the drug lonafarnib, one died during the 2007-2010 study. That's compared with nine of 27 untreated children with the disease. Thirteen of the treated children are still alive; most began taking other experimental drugs too.\n\"For the first time ever we have a drug that is shown to extend lifespan for children with progeria,\" said lead author Dr. Leslie Gordon of Brown University. Her son was a study participant and died in 2014 at age 17.\nThe results were published Tuesday in the Journal of the American Medical Association.\nThe study, conducted at Boston Children's Hospital, was unusually designed, comparing children given the drug with other progeria patients worldwide who weren't enrolled in the study. The untreated kids were matched as closely as possible with study participants by age, gender and other characteristics, but they weren't a standard control group and didn't receive dummy medication.\nThat design weakens the study conclusions, said Dr. Howard Worman, a Columbia University biologist. \"You really cannot say anything 'worked' without a contemporary placebo control.\"\nThe children in the study were also involved in earlier research testing the same drug combined with two others. Within a period of about five years, survival was extended by about 19 months. It wasn't clear if all three drugs or just one or two of them contributed to the improvement. Lonafarnib also appeared to reduce blood vessel damage.\nAverage life expectancy for progeria children is about 14 years. Though many die younger, usually from heart attacks or strokes, some lonafarnib-treated kids have lived to their late teens.\nFor parents, who want to see their children grow up, that sliver of extra time is a bittersweet blessing.\n\"If you're a mom and you're told that life expectancy is 13 years, that 1.6 years is gold,\" said Heather Unsinger. Her 7-year-old daughter, Carly, was a study participant and has been taking lonafarnib since age 3. \"But it's really hard to jump up and down.\"\nAffected children are typically small, bald and fragile-looking but intellectually normal. Carly \"has full-throttle dreams\" and envisions becoming an art teacher one day, her mom said.\nOther kids \"always think I'm a baby,\" Carly said. But \"I'm a regular kid.\"\nProgeria is caused by a mutation in a gene that regulates production of a protein that helps shape and support the nucleus of cells throughout the body. In normal aging, the protein accumulates in cells but in children with progeria, an abnormal buildup occurs that severely damages cells. Lonafarnib helps block that abnormal buildup.\nThe disease affects about 1 in 20 million people. It is a chance mutation and isn't inherited. Affected children are born looking healthy, but fail to grow normally, lose body fat and hair and develop aged-looking skin, stiff joints and diseased arteries.\nLonafarnib was initially developed as a potential cancer treatment but without much success. Schering Plough/Merck supplied the study drug; the research was paid for by the Progeria Research Foundation.\nGordon, the lead author, and her husband, Dr. Scott Berns, started the foundation in 1999 after their son, Sam, was diagnosed. She is continuing to study lonafarnib and other drugs in kids with progeria.\nUniversity of Washington geneticist Dr. Fuki Hisama predicted that lonafarnib will eventually become standard treatment for progeria, though not a cure.\nThe study \"gives other people the message that there is hope for rare diseases,\" said Hisama, who wrote an accompanying journal editorial.\n———\nFollow AP Medical Writer Lindsey Tanner on Twitter at @LindseyTanner. Her work can be found here .\n———\nThe Associated Press Health & Science Department receives support from the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content.",
    "source_domain": "abcnews.go.com",
    "title": "Kids with rare rapid-aging disease get hope from study drug",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/kids-rare-rapid-aging-disease-hope-study-drug-54691947"
}