{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 03:28:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2FwireStory%2Fcalifornia-university-punish-professor-jeered-bush-54708478.json",
    "image_url": "http://abcnews.go.com/Politics/wireStory/california-university-punish-professor-jeered-bush-54708478",
    "language": "en",
    "localpath": null,
    "maintext": "A California State University, Fresno professor who called Barbara Bush \"an amazing racist\" and cheered her death will not be punished, the president of the university announced Tuesday.\nRanda Jarrar was acting as a private citizen using her personal Twitter account so her remarks didn't violate any California State University or campus policies, Fresno State President Joseph Castro wrote in announcing the results of a review.\n\"Her comments, although disgraceful, are protected free speech under the First Amendment of the U.S. Constitution,\" Castro wrote. \"Our duty as Americans and educators is to promote a free exchange of diverse views, even if we disagree with them.\"\nJarrar has been on leave this semester and couldn't immediately be reached for comment. An email to her university address was not immediately returned.\nThe English professor provoked a storm of criticism last week with her tweets following the death of the former first lady.\n\"Barbara Bush was a generous and smart and amazing racist who, along with her husband, raised a war criminal,\" Jarrar wrote.\nJarrar also commented that she was \"happy the witch is dead.\"\nA Change.org petition to have her fired had garnered 50,000 online signatures as of Tuesday evening.\nIn response to critics, Jarrar said she was a tenured professor who could not be fired but Castro said the issue wasn't related to her job or tenure.\nHowever, he also condemned her remarks.\n\"Professor Jarrar's conduct was insensitive, inappropriate and an embarrassment to the university,\" Castro wrote, adding: \"On campus and whenever we are representing the university, I expect all of us to engage in respectful dialogue.\"\nJarrar grew up in Kuwait and Egypt and moved to the United States after the Gulf War, according to her university faculty page.\nShe describes herself in her Twitter messages as an Arab-American and a Muslim-American woman.",
    "source_domain": "abcnews.go.com",
    "title": "California university won't punish professor who jeered Bush",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/wireStory/california-university-punish-professor-jeered-bush-54708478"
}