{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 05:19:46+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ftoday-history-53865641.json",
    "image_url": "http://abcnews.go.com/US/wireStory/today-history-53865641",
    "language": "en",
    "localpath": null,
    "maintext": "Today in History\nToday is Tuesday, March 20, the 79th day of 2018. There are 286 days left in the year. Spring arrives at 12:15 p.m. Eastern time.\nToday's Highlight in History:\nOn March 20, 1854, the Republican Party of the United States was founded by slavery opponents at a schoolhouse in Ripon (RIH'-puhn), Wisconsin.\nOn this date:\nIn 1413, England's King Henry IV died; he was succeeded by Henry V.\nIn 1760, a 10-hour fire erupted in Boston, destroying 349 buildings and burning 10 ships, but claiming no lives.\nIn 1815, Napoleon Bonaparte returned to Paris after escaping his exile on Elba, beginning his \"Hundred Days\" rule.\nIn 1852, Harriet Beecher Stowe's influential novel about slavery, \"Uncle Tom's Cabin,\" was first published in book form after being serialized.\nIn 1922, the decommissioned USS Jupiter, converted into the first U.S. Navy aircraft carrier, was re-commissioned as the USS Langley.\nIn 1942, U.S. Army Gen. Douglas MacArthur, having evacuated the Philippines at the order of President Franklin D. Roosevelt, told reporters in Terowie, Australia: \"I came out of Bataan, and I shall return.\"\nIn 1948, \"Gentleman's Agreement\" won the Academy Award for best picture of 1947; Ronald Colman was named best actor for \"A Double Life,\" while Loretta Young won best actress for \"The Farmer's Daughter.\"\nIn 1952, the U.S. Senate ratified, 66-10, a Security Treaty with Japan.\nIn 1969, John Lennon married Yoko Ono in Gibraltar.\nIn 1977, voters in Paris chose former French Prime Minister Jacques Chirac to be the French capital's first mayor in more than a century.\nIn 1985, Libby Riddles of Teller, Alaska, became the first woman to win the Iditarod Trail Dog Sled Race.\nIn 1995, in Tokyo, 12 people were killed, more than 5,500 others sickened when packages containing the deadly chemical sarin were leaked on five separate subway trains by Aum Shinrikyo (ohm shin-ree-kyoh) cult members.\nTen years ago: In a setback for Democrat candidate Hillary Rodham Clinton, a drive for a second Michigan presidential primary collapsed as the state Senate adjourned without taking up a measure calling for a do-over contest. (Michigan had held an early primary in January 2008 in violation of Democratic Party rules, and was stripped of its delegates as a result.) Mao Asada of Japan won the women's title at the World Figure Skating Championships in Goteborg, Sweden.\nFive years ago: Making his first visit to Israel since taking office, President Barack Obama affirmed Israel's sovereign right to defend itself from any threat and vowed to prevent Iran from obtaining nuclear weapons. Five former elected officials of Bell, California, were convicted of misappropriating public funds by paying themselves huge salaries while raising taxes on residents; one defendant was acquitted. Colorado Gov. John Hickenlooper signed bills that put sweeping new restrictions on sales of firearms and ammunition. Opera singer Rise (REE'-suh) Stevens, 99, died in New York.\nOne year ago: U.S. Supreme Court nominee Neil Gorsuch pledged to be independent or \"hang up the robe\" as the Senate began confirmation hearings on President Donald Trump's conservative pick for the nation's highest bench. President Trump met for the first time with Iraqi Prime Minister Haider al-Abadi at the White House. David Rockefeller, guardian of the Rockefeller fortune and billionaire philanthropist, died at his home in Pocantico (poh-KAN'-tih-koh) Hills, New York, at age 101.\nToday's Birthdays: Singer Dame Vera Lynn is 101. Producer-director-comedian Carl Reiner is 96. Actor Hal Linden is 87. Former Canadian prime minister Brian Mulroney (muhl-ROO'-nee) is 79. Country singer Don Edwards is 79. TV producer Paul Junger Witt is 77. Basketball Hall of Fame coach Pat Riley is 73. Country singer-musician Ranger Doug (Riders in the Sky) is 72. Hockey Hall of Famer Bobby Orr is 70. Blues singer-musician Marcia Ball is 69. Actor William Hurt is 68. Rock musician Carl Palmer (Emerson, Lake and Palmer) is 68. Rock musician Jimmie Vaughan is 67. Country musician Jimmy Seales (Shenandoah) is 64. Actress Amy Aquino (ah-KEE'-noh) is 61. Movie director Spike Lee is 61. Actress Theresa Russell is 61. Actress Vanessa Bell Calloway is 61. Actress Holly Hunter is 60. Rock musician Slim Jim Phantom (The Stray Cats) is 57. Actress-model-designer Kathy Ireland is 55. Actor David Thewlis is 55. Rock musician Adrian Oxaal (James) is 53. Actress Jessica Lundy is 52. Actress Liza Snyder is 50. Actor Michael Rapaport is 48. Actor Alexander Chaplin is 47. Actor Cedric Yarbrough is 45. Actress Paula Garces is 44. Actor Michael Genadry is 40. Actress Bianca Lawson is 39. Comedian-actor Mikey Day is 38. Actor Nick Blood (TV: \"Marvel's Agents of S.H.I.E.L.D.\") is 36. Rock musician Nick Wheeler (The All-American Rejects) is 36. Actor Michael Cassidy is 35. Actress-singer Christy Carlson Romano is 34. Actress Ruby Rose is 32.\nThought for Today: \"Spring is nature's way of saying, 'Let's party!'\" — Robin Williams, American comedian (1951-2014).",
    "source_domain": "abcnews.go.com",
    "title": "Today in History",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/today-history-53865641"
}