{
    "authors": [
        "Abc News",
        "More Maryalice"
    ],
    "date_download": "2018-05-30 19:55:53+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Unlike Greitens, Mike Parson is a seasoned state legislator.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Fmissouri-governor-eric-greitens-replaced-longtime-traditional-politican%2Fstory%3Fid%3D55532119.json",
    "image_url": "https://s.abcnews.com/images/Politics/mike-parson-gty-thg-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "According to local reporters, Missouri’s lieutenant governor Mike Parson told a crowd last month, “No one elected official… is larger than the state of Missouri. None.\"\nThis week, it seemed Parson was right.\nMissouri’s current governor Eric Greitens, facing escalating criminal investigations into his campaign and personal life and possible impeachment, announced his resignation Tuesday, leaving Parson to be sworn in to lead the state at the end of the week.\n“It takes hard work and sometimes you have to work a little harder to get through tough times,” Parson went on at that event last month, according to the Columbia Daily Tribune.\nCharlie Riedel/AP\nWith the scandals, controversies and charges that have swirled around the statehouse during Greitens’ tenure, the next few months and years for Parson, a Republican like Greitens, will undoubtedly be tough, but James Harris, who consulted for Parson’s 2016 campaign, said he is up for the task.\n“He is the kind of person you throw into the deep end of the pool,” Harris told ABC News Wednesday, complementing Parson. “He will lead the state.”\nUnlike Greitens, who was brand new to politics and governing when he took the helm, Parson is a seasoned and more traditional politician. He is often described as a \"true conservative\" and hard-worker. He served as a state legislator for a dozen years before assuming his current role. He was the Sheriff of Polk County from 1993-2005 before running for the statehouse and served six years in the U.S. Army as a younger man.\nParson was raised on a farm and still currently “owns and operates a cow and calf operation,” according to his official biography. The Kansas City Star reported that that the lieutenant governor was out on his farm Tuesday when he received official word that Greitens was stepping down.\nWhereas Greitens was seen by some as combative and, at times, confrontational, Parson has a reputation for being more of a dealmaker.\nGregg Keller, a Republican political strategist in the state, said Parson still maintains strong relationships with state legislators on both sides of the aisle.\nKeller, who was not shy on the phone about his thoughts of Greitens ( he said he thought the outgoing governor struggled with “a serious personality disorder”) described Parson as “humble.”\nParson and Greitens ran separately in 2016, as governors and lieutenants always do in the state. Missouri has a history of even electing top officials from two different parties in years past.\nJulie Smith/The Jefferson City News-Tribune via AP\nStill, though pressure had been mounting for months for Greitens to resign and other Republicans in the state were called for him to step down, Parson largely remained quiet and tried to put his head down. It could be hard moving forward for him to shake the shadow of his predecessor while he finishes the term that extends through 2020. Democrats have already made clear that they plan to continue to run against Greitens, his shortcomings and issues, and try to tie those close to his administration to the allegations against him.\n“There is frankly, a lot of relief that the Greitens debacle is behind us,” strategist Keller continued.\nThere has been a sense with some Republicans in Missouri and in Washington that Greitens resignation may now help clear the road for other members of the party on ballots in the state in November who had been dogged by all the drama.\n“That sigh you hear is Republicans in Missouri and elsewhere rejoicing at Greitens’ unexpected decision to quit,” Dave Helling, a columnist for the local Kansas City Star wrote after Greitens’ announcement Tuesday.\nIn his column, headlined, ‘Missouri Gov. Eric Greitens’ resignation a relief for beleaguered Republican,' Helling said Parson seemed ready for the task at hand.\nParson will assume office as the state’s General Assembly is finishing up a budget and bill review process. Republicans have supermajorities in both state legislative chambers.",
    "source_domain": "abcnews.go.com",
    "title": "Missouri Governor Eric Greitens to be replaced by longtime traditional politican",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/missouri-governor-eric-greitens-replaced-longtime-traditional-politican/story?id=55532119"
}