{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2017-08-14 19:46:59+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "What to know about the Charlottesville car crash suspect",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fjames-alex-fields-jr-suspect-charlottesville-car-crash%2Fstory%3Fid%3D49204700.json",
    "image_url": "http://a.abcnews.com/images/US/james-alex-fields-march-file-ap-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "James Alex Fields Jr., the 20-year-old Ohio man police say deliberately accelerated his car into a crowd of counterprotesters on Saturday in Charlottesville, Virginia, killing a young woman, appeared in court today for the first time and was denied bail.\nHeather Heyer, 32, an activist who was protesting against a white nationalist gathering that was taking place in the city that day, was killed in the crash. At least 19 others were injured.\nAttorney General Jeff Sessions told ABC News on Monday that the incident \"does meet the definition of domestic terrorism\" under U.S. law, and confirmed that the Department of Justice is pursuing what Fields allegedly did \"in every way that we can make a case.\"\nHere's what we know about Fields, his background, and the alleged crime he perpetrated:\nAbermarle Charlottesville Regional Jail\nAn alleged admirer of Hitler and concentration camps\nFields \"thought Nazis were pretty cool guys\" in the words of Derek Weimer, who told ABC News that he taught World History to Fields, as well as a course called America's Modern Wars, when Fields was a student at Randall K. Cooper High School in Union, Kentucky.\nWeimer described Fields as being \"fairly quiet\" and \"smart\" and also claimed Fields was an open admirer of Adolf Hitler and the Nazis.\nHe said that he challenged Fields' point of view as a teacher, and that the two had many private discussions on the subject of Nazis.\nTwo of Fields' classmates told ABC News about a trip to Europe that a group of students took after graduation in 2015, when they visited the Dachau concentration camp in Germany. When they arrived at the concentration camp, Fields allegedly said, \"This is where the magic happened,\" according to the two students.\nAt least 28,000 people, including countless Jews, died at the Dachau complex and its \"subcamps\" located elsewhere in Germany, according to the U.S. Holocaust Museum. Horrific experiments were conducted on many of the prisoners who were kept there.\nSamantha Bloom, Fields' mother, denied to The Associated Press that her son was a white supremacist, and claimed that she thought the rally had \"something to do with Trump.\"\n\"I just knew he was going to a rally. I mean, I try to stay out of his political views. You know, we don't, you know, I don't really get too involved, I moved him out to his own apartment, so we ... I'm watching his cat,\" Bloom told the AP.\n\"I thought it had something to do with Trump. Trump's not a white supremacist,\" Bloom added about her son's appearance at the white nationalist gathering.\nRyan M. Kelly /The Daily Progress/AP\nFrom an area of the country lacking in diversity\nWeimer said that Fields had little interaction with non-whites at school, at least as far as he could tell.\n\"We had between 1,200 and 1,300 students at that time,\" Weimer told ABC News. \"Maybe 4 percent were black. There were only a handful of Jews. The school was just about 6 percent Latin-American.\"\nBloom told the AP that her son \"had an African-American friend\" in response to a question about whether or not he was a white supremacist.\nPaul J. Richards/AFP/Getty Images\n'A car careening through a crowd'\nTommy, an organizer for the Richmond, Virginia, chapter of Democratic Socialists of America (DSA), a socialist organization that claims to have seen a major surge in membership following the election of Donald Trump, was there when Fields allegedly rammed his car into the crowd of people.\nTommy, who asked ABC News not to use his last name to protect his identity, said he and other activists were in a celebratory mood until a car careened through the crowd, sending people scrambling.\nKristin Adolfson, a graduate of the University of Virginia who works as a graphic designer at a nonprofit, told The New Yorker that she experienced a \"sudden movement through the crowd, sound, bodies in the air\" at the scene.\nThe incident was captured on video from both the front and back of the accelerating car, and the tapes appeared to show the vehicle ramming wildly into the back of other cars, sending the bodies of activists flying through the air.",
    "source_domain": "abcnews.go.com",
    "title": "What we know about James Alex Fields Jr., the suspect in the Charlottesville car crash",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/james-alex-fields-jr-suspect-charlottesville-car-crash/story?id=49204700"
}