{
    "authors": [
        "Abc News",
        "More Bill"
    ],
    "date_download": "2018-05-30 15:19:48+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Valerie Jarret wants to turn a racist tweet aimed at her by Roseanne Barr into \"a teaching moment,\" she said.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fvalerie-jarrett-calls-turning-roseanne-barrs-racist-tweet%2Fstory%3Fid%3D55527814.json",
    "image_url": "https://s.abcnews.com/images/Politics/valerie-jarrett-roseanne-barr-split-gty-jc-180529_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Valerie Jarrett, a onetime adviser to former President Barack Obama, wants to turn a racist tweet aimed at her by Roseanne Barr into \"a teaching moment,\" she said.\nInterested in Roseanne? Add Roseanne as an interest to stay up to date on the latest Roseanne news, video, and analysis from ABC News. Add Interest\nJust hours after ABC canceled Barr's show \"Roseanne\" over what the TV network's entertainment division president Channing Dungey called an \"abhorrent, repugnant\" post by the actress and comedian, Jarrett said Tuesday during an MSNBC town hall on \"Everyday Racism in America, \"I'm fine.\"\n\"First of all, I think we have to turn it into a teaching moment,\" she said.\nBryan Bedder/Getty Images\nBarr, 65, took to Twitter early Tuesday morning, writing that Jarrett would be the result if the \"Muslim brotherhood & planet of the apes had a baby.\" Barr later removed the tweet and issued an apology for her \"stupid tweet.\"\nWithin 12 hours, however, the Disney Co.’s ABC canceled Barr's hit show that premiered March 27 and was watched by a stunning 27 million viewers.\nJarrett, 61, said Bob Iger, chief executive of ABC's parent company, Disney, called her before the announcement was made to apologize.\n\"He said he had zero tolerance for that sort of racist, bigoted comment and he wanted me to know before he made it public that he was canceling [Barr's] show and so I appreciate that they did that so swiftly,\" Jarrett said.\nJarrett, who was born in Iran to American parents and raised in the United States, had been the target of false allegations that she practiced Islam during her tenure in the Obama administration.\nRichard Shotwell/Invision/AP, File\n\"I'm worried about all the people out there who don't have a circle of friends and followers who came to their defense,\" Jarrett said at the town hall.\nWithout mentioning Barr's friendship to President Donald Trump, Jarrett implied that controversial comments from the sitting president, which have included name-calling and belittling critics on Twitter, have emboldened some of his supporters to follow his lead.\n\"The tone does start at the top, and we like to look up to our president and feel as though he reflects the values of our country,\" she said. \"But I also think every individual citizen has a responsibility too, and it's up to all of us to push back. Our government is only going to be as good as we make it be.\"\nJarrett noted that the brouhaha over Barr's tweet came on the same day that 175,000 Starbucks employees were undergoing implicit-bias training that stemmed from an incident in April in which two African-American men were arrested at a Philadelphia Starbucks for occupying a table without making a purchase. Trespassing charges against the men were later dropped and the top leaders of Starbucks and the Philadelphia police commissioner apologized to them.\nJarrett urged Americans to talk about \"those ordinary examples of racism that happen every single day.\"\nWhile social media can be a positive tool, she said, \"it can also dehumanize because it's distant.\"\n\"You don't have to look at the faces you're attacking,\" she added.\nABC News is a division of the Disney Co.",
    "source_domain": "abcnews.go.com",
    "title": "Valerie Jarrett calls for turning Roseanne Barr's racist tweet into 'teaching moment' for all",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/valerie-jarrett-calls-turning-roseanne-barrs-racist-tweet/story?id=55527814"
}