{
    "authors": [
        "Abc News",
        "Enjoli Francis",
        "More Michelle",
        "More Enjoli"
    ],
    "date_download": "2018-02-03 04:34:59+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "One Reading, Pennsylvania, resident claims to be the ultimate Philadelphia Eagles super fan and has huge plans to watch Super Bowl LII on Sunday.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fenter-philadelphia-eagles-super-fans-man-cave-utopia%2Fstory%3Fid%3D52803468.json",
    "image_url": "http://a.abcnews.com/images/Sports/superfan-01-abc-rc-180202_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "There are the regular Philadelphia Eagles fans and then, there are the diehards like Barry \"The Hatchet\" Vagnoni, who calls himself a \"whack job.\"\n\"Some people collect cars. Some people collect coins. I'm into Philadelphia Eagles. That's what I love. That's my passion,\" he told ABC News. \"Till the day I die, I will always be a Philadelphia Eagles fan. ... This is my love. Other than my family, this is my love.\"\nABC\nThe Reading, Pennsylvania, father of two and grandfather of six has been an Eagles fan since 1954. In 1960, he and his father were watching, eyes peeled to the family TV, as the Eagles won the world championship against the Green Bay Packers.\nVagnoni called the victory \"one of the happiest days of my life.\"\nFor him, Eagles game day is truly a family affair and this Sunday's Super Bowl festivities will be no different.\nHe and Dawn, his wife of 56 years, typically entertain 125 to 175 people in his 2,000-square-foot, locker-room-type man cave.The 2,000 square-foot space features a 35-foot bar and 16 televisions where guests can watch the game from anywhere, including the bathrooms. Those who attend are known as \"locker-room members,\" mostly friends and family who must wear a special pass and comply with family-friendly rules.\n\"Naturally only Philadelphia Eagles fans allowed\" Vagnoni told ABC News. \"You must wear Eagles gear. No exceptions. No smoking in the locker room. No foul language in the locker room.\"\nBarry Vagnoni keeps the crowd pumped from his perch on a stage, leading cheers, changing costumes and even beating a drum.\nABC\nHe added the room 13 years ago, and said he was inspired to build the addition after watching the Kevin Costner movie \"Field of Dreams.\"\nThe locker room is a basilica for Eagles fans covered with team memorabilia from floor to ceiling and on every walls in between. There are signed jerseys, helmets and spikes as well as photographs, mugs and even a section of turf from the now-razed Veterans Stadium where the Eagles once played.\nHe told ABC News that although he had an estimate of how much it cost to run the parties, he wouldn't divulge for fear his wife would get mad. He said most of the signed memorabilia in the room comes from his and his wife's participation in various fundraisers and charitable events.\n\"It's my life's passion,\" he told ABC News about the room. \"This is the utopia.\"\nOn Sunday, he and Dawn Vagnoni, plan to welcome more than 100 people to the man cave for Super Bowl LII, when the Eagles take on the New England Patriots in Minneapolis, Minnesota.\n\"This coming Sunday night is just, is my lifelong dream to be able to witness our Eagles in the Super Bowl and hopefully, Lord willing, hopefully they're going to get a win,\" he said.\nABC\nHe said he'll also be thinking of his late father, especially this Sunday.\n\"My dad would be so happy,\" Vagnoni said, \"There’s not a game that goes by that I don’t think, while I’m standing up on stage leading the troops, cheering, and getting every body all jacked up, I think 'Boy, oh boy, Dad, you would really be having a ball.'\"\nThe couple said they are expecting an overflow crowd of fans along with a band, dancers, two smokers and 50 pounds of wings.\nBarry Vagnoni said his daughter, a dance teacher, put together several routines for a group to perform during game breaks.\n\"It's nothing but fun in this room,\" he said. \"It's a lot of love -- win or lose. ... It's just one big party.\"\n“ ” This coming Sunday night is just, is my lifelong dream to be able to witness our Eagles in the Super Bowl.\nAll of the food and drinks are free for those in attendance. He said he keeps a jar around in case people want to leave a donation but nothing is expected. Folks can bring things as well.\nDawn Vagnoni said she'd learned of her husband's obsession the day she met him.\nThe two were born in the same hospital, one day a part, and grew up together as friends. She said Barry Vagnoni is indeed a \"super fan.\"\n\"He runs the room. He's the energy in the room,\" she said. \"Everybody loves him.\"\nOn game day she works behind the scenes, cooking and preparing the food, guarding the door and taking photos of all the guests to guests. BC\nABC\nAnd though Vagnoni said he roots for other Philadelphia teams, he said that none have his heart (and his wallet) like the Eagles.\n\"You gave me a choice between winning the Powerball and having a Super Bowl victory with my family and my friends, I'll take the Super Bowl victory of my Philadelphia Eagles, any day, any day of the week, any day of the year,\" Vagnoni said. \"You give me that. ... I'll be very, very happy.\"",
    "source_domain": "abcnews.go.com",
    "title": "Enter one Philadelphia Eagles super fan's man cave: 'This is the utopia'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/enter-philadelphia-eagles-super-fans-man-cave-utopia/story?id=52803468"
}