{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 15:23:15+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Trump declassifies secret document from Republicans in Congress.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fgop-memo-russia-inquiry-released-52814769.json",
    "image_url": "http://a.abcnews.com/images/GMA/180203_gma_wright_701_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for GOP memo on Russia inquiry released\nHey, good morning, everybody. Right to our top story. It's dominating the headlines this morning. The storm over a controversial memo from Republicans in congress which accuses officials in the FBI and in the department of justice of abusing their power. This is a layered story we going to unpack. Overnight the president who agreed to declassify that memo, he arrived in Florida at mar-a-lago facing uproar from Democrats who say the memo omits facts and may ultimately be used as motivation for trump to fire the justice department official that's overseeing the Russia investigation. Our political analysts and law enforcement enlist is standing by. What is in the memo with ABC's David Wright who is near mar-a-lago in Florida. David. Good morning. Reporter: Good morning. The relast of this has caused a political firestorm and while it may not include the bombshell that Republicans had promised, the memo and the politics surround its release promises some major fallout for the Russia investigation. I think it's a disgrace, what's going on in this country. I think it's a disgrace. A lot of people should be ashamed of themselves and much worse than ha. Reporter: President trump made it crystal clear what he thinks about it. The biggest case of corruption in history. Reporter: He says it's the president and his allies -- Get misleading information before the public, help support the president, help discredit the Mueller investigation and the FBI. Reporter: The Republican memo specifically seeks to discredit the man who appointed special counsel Bob Mueller, and oversees the Russia investigation. Deputy attorney general rod Rosenstein. According to the memo, Rosenstein endorsed the continued eavesdropping of Carter page, a former foreign policy adviser to the trump campaign and a suspected Russian agent. An essential part of a warrant application he signed according to the memo was the infamous Russian dossier paid for by the Democrats and compiled by a former British spy Christopher Steele. The dossier was presented to the court as if it was true. The court was not told that the Democrats actually paid for this. The question is, did this dossier lead to this -- create this investigation? Reporter: Democrats worry the president is looking for an excuse to fire Rosenstein in order to short circuit the Russia investigation. The firing of rod Rosenstein in my view would be an act of obstruction of justice just as firing Bob Mueller would be. Reporter: The president was asked about it point blank. Does it make you more likely to fire him. You figure that one out. Reporter: The release of the memo puts the president at odds with his own FBI director who opposed releasing it. Chris WRAY sent a video message to the agency's rank and file telling them, quote, I stand by our shared determination to do our work independently and by the book. Now, the former trump adviser whose case is at the center of this memo, Carter page, says the memo vindicates him. He denies he was ever a Russian spy. But the Democrats are crying foul. They say this memo cherry picks details to present a narrative favorable to the president and they say that on Monday they'll renew their efforts to release a counter memo that rebuts this point by point. We want to continue this conversation as we said. We'll bring in former FBI agent Brad Garrett and political analyst Matthew dowd. This first question I want both to answer. Let's get right to the core allegation of the memo that in the thick of the campaign, the justice department, the FBI used information that was in part bought and paid for by the Clinton campaign to spy on someone, Carter page, associated with treatment trump. If true isn't that a problem, Brad? Let's begin with you. It's a problem if that were true but let me explain something, you don't have the luxury of picking where your sourcing information comes from. Most of the time it is biased but the point being can you corroborate it. Just because it's biased doesn't mean it's not true. I will tell you based on experience that getting wiretaps approved, you have to have layers and layers of corroboration to get both the FBI, the department of justice and the judge to sign a wiretap order. So the idea that it was just based on a dossier is just silly. All right, Matt. Well, to me this thing -- obviously we should raise questions about how FISA applications are done but like in life or politics or in marketing, the best thing you can do is undersell and overdeliver. What the Republicans have done and chairman nunes have done is oversell and underdeliver. The last final we saw something like this was when Geraldo Rivera revealed Al Capone's vault and what we have is very little evidence of a problem and in the end, this doesn't raise any questions about the Mueller probe. So, let me pick up on that, Matt, because critics say this may be used as a pretext for the president to fire rod Rosenstein. He is the deputy attorney general in C the only who can fire the special counsel Robert Mueller. The white house says there are no plans to fire Rosen tine but if the president would do that what do you think the consequences would be politically? Well, that's what I think this memo is all about. There really is no legal questions that this memo is somehow really substantively argued for. It's really a political memo and the political memo is in the short term it can muddy the wears but also it can provide Donald Trump the president with some evidence in his mind of how he can circumvent the Mueller investigation. As I said earlier this memo raises no questions about the credibility of Bob Mueller investigating the Russian collusion or other issues related to that but it can muddy the wears and put Donald Trump in the position of being able for him to politically try to short-circuit the investigation. You're talking about this already but I want to drill down on it a little bit. This story is so complicated and involves names that are not household names, rod Rosenstein, Carter page, it's confusing for me and I get paid to follow this stuff. Do you think in the end the Republicans have succeeded in creating generalized doubt and suspicion that serves to under mine the entire Russia probe? Well, the unfortunate thing I think the Republicans have succeeded in undermining a -- two branches of government that were the less vestiges of credibility in the American public which is the FBI, which the country desperately needs to investigate all kinds of crimes and the department of justice for the exact same reason so, yes, they have achieved a short-term benefit of muddying waters but the long-term detriment it does to these institutions we need is something that the country is going to have to deal with. Brad, as a former FBI agent you just heard Matt say this really muddies the waters but what is the long-term damage if any to the FBI as well as the department of justice? Well, the long-term damage is credibility, because you're only as good as people talking to you and your relationships both with allies in the country as well as overseas. If you took this at face value, certainly comes across as really sloppy work which I guarantee you is not the case. So the FBI will continue on, they're probably angry, discouraged but determined. This story will continue on. That's the one thing we can for sure agree on. Matt dowd, Brad Garrett, we thank you for your analysis. We now are going to move on\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "GOP memo on Russia inquiry released",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/gop-memo-russia-inquiry-released-52814769"
}