{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 08:52:56+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Judge faces legal quagmire in teen texting suicide trial",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fjudge-faces-legal-quagmire-teen-texting-suicide-trial-48048425.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_86747d741b2c4db8b0279a1b30fdcff5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Michelle Carter and Conrad Roy III are both sad figures in a teenage tragedy that ended with Roy killing himself and Carter charged with manslaughter.\nA juvenile court judge now finds himself at the center of a legal quagmire: Should he set a legal precedent in Massachusetts by convicting Carter of manslaughter for encouraging Roy to take his own life through dozens of text messages? Or should he acquit her and risk sending a message that Carter's behavior was less than criminal?\nJudge Lawrence Moniz is deliberating Carter's fate following a jury-waived trial that provided a disturbing look at teen depression and suicide. It is not clear when the judge will issue his verdict.\nThe case has been closely watched in the legal community and widely shared on social media, in part, because of the dozens of text messages Carter sent Roy in the days before he was found dead of carbon monoxide poisoning in his truck parked in a Kmart parking lot.\n\"You're finally going to be happy in heaven. No more pain. It's okay to be scared and it's normal. I mean, you're about to die,\" Carter wrote in one message.\nHer texts later became more insistent after Roy appeared to delay his plan.\n\"I thought you wanted to do this. The time is right and you're ready —— just do it babe,\" she wrote.\nIn another text sent the day Roy died, Carter wrote: \"You can't think about it. You just have to do it. You said you were gonna do it. Like I don't get why you aren't.\"\nCarter is accused of involuntary manslaughter, a charge that can be brought in Massachusetts when someone causes the death of another person when engaging in reckless or wanton conduct that creates a high degree of likelihood of substantial harm.\nProsecutors have argued that Carter's text messages support their claim that Carter caused Roy's death by \"wantonly and recklessly\" helping him poison himself.\nRoy, 18, had a history of depression and had attempted suicide in 2012, taking an overdose of Tylenol. Roy's mother testified at Carter's trial that Roy seemed to improve after he began taking medication and getting counseling. He graduated from high school in 2014 and had plans to attend college, she said.\nCarter, then 17, also had struggled with depression, as well as anorexia, and had been prescribed antidepressants.\nCarter and Roy met in Florida in 2012 while visiting relatives. Their relationship largely consisted of text messages and emails.\nDaniel Medwed, a law professor at Northeastern University, said the judge has a difficult task in determining whether Carter's actions rise to the level of manslaughter. There is no Massachusetts law against encouraging someone to kill themselves. Medwed said the judge could consider Carter \"morally blameworthy,\" but \"moral blame doesn't always equal legal accountability. \"\nMartin Healy, chief legal counsel of the Massachusetts Bar Association, said the case also presents some novel issues of law on the use of cellphones and text messages. Carter was not with Roy when he killed himself, but she was talking on the phone with him as his truck filled with carbon monoxide. At one point, when Roy became frightened and got out of his truck, Carter told him to \"get back in,\" according to a text she later sent to a friend.\nCarter appealed the manslaughter charge, but the Massachusetts Supreme Judicial Court found that there was enough evidence for the case to go to trial. The court found that Carter was \"virtually present\" at the time of Roy's suicide.\nIn order to convict Carter, the judge would have to find that prosecutors had proven the elements of manslaughter beyond a reasonable doubt, a much higher legal standard to reach than the probable cause that was needed for the grand jury to indict her.",
    "source_domain": "abcnews.go.com",
    "title": "Judge faces legal quagmire in teen texting suicide trial",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/judge-faces-legal-quagmire-teen-texting-suicide-trial-48048425"
}