{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:43:59+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Mike Krzyzewski to have back surgery Friday; 4-week recovery expected",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fmike-krzyzewski-back-surgery-friday-week-recovery-expected%2Fstory%3Fid%3D44513485.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170102_ncf_goodman_krzyzewski_back_surgery_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Duke coach Mike Krzyzewski will undergo back surgery Friday, the school announced Monday.\nKrzyzewski is expected to coach Wednesday against Georgia Tech and then step away for the surgery to remove a fragment of a herniated disk in his lower back. The procedure has an anticipated recovery time of four weeks.\n\"His back has been bothering him way worse than he's let on,\" a source told ESPN.\nAssociate head coach Jeff Capel will coach the team while Krzyzewski recovers. Capel's first game will be Saturday against Boston College.\n\"Dr. William Richardson, Dr. [Allan] Friedman, and our medical team have worked tirelessly to help manage this issue for several weeks,\" Krzyzewski said in a statement. \"Together, we have determined that surgery is the best course of action at this time. During my recovery process, the team will be in the capable hands of Coach Capel, Coach [Nate] James and Coach [Jon] Scheyer. As soon as the doctors clear me to do so, I look forward to returning and giving our team 100% of my energy and attention, which is certainly something that they deserve.\"\nDuke said Krzyzewski tried several treatment options during the past month before deciding on surgery. Friedman will perform the procedure at?Duke University Hospital, according to the school.\nKrzyzewski had back issues in 1994, following surgery in October, and he stepped away in January 1995 for the remainder of the season. Duke was 9-3 overall at the time and 0-1 in ACC play.?Under Pete Gaudet, the Blue Devils went 4-15 the rest of the season. That was the last Blue Devils team to miss the NCAA tournament.\nKrzyzewski, 69, had four surgeries during the offseason to replace his left knee, repair his left ankle and fix a hernia. He missed the Georgia Tech game a year ago after feeling under the weather and being taken to the hospital for tests.?\nCapel -- who went 175-110 in nine years coaching at VCU and Oklahoma -- took over for Krzyzewski against the Yellow Jackets last season.?He also was a sophomore on the 1994-95 squad, averaging 12.5 points per game and 4.1 assists per game.\nKrzyzewski has led the Blue Devils to five national titles and has a team that was ranked No. 1 in the preseason.\nDuke is 12-2 after losing at Virginia Tech on Saturday without Grayson Allen, who is serving an indefinite suspension for his most recent tripping incident.?Allen's status for Wednesday's game is undecided, according to the school, and Krzyzewski will still determine when Allen returns to the court.\nInformation from The Associated Press contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Mike Krzyzewski to have back surgery Friday; 4-week recovery expected",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/mike-krzyzewski-back-surgery-friday-week-recovery-expected/story?id=44513485"
}