{
    "authors": [
        "Abc News",
        "More Enjoli"
    ],
    "date_download": "2018-04-24 22:35:35+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "A young giraffe is safe behind the scenes at a zoo in Indiana, after escaping into a parking lot Monday",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fyoung-giraffe-back-mother-indiana-zoo-escaping-parking%2Fstory%3Fid%3D54703535.json",
    "image_url": "https://s.abcnews.com/images/US/giraffe-1-abc-er-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A young giraffe is said to be relaxing with her mother today at an Indiana zoo, after helping the staff get the new season off and running, literally, recently.\nOn Monday, Thabisa, a nearly 6-month-old female giraffe, got loose at the Fort Wayne Children's Zoo.\n\"We have radios that were able to notify all zoo staff immediately. ... That call went out over the radio with a little bit of a panicked tone, as you might imagine,\" Joe Smith, a zoo spokesman, told ABC affiliate WPTA-TV.\nWPTA\nAccording to WPTA-TV, Thabisa, the zoo's youngest giraffe, broke through a fence and entered a parking lot nearby, causing the staff to scramble.\n\"Baby giraffes don't walk anywhere -- they run everywhere they go -- so that was a little bit expected,\" Smith said.\nThe zoo said the parking lot was not accessible to the public. It took zoo staff about two hours to coax and direct Thabisa in the direction of the barn.\n\"She remained on zoo property for the duration of her adventure,\" the zoo said in a statement Monday.\nIn a statement on Twitter, the zoo said today that Thabisa was \"safe and sound\" after her adventure and that she would remain behind the scenes with her mother for now.\nOur youngest giraffe Thabisa is taking a rest after her exciting day yesterday (shenanigans are exhausting!). She will remain behind the scenes with mom for now. pic.twitter.com/lj1EiciGBg — Fort Wayne Kid's Zoo (@fwkidszoo) April 24, 2018\nThe zoo said that in its 40 years of having giraffes, this was the first time one of them had escaped the enclosures.\n\"We will reevaluate our giraffe exhibit and take extra precautions to ensure the continued safety of our animals and staff,\" the zoo's statement said.\nSmith said staff do practice drills regularly in case of animal escapes. The zoo had just reopened Saturday for the season.",
    "source_domain": "abcnews.go.com",
    "title": "Young giraffe is back with her mother at Indiana zoo after escaping into parking lot",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/young-giraffe-back-mother-indiana-zoo-escaping-parking/story?id=54703535"
}