{
    "authors": [
        "Abc News",
        "More Conor"
    ],
    "date_download": "2017-08-14 13:44:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Top US general says it's Trump's decision whether to strike N. Korea",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2Ftop-us-general-trumps-decision-strike-korea%2Fstory%3Fid%3D49203417.json",
    "image_url": "http://a.abcnews.com/images/Politics/gen-joseph-dunford-epa-ml-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The decision on whether to strike North Korea ultimately rests with President Donald Trump, his top military adviser told reporters at a news conference today, adding that the focus is now on diplomatic and economic efforts to solve the standoff.\nThe United States is watching closely whether Pyongyang will fire missiles near Guam, with North Korea’s stated \"mid-August\" deadline for doing so falling Tuesday on a major Korean holiday, Liberation Day, Gen. Joseph Dunford, chairman of the Joint Chiefs of Staff, told ABC News' Martha Raddatz.\n\"I don't know if they're going to do what they say they're going to do. But we're not complacent about it,” Dunford told ABC News after the news conference in Seoul. “We're paying attention to everything that they say, everything that they do and we're preparing accordingly.”\nDunford attempted to reassure Americans, as well as Japanese and South Koreans, that the U.S. military has the \"capability to defend them against a limited attack that North Korea is capable of delivering today.\"\nAsked during his news conference about Trump's rhetoric and whether it has made the situation worse, Dunford said the president is communicating to a number of different audiences, including North Korean leader Kim Jong-un and China.\n\"My job is not to access whether the president's rhetoric is helpful or not,\" Dunford said. \"My job is to make sure that when a president makes a decision, and he makes a decision to use military force, that I provide him with good options.\"",
    "source_domain": "abcnews.go.com",
    "title": "Top US general says it's Trump's decision whether to strike N. Korea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/top-us-general-trumps-decision-strike-korea/story?id=49203417"
}