{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 21:16:38+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fwoman-charged-found-canada-border-53852108.json",
    "image_url": "http://abcnews.go.com/International/wireStory/woman-charged-found-canada-border-53852108",
    "language": "en",
    "localpath": null,
    "maintext": "A North Carolina woman rented an SUV and picked up six Mexican citizens who illegally crossed into the United States at a remote border crossing in Vermont near the Canadian border, federal prosecutors said.\nCarmen Melari Ferrufino Perdomo, 31, of Charlotte, North Carolina, was charged Monday with transporting people into the United States who didn't have permission to be in the country.\nAccording to the complaint, the Border Patrol received a report just after 2 a.m. Sunday of six people walking near the border. Then a short time later, agents spotted them in an SUV with Ferrufino, a U.S. citizen from Honduras. It's unclear if she has an attorney to comment on her behalf.\nFerrufino's passengers, who were between the ages of 21 and 54, told investigators they had crossed into the United States that night. None of the Mexican citizens, who were later arrested as material witnesses in the case, had criminal or immigration records.\nThe complaint also said Ferrufino flew from New York to Burlington on Saturday where she rented the car in which she was apprehended. Records said she had planned to return the vehicle later Sunday in New York.\nIn recent months the Border Patrol has had multiple smuggling incidents in the area.",
    "source_domain": "abcnews.go.com",
    "title": "Woman charged with helping 6 who illegally crossed into US",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/woman-charged-found-canada-border-53852108"
}