{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:52:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Top human rights official urges Turkey to 'change course'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ftop-human-rights-official-urges-turkey-change-45502667.json",
    "image_url": "http://abcnews.go.com/International/wireStory/top-human-rights-official-urges-turkey-change-45502667",
    "language": "en",
    "localpath": null,
    "maintext": "Europe's top human rights institution on Wednesday urged Turkey's leaders to \"urgently change course\" and reverse violations of media freedoms and the rule of law, voicing alarm over democracy in the country.\nThe call comes as Turkey is set to hold a referendum on April 16 on switching to a presidential system — a move critics fear will concentrate too many powers in the hands of President Recep Tayyip Erdogan whom they accuse of increasingly authoritarian behavior.\nIn a 25-page report released Wednesday, the Council of Europe's Commissioner for Human Rights, Nils Muiznieks, said that Turkey's already worrisome lack of media freedoms and freedom of expression had reached \"seriously alarming\" levels since the government declared a state of emergency after a failed military coup attempt in July.\nThe commissioner also expressed concerns over constitutional amendments that will be voted on in the referendum, saying they \"foresee a significant further diminution of the autonomy of the Turkish judiciary vis-a-vis the executive and legislative branches.\"\nAmong other issues, Muiznieks criticized Turkey's broad definition of terrorism and terrorist propaganda that include statements that do not incite violence, the imprisonment of dozens of journalists, the erosion of the independence of the judiciary, the abundant use of defamation laws used to silence critics, censorship on the internet and the use of state resources to favor pro-government media.\n\"The commissioner urges the Turkish political leaders in the strongest possible terms to change course and start separating what is a terrorist action from criticism and dissent, and to display the responsibility and tolerance expected in a democratic society. They must redevelop the political will necessary to tackle the very long-standing systemic issues suppressing freedom of expression, including on the internet,\" the report said.\nThere was no immediate government response to the report, which Council of Europe officials said had been presented to the government prior to its release.\nMuiznieks said the attempted coup and the terror threats cannot justify \"measures that infringe media freedom and disavow the rule of law to such an extent.\"\nTurkey declared a state of emergency to deal with the perpetrators of the failed coup as well as a spate of deadly attacks carried out by the Islamic State group or Kurdish militants. Critics say the government has used the emergency powers to go after all opponents.\nAround 41,000 people have been arrested since then, while more than 100,000 people have been dismissed from government jobs. In addition, hundreds of media companies and civil society groups have been closed down while around 150 journalists and a dozen pro-Kurdish legislators have been jailed.\nThe report was based on Muiznieks' visits to Turkey in April and September 2016.",
    "source_domain": "abcnews.go.com",
    "title": "Top human rights official urges Turkey to 'change course'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/top-human-rights-official-urges-turkey-change-45502667"
}