{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:14:38+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "The reality TV star is pushing for stronger regulation of cosmetic products.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Fkourtney-kardashian-arrives-capitol-hill-clean-cosmetics-54703693.json",
    "image_url": "https://s.abcnews.com/images/Politics/WASH 5 KIM KARDASHIAN ON COSMETICS REFORM ABC UNI3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Kourtney Kardashian arrives on Capitol Hill to clean up cosmetics\nThe facts that we gifting gas so much and you know even going into a store to buy anything that we you shouldn't be let go walking around aimlessly like. Is this okay is this not okay and everybody should have the right to you know healthy. I Axel I do find my I take the time defines it might go to products and then. Try to stick to those but I do you get a ton of products and Timmy. Most of which I and of donating because I don't have the time even like the beef products from making it which I should be able to use and you know but I don't now and sometimes they don't have the time derby senators and you know find out that I feel lucky to have the resource is but I do feel like it's time. Our you know congress to do its job because as parents like there's only. So much time that we have to research and you know likely rely on acts arts. And there's only so much we condemn it you know I am Ammann beauty am me and sound. OK you know my sister's addicts have been tested. Him EG needs squared around and it. I don't know what's at as a there. Air company ends at I think it would be nice if there are. You know. Eight through regulates of that people running these businesses in these companies and you know have some. Am make standards of why it wet T use I think it's it's like a guessing game.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Kourtney Kardashian arrives on Capitol Hill to clean up cosmetics",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/kourtney-kardashian-arrives-capitol-hill-clean-cosmetics-54703693"
}