{
    "authors": [
        "Abc News",
        "Bill Hutchinson",
        "More Whit",
        "More Bill"
    ],
    "date_download": "2018-05-31 00:30:21+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "At least 75 homes have been destroyed by lava flowing from the Hawaiian volcano.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2F75-homes-destroyed-hawaiian-volcanic-eruption-haze-detected%2Fstory%3Fid%3D55530930.json",
    "image_url": "https://s.abcnews.com/images/US/hawaii-volcano-eruption-03-rt-jef-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lava flowing unchecked from the volcanic eruption on the Big Island of Hawaii has now destroyed 75 homes and has sent a volcanic haze all the way to Guam.\nInterested in Volcanoes? Add Volcanoes as an interest to stay up to date on the latest Volcanoes news, video, and analysis from ABC News. Add Interest\nThe Kilauea volcano, which exploded on May 3, showed no signs of calming down as its multiple fissures keep bubbling up through the earth, fueling a raging lava river that at some points was moving 500 yards an hour.\nIn the hard-hit Leilani Estates near the eastern corner of the Big Island, 75 homes have now been destroyed, Hawaii County officials said Wednesday, which is up from 51 per day earlier.\nTamir Kalifa/The New York Times/Redux\n\"High concentrations of volcanic gasses are still present in the Leilani Estates area, where fissures continue to create high fountains of lava,\" County of Hawaii Civil Defense officials said in a statement on Wednesday. \"Residents close to any volcanic activity should remain alert and be prepared to voluntarily evacuate if necessary.\"\nThe lava flow also covered a section of Highway 132 on the Big Island, making it harder for residents still in the area to evacuate. Cell phone and landline communications in the Kapoho area were severely limited due to down power and telephone lines, according to Civil Defense officials.\nPolice, firefighters and public works employees went door to door in the Kapoho Beach and Vacationland areas evacuating residents.\nLocal resident Marvin Jones said he was staying put despite haze and volcanic rocks falling from the sky and the unpredictable lava flow.\nMarco Garcia/Reuters\nThe lava had reached the back of his son's home and was pouring into a large crack in the ground left by a previous volcanic eruption, Jones told ABC News.\n\"We're just seeing how it's going, you know what I mean,\" said Jones, who lives in the lower Puna area of the Big Island. \"Someday, hopefully, it will calm down. This is life in lower Puna. You just go with it. Hopefully, nobody gets hurt.\"\nMarco Garcia/Reuters\nThe National Weather Service reported that the volcanic haze from the eruption had reached Guam, some 4,000 miles away.\nLava had also breached the property of the Puna Geothermal Venture plant, but officials told ABC News there was little danger of a toxic gas release because the geothermal wells had already been capped in preparation for the volcanic eruption.\nLava from two of the bigger fissures, fissure 8 and 18, in the lower East Rift zone of the Kilauea volcano was shooting up fountains of red-hot lava some 200 feet in the air, sending down a rain of rock in all directions.\nThe one good sign Wednesday was that trade winds had returned to the area pushing \"vog\" or volcanic fog southwest away from the area where there are homes.",
    "source_domain": "abcnews.go.com",
    "title": "75 homes destroyed by Hawaiian volcanic eruption as haze detected in Guam",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/75-homes-destroyed-hawaiian-volcanic-eruption-haze-detected/story?id=55530930"
}