{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 08:46:45+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 00:00:00",
    "description": "Dangerous winds persist as wildfires roar in California",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FTravel%2FwireStory%2Fdangerous-winds-persist-wildfires-roar-california-51733280.json",
    "image_url": "http://a.abcnews.com/images/Lifestyle/WireAP_f09977437aaa4729a202b7b6b6a71bb7_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The winds aren't changing for Southern California's wildfires yet.\nThe fifth largest blaze in state history was threatening thousands of homes as it churned through coastal mountains amid persistently dangerous weather conditions.\nRed Flag warnings for fire danger due to Santa Ana winds and a critical lack of moisture were extended into the week instead of expiring Monday afternoon as was initially forecast.\n\"It doesn't get much drier than this folks,\" the National Weather Service Service tweeted, adding that more than 80 observation sites in the region reported afternoon relative humidity levels between just 1 and 9 percent.\nOn Monday, ash fell like snow and heavy smoke had residents gasping for air in foothill towns near Santa Barbara, the latest flare-up after a week of wind-fanned wildfires throughout the region.\nWith acrid smoke thick in the air, even residents not under evacuation orders were leaving, fearing another shutdown of a key coastal highway that was closed intermittently last week.\nOfficials handed out masks to those who stayed behind in Montecito, an exclusive community about 75 miles (120 kilometers) northwest of Los Angeles that's home to stars such as Oprah Winfrey, Jeff Bridges and Drew Barrymore.\nActor Rob Lowe wore a mask as he live-streamed his family evacuating Sunday from their smoke-shrouded home.\n\"Praying for the people in my area,\" he said to his Instagram followers. \"Hope everybody's getting out safe like we are, and thanks for the prayers and thoughts. And good luck to the firefighters, we need you!\"\nTalk show host Ellen DeGeneres tweeted that neighbors were helping each other and their animals get to safety.\n\"I'm sending lots of love and gratitude to the fire department and sheriffs. Thank you all,\" she wrote.\nThe blaze — known as the Thomas fire — has destroyed 683 homes, officials said. It was partially contained after burning 362 square miles (937 square kilometers) of dry brush and timber.\nCustomers coming into Jeannine's American Bakery in Montecito brushed ash from their clothes and marveled at smoke so heavy that visibility was down to just a few feet.\n\"There's so much ash it's unbelievable,\" manager Richard Sanchez said. \"Everything is white. The streets are covered, cars are covered, our parking lot is covered.\"\nDr. Helene Gardner, an expert in air quality at University of California, Santa Barbara, watched ash fall \"like a fine snow\" from her home after the school postponed final exams until January. She said her environmental sciences students got a kick from the fact that the delay was directly related to their field of study.\nGardner warned that the air alerts should be taken seriously because of airborne particulates — \"nasty buggers\" — that can lodge in lungs and cause respiratory problems.\nShe said the levels of particulates from a wildfire can approach those seen near coal-burning plants in pollution-heavy China and are especially problematic for people exerting themselves.\n\"When I look out my window and see someone bicycling I think, 'No, no, no, get off your bike and walk!'\" she said.\nSanta Ana winds have long contributed to some of the region's most disastrous wildfires. They blow from the inland toward the Pacific Ocean, speeding up as they squeeze through mountain passes and canyons.\nThe National Weather Service said that if the long-term forecast holds, there will have been 13 consecutive days of dry offshore flow before it ends Friday afternoon. There have only been 17 longer streaks since 1948, including the record of 24 days set between December 1953 and January 1954.\nHigh fire risk is expected to last into January.\n———\nJohn Antczak in Los Angeles contributed to this report.\n———\nFollow Weber at https://twitter.com/WeberCM .\n———\nFor complete coverage of the California wildfires, click here: https://apnews.com/tag/Wildfires.",
    "source_domain": "abcnews.go.com",
    "title": "Dangerous winds persist as wildfires roar in California",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Travel/wireStory/dangerous-winds-persist-wildfires-roar-california-51733280"
}