{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 12:40:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Iran says it will look into releasing British national",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Firan-releasing-british-national-51713287.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_8955c3d4a07e4f30a200b89b0580c9da_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Iran? Add Iran as an interest to stay up to date on the latest Iran news, video, and analysis from ABC News. Add Interest\nIran's Foreign Ministry said Monday it will raise the case of a detained British-Iranian woman with the judiciary \"out of humanitarian concerns\" following a visit by Britain's foreign secretary.\nMinistry spokesman Bahram Ghasemi said the final decision on whether to release Nazanin Zaghari-Ratcliffe, who is serving a five-year sentence for allegedly plotting to overthrow the government, rests with the judiciary.\nZaghari-Ratcliffe \"is considered an Iranian national and should serve her prison conviction according to the judicial system of Iran,\" he added.\nBritish Foreign Secretary Boris Johnson raised the case during a two-day visit to Iran that concluded Sunday. Zaghari-Ratcliffe, a charity worker, was detained in April 2016. Her family has denied the allegations against her.\nShe is among several dual nationals held in Iran, where the judiciary and security forces are dominated by anti-Western hard-liners. It's unclear whether Foreign Minister Mohammad Javad Zarif, a relative moderate, can secure her release.\nJohnson recently complicated efforts to free her by saying incorrectly that she was training journalists when arrested. He has since apologized.\nBritain and Iran have discussed the release of some 400 million pounds ($530 million) held by London, a payment Shah Mohammad Reza Pahlavi made for Chieftain tanks that were never delivered. The shah abandoned the throne in 1979 and the Islamic Revolution soon installed the clerically overseen system that endures today.\nAuthorities in London and Tehran deny the payment has any link to Zaghari-Ratcliffe.\nHowever, the United States made a $400 million transfer to Iran in January 2016 when Iran freed Washington Post journalist Jason Rezaian and three other Iranian-Americans. That money too involved undelivered military equipment from the shah's era. Some U.S. politicians criticized the transfer, calling it a ransom payment.",
    "source_domain": "abcnews.go.com",
    "title": "Iran says it will look into releasing British national",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/iran-releasing-british-national-51713287"
}