{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-02 23:54:29+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "ABC News' Eva Pilgrim tours inside the Pepsi fan experience.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fvideo%2Fvirtual-reality-experience-puts-fans-iconic-super-bowl-52807100.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/180202_vod_pilgrim_superbowl_ads_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Virtual Reality experience puts fans into iconic Super Bowl ads\nI needed help him here we are in Minneapolis Minnesota receiver it keeps you had earlier and I can't see generation and pop up in all kinds of things that associate with Pepsi. Over the years that Al dying and people are coming into the Tenet seated themselves the first thing punish ice. This. Jeff Gordon's car NASCAR fan. He never seen inside a NASCAR artistic peak but tightening that seat is it like hides in there. I guess it's off for safety reasons but there's nothing else in the act Carlin was actually on it is like I think you wanna write an accurate narratives. So many of them are smaller vendors have ever been inside and that there. The other really cool thing they had here for people tried his virtual reality actually take you through iconic Pepsi commercials over the years. And we're just gonna give you a peak of it hopefully. He put on virtual reality goggles. And then this is in. I used all of these dots on the screen you can see kind of what happens. As you could drill I think the car. They don't look for the gotten acts. This sorry you would think they could find disaster. But it takes you through this whole experience. The car. And then hopefully here and then it will see there we go. But you can see on that screen exactly what I can see in these goggles here. And you delivered for Audi oh is now little group B. Are moving around and what it means that anybody else conceit. But you guys hit the basic idea how this goes. Wait for the there's one more former fellow teammate take from here. I live show you guys and rightful. But you're seeing exactly what I think this is famous Cindy Crawford commercial for Pepsi you're ever. And I am going to take these off now they can show you. Yes he gets his. The goggles and got an experience at all and evening. But here. Inside this pop up they actually have. That scene. From the commercially as southerners reality here you'd actually see experiences solvent. And it got some of them other commercials from over time those iconic ones that we all remember that the raids throughout the city proper. All of that here that you could actually like hanging out on this added that we creation that's that. Good my favorite thing they have here. Is it. This purple rain weren't Minnesota politics. And so it only makes sense that they would have I'm honored him here. This is of memory of that Super Bowl that prince played in the rain in Miami. And connecting taking umbrella. As dad thought that the company. I think that it really important to grant opportunities for people and things have been. That it is actually wet so you look at Latin yes well welcome. In that area. All affect you know little billing and here is round of the playoffs this is the actual piano. That regionals in his rational for patsy. So you can think that if you have mechanic Erie county line. I am not about talent like. They've got a diners have here like an old classic fifties style diner. That is where the bar and neither they have opened her I edited it for influencers and media low cash is playing the at this stage set up. A lot of fun things to be open to the public tomorrow if you guys want to check out here in Minnesota. I definitely a fun experience you know flip through really quickly and it's a little bit off the beaten path had a favorable live and it's inside where it's warm. On the fifteenth and it's really cold outside the of course to bring about our friend here at developing continue. Advocating it.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Virtual Reality experience puts fans into iconic Super Bowl ads",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/video/virtual-reality-experience-puts-fans-iconic-super-bowl-52807100"
}