{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 16:17:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "'Game of Thrones' recap: 'Eastwatch'",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fgame-thrones-recap-eastwatch%2Fstory%3Fid%3D49204842.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/thrones-hbo-er-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "WARNING: MAJOR SPOILERS AHEAD\nAfter last week's fiery episode, this week's \"Game of Thrones\" saw its lead characters back making moves on the chessboard.\nDaenerys, fresh off her decisive victory against the Lannister forces, further exerts her power against surviving enemy soldiers, while her new ally, Jon Snow, continues to want to turn the focus toward the White Walkers.\nMeanwhile, mystery is afoot in Winterfell, and Sam Tarly decides on a career change. We start on the road between Highgarden and King's Landing, where we find out if Jaime Lannister survived his long fall into a surprisingly large body of water.\nOn the road from Highgarden\nAfter last week's cliffhanger, both Jaime and Bronn swim to shore, shaken but essentially unhurt. Jaime is still in shock following the battle against Daenerys, her Dothraki army, and, oh yeah, her fire-breathing dragon. He's especially worried since Dany only used one of her dragons, and she's got two more back in Dragonstone. Jaime realizes he has to tell Cersei what they're up against.\nShockingly, there are other survivors from the battle. Dany tells them they have a choice: Bend the knee or die. A number of the soldiers pick the former, and a lot more join when they hear Drogon's roar. Still, a few remain standing, including Lord Tarly and Dickon, Sam's father and brother, respectively.\nTyrion suggests sending the elder Tarly to join the Night's Watch at the Wall, but he rejects that proposal. Following his father's lead, Dickon also refuses to bend the knee to Dany. Despite Tyrion's pleas otherwise, she uses her dragon to burn both Tarlys alive. Everyone bends the knee after that.\nBack at Dragonstone, Tyrion expresses his concern to Varys about what transpired, given that Dany's father, the Mad King, also employed the death-by-dragon-fire method of execution. Varys assures him that Dany is not her father, but says they need to find a way to get her to listen to them.\nWinterfell\nBran's visions show him that the huge and ever-terrifying Army of the Dead is marching toward the Wall. He sends a raven to Jon, telling him not only about the White Walkers, but also that he and Arya are alive.\nWith this information, Jon and Tyrion hatch a plan to capture a White Walker beyond the Wall and bring it to Cersei to prove that the Army of the Dead is real, which they hope might broker at least a temporary peace between Dany and King's Landing. In order to do that, Tyrion intends to try to talk to Jaime to ask him to convince Cersei to meet with Dany. Jon declares that he'll lead the raid beyond the Wall.\nWith Jon still at Dragonstone, the lords who made him King in the North begin to grow restless that he is not, well, in the North. Sansa defends Jon's absence, but not strongly enough for Arya's liking. In private, she accuses Sansa of secretly wanting to rule Winterfell herself.\nLater, Arya sees Littlefinger mysteriously talking to someone, which isn't too strange, since that's pretty much all he does. Arya then watches as another person delivers him a scroll. \"Lady Stark thanks you for your service,\" Littlefinger says, which does not put Arya's mind at ease. She sneaks into his room and finds the scroll, which is the message Sansa wrote under duress way back in season one asking her family to pledge allegiance to King Joffrey. From the shadows, Littlefinger watches as Arya leaves his chamber.\nThe Citadel\nBran also sent a raven to the Citadel informing them of the White Walker threat. Sam suggests that the maesters tell everyone that the Army of the Dead is indeed real. However, they aren't convinced and think that the letter might be a forgery sent by Dany to draw Cersei's armies from the South. They agree though to write back to Winterfell. After Sam leaves the room, the Archmaester tells the others that he hasn't yet told the young Tarly that his father and brother are dead.\nEven without that knowledge, Sam isn't having fun at work. He's frustrated that the maesters seem more concerned with reading old scrolls that counted steps in cities and documented, uh, bowel movements than with solving real-world problems. While Sam vents, Gilly reads from a book that describes how Rhaegar Targaryen, Dany's brother and Jon's real father, had his first marriage annulled and that he secretly married again in Dorne, presumably to Lyanna Stark, Jon's mother. That means Jon would be their lawful son, and perhaps the rightful heir to the Iron Throne instead of Dany.\nSam misses the import of what Gilly is reading before interrupting her. But he does decide to sneak into the forbidden library again and after that leaves the Citadel, apparently for good.\nKing's Landing\nJaime returns to Cersei and tells her they cannot defeat Daenerys. He also tells her that despite what she has long believed, Tyrion didn't kill Joffrey. It was Olenna Tyrell.\nDavos and Tyrion arrive by boat at King's Landing to meet Jaime. Underneath the Red Keep, Bronn tells Jaime he is bringing him there to train when in fact he is taking him to meet Tyrion. Jaime is not at all receptive to his brother's presence as he's still angry about Tyrion killing their father. Tyrion tells Jaime that they both know that Dany will win this war. When Jaime asks if Dany wants Cersei to bend the knee, Tyrion says no -- not now, anyway. Instead, he says, she has a \"more important request.\"\nWhile all that goes down, Davos searches the streets of King's Landing and finds the one and only Gendry, the surviving bastard of the late King Robert Baratheon, last seen sailing away after escaping the Red Woman, who intended to sacrifice him to the Lord of Light. Gendry is happy to join Davos, and they return to their boat. Just as they're about to leave, two soldiers arrive. Davos successfully bribes them at first, but then they spot Tyrion. Seeing no other choice, a hammer-wielding Gendry kills the soldiers.\nJaime returns again to Cersei, and tells her that he met with Tyrion. Cersei reveals that she knew about the meeting and that she allowed it to happen. She also reveals that she's pregnant with Jaime's child and will tell anyone who asks that her brother is the father. The two embrace, and it's an oddly touching moment, up until Cersei whispers in Jaime's ear to never betray her again.\nDragonstone\nDany and Drogon return to Dragonstone victorious. Another of her dragons approaches Jon, who nervously reaches out his hand to touch the beast's snout. He successfully pets it without the dragon ripping his arm off, which surprises both him and Dany. She senses Jon's disapproval of her military methods. She also asks him what Davos meant when he said Jon took a knife to his heart for his people. Before Jon can answer, a greyscale-free Jorah arrives, and Dany welcomes back her old adviser with open arms.\nWhen they return to Dragonstone, Davos tells Gendry to keep his identity a secret. But when Gendry is introduced to Jon, he immediately reveals his true identity, and the two bond over their bastard status and their fathers' friendship.\nJon prepares to leave Dragonstone for his White Walker-capturing mission, and Jorah joins him. Jon tells Dany that if he doesn't survive his mission, she won't have to worry about the King in the North anymore. \"I've grown used to him,\" Dany replies. Be still, my fiery and icy heart.\nThe Wall\nJon, Jorah, Davos and Gendry arrive at Eastwatch, a castle along the Wall under the care of the wildling Tormund. They tell him they want to go beyond the Wall, and Tormund says he just captured some men wanting to do the same thing. They turn out to be the Hound along with members of the Lord of Light-worshipping Brotherhood Without Banners. Jon and company go to talk to the prisoners, and, after some arguing, Jon assures the group that they are all on the same side. Why? \"We're all breathing,\" Jon declares.\nWith that out the way, the whole group begins its snowy journey beyond the Wall.",
    "source_domain": "abcnews.go.com",
    "title": "'Game of Thrones' recap: 'Eastwatch'",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/game-thrones-recap-eastwatch/story?id=49204842"
}