{
    "authors": [
        "Abc News",
        "More Dominick"
    ],
    "date_download": "2018-04-24 21:03:01+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "“Most police do this kind of thing,\" Chief Jeffrey Gyurina said, \"day in and day out.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fpolice-drive-84-year-man-hospital-wife-full%2Fstory%3Fid%3D54690808.json",
    "image_url": "https://s.abcnews.com/images/US/officer-elderly-assist-ap-jef-180423_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It’s a duty that police officers spend most of their time doing day in, and day out -- helping others.\nThat’s exactly what Deputy Chief Jason Bentley of the Montoursville Police Department in Pennsylvania did when an 84-year-old man needed a ride to the hospital to see his wife.\nMontoursville Police Department responded to a call of a woman in full arrest on April 19. She was not breathing and she didn't have a pulse, Chief Jeffrey Gyurina said.\nShe was taken to UPMC Susquehanna hospital, according to the Montoursville Police Department’s Facebook page. She was taken by ambulance and her husband was left without a way to get to the hospital, Gyurina said.\nThough he had a car, the woman's husband told Gyurina he was not comfortable driving since he was still recovering from a recent hip injury. He explained that he did not want to put himself or others in danger if he got behind the wheel.\nMontoursville Police Department/AP\nThat’s when Gyurina gave the elderly man the patrol cell phone number. The phone is passed from officer to officer and whoever is on duty patrolling would come and pick him up, he told the man.\nA few hours later, the elderly man called the number and Bentley came by to pick him up.\nThe man’s closest relatives were in Maryland, Gyurina told ABC News.\n\"Hospital staff came out with a wheelchair and took him to his wife’s bedside in the emergency room,” the department posted.\n“Most police do this kind of thing,\" Gyurina said, \"day in and day out.\"",
    "source_domain": "abcnews.go.com",
    "title": "Police drive 84-year-old man to the hospital to see his wife after she went into full arrest",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/police-drive-84-year-man-hospital-wife-full/story?id=54690808"
}