{
    "authors": [
        "Abc News",
        "More John"
    ],
    "date_download": "2017-12-12 02:34:41+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Moore, Jones set to face off in Alabama Senate election",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Froy-moore-doug-jones-set-face-off-alabama%2Fstory%3Fid%3D51720725.json",
    "image_url": "http://a.abcnews.com/images/Politics/doug-jones-roy-moore-gty-pol-jt-171210_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Alabama voters head to the polls Tuesday to elect a U.S. Senator in a race thrust into the national spotlight after allegations of sexual misconduct against the Republican nominee, former Alabama Supreme Court Chief Justice Roy Moore.\nInterested in Roy Moore? Add Roy Moore as an interest to stay up to date on the latest Roy Moore news, video, and analysis from ABC News. Add Interest\nThe state has not elected a Democrat to the U.S. Senate since 1992, but Moore is locked in a tight race with his Democratic opponent, Doug Jones, a former U.S. attorney.\nMoore faces allegations from eight women who have accused him of sexual misconduct toward them when he was in his 30s and, in some cases, when the women were in their teens. Moore has denied the allegations.\nPrior to the allegations surfacing last month, Moore already had a long-standing reputation as a fierce defender of Christianity in the public sphere, and was twice removed from his position as Chief Justice of the Alabama Supreme Court for violating judicial orders.\nThe race has created a wedge between many Republicans on Capitol Hill, who have maintained that Moore should step aside, and President Donald Trump, who has endorsed Moore.\nWhile he has not campaigned in Alabama, Trump urged Alabama voters to support Moore at a weekend rally in Pensacola, Florida, roughly 20 miles from the Alabama state line and close enough to be seen in the Alabama media market.\nThe president also recorded a robocall over the weekend urging Alabama voters to back Moore.\n\"Roy Moore is the guy we need to pass our 'Make America Great Again' agenda,\" Trump said on the call. \"Roy is a conservative who will help me steer this country back on track after eight years of the Obama disaster. Get out and vote for Roy Moore,\" Trump said.\nTrump also has argued that Moore has consistently denied the allegations as part of his rationale for endorsing him.\nNational Republicans, including Senate Majority Leader Mitch McConnell, R-Ky., have called on Moore to step aside in the wake of the sexual misconduct allegations, but Moore has remained defiant. Republican senators from Jeff Flake of Arizona to Lindsey Graham of South Carolina have maintained that Moore is not fit to serve in the U.S. Senate, and Flake went as far as donating $100 to the Jones campaign.\nSen. Cory Gardner, R-Colo., the head of the National Republican Senatorial Committee, has maintained that even if Moore should win the election he should be expelled from the United States Senate.\nAlabama's senior senator, Republican Richard Shelby, has been particularly outspoken about not backing Moore.\n\"I wouldn't vote for Roy Moore. I think the Republican Party can do better,\" Shelby said Sunday on CNN.\nBut despite the allegations and widespread backlash against Moore, Jones still faces an uphill battle in a state that President Trump won by over 20 points in 2016.\nMoore has strongly embraced President Trump, and has tried to paint Jones, who was appointed as a U.S. attorney by Bill Clinton in 1997, as too liberal on issues such as illegal immigration, abortion and same-sex marriage.\nJones has pitched himself as someone who can reach across party lines, and has run a campaign focused on turning out African-American voters as well as Alabama Republicans skeptical of Moore both before and after the allegations of sexual misconduct surfaced.\nThis past weekend Jones campaigned across the state with numerous high-profile African-American politicians, including Sen. Cory Booker, D-N.J., and Alabama's only Democrat in the House, Rep. Terri Sewell, D-Ala.\nJones also has also saved his fiercest attacks on Moore for the final weeks of the campaign.\n“I damn sure believe that I have done my part to ensure that men who hurt little girls should go to jail and not the U.S. Senate,\" Jones said at a campaign rally in Birmingham last week.\nWhile the makeup of the electorate is uncertain, some recent polling suggests Jones has a chance at pulling off an upset. A Fox News poll released Monday shows Jones leading by 10 points. A Washington Post/George Mason University poll released earlier this month had Jones with a 3 point lead.\nYour Voice, Your Vote: ABC News will have live coverage of the Alabama special election on Tuesday night at 8:30 p.m. ET on abcnews.com, Facebook, Twitter, and YouTube, and the ABC News app.",
    "source_domain": "abcnews.go.com",
    "title": "Roy Moore, Doug Jones are set to face off in Alabama Senate election",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/roy-moore-doug-jones-set-face-off-alabama/story?id=51720725"
}