{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:09:34+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Surgeon John Keleman says if one stab wound had cut through Payton's artery, \"she would have had a major heart attack from the amount of bleeding and probably died.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2F2020%2Fvideo%2F12-year-survives-stabbed-19-times-friends-part-52809848.json",
    "image_url": "http://a.abcnews.com/images/2020/180202_2020_act2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 12-year-old survives being stabbed 19 times by her friends: Part 2\njust outside Milwaukee, and a horrific scene is playing out. A birthday sleepover with three P 12-year-olds the night before, and now two of those girls are missing. The third, Payton leutner, has somehow crawled out of the woods, covered in stab wounds. 19 of them. Major search by ground and air -- A stabbing accident happened. We are on the scene here. Reporter: Morgan guyser and Anisa Weier were missing. We had people all over waukesha looking for her. That's her, that's Anissa, she's been missing for I don't know how long now. Reporter: Kristi had her daughter's cell phone she scours it, searching for any clues. Instead, discovering something else. Checked all of her text messages trying to figure out the people that she called, and contacted last, and I found basically her goodbye notes. Reporter: On that cellphone this note, drafted by Anissa. This is my final wish to those who care, do not grieve my absence, but remember me for who I was. I love and cherish you all, and wouldn't do you harm. I still had no idea, but as soon as I found that I called the detective right away, and showed him that information. Reporter: While at that hospital, surgeon John Keleman tells us he will never forget the wounds. He tells me about one of the stab wounds to Payton's heart. Reporter: The knife cut through the tissue but not the artery itself. Exactly. Reporter: And had it not? Had it not, she would have had a major heart attack from the amount of bleeding and probably died within a minute or two. Reporter: But they would save her life as the hunt for the two other girls intensified. Nearly five hours after Payton crawled out of the woods, her two friends are suddenly found on the side of interstate 94 walking out of walk waukesha. They have found those two girls I'm told around, 12 years old, and those girls are now being questioned by waukesha city police. A knife with a 5-inch blade was found in one of the girls' bags. Lieutenant Tom Moerman confronting them. I asked her to show me her hands. I noticed there was some staining on her sweatshirt. Reporter: The detective told us that they had located Morgan and Anissa and that they were taking them to the police station to ask them some questions. I remember talking on the way how we were going to punish Morgan for this. Reporter: Anissa Weier's parents arrive at the police station too. They are told to wait. I stood right dead center of that lobby in full view of two cameras waiting to see my daughter. Reporter: And listen to what their daughter Anissa says to the investigator. Your parents know that you're here talking to me, okay. And -- Are they scared? They're glad they're S -- they're -- they're so glad that you're safe. They're -- we were scared for you guys. Reporter: Both separate rooms, going beginning to explain their plot to kill, referring to Payton by her nickname, Bella. Why do you think you're here today? Because Anissa, and I ran off after hurting Bella. Reporter: Morgan tells the detective the plan to kill Payton had been in the works for months. So you guys have been planning this a while? Since December, she was my best friend since fourth grade. Who was? Payton. So why did you pick Payton? I didn't pick her. Who picked her? Whoever Anissa was talking about. She made it seem necessary. Reporter: Necessary, a word Morgan geyser would use again, and again with that detective, saying her devotion to that fictional character slender man drove her to do this. There's this website called -- the creepypasta wiki. It's full of, like, horror stories. There was one of them called \"Slender man.\" Reporter: Slender man is the story of a character who suddenly appears, he changes and evolves all the time, with help from fans all over the world adding to the story giving a fictional character new life everyday. You have said that slender man is the boogieman of this digital generation. He is -- the thing that we fear that we don't actually encounter. Right? So we check our -- we check under our beds for the slender man but he's, you know, not actually there. Reporter: Morgan and Anissa not only believed in slender man, they wanted to prove to the world he was real. Morgan said , hey Anissa we should be proxies. I was like, okay, how would we do that? She indicated that in order to become a proxy of slender man you needed to kill somebody to prove yourself worthy to him. I was excited because I wanted proof that he existed. Reporter: As slender man's grip on these girls begins to reveal itself, back at the hospital, Payton leutner is unable to talk, at first, writing to communicate. One of her first questions is this -- Did they get them? We told her they were -- they were found and the police have them. Reporter: And as a dad, in that moment, how hard was that? Harder than I would have ever been able to imagine. This is my little girl who's laying there, and the only thing that I could tell her, at the time, to make her feel better was that, the police have them, and she was safe with us.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "12-year-old survives being stabbed 19 times by her friends: Part 2",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/2020/video/12-year-survives-stabbed-19-times-friends-part-52809848"
}