{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 05:50:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Australian deputy prime minister under citizenship cloud",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Faustralian-deputy-prime-minister-citizenship-cloud-49198964.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_ef31471d97ca41768194e4b697d990ec_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Australia's deputy prime minister on Monday became the latest lawmaker to reveal he might have breached a constitutional prohibition on dual citizens becoming lawmakers, after the New Zealand government declared he was a kiwi.\nBarnaby Joyce told Parliament he would become the fifth lawmaker to be referred to the High Court since last month for scrutiny over whether he was entitled to remain in Parliament.\nJoyce, who leads the conservative Nationals minor coalition party, said he had legal advice that he would be cleared by the court and would not stand down from Cabinet.\nThe 116-year-old section of the constitution that bans dual nationals is taking an extraordinary toll on the finely balanced Parliament elected in July last year. Before the careers of five came under a cloud since July, only two elected lawmakers were caught. Both were elected in the late 1990s and were quickly disqualified by the High Court, the first over New Zealand citizenship and the second for being British.\nCritics of the constitutional rule argue it no longer suits the modern multicultural Australia in which almost half the population was born overseas or has at least one overseas-born parent.\nIf Joyce was disqualified, Prime Minister Malcolm Turnbull's center-right government could lose its single-seat majority in the House of Representatives where parties need a majority to govern. The other four lawmakers are senators who if disqualified would be replaced by members of their own parties.\nJoyce said he was notified by the New Zealand High Commission on Thursday that the New Zealand government had discovered \"I may be a citizen by descent of New Zealand.\"\n\"Needless to say, I was shocked to receive this information,\" said Joyce, whose father migrated from New Zealand in 1947. Joyce was born in Australia in 1967.\nNew Zealand Prime Minister Bill English said he was told last week that Joyce was a New Zealand citizen.\n\"Unwittingly or not, he's (Joyce) a New Zealand citizen and then it's a matter for the Australian system to decide how Australian law applies in his case and how they deal with the issue,\" English said.\nThe Australian opposition demanded that the government refuse to accept Joyce's vote in Parliament and dump him from Cabinet until the court resolved his status. But Turnbull said he was confident that Joyce was eligible to sit in Parliament.\n\"We did not refer this matter to the court because of any doubt about the Member for New England's (Joyce's) position, but because of the need, plainly in the public interest, to give the court the opportunity to clarify the operation of the section (of the constitution) so important to the operation of our Parliament,\" Turnbull told Parliament.\nThe citizenship crisis first took hold in Parliament when two minor Greens party senators, Scott Ludlam and Larissa Waters, quit days apart after discovering they were still citizens of their birth countries. Ludlam was born in New Zealand and Waters was born in Canada. Both left as children and made no efforts to secure citizenship other than Australian.\nTurnbull accused the Greens of \"incredible sloppiness\" in vetting candidates, before senior government minister Matt Canavan announced that he had discovered he was Italian.\nAustralia-born Canavan, who said his mother applied for his Italian citizenship without his permission when he was aged 25, stood down as resources minister, but said he was staying in the Senate unless the court declares them ineligible.\nJoyce temporarily shouldered Canavan's portfolio and became a vocal supporter of his Nationals colleague.\nNew Zealand Minister of Internal Affairs Peter Dunne said that under the 1948 New Zealand Citizenship Act, every person born outside of New Zealand to a parent who was a New Zealand citizen by birth was automatically a New Zealand citizen.\n\"The problem is not with the New Zealand citizenship laws but rather with the Australian constitution,\" Dunne said.\nLast week, anti-immigration, anti-Muslim party One Nation Sen. Malcolm Roberts was referred to the High Court after he revealed that he only received written confirmation that he was not a British citizen five months after he was elected in July last year.\n————\nAssociated Press writer Nick Perry, in Wellington, New Zealand, contributed to this report",
    "source_domain": "abcnews.go.com",
    "title": "Australian deputy prime minister under citizenship cloud",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/australian-deputy-prime-minister-citizenship-cloud-49198964"
}