{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 18:13:04+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Terry Moran reports on the devastation caused by a suicide bombing that killed more than 120 people near a convoy of buses with aid workers and children set to leave war-torn Syria.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fsuicide-bomb-syria-leaves-120-dead-46838991.json",
    "image_url": "http://a.abcnews.com/images/GMA/170417_gma_moran1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Suicide bomb in Syria leaves more than 120 dead\nThe crisis if Syria. A devastating suicide bombing has killed more than 100 people, including dozens of children. T Terry Moran tracking the story. Reporter: This might, might be a faint, faint dplimer of hope in the war in Syria. The Kremlin announcing that diplomats from Russia, the United States, and the united nations will meet next week to discuss the Syrian crisis. This comes as good news after the showdown over the missile strikes if Syria ten days ago. The defeat of ISIS in Syria is within sight. The U.S. Is trying to get Russia to plan for Syria's future without bashar Al Assad. This bombing targeted the group of buses part of a population swap, part of an agreement that had been made. Reporter: It's just appalling, George. This morning, still no claims of responsibility for the bombing. Pope Francis condemning this attack. On Saturday, part of deal to evacuate besieged civilians, a convoy of buses left two government-controlled towns. A vehicle loaded with food stopped. Children swarmed around. Another vehicle packed with explosives rammed the convoy. More than 120 people killed. Including 68 children. The war goes on. The con voice have resumed. Now Washington, D.C., and president trump is back in the\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Suicide bomb in Syria leaves more than 120 dead",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/suicide-bomb-syria-leaves-120-dead-46838991"
}