{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 09:09:40+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": "Kristi Weier says her daughter Anissa never talked to her about Slender Man, a fictional character on the internet.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2F2020%2Fvideo%2Fslender-man-figure-motivated-girls-stab-friend-part-52809896.json",
    "image_url": "http://a.abcnews.com/images/2020/180202_2020_act4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for What is Slender Man, the figure that motivated two girls to stab their friend: Part 4\nReporter: For more than three years now, those two girls who confessed to brutally stabbing their 12-year-old friend have been locked up. Their mothers still hope their daughters will one day come home. Kristi Weier's daughter Anissa sits behind these walls at the Washington county juvenile jail. And Kristi shows us how her daughter spends much of her time drawing. She is drawing flowers and sunshine and hearts. Reporter: She tells us she had no idea her daughter had fallen so completely under slender man's spell. They did it to impress slender man. Who is the shadowy figure? Bill and I -- although we were divorced, we were still very active parents. I did search her iPad. I did watch over her shoulder. Anissa never talked about slender man to me. Reporter: And Morgan was convinced slender man was real too. Who is this creepy guy that you were talking' about? Slender man. Do you see him in your dreams? Did you know anything about Morgan's fascination with slender man? We did. You talked about it with her? We did. And she would show us some of the pictures and she would read us some of the stories. Did you ever think that this is a little too dark for my daughter? When I was Morgan's age, I was reading Stephen king novels, so I just thought it was Normal for a child of middle school age to be interested in scary stories. Reporter: And it turns out that Payton who crawled out of those woods alive, had even told her mom that Morgan thought sler slender man was real. Did it give you pause? A little bit, but at the same time, these girls are 12 years old, and fantasy when you are 12 years old is still a very active part of your life. Reporter: But their fantasy would give way to reality, and Morgan is Anissa face charges of third degree intentional homicide. It wasn't until the following day, that we knew that she would be charged as an adult. When a child ten or older, commits a crime like this Wisconsin law requires them to be charged in adult court. Anthony cotton is Morgan's attorney. Was it clear to you she was struggling with mental illness? Yeah. It was apparent right out of the gate. She'd be looking around the room. She'd looking in the corner. She seemed to be responding to things that weren't in the room. Reporter: The girls are formally charged as adults, each facing the possibility of up to 65 years in prison. Seeing her in the courtroom in the jumpsuit with the shackles really hit hard. Reporter: But Morgan's and Anissa's families launch a legal fight to get their daughters' cases moved from adult court to juvenile court. Children's court is the right place for this case. Reporter: It would mean more resources to treat their mental health but it also meant that each girl could be freed as soon as their 18th birthdays. Something prosecutors would immediately fight. In spite of the fact that they were 12, these were two girls that made an extreme, serious effort to try to kill Payton. Reporter: After the brutal attack, search investigators searching Morgan's room would find disturbing evidence of a deteriorating young mind. Dismembered barbies, drawings of slender man with children and pages, and pages of messages that she had written to herself. We pour through those drawings with Morgan's mother and find one of the darkest messages. How typical is it for a 12-year-old to write, I want to die? I don't think it's very typical at all. Reporter: Morgan also writes, help me escape my mind. This one makes me sad. Why? Just knowing how long she was sick and suffering inside her own head before we had any idea. Reporter: While prosecutors build their case, two mothers visit their daughters behind bars weekly. Sometimes daily. It's just her and I, divided by glass talking -- there are moments where my heart is so full of sadness that I don't even know what to say when I get in there. And that's when I put on a mask I don't allow myself to break down in front of her and see how much this is hurting me. Reporter: And Morgan's mother tells me about the barrier between her and her daughter. And you would see her through the glass? Yes. I mean, it was painful. We went months without being able to touch her. Reporter: Both families now say their daughters are trapped between adult and juvenile courts and on this day, we are at Anissa's home when she calls to wish her sister a happy birthday. Her father, bill, wearing a Superman t-shirt. She still reveres her father to is day. Hello? Hello. Howry Doi are you doing? Pretty good. Reporter: Then a song for her sister. ??? Happy birthday to you ??? Reporter: But as they sit behind bars they are also cut off from the resources typically availablreat child commit crimes at such a young age. There's social workers, there's treatment professionals, as opposed to the adult system which is designed to be punitive. Reporter: And while they are not treated for mental illness, they are given a court ordered mental health evaluation and Morgan who held the knife who drew those pictures discovered in her bedroom. And who was unmoved by the movie \"Bambi\" all those years ago, she would now receive an extraordinarily rare diagnosis for someone so young. Early onset schizophrenia. Were you surprised? No. Um, I wasn't surprised simply because there is a family history of schizophrenia. Her father? Yes, her father has schizophrenia. Reporter: In fact, Morgan's father had been hospitalized at least four times as a teenager himself. Was that one of the first things you thought of after the stabbings? It was. That she must be sick. Reporter: But if Morgan's father had a history of schizophrenia, we asked, did her parents look foing signs along the way? Think it was something that had been building, that we um both didn't notice and also attributed to the changes she was going through as an adolescent. Do you feel responsible? I think on some level, I'll always feel responsible for not knowing that my daughter wasn't well. Reporter: Her daughter, Morgan, would stay in that jail for a year and a half-untreated for mental illness. Until a judge gets her moved to a mental health institution where she receives medication. And did you see a change? When she started medication? Oh, yes. We saw a dramatic change. All rise! Reporter: And after more than a year of hearings and evaluations, judge Michael Bohren makes his decision. On whether the children should remain charged as adults. It was premeditated attempt to kill someone. On that basis, and I'll order that the defendants Ms. Geyser and Ms. Weier be retained in the adult jurisdiction. They were just children. They weren't chronic offenders. Reporter: When we come back\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "What is Slender Man, the figure that motivated two girls to stab their friend: Part 4",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/2020/video/slender-man-figure-motivated-girls-stab-friend-part-52809896"
}