{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 17:23:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Ffather-uk-doctors-surprised-sick-child-alive-54683948.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_a37175413d504dbf93a05bccca1d714b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A British judge is set to hear a new appeal Tuesday from the parents of a terminally ill British toddler who want to take him to Italy for treatment — something British courts have ruled is not in the child's interest.\nThe Christian Legal Centre, which is supporting the parents of 23-month-old Alfie Evans, said lawyers would repeat a request to judge Anthony Hayden to allow the boy to be cared for at the Vatican's hospital in Rome.\nAlfie is in a \"semi-vegetative state\" as a result of a degenerative neurological condition doctors have been unable to identify. Doctors treating him at Britain's Alder Hey Children's Hospital say further treatment is futile.\nBut his parents have refused to accept the decision and fought to prevent Alfie's life support being switched off.\nHe was taken off life support Monday after a series of court rulings backed doctors.\nAlfie's father Tom Evans said earlier Tuesday that Alfie survived for six hours with no assistance, and that doctors had subsequently resumed providing oxygen and hydration.\n\"He's now on oxygen,\" Evans said. \"It's not changing his breathing but it's oxygenating his body.\"\nEvans, 21, and Alfie's mother Kate James, 20, want to take Alfie to the Vatican's Bambino Gesu Pediatric Hospital. Doctors at Liverpool's Alder Hey Hospital believe that would not be in the toddler's best interests, and British courts have agreed.\nThe case has drawn the attention of Pope Francis, who during a Sunday blessing in St. Peter's Square this month offered prayers for Alfie and others who are suffering from serious infirmities. Francis has made appeals for the boy to be kept alive, saying only God can decide who dies.\nThe head of the Vatican's Bambino Gesu Pediatric Hospital said the Italian defense ministry had a plane ready to transport Alfie to Italy if he were allowed. In an interview with Italian Radio 24, Mariella Enoc, who travelled to Liverpool to personally try to intervene on behalf of the parents, said she spoke to the Italian ambassador in London who said the plane could leave with him in a matter of minutes.\nOn Monday, the Italian foreign ministry announced it had granted Alfie Italian citizenship to facilitate his arrival and transport.\nThe hospital said it would not be offering a running commentary on the child's condition.\n\"This is our normal and agreed practice with all our patients,\" the hospital said in a statement.\n———\nAssociated Press Writer Nicole Winfield contributed to this story from Rome.\n————\nCorrects that first name of father is Tom not James.",
    "source_domain": "abcnews.go.com",
    "title": "UK judge to hold new hearing over sick toddler Alfie Evans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/father-uk-doctors-surprised-sick-child-alive-54683948"
}