{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 04:22:13+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Japan's SoftBank to buy Fortress Investment for $3.3 billion",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fjapans-softbank-buy-fortress-investment-33-billion-45500319.json",
    "image_url": "http://abcnews.go.com/International/wireStory/japans-softbank-buy-fortress-investment-33-billion-45500319",
    "language": "en",
    "localpath": null,
    "maintext": "Japanese telecommunications, internet and solar company SoftBank Group Corp. is buying U.S. investment company Fortress Investment Group for $3.3 billion.\nThe deal was announced by both sides Wednesday. New York-based Fortress, which manages global investments, said its senior professionals will stay to keep up its fund performance.\nTokyo-based SoftBank has been aggressive in global acquisitions. Chief Executive Masayoshi Son was recently seen with President Donald Trump, who praised his promise to invest $50 billion in U.S. startups to create 50,000 jobs.\n\"Fortress' excellent track record speaks for itself, and we look forward to benefiting from its leadership, broad-based expertise and world-class investment platform,\" Son said in a statement.\nHe said the acquisition will immediately contribute to his strategy for growth.\nSoftBank owns the U.S. wireless company Sprint Corp. and Britain's ARM Holdings. ARM is known as an innovator in the \"internet of things,\" and in technology used in smartphones.\nIt has set up a $25 billion private fund for technology investments that it says may grow to $100 billion.\nFortress co-chairmen Pete Briger and Wes Edens praised Son as \"visionary,\" noting the companies had much in common, and said the deal will benefit shareholders.\n\"We join a company with tremendous scale and resources, and a culture completely aligned with our focus on performance, service and innovation,\" they said in a joint statement.\nSoftBank, the first carrier to offer the iPhone in Japan, also sells the Pepper human-shaped companion robot. The company, founded in 1981, has within its investment empire financial technology and ride-booking services.\n———\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\nHer work can be found at http://bigstory.ap.org/content/yuri-kageyama",
    "source_domain": "abcnews.go.com",
    "title": "Japan's SoftBank to buy Fortress Investment for $3.3 billion",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/japans-softbank-buy-fortress-investment-33-billion-45500319"
}