{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 02:52:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Missing German couple found dead in Australian Outback",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fmissing-german-couple-found-dead-australian-outback-45499325.json",
    "image_url": "http://abcnews.go.com/International/wireStory/missing-german-couple-found-dead-australian-outback-45499325",
    "language": "en",
    "localpath": null,
    "maintext": "A German couple who disappeared in the Australian Outback were unprepared for the harsh environment and likely died before anyone noticed they were missing, police said on Wednesday.\nNorthern Territory police launched a search for Gisela and Wilfred Thor on Sunday after a ranger found the couple's car at Trephina Gorge, a nature park northeast of the Outback town of Alice Springs. The couple, who arrived in Australia in early February, had set off for the gorge two days earlier.\nPolice discovered the body of 76-year-old Wilfred on Monday and his 73-year-old wife the next day.\nPolice Duty Superintendent Rob Burgoyne told the Australian Broadcasting Corp. on Wednesday that the condition of the bodies indicated the couple probably died their first day at the gorge.\nSgt. Philip Emmett said he retrieved a camera from Wilfred's body that contained a photo of his smiling wife at the gorge. In the photo, Gisela appeared to be in \"good spirits\" and had a bottle of water, but was not wearing a hat, Emmett said.\nPolice said the couple strayed from the park's walking track and were unprepared for the rugged environment and searing heat, with temperatures hovering around 40 degrees Celsius (104 degrees Fahrenheit) over the weekend.\nEmmett said he believes the couple became disoriented early in their trek and began wandering around in a bid to find their way out of the gorge. For some reason, he said, they then parted ways. Their bodies were found several kilometers (miles) apart.\nTheir cause of death was not immediately known, but Emmett said there were no suspicious circumstances.",
    "source_domain": "abcnews.go.com",
    "title": "Missing German couple found dead in Australian Outback",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/missing-german-couple-found-dead-australian-outback-45499325"
}