{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 15:40:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Snow wreaks havoc on travelers in Britain, schools closed",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fsnow-wreaks-havoc-travelers-britain-schools-closed-51717925.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_69ac372a0a7d4915a5ce73b850d393e8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Snow and wintry weather are still wreaking havoc on travelers in Britain, with flights cancelled, roads sheathed in ice and rail travel disrupted Monday.\nWith temperatures predicted to drop overnight to as low as minus 12 Celsius (11 degrees Fahrenheit), transport officials worked on cleanup. Hundreds of schools were closed and airports struggled under the weight of flight delays.\n\"The worst of the snowfall is behind us,\" said Grahame Madge of the Met Office. \"It's now more about dealing with the weather we've had.\"\nEurope's largest airport, Heathrow, warned that hundreds of flights would be cancelled as it cleared the backlog of flights delayed by Sunday's snowfall.\nIn the world of interconnected air travel, any extended disruption quickly leaves planes and flight crews out of position, knocking them out of the rotation for their next assignments. Airlines are also responsible for de-icing their aircraft, and some have more capacity than others to do so.\n\"The airport remains open and is operating three-quarters of scheduled flights,\" Heathrow said in statement. \"Before coming to the airport, passengers must check their flight status with their airline.\"\nNational Rail said poor weather conditions are affecting travel across England and Wales. Trains on Chiltern Railways, CrossCountry, Great Western, and Virgin Trains are also being affected by delays.",
    "source_domain": "abcnews.go.com",
    "title": "Snow wreaks havoc on travelers in Britain, schools closed",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/snow-wreaks-havoc-travelers-britain-schools-closed-51717925"
}