{
    "authors": [
        "Abc News",
        "More Michael"
    ],
    "date_download": "2017-08-14 18:15:58+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "From war hero to white coat: A wounded veteran's journey to Harvard Medical School",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fwar-hero-white-coat-wounded-veterans-journey-harvard%2Fstory%3Fid%3D49163094.json",
    "image_url": "http://a.abcnews.com/images/US/veteran-doctor-greg-galeazzi2-abc-ps-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Seven years before Greg Galeazzi put on a white coat at Harvard Medical School, he wore Army fatigues while serving a year-long deployment in Afghanistan.\nIn May 2011 a roadside bomb tore off Captain Galeazzi’s legs and much of his right arm, just a month before he was expecting to return home.\n“It felt like I was an empty coke can on train tracks getting hit by a freight train moving at 100 miles per hour,” said Galeazzi.\nWithout a medic on the ground, there was no available pain medication.\n“All I could do was scream,” Galeazzi recalled. “It’s hard to put into words that sickening, nauseating feeling to see that my legs were just gone.”\nDue to his unit’s remote position in northern Afghanistan, Galeazzi had little hope of receiving timely medical support.\n“I put my head back and just thought, 'I’m dead,'” he said.\nHe passed out. Upon waking just minutes later, he discovered that his soldiers had successfully applied tourniquets to both his legs and right arm, which had been nearly severed at the shoulder. A half hour later a Medivac helicopter arrived to take him to the trauma bay.\n“What I found out then was that the real nightmare was really just beginning,” said Galeazzi.\nMichael Koenigs/ABC News\nHe endured over 50 surgeries, hundreds of hours of physical therapy, and numerous months as a hospital in-patient.\nBut the traumatic experience and new limitations did not diminish Galeazzi’s dream of becoming a doctor.\n“Not only did I still want to practice medicine, but it strengthened my resolve to do it,” explained Galeazzi.\nOver the next few years, Galeazzi took more than 18 pre-medical courses and achieved his desired score on the MCAT entrance.\nGaleazzi was accepted into Harvard Medical School this past year and is the only student who uses a wheelchair in his class of 165 students. He has not yet decided what type of medicine he’ll eventually practice, but is leaning toward a primary care field.\n“You’re that first line of defense. You need to know a little bit about everything. I like the idea of being a jack of all trades,” he said.\nGaleazzi also looks forward to marrying his fiance Jazmine Romero next year.\n“Even though I’ve gone through this journey, it’s not lost on me how unbelievable this ride has been,” said Galeazzi.",
    "source_domain": "abcnews.go.com",
    "title": "From war hero to white coat: A wounded veteran's journey to Harvard Medical School",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/war-hero-white-coat-wounded-veterans-journey-harvard/story?id=49163094"
}