{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:29:56+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "ABC News' Jon Karl discusses what's at stake for Democrats, who hope to fill the seat that came open when GOP Rep. Tom Price joined President Trump's cabinet.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fhigh-stakes-congressional-election-georgia-46857357.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_karl3_0712_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for High stakes for congressional election in Georgia\nJon Karl for more. All kinds of question, John, about the merging of the president's business, family's businesses with government action and saw Cecilia's report right there. It's also being raised in the whole debate over tax reform. You talked to the white house yesterday about that. Democrats saying that they're going to have to see how any tax reform will affect trump's bottom line. Reporter: Yeah, Democrat, keep in mind he needs Democrats to pass tax reform. This needs to be a bipartisan approach if it's going to have any chance of passing in congress and, George, what Democrats are saying is they want to see Donald Trump's tax returns before they agree to anything on tax reform because they want to know how the tax changes would affect trump and the trump organization. Meanwhile, you were in the white house briefing room sudden with Sean spicer. He made it about as clear as they have in the past although he was a little circumspect that he won't release the tax returns. Reporter: I asked him point blank can we now just acknowledge the president is never ever going to release his tax returns and Sean instead of kind of pushing back on that says I'll just have to get back to you on this. They're no longer saying he will certainly release them if whatever audit he may or may not be under is complete. They're saying, look, maybe he just won't ever release those tax returns. The president weighing in on the election down in Georgia. He did this Robo call overnight. Let's listen. Hello, this is president Donald Trump, liberal Democrats from outside of Georgia are spending millions and millions of dollars trying to make your Republican congressional seat away from you. Don't let them do it. Jon, he's up and tweeting early this morning. Reporter: A fascinating race and saying if we simply get to a runoff and if the Democrat gets less than 50% this will be a victory. This is a fascinating district because it has been Republican for years. This was newt Gingrich's district but Donald Trump only won it by one percentage point last year. We will watch today. Jon Karl, thanks very much.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "High stakes for congressional election in Georgia",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/high-stakes-congressional-election-georgia-46857357"
}