{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 08:32:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Bangladesh PM says government will continue to help Rohingya",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fbangladesh-pm-government-continue-rohingya-50339433.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_b1cce0f71a54424d9d55e6ff7748dd98_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bangladesh's Prime Minister Sheikh Hasina on Saturday said her government would continue to support nearly 1 million Rohingya Muslims who have fled neighboring Myanmar to escape violence.\nHasina said the government was pursuing a plan to build temporary shelters for the Rohingya on an island with the help of international aid agencies whom she praised for their support.\nShe made the statement at Dhaka airport on her return from New York after attending the U.N. General Assembly session. The U.N. has described the violence in Myanmar as \"ethnic cleansing.\"\nHasina accused Myanmar of creating tensions at the border, but said she has asked the country's security forces to deal with the crisis \"very carefully.\"\n\"They pretended like they wanted a war,\" she said.\nMore than 500,000 Rohingya Muslims have crossed over to Bangladesh since late August, when Myanmar security forces responded to militant attacks with a broad crackdown that witnesses and rights groups say has included killing and arson. An equal number of Rohingya Muslims have previously fled Myanmar since 1978.\nMyanmar doesn't recognize the Rohingya as an ethnic group, instead insisting they are Bengali migrants from Bangladesh living illegally in the country. Myanmar has come under international criticism for failing to stop the recent violence in its Rakhine state and in turn an exodus that has become the largest refugee crisis to hit Asia in decades.\nThe Myanmar government's information committee said in a statement late Thursday that it had stopped 17,000 Rohingya from fleeing in just four days last week. Still villagers say Rohingya are still attempting to leave and many are gathered on the beaches just across the water from Bangladesh waiting for a chance to leave the country.\nOn Saturday, Hasina reiterated that the settlements for Rohingya Muslims would be temporary until they returned to their homes in Myanmar.\nHer government would continue to support them with food and shelter.\n\"If needed, we will eat a full meal once a day and share the rest with them,\" she said.",
    "source_domain": "abcnews.go.com",
    "title": "Bangladesh PM says government will continue to help Rohingya",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/bangladesh-pm-government-continue-rohingya-50339433"
}