{
    "authors": [
        "Abc News",
        "More Julia"
    ],
    "date_download": "2018-05-31 01:59:58+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The woman was seen repeatedly yelling expletives at the officers, attempting to spit on one.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fbodycam-footage-shows-moments-officer-repeatedly-punched-woman%2Fstory%3Fid%3D55544040.json",
    "image_url": "https://s.abcnews.com/images/US/wildwood-police-beach-02-ht-jc-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A New Jersey police department has released body camera footage that shows the events leading up to an officer repeatedly punching a 20-year-old woman on a Jersey Shore beach over Memorial Day weekend.\nThe Wildwood Police Department released the footage from the camera worn by the officer \"directly involved,\" explaining that it is in three separate videos because the camera had been \"turned on and off\" during the encounter, according to a press release.\nThe first video begins as the officer hands the woman -- previously identified as Philadelphia resident Emily Weinman -- a breathalyzer.\n\"Do me a favor,\" he says, holding up the yellow tool that somewhat resembles a flashlight. \"Take a deep breath, and blow into that, alright?\"\nAfter the officer instructs her to \"do it one more time,\" Weinman says to someone off camera, \"Mind your business.\"\nThe officer then asks Weinman how old she is, and she responds, \"I know that didn't come up positive. I didn't take a drink of anything.\"\nWildwood Police\nWeinman then walks toward the ocean with her phone as the officer asks someone else off camera to take the breathalyzer test.\n\"Go grab her real quick,\" he tells another officer before referring to the alcoholic drinks Weinman was apparently in possession of. \"We're gonna have them pour that all out.\"\nThe officer then turned his body camera off because he wasn't going to issue any violations, police said.\nAs the officer turned his body camera back on and the second video begins, Weinman asks him, \"How are you gonna 'let us go'? We didn't even drink alcohol.\"\nWeinman then argues that \"you're allowed to carry alcohol. Even if you're underage, you are.\"\n\"That's interesting,\" the officer replies, before telling her that the alcohol is opened and displayed.\nThe audio then cuts for several seconds. As it comes back on, Weinman is heard telling the officer, \"I didn't disrespect you. I didn't do anything to get written up, did I?'\n\"Now you're causing a scene,\" the officer tells her, before saying he will give her \"one more chance\" to provide her last name.\n\"Just be cooperative,\" someone else is heard telling her off camera.\nWeinman then crosses her arms and says, \"You can't lock me up. I didn't disrespect you. And you don't need to write my name down, either, 'cause I didn't disrespect you. I didn't do anything to you. You're mad because you thought we were drinking.\"\nThe officer then asks Weinman for her last name again, and she responds, \"You don't need my last name,\" before sitting back down on the sand.\nWildwood Police\nThe officer then asks another officer if he has \"cuffs\" on him, prompting Weinman to yell \"No!\" and get up and walk away.\nWhen the officer walks toward her, she turns around and yells, \"Don't f------ touch me\" multiple times.\n\"Alright, you're about to get dropped,\" the officer tells her.\nThe camera then shut off after Weinman allegedly \"forcibly struck\" the officer in the torso, police said.\nThe third video of body camera footage begins as the officer wrestles Weinman to the ground.\n\"No, let go of me,\" she screams.\nDuring the ordeal, Weinman continues yelling expletives and complains that the officer is pulling her hair and choking her. She also screams for someone named Matt, who is apparently her boyfriend.\n\"I'm not choking you,\" the officer says.\n\"Yes you f------ are, you f------ d---head,\" she yells.\nAfter Weinman tells the officer to \"get the f--- off\" her one more time, he responds, \"That's it,\" before he’s seen hitting her.\nWildwood Police\nA male voice off camera is heard saying, \"Whoa, whoa, whoa,\" and the officer tells nearby bystanders to \"Back the f--- up.\"\nWeinman, who is screaming and crying throughout, tells the officer, \"You're not allowed to hit me and choke me like that.\"\nAs the officer places the handcuffs on Weinman, who is still struggling against him, she tells him, \"My daughter is right there seeing this. I didn't do anything wrong.\"\nAt one point, Weinman is seen in the video attempting to spit on the officers, calling one a \"f------ dirtball,\" immediately after.\nThe rest of the video shows Weinman as she is led to more officers waiting to transfer her to jail. She continues to yell expletives at the officers, saying \"Get the f--- off me, you white piece of trash,\" and telling nearby bystanders, \"Don't stare unless you're gonna f------ help.\"\nA man holding a young child then identifies himself as Weinman's boyfriend and tries to defend her, saying, \"She didn't even open a can.\" Weinman then tells the officers that the child is her daughter.\nWildwood Police\nAfter Weinman is placed in the squad car, the officer tells another officer who didn't witness the incident what happened, admitting that he hit her \"a couple of times\" and that Weinman tried to kick them. The video ends as the officers walk back to an ATV that was left on the beach.\nA beachgoer named Alexis Hewitt was sleeping on a towel next to Weinman on Saturday when she heard the commotion, woke up and began recording, she told ABC News.\nAs the cellphone video begins, witnesses can be heard telling Weinman to stop resisting before the officer appears to punch her three times in the head as another officer appears to pin her legs down. The 54-second cellphone video ends as Weinman is being cuffed.\nThe video has been viewed more than 6.6 million times since it was posted on Twitter Saturday evening.\nI was sleeping on the beach and I woke up to this.. i can’t believe it.. pic.twitter.com/UJE5Sy7E4G — Lexy (@HewittLexy) May 26, 2018\nAfter the cellphone video gained traction online, Wildwood Police Chief Robert Regalbuto stated that he found it to be alarming, but warned the public against rushing to any judgment until the body camera video was released in its entirety.\n\"I clearly think it's something we need to work on, but, again, you have to see the entire video,\" he said on Monday.\nThe body camera footage was not immediately released because the department needed to redact the faces of beachgoers not involved in the encounter, the release states.\nThe officers involved in the incident were placed on administrative duty, Regalbuto confirmed to ABC News.\nAfter the body camera footage was released, the Wildwood Police Department released the identities of three officers: Thomas Cannon, John Hillman and Robert Jordan.\nIt is unclear which officer did the punching. All three are part-time officers for the summer, police said. The New Jersey State Policemen's Benevolent Association did not immediately respond to ABC News' request for comment.\nWeinman faces charges of aggravated assault on a police officer, aggravated assault by spitting bodily fluids at/on a police officer, disorderly conduct, resisting arrest, obstruction and possession of alcohol by a minor.\nABC News could not immediately reach Weinman's attorney, Stephen Dicht, for comment. After Wildwood Mayor Ernie Troiano defended the officers' actions and described Weinman as \"by far the aggressor,\" Dicht told The Philadelphia Inquirer that the mayor's comments were \"irresponsible.\"\n\"The number of people who think she got what she deserved is appalling,” Dicht told the newspaper on Tuesday.\nIn a now-deleted Facebook post, Weinman wrote that she had asked the officers if they had \"something better to do.\" The officer then replied, \"I was gonna let you go but now I'll write you up,\" Weinman wrote in the post.\nThe Cape May Prosecutor's Office and the Wildwood Police Department will release the findings and outcome of the investigation when it is complete, police said.\nIt is against the law to drink alcohol on the beach on the Jersey Shore.\nABC News' M.L. Nestel contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Bodycam footage shows moments before an officer repeatedly punched a woman",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/bodycam-footage-shows-moments-officer-repeatedly-punched-woman/story?id=55544040"
}