{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 12:43:37+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "President Trump was widely criticized for not explicitly condemning white supremacy in his remarks about the Charlottesville protests that left three people dead.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Ftrump-faces-backlash-remarks-charlottesville-attack-49201716.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_vega1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump faces backlash for remarks on Charlottesville attack\nhate and eventually murder. Thank you. Many closely watching the white house's response to the charlottesville violence, president trump facing criticism from members of his own party for condemning hatred and violence on, quote, many sides without mentioning white nationalists and then putting out a statement on Sunday specifically condemning white supremacists for the attack. The white house last night, hundreds gathered to show solidarity with the charlottesville victims. Let's go to our senior white house correspondent Cecilia Vega for more on all this. Good morning, Cecilia. Reporter: Robin, good morning. This is a president who is often quick to call out people and groups by name. But not in the wake of what happened in charlottesville. This morning, president trump under fire for not going far enough. We condemn in the strongest possible terms this egregious display of hatred, bigotry and violence on many sides, on many sides. Reporter: His comments following the violence in charlottesville drawing backlash from even allies in his own party. I think clearly he should talk out much more aggressively about it. Reporter: Under pressure the white house forced to try to clarify. An administration official insisting on anonymity releasing this statement saying the president condemns all forms of violence, bigotry and hatred and, of course, that includes white supremacists, kkk, neo-nazi and all extremist groups. The vice president echoing that. We have no tolerance for hate and violence from white supremacists, neo-nazis or the kkk. Reporter: But the president not saying those words himself. Mr. President, do you want the support of these white nationalist groups who say they support you, Mr. President? Reporter: At his bedminster golf club, no comment. Have you denounced them strongly enough? I certainly think any time that you commit an attack against people to incite fear it is terrorism. Reporter: And his short-lived communications director Anthony scaramucci ousted after just 11 days on the job adding to the sgleet I wouldn't have recommended that statement. I think he needed to be much harsher as it related to the white supremacists and the nature of that. Reporter: Now the president had promised a big press conference today where you can bet this question of would he and should he be going farther on this issue of neo-nazis would be question number one but, robin, there is no press conference on his public schedule for today. Unclear whether there will be one. Thank you. David. Robin, thank you.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump faces backlash for remarks on Charlottesville attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/trump-faces-backlash-remarks-charlottesville-attack-49201716"
}