{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 07:15:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Fifth Harmony wins big at Teen Choice Awards; Bruno Mars unveils new video",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Fharmony-wins-big-teen-choice-awards-bruno-mars%2Fstory%3Fid%3D49200500.json",
    "image_url": "http://abcnews.go.com/Entertainment/harmony-wins-big-teen-choice-awards-bruno-mars/story?id=49200500",
    "language": "en",
    "localpath": null,
    "maintext": "It was a big night Sunday for Fifth Harmony at the 2017 Teen Choice awards. The group took home surfboards in the categories of Choice music group and Choice summer group. Their latest single, \"Down\" with Gucci Mane, was awarded Choice song: Group; and their fans, the Harmonizers, were honored as choice fandom.\nSpeaking to the crowd at the University of Southern California's Galen Center, group member Lauren Jauregui evoked the violent clashes with white supremacists in Charlottesville, North Carolina that left three dead over the weekend. \"In light of recent events we just wanted to say to all of the young ones at home watching: no matter who you are, where you come from or what you look like, you are beautiful and you are important, so keep spreading love and positivity, all right?\" she said.\nBruno Mars received the visionary award. Mars, who is on tour, sent a video acceptance message, but used the occasion to announce the release of a new video for his song \"Versace on the Floor,\" featuring Zendaya. The video was immediately made available on Bruno's YouTube channel.\nMembers of Maroon 5 were on hand to accept the Decade Award. Adam Levine joked about receiving a Teen Choice Award despite being 38, though he noted that he and guitarist James Valentine looked pretty good for 38. He also teased the crowd announcing, \"Our sixth and final album is coming out in November,\" adding, \"I'm just kidding, just kidding. Man, I'm joking. We are never gonna go away.\"\nNon-musical award winner, Zendaya, also got political during her acceptance speech for Choice summer movie actress for her performance in Spider-Man: Homecoming. \"With all the injustice and the hatred and everything that's happening not only in the world, but in our country, right now I need for you young people to be educated, I need you to listen, I need you to pay attention,\" Zendaya said. \"You're the future presidents. The future senators. And you guys are the ones who are going to make this world better, so I'm just letting you know, right now, that you are the future, OK?\"\nLouis Tomlinson delivered the evening's final performance, delivering a smooth rendition of his single \"Back to You\" with Bebe Rexha.\nHere are the Teen Choice 2017 winners in the music categories:\nChoice Male Artist (#ChoiceMaleArtist) Harry Styles\nChoice Female Artist (#ChoiceFemaleArtist) Ariana Grande\nChoice Music Group (#ChoiceMusicGroup) Fifth Harmony\nChoice Country Artist (#ChoiceCountryArtist) Carrie Underwood\nChoice Electronic/Dance Artist (#ChoiceElectronicDanceArtist) Calvin Harris\nChoice Latin Artist (#ChoiceLatinArtist) CNCO\nChoice R&B/Hip-Hop Artist (#ChoiceRBHipHopArtist) Beyoncé\nChoice Rock Artist (#ChoiceRockArtist) Harry Styles\nChoice Song: Female Artist (#ChoiceSongFemaleArtist) Camila Cabello – “Crying in the Club”\nChoice Song: Male Artist (#ChoiceSongMaleArtist) Niall Horan – “Slow Hands”\nChoice Song: Group (#ChoiceSongGroup) Fifth Harmony (feat. Gucci Mane) – “Down”\nChoice Collaboration (#ChoiceCollaboration) Steve Aoki & Louis Tomlinson – “Just Hold On”\nChoice Summer Song (#ChoiceSummerSong) “Despacito” – Luis Fonsi & Daddy Yankee (feat. Justin Bieber)\nChoice Summer Female Artist (#ChoiceSummerFemaleArtist) Camila Cabello\nChoice Summer Male Artist (#ChoiceSummerMaleArtist) Shawn Mendes\nChoice Summer Group (#ChoiceSummerGroup) Fifth Harmony\nChoice Summer Tour (#ChoiceSummerTour) Ariana Grande – Dangerous Woman Tour",
    "source_domain": "abcnews.go.com",
    "title": "Fifth Harmony wins big at Teen Choice Awards; Bruno Mars unveils new video",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/harmony-wins-big-teen-choice-awards-bruno-mars/story?id=49200500"
}