{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2018-03-19 20:57:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Tex McIver claims the September 2016 shooting of his wife was an accident.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fwife-allegedly-shot-atlanta-attorney-husband-sole-witness%2Fstory%3Fid%3D53848766.json",
    "image_url": "https://s.abcnews.com/images/US/tex-mciver-ap-mem-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After prominent Atlanta attorney Claud \"Tex\" McIver allegedly shot his wife, Diane, while in a car driven by their friend, Diane McIver turned around and said, 'Tex, what did you do?\" according to the sole witness.\nDiane McIver's friend, Dani Jo Carter, who was driving the car at the time, testified today at the trial of Tex McIver, who is charged with malice murder. Tex McIver has said the September 2016 shooting was an accident and has pleaded not guilty.\nHyosub Shin/Atlanta Journal-Constitution via AP, FILE\nThe McIvers were passengers in a car driven by Carter when they ended up driving through a \"bad part of town\" at night, Tex McIver previously told investigators, according to the Fulton County medical examiner's investigative summary.\nDiane McIver was sitting in the front passenger seat; a replica of the inside of the car was on display in the courtroom and Carter gave some of her testimony from the replica's driver's seat.\nCarter said Tex McIver said to his wife, \"Darling, hand me my gun,\" to which Diane McIver replied, \"Tex, I don't even know where your gun is.\"\nAccording to Carter, Tex McIver responded, \"It's in the console.\" Diane McIver opened the console and her husband said the gun was in a plastic bag; Diane McIver then picked it up and handed it to him, according to Carter.\nAlyssa Pointer/Atlanta Journal-Constitution via AP\nCarter was stopped at a red light when, \"I heard a big 'boom,'\" she testified. \"I didn't know what it was, I thought there was an explosion somewhere. My head turned to the right and I looked out the window and wondered where there was an explosion. ... I did not realize that it was a gunshot right away.\"\n\"Diane turned around ... she said, 'Tex what did you do?\" Carter said. \"He said, 'The gun discharged.'\"\nAlyssa Pointer/Atlanta Journal-Constitution via AP\n\"She was breathing really hard and kind of panicking,\" Carter said, adding that Diane McIver was making \"horrible\" noises and eventually lost consciousness.\n\"I thought she was dying,\" Carter said.\nTex McIver \"was holding her head and saying 'Diane, Diane,'\" but he was not screaming, yelling or \"hysterical,\" according to Carter. Tex McIver was also not looking to figure out where his wife's wound was, according to Carter.\nFulton County Sheriffs Office\nCarter said Tex McIver told her to be careful driving because there might be people walking with baby carriages -- but Carter said she didn't slow down and drove to a hospital.\nCarter said that while in a hospital waiting room, Tex McIver said into his phone, \"I know this doesn't look good,” and shortly after that phone call, a criminal attorney came to the hospital.\nCarter said as she and Tex McIver were in the room, he said, \"I don't trust these guys. Dani Jo, I hate to see you get wrapped up in this. I've seen how these things can go down. ... You just need to say you came down here as a friend of the family.\"\nCarter said she responded, \"Tex, I just drove you into the emergency room.\"\nCarter told the jury: \"Because if I just drove down there as a friend of the family, there was no reason for me to be down at Emory hospital ... with no car at 10 o'clock on a Sunday night ... 15 minutes after his wife had been shot. How was I supposed to explain that?\"\nCarter said that Tex McIver then said to her, \"'Well they don’t know that.' .... I said, 'I can't lie.' ... He said, 'Oh, I'm not asking you to do that.'\"\nDiane McIver died at the hospital that night.\nProsecutors alleged in opening statements that Tex McIver planned and intentionally shot his wife to gain control over the couple's ranch, according to The Atlanta Journal-Constitution.\nHowever, defense attorney Amanda Clark claimed, “They seemed like lovebirds even after 10 years of marriage ... and that is why he did not intentionally shoot her,\" the newspaper said.\nAlyssa Pointer/Atlanta Journal-Constitution via AP, Pool\nTex McIver, who was arrested in December 2016, told The Atlanta Journal-Constitution in an exclusive phone interview in October 2016 that the shooting was an accident, saying he fell asleep in the car with the gun in a plastic bag in his lap.\nTex McIver told the newspaper he \"was suddenly awoken. I lurched and the gun fired. ... I must have forgotten it was in my lap.\"",
    "source_domain": "abcnews.go.com",
    "title": "'What did you do?' wife said after she was allegedly shot by her Atlanta attorney husband: Sole witness",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wife-allegedly-shot-atlanta-attorney-husband-sole-witness/story?id=53848766"
}