{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 03:13:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Tyler Duncan eagles 18th to take Safeway Open lead",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Ftyler-duncan-eagles-18th-safeway-open-lead-50337845.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_aa1def7fb75b44c0a22c80708b1ba2b2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tyler Duncan chipped in from the fringe for eagle on the par-5 18th hole Friday to take the second-round lead in the season-opening Safeway Open.\nMaking his second career PGA Tour start, Duncan shot a 6-under 66 for a one-stroke lead over defending champion Brendan Steele at Silverado Resort and Spa.\nDuncan, the Web.com Tour graduate who shared the first-round lead with Steele and Tom Hoge, also had seven birdies and three bogeys to reach 13-under 131.\n\"It's crazy, it's nothing I could have ever dreamed of,\" said Duncan, whose only other PGA Tour event was as a regional qualifier in the 2015 U.S. Open. \"I don't think it's sunk in yet, to be honest. It's something I've dreamed about for a long time. I'm just happy to be playing here and to be in the lead is something special.\"\nSteele had six birdies and a bogey in a 67. He's 30 under is his past six rounds in the event.\n\"It was really a solid day, very similar to yesterday,\" Steele said. \"I hit a lot of good shots, rolled and a lot of good putts and was able to watch Chesson go crazy.\"\nChesson Hadley, who began the second round seven shots behind the leaders, broke the course record with a career-best 61 to get within two strokes. He parred the final two holes.\n\"It's just one of those days everything was going my way,\" said Hadley, the 2014 Puerto Rico Open winner who regained his tour card through the Web.com Tour. \"I was hitting great shots, good putts and got some good breaks. When you get that of momentum, things just go your way.\nHe had an eagle, 10 birdies and a bogey. His previous career best was a 64 in the opening round of the 2015 AT&T Pebble Beach Pro-Am.\nZac Blair (66) and Tony Finau (65) were 9 under, and Graham DeLaet (67) and Brian Davis (66) were another stroke back.\n\"I just had a lot of good looks,\" said Blair, who doesn't have a bogey through 36 holes. \"I made 17 greens out there, left myself in some good spots, made a few of them and it was just kind of easy out there.\"\nEmiliano Grillo, who won the event two years ago, was 7 under after a 70\nPhil Mickelson, seeking his first win in since 2013, shot his second 69 to reach 6 under.\n\"I expected to score a little bit better today, but I had some good chances today,\" said Mickelson, who had six birdies, one bogey and a double bogey. \"I drove it a lot better, I hit quite a few more fairways and gave myself some good birdie chances. But I let a few opportunities slide.\"\nMickelson, playing in his 91st PGA Tour event since his last win, finished eighth in the tournament last year and has six straight rounds in the 60s at Silverado.\n\"A low round is out there,\" said Mickelson, who birdied three straight holes after double-bogeying the 14th — his fifth hole of the day. \"I feel like I'm getting close to it.\"\nJohn Daly, the two-time major winner who in May won his first PGA Tour Champions title and is playing via a sponsor exemption, birdied the 18th for second-round 69 to make the 1-under cut at 143. Daly had missed the cuts in his past 12 PGA Tour events.",
    "source_domain": "abcnews.go.com",
    "title": "Tyler Duncan eagles 18th to take Safeway Open lead",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/tyler-duncan-eagles-18th-safeway-open-lead-50337845"
}