{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 22:14:39+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Diante Yarber was killed by police while inside a car at a Barstow, California, Walmart parking lot.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fwitnesses-describe-moment-police-shot-killed-man-walmart-54704019.json",
    "image_url": "https://s.abcnews.com/images/US/180424_vod_orig_walmart_shooting_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Witnesses describe moment police shot and killed a man in a Walmart parking lot\nCampaign he'd like gives back in the car and I'm correct and I think he is night he got like soccer and plant from the cops so. He's just translate maneuvered easily and if it's moving. And when Karros now papers. That's when my all the shots were fired on it where it slowly like reverse England. And that they like sheet and so many times I mean he's just might lose like controlled congress this thing. And the car is still growing and we hit we finally can't get some if not because we hit the car. I think part that is because dancing with dignity. Clinton is on its. After I realized there was nobody in control of parliament more. We're rolling back the colts who have stopped. By hitting. Car parked by the back of us we come to a stop. That that forms is thinking. Keep my hands sort of its arts school science programs. Home. That point. Look it's. Sick everybody who Vitter and she was boom but he wasn't. Into whom. And and judges just keep my hands. His will also benefit bit smarter I don't have a reason to just if I wasn't celery. They're young for me to you know. Our own. News. It's our shows attendance there are a lot of huge he's young homeowner can make a decision. Home. Now he seems scary monster that Thompson Deutzman in the core and that we're. This. I'm thinking in my mind what's happened in. Everybody is then what's happened and own. Witnesses. Scared and wanted one is do it. Plume. Here a room. He goes forwards who positioned itself to. Avoid cards. Behind him I don't see was what I don't see with Clinton please report it seems like he's. Trying to maneuver. Out of this situation. Cargoes and through reverse and then. I dissident minority students us. That third quarter I just felt. I should be done in. And I do. It is. Boots kitco moon Lou glasse setters and boom. And then and I see. Whom I after the car or just wrong bet but nobody control within an hour. Figured that it bone. Piece. Ferris. A third term. Quote tomorrow more normal just wondering why is that happening. What would. Would we do. It's. Be receiving those sources confirmed. Whom. Yet just. Still are. Those whom you couldn't but times were we can to a complete star. They Sudan news did because I hear and to his left so. That was just as soon enough room connective. I was worried about was it was he OK you it and then that just confirmed that so. From what do you do they don't. I can feel. Soon. North my film. The news. Therefore it. Look they're. That decision in a master whom. One of my being arrested for. Decision just community. Alone they put me in the so. I get there it is in my knocking on the door and acts can make a phone call in my wristed it over my due today in doom. We'll have a right to make a phone call at least Apollo moments of all right. Boom. I'm into do do. The Rome told me. I've been detained him. And B and detain them under investigation. They need to question me and then they need to question. I'm home I'm gonna have to sit here and assume wait for them the question. Home. I guess I got a question there about six they got me up the sale of about six. Talk to me and then releasing this. I was released as soon. No phone call. Luckily that one of walking out the door hormones are.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Witnesses describe moment police shot and killed a man in a Walmart parking lot",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/witnesses-describe-moment-police-shot-killed-man-walmart-54704019"
}