{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 00:11:59+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Fifty years after becoming the first woman to officially finish the Boston Marathon, Kathrine Switzer has done it again.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fwoman-officially-run-boston-marathon-finishes-race-70%2Fstory%3Fid%3D46849724.json",
    "image_url": "http://a.abcnews.com/images/US/AP-katherine-switzer-jef-170417_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Fifty years after becoming the first woman to officially finish the Boston Marathon, Kathrine Switzer has done it again.\n\"I'm exhilarated,\" she told ABC News after finishing the 26.2-mile race on Monday. \"All the way along the route, people had heard my story, saw my bib, and they were holding signs up that read '261 Fearless' and 'Go, Kathrine!' They were screaming and going crazy. It was amazing, especially the little girls who were there with their moms. They were just jumping up and down.\"\nSwitzer, 70, crossed the finish line with an unofficial time of 4:44:31, just 24 minutes slower than her time as a 20-year-old. She said it has always been her dream to return to the streets of Boston after making history there in 1967.\n\"It's just an enormous sense of gratitude for the city of Boston, the streets of Boston, which changed my life and helped pave the way for what is nothing less than a social revolution in women's running,\" she said. \"When I crossed the finish line — to celebrate 50 years of looking back and seeing the huge progress and changes that have been made — I can only say that I'm extremely grateful for the experience.\"\nSwitzer signed up for the 1967 Boston Marathon, which until that point was predominantly run by men, as K.V. Switzer. While women were not officially barred from the course, people did not believe women were capable of running such a distance. A woman previously ran the race without a bib number. Race officials did not know that Switzer was running until she entered the second mile of the race. That's when race official Jock Semple ran up behind her and tried to rip off her bib in order to disqualify her. She was able to break free of his grasp, and her boyfriend shoved him to the ground. She kept running, becoming a symbol of girl power in sports.\nSwitzer said she was thinking of Semple, who later became her friend, as she passed that spot in the race today. Semple died in 1988.\n\"I just blew him a big kiss. I said, 'There you go, Jock,'\" she said. \"This was the guy who, for better or worse, changed my life. As it turned out, it was for better. At the time, it was a terrible experience, but in the fullness of time, it was the best thing that ever happened to me.\"\nPaul Connell/The Boston Globe via Getty Images\nSwitzer donned her original bib number, 261, for the 2017 race. This time around, she was accompanied by 125 runners raising money for her charity, 261 Fearless, which helps empower women and girls through running. After she crossed the finish line, the Boston Athletic Association retired her bib number.\nHaving fought sexism when she ran Boston the first time, she said she already knows the next boundary she has to break through: ageism.\n\"People are saying about old people in sports what they used to say about women — 'You shouldn't push yourself, you're too weak, you're too fragile, you might break, don't push it,'\" Switzer said. \"I don't think there's any limit for aging, and I think this is the next new frontier.\"\nAfter finishing the race, she said, she wanted a \"cup of coffee and a piece of chocolate.\" She plans to celebrate with a Boston-brewed draft beer over dinner with her husband and friends tonight. She said she has no intention of making this her last marathon: She hopes to compete in the New York Marathon in the future.\nHer goal is for her story to inspire women of all ages to be active, strong and confident in themselves, she said. For her, that strength was on display down to the smallest detail.\n\"I had a choice of what to wear today — capris or shorts. At 70, my legs are not gorgeous like they were when I was 28. And I said, 'I'm wearing the shorts,'\" Switzer said. \"I've got 70-year-old legs, and they deserve to look gnarly. But I don't care, because I just want to run and run well.\"",
    "source_domain": "abcnews.go.com",
    "title": "First woman to officially run Boston Marathon finishes race again at 70",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/woman-officially-run-boston-marathon-finishes-race-70/story?id=46849724"
}