{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 03:01:11+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Fryan-donato-signs-year-deal-bruins-starring-us%2Fstory%3Fid%3D53864239.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2018/0319/dm_180319_NBA_CAVS_WOJ_ON_LUE/dm_180319_NBA_CAVS_WOJ_ON_LUE_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Left wing Ryan Donato, who starred for Team USA at last month's Pyeongchang Winter Games, has signed with the Boston Bruins and will play Monday night against the Columbus Blue Jackets.\nDonato will play left wing alongside Noel Acciari and Brian Gionta. He will also see some power-play time.\nDonato, 21, is a 2014 second-round draft pick of Boston and the son of former Bruin and current Harvard coach Ted Donato. He signed a two-year entry-level contract.\nDonato tied for the lead in goals among all Olympians with five goals in five games and led Team USA with six points.\nAs a junior, Donato led Harvard with 26 goals and 43 points in 29 games this past season and was a finalist for the Hobey Baker Award as the NCAA's top player. He became available to sign after the Crimson were eliminated in the ECAC semifinals by Clarkson 5-4 in overtime Friday night.\n\"He's a kid that's got a confidence about himself, a talent level, and he's got some details he's gonna have to work on -- all young players do,\" said Bruins general manager Don Sweeney. \"But he's a player that has hard skill. We're looking forward to having him ... get immersed and get a taste.\"\nThe Bruins have been hit hard with injuries, with several forwards sidelined.\nPatrice Bergeron has been out three weeks with a broken foot, but was back on skates at Monday's practice and could travel with the team on the upcoming road trip.\nJake DeBrusk has missed the last two games with an upper-body injury. David Backes took 18 stitches to his right leg after being hit by a skate blade Saturday night.\n\"It was a pretty significant cut,\" Sweeney said Sunday of Backes' injury. \"We'll let nature take its course and let it heal. I don't have a definitive timetable. Certainly not day-to-day. I would suspect he'll be out for a couple games.\"\nThe Bruins, who are second in the Eastern Conference with 98 points, are also missing rookie defenseman Charlie McAvoy (knee injury) and captain Zdeno Chara (upper-body injury).",
    "source_domain": "abcnews.go.com",
    "title": "Ryan Donato signs two-year deal with Bruins after starring for U.S. in Olympics",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/ryan-donato-signs-year-deal-bruins-starring-us/story?id=53864239"
}