{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 21:14:37+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "3 Trump accusers speak out, call for congressional probe",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Ftrump-accusers-speak-call-congressional-probe-51718770.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_216e40790d0f45b99e8244a48ff14afe_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Interested in Donald Trump? Add Donald Trump as an interest to stay up to date on the latest Donald Trump news, video, and analysis from ABC News. Add Interest\nThree women who have previously accused President Donald Trump of sexual harassment shared their stories on NBC's \"Megyn Kelly Today.\"\nJessica Leeds, Samantha Holvey and Rachel Crooks on Monday told of alleged harassment by Trump spanning decades.\nThe White House called the claims false and \"totally disputed in most cases.\" It said \"the timing and absurdity of these false claims speak volumes.\"\nOne of the accusers, Rachel Crooks, called the White House statement \"laughable.\"\nCrooks said of sexual misconduct: \"I think politicians seem to be immune to this.\"\nHolvey described the pain the women felt after Trump's victory. \"We are private citizens and for us to put ourselves out there, to try to show America who this man is, and especially how he views women, for them to say, 'Meh, we don't care,' it hurt.\"\nThe women, who first shared their stories before the November 2016 election, were holding a press conference later Monday to call for a congressional investigation into Trump's alleged behavior. They cited the recent revelations of sexual misconduct by prominent men in business, media and politics, for their decision to speak out publicly against Trump once again.\n\"The environment's different,\" Holvey said. \"Let's try again.\"",
    "source_domain": "abcnews.go.com",
    "title": "3 Trump accusers speak out, call for congressional probe",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/trump-accusers-speak-call-congressional-probe-51718770"
}