{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 01:22:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "The elderly victim's nine children are grieving over the senseless and random murder.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Fmulti-state-manhunt-continues-man-shot-senior-citizen-46852027.json",
    "image_url": "http://a.abcnews.com/images/WNT/170417_wn_perez_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for A multi-state manhunt continues for the man who shot a senior citizen and posted the video live on Facebook\nafter the holiday. We begin tonight with that urgent man hunt now going nationwide. The suspected killer who then posted his killing on Facebook. Authorities said took this video. Walked up to an elderly man, a perfect stranger. There are more victims. Tonight, U.S. Marshals and the FBI are now joining the hunt. After foug focusing on a handful of states tonight, tonight the search is now nationwide. ABC's Alex Perez leads us off from Cleveland. Reporter: Tonight the desperate nationwide manhunt for the man who took and posted this video to Facebook. Police say it showed the senseless murder of an elderly man. He could be nearby or far away. Reporter: Authorities now offering a $50,000 reward for any information leading to the arrest of the suspect. I'm going to kill this guy right here, the old dude. Reporter: Police were alerted to the shocking video, 37-year-old Steve Stephens getting out of his car and walking over to an unsuspecting 74-year-old Robert Godwin Sr. He's about to shoot him because of a woman. He's the reason why all this happened to you. Reporter: The next moments too graphic to show. One male shot. Reporter: Police racing to the scene of the murder, but the suspect was gone leaving behind a trail of recent chilling posts. Investigators said he lost everything to gambling. I lost everything I had. Reporter: In another claiming to have killed more than a dozen people. I killed 13 people. I'm about to keep killing until they found them. Reporter: The urgent manhunt for the Stephens temporary putting Cleveland universities and hospitals on lockdown. Late Sunday, words that his cell phone was pinged 100 miles away in E reshg officials revealing today, detectives spoke to Stephens by phone shortly after the murder took place. They tried to of course to convince him to turn himself in. Reporter: Today, Stephens' place of work closed. He mentored foster kids at a mental health facility. Facebook disabling his account after reports of the murder video came in. But that graphic video had been up for more than two hours. The company saying in a statement, it was a horrific crime, one that has no place on Facebook. We know we need to do better. Tonight the family of the man who Stephens randomly killed calling for justice and trying to make sense of their loss. We're beyond shock. To somebody brutally murder my father like that, is unbelievable. Just horrible. Alex Perez joins us tonight from Cleveland. Alex, authorities this evening saying the suspect did not have a criminal record and we're learning what they found when they searched his home. Reporter: Yeah, that's right, David. Authorities say they recovered weapons and other evidence important to the investigation. The suspect's family and the woman mentioned in that chilling video are cooperating with\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "A multi-state manhunt continues for the man who shot a senior citizen and posted the video live on Facebook",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/multi-state-manhunt-continues-man-shot-senior-citizen-46852027"
}