{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 03:43:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "James, Cavs hold off Wiggins, Wolves, 116-108",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fjames-cavs-hold-off-wiggins-wolves-116-108-45500152.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/james-cavs-hold-off-wiggins-wolves-116-108-45500152",
    "language": "en",
    "localpath": null,
    "maintext": "LeBron James had 25 points, 14 assists and eight rebounds to turn back a charge from Andrew Wiggins and help the Cleveland Cavaliers to a 116-108 victory over the Minnesota Timberwolves on Tuesday night.\nChanning Frye had 21 points and 10 rebounds while starting for All-Star Kevin Love, who will miss at least the next six weeks after having surgery on his left knee. Kyre Irving scored 25 points for the Cavs and James sealed the victory with a stepback 3-pointer with two minutes to play.\nWiggins scored 41 points against the team that drafted him and Karl-Anthony Towns scored 26 for the Wolves, who finished a six-game homestand at 2-4. The Wolves allowed Cleveland to shoot 51 percent and hit 13 3s.\nJames tried to calm the Cavs on Tuesday morning when they found out they would be without Love for the stretch run in an Eastern Conference race that is suddenly tight with the Boston Celtics and Washington Wizards right on their heels. He said that as long as he's on the floor, the Cavs will always have a chance to win, and no one doubts him.\nHe took his time to get going, choosing to get others involved, including with a no-look pass through Wiggins' legs to a diving Derrick Williams for a layup in the second quarter. He threw down two soaring dunks later in the third and added a Jordan-like reverse layup as part of a highlight-filled night.\nThe Cavs appeared to be pulling away when they opened a 14-point lead in the third quarter, but Wiggins exploded for 20 points in the period to make it a game. He hit a 3-pointer and beat the buzzer on a long 2 to tie it at 93 going into the fourth.\nWiggins was chosen by the Cavs No. 1 overall three years ago, but that was before James made his surprising return to Cleveland. The Cavs traded Wiggins to Minnesota for Love and Wiggins has always given them his best punch. He entered the night averaging 27.6 points per game against them, his highest scoring average against any team in the league.\nThe Wolves missed two open 3-pointers that would have tied the game in the final four minutes, but James hit his from deep and Williams got a steal and a layup to hold off the Wolves.\nTIP-INS\nCavaliers: F Iman Shumpert played 25 minutes after missing the previous three games with a sprained left ankle. ... Williams scored 13 points off the bench against the team that drafted him No. 2 overall. ... Tristan Thompson had 14 points and 11 boards.\nTimberwolves: SG Zach LaVine had surgery in Los Angeles on Tuesday to reconstruct the torn ACL in his left knee. He is expected to miss nine months while recovering. ... Ricky Rubio had 16 assists and eight rebounds, but was just 2 for 8 from the field.\nUP NEXT\nCavaliers: Cleveland heads back home to face Indiana on Wednesday for its final game before the All-Star break.\nTimberwolves: Minnesota flies to Denver for a game Wednesday night in a key game for the Wolves against the Nuggets, who currently own the eighth seed in the West.",
    "source_domain": "abcnews.go.com",
    "title": "James, Cavs hold off Wiggins, Wolves, 116-108",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/james-cavs-hold-off-wiggins-wolves-116-108-45500152"
}