{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 10:20:37+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "With gun salutes, Pakistan marks 70 years of independence",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fgun-salutes-pakistan-marks-70-years-independence-49199995.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_a585ebdbdd7f4c55ae8a3c94c928b938_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pakistan kicked off a day of celebrations on Monday marking 70 years of statehood and independence, the festivities beginning with gun salutes in the capital, Islamabad, and in each of the four provincial capitals.\nIn Islamabad, President Mamnoon Hussain hoisted the national flag at a ceremony attended by Prime Minister Shahid Khaqan Abbasi, visiting Chinese Vice Premier Wang Yang, and scores of Pakistani military and government officials and other dignitaries.\nSecurity was on high alert across the nation following the suicide attack on Saturday when a bomber on a motorcycle targeted a military truck in the southwestern city of Quetta, killing 15 — eight soldiers and seven civilians.\nPakistan gained independence when the departing British left India and split the subcontinent in 1947, sparking one of the most violent upheavals of the 20th century.\nFor the Pakistanis, the anniversary comes amid political turmoil that has characterized successive civilian governments of the country, which has been dominated by military rule through much of its history.\nAddressing the ceremony in the capital, Hussain urged the nation to look to the wisdom of its founders when facing the current \"hot\" environment.\n\"Solutions to all the problems of this time persist in our ideologies, thoughts of leaders of our freedom movement and our bright history,\" he said. \"By following them we can improve our situation today and our future as well.\"\nHe appealed on the citizens to \"rise above\" their party and group interests and \"protect the future of the nation.\" Later in the evening, Hussain was to hand out medals to noteworthy citizens.\nMost recently, Pakistan's political scene has been shaken when the Supreme Court dismissed Prime Minister Nawaz Sharif from office in July for concealing his family assets.\nSharif stepped down, allowing for Abbasi to take over, but decried the court's ruling as an injustice and vowed to clear his name. Then he embarked last week on a series of on-the-road rallies, spanning four days and covering the stretch from Islamabad to his hometown, the eastern city of Lahore where he addressed tens of thousands of supporters.\nChinese Vice Premier Wang Yang said his country considers Pakistan an important partner in the \"Belt and Road Initiative\" that calls for Beijing building ports, railways and other facilities in a vast arc spanning 65 countries, including Pakistan.\nIn Karachi, visitors paid respects at the mausoleum of Mohammad Ali Jinnah, the founder the country.\nPakistan Air Force put on a spectacular airshow, with Pakistani, Turkish and Saudi fighter jets flying over Islamabad as thousands of spectators watched from one of the city's parks.",
    "source_domain": "abcnews.go.com",
    "title": "With gun salutes, Pakistan marks 70 years of independence",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/gun-salutes-pakistan-marks-70-years-independence-49199995"
}