{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 15:47:22+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "PSG playing its best soccer since Qatari takeover in 2011",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fpsg-playing-best-soccer-qatari-takeover-2011-45506076.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/psg-playing-best-soccer-qatari-takeover-2011-45506076",
    "language": "en",
    "localpath": null,
    "maintext": "Paris Saint-Germain is dreaming big, just like its motto says.\nThe French club, desperate to join Europe's elite since Qatari owners QSI took over six years ago, made an eye-catching breakthrough in the Champions League on Tuesday, routing Barcelona 4-0 in the first leg of the last 16.\n\"This was the best performance I've been part of since coming to PSG,\" said midfielder Blaise Matuidi, one of QSI's first signings after its takeover in June 2011.\nIn the years since the new ownership came in, PSG has pumped hundreds of millions of euros (dollars) into acquiring big-name coaches and big-name players, including Thiago Silva, Edinson Cavani, Angel Di Maria and Julian Draxler.\nQSI also launched an advertising campaign with the motto \"Revons Plus Grand,\" French for \"Let's Dream Bigger.\"\nIt hasn't always worked out, though.\nIn the past four seasons, PSG has dominated in France but has failed to reach even the semifinals of the Champions League. Twice the team lost to Barcelona, in 2013 and '15, in the quarterfinals and then again last year to Manchester City.\nThe result of European frustration has led to swift and ruthless change, with coach Laurent Blanc fired in the offseason despite winning back-to-back domestic trebles.\nHis successor, Unai Emery, was hand-picked by PSG president Nasser Al-Khelaifi, who liked what he saw in the Sevilla side that Emery guided to three straight Europa League titles.\nThat team played with passion, total commitment and relentless energy, and the Spanish coach has allied those qualities to a PSG team with considerably more individual talent than Sevilla.\nAfter a difficult start, his methods are working well.\n———\nNO IBRA, MORE TEAMWORK\nZlatan Ibrahimovic's departure to Manchester United before the season left a huge void — one that PSG has filled with more teamwork.\nWhen Ibrahimovic played, everything revolved around him. He was given such freedom by then-coach Carlo Ancelotti and by Blanc that he roamed wherever he wanted.\nWhile the Swede was a prolific scorer, the loose way he played often unbalanced PSG and made the side predictable against better European opposition.\nWith the unselfish Edinson Cavani as the main striker, PSG is much harder working. And Cavani has stepped up with 34 goals this season.\nIbrahimovic also hardly ever defended, while Cavani tracks back to support his teammates.\n———\nEMERY'S TACTICS\nThe team Emery picked against Barcelona was brave and innovative.\nHe dropped Brazilian winger Lucas, one of his best players, and recalled the inconsistent Angel Di Maria — who scored twice.\nBut it was Emery's midfield formation that really caught the eye and earmarked him as a clever strategist.\nSwitching from the 4-3-3 formation he usually deploys, Emery went for a 4-2-3-1 with Adrien Rabiot and Marco Verratti as the holding pair and with Blaise Matuidi pushing up almost as a playmaker.\nMatuidi is usually either a holding or a wide midfielder, but Emery used him as a thrusting spearhead where his relentless energy and ability to time late runs behind the defense caused havoc.\n———\nHOMEGROWN TALENT\nAs the final whistle blew at Parc des Princes, three homegrown PSG players joined in the celebrations.\nCenter back Presnel Kimpembe had marked Barcelona star Lionel Messi out of the game and Adrien Rabiot had won his midfield battle against Sergio Busquets. Midfielder Christopher Nkunku came on for the last 20 minutes.\nKempembe and Rabiot are both 21, while Nkunku is 19. All three grew up in the Paris region and came through the club's youth ranks.\nWhile Ancelotti and Blanc rarely trusted homegrown players, offloading central defender Mamadou Sakho to Liverpool and winger Kingsley Coman to Juventus, Emery has great faith in them.\nKimpembe is an athletic defender who reads the game well and is strong in the air. The graceful Rabiot has great composure on the ball, a dangerous shot from outside the box and is a perceptive passer.\nHomegrown players also give the club a stronger local identity because fans feel like they're watching one of their own, rather than only imported stars.\n———\nKEEPING VERRATTI\nThe diminutive Marco Verratti is the heartbeat of the side and PSG has done well to keep him, despite interest from Real Madrid.\nThe 24-year-old Italy midfielder is a great organizer and sets the tempo for PSG's game with quick-thinking and crisp passing.\nHe has an excellent passing range, whether short or long, and he regularly creates chances with his defense-splitting passes.\nAll he needs to add now is goals, with only five in 185 games since joining from Italian side Pescara five years ago.",
    "source_domain": "abcnews.go.com",
    "title": "PSG playing its best soccer since Qatari takeover in 2011",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/psg-playing-best-soccer-qatari-takeover-2011-45506076"
}