{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 14:45:40+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Marine Corps Gen. Joseph Dunford told ABC News' Martha Raddatz in Seoul, South Korea, the U.S. is \"not complacent\" about North Korea's threat to fire missiles around Guam.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fjoint-chiefs-staff-chairman-speaks-north-korea-49203559.json",
    "image_url": "http://a.abcnews.com/images/GMA/170814_gma_raddatz1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Joint Chiefs of Staff chairman speaks out on North Korea\npresident's top military adviser arriving in South Korea for the first time since tensions escalated between the north and the U.S. Reporter: The general met with South Korea's president saying the U.S. Is looking for a peaceful resolution but military options are being prepared if deterrents fail. Tomorrow is a significant day with North Korea hitting a deadline for its proposed plan to fire missiles around Guam. I talked to general Dunford just moments ago about that. Are you more nervous than with their usual rhetoric because they were so specific? Martha, I don't know how serious the threat S I don't know if they're going to do what they say they're going to do but we're not complacent about it. Reporter: Dunford said if North Korea fires missiles at Guam it will be up to president trump to decide how exactly the U.S. Would respond. David. All right, Martha Raddatz in Seoul as always, we appreciate Martha's reporting. A lot going on in the world. Tense times.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Joint Chiefs of Staff chairman speaks out on North Korea",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/joint-chiefs-staff-chairman-speaks-north-korea-49203559"
}