{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 14:18:38+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "\"GMA\" goes behind the scenes with Travis Pastrana as he prepares to pull off his so-called \"Evel Knievel\" stunt.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fvideo%2Faction-sport-star-preparing-biggest-stunt-56361684.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_whitworth3_838_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for How an action sport star is preparing for his biggest stunt yet\nattempt tol off the ultimate tribute to Evel knievel. Tr Pastrana is tg to do his most daring stunts this weekend and kayna Whitworth is back with us this mng with a behind-the-scenepreview. O again. Dan, so Cal him fearless, call him crazy if you want. As long ou call him dedid. Travis has S his life ING the limits but this weekend he's taking O his biggesallenge yet and hoping make historythe process. Trying toolidify his pce in the his books Travis pastra ready tokle his biggest challenge I never attempted asars I'm going to have to scombrufr on the day? On julyth in a thhour special on the history channel ill attempt Tak the rico established by world famous daredevil Evel knievel and succully jump over 52 cars. Ll, what would Evel have done ask push it as far as he would have done and that's WHA we doing. Eporter: That stunt fwed by a second one in which he'll try fly over 16 buses. It'eay the first time in --Ince Evel's day since anyone has tried this, fun but scary at the Sam time. A cnating in live grand finale. No one has jumped jumpedhe's. It nearly ki him. Wardbe, outfit. It does make riding little more difficult. Hopefully the leather if I end up sliding across the gd will help stopoad rash. Pastrana knows all too W the dangers ofreme sports. Unfortely with my wrist I went up T 35 surgeries. 35. And i4 years old I was really hoping that my age would surpass my surgeries but I'm almost E. Reporter: With only a few days til he performs these ath-defying feats he knois time T break Recor won't last forever. Att point do younk it ll be enough? My dad always said R the train sthe wheelome off. He will be riding a bike Simila the one. VEL rode when attempted T stunt, a lot heavier than dirt bikes he's used to, also by T his wife andng daughters will be on hand. He told me wife said be safe, but remember nobody likes a loser. That might ringing in ears as he flying over the fountain. We'll watch it airs this sundayuly 8th and Travis willn us live on day.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "How an action sport star is preparing for his biggest stunt yet",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/video/action-sport-star-preparing-biggest-stunt-56361684"
}