{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2018-03-19 18:44:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "A similar motion is before the Supreme Court.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fjudges-decline-block-pennsylvania-house-map-boost-democrats%2Fstory%3Fid%3D53854199.json",
    "image_url": "https://s.abcnews.com/images/Politics/ryan-costello-gty-jpo-180315_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A three-judge panel in Pennsylvania has upheld the state’s new congressional map, a blow to Republican hopes and a boost to Democratic chances of retaking control of the House of Representatives.\nInterested in Midterm Elections? Add Midterm Elections as an interest to stay up to date on the latest Midterm Elections news, video, and analysis from ABC News. Add Interest\nRepublican lawmakers in the state had filed for a stay against the new map, which was drawn by the state Supreme Court after the Democratic governor and GOP-controlled state legislature could not come to terms on a new one.\nA similar motion is before the U.S. Supreme Court and there has been no indication of when the high court will issue a ruling.\nDemocrats are expected to pick up three to five House seats under the new map, according to estimates by election experts, which would help them on their way to the 24 seats they need to retake control of the lower chamber of Congress.\nThe filing deadline for House candidates in Pennsylvania is Tuesday.\nThe Supreme Court of Pennsylvania\nThe three-judge panel ruled that the Republicans had no standing to make their argument. The court also noted that “because fundamental principles of Constitutional standing and judicial restraint prohibit us from exercising jurisdiction, we have no authority to take any action other than to dismiss” the request.\nRepublicans can appeal the ruling. That appeal would go to the U.S. Supreme Court.\nIn January, the Pennsylvania Supreme Court ordered a new House map drawn, citing gerrymandered districts that favored Republicans. The GOP has been fighting the court order ever since and the U.S. Supreme Court denied an early request to put a stay on the map.\nJeff Swensen/Getty Images FILE\nRepublicans currently hold 12 of the state's 18 congressional districts, while Democrats control just five. The special election last week for Pennsylvania’s 18th Congressional District was held under the old map.\nSeveral GOP lawmakers found their House districts dramatically affected by the new map, including Rep. Ryan Costello, who is considering retirement, several state and national officials in GOP politics told ABC News.\nHis 6th Congressional District was transformed from one that Hillary Clinton won by one point in 2016 to one she would have won by nine points.\nCostello has not said he is retiring and his office and campaign did not respond to ABC News' multiple requests for comment.\nPennsylvania’s House delegation took a big hit in Republican members this year.\nGOP Rep. Tim Murphy resigned after a scandal. Rep. Lou Barletta is running for Senate. And Reps. Bill Shuster, Charlie Dent and Patrick Meehan are retiring.",
    "source_domain": "abcnews.go.com",
    "title": "Judges decline to block new Pennsylvania House map in boost to Democrats",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/judges-decline-block-pennsylvania-house-map-boost-democrats/story?id=53854199"
}