{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 20:25:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "ABC News' Clayton Sandell visits a drive-through dispensary in Colorado, the first in the nation.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fvideo%2Fcolorado-opens-drive-marijuana-shop-46848662.json",
    "image_url": "http://a.abcnews.com/images/US/170417_vod_marijuana_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Colorado opens first drive-through marijuana shop\nAgain it's Clayton send out here at ABC news thanks for clicking on us we are coming to you. Today from a marijuana dispensary but one that is extremely unique and we're gonna tell you about that here in a second but. One of the reasons were out of marijuana dispensary. Is were reporting on a new poll that came out from Yahoo! News and Marist. First of all wanted to give you a couple of numbers from this new poll on marijuana and families for small 52% of Americans have tried. Marijuana at least once and of those people. 65%. That have tried it our parents they have kids so it's been a lot of discussion lately about marijuana in families. According to this poll 73%. Of parents say that they have talked of to their kids. About pot so that's one of the reason we want to come out here today we're also gonna talk about. This is for twenty weak fourth when he is on Thursday I believe this week so. We're going to tell you a little bit about why that's such a big deal in the marijuana industry and community but today we are here at tumble weeds. Tumbleweed express right they get the name rank with mark and Gonzales mark and CEO here Gonzales is the general manager. This drive through tell. I'm sorry this dispenser at his game nor at this dispensary tell us why it's so unique went to different appreciate the first ever. Drive through its history in the world and the reason that the first. Mirror on your products can be stands outside the lights for a so what's unique about this and you actually drive into the building its. Juries so you have a lot of rule we've done a lot of stories of dispensaries and there's a lot of rules a lot of times rest for all right all right be we have to where visitors badges. There are there are rules you guys got to follow so. You've never have been an elaborate drive thru because. Why leaders you can't come on the premises right there OK so. Tell us a little bit about you've got another big dispensary over there shoeless sort of what you guys do here for anybody who's not and in a dispensary before. This is kind of what it looks what it. And it. Lights action scenes that it signed. It's. It makes me I can't eyes. And unity and. So these there was whose at a bulls right. Some people think that he a lot of people know of course even smoked marijuana but it can be ingested eaten. Drinks the hole that. Right. Are they as strong is that is smoking marijuana what's the difference between inedible okay. The end of action packed and hear from them teens. And in the ops. Forget it capsules. You know as an option to you. It's you see Adam the 800 milligrams ten. EP's into the act was passed this needs. Okay. The reason for the popularity. You can my doctor knows like. If you're smoking. But now it's really hurt us thirty programs aha enough. We're here there was specifically notes. And two victory at measure cap. Obviously they want and no program and then oh it is where you can see 82. Work for me horrendously. With one apple one worker. More precise worked yeah. We tell you just a little bit about. You know we're talking about this expanding discussion want more families are our. Are talking about how their kids among among them if only members marijuana. The medical marijuana is now legal in 28 states. And recreational marijuana. As of November is legal in about in eight states. Plus Washington DC so this is is spreading across the country you guys are expanding as well to. Or were small company you know we've grown organically and we have it's dispensaries so more open. Or process we construct new. Immediately focused on the accident or Korea won her opening up which is my ass but. The guy's an order Edwards right you know whom bill this year. And you write off I seventy years that he probably a lot of people driving through right. OK speaking of drive thru this is why everybody is tuned in here today tell us. A little bit values what first ball what was this building. Before a car wash. You're the bulls. It them and that's. Officers bit. Who. And one of them music world right here right. We'll show us how an old show us how it all works here services you use this is your office area where everything is stored. You'd see ago lot of lot of security cameras here's. Well well monitored. But this is just like you're going to McDonald's threatening at a drive through into the open. And solace is finished you actually. Open up a door. Area he actually open up that door and conic NC and the cars will come in. Will pull right up here will they order out there do they order right here. An outside of security that Alli es me it's heavy on it just went right happened. And I'm happy I'm here the attendance here checks lately and it's I think. So what if Sony comes in and there's kids in the car. Funny and it's a courtesy everybody in the car has to be 21 before they can before. Cut. And so they'll come up here and you exchange money they'll get the product then again when they come in you close that door of the basement lock. The jiffy lube of marijuana says might affect. This. Apparent. And then big exit door will open and as soon as they're done there's there's another door on the other side that opens right up. And also he is we're having. Almost like ordering. Sushi the customers will have. We anticipate more than one customer aha in Q all right. Hand. Paper menus with little pencils at me and fill out exactly what they won and then give them that the security there will be. You know communicating with the but vendors here so they can prepare their order in advance what really drives through. Hopefully going to be Tuesday picked up and you have lots of choices I understand. Lots of how many well. They're more choices. At the main dispensaries. There are here where the carrier 5060 streams that we have over there right but. This is serving it differ customers more and more unique. Customers this customer we'll know what they want may have experience. In this. And their minds already made up they don't need the education of the salesmanship of the but under explain to them all the new products that are coming out. They already know and you're also going to be open late. There are many places. Without a parachute was was very kind and it went there after real the first dispensary is really helped the tax base here. And that's that. Have a good idea but. By that car auction stand. They dispensaries here then if you could if you could extend the hours commitment Brent. And and they were able do that for us how tough battle wasn't here when when you say drive through dispensary that's that's different. Hold it accountable for. So that were not tolerate house that well. The legacy a year ago there was Lemerre won here in actually the town manager who I think is very. Progressive he he called me than all other people in the industry that would you be interested. In bringing marijuana to art because. The oil and gas industry has been decimated here. And a lot of jobs the economy is very down. And they needed tax revenues and the need. I'm happy to say that the mere one industry is now the second. Largest taxpayer. In for. One this. Wow OK it was speaking speaking of the industry just in Colorado a lot of film builds me with a couple more graphics in Colorado. Just in 26 teen's sales hit one point three. Billion with a B dollars in the way that breaks down is about 875 million of that was recreational marijuana and about 438 men in. Was medical marijuana so it's a huge huge industry. This is too big to fail. And besides those statistics what people don't realize that you're doing a billionaire bill victory here want to sales. All the ten gentle businesses then the labeling packaging. That deliveries mean there's so many industries that have been built up a round. It's not just mere one Thursday write a cut. Well outside can we can we take a look outside and see what this looks on the outside. McConnell follow us here and also folks if I'll do my best here but if you have questions. For us or for marker Gonzales. Right in the comments section below thrust a question and and all do my best to get to them. Do we can do so construction. There's a road construction so they are opening this work. All of. Letting this drive through dispensary on fort quantity and we'll explain what for why the significance of fort funny here in a second but. Putting up they're putting up the menu board right here. So you'll drive then kind of Wear this and the blue where this truck is right you know see everything on the menu board. And you'll fill out your form. Forms you ask that you could be you one. So you actually do speak into a speaker in order. Murder. It. I got asked. View you ask you want Fries with that and happy meal there merely let's back snoopy you can order along the way. And Hewlett hopefully everyone supersize definitely they're hoping everyone supersize excellence so this is this is bed door has opened up and this is where. This is where you would drive in. And it does it looks just like you're coming to McDonald's or Burger King or whatever you come right up here and and and get your product. Come can come here for second help me understand. The significance of fort want me because for Tony is Thursday everybody associates. For Tony with marijuana. Why why is that you know it is there's a lot of rumors as. Let's look you but it's Christmas every industry needs the Christmas so it's as the holidays. Everybody centers around. Here in the industries. Who. I don't know you that there are a lot of rumors and speculation I've heard everything from kids in California used to meet after practice at high school and smoke at fort Forney every day effort it was the police department code for illegal marijuana is back in the day so who knows but it's it's come to signify a pretty big day in the industry it's a huge day and its us. You know more and more I think the difference about this operation so people. Really celebrate the fact that they. Have other friends that he is socialize around me is an interest in deference lot different than alcohol or you go through things happen. Though. W become violent barber or work drivers mean and where a lot of businesses will more socialist. Well and it does. Beg the question when people come in here and get the product and and drive off to do you worry is it your worries that you're concerned though. They'll use of marijuana right as they pull out you know that's a great question. That means. When you go to the dispensaries get out of your car and walked into the dispensary. Place an order. Get product in the bag now it takes you seven seconds it from the car owner back in here right. So what is really the difference between the seven seconds that you're taking your exit bag to your our purses Gonzales. Handy you your exit Baghdad are the reality is it's in the car that's how you got here. That's like transport yourself everything is back right via mobile today right so. It's really ago. Right right but if you put lie no real difference what time to its that in fact that mean right we don't let anyone opened up anything in the dispensary there walking out there can open up things. Just as we handed to a dispensary here. In what they do with that product after they leave no difference whether it's here and or they dispense. Obviously would be opening this place of you didn't think it was going to do well for you how how popular do you think this is going to be something like this. Credible and incredible interest you know people want they want paid either first they were. That they they're always that it's what you get video even during construction there out of be in the game here this is. Late and I am hoping it's not a novelty and half of the one trick pony where. It's only good for a week but I I think. Given. You know the fact that's openly that people can it be very. Very convenient. And I will say something. The talking about but it's kind of interesting. At one of rather dispensaries. We have three stores. To get to spend. Three what is the side door at a ducked down soccer mom entrance of that so there is a quiet localized that. Because soccer mom and there's a theory that I come up with that there is a fair amount of the clientele that wants that drive up and get out. Without you know fairly see who is don't want anyone to see them and this is inside your you run raided edwards' and you run right Penn Nolan senior carton behind they'll build up of this. Involved and I think we'll get some of that here were people just don't want to be up front. Oca. It's it's easy it's it's a little more anonymous and it went up. Days. And nights in. In and out all right while most they are here tumbleweed express here in parachute Colorado we are about how far from Grand Junction another half an hour ago in the rooms. 45 minutes 45 minutes east of Grand Junction well seventy so you open when. What on Thursday afternoon. It. Awesome area drive through and a right here that but no French Fries no snacks just marijuana products. Mark Smith thank you very much be CEO here is general manager I guess we'll see let it take care.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Colorado opens first drive-through marijuana shop",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/video/colorado-opens-drive-marijuana-shop-46848662"
}