{
    "authors": [
        "Abc News",
        "More Elizabeth"
    ],
    "date_download": "2018-05-30 22:58:22+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The North Korea negotiator and US Ambassador to the UN under President Bill Clinton believes that the on again, off again summit will happen.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2F60-40-chance-north-korea-summit-succeeds-richardson%2Fstory%3Fid%3D55532067.json",
    "image_url": "https://s.abcnews.com/images/Politics/donald-trump-kim-jong-un-ap-rex-as-180526_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Amid uncertainty over whether the North Korea summit between President Donald Trump and Kim Jong Un will occur on June 12, former New Mexico Governor and North Korea negotiator — Bill Richardson — says that there is a 60-40 percent chance that the historic meeting will not only happen but also produce a positive outcome.\nInterested in North Korea? Add North Korea as an interest to stay up to date on the latest North Korea news, video, and analysis from ABC News. Add Interest\nIn an interview with Powerhouse Politics hosts, Jonathan Karl and Rick Klein, Richardson stated that the summit is “doable” and “possible.”\nWhen it comes to the United States’ demands, however, he does not believe that complete denuclearization of North Korea is “realistic.”\n“If [Kim Jong Un] does move towards denuclearization, which I doubt, he's gonna want a big price from the United States.”\nPresident Trump and the White House have previously stated that the summit aims to achieve complete and irreversible denuclearization of the Korean Peninsula.\nTasos Katopodis/Getty Images\nAlthough Richardson questions North Korea's willingness to concede all nuclear capabilities in negotiations with the United States, he cited immediate and total denuclearization as a “goal” for the summit. He does not believe that the United States should expect to accomplish this objective in just one meeting.\n“They don't negotiate like we do. They don't believe in quid pro quos...If we get some kind of negotiating process that might lead long-term to a substantial denuclearization...with full inspections, with timelines, that would be a good result of the summit.”\nRichardson, the U.S. Ambassador to the UN and Secretary of Energy under President Bill Clinton, is uniquely positioned to offer insight into North Korea’s diplomatic activities. He has traveled to North Korea eight times for both official and unofficial reasons.\nAs a Special Envoy, Richardson achieved the release of American political prisoners and servicemen held in North Korea. He also met with Kim Jong Un’s father — Kim Jong Il — in 2005.\nWhile speaking to the Powerhouse Politics hosts, Richardson criticized President Trump’s foreign policy but noted that it may be effective when dealing with North Korea’s dictator.\n“I don't like what he's done internationally with trade, with our European allies, with our Latin American allies, with the Iran deal,” Richardson said. “But on North Korea, I have to give him credit for advancing in a situation that has never advanced as positively as it is now.”\nKCNA via AFP/Getty Images\nRichardson pointed to similarities between the American and North Korean leaders, labeling them both “dictatorial” and “impulsive.” While conceding that these commonalities might benefit President Trump, Richardson also voiced concern about Trump’s behavior on and off of Twitter.\n“His style, his ego...pauses me to think that he may not achieve what could be achieved for this country and for the world.”\nThe White House has not officially announced if the June 12 summit will occur after President Trump canceled the historic meeting in a letter to Kim Jong Un last week. In her daily briefing on Wednesday afternoon, Sarah Sanders confirmed that the White House would be ready if the meeting gets officially back on the books.\n“We are preparing and expect that to take place on June 12th,” she stated. “We're going to continue to shoot for the June 12th.\"",
    "source_domain": "abcnews.go.com",
    "title": "60-40 chance that North Korea summit succeeds: Richardson on Powerhouse Politics",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/60-40-chance-north-korea-summit-succeeds-richardson/story?id=55532067"
}