{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 10:35:39+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "China to cut off North Korean imports under UN sanctions",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fchina-announces-sept-cutoff-north-korean-imports-49201576.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_c85f3ada5cc149859c4d8635ddb8a2b9_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "China announced Monday it will cut off imports of North Korean coal, iron ore and other goods in three weeks under U.N. sanctions imposed over the North's nuclear and missile programs.\nChina, the isolated North's main trading partner, has been reluctant to push leader Kim Jong Un's regime too hard for fear it might collapse. But Beijing is increasingly frustrated with Pyongyang and supported a U.N. Security Council ban on Aug. 5 on coal and other key goods.\nThe Chinese customs agency said it will stop processing imports of North Korean coal, iron and lead ores and fish at midnight on Sept. 5.\n\"After that, entry of these goods will be prohibited,\" said an agency statement.\nThe announcement follows an escalating exchange of angry words between U.S. President Donald Trump and Kim's government. Trump declared the U.S. military \"locked and loaded\" while Pyongyang threatened to fire four missiles into waters near the U.S. territory of Guam.\nThe latest U.N. sanctions are intended to block North Korean exports worth $1 billion — a significant share of total exports valued at $3 billion last year.\nChina stopped importing North Korean coal in February but total trade has risen. That prompted Trump to accuse Beijing in July of failing to use its economic leverage to stop Pyongyang's pursuit of nuclear weapons.\nOther North Korean exports to China also include clothing, knitwear and plastic rain ponchos, which appear not to be affected by the latest sanctions.\nBeijing had long been Pyongyang's only diplomatic defender but agreed in March 2016 to sanctions against the North following its test of a long-range missile.\nStill, Chinese leaders oppose blocking all trade with the impoverished North, which they argue might cause widespread hunger.\nThe Chinese import cut will come the week of Foundation Day on Sept. 9, the North Korean holiday commemorating the founding of the country's government in 1948.\nNorth Korean imports of Chinese oil, consumer goods and other products rose 36.7 percent from a year earlier in the first half of this year to 1.1 billion yuan ($165 million), according to Chinese customs data. Chinese imports from the North fell 7.6 percent in the same period to 611 million yuan ($91 million), squeezing the North's revenue.\n———\nGeneral Administration of Customs of China: www.customs.gov.cn",
    "source_domain": "abcnews.go.com",
    "title": "China to cut off North Korean imports under UN sanctions",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/china-announces-sept-cutoff-north-korean-imports-49201576"
}