{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 20:15:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Hot dog! Eye-catching LA wiener stand finds museum home",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2FwireStory%2Fhot-dog-eye-catching-la-wiener-stand-finds-48040215.json",
    "image_url": "http://abcnews.go.com/Lifestyle/wireStory/hot-dog-eye-catching-la-wiener-stand-finds-48040215",
    "language": "en",
    "localpath": null,
    "maintext": "An eye-catching Los Angeles hot dog stand designed in the 1940s to look like a giant wiener on a bun has found a home a decade after closing.\nThe Tail o' the Pup, which fed working people and Hollywood stars for 60 years, will be moved Thursday for permanent display at Valley Relics Museum, home to many pop culture items. The unique structure, which appeared in TV shows and movies and was named a Los Angeles cultural landmark, has been in a storage yard since its walk-up window shut for the final time in 2005.\nNicole Miller, whose husband Jay's family has owned the Pup since the 1970s, said they'd hoped to find a new location to serve its famous all-beef franks once again, but couldn't secure permits.\nThe family is glad the museum \"is willing to take it, restore it, and put it on display,\" she told the Los Angeles Daily News ( http://bit.ly/2saLuci ).\nThe chicken wire and stucco dog measured 18 feet from nose to tail with a line of mustard running across its service window.\nDesigned by architect Milton Black and opened in 1946, the Tail o' the Pup was built to catch the attention of passing motorists during an era when cars were king.\nIt's a rare surviving example of when giant doughnuts, chili bowls and coffee cups dotted Los Angeles curbs from the 1920s to after World War II, the newspaper said.\n\"The Tail o' the Pup was clearly among the best known of the 'programmatic' buildings — buildings that often looked like products sold inside,\" said Cindy Olnick of the Los Angeles Conservancy, a preservation group. \"The whole building, besides the sign, was an advertisement.\"\n———\nInformation from: (Los Angeles) Daily News, http://www.dailynews.com",
    "source_domain": "abcnews.go.com",
    "title": "Hot dog! Eye-catching LA wiener stand finds museum home",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/wireStory/hot-dog-eye-catching-la-wiener-stand-finds-48040215"
}