{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 02:34:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Poll: Marijuana safer than opioids, but moms shouldn't use",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fpoll-marijuana-safer-opioids-moms-46846834.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_73ba0ff783484f6b90bf592307b79dcf_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Americans think it's safer to use marijuana than opioids to relieve pain, but they were less comfortable with children and pregnant women using pot to treat medical conditions, according to a new Yahoo/Marist poll released Monday.\nTwo-thirds of the respondents in the telephone survey said opioid drugs such as Vicodin or OxyContin are \"riskier\" to use than pot, even when the pain pills are prescribed by a doctor.\nOnly one in five said marijuana was riskier than opioids. The rest weren't sure.\nEvery day, an overdose of prescription opioids or heroin kills 91 people, and legions more are brought back from the brink of death. Some 2 million Americans are thought to be hooked on the pills.\nLast month, President Donald J. Trump appointed an opioid commission to look into the problem.\nMarijuana by itself is not fatal. Doctors technically don't prescribe it for pain or other purposes but most states that allow medical marijuana do require patients to get a doctor's written recommendation to purchase it to treat their conditions.\nAmong those answering the Yahoo/Marist poll, 83 percent said the drug should be legal nationally for medical treatment.\nBut 70 percent said it is not acceptable for pregnant women to use marijuana to reduce nausea or pain. And the survey respondents were about evenly divided on whether marijuana should be recommended for children if it were legal.\nThe survey respondents were deeply divided on how Trump should approach pot: 38 percent said he shouldn't be as tough about enforcing federal laws against recreational pot use as President Barack Obama, whose policy generally was to leave states alone.\nAnother 30 percent said Trump should take a harder line than Obama, while the rest weren't sure or said Trump should treat it about the same as Obama did.\nTrump's administration has sent mixed messages to the 28 states and Washington, D.C., in violation of federal drug law when it comes to pot.\nTrump said as a candidate that states should be allowed to tinker with marijuana laws. But new U.S. Attorney General Jeff Sessions has said marijuana is dangerous and marijuana changes by states should not be allowed.\nThere has been no action yet by the U.S. Justice Department or any other federal agencies to crack down on states violating the Controlled Substances Act, which bans pot for any use.\nThe Yahoo/Marist telephone poll of 1,122 adults was conducted last month and had a margin of error of plus or minus 2.9 percentage points.",
    "source_domain": "abcnews.go.com",
    "title": "Poll: Marijuana safer than opioids, but moms shouldn't use",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/poll-marijuana-safer-opioids-moms-46846834"
}