{
    "authors": [
        "Abc News",
        "More Adam"
    ],
    "date_download": "2017-04-17 20:17:51+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Spicer defends White House policy on visitor logs",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fspicer-defends-white-house-policy-visitor-logs%2Fstory%3Fid%3D46848804.json",
    "image_url": "http://abcnews.go.com/Politics/spicer-defends-white-house-policy-visitor-logs/story?id=46848804",
    "language": "en",
    "localpath": null,
    "maintext": "White House press secretary Sean Spicer today defended the Trump administration's decision to not voluntarily release records of White House visitors to the public, while describing the Obama administration's online posting of those logs as a \"faux\" effort.\nOn Friday, an administration official cited national security concerns in support of the decision to withhold the list while simultaneously touting other efforts that \"ensur[e]... [the] government is both ethical and accessible to the American people.\"\nSpicer explained that the action was in line with the Federal Records Act and Presidential Records Act despite the optics that the move limited transparency.\n\"As was noted on Friday, we were following the same policy that every administration from the beginning of time has used with respect to [the] visitors log,\" said Spicer.\nWhile the White House is not required to release a record of visitors unless requested through a Freedom of Information Act filing (though these requests can still be denied), the Obama administration proactively disclosed the identities of guests on the White House website. The names of some visitors were omitted, however, due to concerns for national security -- a fact used by Spicer to criticize the preceding administration.\n\"The faux attempt that the Obama administration put out where they would scrub who they didn't want put out didn't serve anyone well,\" said Spicer, who deflected follow-up questions on why the White House wouldn't seize the opportunity to expand transparency -- or at least match the Obama White House in this regard -- as President Trump promised during the campaign.\nFacing additional questions on the subject of Trump's tax returns, Spicer reiterated that Trump will not release his tax returns until the IRS completes its \"routine audit.\"\nBut asked by ABC News' Jonathan Karl if it was time to say that Trump would \"never release his tax returns,\" Spicer would not fully commit to the idea.\n\"We'll have to get back to you,\" said Spicer. \"He's still under audit. The statement still stands.\"\nAs to whether the president would be willing to direct the IRS to confirm the audit, Spicer provided no definite answer, saying that Trump's \"view on this has been clear from the campaign and the American people understood it when they elected him in November.\"",
    "source_domain": "abcnews.go.com",
    "title": "Spicer defends White House policy on visitor logs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/spicer-defends-white-house-policy-visitor-logs/story?id=46848804"
}