{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 17:10:52+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "A Look at Some of the 39 People Killed in Istanbul Attack",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2F39-people-killed-istanbul-attack-44511762.json",
    "image_url": "http://abcnews.go.com/International/wireStory/39-people-killed-istanbul-attack-44511762",
    "language": "en",
    "localpath": null,
    "maintext": "At least 39 people were killed and nearly 70 injured in the mass shooting that took place in front of and inside a popular Istanbul nightclub in the first hours of New Year's Day. The victims included citizens of Turkey, Saudi Arabia, Lebanon, Iraq, France, Tunisia, India, Morocco, Jordan, Kuwait, Canada, Israel, Syria, Belgium, Germany and Russia.\nAmong them was a police officer and a security guard employed to keep revelers safe, a tour guide escorting visitors during a night on the town and young adults who had traveled to Turkey for the holidays.\nA look at what is known so far about the victims and their nationalities.\n———\nMehmet Kerim Akyil, 23, had traveled from Belgium to Istanbul for a New Year's vacation. His father, Ali Akyil, told state-run Anadolu news agency that they were a Turkish family who loved their country.\n———\nBulent Sirvan Osman, 38, a married father of two from Erbil, Iraq, was in Istanbul for business, according to Anadolu.\n———\nAbdullah Ahmed Abbolos, a 32-year-old Palestinian living in Saudi Arabia, had come to Istanbul to celebrate the new year, Anadolu reported.\n———\nAbis Rizvi from Mumbai was one of two Indian victims of the attack. The 49-year-old builder wrote, produced and directed a Bollywood movie \"Roar: The Tigers of Sunderbans,\" in 2014 aimed at spreading awareness about tigers.\nThe other Indian victim was named as Khushi Shah, a fashion designer from Vadodara, a city in the western Indian state of Gujarat.\n———\nHatice Karcilar, a 29-year-old private security guard, was among the Turkish victims of the attack, state-run Anadolu news agency reported. She is survived by her husband and a 3-year-old daughter, it said.\n———\nTurkish police officer Burak Yildiz was shot and killed outside the Reina nightclub, Anadolu reported. The 22-year-old from the southern city of Mersin had been on the force for 1? years.\n———\nAyhan Arik, a 47-year-old Turkish travel agent and a father of two, was shot in the head outside the club, reported the private Dogan news agency.\n———\nThe Lebanese Foreign Ministry identified three of its citizens among the dead as Elias Wardini, Rita Shami and Haikal Musalam. The wounded included Bushra El Douaihy, the daughter of parliament member Estephan El Douaihy, it said.\n———\nLeanne Nasser, an 18-year-old Arab-Israeli from the town of Tira, was celebrating with friends when the gunman broke in and opened fire. Ruaa Mansour, also 18, was moderately wounded in the attack. Two other friends were unharmed.\n———\nThe U.S. State Department confirmed that a 35-year-old Delaware businessman originally from Chadds Ford, Pennsylvania, wounded in the attack.\nWilliam Jacob Raak told the Dogan news agency that he was in the club with nine people, seven of whom were shot. Raak suffered a leg wound.\n———\nFrance's foreign minister says one French citizen was killed and three others wounded in the shooting.\nForeign Minister Jean-Marc Ayrault said in a statement that a woman with both French and Tunisian citizenship died in the attack early Sunday. The woman's Tunisian husband also died, he said.\n———\nDubai-based broadcaster Al Arabiya reported that seven people from Saudi Arabia were killed and 10 were wounded in the attack.\n———\nTwo people from Bavaria are among the dead, according to Germany's Foreign Ministry.\nSpokesman Martin Schaefer declined to name them, but said it appeared one was a German-Turkish dual citizen and the other was believed to have had only Turkish nationality. Three German citizens were wounded in the attack, he said.\n———\nJordan's Foreign Ministry said two of its citizens were killed and six were wounded in the attack.\n———\nKuwait's Consul-General Mohammad Fahad al-Mohammad said one Kuwaiti was killed and five others were wounded in the shooting.",
    "source_domain": "abcnews.go.com",
    "title": "A Look at Some of the 39 People Killed in Istanbul Attack",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/39-people-killed-istanbul-attack-44511762"
}