{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-25 00:22:06+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "President Donald Trump had harsh words for Iran but praise for North Korea.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FWNT%2Fvideo%2Ffrench-president-urges-us-stay-iran-nuclear-deal-54705890.json",
    "image_url": "https://s.abcnews.com/images/WNT/180424_wn_karl5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for French president urges the US to stay in the Iran nuclear deal\ntonight, and several moments up close and personal today making headlines around the globe. President trump and the president of France, and their interactions. The trump administration's first state visit, the official welcome at the white house. With a 21-gun salute and full military display. The two presidents, and what they said today about Iran, what president trump said about Kim Jong-un, calling him honorable. Here's ABC's chief white house correspondent Jonathan Karl. Reporter: As soon as the French president and his wife arrived at the white house this morning, the macrons and the trumps seemed determined to show the world how much they like each other. So comfortable together, this happened -- We do have a very special relationship. In fact, I'll get that little piece of dandruff off. Little piece. We have to make him perfect. He is perfect. Reporter: Chumminess aside, president macron came with an agenda. He wants the U.S. To stay in the Iran nuclear deal. Are you willing to consider staying in the Iran deal? We're going to be talking about it. We'll see. Reporter: For all its flaws, the Iran deal has shut down, at least for now, the Iranian nuclear program. But the Iranians say they'll restart their nuclear program if the deal -- We'll find out. You'll find out about that. Reporter: But are you concerned about that? Won't be so easy for them to restart. They're not going to be restarting anything. They're restart it, they'll have big problems. Bigger than they ever had before. Reporter: Later, at a joint press conference that featured another over the top handshake, macron urged the president to stay in the Iran nuclear deal, while negotiating another deal to limit Iran's missile program and support for terrorism. We raised very new issues and very lieu solutions tonight. Reporter: Trump didn't show his cards, but he did repeat his warning to Iran. I will say, if Iran threatens us in any way, they will pay a price like few countries have ever paid. Reporter: The president's harsh words for Iran stood in stark contrast to his praise for North Korea's dictator Kim Jong-un. Over the past year, he's called Kim a madman running a cruel regime. But today, looking ahead to their planned meeting -- Kim Jong-un was -- he really has been very open and I think very honorable from everything we're seeing. Reporter: Nice words aside, the president declared he will insist on complete denuclearization. It means they get rid of their nukes. Very simple. They get rid of their nukes and So, let's get to Jon Karl, live at the white house. Big night at the white house, Jon, this evening. We saw all that warmth on display between president trump and Emmanuel macron. The two first couples walking together on the white house lawn. The president is hosting them tonight at a state dinner? Reporter: It's going to be intimate. Just 13 tables of ten. They'll be eating on the Clinton China. And the guests here include Rupert Murdoch and apple CEO Tim cook, who brought, as his guest, the former Obama EPA director, Lisa Jackson. Jon, one other headline from\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "French president urges the US to stay in the Iran nuclear deal",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/WNT/video/french-president-urges-us-stay-iran-nuclear-deal-54705890"
}