{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 20:27:30+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fdeath-broken-heart-hurt-survivors-54700196.json",
    "image_url": "https://s.abcnews.com/images/Health/WireAP_361db457aea243818ea1a0d865b1604c_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "You hear it whenever someone gets sick or dies soon after losing a spouse: Was it because of a broken heart? Stress might not be to blame for former President George H.W. Bush's hospitalization a day after his wife's funeral, but it does the body no favors, and one partner's health clearly affects the other's.\nA sudden shock can trigger a heart attack or something like it called broken heart syndrome . Some studies also have found that people are more likely to die soon after losing a longtime spouse.\nBut often the timing is mere coincidence, and \"broken heart\" speculation just fuels a neat narrative when the problem is unsurprising in an older person with underlying health issues.\nIn any case, the death of a loved one is a dangerous time for the surviving spouse, said Dr. Nieca Goldberg, a cardiologist at NYU Langone Medical Center and an American Heart Association spokeswoman.\n\"It's really important to have a lot of other support around you,\" she said. \"When people are depressed after something like this happens, they may not be eating, they may ignore symptoms and want to be stoic. They're certainly stressing and may not be getting enough rest. All of these things can set the stage for life-threatening conditions.\"\nABOUT BUSH\nBush, who will turn 94 in June, has been hospitalized since Sunday with sepsis, an infection that spread to his bloodstream, probably from bacteria. It's a serious condition at any age, but he is said to be responding to treatments and recovering.\nStress weakens the immune system and can make infections harder to fend off, said several doctors not involved in his care. But Bush needs a wheelchair because of a form of Parkinson's disease and has been hospitalized before for pneumonia and other infections.\nIt's possible he ignored early signs of infection during the flurry of preparations for Barbara Bush's funeral, said James Giordano, a Georgetown University neurologist and expert on stress's effects on the body.\n\"It could be something as simple as that; inattention led to an escalation of signs and symptoms,\" he said. \"He's old, there's no good way to put it,\" so medical problems and risks are magnified by stress.\nStress has three stages, Giordano said: alarm, when the body releases \"fight or flight\" chemicals that can do damage; a resistance stage, like \"calling out all the troops\" to deal with the stress; and then fatigue or a letdown stage, when some of the body's defenses may crash from the strain.\nEven if a partner's death is anticipated — as Barbara Bush's was after she decided to focus on comfort care — \"facing and going through the reality of the event\" is stressful, he said.\nJUMPING TO CONCLUSIONS\nStress and a broken heart sometimes may get too much blame, though, when people are grieving.\nCountry music star Johnny Cash died four months after his wife, June Carter Cash, did in 2003. She was 73 and died of complications following heart valve surgery. He was 71 when he died of problems related to diabetes and had a neurological disease for years before that.\n\"Broken heart\" was widely speculated when Debbie Reynolds died a day after her actress-daughter, Carrie Fisher, did in 2016. An autopsy later showed that Reynolds, 84, died of a blood vessel that ruptured and caused bleeding in her brain — a kind of stroke. She also had high blood pressure and other serious medical problems for several years before that.\n———\nMarilynn Marchione can be followed on Twitter: @MMarchioneAP\n———\nThis Associated Press series was produced in partnership with the Howard Hughes Medical Institute's Department of Science Education. The AP is solely responsible for all content.",
    "source_domain": "abcnews.go.com",
    "title": "After a death, how much can 'broken heart' hurt survivors?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/death-broken-heart-hurt-survivors-54700196"
}