{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-02-03 01:56:03+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Another 2,000 Kentuckians could lose disability benefits",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2F2000-kentuckians-lose-disability-benefits-52806932.json",
    "image_url": "http://abcnews.go.com/Health/wireStory/2000-kentuckians-lose-disability-benefits-52806932",
    "language": "en",
    "localpath": null,
    "maintext": "Another 1,965 people in eastern Kentucky could lose their federal benefits because of a disgraced attorney who made millions by bribing judges and doctors to OK disability checks for his clients.\nThe Social Security Administration plans to notify nearly 2,000 people in eastern Kentucky that they will have to defend their status in court. All of them are connected to Eric Conn, a flamboyant attorney who billed himself as \"Mr. Social Security\" in television ads before his empire crumbled beneath the weight of a federal investigation. About half of those new cases involve Conn and a convicted former administrative law judge, according to Social Security Administration Acting Press Officer Mark Hinkle.\nHinkle said the new cases were identified by the Office of the Inspector General in November. U.S. Rep. Hal Rogers' office said notifications will go out soon, but in a piecemeal fashion instead of all at once. People affected will have a hearing before an administrative law judge to determine if they can keep their benefits. People will have at least 30 days to gather evidence and hire attorneys. Disability payments will continue throughout the redetermination process.\nThese new batch of cases are in addition to the 1,800 cases associated with Conn's law practice the federal government has already reviewed. Some of them have sued the government seeking to stop those redetermination hearings. That case is pending in federal court.\n\"It is heartbreaking to witness the tragic impact that Eric C. Conn's fraud scheme continues to have on the lives of people living in Eastern Kentucky,\" Rogers said. \"While I appreciate notification from the Social Security Administration, I question the need for additional redetermination hearings while litigation is still pending in the federal court system.\"\nBeginning in May 2015, the federal government suspended benefits for hundreds of eastern Kentuckians associated with Conn, prompting panic in one of the poorest regions of the country heavily dependent on those checks. The government eventually restored those benefits until each person could have a hearing, but not before a few people killed themselves in what family members said was caused by the stress of losing their checks.\nEventually, 1,800 people had their cases reviewed and 1,500 had redetermination hearings. Of those 1,800 initial cases, about 53 percent kept their benefits \"received favorable or partially favorable decisions,\" Hinkle said.\nThose hearings took more than a year to resolve. Nearly all of the people involved could not afford attorneys, prompting a nationwide search for lawyers who could represent them for free. Robert Johns, executive director of AppalRed Legal Aid, said 136 lawyers volunteered, including 59 from Kentucky.\n\"We thought we were done with that,\" Johns said of those initial 1,800 cases. \"We're going to likely be gearing up for the same kind of effort to try to get these (new) folks some help.\"\nConn pleaded guilty to federal charges last year. But just before he was supposed to be sentenced, Conn removed his electronic monitoring bracelet and fled. He led state and federal authorities on a chase for six months before he was captured in December at a Pizza Hut in Honduras. He's now back in custody in Kentucky, where he faces more charges.\nNed Pillersdorf, an eastern Kentucky attorney who has represented several of Conn's former clients, said he worried about the impact this second round of notices will have on the region.\n\"This will hit eastern Kentucky like a nuclear bomb,\" he said.",
    "source_domain": "abcnews.go.com",
    "title": "Another 2,000 Kentuckians could lose disability benefits",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/2000-kentuckians-lose-disability-benefits-52806932"
}