{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 16:41:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "US job openings slip in October, but hiring increased",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fus-job-openings-slip-october-hiring-increased-51718585.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_c269877827664a839e2b83ba22d0328e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. employers posted slightly fewer job openings in October than the previous month, but the number of people being hired improved.\nThe Labor Department said Monday that nearly 6 million jobs were available at the end of October, down from 6.18 million in September. Manufacturers, retailers, wholesalers and the information sector advertised fewer jobs — an indicator of their possible intentions in the coming months.\nBut total hires rose 4.4 percent to 5.55 million. This indicates that even if employers are seeking fewer workers that they're still looking to add staff. Leading sources of increased hiring came from restaurants and hotels, the health care sector, manufacturers and financial services.\nThe government said last week that employers added a net total of 244,000 jobs in October and 228,000 in November. The unemployment rate stayed at 4.1 percent.\nDespite the healthy job market, many people are staying in their jobs rather than departing for new ones. Departures are usually a sign that people are confident they can find new jobs that pay higher wages. The number of quits held steady for a second straight month at 3.18 million. Meanwhile, average hourly earnings have risen just 2.5 percent over the past 12 months, a relatively lackluster figure given the low unemployment rate.",
    "source_domain": "abcnews.go.com",
    "title": "US job openings slip in October, but hiring increased",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/us-job-openings-slip-october-hiring-increased-51718585"
}