{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 07:00:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 00:00:00",
    "description": "Turner's record 5 RBIs drive Dodgers to 9-5 win over D-backs",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fturners-record-rbis-drive-dodgers-win-backs-50339623%3Fyptr%3Dyahoo%3Fsrc%3Drss.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_dbefa31c36e14467ae39e5caaa856d85_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Clayton Kershaw still hasn't figured out how to dominate in October. This time, he couldn't even keep the ball in the yard.\nJustin Turner and the Los Angeles Dodgers made sure it hardly mattered in a strong postseason opener.\nTurner homered and drove in five runs, Kershaw won despite giving up four homers and the Dodgers roared to a 9-5 victory over the Arizona Diamondbacks on Friday night in their NL Division Series opener.\nTurner hit a three-run homer and Yasiel Puig added an RBI double before Los Angeles made its first out against Arizona starter Taijuan Walker, who lasted just one inning in his playoff debut.\nTurner added an RBI single in the fourth and another in the eighth. The red-bearded slugger tied a Dodgers record for most RBIs in a postseason game, sharing it with Pedro Guerrero and Davey Lopes.\nA.J. Pollock, J.D. Martinez, Ketel Marte and Jeff Mathis homered off Kershaw, but Arizona's euphoria from its wild-card victory over Colorado was erased during a rough first inning in Chavez Ravine.\nGame 2 is Saturday night, with Rich Hill facing Robbie Ray and the Diamondbacks in a matchup of left-handers.\nPuig and Corey Seager both tripled and drove in two runs for the 104-win Dodgers, who beat their NL West rivals comfortably even while Kershaw added another weird chapter to his unimpressive playoff history.\nThe three-time Cy Young Award winner gave up only four hits in 6 1/3 innings, but still became the first pitcher in team history to yield four homers in a postseason game. He earned a playoff victory at Dodger Stadium for the first time in his career.\n\"He went and attacked,\" Turner said. \"He's probably not going to be happy with it, but you give up four solo home runs with a lead like that, we'll take that any day.\"\nKershaw struck out seven, but the ace left-hander's frequent inability to match his regular-season brilliance in October remains a constant presence. He struggled with the long ball again after serving up a career-high 23 homers during the regular season, but still earned his fifth victory in 15 postseason starts thanks to teammates who gave him a big cushion.\nAfter leading the majors in wins and earning their fifth consecutive NL West crown, the Dodgers got off to an impressive offensive start in the latest pursuit of their first World Series trip since their 1988 championship. Los Angeles' first five batters reached base, punctuated by Turner's shot and Puig's line-drive double scoring rookie Cody Bellinger.\n\"Felt great to get Kersh a three-run lead in the first,\" Turner said.\nArizona ended a five-year playoff absence Wednesday with a rollicking 11-8 victory over Colorado. Manager Torey Lovullo described that wild-card game as \"one of the most emotional days I've had in my career,\" but that tough game bit the Diamondbacks in Los Angeles when Walker needed 48 pitches to get out of the first inning.\nRobbie Ray was supposed to start this series opener, but was pressed into relief against the Rockies when ace Zack Greinke faltered — and Walker couldn't come through in his place.\nZack Godley pitched five innings of relief, but Turner, Puig and Seager added RBIs in the fourth for a 7-1 lead.\nPollock made his postseason debut with two extra-base hits in the wild-card game, and he added a homer in the third inning for Arizona's first hit off Kershaw.\nWith back-to-back shots by Marte and Mathis in the seventh, Kershaw got chased and became just the eighth pitcher in major league history to give up four homers in a playoff game.\nSeager added an RBI triple in the eighth, and Turner drove him home.\nThe Diamondbacks beat their division rivals six straight times down the stretch, and were one of two teams with a winning record against Los Angeles this season.\nUP NEXT\nHill (12-8) allowed opponents to bat .203 in his first full Dodgers season, showing off veteran guile and pitch versatility while battling blisters. Ray is 3-0 with a 2.27 ERA in five starts against the Dodgers this season.\n———\nMore AP baseball: https://apnews.com/tag/MLBbaseball",
    "source_domain": "abcnews.go.com",
    "title": "Turner's record 5 RBIs drive Dodgers to 9-5 win over D-backs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/turners-record-rbis-drive-dodgers-win-backs-50339623?yptr=yahoo?src=rss"
}