{
    "authors": [
        "Abc News",
        "Michael Rothman",
        "More Candace",
        "More Michael"
    ],
    "date_download": "2018-04-24 22:36:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Mill is grateful, calling the past five months in prison \"a nightmare.\"",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Frapper-meek-mill-released-prison%2Fstory%3Fid%3D54703877.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/meek-mill-court-ap-thg-171117_hpMain_3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It was announced Tuesday that rapper Meek Mill will be released from prison, after having been sentenced late last year to serve two to four years for probation violations, stemming from a decade-old case.\nPhiladelphia 76ers co-owner and close friend of Mill's, Michael Rubin, was the first to announce the news on Instagram. Mill's lawyer later confirmed the news.\n\"@meekmill is FREE!!! Just left visiting Meek with @kevinhart4real and I'm on the way back to pick him up as we speak!\" Rubin wrote Tuesday afternoon.\nThe 30-year-old rapper had been serving time for violating probation, which notables like Kevin Hart and Jay-Z have spoken out against, calling the ruling to jail Mill unjust and part of a larger racial issue. According to The Associated Press, Mill had been on probation for nearly a decade in a drug and gun case that occurred when he was 19.\nMill's lawyer Joe Tacopina also confirmed the release to ABC News in a statement that read, \"We are thrilled that the Pennsylvania Supreme Court has directed Judge [Genece] Brinkley to immediately issue an order releasing Meek on bail. As we have said all along, Meek was unjustly convicted and should not have spent a single day in jail.\"\nRick Diamond/Getty Images, FILE\nTacopina continued, \"Meek is excited to be reunited with his family, and we, along with Meek, intend to continue to shine the light on a justice system in need of reform to prevent any other citizen from being put through what Meek has endured.”\nMill himself also posted to various social media accounts, clearly excited about the prospects of coming home and thanking those who had helped the rapper obtain his release.\n\"I'd like to thank God, my family, my friends, my attorneys, my team at Roc Nation including Jay Z ... my good friend Michael Rubin, my fans, the Pennsylvania Supreme Court and all my public advocates for their love, support and encouragement during this difficult time,\" he wrote. \"While the past five months have been a nightmare, the prayers, visits, calls, letter and rallies have helped me stay positive. To the Philadelphia District Attorney's office, I'm grateful for your commitment to justice -- not only for my case, but for others that have been wrongfully jailed due to police misconduct.\"\n\"Although I'm blessed to have the resources to fight this unjust situation, I understand that many people of color across the country don't have that luxury and I plan to use my platform to shine a light on those issues,\" Mill concluded. \"In the meantime, I plan to work closely with my legal team to overturn this unwarranted conviction and look forward to reuniting with my family and resuming my music career.\"\nAfter the ruling to jail Mill his past November, hundreds of protesters gathered outside Philadelphia's Criminal Justice Center to call for Mill's prison sentence on probation violations to be overturned.\nJacqueline Larma/AP\nRapper Rick Ross and Philadelphia 76ers legend Julius Erving spoke at the event. Jay-Z also penned an opinion piece for the New York Times, titled \"The Criminal Justice System Stalks Black People Like Meek Mill.\"",
    "source_domain": "abcnews.go.com",
    "title": "Rapper Meek Mill to be released from prison",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/Culture/rapper-meek-mill-released-prison/story?id=54703877"
}