{
    "authors": [
        "Abc News",
        "Amanda Maile",
        "More Emily",
        "More Amanda"
    ],
    "date_download": "2018-03-19 19:26:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "The man accused of fleeing to Mexico with a teenage girl has agreed to be extradited to his home state of Pennsylvania, he said in a court appearance in Miami today.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fpennsylvania-man-accused-fleeing-mexico-16-year-girl%2Fstory%3Fid%3D53847911.json",
    "image_url": "https://s.abcnews.com/images/US/kevin-esterly-split-ht-jt-180318_hpMain_5_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The man accused of fleeing to Mexico with a teenage girl has agreed to be extradited to his home state of Pennsylvania, he said in a brief court appearance in Miami today.\nAmy Yu, 16, went missing March 5 with Kevin Esterly, 45, police said, alleging that she left willingly. She has since returned home safely.\nThe two flew from Philadelphia to Cancun that night, police say.\nAllentown Police Department\nYu's mother reported her missing to the Allentown Police Department that day.\nA member of Esterly’s family reported him as missing or endangered March 7, the same day authorities issued an arrest warrant for him and charged him with interference with the custody of children, police said.\nAllentown Police Department\nAn Amber Alert was issued in Mexico for Yu and Saturday the two were found there.\nYu was unharmed and in good health and has since returned to Allentown, the police said.\nU.S. Marshals Service\nMeanwhile, authorities flew Esterly to Miami where he is in custody pending extradition. In the short hearing this morning, Esterly said, “I’d like to go back to Pennsylvania as soon as possible.”\nPennsylvania authorities have 15 days to pick him up.\nCourtesy U.S. Marshals Service\nMiami Dade County County Jail\nEsterly, a father of four daughters, had met the teen at church, and Yu became friends with one of Esterly's children, according to the attorney for Esterly's wife, Stacey Esterly.\nThe Esterlys had been fighting over his alleged relationship with the teen, Stacey Esterly's attorney, John Waldron, told ABC News. Stacey Esterly threatened to go to the police about her husband's alleged sexual relationship with Yu shortly before the two fled, Waldron said.\nWhen Yu was asked by members of the Leigh Country Child Advocacy Center whether she was having a relationship with Esterly, she denied it, said Det. Gary Hammer of the Colonial Regional Police, which has jurisdiction over her school, Lehigh Valley Academy.\nAllentown Police Department\nBut Yu altered her school records and listed Esterly as her stepfather, Hammer added. And at least 10 times between December and Feb. 9, Esterly signed her out of school early, Hammer told ABC News two weeks ago.\nFeb. 9 was the day when the teen’s mother came to the school to pick up her daughter, \"and the school said her stepfather already signed her out of school,\" Hammer said.\n\"The mom explained she is a single mother,\" Hammer said. \"There is no stepfather.\"\nGoogle Maps\nLehigh Valley Academy confirmed that Esterly has been on school grounds before and was last there Feb. 9.\n\"After that date, due to circumstances we cannot disclose pursuant to student privacy constraints, he was prohibited from entering school grounds, and the police were to be notified if he returned,\" the school said in a statement two weeks ago.\nThe school called the Colonial Regional Police immediately and it started investigating. The department found video of Esterly’s signing the teen out and leaving with her, Hammer said.\nABC News' M.L. Nestel contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Pennsylvania man accused of fleeing to Mexico with 16-year-old girl agrees to extradition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/pennsylvania-man-accused-fleeing-mexico-16-year-girl/story?id=53847911"
}