{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 01:23:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Floyd Mayweather: Not deal to fight Conor McGregor, or anyone else",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Ffloyd-mayweather-deal-fight-conor-mcgregor%2Fstory%3Fid%3D45497085.json",
    "image_url": "http://media.video-cdn.espn.com/motion/2017/0214/dm_170214_mma_okamoto_mayweather_mcgregor/dm_170214_mma_okamoto_mayweather_mcgregor_default.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Floyd Mayweather said in an Instagram post on Tuesday that he's made no deal to fight UFC star Conor McGregor, or any other fighter, reiterating that he is happily retired.\nThe post came shortly after UFC President Dana White texted ESPN's Brett Okamoto: \"No deal is even close to being done.\"?\nEarlier Tuesday, ESPN's Stephen A. Smith said he'd spoken with Mayweather on Saturday while both were attending the Warriors- Thunder game in Oklahoma City. Smith said Mayweather told him that \"we're getting very, very close\" to the superfight.\nSources confirmed to Okamoto that McGregor had arrived in Las Vegas on Monday evening. Mayweather lives and trains in Las Vegas.\nPrior to Mayweather's post on Tuesday,?Nevada State Athletic Commission chairman Anthony Marnell had confirmed to ESPN that the commission had been made aware of active negotiations between the two camps, but said the fight still faces several challenges.\nIt's unclear if those negotiations have ended in light of Mayweather's post.\n\"There is a lot of real stuff going on,\" Marnell said. \"It still seems like a long shot, but when there is a lot of money involved, people tend to figure it out. There are a lot of cooks in the kitchen, but I'm not sure if we're going to eat.\n\"The Nevada Athletic Commission, in my experience, has always been well-briefed by all parties on an event or potential event that may take place in Las Vegas. We are aware of conversations and information that has been disclosed and not disclosed in the media. Whether these conversations will get to a point that a fight happens, I can't tell you.\"\nThe two sides have gone back and forth in the headlines for nearly a year, regarding a potential fight.\nMcGregor, 28, is the UFC's lightweight champion and remains under contract. Marnell mentioned that as a wrinkle in any boxing match McGregor wishes to pursue, saying, \"people are under certain contractual obligations that need to get figured out.\"\nMcGregor successfully applied for a boxing license in California in December. He has never boxed professionally. Mayweather, 39, is regarded as one of the best boxers of his era.\nLast month, White publicly offered McGregor and Mayweather $25 million each for the potential boxing match. When told of White's offer by TMZ, Mayweather said, \"He's a f---ing comedian!\"\nMcGregor has demanded $100 million for the fight and said he'd be willing to do it with or without the UFC's involvement. White has promised that won't go well for the star fighter.\n\"It is what it is now,\" White told ESPN last week. \"He came out and said, 'I can do this without them.' I guarantee you, he can't do it without us. What I then said was, 'I've always been respectful of Conor, the things he wants to do and everything else. If he wants to go down that road it will be an epic fall.' Everybody knows exactly what that means.\"\nAccording to Marnell, as expected, the distribution of money from this potential megafight might be the biggest hurdle of all.\n\"I'm confirming that real people are having real discussions,\" Marnell said. \"I'm also telling you my opinion as the Nevada Athletic Commission chairman that a lot of things need to get done in order to see something like this come together because there are so many parties that want to get their hands on the pot.\n\"Maybe it will get figured out, but it's going to be hard when everyone is declaring they want $100 million. That's not what I said -- that's what they've said. That's their quotes, not mine. If everyone wants $100 million, that's a lot of $100 millions to go around.\"",
    "source_domain": "abcnews.go.com",
    "title": "Floyd Mayweather: Not deal to fight Conor McGregor, or anyone else",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/floyd-mayweather-deal-fight-conor-mcgregor/story?id=45497085"
}