{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-14 23:47:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "Father charged in case of severely malnourished Utah boy",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Ffather-charged-case-severely-malnourished-utah-boy-45496275.json",
    "image_url": "http://abcnews.go.com/US/wireStory/father-charged-case-severely-malnourished-utah-boy-45496275",
    "language": "en",
    "localpath": null,
    "maintext": "The father of a 12-year-old Utah boy who was found severely malnourished in a feces-strewn bathroom was charged with child abuse on Tuesday, a month after the child's mother was charged with locking him in the room for about a year.\nThe abuse was discovered after the 40-year-old man brought the boy to a hospital. But prosecutors say he recklessly endangered his son by failing to act before the child's weight dropped to just 30 pounds and delayed getting him medical care for hours after discovering him.\nThe child spent the last two Christmases in the bathroom, listening to family members open presents, prosecutor Angie Reddish-Day said.\nThe man lived at the house in the small southeastern Utah city of Toquerville while the boy was kept in the bathroom, though it's not clear how often he was there, she said.\nThe mother also worked to keep people away who asked about the boy, including his father, Redding-Day said.\nThe Associated Press is not naming either parent to avoid identifying the child.\nThe father is charged with one third-degree felony count. The mother is facing a more serious child abuse charge, and prosecutors say additional charges are expected against her.\nThe boy was found in the bathroom with one blanket, a few empty cans of beans and a camera that may have been used to capture what was going on in the room that was kept dark most of the time, police said.\nThe boy has been recovering in the weeks since he was found and is now in foster care, along with two other children who were in the home. He lost some mobility in his limbs from being confined in the small space for such a long time and has trouble running and walking, Reddish-Day said.\nCourt records show the man filed for divorce about three weeks after his wife was arrested.\nThe man's divorce attorney didn't immediately return a call seeking comment. No lawyer was listed in the criminal case against him.\nThe mother's lawyer, Edward Flint, said she had a \"total mental breakdown\" that left her overwhelmed and unable to care for the boy, who has special needs. He said the father knew more about the situation than the charges imply.\nShe is being held on $20,000 cash-only bail, though Flint has pushed to lower that amount to help build her defense.",
    "source_domain": "abcnews.go.com",
    "title": "Father charged in case of severely malnourished Utah boy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/father-charged-case-severely-malnourished-utah-boy-45496275"
}