{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 10:31:54+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "Cubans now face same deportation risk as other immigrants",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fcubans-now-face-deportation-risk-immigrants-48051084.json",
    "image_url": "http://a.abcnews.com/images/International/WireAP_4313fc0d6f1c4e5293c04a3f02b65ba2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tens of thousands of Cubans living in the U.S. are adapting to a harsh new reality: After enjoying decades of favored status dating back to the Cold War, many of them now face the same deportation risks as any other immigrants.\nThey feel betrayed by former President Barack Obama's administration, which in its waning days stripped away a nearly automatic path to citizenship that had been offered since the 1960s to Cubans who arrived on U.S. soil, even those who showed up without a visa. The change was part of a thaw in relations with Cuba, which also agreed to start accepting the return of more of its people who get deported.\nNow some Cubans have been detained at routine appointments with immigration officials, and many more fear they could be imperiled by old deportation orders or caught up in the increased arrests of non-citizens pursued by President Donald Trump's administration.\n\"I wasn't prepared for any of this. How could I have seen this coming?\" said Maykel Vargas, a Cuban who spent three months in detention after immigration officials took him into custody when he was trying to renew a temporary document. \"I don't know what is going to happen.\"\nAnticipation is mounting about a White House announcement on Cuba planned for Friday and how it may affect business deals and leisure travel. But experts agree that Trump's new policy is not expected to restore previous immigration privileges. Any changes open the possibility that the Cuban government could scale back commitments on migration agreements, including promises to take back deportees.\nVargas, 37, worked as an Uber and Lyft driver to provide for his sister, who is single and pregnant. He said he couldn't afford the $700 required to apply for permanent residency, a much more complex process. He continues fighting deportation after being released Monday with an ankle monitor.\nHermes Vigoa, 46, wasn't even nervous when he showed up at an immigration office in Miami earlier this year to renew a temporary document he needed for his driver's license and car insurance while he completed the permanent-residency process.\nHe arrived in the U.S. two years before Obama canceled the fast-track citizenship system. Cubans still have a path to residency if they find a way to arrive in the U.S. with a visa, but Obama ended the open-arms treatment to curb a recent immigration surge mostly through the Mexico border.\n\"I thought everything was fine until an officer told me, 'You are in limbo' and told my girlfriend to take all my stuff because I was being detained,\" Vigoa said. He was detained for a month before he was released, without explanation, to continue seeking a green card.\nImmigration officials did not respond to requests for information on these cases.\nOfficials say more than 36,000 Cubans currently face deportation orders. About 29,000 are convicted criminals and 7,000 non-criminal immigration violators, according to Immigration and Customs Enforcement.\nTwo other Cubans who were taken into custody last month after being here for decades are getting the attention of elected officials. They arrived as children in the famous Mariel boatlift in 1980, when Cuba's then-President Fidel Castro allowed the departure of anyone who wanted to leave the Communist nation. About 125,000 \"marielitos\" crossed the Florida Straits that year.\nBoth men have criminal convictions but insist they have turned their lives around.\nIn 1984, the nations agreed on a list of 2,746 Cubans who were alleged criminals and could be returned to the island. When the U.S. abandoned the \"wet foot, dry foot\" policy in January, the two nations agreed that the list could be revised to add other Cuban \"marielitos\" who were subject to active deportation orders.\nRudy Blanco was 8 when he was brought from the port of Mariel by his parents in 1980. He now has a family and owns a home-remodeling business in Perry, Florida. But because he was convicted of attempting to sell cocaine in 1998, he wasn't allowed to become a U.S. citizen and instead received an order of deportation by mail in 2005.\nBlanco was allowed to stay as long as he made routine visits to ICE. However, he was arrested on May 9 and is now awaiting deportation. An ICE spokeswoman said only that the agency intends to deport him based on the 2005 order.\nBlanco's wife, Shelly, said that both Florida Sen. Marco Rubio and the family's congressman, Rep. Neal Dunn, have told her they are trying to gather information on the case. Both men are Republicans.\nColorado Gov. John Hickenlooper, a Democrat, pardoned another Cuban immigrant for an armed robbery committed 19 years ago, in an effort to stave off his deportation. Rene Lima-Marin, 38, arrived as a toddler in the boatlift and 20 years later received a deportation order after his conviction.\nApart from the Mariel list, Cuba has agreed to review deportations on a case-by-case basis. Fifty-seven Cubans have been deported since October, while 335 were arrested between Jan. 22 and April 29.\nSusan Eckstein, a sociology professor at Boston University, argues that Cubans' immigration privileges should end to make immigration policy more equitable for all foreign nationals.\n\"I would be very surprised if Trump changes Obama's policy because it is so consistent with his stance on immigration in general,\" she said.",
    "source_domain": "abcnews.go.com",
    "title": "Cubans now face same deportation risk as other immigrants",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/cubans-now-face-deportation-risk-immigrants-48051084"
}