{
    "authors": [
        "Abc News",
        "More Bill"
    ],
    "date_download": "2018-05-30 19:08:17+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "A felony charge of computer tampering was dismissed against former Missouri Gov. Eric Greitens.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fprosecutor-rebukes-missouri-governor-drops-felony-case%2Fstory%3Fid%3D55534453.json",
    "image_url": "https://s.abcnews.com/images/US/eric-greitens-01-as-ap-180530_hpMain_4x3_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A day after Eric Greitens resigned as governor of Missouri, a prosecutor blasted his \"dangerous and false rhetoric against the criminal justice system\" before dismissing a felony charge of computer tampering against him.\nSt. Louis Circuit Attorney Kim Gardner said today that her decision to drop the case against Greitens was based on what is best for the state.\n\"I remain confident that we have the evidence we require to pursue charges against Mr. Greitens, but sometimes pursuing charges is not the right or just thing to do for our city or our state,\" Gardner said during a news conference in St. Louis.\nJulie Smith/The Jefferson City News-Tribune via AP\nShe launched an investigation in January after her office received allegations that the Republican governor illegally used a donor list from his former charity, The Mission Continues, to raise funds for his 2016 gubernatorial run.\nThe investigation led to two felony charges against Greitens, a former Navy SEAL who was elected governor in November 2016. One of the felonies was the computer tampering charge stemming from his alleged use of the donor list, while the other was an invasion of privacy charge for allegedly using partially nude photos of his former mistress to blackmail her into keeping quiet about their affair.\nGreitens has admitted to having the affair with the woman, his former hairdresser, in 2015 before becoming governor. He said the decision to resign was a difficult one but maintained that he's done nothing wrong. His resignation is effective Friday.\n\"I am not perfect, but I have not broken any laws or offense worthy of this treatment,\" Greitens, 44, a married father of two children who ran for governor on a platform of family values, said.\nThe charges against him were the result of a \"witch hunt\" by his political adversaries, he added.\n\"It's clear for the forces that oppose us, there's no end in sight. I cannot allow those forces to continue to cause pain and difficulty to the people that I love,\" he said.\nChristian Gooden/TNS via ZUMA Wire\n\"Contrary to Greitens' past statements, there was no 'witch hunt,' no plans to bring pain to him or his family,\" Gardner said. \"The consequences Mr. Greitens has suffered he brought upon himself by his actions, his statements, his decisions, his ambition and pursuit for power.\"\nGetty Images/Panoramic Images\nThe invasion of privacy charge against Greitens was also dropped earlier this month, just before Greitens was set to go to trial. Since then, Jackson County prosecutor Jean Peters Baker was appointed special prosecutor to consider whether to refile the charge.\nGardner said she could only speak of the computer tampering charge.\n\"Just as I believe that Mr. Greitens' decision to resign is best for our state, I have to consider the totality of the situation,\" Gardner said.\n\"As a prosecutor, my decision must be based on facts, available evidence regardless of the position of the accuser or the power of the accused,\" Gardner said. \"After much conversation with Mr. Greitens' defense attorneys and my team, we have come to an agreement on the felony computer tampering case. I believe the most fair and just way to resolve this situation is to dismiss the computer tampering case.\"\nGardner added: \"If Mr. Greitens were convicted of this charge, it would be unlikely that he would be sentenced to prison given his first-time offender status and the type and level of the charge he faced.\"\nBoth Republican and Democratic lawmakers had asked Greitens to resign. By doing so, he avoids potentially becoming the first Missouri governor to be impeached.\nA House investigatory committee had subpoenaed him to testify next week during a special session on his possible discipline.\nThe investigatory committee had already released two scathing reports against Greitens. The first detailed accusations made by his former mistress, who claimed he threatened and mistreated her. The second report focused on allegations that Greitens wrongfully obtained the charity donor list to fundraise for political purposes.\n\"While I cannot force Mr. Greitens to take personal accountability for his actions, there are things that I can do,\" Gardner said. \"I can reject Mr. Greitens' shameful, divisive personal attacks. I can reject his dangerous and false rhetoric about the criminal justice system and the rule of law. I can clarify for the public that there was no coordinated effort by anyone to target him based upon his politics, rather it was his actions.\"",
    "source_domain": "abcnews.go.com",
    "title": "Prosecutor rebukes former Missouri governor then drops felony case against him",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/prosecutor-rebukes-missouri-governor-drops-felony-case/story?id=55534453"
}