{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 18:15:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Sen. Booker joined \"The View\" to discuss the president's ongoing tensions with U.S. intelligence agencies.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2Ftheview%2Fvideo%2Fsen-cory-booker-talks-future-russia-probes-andrew-53853351.json",
    "image_url": "https://s.abcnews.com/images/theview/180319_view_booker_1125_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Sen. Cory Booker talks future of Russia probes, Andrew McCabe's firing\nThey like you, they like it. They like everybody. Very good to have you here. Good to be here. Maybe you heard us talking this morning about how Lindsey graham, senator graham, said that firing Bob Mueller would be the end of his presidency. You know, the Democrats don't have a lot of power right now. Maybe in November they'll have it but right now they don't. So it's really up to the Republicans to do something. Mitch Mcconnell has been radio silent. Ryan gave a sort of a Luke warm. What's going to happen in your opinion? First of all, understand that the power of the people is greater than the people in power. We all have power right now. How? Expressing moral outrage. Remember the first thing that the Republican congress did before Donald Trump was sworn in was try to pull away independent ethics oversight in the house. It was the outrage of the American. That stopped that from happening. We saw the removal of health care from 40 million Americans, the outrage of the public. Why don't they know that already then? They've seen it happen before. What are they waiting for? I think that Lindsey graham said it right, as well as trey Gowdy, that if Donald Trump was to do something like this, it would cause really I think the unwinding of his presidency. But I'm not willing to wait. I reached out to Lindsey graham. We have a bill that's already had a hearing in the judiciary committee to provide a constructive check on the presidential power to order the removal of a special counsel. So we're trying to take action, but I cannot let the public know that their voice is so important right now, letting Republican congress people, Republican senators know, say hey, let's not tolerate this. Be like trey Gowdy said, let the investigation continue, especially if you have nothing to be afraid of. If you're as innocent as you say, let the investigation continue. Okay. Senator -- Bob Mueller is a long-time Republican but trump tweeted that 13 out of the 17 members were registered Democrats. 6 of them toe natd to Hillary Clinton. Don't you think the opt iks are difficult. I heard \"The New York Times\" question that fact. I've never seen this in any -- in business, when I was the mayor. You just don't see executives heckling and maligning law enforcement the way that this president seems to be comfortable do. And so for him to be active, this is part of a larger pattern of Donald Trump going after the intelligence agencies, the FBI. This is unacceptable in America. You don't think it's fair game if there are Democrats that donated to Hillary? I don't think it's fair game for him to be doing what he's doing which is trying to undermine the integrity of agencies by doing all this picking at them. This is so unpresidential of him, but more importantly, it's exactly what the Russians want, us to be going after our sacred institutions, whether they're the press or the public. What we see right now is a president going after continuously in a vile, vulgar way institutions in our country and people who are trying to serve our nation and keep us safe. Does it concern you if they're leaking though? That's the accusation right now and even for people like me, obviously I've always had the upmost respect for the CIA and FBI but if there's leaking that's a problem. There's an inspector general report that he could have waited for, let the authorities of the process, let the due process happen. Why is he always on Twitter tormenting people, bullying people in ways that we tell children not to do? It's the worst type of behavior, and it's having a consequence on even the dialogue in our country. You saw this with bush, John McCain is somebody who does this all the time, people elevating the dialogue in our country, talking in a more honorable way. This is a guy that for the year-plus he's been in office and even before that, he's demeaning and degrading people, heckling folks and really showing the worst in my opinion of American conversation and not trying to bring it up to a higher level. You just mentioned -- Senator, you just mentioned trump's attacks on the intelligence community. All of this seems to come on the heels of trump firing the former FBI director, Andrew Mccabe, or rather sessions firing him 26 hours before his retirement and his pension. Trump called it a great day for democracy. What would you call it? Well, again, you heard Marco Rubio and other Republicans saying this is, again, the way that Donald Trump is going about this, it does not reflect well on him, on the presidency and our values as a country. I don't know what the inspector general report's going to say but I do know that remember this Twitter tormenting began weeks and weeks ago when he started calling him out without any facts. And going after his wife. And going after his wife and spouse. We cannot let this kind of behavior just continue as if it's Normal in our country. And so this is a very troublesome episode. I want to get to the bottom of it and there's a lot of folks on both sides of the aisle who have called for our own investigation into congress. You're on the senate judiciary committee. Would you be interested in investigating Mccabe's firing? I am very interested in investigating it and it's something I'm going to try to use my office to hold the president accountable which is what we should be doing, checks and balances. Senator, a former CIA director John Brennan and former FBI director James Comey came out on Twitter on Mccabe's firing. Did that fuel the narrative that the FBI is biased, or does this just force their hand because silence would be allowing him to speak truth as if it is truth? . I think you're seeing these independent voices. You saw Mccaffrey, a four-star army general come out and say that Donald Trump himself is a threat to national security. If fdr, when pearl harbor happened, said wait a minute on Tojo, let's investigate this further or said nice things about somebody, Oren hatch called the attacks on us by the Russia Russians, to our grid, our democracy itself, our electoral process, tantamount to a pearl harbor-like attack. We are under attack right now in the cyber sphere by enemies who have the desire to undermine our country. What are we doing about it is this. That's the thing. This is presidential malpractice that he has not sounded the alarms. He's not used the tools that congress gave him in a bipartisan way to hold the Russians accountable. He has a better relationship with Putin than he does Theresa may and other European allies of ours. But wasn't that a red flag the minute he said Obama was bad and Putin was great? I mean, remember that? I mean, it was like, why didn't they turn on him at that moment and say this is already treasonous what you're saying. The fact that they're attacking our electoral grid, probing our vulnerabilities, our adversary can't beat us tank for tank or warship for warship. They're trying to do it in the cyber realm. Something else bothers me about where we're going in politics. We seem to demonize each other so much. You said he's demonizing Barack Obama. And others. More than he's demonizing somebody who's attacking our country. I still remember one of the low points for me watching the Republican primaries was watching my former governor, Chris Christie, get lame basted by other Republican candidates for the sin of hugging Barack Obama. Yeah, I remember. If we demonize each other so much that human contact is something that is considered a betrayal of your tribe so to speak -- it happened to me when John McCain had a cancer diagnosis and came back to the senate floor in a powerful moment and I crossed the aisle on the C-SPAN cameras which mean about 14 Americans saw it, and hugged John McCain. By the time I got home that night, I was going through Twitter and I was getting lambasted from people for hugging John McCain. I feel that I should hug a Republican today. Right here. Mwah.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Sen. Cory Booker talks future of Russia probes, Andrew McCabe's firing",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/theview/video/sen-cory-booker-talks-future-russia-probes-andrew-53853351"
}