{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 12:47:07+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The spring fire in southern Colorado has torched 80,000 acres and destroyed more than 100 homes as more than 60 wildfires are burning in 13 states.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FNews%2Fvideo%2Fheat-wave-west-stokes-fears-raging-wildfires-56359874.json",
    "image_url": "https://s.abcnews.com/images/GMA/180704_gma_carr1_0701_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Heat wave stokes fears of raging wildfires in the West\nAn't wait for that. Thatummer scorcher and those wildfires that are raging out west right now look ae map. At least 63 fires burning in 13 es and with dangerous heat coming, the situation onl get worse. One of those huge fires is bug in caliia's wine country and ABC's W cr is there. Good morning to you. Reporter: Good morng. There are re than 2,000 firefighters wg war on the county here. It ces as fires arexploding everytern STE devouri land and homes no end sight. This morning wiles scorching the western united es. The spring fire raging across southern coloro torching 80,000 acres destrg more than 100 homes, fire IGNIT by an alleged arsonist. E 600 firefightersating thelames doing everything they ca save lives and homes. A security camera captures the ldfire ki one couple's vacation home, a srk remr of nature's fury.63 wildfires nowurning in more th dozen states. All fuel boiling temperatures, strong winds and bone dry conditions. G many in fear of losing everything We're ready to go if wve to. I'm scared. Eporter: Meanwhilen northern California some deciding to stayput. Makinure when ie up in the morning if the house is on firenow I did my St. Reporr: The overall dange spreading far beyond thewest. This fourth of July set to be one of the country'stest in history. Witht in mind we're expecting triple deg heat in californnd since the day is July 4th authorities asking fo residents acrosshis region to be mil of using fireworks because only takes spark start that next big fire. Paula. Important remier, will Carr, thank you. The temperatures are fueling\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Heat wave stokes fears of raging wildfires in the West",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/News/video/heat-wave-west-stokes-fears-raging-wildfires-56359874"
}