{
    "authors": [
        "Abc News",
        "Josh Margolin",
        "Lesley Messer",
        "More Aaron",
        "More Josh",
        "More Lesley"
    ],
    "date_download": "2018-05-30 22:58:52+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "The producer intends to enter a plea of not guilty, his attorney said.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FUS%2Fharvey-weinstein-indicted-rape-criminal-sexual-act-charges%2Fstory%3Fid%3D55545228.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/harvey-weinstein-01-rd-jc-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Harvey Weinstein was indicted Wednesday on charges of rape in the first and third degrees and criminal sex act in the first degree, Manhattan District Attorney Cyrus R. Vance Jr. announced.\nInterested in Harvey Weinstein? Add Harvey Weinstein as an interest to stay up to date on the latest Harvey Weinstein news, video, and analysis from ABC News. Add Interest\nWeinstein, who did not testify before the grand jury, had previously been charged through a criminal complaint that did not require him to enter a plea.\nHis attorney, Benjamin Brafman, has signaled that the producer will plead not guilty at his arraignment.\n“This indictment brings the defendant another step closer to accountability for the crimes of violence with which he is now charged. Our office will try this case not in the press, but in the courtroom where it belongs. The defendant’s recent assault on the integrity of the survivors and the legal process is predictable. We are confident that when the jury hears the evidence, it will reject these attacks out of hand,\" Vance Jr. said in a statement. \"This investigation remains active and ongoing.”\nBrafman noted in a statement that the indictment was not a surprise.\n\"We asked the district attorney for more time so that Mr. Weinstein's attorneys could gather the material needed to properly prepare him for his grand jury testimony but that request was denied. We remind everyone that an indictment is merely a formal accusation,\" he said. \"Mr. Weinstein intends to enter a plea of not guilty and vigorously defend against these unsupported allegations that he strongly denies. We will soon formally move to dismiss the indictment and if this case actually proceeds to trial, we expect Mr. Weinstein to be acquitted.\"\nWeinstein, 66, has been accused by dozens of women of sexual misconduct and has been investigated by the New York City Police Department, the Manhattan District Attorney’s Office, the New York Attorney General’s Office, the Los Angeles Police Department and U.K. authorities. He has denied all allegations of nonconsensual sex.\nLast week, he was arrested, processed and charged with rape, criminal sex act, sex abuse and sexual misconduct for alleged incidents involving two separate women, police said. The criminal sex act charge stems from an allegation brought by Lucia Evans, who told the New Yorker magazine last year that Weinstein forced her to perform oral sex in 2004 during what she thought was a business meeting. The rape charge stems from an allegation by a woman who has not been publicly identified.\nWeinstein is currently free on $1 million bail.\nOn Tuesday, Brafman told reporters that Weinstein had had a 10-year consensual relationship with the woman he has been accused of raping, both before and after the alleged 2013 attack. The revelation came after a 90-minute meeting Brafman had in a New York City judge's chambers with Vance Jr. The judge ordered the transcript of the meeting sealed, so the prosecutors' response is unknown. Brafman also expressed concern that Weinstein might not be able to get a fair trial.\n“One of my concerns is ... some of the publicity that has occurred over the weekend and the ability for people to keep an open mind,\" Brafman told reporters. “I also think that pressure that is being brought to bear on the district attorney’s office -- demanding that an indictment or a prosecution of Mr. Weinstein proceed -- is inappropriate pressure, it is unprecedented and it troubles me, and I wanted to make those matters known to the court.\"",
    "source_domain": "abcnews.go.com",
    "title": "Harvey Weinstein indicted on rape and criminal sexual act charges",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/US/harvey-weinstein-indicted-rape-criminal-sexual-act-charges/story?id=55545228"
}