{
    "authors": [
        "Abc News",
        "James Longman",
        "Bill Hutchinson",
        "More Morgan",
        "More James",
        "More Bill"
    ],
    "date_download": "2018-07-04 16:50:16+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The 12 boys and their soccer coach who remain trapped inside a partly flooded cave in northern Thailand appeared healthy and upbeat in new video released Wednesday.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Fmedics-supplies-reach-boys-soccer-team-trapped-thailand%2Fstory%3Fid%3D56362143.json",
    "image_url": "https://s.abcnews.com/images/International/thailand-cave-boys-ap-1-thg-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The 12 boys and their soccer coach who remain trapped inside a partly flooded cave in northern Thailand appeared healthy and upbeat in new video released Wednesday morning.\nInterested in Thailand Cave Rescue? Add Thailand Cave Rescue as an interest to stay up to date on the latest Thailand Cave Rescue news, video, and analysis from ABC News. Add Interest\nThe footage, taken by the Royal Thai Navy on Tuesday and posted to , shows the boys and their coach wrapped in foil blankets and sitting clustered together in the dark cave, alongside divers and medics who have been looking after the group since locating them. A flashlight illuminates the boys' thin but smiling faces as they take turns talking on camera, each introducing themselves, saying they're in good health and showing signs of gratitude.\nMeanwhile, rescuers are frantically trying to come up with a plan to extract the boys from the depths of the cave as safely, and quickly, as possible.\nThe teammates, between the ages of 11 and 16, hiked into Tham Luang Nang Non, Thailand's longest cave, with their 25-year-old soccer coach after practice on June 23. It's believed that the coach often brought his team to the popular tourist site in mountainous Chiang Rai province for fun excursions.\nBut as the group ventured deeper into the complex, the sky opened up and it began to rain, flooding the cave and cutting off their exit route. The group forged ahead before finding a raised, dry chamber where they were stranded in total darkness.\nThai officials launched a massive search and rescue operation involving more than 1,000 people, including specialists drafted in from various nations such as Australia, China, Japan, the United Kingdom and the United States. The search and rescue teams tried anything they could to locate the boys and their coach -- deploying ultrasonic sensors into the cave, drilling through the rock and dropping survival packages down holes they found above ground in hopes the shafts connect to the cave network below.\nRoyal Thai Navy/AP, FILE\nAfter more than a week, two British cave divers found all 13 alive in an area of the cave that's about half a mile underground and more than a mile from the main entrance. But the trek there was treacherous and took about six hours on Monday.\nThe divers, John Volanthen and Richard Stanton, had to navigate through a labyrinth of caverns and tunnels, both dry and flooded, with some barely wide enough for their diving equipment.\n\"They are cave divers with experience of diving in very flooded caves all over the world and some rescue operations as well,\" Bill Whitehouse, the vice chairman of the British Cave Rescue Council, told ABC News of Volanthen and Stanton. \"They had skills to go in through the flooded passages and lay a guideline for others to follow and clear obstructions to allow people to get through. So, they were the pathfinders.\"\nLinh Pham/Getty Images\nVolanthen and Stanton, who are members of the British Cave Council, described to colleagues the challenging hazards within the cave, including poor visibility, powerful currents in the floodwaters, extremely narrow passageways and one flooded area they said was about 5,000 feet long, half of which had no airspace to emerge if something when awry underwater.\n\"It's not like open water diving where you can just surface if something goes wrong,\" Whitehouse said. \"If you have gone 200 meters down a flooded cave passing, if anything wrong you have to come out that 200 meters before you can put your head up above water.\"\nThai Navy Seal/AP\nWhile they were in relatively good shape, some of the boys complained of being weak from stress and lack of food while others suffered from minor injuries, such as scrapes and cuts. They have received high-protein drinks and medical assessments by the group of Royal Thai Navy members and medics who are staying with them.\nMeanwhile, Thai officials are also working to run a fiber optic phone line into the cave so the boys can speak with their families waiting anxiously outside.\nRoyal Thai Navy/AP\nIt's unclear exactly how and when rescuers will extract the group, and Thai officials have cautioned that it could take \"weeks or months.\"\nCrews have been scouring the region's rugged jungle-covered terrain in hopes of finding a safer way to enter the cave complex underground. They've also attempted to pump water from the flooded areas of the cave, but persistent downpours have hampered their efforts as Thailand enters its rainy season.\nChiang Rai provincial Gov. Narongsak Osatanakorn said the boys have been wearing diving masks and practicing breathing, in case heavy rains forecast for this weekend force the group to swim and dive out the same way rescuers entered.\nABC News' Dada Jovanovic contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Medics, supplies reach boys soccer team trapped in Thailand cave as rescue planning intensifies",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/medics-supplies-reach-boys-soccer-team-trapped-thailand/story?id=56362143"
}