{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-14 22:57:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Mayweather coming back to fight UFC star McGregor Aug. 26",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fmayweather-fight-ufc-star-mcgregor-aug-26-48043942.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/WireAP_779408340e1846abb70cf8b814cba84d_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Floyd Mayweather Jr. and UFC star Conor McGregor will meet Aug. 26 in a boxing match that will feature two of the top-selling fighters in the world.\nThe two fighters both announced the fight Wednesday, after months of speculation about whether Mayweather would come out of retirement at the age of 40 to face a mixed martial arts fighter who has never had a pro boxing match.\nOddsmakers immediately made Mayweather a big 11-1 favorite in a fight that will take place in a boxing ring and be governed by boxing rules.\n\"It's official,\" Mayweather said on Instagram next to a video poster of both fighters.\n\"THE FIGHT IS ON,\" McGregor tweeted several minutes earlier, posting a picture of himself next to one of Mayweather's father, Floyd Sr.\nMayweather, who retired in September 2015 after winning all 49 of his pro fights, will face the Irish UFC superstar at the MGM Grand arena. He had tweeted a picture of himself sparring in recent days to show he was already getting ready for the bout.\n\"This is really an unprecedented event,\" said Stephen Espinoza, who heads Showtime Sports, which will handle the pay-per-view. \"Really we haven't seen anything in modern history that resembles it, it's impossible to predict how many sales this will do.\"\nEspinoza said the fight came together quickly after McGregor and the UFC reached agreement last month on their end of the deal and Mayweather's team pushed for the fight in recent days.\n\"All parties were motivated and reasonable and thrilled we could get everything done,\" he said. \"The sky's the limit on this.\"\nMayweather will fight at the relatively advanced age of 41 in a bout that McGregor has been pushing for months. It finally came together and Nevada boxing officials on Wednesday approved the date for a Mayweather Promotions bout.\nThough oddsmakers make Mayweather a big favorite, the thought of the fight has excited many in the MMA world. It has also intrigued some in boxing, though most dismiss McGregor's chances under boxing rules against one of the greatest defensive fighters in history.\nEven if the actual bout may not shape up as a great matchup, the run-up to the fight will. Both fighters are noted for their ability to sell their fights, and both have exchanged in trash talking and more to promote their bouts.\n\"As with every Mayweather and McGregor fight part of the appeal is the spectacle and outsize personalities who are participating in it,\" Espinoza said.\nThe pay-per-view revenue for the event would likely gross tens of millions of dollars. It comes less than a month before Gennady Golovkin and Canelo Alvarez meet in a highly anticipated fight Sept. 16 that could rival it for pay-per-view buys.\n———\nThis story has been corrected to show that Mayweather is 40 years old, not 41.",
    "source_domain": "abcnews.go.com",
    "title": "Mayweather coming back to fight UFC star McGregor Aug. 26",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/mayweather-fight-ufc-star-mcgregor-aug-26-48043942"
}