{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-31 01:55:51+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fcurrent-lava-flows-hottest-fastest-latest-eruption-55549972.json",
    "image_url": "https://s.abcnews.com/images/Lifestyle/WireAP_18fece11415142d2ae09286b3c7b0639_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The hottest and fastest-moving lava of Kilauea volcano's latest eruption spread across new parts of the Big Island Wednesday, forcing officials to order evacuations in two coastal neighborhoods over fears that the rapidly advancing flows could cut off dwindling escape routes.\nOvernight, the lava was moving fast enough to cover about six football fields an hour, according to U.S. Geological Survey scientist Wendy Stovall.\n\"Hawaii County Civil Defense decided to evacuate all of lower Puna to ensure that people would be able to get out,\" Stovall said.\nLava gushed across and then along a roadway that leads from the commercial center of Pahoa toward smaller towns and rural farmlands to the east.\nAbout two dozen new fissures in that area have created towering lava fountains and bone-rattling explosions throughout the eruption. The lava that is currently coming to the surface is the hottest and most fluid to date.\n\"This is the hottest lava that we've seen in this eruption, even just a matter of 50 degrees centigrade makes a big difference in how quickly lava flows can move and how they behave once the magma exits the vent,\" Stovall said.\nIn fact, the current lava eruptions in Puna are as hot as Hawaii's lava will ever get. \"It can't get hotter than where we are,\" Stovall added. \"We are pretty much tapping mantle temperatures right now.\"\nOne fissure was observed early Wednesday morning spouting lava over 200 feet (61 meters) into the air.\nHawaii County officials said lava destroyed the electric utility's equipment on the highway, which knocked out power to Vacationland and Kapoho Beach Lots.\n\"You are at risk of being isolated due to possible lava inundation,\" the Hawaii County Civil Defense agency advised the public.\nThere were several small earthquakes at Kilauea's summit Wednesday, where the vent inside the volcano's Halemaumau Crater has grown along with a series of explosive eruptions that have sent rock and ash thousands of feet into the sky.\nThe U.S. Geological Survey released drone footage Wednesday of another fast-moving lava flow that trapped a man in Leilani Estates over the weekend. As lava rushed past the property, a USGS crew that was flying the drone used the aircraft to lead rescue teams to the stranded person. The person was safely evacuated from the area.\nHawaii Volcanoes National Park remains closed because of the volcanic activity at the summit and the ongoing eruptions on Kilauea's eastern flanks. Park officials said that crews are working on clearing another roadway on the south side of the park that was covered by lava from previous eruptions. They hope the roadway will provide an alternative escape route if lava cuts off more roads to the north.\nStrands of volcanic glass called as Pele's hair was accumulating on the ground in Leilani Estates and surrounding neighborhoods, and winds may blow lighter particles farther away, scientists said. The strands can cause irritation and respiratory problems when it comes in contact with people.\nVolcanic gas emissions remain high from the eruption. Wind conditions for Wednesday were forecast to result in widespread vog — or volcanic smog— over the Big Island.\n———\nFollow AP's complete coverage of the Hawaii volcano here: https://apnews.com/tag/Kilauea\nFollow AP's Hawaii correspondent Caleb Jones on Twitter: https://twitter.com/CalebAP",
    "source_domain": "abcnews.go.com",
    "title": "Current lava flows are hottest, fastest of latest eruption",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Technology/wireStory/current-lava-flows-hottest-fastest-latest-eruption-55549972"
}