{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-05-30 21:28:31+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Feurope-expects-hit-us-tariffs-steel-aluminum-55543481.json",
    "image_url": "https://s.abcnews.com/images/International/WireAP_eacad99e63694661b36356ab1e57c192_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Europe is bracing for the United States to announce restrictions as early as Thursday on imported steel and aluminum, a move that could provoke retaliatory tariffs and inflame trade tensions.\nTop European officials held last-ditch talks in Paris with American trade officials to try to avert U.S. tariffs on steel and aluminum. But they did not sound optimistic.\n\"Realistically, I do not think we can hope\" to avoid either U.S. tariffs or quotas on steel and aluminum, said Cecilia Malmstrom, the European Union's trade commissioner.\nThe United States in March announced tariffs of 25 percent on steel and 10 percent on aluminum. But it granted an exemption to the EU and other U.S. allies; that reprieve expires Friday.\nEven if the U.S. were to agree to waive the tariffs on imported steel and aluminum, Malmstrom said, \"I expect them nonetheless to want to impose some sort of cap on EU exports.\"\nEuropean officials said they expect the United States to announce its final decision Thursday. U.S. Commerce Secretary Wilbur Ross and U.S. Trade Representative Robert Lighthizer attended meetings at the Organization for Economic Cooperation and Development in Paris that were planned to continue Thursday.\nThe U.S. plan has raised the threat of retaliation from Europe and fears of a global trade war — a prospect that is already weighing on investor confidence and could hinder the global economic upturn.\n\"Unilateral responses and threats over trade war will solve nothing of the serious imbalances in the world trade. Nothing,\" French President Emmanuel Macron said in an impassioned speech at the Organization for Economic Cooperation and Development in Paris.\nIn a clear reference to U.S. President Donald Trump, Macron added: \"These solutions might bring symbolic satisfaction in the short term ... One can think about making voters happy by saying: I have a victory, I'll change the rules, you'll see.\"\nBut he said that those \"who waged bilateral trade wars ... saw an increase in prices and an increase in unemployment.\"\nTariffs on steel imports to the U.S. can help local producers of the metal by making foreign products more expensive. But they can also increase costs more broadly for U.S. manufacturers who cannot source all their steel locally and need to import the raw material. That hurts the companies and can lead to more expensive consumer prices, economists say.\nEurope is expecting a decision from Trump during the day Thursday, French Finance Minister Bruno Le Maire said. He pledged that the European response would be \"united and firm.\"\nIf the U.S. goes ahead with its tariffs, the EU has threatened to impose retaliatory tariffs on U.S. orange juice, peanut butter and other goods in return.\nEU Trade Commissioner Malmstrom tweeted that \"the EU wants to be fully excluded from these tariffs and rather engage in a positive trans-Atlantic trade agenda.\"\nBesides the U.S. steel and aluminum tariffs, the Trump administration is also investigating possible limits on foreign cars in the name of U.S. national security.\nAfter meeting with Ross, German Economy Minister Peter Altmaier told reporters that he doesn't expect a decision soon on foreign cars.\nRoss criticized the EU for its tough negotiating position.\n\"There can be negotiations with or without tariffs in place. There are plenty of tariffs the EU has on us. It's not that we can't talk just because there's tariffs,\" he said. He noted that \"China has not used that as an excuse not to negotiate.\"\nBut Germany's Altmaier insisted that the Europeans were being \"constructive\" and were ready to negotiate special trade arrangements, notably for liquefied natural gas and industrial goods, including cars.\nMacron also proposed to start negotiations between the U.S., the EU, China and Japan to reshape the World Trade Organization to better regulate trade. Discussions could then be expanded to include other countries to agree on changes by the end of the year.\nRoss expressed concern that the Geneva-based World Trade Organization and other organizations are too rigid and slow to adapt to changes in global business.\n\"We would operate within (multilateral) frameworks if we were convinced that people would move quickly,\" he said.\nRoss and Lighthizer seem like the odd men out at this week's gathering at the OECD, an international economic agency that includes the U.S. as a prominent member.\nThe agency issued a report Wednesday saying \"the threat of trade restrictions has begun to adversely affect confidence\" and tariffs \"would negatively influence investment and jobs.\"\nThe OECD also said persistent high oil prices could push up inflation and push down household incomes. After a first-quarter slowdown, the agency slightly revised down its forecast for world growth this year to 3.8 percent, with 3.9 percent expected next year.\n———\nMasha Macpherson and Oleg Cetinic in Paris and Paul Wiseman in Washington contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Europe expects to be hit by US tariffs on steel and aluminum",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/europe-expects-hit-us-tariffs-steel-aluminum-55543481"
}