{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-07-04 19:30:21+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "\"I’m either not curvy enough or not skinny enough to feel insecure,\" she wrote.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Friverdale-star-lily-reinhart-explains-body-dysmorphic-disorder%2Fstory%3Fid%3D56366475.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/Reinhart-gty-er-180704_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"Riverdale\" star Lili Reinhart is trying to help her followers understand body dysmorphic disorder.\nIn a series of tweets, the actress wrote that she was upset by critics who have told her that she has no right to feel self-conscious about her appearance.\nReinhart responded by tweeting: \"I’m either not curvy enough or not skinny enough to feel insecure.\"\n\"Feeling really disheartened by the fact that so many people are saying 'you’re skinny so shut up about embrscing [sic] your body.' As if my body dysmorphia is irrelevant because of how I look to some people,\" she tweeted. \"Mental illness gets worse when people say that you don’t have a right to feel the way you do. That’s where we are dailing [sic]. Do not encourage this behavior. It is destructive. More destructive than you’ll ever realize. You may not understand someone’s insecurity- but respect it.\"\nFeeling really disheartened by the fact that so many people are saying “you’re skinny so shut up about embrscing your body.” As if my body dysmorphia is irrelevant because of how I look to some people. I’m either not curvy enough or not skinny enough to feel insecure. — Lili Reinhart (@lilireinhart) July 4, 2018\nMental illness gets worse when people say that you don’t have a right to feel the way you do. That’s where we are dailing. Do not encourage this behavior. It is destructive. More destructive than you’ll ever realize. You may not understand someone’s insecurity- but respect it. — Lili Reinhart (@lilireinhart) July 4, 2018\nReinhart, 21, revealed her body dysmorphia in an April interview with Seventeen magazine, and she explained it was triggered by \"really bad acne\" that developed when she was in the seventh grade. According to the Mayo Clinic, body dysmorphic disorder is a condition in which a person \"can't stop thinking about one or more perceived defects or flaws in your appearance — a flaw that, to others, is either minor or not observable.\"\nHowever, discussion over Reinhart's appearance didn't stop there. In May, she fought back against body bullies who had analyzed a photo of her and wondered whether she was expecting a baby. \"My body will consistently go through change. And so will yours,\" she wrote on Instagram at the time.\nEarlier this week, after Harper's Bazaar published a quote from her in which she praised Marilyn Monroe's curves (\"To me that’s really inspiring and makes me feel like my body can be accepted,\" she said), Reinhart slammed another Twitter user to questioned her for speaking out on the subject.\n\"Telling someone they don’t deserve to feel insecure because their body is 'fine' or 'just like' whomever.. is wrong. That’s part of the problem. That’s part of body shaming,\" she tweeted. \"I hope this example helps show you a significant problem that’s going on today with young boys and girls. This is why people with mental health issues- depression, eating disorders, body dismirphia [sic]— sometimes don’t get the help they need because they’re shamed into being quiet.\"\nTelling someone they don’t deserve to feel insecure because their body is “fine” or “just like” whomever.. is wrong. That’s part of the problem. That’s part of body shaming. — Lili Reinhart (@lilireinhart) July 3, 2018",
    "source_domain": "abcnews.go.com",
    "title": "'Riverdale' star Lili Reinhart explains body dysmorphic disorder to critics",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/riverdale-star-lily-reinhart-explains-body-dysmorphic-disorder/story?id=56366475"
}