{
    "authors": [
        "Abc News",
        "More Enjoli"
    ],
    "date_download": "2017-08-15 03:08:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Authorities in Ohio said the driver had ignored requests by officers.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fpolice-officer-paid-leave-violent-struggle-traffic-stop%2Fstory%3Fid%3D49207425.json",
    "image_url": "http://a.abcnews.com/images/US/euclid-police-traffic-stop-ht-jef-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A police officer in Euclid, Ohio, is on paid administrative leave as authorities continue to investigate an incident in which he was captured on cellphone video as well as dashcam footage punching a man repeatedly in the head during a traffic stop arrest.\nAccording to a Euclid Police Department media release, around 10:30 a.m. Saturday, officers stopped a 2011 silver Hyundai being driven by Richard Hubbard III because of an alleged traffic violation.\n\"During the process of the traffic stop, police ordered Hubbard out of the car and to face away in order to take Hubbard into custody. Hubbard ignored the order to face away and as the officer attempted to take Hubbard into custody he began physically resisting,\" the release said. \"A violent struggle lasting over three minutes ensued and additional officers were needed to eventually take Hubbard into custody.\"\n2 Georgia police officers fired after videos show man being punched, kicked during traffic stop\nPolice face criticism following eruptions of violence in Charlottesville\nA bystander across the street released cellphone video of the incident Saturday. Afterward, the Euclid Police Department released six-minute dashcam footage taken from the officer's vehicle.\nIn the dashcam video, an officer pulls over the Hyundai and can be heard telling Hubbard that the registered owner of the car shows a suspended license. The officer asks for a license and whether Hubbard has a warrant out for his arrest.\nHubbard appears to protest the traffic stop and a female passenger in the vehicle can be heard telling him, \"Stop arguing.\"\nMoments later, the officer opens the car door and tells Hubbard to exit and face away from him. According to police, that is when Hubbard ignored the order and started to resist. As the officer attempts to arrest Hubbard, the two end up on the ground. A second officer, who was on the passenger side of the vehicle, attempts to help in the arrest.\nIn both the cellphone video and dashcam footage, the arresting officer can be seen punching Hubbard.\nThe female passenger, who was not identified, gets out of the car as well and appears to speak to Hubbard. She later tapes the incident on her phone.\nAccording to the police release, Hubbard was medically examined after his arrest at the Cuyahoga County Jail Euclid Annex. The arresting officer was treated and released from a hospital.\nCuyahoga County\nHubbard posted bond on charges of driving under suspension and resisting arrest. Police said he is due in court Aug. 24. The arresting officer, whom the department did not identify, was put on paid administrative leave pending investigation.\nIn a statement, the Euclid Police Department said: \"It is the mission of the Euclid Police Department to provide professional and transparent service to the residents, business owners, and visitors to the City of Euclid. This entire incident will be reviewed, in detail, so that the public can have a full and open understanding of the series of events that eventually led to this violent encounter.\"\nAnd today, Euclid Mayor Kirsten Gail released a statement to ABC News, saying the City of Euclid and the Euclid Police Department are committed to providing a safe community and to treating \"all justly and with dignity and respect.\"\n\"We have made great strides in building a bond between the community and its police department. Violence and use of force in any situation is disturbing and difficult to watch. The videos of the incident on Saturday morning raise some very serious concerns. We have policies and procedures in place to ensure that all use of force by police are both lawful and justified. I can assure you the incident will be reviewed thoroughly and appropriate action will be taken. We certainly do not want this incident to erase all of the good work that has happened and continues to happen every day in Euclid or to define who we are as a community. We will continue to work with residents, our faith leaders, and community partners to improve our community and ensure Euclid remains a community where we all can be proud to live, work and visit,\" Gail said.",
    "source_domain": "abcnews.go.com",
    "title": "Police officer is on paid leave after 'violent struggle' during traffic stop arrest caught on video",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/police-officer-paid-leave-violent-struggle-traffic-stop/story?id=49207425"
}