{
    "authors": [
        "Abc News",
        "More Lesley"
    ],
    "date_download": "2018-07-04 17:33:17+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "The actress will play a trans man in an upcoming film.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FGMA%2FCulture%2Fscarlett-johansson-faces-backlash-controversial-role%2Fstory%3Fid%3D56364423.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/scarlett-johansson-met-gala-gty-2-thg-180508_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Scarlett Johansson has found herself at the center of a casting controversy yet again.\nAccording to reports, the actress, who was criticized for playing a traditionally Asian character in Rupert Sanders' 2017 film, \"Ghost in the Shell,\" has teamed up with the director again to star as a transgender man in his upcoming film, \"Rub & Tug.\"\nThe Hollywood Reporter writes that the movie centers on the real-life story of Dante “Tex” Gill, who ran a massage parlor and prostitution ring in Pittsburgh in the 1970s and 1980s.\nGill was born Jean Marie Gill, and though it is unclear if he identified as transgender, The Hollywood Reporter noted that an obituary in his local newspaper reported Gill \"[insisted] that she was a man.\"\nWhen asked to respond to those who said a transgender actor should play the part, Johansson's publicist told Bustle on Tuesday: \"Tell them that they can be directed to Jeffrey Tambor, Jared Leto, and Felicity Huffman's reps for comment.\"\nTambor, Leto, and Huffman have all played transgender roles in the past. Tambor won two Emmys for his role in the Amazon series \"Transparent,\" Leto took home an Oscar for his work in \"Dallas Buyers Club,\" and Huffman won a Golden Globe for her performance in \"Transamerica.\"\nA representative for Johansson did not immediately respond to ABC News' request for comment.\nThis is not the first time that Johansson, 33, has had to defend her career choices. Last year, she was criticized for accepting a role in \"Ghost in the Shell,\" a film based on a popular Japanese manga series. Though critics said an Asian actress should play the part, Johansson later told \"Good Morning America\" that she believed the character was \"essentially identity-less.\"\n\"I would never attempt to play a person of a different race, obviously,\" she said.\nAfter news broke that Johansson had been cast in her latest role, many online questioned how a cisgender actor could be the best choice to play Gill.\nApril Reign, the activist who founded the #OscarsSoWhite movement, tweeted that Johansson, who is also a producer of \"Rub & Tug,\" \"is not hurting for money\" and \"doesn't need the increased profile.\" \"So why would she take work away from a trans actor?\" Reign asked.\nScarlett Johannson is not hurting for money. She is in the Marvel Cinematic Universe and is about to get her own film: Black Widow. She is also a well-established actress so she doesn't need the increased profile. So why would she take work away from a trans actor? #OscarsSoWhite — April (@ReignOfApril) July 3, 2018\n\"We've seen male & female actors in the past few years walk away from roles so that a person who could bring a more nuanced experience to the character was allowed to shine,\" Reign continued. \"That is what should happen here. Rub & Tug isn't your movie, ScarJo. No need to monopolize,\" Reign also tweeted.",
    "source_domain": "abcnews.go.com",
    "title": "Scarlett Johansson faces backlash over controversial new role",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/GMA/Culture/scarlett-johansson-faces-backlash-controversial-role/story?id=56364423"
}