{
    "authors": [
        "Abc News",
        "More Joi-Marie"
    ],
    "date_download": "2017-08-14 16:17:43+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Oprah Winfrey opens up about her battle with depression",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2Foprah-winfrey-opens-battle-depression-veil%2Fstory%3Fid%3D49206090.json",
    "image_url": "http://a.abcnews.com/images/Entertainment/oprah-winfrey-gty-mem-170814_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's hard to imagine that a woman like Oprah Winfrey has ever had a down moment, but the TV titan reveals that even she has battled depression.\nShe said she first experienced depression after her film adaptation of Toni Morrison's \"Beloved\" premiered at the box office in 1998. Winfrey not only starred in the box office flop, but also bought the rights to the book and ushered the film's production to the big screen.\n\"I got a call from someone at the studio, and they said, 'It’s over. You got beat by 'Chucky,'\" she recalled in a lengthy interview with Vogue.\n\"And I said, 'Who’s \"Chucky?' What do you mean it’s over? It’s just Saturday morning!'\" she continued. \"I knew nothing about box-office projections or weekend openings...and so began my long plunge into food and depression and suppressing all my feelings.\"\nShe went on, \"I actually started to think, maybe I really am depressed. Because it’s more than 'I feel bad about this.' I felt like I was behind a veil. I felt like what many people had described over the years on my show, and I could never imagine it. What’s depression? Why don’t you just pick yourself up?\"\nWinfrey, 63, said her depression lasted for six weeks.\n\"That’s when the gratitude practice became really strong for me, because it’s hard to remain sad if you’re focused on what you have instead of what you don’t have,\" she explained.\n“ ” It’s more than 'I feel bad about this.' I felt like I was behind a veil.\n\"It taught me to never again, never again, ever, put all of your hopes, expectations, eggs in the basket of box office,\" Winfrey said. \"Do the work as an offering, and then whatever happens, happens.\"\nThese days, Winfrey is selecting projects that are not only critical darlings but also box office hits, from \"The Butler\" to her latest role as Mrs. Which in \"A Wrinkle in Time.\" It also helps that the creator of the OWN Network is also very selective when choosing roles.\nThe only way she'd agree to a role now, she said, is \"if something were to come along and move me to the point that I would be willing to get up and leave here for a period of time.\"",
    "source_domain": "abcnews.go.com",
    "title": "Oprah Winfrey opens up about her battle with depression",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/oprah-winfrey-opens-battle-depression-veil/story?id=49206090"
}