{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-12 00:14:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Business Highlights",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fbusiness-highlights-51727766.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/business-highlights-51727766",
    "language": "en",
    "localpath": null,
    "maintext": "___\nBitcoin futures soar amid frenzy over virtual currency\nNEW YORK (AP) — Wall Street got its first taste of bitcoin on Monday, with the price of the first-ever futures contract for the digital currency jumping 20 percent. It's a step forward for the bitcoin, which has soared this year despite concerns that the surge of investor interest has transformed it from a new-age currency into just the latest speculative bubble.\n———\nTrump to make final pitch for GOP tax plan\nWASHINGTON (AP) — President Donald Trump will make his final pitch for the Republican tax plan in a speech to the American people. The White House says Trump will give a speech Wednesday on how tax reform will help taxpayers and their families. Trump and Republican leaders in Congress have promoted the massive tax plan by promising the tax cuts will boost the economy. The $1.5 trillion House and Senate tax bills combine steep tax cuts for corporations with modest reductions for individuals.\n———\nApple orchestrates deal for song-recognition app Shazam\nSAN FRANCISCO (AP) — Apple has bought Shazam, the maker of a song-recognition app that Apple's digital assistant Siri has already been using to help people identify the music playing on their iPhones. The companies didn't disclose the price of the acquisition announced Monday, but previous reports placed the value at about $400 million. Siri began drawing upon Shazam's technology to answer questions about songs in a 2014 update to the iPhone's operating system.\n———\nSome glitches seen in deadline week for 'Obamacare' sign-ups\nWASHINGTON (AP) — Consumer advocates are reporting some glitches in the final days for \"Obamacare\" sign-ups, but the Trump administration largely seems to be keeping its promise of a smooth enrollment experience. Some HealthCare.gov customers got an incorrect message that no plans were available. President Donald Trump came into office promising to dismantle the Affordable Care Act, but it survived. Now his administration is overseeing the finale to sign-ups. Friday, Dec. 15 is the last day in most states.\n———\nWill misconduct scandals make men wary of women at work?\nNEW YORK (AP) — Some people worry that the same climate that's embolden women to speak out against sexual harassment could make some men wary of female colleagues. The Miami-based owner of a food line says her business involves working mostly with men, and business often ends over lunch or drinks. But Ana Quincoces says those opportunities are dwindling because many of the men she encounters on the job \"are terrified.\"\n———\nZinke, House GOP face criticism over Patagonia attacks\nWASHINGTON (AP) — Interior Secretary Ryan Zinke and House Republicans are escalating their feud with an outdoor retail company that opposes the Trump administration's plan to shrink two sprawling Utah national monuments. The House Natural Resources Committee said in a tweet that clothing giant Patagonia is \"lying\" about Trump's plan in order \"to sell more products to wealthy elitist urban dwellers from New York to San Francisco.\"\n———\nIn tax push, Trump's team uses a dubious growth estimate\nWASHINGTON (AP) — A Treasury memo includes an assumption that tax cuts and other Trump administration policies would cause the economy to expand at a 2.9 percent annual pace over 10 years. Growth at that level would, in theory, keep the national debt from rising. But most independent analyses have concluded that the Senate tax overhaul would add at least $1 trillion to budget deficits in the next decade because they foresee far less growth resulting from the tax cuts.\n———\nWaiting for Congress, Mnuchin makes 2nd emergency debt move\nWASHINGTON (AP) — Treasury Secretary Steven Mnuchin said Monday he is making a second emergency move to keep the government from going above the debt limit while awaiting congressional action to raise the threshold. In a letter to congressional leaders, Mnuchin said he will not be able to fully invest in a large civil service retirement and disability fund. Skipped investments will be restored once the debt limit has been raised, he said.\n———\nUS stocks close modestly higher; S&P 500, Dow hit new highs\nNEW YORK (AP) — Technology companies led U.S. stocks modestly higher Monday, driving the market to another set of milestones. The Standard & Poor's 500 index and Dow Jones industrial average finished at all-time highs. Solid gains by health care companies also helped lift the market, outweighing losses among banks and industrial stocks. Energy stocks rose along with the price of crude oil.\n———\nThe Standard & Poor's 500 index rose 8.49 points, or 0.3 percent, to 2,659.99. The Dow Jones industrial average gained 56.87 points, or 0.2 percent, to 24,386.03. The Nasdaq composite added 35 points, or 0.5 percent, to 6,875.08. The Russell 2000 index of smaller-company stocks slipped 1.88 points, or 0.1 percent, to 1,519.84.\nBenchmark U.S. crude gained 63 cents, or 1.1 percent, to settle at $57.99 per barrel on the New York Mercantile Exchange. Brent crude, the international standard, added $1.29, or 2 percent, to close at $64.69 per barrel in London. Wholesale gasoline picked up 1 cent to $1.73 per gallon, while heating oil gained 2 cents to $1.95 per gallon. Natural gas rose 6 cents, or 2 percent, to $2.83 per 1,000 cubic feet.",
    "source_domain": "abcnews.go.com",
    "title": "Business Highlights",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/business-highlights-51727766"
}