{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 20:15:08+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Raiders, Texans Not First to Start Playoffs With QB Problems",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fraiders-texans-start-playoffs-qb-problems-44514503.json",
    "image_url": "http://abcnews.go.com/Sports/wireStory/raiders-texans-start-playoffs-qb-problems-44514503",
    "language": "en",
    "localpath": null,
    "maintext": "Connor Cook is an untested rookie. Brock Osweiler may have a feeling he's been here before.\nThe Raiders and Texans square off Saturday in a playoff game that might be called The Quarterback Bowl. As in, both these teams are on uncharted roads with their QBs, and neither heads into the week of practice knowing exactly who is going to be taking snaps.\nCook entered for Oakland in Sunday's 24-6 loss against Denver after second-stringer Matt McGloin left with a shoulder injury. If McGloin, who was starting for the already injured Derek Carr, can't go next week, Cook would become the first quarterback in the Super Bowl era to make his first NFL start in a playoff game.\nOsweiler could make his first playoff start, a development that seemed improbable a short year ago when he led the Broncos to the brink of the playoffs. So much has changed. On a roll after taking over for an injured Peyton Manning, he got benched for Manning in Denver's season finale last year, never to return. Osweiler signed with Houston in the offseason, but got benched there, too. And just when the Texans appeared settled on Tom Savage, Savage left Sunday's game with a concussion and Osweiler took over.\nWho goes when the playoffs start?\n\"We'll talk about that tomorrow and the next day,\" coach Bill O'Brien said after Sunday's 24-17 loss to the Titans.\nBy those standards, the Dolphins seem stable, even though Matt Moore is also set to make his first playoff start when Miami travels to Pittsburgh for Sunday's game. Moore took over for the injured Ryan Tannehill in Week 14. He is 2-1 as a starter this year, including Sunday's 35-14 loss to New England.\nSo, while it looks like this season's playoffs will go down as some of the strangest ever in the quarterbacking department, it's hardly the first time. A look at some unusual situations from years past:\nKAEPERNICK REPLACES SMITH: Let's start with a success story. In 2012, 49ers quarterback Alex Smith went down in midseason with a concussion, to be replaced by a not-yet-famous second-year quarterback named Colin Kaepernick. The league hadn't seen a quarterback quite like Kaepernick to that point and it showed. He led the Niners to a 5-2 record down the stretch and into the playoffs on a roll. He ran for 181 yards in his playoff debut and took San Francisco all the way to the Super Bowl, where he joined Joe Montana as the only quarterbacks to pass for 300 yards and rush for 50 in the title game. The Niners lost to Baltimore, and nothing has been the same since. Kaepernick has struggled ever since and Smith is now a (healthy) member of the Kansas City Chiefs, who won the AFC West this year.\nLINDLEY FOR STANTON FOR PALMER: Ryan Lindley spent a good portion of the 2014 season on San Diego's practice squad. The Cardinals, who had originally drafted Lindley in 2012, picked him back up after their top two quarterbacks, Carson Palmer and Drew Stanton, each went down. That left Lindley at the controls for a playoff game against Carolina. It didn't go well. Lindley threw two interceptions in a 27-16 loss. The Panthers allowed 78 yards, the fewest given up in a playoff game. Arizona coach Bruce Arians on his QB's play: \"I thought he did great up until the first interception.\"\nSPEAKING OF PALMER: Though Jon Kitna doesn't get credit for a start in the 2005 playoffs, he played virtually the entire game for Cincinnati. Steelers nose tackle Kimo von Oelhoffen rolled into Palmer's knee on his first pass of the playoffs and knocked him from the game. Kitna took over and threw for 197 yards and two interceptions and the Bengals lost 31-17.\nAND SPEAKING OF HOUSTON: T.J. Yates became the Texans starter in 2011 after both Matt Schaub and Matt Leinart went down. Yates actually led Houston to its first playoff victory, then its first playoff loss the next week. Maybe most significant about that season and those changes is that the Texans haven't had stability at the quarterback position since. Osweiler was supposed to bring that (at a cost of $72 million over for years), but his benching in Week 15 of this year scuttled that plan.\nPEYTON MANNING, A BACKUP: Which brings us full circle. On Jan. 3, 2016, Peyton Manning suited up as a backup quarterback for the first time in his NFL career. That lasted barely more than a half. The Broncos were trailing San Diego 13-7, and though Osweiler wasn't particularly the problem, coach Gary Kubiak went with his gut and inserted Manning . The Broncos rallied for a win, got home-field advantage in the playoffs and Manning was no longer the backup. He led the Broncos to the title, and Osweiler moved on to Houston.\n———\nFor more NFL coverage: http://www.pro32.ap.org and http://www.twitter.com/AP—NFL",
    "source_domain": "abcnews.go.com",
    "title": "Raiders, Texans Not First to Start Playoffs With QB Problems",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/raiders-texans-start-playoffs-qb-problems-44514503"
}