{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2017-12-11 23:34:45+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Commuters were walking in the underground passageway when the explosion erupted.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fsurveillance-video-captures-explosion-york-city-subway-system%2Fstory%3Fid%3D51723506.json",
    "image_url": "http://a.abcnews.com/images/US/port-authority-explosion14-ht-mem-171211_9x13_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Surveillance video caught the dramatic moment an explosive device was detonated in the New York City subway system during this morning's rush hour, sending panicked commuters scrambling to evacuate.\nInterested in New York? Add New York as an interest to stay up to date on the latest New York news, video, and analysis from ABC News. Add Interest\nThe video shows commuters walking in the underground passageway near the Port Authority Bus Terminal when the explosion erupts. The camera screen filled with smoke as people fled for safety.\nAs the smoke clears, the suspect is seen lying on the ground.\nThe 27-year-old suspect, Akayed Ullah, is in the hospital, badly injured in the arm and torso from the device that went off in his arms, sources said. Ullah, originally from Bangladesh, told authorities he is self-inspired from ISIS online propaganda, sources said.\nAndres Kudacki/AP\nChristina Bethea, 29, told ABC News she was in the passageway on her way to work when she heard a bang, saw smoke and ran.\nDespite the crowds, only five people suffered minor injuries, officials said.\nJason Szenes/EPA\nBryan R. Smith/AFP/Getty Images\nNew York Gov. Andrew Cuomo called the explosion “one of our worst nightmares.” New York City Mayor Bill de Blasio called it an \"attempted terrorist attack.\"\nCuomo said on CNN that the homemade device only partially detonated, explaining that the bomb was in a pipe that itself did not explode.",
    "source_domain": "abcnews.go.com",
    "title": "Surveillance video captures explosion in New York City subway system",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/surveillance-video-captures-explosion-york-city-subway-system/story?id=51723506"
}