{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 08:49:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Mexican immigrant 'dreamer' in Seattle sues US over arrest",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fmexican-immigrant-dreamer-seattle-sues-us-arrest-45503011.json",
    "image_url": "http://abcnews.go.com/US/wireStory/mexican-immigrant-dreamer-seattle-sues-us-arrest-45503011",
    "language": "en",
    "localpath": null,
    "maintext": "A Seattle-area man who was brought to the U.S. illegally as a child but was protected from deportation under a policy by President Barack Obama is suing the federal government over his arrest and detention last week.\nU.S. Immigration and Customs Enforcement agents arrested 23-year-old Daniel Ramirez Medina on Friday at his father's home. Agents were there to arrest his father and took Ramirez into custody even though he has a work permit under Obama's Deferred Action for Childhood Arrivals program, court documents said.\nICE spokeswoman Rose Richeson said in a statement that Ramirez told agents he was a gang member and based on those statements and being a \"risk to public safety,\" he was taken into custody.\nMark Rosenbaum, one of Ramirez's lawyers, responded that Ramirez \"unequivocally denies being in a gang\" and that the statement from Richeson is inaccurate.\n\"While in custody, he was repeatedly pressured by U.S. Immigration and Customs Enforcement agents to falsely admit affiliation,\" Rosenbaum said.\nNorthwest Immigrants Rights Project Legal Director Matt Adams told The Associated Press that Ramirez — who was brought to the U.S. from Mexico when he was 7 — has a job, a young son and no criminal record. Ramirez is being held in Tacoma, Washington.\nAdams said Ramirez is the first person he knows of with DACA status who has been detained.\n\"This appears to be a complete one-off,\" Adams said. \"We certainly haven't seen this with our other hundreds of clients who have DACA status as well.\"\nAttorneys for Ramirez argue the arrest violates his constitutional rights to live and work in this country without the fear of arrest and deportation so long as he satisfies DACA requirements.\n\"Trust in our government depends upon the Executive Branch keeping its word,\" Rosenbaum, director of Public Counsel's Opportunity Under Law Project, said in a statement. \"Bait and switch sullies the integrity of our nation's core values.\"\nEmily Langlie, a spokeswoman for the US attorney's office in Seattle, said Tuesday afternoon it would be premature to comment on the lawsuit. A hearing in the case has been scheduled for Friday in federal court in Seattle.\nRecent sweeps by U.S. immigration agents across multiple states have netted some immigrants with no criminal records, a departure from enforcement actions in the last decade. Under the Obama administration, agents focused more narrowly on individuals who posed a security or public safety threat.\nPresident Donald Trump made illegal immigration a cornerstone of his campaign, saying he will build a wall along the Mexican border and deport millions of people, although actual plans have yet to be revealed. He has said he wants to focus on people who have committed crimes.\nDuring an interview with Time magazine late last year, Trump expressed sympathy for the more than 740,000 people in the DACA program, which started in 2012.\n\"We're going to work something out that's going to make people happy and proud,\" he told the magazine.\nTrump can withdraw the promised protection right away through an \"operational memo\" because Obama implemented it through one, William Stock, president of the American Immigration Lawyers Association, said previously.\nAdams said he believes Ramirez was apprehended by mistake.\n\"I don't think this has to do with any change in policy; I just think it was an enforcement procedure gone wrong,\" Adams said. \"Hopefully they're going to come to their senses.\"",
    "source_domain": "abcnews.go.com",
    "title": "Mexican immigrant 'dreamer' in Seattle sues US over arrest",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/mexican-immigrant-dreamer-seattle-sues-us-arrest-45503011"
}