{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 11:22:16+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Fedmunds-rounds-latest-full-size-pickups-56359644.json",
    "image_url": "https://abcnews.go.com/Business/wireStory/edmunds-rounds-latest-full-size-pickups-56359644",
    "language": "en",
    "localpath": null,
    "maintext": "The 2019 model year marks the start of a new cycle for some of America's top trucks, led by redesigned pickups from Chevrolet and Ram. Ford's top-selling F-150 had updates in 2018, and more may be in the offing for 2019. Typically, Japanese truckmakers Nissan and Toyota aren't far behind with their own updates. Edmunds breaks down what you need to know about today's crop of full-size pickups.\n2019 CHEVROLET SILVERADO\nArriving at dealers in the fall, the 2019 Chevrolet Silverado features a ground-up redesign that results in a longer, lighter pickup. Weight savings of around 450 pounds should pay dividends for fuel economy and acceleration.\nThe new Silverado offers a taller driving position and more room in crew-cab models. It also has the largest cargo box in its class and a power-lowering and -raising tailgate that's exclusive to the class.\nThe Silverado offers a variety of engines: a V6 (285 horsepower), a V8 (355 horsepower), a larger and stronger V8 (420 horsepower), and a turbocharged four-cylinder (310 horsepower). A six-cylinder diesel arrives in early 2019.\nThe Silverado's mechanical twin, the GMC Sierra, is also new and goes on sale in the fall. The 2019 Sierra will offer a more upscale interior than the Chevy, along with other exclusive features such as a carbon-fiber cargo box and enhanced technology. The MSRP for a 2019 Silverado crew cab ranges from $34,600 to $53,000.\n2018 FORD F-150\nPerennially the top-selling vehicle in America, the F-150 reigns supreme among full-size trucks. Multiple trims and configurations, four engine options, and remarkable capabilities make the F-150 a benchmark. Engines include a new base-level 3.3-liter V6 (290 horsepower), along with two turbo V6 options (325 horsepower or 375 horsepower), a V8 (395 horsepower) and a new diesel V6 (250 horsepower).\nWith towing capacity of up to 13,200 pounds and up to 25 mpg combined city/highway fuel economy, there's not much the F-150 can't do. There's even the bonkers 450-horsepower Raptor edition that can traverse broad swaths of off-road terrain without breaking a sweat. The MSRP for a 2018 F-150 crew cab ranges from $34,245 to $60,850. The 2019 F-150 is expected to be released later this summer.\n2018 NISSAN TITAN\nBuilt in Mississippi, the Titan is nearly as American as its domestic rivals despite its Japanese origins. The current Titan was redesigned for 2017 with a bold new look and a new XD model that splits the difference between the capabilities of regular half-ton and heavy-duty pickups. The Titan offers a single 390-horsepower V8 engine and can tow up to 9,740 pounds. The XD version comes with the same V8 or an optional diesel V8 that helps the truck tow up to 12,640 pounds.\nThe Titan's not our first choice among full-size pickups, but it's roomy and comfortable and it delivers legitimate capability at an attractive price. The MSRP for a 2018 Nissan Titan crew cab ranges from $35,930 to $56,800. The 2019 Nissan Titan arrives this fall.\n2019 RAM 1500\nRam shook up the truck world a decade ago with a new rear suspension design that delivered sedan-like ride comfort without sacrificing capability. A refined, comfortable cabin and advanced tech features made its rivals look like archaic work trucks almost overnight. The rivals have since caught up, but the new Ram, thoroughly overhauled for 2019 and now on sale, continues to innovate.\nA new frame and body design yield more room for rear passengers and reduce weight by about 200 pounds. The Ram's V8 engine (395 horsepower) returns with a revamped eight-speed transmission that makes more timely shifts. There's also a 3.6-liter V6 base engine that will be paired up with an electric-assist system for smoother power and acceleration and a maximum tow capacity of 12,750 pounds. Redesigned front seats, new technology features and an optional 12-inch infotainment display add to the Ram's winning streak of refinement. The MSRP for a 2019 Ram 1500 crew cab ranges from $34,495 to $56,495.\n2018 TOYOTA TUNDRA\nThe Tundra has gone the longest of any in this group without a full redesign. It's still plenty capable, offering two V8 engines (310 horsepower and 381 horsepower), two body styles and three bed lengths. It can tow up to 10,200 pounds, carry a 1,730-pound payload and handle itself well off-road. The Tundra also is built in the U.S.\nThe aging Tundra could benefit from a diesel engine (increased towing strength), a smaller turbocharged V6 (better fuel economy) and a thorough technology update. Still, the Tundra has a charm for certain truck buyers. The MSRP for a 2018 Toyota Tundra crew cab ranges from $35,450 to $50,330. The 2019 model arrives in the fall.\nEDMUNDS SAYS: With new designs from Chevrolet and Ram and further refinements to the venerable F-150, it's a great time for full-size truck shoppers. Most pickups offer similar capabilities, so look for such qualities as comfort and innovative technology to make a difference.\n————\nThis story was provided to The Associated Press by the automotive website Edmunds. Dan Frio is a staff writer at Edmunds. Twitter: @danfrio; Instagram: danfrio\nRelated links:\n— Video: 2019 Ram 1500 First Drive https://bit.ly/2N6jlxm\n— Video: Diesel or Gas? Two F-150s Face Off https://bit.ly/2KteVid\n— Video: 2019 Chevrolet Silverado Unveil https://bit.ly/2KgcIe0\n— Truck Tech: A Look at the Coolest Newest Pickup Truck Technology https://edmu.in/2MtRupB",
    "source_domain": "abcnews.go.com",
    "title": "Edmunds rounds up latest full-size pickups",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Business/wireStory/edmunds-rounds-latest-full-size-pickups-56359644"
}