{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-07-04 19:30:15+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:00:00",
    "description": "ABC News' Joohee Cho is on the ground in Thailand as rescue workers try to save the 12 boys and their soccer coach.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FInternational%2Fvideo%2Frescuers-racing-clock-save-soccer-team-trapped-cave-56368456.json",
    "image_url": "https://s.abcnews.com/images/International/180704_vod_orig_joohee_thailand_cave_MIX_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Rescuers racing against the clock to save soccer team trapped in cave\nI'm to retail for ABC news in northern Thailand near the border with Myanmar where authorities are trying to rescue twelve boys from a case. Now we heard from the boys today we have fresh video Bayliss saying there are healthy on camera there will wrapped up in foil blanket. To get an idea of how far they are how deep they are into big game it's about three miles from the entrance to where they are. Their fingers in between the divers would go underwater they would come out again they're going through it come out again. Now up to the third chambers about two miles and the unit that it's not that bad to dive up to bear but. It's haven't sliced from the thirteen for it to where they are at that's another mile along with. Very narrow passage ways. They're trying to. Installed fiber optic in it lying and communication is very important so that these parents to talk to the boys. They tried to do that yesterday they failed to and they were trying to do it again today. Also the boys are being trained to Wear diving masks and three under water the problem is none of them know how to swim. Out right here is where the parents are waiting for good news about the boy. We are trying to talk to them but still authorities are keeping the media away. From. Families. Out lots of players here today we so local school children and from this church and this school of goods to the same. That's going turns with the bush some of the boys indicate Ayers thing has found himself a local not. Who brought these parents out of this house two Kate intends to offer his prayers as well. The weather here has been nice looking he had hot and dry so that helps to Jane flooded waters out of its cage. Now the weather for cats in two days there's rain so it's a race against the clock. Go all out here crossing fingers. So that this collective effort to see those boys would end up with a happy.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Rescuers racing against the clock to save soccer team trapped in cave",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/International/video/rescuers-racing-clock-save-soccer-team-trapped-cave-56368456"
}