{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-08-14 18:38:42+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Trump mocks exec for quitting advisory council over racism",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ftrump-mocks-exec-quitting-advisory-council-racism-49210572.json",
    "image_url": "http://a.abcnews.com/images/Business/WireAP_e958dfbd596044a58fc2a79f65e2664a_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump lashed out at the CEO of the nation's third-largest pharmaceutical company after he resigned from a federal advisory council, citing the president's failure to immediately and explicitly rebuke the white nationalists who marched in Charlottesville, Virginia.\nBy early afternoon, the president did issue a direct condemnation of hate groups, but it did not appear to tamp down criticism that it was not done over the weekend when fringe groups clashed with protesters.\nMerck CEO Kenneth Frazier wrote on Twitter Monday that \"America's leaders must honor our fundamental values by clearly rejecting expressions of hatred, bigotry and group supremacy, which runs counter to the American ideal that all people are created equal.\"\nFrazier is one of the few African Americans to head a Fortune 500 company.\nTrump mocked the executive almost immediately following the resignation, saying on Twitter that Frazier will now \"have more time to LOWER RIPOFF DRUG PRICES!\"\nDrugmakers have come under withering criticism for soaring prices in the U.S., including by Trump, though he has yet to act on a promise to contain them.\nWith the barb, Trump appeared to attack an industry executive who has tried to make drug pricing somewhat more transparent by revealing his company's overall drug price changes.\nIn January, Merck reported that its average net prices — the amount the company receives after discounts and other rebates — increased in the years since 2010 in a range between 3.4 percent and 6.2 percent. That's about half as large as the increase in its retail prices.\nThe exchange lit up social media on Monday, with many people lauding Frazier and blasting the president.\nOther corporate executives aired support for Frazier as well.\nUnilever CEO Paul Polman wrote on Twitter, \"Thanks @Merck Ken Frazier for strong leadership to stand up for the moral values that made this country what it is.\"\nFrazier, who grew up in a poor neighborhood in Philadelphia, resigned days after one person was killed and others wounded in violent clashes between white supremacists and protesters.\nFrazier and his siblings were raised by their janitor father after their mother died when he was very young. He has earned a reputation as a risk taker in the drug industry, pouring money into daunting research areas, particularly trying to develop a treatment for Alzheimer's disease.\nFrazier is not the first executive to resign from advisory councils serving Trump.\nTesla CEO Elon Musk resigned from the manufacturing council in June, and two other advisory groups to the president, after the U.S. withdrawal from the Paris climate agreement. Walt Disney Co. Chairman and CEO Bob Iger resigned for the same reason from the President's Strategic and Policy Forum, which Trump established to advise him on how government policy impacts economic growth and job creation.\nThe manufacturing jobs council had 28 members initially, but it has shrunk since it was formed earlier this year as executives retire, are replaced, or, as with Frazier and Musk, resign.\nWilliam Galston, a senior fellow at the Brookings Institution, said he couldn't \"think of a parallel example\" of any president responding as viciously as Trump to a CEO departing an advisory council.\n\"Usually, certain niceties are observed to smooth over a rupture,\" said Galston, who served as a domestic policy aide in the Clinton administration.\n\"We've learned that as president, Mr. Trump is behaving exactly as he did as a candidate,\" Galston said. \"He knows only one mode: When attacked, hit back harder.\"\n———\nAP Economics Writer Josh Boak in Washington contributed to this story.\n———\nFollow Linda A. Johnson at https://twitter.com/LindaJ—onPharma",
    "source_domain": "abcnews.go.com",
    "title": "Trump mocks exec for quitting advisory council over racism",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/trump-mocks-exec-quitting-advisory-council-racism-49210572"
}