{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 14:33:50+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "Family members who lost loved ones at Sandy Hook Elementary School speak out five years after later as they work together to prevent future acts of gun violence.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fyears-tragedy-family-members-sandy-hook-shooting-victims-51710240.json",
    "image_url": "http://a.abcnews.com/images/GMA/171211_gma_stephanopoulos4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for 5 years after tragedy, family members of Sandy Hook shooting victims work for change\nIt has been five years since that unspeakable tragedy in Newtown, Connecticut. You remember sandy hook elementary school. A gunman killed 20 children, six adults. That is the scene and, Amy, you reported from there that whole horrific week. You recently went back and spoke with many familys affected. I was nervous about this assignment. I was concerned about how I would feel sitting down with the people who had lost something that they none of us could imagine. Their children. What that could be like. I was so affected covering the story when it happened but I walked away feeling so inspired by those people who have turned an unimaginable tragedy into an incredible mission. Who can forget the mind-numbing horror of Newtown, Connecticut. It is certainly so difficult here in Newtown. Reporter: The sandy hook elementary school where 20 young children and 6 adults were murdered five years ago this week, the mass shooting we hoped would be the last. I can't imagine your reaction when you turn on the news and you see another one. I have made a very deliberate decision to invest every fiber of my being into trying to prevent that from happening again. Reporter: Mark lost his son Daniel that day. He called him his special little buddy. My one little Daniel in his life affected so many people in a positive way but in his murder has affected I can't even tell you. Reporter: While some parents and groups made sandy hook a battle cry for gun reform and an assault weapons ban, Barden co-founded the sandy hook promise, a foundation whose goal is to prevent shootings and violence in school at its root. We are training people, students, parents, teachers, how to recognize the warning signs that people give off before they hurt themself. Before they hurt somebody else. Can everyone in the back room hear me. Reporter: Students are learning different ways to reach out to each other. Nice to meet you. Reporter: And make sure no one is isolated or alone. A remarkable and sometimes even joyful lesson, born from a national tragedy. Several loved ones from sandy hook have made it their mission. We know that these acts of violence are preventable and we feel responsible to teach people how to prevent them from happening. Reporter: Nicole Hockley lost her son Dylan who she calls her butterfly. Being autistic, he would flap his airports up and down whenever he got excited which was pretty much all the time and I asked him once why do you flap? And he said because I'm awe beautiful butterfly. Reporter: Also killed five years ago bill Sherlock's wife Mary, the school psychologist. And in Mary's honor you are trying to prevent this from happening. We've already done it. There's been a number of school shootings that we know we've thwarted. I imagine you probably think what would Mary think if she saw all of this. I hope she would be very proud. We have have been given a whole lot of lemons and we're just making a whole lot of lemonade and doing everything we can to hopefully make her proud ofus, yeah. Reporter: The sandy hook promise has a new eye-opening psa which looks at seeing the signs before a shooting. It is not a comfortable piece to watch. But you know what, gun violence isn't comfortable. ??? So I'm giving it all I got ??? Reporter: Also to commemorate the fifth anniversary of sandy hook Sheryl crow has written and recorded a very special song to honor those lost. ??? Beautiful inside ??? Reporter: With a message for those left behind to keep going. For Dylan else always keep going and to ensure that more mops and dads out there can continue to hug their kids every single night for the rest of their lives I will keep going. ??? Boy, you are right. They are defining inspiration.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "5 years after tragedy, family members of Sandy Hook shooting victims work for change",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/years-tragedy-family-members-sandy-hook-shooting-victims-51710240"
}