{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-12-11 17:34:40+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "No. 2 Oklahoma leads with 3 1st-team AP All-Americans",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Foklahoma-leads-1st-team-ap-americans-51720160.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_074b76a08d4f4b19b1f00132c2eee92e_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "No. 2 Oklahoma will bring three All-Americans to the College Football Playoff.\nQuarterback Baker Mayfield, offensive tackle Orlando Brown and tight end Mark Andrews of Oklahoma were selected to the Associated Press All-America team, giving the Sooners more players on the first team than any school. The All-America team, which dates to 1925 and was selected this season by a panel of 17 Top 25 voters, was released Monday.\nFour of the top five vote-getters for the Heisman Trophy made the first team, including the runaway winner Mayfield. Stanford's Bryce Love, the Heisman runner-up, and San Diego State's Rashaad Penny, the nation's leading rusher and fifth-place finisher for the Heisman, were the first-team running backs. Penn State's Saquon Barkley, who finished fourth in the Heisman voting, made the team as an all-purpose player.\nLouisville's Lamar Jackson, last year's Heisman winner and All-America quarterback, was selected to the second team.\n———\nALL-AMERICA POINTS\n— The other three playoff teams each have one player on the first team, all on the defensive side. No. 3 Georgia, which faces Oklahoma in the Rose Bowl semifinal on Jan. 1, is represented by linebacker Roquan Smith. No. 1 Clemson placed defensive end Clelin Ferrell on the first team. Alabama safety Minkah Fitzpatrick is the only player to make first-team All-America for the second straight season. The Tigers face the fourth-ranked Crimson Tide in the Sugar Bowl semifinal on Jan. 1.\n— Notre Dame (offensive linemen Mike McGlinchey and Quenton Nelson), Ohio State (center Billy Price and cornerback Denzel Ward), Iowa (linebacker Josey Jewell and cornerback Josh Jackson) and Texas (safety DeShon Elliott and punter Michael Dickson) each have two players on the first team.\n— Clemson had the most players selected to all three teams with six. Defensive tackle Christian Wilkins, linebacker Dorian O'Daniel and offensive tackle Mitch Hyatt made the second team. Defensive end Austin Bryant and guard Tyrone Crowder were third-team picks.\n— Wisconsin placed five players on the three teams, led by linebacker T.J. Edwards on the first team. Running back Jonathan Taylor and tight Troy Fumagalli made the second team and offensive linemen David Edwards and Beau Benzschawel made the third team.\n— Oklahoma had four picks overall with linebacker Ogbonnia Okoronkwo making the second team.\nMOVING UP\n— Four of the five All-America offensive linemen made either second- or third-team last year. Brown and Price moved up from second to first. McGlinchey and Nelson went from third to first.\n— Mayfield also jumped from third team to first team. He was selected to the second team in 2015.\n— Dickson and Barkley also made the third team last year and moved up to first this season, though Barkley was a third-team running back last year.\nMOVING DOWN\n— Jackson was not the only 2016 All-American to slide this season. Washington State guard Cody O'Connell went from first team to second team. Utah punter Mitch Wishnowsky went from first to third.\nCONFERENCE CALL\nFirst-team All-Americans by conference:\nBig Ten — 7\nBig 12 — 6\nPac-12 — 3\nSEC — 3\nACC — 2\nIndependent — 2\nAmerican — 1\nMountain West — 1\n———\nAll-Americans, all three teams, by conference:\nSEC — 15\nACC — 14\nBig Ten — 13\nBig 12 — 12\nPac-12 — 11\nMountain West — 3\nAmerican — 2\nC-USA — 2\nIndependent — 2\nMAC — 1\n———\nFollow Ralph D. Russo at www.Twitter.com/ralphDrussoAP\n———\nMore AP college football: http://collegefootball.ap.org and http://www.twitter.com/AP—Top25",
    "source_domain": "abcnews.go.com",
    "title": "No. 2 Oklahoma leads with 3 1st-team AP All-Americans",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/oklahoma-leads-1st-team-ap-americans-51720160"
}