{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-07 00:46:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Once in a century hat trick history made in NHL openers",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fcentury-hat-trick-history-made-nhl-openers-50326836%3Fsrc%3Drss.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_e704bb7d69614b939ef49102a8611984_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The hats were flying at a historic pace on the first two nights of the NHL season.\nConnor McDavid, Alex Ovechkin, Wayne Simmonds and Brandon Saad each recorded a hat trick in his team's season opener. It's the first time four different players scored at least three goals in his season opener in 100 years, since the NHL's first two games back in 1917 when hockey was a very different game.\n\"Other than it was a puck and three periods and you were keeping score, there was really no similarities,\" author and historian Liam Maguire said. \"You had goaltenders who were basically wearing cardboard, you had no red line, you had the rules in terms of how you could pass a puck up the ice. The guys would routinely play 50 or 55 out of 60 minutes, so it wasn't like you had systems or backchecking or anything.\"\nThat was reality when Joe Malone of the Montreal Canadiens, Harry Hyland of the Montreal Wanderers, Cy Denneny of the Ottawa Senators and Reg Noble of the Toronto Arenas each scored three-plus goals in the first two games in NHL history on Dec. 19, 1917. All four are Hockey Hall of Famers and were alive more than 100 years before McDavid was born.\nWhen McDavid, Ovechkin, Simmonds and Saad got their hat tricks this week, they came against well-thought-out defenses and goaltenders with real pads. The same goes for Auston Matthews, who scored four goals in his NHL debut a year ago.\nOvechkin's hat trick that led the Washington Capitals to a 5-4 shootout victory at Ottawa on Thursday was the 18th of his career, most among active players and tied for 20th-most all time. It was also Ovechkin's quickest succession of three goals in his career as he got them all in a span of 6:33 in the third period.\n\"It's insane,\" former teammate and current Canadiens defenseman Karl Alzner said. \"The thing that doesn't surprise me (from playing with him) is how he can do it in bunches like that, just out of nowhere.\"\nReigning MVP McDavid was clocked skating at a speed of over 25 mph during his second goal on the way to his second career hat trick at age 20. Edmonton Oilers coach Todd McLellan said McDavid \"doesn't go from first to second to third to fourth gear. He just goes from first to fourth and he's gone.\"\nThe hat tricks by McDavid and Simmonds were the first in franchise history for the Oilers and Philadelphia Flyers, respectively, in a season opener. Saad's hat trick in a 10-1 drubbing of the Stanley Cup champion Pittsburgh Penguins was the first by a Chicago Blackhawks player in a season opener since Hockey Hall of Famer Bobby Hull in 1965.\nMcDavid and Saad were showered with hats on home ice, a tradition that dates to the 1940s. Author and historian Eric Zweig said it started with Blackhawks player Alex Kaleta, who went into Sammy Taft's hat shop in Toronto in 1946, admired a hat, scored three goals that night and was presented with it.\n\"It sort of became a thing after that,\" Zweig said.\nBut Zweig and Maguire agreed that the term hat trick actually originated in cricket in the 1800s for when someone bowled three successive wickets and got a hat. It became part of the hockey lexicon for three consecutive goals in the early 20th century and has morphed in meaning.\n\"That time, it had to be three straight goals (scored by) one player,\" Maguire said. \"Natural hat trick, as we call it today. No interruption at all. Over time, the term as we now refer to it is just three goals in the game in any way, shape or form other than the shootout.\"\n———\nFollow Hockey Writer Stephen Whyno on Twitter at http://www.twitter.com/SWhyno\n———\nFor more AP NHL coverage: https://apnews.com/tag/NHLhockey\n———\nThis story has been corrected to show Malone played for the Montreal Canadiens.",
    "source_domain": "abcnews.go.com",
    "title": "Once in a century hat trick history made in NHL openers",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/century-hat-trick-history-made-nhl-openers-50326836?src=rss"
}