{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 21:17:04+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Ffacebook-newell-brands-skid-orbotech-climbs-53858742.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/facebook-newell-brands-skid-orbotech-climbs-53858742",
    "language": "en",
    "localpath": null,
    "maintext": "Stocks that moved substantially or traded heavily Monday:\nFacebook Inc., down $12.53 to $172.56\nThe social media company faced new criticism after reports a data mining firm working for the Trump campaign improperly obtained and then kept data on tens of millions of users.\nCACI International Inc., down $11.85 to $145.60\nThe defense contractor offered to buy CSRA for $7.2 billion, challenging a deal between CSRA and General Dynamics.\nOrbotech Ltd., up $4.09 to $63.99\nKLA-Tencor agreed to buy the company, which makes equipment for electronics manufacturers, for about $1.88 billion.\nStewart Information Services Corp., up $1.89 to $42.61\nThe title insurance and real estate services company said it will be bought by Fidelity National Financial for about $1.2 billion.\nGGP Inc., down 20 cents to $21.52\nReuters reported that Brookfield Property Partners made a new offer for the shopping mall operator.\nUniversal Display Corp., down $15 to $109\nBloomberg News reported that Apple is designing and making display screens and may stop buying them from other companies.\nNewell Brands Inc., down $1.87 to $26.79\nThe consumer products company announced a deal with activist investor Carl Icahn, who will nominate four directors to its board.\nAlphabet Inc., down $34.35 to $1,100.07\nTechnology companies fared worse than the rest of the market Monday.",
    "source_domain": "abcnews.go.com",
    "title": "Facebook and Newell Brands skid while Orbotech climbs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/facebook-newell-brands-skid-orbotech-climbs-53858742"
}