{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-20 08:04:42+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fegypt-election-el-sissi-imposes-stability-democracy-53867445.json",
    "image_url": "https://s.abcnews.com/images/Politics/WireAP_a85e86fab085471c88ed7f5e0d0999c1_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The sole candidate running against Egyptian President Abdel-Fattah el-Sissi has had two showcase campaign rallies in downtown Cairo. The first was a disaster. No one showed up except a few campaign workers.\nThe second, on March 11, was a slight improvement: 30 people attended. They held banners and chanted slogans, though the chants weren't exactly resounding victory cries for their candidate, an almost unknown politician named Moussa Mustafa Moussa.\n\"Whether Moussa wins or el-Sissi wins, either is our president!\" they shouted.\nThere is no question the general-turned-president el-Sissi will win a second four-year term. But the March 26-28 election will likely be remembered as the event that signaled Egypt's break with the little pretense it had left of democratic rule, seven years after a popular uprising toppled autocrat Hosni Mubarak in the name of democracy.\nThe election was preceded by a purge of would-be opposing candidates that was unprecedented even in comparison to Mubarak's nearly 30-year rule. Authorities also clamped down on the media, even egging the public to report to the police anyone they feel is depicting the country in a bad light.\nThe question raised by many observers is why such extreme measures were taken to ensure a vote that el-Sissi would probably win anyway. El-Sissi seems convinced that a genuinely contested election could destabilize the country, allow his Islamist foes a back door into politics or interfere with his high-octane, single-handed drive to revive the battered economy.\nEl-Sissi was first elected in a 2014 landslide, riding on popularity after, as army chief, he led the military's ouster of Islamist President Mohammed Morsi. He kept much of that popularity while ferociously cracking down on Islamists and secular dissenters.\nHe has insisted stability must take priority over freedoms as he carried out multiple, large-scale infrastructure projects and implemented painful austerity reforms. With those reforms, el-Sissi has succeeded in bringing some life back to the economy, though at the cost of inflation that has badly hurt many in the impoverished population. El-Sissi has also made a name for himself on the international stage as a champion against Islamic militancy.\nAfter the election, el-Sissi and his supporters will very likely try to get rid of the constitution's two term limit on the presidency, said Paul Salem, a senior Middle East expert from the Washington-based Middle East Institute.\n\"It might be the view of el-Sissi and his administration that this is needed for stability for economic and security reasons,\" Salem told The Associated Press.\n\"My own personal view is that this buys stability for the short term but makes any transfer of power which has to happen sooner or later much more difficult,\" Salem added.\nMoussa, an ardent el-Sissi supporter, entered the race at the last minute to prevent the embarrassment of a one-candidate election. An extremely polite contestant, he has avoided sounding eager to win, never criticizes el-Sissi and in fact often praises him.\nEl-Sissi hasn't bothered to campaign in person. Instead, the streets of Cairo and other cities have been swamped in a tidal wave of billboards, banners and posters with his image declaring: \"He is the hope.\"\nA decent turnout is the one thing left to give the vote a measure of respectability. El-Sissi's supporters have organized rallies urging the public to vote. Pro-government media proclaim that voting is a religious duty and failing to do so is \"high treason.\" Moussa's supporters chanted at his rally that would-be boycotters are traitors and cowards.\nIn a speech Monday, el-Sissi urged everyone to vote, \"whatever your political choices and opinions.\" Laughing, he told the crowd, \"I love you, go out and vote.\"\nImad Hussein, the pro-el-Sissi editor of Al-Shorouk newspaper, criticized the handling of the election, not because the field of candidates was engineered but because it wasn't done smoothly.\n\"We, of course, hoped to have a genuinely contested election,\" he wrote last month. \"But since we don't have that, the government was supposed to at least prepare the stage to make it look democratic.\"\nThe methodical elimination of opponents suggested el-Sissi felt a vulnerability — particularly to a candidate rooted in the military who could exploit possible cracks in his popularity, whether over pain from economic reforms, resentment over crackdowns or frustration over continued militant violence.\nSeveral candidates dropped out, citing intimidation and harassment. But the harshest treatment was dealt out to two former generals: former military chief of staff Maj. Gen. Sami Annan and former air force general Ahmed Shafiq.\nThe candidacy of Annan \"would have created a conflict that would impact on the 'holy' unity of the armed forces and push into the open files that can only remain secret,\" analyst Abdel-Azeem Hamad wrote in a Feb. 22 column. Annan was the second-highest figure in the military's supreme council that ruled Egypt for more than a year after Mubarak's fall.\nThe 70-year-old Annan was an unquestioned member of the \"deep state,\" ensuring the military, police and other key institutions would not oppose his presidency, one of his top campaign aides, Hisham Genena, said in an interview last month.\n\"This blend of civilians and military men caused the regime to panic,\" he said, alluding to Annan's choice of him and a left-wing university professor as his top aides.\nAnnan struck a progressive tone in his short-lived candidacy. In a January video announcing his run, he lamented encroachments on freedoms and Egyptians' suffering under el-Sissi's economic reforms, and he called on the military to remain neutral in the voting.\nOver the next three days, top military brass — including Egypt's former military ruler, Field Marshal Mohammed Tantawi — tried to dissuade Annan from running, Genena said.\nAnnan brushed them off. Finally, authorities moved: on Jan. 23, he was grabbed from his car by masked men on a Cairo highway.\nHe has been detained ever since at a military prison, facing charges of incitement against the military, forgery and failing to secure clearance from the military to run for president.\nSenior security officials said Annan had been under surveillance for months and was directly advised not to run, to maintain the military's image as united without rival loyalties.\n\"He was fully aware of the consequences that awaited him ... The warnings were crystal clear,\" said one of the officials, who spoke on condition of anonymity because they were not authorized to brief the media.\nAs he went to file an appeal against Annan's arrest, Genena was beaten up by thugs his lawyers contend were sent by the police. Genena was later arrested after he claimed in a TV interview that Annan had documents incriminating Egypt's leadership.\nAnnan is now under pressure to accept house arrest and silence in exchange for the dropping of all charges, according to a person with first-hand knowledge of the case. So far he has refused, but \"they are bringing up all sorts of allegations\" to push him into it, said the person, who spoke to the AP on condition of anonymity for the same reason as the security officials.\nIn the case of Shafiq, authorities were likely worried not just by his military credentials. Mubarak's last prime minister, Shafiq ran in the 2012 presidential elections, seen as Egypt's freest vote, finishing a close second to Morsi.\nShafiq lived in the United Arab Emirates since that election.\nHe announced his intention to run again in a Nov. 29 video. The Emiratis, close allies of el-Sissi, promptly arrested him and deported him to Egypt. At Cairo's airport, he was whisked away by security agents, interrogated and confined under guard at a hotel, his phone confiscated, the security officials said.\nOver the next days, senior security officials pressed him to drop out of the race, according to the officials. Pro-government media launched a high-intensity campaign to discredit him, threatening that past corruption cases against him would be revived and hinting at exposure of alleged sexual indiscretions.\nShafiq buckled, announcing his withdrawal on Jan. 7. He has not been seen since — effectively under house arrest, the officials said.\nAnnan and Shafiq posed particular problems for el-Sissi. They would have offered safe bets for voters seeking change but wary of parting company with the military, which many Egyptians still respect as a protector of stability and which produced all but two of Egypt's presidents since the dawn of the republic in the 1950s.\nBut more worrisome, the tumultuous events of recent weeks fueled speculation about possible fissures within the military, which prides itself on iron-clad unity and secrecy.\nIt is not known whether Annan or Shafiq's challenges to el-Sissi had any support among senior officers. But other developments have also raised question marks, such as unexplained dismissals in past months of the military's chief of staff and the head of the General Intelligence Directorate, Egypt's version of the CIA, who also hails from the military.\nGovernment-controlled media have briefly mentioned conflicts among security and intelligence agencies, which are traditionally headed by men of military background, and there have been unconfirmed reports of top generals being quietly sidelined.\nFurther fueling speculation, el-Sissi in a recent speech angrily lashed out at unspecified opponents. \"By God, the price of Egypt's stability and security is my life and the life of the army,\" he warned, directing an intense gaze at Defense Minister Sidki Sobhi, seated to his left. \"I am not a politician who just talks,\" he added.\nMichael W. Hanna, an Egypt expert from New York's Century Foundation, believes el-Sissi's fury was chiefly directed at rivals inside the military.\n\"The regime is super sensitive,\" he said, \"but it may also be facing internal tensions and rivalries that are seeping out into the public domain.\"",
    "source_domain": "abcnews.go.com",
    "title": "In Egypt election, el-Sissi imposes stability over democracy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/egypt-election-el-sissi-imposes-stability-democracy-53867445"
}