{
    "authors": [
        "Abc News",
        "More Luis"
    ],
    "date_download": "2018-02-03 01:33:32+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "Pentagon seeks 2 new submarine-launched nukes",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fpentagon-seeks-submarine-launched-nukes%2Fstory%3Fid%3D52808376.json",
    "image_url": "http://a.abcnews.com/images/Politics/AP-MinuteManMissile-02-jrl-161223_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Pentagon's new Nuclear Posture Review calls for the development of two new submarine-launched missiles with low-yield nuclear warheads that could serve as a deterrent to Russia's modernization of its inventory of 2,000 tactical weapons.\nDeveloped over the last year, the new report acknowledges the changes around the world since the previous 2010 review that had as a goal the eventual reduction of America’s nuclear weapons arsenal.\nThat report also saw Russia as a partner in de-nuclearization efforts, but the new Nuclear Posture Review (NPR) reflects the complicated reality of America’s relationships with Russia, China and North Korea.\nWhile nuclear weapons reduction remains a long-term goal, it also addresses a gap in deterrence strategy towards Russia, which is undergoing an intense modernization of its low-yield nuclear weapons systems, a development that has led the Pentagon to determine that Russian nuclear strategy now does not discount the first use of such low-yield nuclear weapons on the battlefield.\nCharles Dharapak/AP\nThe new NPR makes the point that Russia appears to have made a calculus that these types of tactical nuclear weapons could actually be used on a European battlefield without drawing a large scale American nuclear response.\nOver the last decade Russia has modernized an inventory of tactical nuclear weapons like air-to-surface missiles, short range ballistic missiles, gravity bombs, depth charges and anti-aircraft missiles and torpedoes.\nOver that time the United States has not modernized or reduced its inventory of such weapons.\nTo respond to that gap with Russia the NPR calls for the U.S. to reconfigure a small number of submarine-launched intercontinental ballistic missiles (ICBMs) into low-yield nuclear weapons, with nuclear explosive yields smaller than the atomic bomb dropped by the United States on Hiroshima.\nIt also calls for the long-term development of submarine-launched cruise missiles with low-yield warheads, a weapons program phased out by the 2010 review.\nA focus of the new NPR is the “tailored” response to scenarios posed by Russia, China, North Korea and Iran.\nA \"one size fits all\" approach has its limits,” said Deputy Secretary of Defense Patrick Shanahan at a Pentagon news conference. “This NPR ensures we can deter any potential adversary, because they are not all alike.”\nThat point was also reinforced by John Rood, the Pentagon’s top policy adviser, who stated repeatedly today that there is no “automaticity” to a scenario that a possible nuclear response is always going to depend on the context at hand.\n“The United States does not want to use nuclear weapons,” said Shanahan. “We do want to maintain an effective deterrent to keep Americans and our allies and partners safe and secure.”\nA draft version of the NPR leaked several weeks ago drew criticism from arms control experts who said the development of the new low-yield weapons would lower the threshold for a nuclear weapons escalation.\nBut Rood and other officials countered that it would have the opposite effect.\n\"The capabilities and the type of approach that we're pursuing is intended to raise the nuclear threshold by making the type of punishment that we could employ against an attack on the United States so high that it would not be countenanced by an adversary,\" said Rood.\nThe NPR also addresses a tailored response to the growing North Korean nuclear missile threat to the United States that it says \"may now be only months away\".\nKCNA VIA Reuters, FILE\n“Our deterrence strategy for North Korea makes clear that any North Korean nuclear attack against the United States or its allies and partners is unacceptable and will result in the end of that regime,\" says the report.\n\"There is no scenario in which the Kim [Jong Un] regime could employ nuclear weapons and survive,\" it added.\nThe NPR and Pentagon officials made the point that America’s missile defense system has the capability to intercept and defeat North Korea’s ability to conduct effective missile strikes.",
    "source_domain": "abcnews.go.com",
    "title": "Pentagon seeks 2 new submarine-launched nukes",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/pentagon-seeks-submarine-launched-nukes/story?id=52808376"
}