{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 07:11:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "APNewsBreak: Ex-VA exec says he wasn't told hospital cost",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Fapnewsbreak-va-exec-told-hospital-cost-48049917.json",
    "image_url": "http://a.abcnews.com/images/Health/WireAP_5fa82484616645649aa7e5050f6d03d3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A former Veterans Affairs Department executive who was harshly criticized by Congress for massive cost overruns at a new Colorado VA medical center said he was never told the price had ballooned to more than $1.7 billion before he left the agency, and does not know how it happened.\n\"I'm just astounded, quite frankly, I'm absolutely astounded,\" Glenn Haggstrom told The Associated Press in a rare interview.\nHaggstrom, who was the VA's top construction official when the project nearly collapsed amid legal disputes and skyrocketing costs, said the last estimate he heard from the builder before he was removed from the project was about $890 million.\nHaggstrom said had been made a scapegoat, and that responsibility for the failures was widespread within the agency. But he acknowledged that he had a role because he was director of the VA's Office of Acquisition, Logistics and Construction.\n\"As the leader of that organization you do bear the responsibility,\" said Haggstrom, who retired in March 2015 amid an internal VA investigation into the costs.\nThe medical center, under construction in the Denver suburb of Aurora, has been a monumental embarrassment for the VA.\nThe initial construction contract was awarded in 2010 with a projected cost around $590 million. But after years of disputes among the VA, the contractor and the design team, an independent government panel called the Civilian Board of Contract Appeals ruled in December 2014 that the VA had violated the contract by not giving the builders, the Kiewit-Turner joint venture, a design that could be built within budget.\nThe VA then asked the Army Corps of Engineers to estimate the cost, and the answer, delivered in March 2015, was a staggering $1.73 billion. The Corps took over management of the project, and the medical center is expected to be completed next year for about $1.7 billion.\nMultiple investigations concluded the costs got out of hand because the VA did not oversee the project closely enough, did not assign enough officials to it, approved lavish design elements, failed to get the designers and builders to agree on the design and tried to use a complicated form of construction contract that agency executives did not fully understand.\nThe VA's inspector general, an internal watchdog, said last year that Haggstrom knew the project was veering toward huge cost overruns but didn't tell lawmakers when he testified before Congress in 2013 and 2014. That prompted lawmakers to call for a perjury investigation, but the Justice Department decided last month not to file charges, citing insufficient evidence.\nHaggstrom told the AP he had been given conflicting information about the project.\nHe said cost projections kept rising, and the highest estimate he saw from Kiewit-Turner was about $890 million. He said the VA removed him from the project before the Corps of Engineers compiled its estimate.\n\"This thing is a moving target,\" he said.\nKiewit-Turner spokesman Tom Janssen said the Civilian Board of Contract Appeals clearly faulted the VA for the problems. He quoted from the board's decision: \"We find that the behavior of the VA has not comported with the standards of good faith and fair dealing required by law.\"\nHaggstrom said the architectural and engineering team had repeatedly assured him it could be built within budget. The architects and engineers, a group of four companies known as the Joint Venture Team, said it had done what the contract required.\n\"The JVT worked diligently to ensure the project was designed to meet the standards set ... within the budget and on time,\" spokesman Andy Boian said.\nHaggstrom declined to identify any other VA officials he thought shared the responsibility for the problems.\n\"I'm not going to pin this on anybody because this was a decision that was made by the department,\" he said.\nHaggstrom said he decided to retire because the members of the panel conducting the internal VA inquiry, called an administrative investigation board, did not have skills to sort out what happened.\n\"I didn't want to be a part of that process,\" he said.\nHaggstrom said a high-ranking VA official had been pressuring him to retire for weeks, but he declined to say who it was.\nThe investigation board's report, obtained by the AP through an open records request, echoed many criticisms of previous reviews.\nNo one has been fired or criminally charged over the project, angering members of Congress. Lawmakers were incensed when Haggstrom retired with full benefits, but the VA said he was legally entitled to do so.\nCongress this week passed a bill designed to make it easier for the VA to fire employees and allowing the department to reduce an employee's pension for negligence or mismanaging funds — in part a response to the Colorado project.\nLast year, Congress stripped the VA of the authority to manage large construction projects and turned it over to the Corps of Engineers, also a reaction to the Colorado project.\nHaggstrom said some VA employees were unfairly criticized for the failures when they were trying to get the project completed, and they made numerous cost-cutting suggestions, most of which were rejected by higher-ups.\n\"They're being vilified for it,\" he said.\n———\nFollow Dan Elliott at http://twitter.com/DanElliottAP . His work can be found at https://apnews.com/search/dan%20elliott.",
    "source_domain": "abcnews.go.com",
    "title": "APNewsBreak: Ex-VA exec says he wasn't told hospital cost",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Health/wireStory/apnewsbreak-va-exec-told-hospital-cost-48049917"
}