{
    "authors": [
        "Abc News",
        "More Emily"
    ],
    "date_download": "2017-04-17 18:10:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "A suspect was arrested this week in Vanessa Marcotte's August 2016 murder.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2Fstate-trooper-dna-helped-catch-mass-joggers-alleged%2Fstory%3Fid%3D46841780.json",
    "image_url": "http://a.abcnews.com/images/US/HT_Vanessa_Marcotte1_MEM_160809_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An eagle-eyed Massachusetts state trooper and a DNA match on the victim's hands led police to arrest the man suspected of killing Vanessa Marcotte eight months after she disappeared while jogging near her mother's Princeton, Massachusetts, home, officials said.\nOn Aug. 7, 2016, 27-year-old Marcotte, an account manager at Google in New York, went for a jog in Princeton, a town about 60 miles west of Boston, and never returned. Her body was found that night in a wooded area about half a mile from her mother’s home. Marcotte had planned to return home to New York that night, officials said.\nOn Friday, Angelo Colon-Ortiz, 31, of Worcester, was arrested in connection with the killing after his DNA matched samples from Marcotte's hands, said Worcester County District Attorney Joseph Early Jr.\nPolice found Colon-Ortiz after a Massachusetts state trooper spotted a man matching the suspect's description driving a dark SUV in Worcester, the Worcester County District Attorney's Office said.\nThe trooper didn't have paper, so he \"wrote the license plate number down on his hand and followed up,\" the district attorney's office said. \"He later went to the suspect’s home ... where suspect provided the DNA that led to the match.\"\nMarcotte's cousins, Caroline Tocci and Steve Vittorioso, told ABC News they weren't surprised that the 27-year-old helped catch her own alleged killer by getting his DNA.\n\"Vanessa is a fighter,\" Vittorioso said. \"I know that she was doing everything she can. She really tried to persevere. ... She is our role model.\"\nWorcester County District Attorneys Office via AP Photo\n\"Vanessa was my cousin, but she was my sister,\" Tocci explained. \"She was an only child so she grew up with me and my sisters, as well as Steve, and we were all very close. She was my other half.\"\n\"We're very proud of her strength and what she did,\" Tocci said. \"We know how strong of a person she is and every day we strive to be more like her.\"\nEarly said the arrest \"was the result of hard work by police who tirelessly investigated this case from the day of Ms. Marcotte’s death.\"\nInvestigators had received more than 1,300 tips in the case, the district attorney's office said.\nChristine Peterson/AP Photo\nA suspect now in custody has brought the family some peace, Tocci said, but she added, \"Our goal now is just helping other women who are in these situations.\"\nThe family has established the Vanessa T. Marcotte Foundation, which Tocci said promotes female safety awareness and aims to tackle the \"societal issue ... of the objectification of women\" and reduce violence by promoting gender equality.\n\"Vanessa did nothing wrong. She was running during daylight on a road that she's run on thousands of times,\" Tocci said. \"It's just being aware of your surroundings and being cognizant that this could happen anywhere. It doesn't matter your class, it doesn't matter your race, it could happen to anyone. You have to live fearlessly, but you have to just be safe, as well.\"\nVittorioso added, \"We want women just to continue on with their lives and keep doing what they're doing on a daily basis and not be scared to go for a run at 5 o'clock in the morning ... and just to continue on what they love doing.\"\n\"We're going to take this energy and really channel it into the Vanessa T. Marcotte Foundation,\" Vittorioso said, \"and use that as a great way just to keep her spirit alive, just because Vanessa means the world to us.\"\nColon-Ortiz, who was not resistant when he was arrested, the district attorney's office said, has been charged with aggravated assault and battery and assault with attempt to rape. Early said additional charges are expected. He is being held on $10 million bail and is expected to be arraigned Tuesday.",
    "source_domain": "abcnews.go.com",
    "title": "How state trooper, DNA helped catch Mass. jogger's alleged killer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/state-trooper-dna-helped-catch-mass-joggers-alleged/story?id=46841780"
}