{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-04-24 19:49:03+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "Macron and Trump hold a news conference after an Oval Office meeting that focused on the Iran nuclear deal, climate and trade.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FPolitics%2Fvideo%2Ftrump-welcomes-macron-54699501.json",
    "image_url": "https://s.abcnews.com/images/Politics/180424_vod_macron_presser_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Trump welcomes Macron\nYou've been watching ABC news special coverage of a joint news conference between president trop and French president Manuel Mac honesty even men there walking away. President drop with a hand. Crown shoulder I'm gonna vote and welcome to ABC news live where our White House correspondent and political analysts are standing by to pass through. What you'd just heard the president there talking immigration are wrong and trade both humor Kron they have some. Taught things in common but they also have some major policy differences. Let's get right to our ABC news political director Rick Klein whose NRDC bureau right now. Written crowned at the want to leave the US empty handed. He doesn't and the key issues that the two leaders are continue to talk a lot of this Iran nuclear deal the president has signaled his skepticism. He is still signaled skepticism throughout but but right now it looks like there's at least an open door for them. To have further conversations I think that's one take away here but he doesn't seem to have tempered any of the president's criticism the president went on. I have some length talking about this as a as a flawed deal as a mistake is a disaster ridiculous terrible insane at different times. Those are hardly the words that that you be looking for be looking to preserve the nuclear deal. Right to the east room Rick how come back to you where our ABC chief White House correspondent Jonathan Karl is standing by there. Don. What do you take away from what you just saw. It's a lot to take away their first of all the answer just now on Ronnie Jackson the president's nominee to be the VA secretary was extraordinary. The president said. It it is up to Ronnie Jackson whether or not to drop about whether or not to stay and continue to fight for his confirmation. Or whether to leave it all behind. And the president said that if it were his decision. He would walk away. He said it's if you were Enron Ajax cues facing all the attacks he's facing. That he would not go through that and walk away from this confirmation battle and that he added but it's up to. It's up to Jackson's public an amazing. Quote non confidence even as he said he was a terrific guy one of the finest deeply definitely mad. He certainly didn't sound like somebody that was ready to stand up there are quite minimal earnings VA secretary all the wrong. The president sets of people here and earlier the in the Oval Office when when the Q when you meant another meeting. There closed meeting he basically issued a direct threat to wrong I asked in the Oval Office what do you say to the Iran in. A statement that if this agreement at this Iran's nuclear deal goes down at the United States backs out the table redo their nuclear program. And the president says if they do that they've paid greater price. Than they'd ever pay eminently sound like a rat rat on that was repeated here. This press. Jonathan the president that that when it comes to Iran or do we know where he stands on that Lecrone authors saying across thing. You know it's not a sufficient deal but it has allowed monarchy over Iran's nuclear program but it also seen that he's going to take another look and renegotiate that deal. Not exactly can it. What would it would the French position is his stay in the Iran nuclear deals don't. Attempt to even change the Iran deep nuclear but to an additional deal on top of it the big complaint. From the trump side from the drop administration side of this on the Iran nuclear deal. Is it it only deals with the nuclear program that does nothing to stop Iran's. Ballistic missile program it has nothing to stop. Iran's support for terrorist throughout the region. And also that it is a temporary deal that expired after it. After after fifteen years or so what do you what. That the conversations about and they and the private conversations advantages. From the French side urging the truck restrictions day in the deal. And let's negotiate a new deal on top of it they will address our other concerns. But at least let's keep the lid on the nuclear program and Kenneth I've got to tell you I've been tracking this. Really since since the beginning of the trump administration. He's back channel negotiations have been going on and not long ago before Rex Tillerson was fired as secretary of state. Trump an illustration. A through the State Department was working to do exactly what all the problems talked about here today. Now it seems as though the president is strongly. Implying hinting it may be outraged saying. If he wants to just do away with that nuclear deals that such a disaster. Into an an entirely new thing altogether. It didn't see like it was much agreement here on the first. Part of animal John back to North Korea the president called Tim Duncan earlier. It and they used very pleased that he acted very open very honorably. That's different the tough talk that we hear from this president when he talked about fire and fury and despite tough talk on North Korea. It's different than anything we've ever heard from an American president towards a North Korean dictator. He said he did call him honorable what he said was. What he's been seen he's been honorable in in you know since they started negotiating. The terms of the possible summit. Honorable. That is open these are in hot and hurts that you heard anybody say about north and North Korean dictator. It has both develop nuclear weapons has starved his own people is exit you to his enemies. You don't hear this come from president trump who at various times you point out it's been as hard line more hardline than anybody on North Korea. Little rocket man you know what well I mean he's. Go back to that UN speech from from last fall. So you know obviously see if there's blowback on that to hear from the lips of an American present it. The word honorable. Towards Kim Jong news really quite a statement soon. There'll be some low back I would even imagine that John Bolton who was sitting here is the new national security advisor if you were still. Outs as as a television commentator and writer on things or policy I would imagine that that would be something he would have been highly critical of an American president any American president. Suggesting that North Korea dictator is honorable. Novel while ago you asked the president a question in the Oval Office and I don't think he liked it. Yeah I cannot I think you're right about that that the question I asked they had a chance to ask a few questions but there was one particular that. The presidency quite irritated about it was one that. Aspect of my mind a lot of about your account I assume you're probably curious to Reuters wanted to know is he considering apart in for Michael Koenen. And the president shook his head as I was asking not not shaking his head no quit in disgust that I would bring this subject up and he just said that's a dumb question. So. I get a chance to ask you to get home I'll see if I can actually get an answer. I Don I'm that you bath a lot of questions I've watched as the U. I'm Anna Mae's behalf a lot of questions the president and leaders. Across the globe and elephant that was not its cubic Watson. To a question I'm sorry it's stupid give us an atrocity that we've heard from me I don't know what that means anything but that was not as he requested him by his. And I appreciate that man. There was that that in a couple of bucks looked at him natural right here what is so Regina office when he says we cut through the substantive here. I up you gotta up close and personal view the first lady's white hat so. Instead of getting your political for two expertise here give me from fashion expertise. Okay there's a lot of debate about this is lot of debate internally within ABC all around the world. But that was striking Sandra can't see her come out. Of the White House for that ceremony itself on that kind of marine. Incredible background. I I thought it was striking I human bombs they're not. You you know I thought it worth it ramadi and Olivia Pope beyoncé formation video. So yeah I would striking it well I thought she wouldn't word and side. Pick. That's that we we could have a separate debate that went. Certainly on the south wall was that was striking him dot I am a southern voice that remind me of the and in certain vehemently if the pats on. That's. All right Jon Karl thank you for your expertise I appreciate it let's move back to our bureau where are required if any by Rick I'll get your opinion and I'm not white happen purpose probably what you took away what else to go away from the president's joint news conference. Well John may have had just like that back home on the I'm not sure I think the headline today's going to be our money Jackson I I've never seen a president. A thread this particular needle I guess it's the opposite of the threading a needle you're throwing a lot needles out there. Because what he said today is I would be doing it if I were him he's trying to distance himself right now from the allegations that are swirling that a force that nomination. To be to be put off and and pressing pressing the case that this is all about unfair media scrutiny but he's the one who put his own personal White House position. Out there for the nomination despite his lack of experience. Despite the lack of vetting inside the White House the blowback in some ways are predictable I don't find it credible that he would say he's not familiar with what's being said right now. I've this to me was him beating a do with you might. Quote what the French president we have to say about it to Ronnie Jackson in this post that was a pretty extraordinary thing. You know what if that fair to say Rick that you know the president that many close friends on the global. On the world stage there when it comes to that's when there's a friendship with the program we saw that tight embrace the president gave a little pack. You know a kiss on the cheek there. This is important for him this relationship with key. I think it's is key and it is also key to realize the value the president front season. He knows the power of these images he knows that every handshake people are gonna talk about how long it was hell he doesn't want to be the ones to pull away right away. And I think when you mean you realize the German chancellor's going to be. In town later in the week to beat weaken the international stage the deference the respect that he showing to the French president I think he means that as a message to other world leaders including Western European leaders including allies. Look this is what you can get when your close you can have this kind of influence at the United States and I think. Curried the favor goes in both directions the president likes loyalty he likes people around to be loyal I think. He starts to develop these relationships and I think he understands the power. Having that dinner at George Washington's house last night having the first state dinner of his presidency tonight. Honoring micron in this way building up Lecrone to his constituency back home and on the world stage all of that I think. He speaks to the president's leadership silent as he unique leadership style when he keeps this preys on people that he might find useful. Entry I'm really important for these two men from Mount Vernon to roll out the red carpet on the South Lawn. Right out of the army band so let me ask direct also with on some of the other issue when it comes and Italy struck me is that the president's outlook we've gotten nothing. From the Middle East in the past eighteen years some would say that since you know the tough talk from the president but I think others with say there's been something gain from trying to find peace and security. On to other interest and that region as well. Yeah I and it shows you what a short break he is from previous Republican administrations in particular but really from the consensus of foreign policy. In general talk about the trillions of dollars it spent the Middle East is utterly wasted that that you got nothing for your money. At all and it empathetic contacts guy again Syria he gave. Kind of both answers today when asked about Syria that yet he wants to get the US troops home as soon as possible may be very quickly but he wants to get it done right of course France was. US ally just a week and a half ago or so and those military strikes. On the Asad regime after the chemical weapons attack so he is talking in both different directions on this if it's right me. A bit again of campaign trump talk about how how the Iraq War was such a mistake he was of all sides of that issue. Pretty famously early in the campaign as well but he's returning to that at the same time that there isn't in obvious prescription from here. Wrecked so we got the dinner the state dinner. On the president's first but during its first statement that so far I think he's doing. I think the images are powerful and I think the heat do you view the salute on the White House lawn earlier today. Everything down to the white hat they are memorable the president firstly people speaking on that international stage and I think the images that. That get transmitted around the world out of this or are generally positive for this White House I think they're pulled off so far we'll see other dinner goes tonight I think he he's able to stay mostly on message on. On these things I think that North Korea answer risen may be some and it's gonna require a little bit of White House clean up but he was asked to address that a little while ago and he's going into that. That very complex set of negotiations. I think there's a lot of tension in this relationship the Iran nuclear deal first and foremost the issue of tariffs a big one as well and that was gonna simmering just below the surface but I think I given the relationships with other some other world leaders he'll take simmering below the surface for some of the alternatives. And as we take a look at that luncheon that is about that happened there at the White House Rick later on this week German chancellor Angela Angela Merkel. She's going to be at the White House. No statement or no state visit. Thursday for her but still the things to be the European charm offensive. You know that to really bring the president to their side. Yeah it's a big time for a hold a whole range of initiatives including some areas where he is not aligned at all with us some traditional very strong allies including those in Western Europe and I do think that the the peace the president. He understands here is the is the power. That these images in these relationships projected I think the White House is happy with the so called romance coverage. That awkward embrace and kiss on the cheek that he had a McCraw those are good images I think as far as the White House this is concerned at this time. And Rick IA half that again ask you what's the politics of the white hat. How's that gonna come to play. I oh look I'm not gonna give Bologna a trump fashion by somebody to get an active tennis I. She can pull off not every First Lady got every world leaders white not any world leader not any human being could fall off but she she looked glamorous today. I even if it was an unconventional choice and I I was also surprised she ward it's -- again she gets the do these things you and I were just you know we're just we're just observers in this and that part of the drama. Yes we can skip the boring ties centers let's all right our thanks they've if you can hear political directorate client Rick thank you so much for your expertise Interfax and buys. All right I'm Kenneth Brody here for ABC news live from war on the president's joint news conference and our analysis please go to abcnews.com. ABC news app. Have a good day.\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Trump welcomes Macron",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Politics/video/trump-welcomes-macron-54699501"
}