{
    "authors": [
        "Abc News",
        "Andrea Miller",
        "More Adam",
        "More Andrea"
    ],
    "date_download": "2018-03-19 19:26:03+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Einstein, a black lab, has been trained to detect changes in human blood sugar.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2F10-year-boy-diabetes-dog-monitors-blood-sugar%2Fstory%3Fid%3D53849723.json",
    "image_url": "https://s.abcnews.com/images/Video/einstein-eli-abc-er-180316_hpEmbed_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ten-year-old Eli O’Bryan gets companionship from his canine friend, Einstein, plus a lot more.\nThe black labrador helps to keep Eli healthy.\nEli was diagnosed at 4 years old with type 1 diabetes, a disease formerly called juvenile diabetes in which the body does not produce insulin.\nEinstein is trained as a medical-service dog to detect when Eli’s blood sugar spikes or crashes, and to signal -- with a bark or by placing a paw on Eli -- when Eli and his family need to check his blood-sugar levels.\nBefore Eli got the dog, he had to wear a sensor that would monitor his blood sugar throughout the day, which he said was awful.\n“[The sensor] was stuck in my leg with a giant needle and it hurt so much,” said Eli. “It beeped all the time and it malfunctioned.”\nBut no longer.\n“Now we have Einstein,” Eli said.\nABC News\nA living dog over a technological device\nThe sensor Eli wore before Einstein was not only uncomfortable, it interrupted his education, sometimes beeping as many 12 times a day during school.\n“He wore a pump all the time, he wore a sensor all the time,\" Amy O’Bryan, Eli’s mother, told ABC News. \"We tracked him with an app through his sensor because he's so brittle that he has to be constantly monitored for him to stay functioning.”\nABC News\nBut one of the worst things about the sensor is that it gave Eli more control over his blood-sugar levels, which meant he could hurt himself.\nA mother's fear\n“The scariest for Eli is when he was in fourth grade, he very calmly told me that he didn't want to live anymore,” O'Bryan said. “And to hear that as a mom and for him to be so casual about it, it was just matter of fact.”\nAmy feared that Eli could harm himself with the devices and medicine he used to maintain his blood-sugar levels.\nSo she sought an alternative.\n\"That's really what started our journey with Einstein,\" O'Bryan said. \"Not only was he suicidal, but he also wore a device on him 24-7 that would have made it very easy for him to end his life.\"\nAmy reached out to CARES Inc., a non-profit based in Concordia, Kansas, that trains service dogs.\nABC News\nThe organization works with a prison system that uses the dog training as a work program for the prisoners. And then, the dogs are sent to families to get used to being in a home and school setting.\nA dog’s expert nose is what allows Einstein to be trained to pick up on Eli’s blood-sugar changes.\n“They say it's actually one of the hardest things to train a dog to do because it's not a constant smell,” said Amy.\nThe waiting list for dogs from the organization is so long that Eli's family had to wait almost three years from when his mother first inquired before he was approved to get a dog. Even then, it wasn’t a guarantee.\n“Eli has to certify that he can handle him in public,” explained Amy about the process of getting to keep Einstein after a week of training and bonding at the Kansas organization. “They have to show that they can handle them in restaurants or social situations …[Eli] was really nervous, ... we didn't want to leave without Einstein from Kansas.”\nEli and Einstein now\nIn October 2017, the O’Bryan family welcomed Einstein into their home, and Amy considers him another one of her children now.\n“It helps having a dog,” said Eli. “Just in general, even if it's not a service dog. Just feels like having a best friend.”\nABC News\nNow, Einstein goes with Eli almost everywhere from school to band practice. The lab knows when it is time to be serious and work, but when the vest comes off, Einstein acts like the 2-year-old pup that he is.\n”It's greatly impacted our life,” said Amy. “Just his quality of life, that he doesn't have to wear the sensor, I think it's helped me be more confident that Eli is independent and he can handle it.”",
    "source_domain": "abcnews.go.com",
    "title": "10-year-old boy with diabetes got a dog who monitors his blood-sugar levels",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/10-year-boy-diabetes-dog-monitors-blood-sugar/story?id=53849723"
}