{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 18:13:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Top-ranked Rafael Nadal advances to China Open semis",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fhalep-beats-kasatkina-reach-china-open-semifinals-50318659.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_4f287bafba7c4a7fac289dd842c3bfb0_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Top-ranked Rafael Nadal moved into the semifinals of the China Open by beating sixth-seeded John Isner 6-4, 7-6 (0) on Friday.\nThe French Open and U.S. Open champion has won five titles this season and is closing in on the year-end No. 1 ranking.\n\"I don't remember a lot of mistakes,\" Nadal said. \"I went to the net very often. I did the things that I want to do, and I did it well, so very happy.\"\nOn the women's side, unseeded Carolina Garcia of France upset third-seeded Elina Svitolina of Ukraine 6-7 (5), 7-5, 7-6 (6) in almost 3 1/2 hours to line up Petra Kvitova in the semifinals. Simona Halep, on course to becoming the No. 1 player in the world for the first time, faces French Open champion Jelena Ostapenko.\nNadal saved all three break points he faced against Isner. He will next play third-seeded Grigor Dimitrov, who defeated Roberto Bautista Agut 7-6 (5), 4-6, 6-2.\nDimitrov spent time practicing with Nadal in Mallorca ahead of the hard-court season. The two also went fishing at sea.\n\"We catch a few ones (fish), but not very big,\" Nadal said. \"But we had some good dinner.\"\nNick Kyrgios also advanced. The eighth-seeded Australian won when opponent Steve Darcis retired with a neck strain while trailing 6-0, 3-0.\nKyrgios will take on second-seeded Alexander Zverev. The German beat Andrey Rublev 6-2, 6-3 and qualified for the season-ending tournament in London.\n\"It's great for any player to qualify,\" said Zverev, who has five titles this season.\nSecond-ranked Halep moved into the women's semifinal by defeating Daria Kasatkina of Russia 6-2, 6-1.\nTo bump Garbine Muguruza from No. 1, the Romanian needs to reach the final. Halep's quarterfinal win avenged her straight-sets loss to the 34th-ranked Kasatkina at Wuhan last week.\nKvitova defeated Czech countrywoman Barbora Strycova 6-3, 6-4. Kvitova has won the last 24 matches she's played against fellow Czechs.\n\"We are pretty good friends from the Fed Cups,\" she said. \"We know each other well. We practice a lot as well. Maybe it's extra motivation for us to play each other.\"\nOstapenko beat Sorana Cirstea 6-4, 6-4 in an error-filled quarterfinal.",
    "source_domain": "abcnews.go.com",
    "title": "Top-ranked Rafael Nadal advances to China Open semis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/halep-beats-kasatkina-reach-china-open-semifinals-50318659"
}