{
    "authors": [
        "Abc News",
        "Hana Karar",
        "Kelly Mccarthy",
        "More Hana",
        "More Kelly"
    ],
    "date_download": "2018-02-02 22:27:48+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": "One California training center has been pegged by college football programs for finding young athletes.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fstandout-football-players-young-years-calls-college-recruiters%2Fstory%3Fid%3D52800400.json",
    "image_url": "http://a.abcnews.com/images/Nightline/180202_ntl_connelly4_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bunchie Young sports bright blue hair and Bible verses on his arms. But what is getting him attention on the football field is his raw athletic talent.\nAnd he's only 11.\n“He’s a fast kid, like I can’t even describe how fast he is,” Young's trainer, Mike Evans, told ABC News' Chris Connelly.\nBunchie said that when he's speeding down the field, “It’s like nobody can touch you really, like when you run it, people [will] be all behind you and nobody will touch you.”\nHis favorite parts of the game? “Well, my teammates. I love my teammates,” he said. “And scoring touchdowns.”\nWHAT TO KNOW One California training center has been pegged by college football programs for finding young athletes.\nABC News\nThe 5th-grader is already drawing attention from college football recruiters, and he's not the only very young prospect to get such attention.\nBunchie's dad, Dave Young, told ABC News he received a call from the University of Illinois.\n“He was like, 'Man, your son is amazing. I mean your son is amazing. I just want to just build a relationship with you guys,'” Dave Young said.\nBunchie's trainer, Evans, is a former standout safety at the universities of Nevada and Louisville and is now owner of LacedFacts Training, a football academy in Norwalk, California, dedicated to training young, aspiring athletes.\n“A lot of our workouts are real intense,\" Evans said. \"You know you might sometimes see a kid cry because it is so hard.”\nDave Young said there are times when his all-star son doesn’t want to go to practice, but he reminds the boy, “To be the best, man, you’ve got to practice when you don't even want to practice. So it’s a grind, son. It’s a grind, and that’s what makes a champion.”\nBetween the young athletes' hard work and Evans’ personal contacts in the college football world, the trainer said he is able to get his kids noticed by major college programs. “Everybody in the coaching world that I have ties to, they know that I'm not going to talk about a kid if he's not a good kid. You know, that's my credibility.”\nABC News\nA good friend of Bunchie's who also trains with Evans has already received similar calls from college programs. Havon Finney Jr., 10, said that thanks to “social media and Mike” he got an offer from University of Nevada.\n“I just thought it was unbelievable,” Risha Finney, Havon’s mother said, adding that it didn’t register for her that a 9 year old could receive an offer.\nThe boy's father, Havon Finney Sr., noted that a call from a recruiter is just that.\n“It’s not like the kid is going to play college football at 9 years old,” Finney said.\nABC News\nEvans trains nearly 200 young football players at his facility and recently expanded to include an accredited school, which Bunchie, Havon and 7-year-old standout Kaleb Herndon will attend next fall.\nEvans said he anticipates Kaleb could likely receive a college scholarship offer by the summer.\nEvans said that eight college coaches came to his training facilities within two weeks of opening last year. And while some coaches want to wait until the kids are in high school, Evans knows that could be a missed opportunity.\nHe said he tells coaches, “'If you don't get them now then who knows who they’re going to go to in high school.’”\n“A lot of coaches are, like, 'OK ... send me the video then,’” Evans said.\nABC News\nLane Kiffin, a former NFL coach now at Florida Atlantic University, said he’s had his own fair share of experience recruiting very young players.\n“It's just got younger and younger. That's just where we're at now,” Kiffin said. “It goes back to making an impact so that the kid understands, OK we researched, we found you before anybody else did.”\nEvans said that for kids to get that level of recognition is affirming.\n“I think for the most part this is letting the kid know that he is special and they were first to do it. You know, Bunchie will always remember Illinois,” Evans said.\nNeither of the football teams at the University of Illinois nor the University of Nevada confirmed that offers were made to Young or Finney, telling ABC News they don’t talk about unsigned recruits. The offers are not binding on the schools or the kids.\nKiffin said that after they hear about a young player, coaches make sure to call the family first.\n“We call the family first [to] say, ‘Is he able to handle this? Is he mature enough, you know, that this won't go to his head and all of a sudden he won't do great in school and keep striving to be better in football?’ So we research all about [it] to make sure it's the right time,” Kiffin said.\nRecruiting kids before high school has been a hot topic of discussion among coaches, trainers and parents of athletes in recent years, but some people can’t get on board.\n“This is absurd, this is absurd on so many levels,” USA Today sports columnist Christine Brennan told ABC News. “So you are an 11- or 12-year-old who already got an offer from a college. And even though we know that's not binding, we know that they can change their mind ... But how hard is that when all the adults in your life are already, kind of have you, directed in this manner?”\nEvans thinks there are worse things young boys could be spending their time dedicated to than football. “I'd rather a kid is thinking about college now than thinking about joining the gang,” he said. “You know it's not just about football. You know it's about opening these kids' mind that there is more to life than the communities that we come from.”\nAnother overall concern is the safety of the sport; some states have recently called for the ban of tackle football for kids under a certain age, like 12 years old.\nKurie Hooks, Herndon’s mother, said that her son’s physical safety, amid growing concerns about concussions, is vital. “I want to make sure that his brain is protected,” she said, adding that her “biggest fear” is head-to-head contact.\nBut Evans said he teaches the kids to play safe. “I feel like the kids have to learn how to play safe. I feel like that's why you do it at such a young age. So you're not using your head,” he explained.\nFinney Jr. said that getting tackled, “feels like someone’s wrapping you up,” and that it “doesn’t hurt.” Young said he’s able to avoid big hits and tackles: “I rarely get tackled, but, because like I usually, I usually score touchdowns … So, I don’t really get tackled.”\nYoung and Finney Jr., who (met playing football when they were just 2 years old) find that their success as football players has made them popular in the public sphere, particularly on social media. Finney Jr. has over 23,000 Instagram followers alone, and Young just hit 22,000 followers on Instagram.\nABC News\nLate last year, Young was named Sports Illustrated Kid's “Sportskid of the Year” and flown to New York City to walk the red carpet, where he met and received advice from Houston Texans star JJ Watt. “Just keeping working really hard. Most importantly, have fun. Just remember you’re a kid. Just be a kid and have fun,” Watt told Young at the time.\nWhile the NFL may be the ultimate dream for their kids, Finney’s parents said that getting a college education is the real win. “The NFL is great ... But a free college education,” Finney said, “we don’t have to come out of pocket.”\nPlay\n“It’s about getting these kids prepared -- not just as athletes, but as young men and women,” Young’s mother Laura Deshazor-Dunn added.\nAnd Evans said that a lot of his players share that goal. “They want to go to college. That's like the biggest vision that I see and that's consistent amongst all the kids that I talked to,” he said. “We know that NFL stands for ‘Not For Long,’ But a college degree, a college education lasts forever.”\nBoth Finney Jr. and Young have larger aspirations outside football. “I'll get my college degree. And help the homeless,” Finney Jr. said. And Young, who also wants to get his degree as well as an MBA, said that if he can’t play football he wants to “build the Bunchie Young Foundation for cancer research.” He also wants to become the mayor of Hollywood.",
    "source_domain": "abcnews.go.com",
    "title": "Standout football players as young as 9 years old get calls from college recruiters",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/standout-football-players-young-years-calls-college-recruiters/story?id=52800400"
}