{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-06-15 00:28:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Curry, Durant committed to keeping Golden State on top",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2FwireStory%2Fcurry-durant-committed-keeping-golden-state-top-48044587.json",
    "image_url": "http://a.abcnews.com/images/Sports/WireAP_2e921721a52f4ee59002971cf0bbf1ec_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Stephen Curry will likely go from being the NBA's biggest bargain to signing the richest contract in the league at more than $200 million. And he looks forward to the nice payday.\nYet the two-time reigning MVP and new NBA Finals MVP Kevin Durant said Wednesday they would consider taking less money to keep the core of the champion Golden State Warriors intact.\n\"It would mean everything. What we've built here is truly special, it's unique, it's something that you don't want to see end at all,\" Curry said. \"All the pieces that we have are important to the equation of winning a championship and competing for a championship every single year. It is a business. There are decisions that need to be made every single year and you've got to assess the situation as it is.\n\"... As we go into the talks and this whole process, which is obviously new for me, I will approach it to get the most out of it I can as an individual, as a player, and something that I've been working for for a very long time. In the context of keeping the team together, if there are decisions that need to be made, we'll talk about it for sure.\"\nTwo days after capturing the franchise's second title in three years against LeBron James and the Cleveland Cavaliers, the Warriors prepared to part ways for what will be a busy offseason for general manager Bob Myers and the front office.\nDurant said he has \"no question\" in his mind he will be back with the Warriors. He hinted he would opt out of a deal that pays him the maximum he can get in order to help Golden State's chances of re-signing players such as Andre Iguodala or Shaun Livingston — two key reserves on both title teams.\n\"It's the business of basketball obviously so nothing is for sure, but here I feel like we can work that out and we'll have a chance to do this again next year,\" Durant said. \"It's easier said than done obviously, but that's the goal. We want to keep this thing together and see how we can continue to keep getting better.\"\nThe group that recruited Durant in the Hamptons that day last summer has the same philosophy about winning more championships. Along with Curry that day were Iguodala, Draymond Green and Klay Thompson.\n\"I do know me and KD had a conversation along with Draymond and Klay and Andre last year before he even showed up that that was kind of the identity of who we are as a team that we understand how important it is, the guys that are here,\" Curry said. \"You don't want anybody to have to sacrifice in that sense, you don't want to force anybody to take that approach but at the end of the day we know what's best for us as a group going forward. We're going to do everything we can to keep this team together. I'll have that mindset, KD's going to have that mindset, I know Dre, Shaun, all the guys that are up for negotiating a new contract. We'll see what happens. The beauty of what I know of this team, we all want to provide for our families, we want to get all that we can out of this game while we still have the legs to do it, but there are no egos when it comes to that side of the equation when it comes to us as professional athletes.\"\nCurry and Durant also heard from former President Barack Obama with congratulations, though Durant said he was most excited that among 200 messages was a text from a high school girlfriend he didn't realize still had his number.\nWhile the Warriors haven't formally met to discuss whether they will visit President Donald Trump's White House as is customary for championship teams, Curry said his mind hasn't changed from when he was asked earlier this year about the possibility. Coach Steve Kerr also has been outspoken about issues with Trump.\n\"Somebody asked me about it a couple months ago like the hypothetical if a championship were to happen what would I do and I think I answered I wouldn't go. Still feel like that today,\" Curry said. \"But obviously as a team we're going to have a conversation. This is a moment that we all need to enjoy together. Nothing should distract from what we were able to accomplish together and the different kind of ceremonies that have happened around championship-winning teams. We don't want that to taint what we've accomplished this year so we'll handle that accordingly and responsibly and do the right thing for us individually and as a group.\"\n———\nMore AP NBA: http://apnews.com/tag/NBAbasketball",
    "source_domain": "abcnews.go.com",
    "title": "Curry, Durant committed to keeping Golden State on top",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/wireStory/curry-durant-committed-keeping-golden-state-top-48044587"
}