{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-17 21:11:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "The Latest: Police: No motive known for Cleveland shooting",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Flatest-victim-linked-facebook-murder-suspect-46839594.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_d629b4b40d15422ba8f82d20f138af94_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Latest on a fatal shooting captured on video and later shared on Facebook (all times local):\n3:45 p.m.\nAuthorities searching multiple states for a suspect in the deadly shooting of a Cleveland man say they have no idea what led up to what they say appears to be a random shooting.\nCleveland's police chief said Monday that only Steve Stephens knows the answer.\nPolice say the 37-year-old Stephens shot a Cleveland retiree picking up aluminum cans Sunday and then posted a video of the killing on Facebook.\nIn the video, Stephens names a woman and tells the victim, Robert Godwin Sr., that \"she's the reason that this is about to happen to you.\"\nAuthorities say Stephens is considered armed and dangerous and could be anywhere.\nCleveland police chief Calvin Williams says authorities have already searched every location Stephens has been associated with in the Cleveland area.\n———\n3:15 p.m.\nPolice in Philadelphia say they have \"no indication\" that the suspect in an apparently random killing in Cleveland is in Philadelphia.\nAuthorities said multiple 911 calls came in shortly after 12:30 p.m. Monday reporting that Steve Stephens could be in or near Fairmount Park, a large green expanse northwest of downtown.\nOfficers were sent to check the area, and police say eight elementary schools and a high school were locked down as a precaution.\nBut police later said \"there is no indication that the subject is at that location, or anywhere in the city of Philadelphia.\"\nPolice say Stephens shot a Cleveland retiree collecting aluminum cans Sunday and then posted video of the apparently random killing on Facebook.\n———\n2:10 p.m.\nPolice in Philadelphia say schools have been locked down as they investigate reported sightings of the suspect in an apparently random killing in Cleveland. But authorities also say there is no indication that Steve Stephens is in Philadelphia.\nAuthorities say multiple 911 calls came in shortly after 12:30 p.m. Monday claiming that Stephens could be in or near Fairmount Park, a large green expanse northwest of downtown.\nOfficers are checking the area, and police say eight elementary schools and a high school are on lockdown as a precaution.\nPolice say Stephens shot a Cleveland retiree collecting aluminum cans Sunday and then posted video of the apparently random killing on Facebook.\nPhiladelphia is a more-than-six-hour drive from Cleveland.\n———\n11:50 a.m.\nA former girlfriend of the suspect in the slaying of an elderly Cleveland man has told CBS News in a text that 37-year-old Steve Stephens was \"a nice guy\" who was generous to everyone and was \"kind and loving\" to her and her children.\nJoy Lane says Monday she had a relationship for several years with Stephens, now the target of a nationwide manhunt for the Easter slaying.\nStephens, in a video he posted to Facebook, mentions Lane's name to 74-year-old Robert Godwin Sr. and says she is \"the reason that this is about to happen to you\" before the random attack.\nCleveland Police Chief Calvin Williams says Lane is cooperating with authorities and is being protected.\n———\n11:05 a.m.\nA spokeswoman for the behavior health facility where the suspect in the shooting of an elderly Cleveland man worked says the man underwent an extensive FBI background check before being hired in 2008.\nBeech Brook spokeswoman Nancy Kortemeyer says Monday there was nothing in the background check for 37-year-old Steve Stephens that caused any concerns.\nKortemeyer says Stephens' job since 2015 as a vocational specialist involved preparing youth and young adults ages 16-25 for employment.\nStephens had referred to himself as a case manager. Kortemeyer says he did have a caseload of clients that he managed.\nAuthorities say Stephens did not have a criminal record.\nOfficials say Stephens shot and killed 74-year-old Robert Godwin Sr. on Sunday and posted the gruesome video on Facebook.\n———\n10:45 a.m.\nA daughter of the elderly Cleveland man shot and killed in a gruesome video posted on Facebook says he was a gentle person, with nothing mean about him.\nDebbie Godwin says her father, 74-year-old Robert Godwin Sr., was shot Sunday afternoon while he was picking up aluminum cans. She says he \"wasn't harming anyone.\"\nAuthorities are telling people in Cleveland, as well as Pennsylvania, New York, Indiana and Michigan, to be on the lookout for the suspect, 37-year-old Steve Stephens.\nCleveland's police chief is telling residents to be careful.\nDebbie Godwin says her father was retired and had 10 children. She says he spent the day before the shooting doing one of the things he loved most, fishing in Lake Erie.\n———\n10:25 a.m.\nThe behavioral health facility where a suspect in the shooting of an elderly Cleveland man worked has closed Monday out of concern for the safety of employees, clients and visitors\nA spokeswoman for Beech Brook, in suburban Pepper Pike, issued a statement Monday that says 37-year-old suspect Steve Stephens has been employed there since 2008 and has been a vocational specialist in a program for youth and young adults since 2015.\nThe statement says both the Pepper Pike facility and a drop-in center in Cleveland are closed and that a decision will be made later Monday about when they will reopen.\n———\n9:30 a.m.\nAuthorities on the hunt for a suspect who they say fatally shot an elderly Cleveland man in a gruesome video posted on Facebook say his last known location was at the shooting site.\nPolice and the FBI in Cleveland said Monday that the suspect, 37-year-old Steve Stephens, could still be in the city or in surrounding states.\nChief Calvin Williams says detectives talked with Stephens by cellphone Sunday after he shot 74-year-old Robert Godwin Sr. but haven't had contact since.\nAuthorities are telling people in Pennsylvania, New York, Indiana and Michigan to be on the lookout. They say Stephens should be considered armed and dangerous.\nCleveland's police chief says officers have searched dozens of places since the shooting Sunday and told residents to go about their business, but be careful.\n———\n7 a.m.\nCleveland police searching for the suspect who fatally shot an elderly passerby in a gruesome video posted on Facebook say no more victims have been found, despite the shooter's claim that he killed over a dozen people.\nPolice said Monday that they've found no evidence of other slayings linked to the suspect, 37-year-old Steve Stephens. They planned to provide updates on the search at a news conference later Monday morning.\nThey say Stephens may have left Ohio, and they're urging people in Pennsylvania, New York, Indiana and Michigan to be on the lookout. They say Stephens should be considered armed and dangerous.\nHe's wanted on an aggravated murder charge in the death of 74-year-old Robert Godwin Sr. on Sunday afternoon in Cleveland.\nThe FBI is helping with the investigation.\n———\n2:05 a.m.\nPolice in Ohio are urging residents in surrounding states on Monday to be on alert for a man who they say shot and killed an elderly passerby and then posted a gruesome video of the killing on Facebook.\nThirty-seven-year-old Steve Stephens is wanted on a charge of aggravated murder in the death of Robert Godwin Sr. on Sunday afternoon in Cleveland.\nIn a statement early Monday, police warned residents of Pennsylvania, New York, Indiana and Michigan to be on the lookout for Stephens, who they say should be considered armed and dangerous.\nIn a separate video posted on Facebook, Stephens claimed to have killed more than a dozen other people. Police say they have not verified any other shootings or deaths.\nThe FBI is assisting in the investigation.",
    "source_domain": "abcnews.go.com",
    "title": "The Latest: Police: No motive known for Cleveland shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/latest-victim-linked-facebook-murder-suspect-46839594"
}