{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-10-06 23:59:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "ICE official: Agency will arrest at California worksites",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2FwireStory%2Fice-official-agency-arrest-california-worksites-50336251.json",
    "image_url": "http://a.abcnews.com/images/US/WireAP_3a54a156b47b4efe9255974dd7cc39fe_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In another sign of escalating tensions between President Donald Trump's administration and California, the nation's top immigration official said Friday his agency will have \"no choice\" but to arrest immigrants who are in the country illegally in California's neighborhoods and worksites.\nImmigration and Customs Enforcement will also likely have to place immigrants arrested in California in out-of-state detention centers, ICE Acting Director Thomas Homan said in a statement.\nHoman's comments came a day after Gov. Jerry Brown signed bill SB54, or sanctuary state legislation.\nStarting Jan. 1, police will be barred from asking people about their immigration status or participating in federal immigration enforcement activities. Jail officials only will be allowed to transfer inmates to federal immigration authorities if they have been convicted of certain crimes.\n\"Ultimately, SB54 helps shield removable aliens from immigration enforcement and creates another magnet for more illegal immigration, all at the expense of the safety and security of the very people it purports to protect,\" Homan warned.\nFederal immigration officials already carry out sweeps targeting immigrants in sanctuary cities and transfer many of their detainees to out-of-state facilities.\nIn his signing statement, Brown noted the bill does not stop ICE from operating in California. His office declined to comment further on the ICE statement Friday.\n\"They are free to use their own considerable resources to enforce federal immigration law in California,\" Brown wrote.\nDemocratic Senate President Pro Tem Kevin de Leon, who carried the bill, said Homan's statement \"exemplifies the fearmongering and lies that guide this Administration.\"\n\"The Trump Administration is once again making heavy-handed threats against California because we won't help them tear apart families and our economy in the process,\" de Leon said in a statement.\nDemocratic lawmakers in California have worked to create barriers to Trump's campaign pledge to step up deportation efforts. They have also approved money for legal assistance and college scholarships for people living illegally in the U.S., and made it harder for businesses and government agencies to disclose people's immigration status.\nTrump first put the spotlight on sanctuary cities as a candidate in 2015 after the killing of Kate Steinle, who was fatally shot in San Francisco pier by a Mexican national who had been deported five times.\nTrump referred to the case several times while campaigning as a reason to toughen immigration policies. The case has frequently been invoked as part of the immigration debate.\nHe has threatened to withhold federal funding to sanctuary cities, several of which have filed lawsuits to prevent that from happening.\nCalifornia is home to an estimated 2.3 million immigrants without legal authorization.",
    "source_domain": "abcnews.go.com",
    "title": "ICE official: Agency will arrest at California worksites",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/wireStory/ice-official-agency-arrest-california-worksites-50336251"
}