{
    "authors": [
        "Abc News",
        "Jack Date",
        "More Mike",
        "More Jack"
    ],
    "date_download": "2018-05-31 02:38:52+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "Details of the memo were first reported by the New York Times.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FPolitics%2Ffbi-deputy-director-wrote-memo-detailing-discussion-deputy%2Fstory%3Fid%3D55549682.json",
    "image_url": "https://s.abcnews.com/images/Politics/andrew-mccabe-fbi-ap-ps-180302_hpMain_8_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In the days after the firing of FBI Director James Comey, Acting Director Andrew McCabe wrote a confidential memo documenting a discussion he had with Deputy Attorney General Rod Rosenstein, according to a source familiar with the matter.\nDetails of the memo were first reported by The New York Times.\nABC News has not seen the memo, but according to the source, it describes what Rosenstein told McCabe: that President Donald Trump wanted Rosenstein to include a reference to Russia in his memo criticizing Comey. In the end, Rosentein's May 9, 2017, memo, which was used by Trump as a basis for firing Comey, did not mention Russia. Instead, Rosenstein's memo focused on Comey's handling of the Clinton email investigation.\nAndrew Harnik/AP, FILE\nThe suggestion that the president requested the memo mention the Russia investigation could provide ammunition to any allegation that Trump fired Comey in part to impede the investigation. However, the Times report also suggests alternative explanations, such as Trump’s desire to make clear he was not the target of the Russia probe.\nMcCabe wrote multiple memos, including some related to the president, and all of them are now in the hands of special counsel Robert Mueller, according to the source.\nMcCabe was fired just days before his retirement after a finding by the Justice Department's Inspector General that he \"lacked candor\" when talking to internal investigators about his role in a disclosure to the media.\nJacquelyn Martin/AP, FILE\nMueller's team is investigating Comey's firing and whether anyone may have sought to obstruct justice, sources have told ABC News.\nThe McCabe memo describing his meeting with Rosenstein underscores the unusual position the deputy attorney general is in -- he is overseeing the Mueller probe while also being a potential witness in the investigation.\nRosenstein was interviewed by Mueller's team last summer.",
    "source_domain": "abcnews.go.com",
    "title": "Former FBI deputy director wrote memo detailing discussion with deputy attorney general: Source",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Politics/fbi-deputy-director-wrote-memo-detailing-discussion-deputy/story?id=55549682"
}