{
    "authors": [
        "Abc News",
        "More Dr."
    ],
    "date_download": "2018-05-31 02:00:07+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": "It's good news for people who can’t make exercise a daily habit.",
    "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2Folder-couch-potatoes-exercise-thinking%2Fstory%3Fid%3D55546667.json",
    "image_url": "https://s.abcnews.com/images/Health/seniors-exercising-06-gty-mt-180530_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By 2050, there will be 2 billion members of the world over the age of 60 and the ability for those people to stay mentally fit is a big concern. As there are few available treatments for protecting brain health, is exercise part of the answer? If so, what “dose” should the doctor’s prescription pad recommend?\nResearchers at the University of Miami looked at 98 studies (more than 11,000 people in all) of “couch potatoes” who were all over 60 years old. Based on the Mini-Mental Status Examination -- a “mental fitness” scale used by primary care providers -- people were placed into three categories: healthy adults, those with mild cognitive impairment, and those with dementia. In all the studies, people began to exercise at various intensities for different amounts of time and then they were evaluated again.\nWe usually hear how much “a day” or “a week” we’re supposed to exercise, but this analysis has good news for people who want to begin exercising and can’t make it a daily habit.\nSTOCK PHOTO/Getty Images\n\"Exercise did make a difference in improved brain power,\" Dr. Joyce Gomes-Osman, the study's author and the director of the Neuromotor Plasticity Laboratory and assistant professor of physical therapy and neurology at the Miller School of Medicine, told ABC News.\nResearchers found that what seemed to matter was the total hours of exercise. People who exercise for at least an hour at a time for a total of 52 hours over an average of six months, showed increased mental performance when tested for improvements in the ability to remember, learn, plan, concentrate, reason, and problem solve. Additionally, improvements were seen in those with and without cognitive impairment.\nNo need to limit yourself to 52 hours over that six month period, since the data suggests there may be benefits beyond this level.\nSTOCK PHOTO/Getty Images\nGomes-Osman suggested to \"consider your exercise routine a point system where the goal is to reach at least 52 hours, and once you hit that mark, you should benefit from cognitive gain [brain health].”\nIt's the total number of hours of exercise over six months that seems to matter the most, she added.\nThe exercise doesn’t have to be strenuous, either. Low-intensity exercise, like walking, showed the same benefit as a moderate or high activity, like running, biking, or weightlifting. Everyone over 60 years old may not have the strength, cardiovascular abilities, or desire to do a hard workout, but most can walk or swim.\nNo correlation was found in exercise time in minutes, amount of sessions per week, or total weeks -- just in hours over the long term.\nSTOCK PHOTO/Getty Images\n\"There is a large body of evidence that already links exercise to brain health,\" Gomes-Osman told ABC.\nSo, what does the exercise prescription look like?\nAlways discuss with a doctor before starting an exercise routine, but starting slow is encouraged. Work your way up to an hour at a time, and keep at it. Long-term exposure over a number of months seems to be the key to promoting a healthy brain.\nEric M. Ascher, DO, is a third-year family medicine resident from New York working in the ABC News medical unit.",
    "source_domain": "abcnews.go.com",
    "title": "Can older couch potatoes exercise their way to better thinking?",
    "title_page": null,
    "title_rss": null,
    "url": "https://abcnews.go.com/Health/older-couch-potatoes-exercise-thinking/story?id=55546667"
}