{
    "authors": [
        "Abc News",
        "Eric Noll",
        "More Enjoli",
        "More Eric"
    ],
    "date_download": "2018-03-20 00:01:18+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Orville Rogers, 100 years old, set five new U.S. and world track records this weekend in Landover, Maryland.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FUS%2F100-year-runner-sets-us-world-track-records%2Fstory%3Fid%3D53859293.json",
    "image_url": "https://s.abcnews.com/images/US/orville-rogers-03-ht-jef-180319_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A 100-year-old Dallas, Texas, runner continues to show the world that you are only as old as you feel.\nThis weekend, Orville Rogers won big at the 2018 USATF Masters Indoor Track and Field Championships in Landover, Maryland.\n\"How great it feels at the age of 100 to break five new world track records and to bring home the gold,\" he told ABC News today.\nIn the 100 to 104 age category, Rogers set new records in the 60-meter, 200-meter, 400-meter, 800-meter and 1,500-meter events. And, he did it with his family cheering him on every step of the way.\nRogers Family\nThe former World War II veteran was a bomber pilot who later became a commercial pilot. Rogers started running at the age of 50 and began competing in track meets when he turned 90.\nRogers, also the author of \"The Running Man,\" said he trains every other day and runs three times a week.\nRogers, a widower, has four children, three of whom are still alive; 14 grandchildren; and 11 great-grandchildren.\n\"We're a very close family,\" he told ABC News. \"We take family vacations every summer for 44 years now and we enjoy getting together anywhere.\"\nRogers Family\nIn November, Rogers led partygoers as they collectively ran 100 miles at White Rock Lake in Dallas in celebration of his birthday.\n\"I live life with a capital 'L,'\" he told ABC affiliate WFAA-TV in November.",
    "source_domain": "abcnews.go.com",
    "title": "100-year-old runner sets 5 new US and world track records",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/US/100-year-runner-sets-us-world-track-records/story?id=53859293"
}