{
    "authors": [
        "Abc News"
    ],
    "date_download": "2018-03-19 20:16:17+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:00:00",
    "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FEntertainment%2FwireStory%2Fwoman-steven-seagal-sexually-assaulted-audition-53855591.json",
    "image_url": "https://s.abcnews.com/images/Entertainment/WireAP_a92e3b9b6c954b5782a749bb1c1c956b_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A woman on Monday said she was a 17-year-old model and aspiring actress when Steven Seagal sexually assaulted her at a supposed casting session at a Beverly Hills hotel room in 2002.\nFaviola Dadis was emotional but composed as she spoke at a news conference in Los Angeles, becoming the latest of several women to accuse the action star of sexual misconduct.\nDadis said Seagal reached under her bikini top, grabbed her nipples and then grabbed her genitals soon after the audition began. She said she promptly ended the audition and left deeply shaken.\n\"I have suffered from depression, anxiety and post-traumatic stress, have found it difficult to form trusting relationships with men,\" Dadis said through tears as she read from a written statement.\nShe recently filed a report with police, and Los Angeles prosecutors said Monday that her case is under review.\nSeagal's attorney Anthony Falangetti did not immediately return a message seeking comment.\nDadis, now a 33-year-old doctoral candidate in clinical neuroscience, said she had recently moved to the U.S. from the Netherlands when a music producer introduced her to Seagal. After several phone calls and text messages, Seagal invited Dadis to a hotel room in Beverly Hills for the late-night casting session for a film he planned to make about Genghis Khan, Dadis said.\nDadis brought a family friend because her mother was suspicious, but the person stayed in the lobby and she ended up in a room with only Seagal and his personal security guard.\nSeagal had told her to wear a bikini or bra and panties under her clothes, and had her walk around the room in the bikini before saying he wanted to test their chemistry together and started touching her, Dadis said.\n\"Steven sat there calmly as if nothing had happened while I was noticeably upset and terrified by the experience,\" she said. \"I left feeling horrified and totally violated.\"\nShe said she told friends after about a month, but did not go to authorities at the time because she feared being blacklisted in the entertainment industry. She said Seagal later called her, but she never accepted the calls.\nDadis said she was inspired by the recent wave of reports of sexual misconduct by men in the entertainment industry, and was spurred to come forward especially by actress Portia de Rossi saying Seagal once unzipped his pants during an audition with her.\nDadis spoke at the news conference alongside her attorney, Lisa Bloom, and another woman, Regina Simons, who said Seagal sexually assaulted her in 1995 when she was 18, allegations she previously made on NBC's \"Megyn Kelly Today\" in January.\nActress Jenny McCarthy has also said Seagal sexually harassed her at an audition in 1995.\nAfter her interview with McCarthy, Seagal said on his Facebook page that he had never met Simons and her story was fabricated, and he has denied the allegations of the other actresses.\nBloom said there are no immediate plans for lawsuits.",
    "source_domain": "abcnews.go.com",
    "title": "Woman says Steven Seagal sexually assaulted her at audition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Entertainment/wireStory/woman-steven-seagal-sexually-assaulted-audition-53855591"
}