{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 15:53:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Optimism among US homebuilders weakens",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FBusiness%2FwireStory%2Foptimism-us-homebuilders-weakens-45509178.json",
    "image_url": "http://abcnews.go.com/Business/wireStory/optimism-us-homebuilders-weakens-45509178",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. homebuilders are feeling a bit less confident this month, reflecting a dimmer outlook for sales in the months ahead and fewer would-be buyers dropping by builders' sales offices.\nThe surprising decline comes ahead of the spring home-buying season, which is traditionally builders' busiest time of the year and helps set the pace for home construction.\nThe National Association of Home Builders/Wells Fargo builder sentiment index released Wednesday fell to 65 this month. That's down two points from a revised reading of 67 in January. Analysts had been expecting an increase.\nReadings above 50 indicate more builders view sales conditions as good rather than poor. The index has been above 60 since September.\nThe latest reading marks the second decline in a row for the index, which reached the highest level in 11 years in December. The February number also fell shy of analyst predictions. They expected the index to hit 68, according to FactSet.\nBuilders' view of sales now and over the next six months also fell, as did a gauge of traffic by prospective buyers.\nSales of new U.S. homes climbed to 563,000 last year, an increase of 12.2 percent from 2015. Low mortgage rates and a steadily improving job market drove much of the growth. But sales slowed in December following a jump in mortgage rates the previous month. January sales figures are due out next week.\nThe average rate on 30-year fixed-rate loans was 4.17 percent last week, down from 4.19 percent the previous week, but sharply higher than the 3.65 percent average for all of 2016, according to Freddie Mac.\nHigher mortgage rates make home loans more expensive, which could dampen sales.\nDespite the pullback in this month's builder confidence index and the potential setback of higher mortgage rates, builders' overall outlook remains positive, although the industry continues to grapple with a shortage of skilled construction workers and land parcels cleared for home construction.\n\"Despite these constraints, the overall housing market fundamentals remain strong and we expect to see continued growth this year as some of these concerns are addressed,\" said Robert Dietz, the NAHB's chief economist.\nThe homebuilder trade group forecasts that single-family home construction will climb 10 percent this year.\nThis month's builder index was based on 300 respondents.\nA measure of current sales conditions for single-family homes dipped one point to 71, while a gauge of traffic by prospective buyers slid five points to 46. Builders' view of sales over the next six months fell three points to 73.",
    "source_domain": "abcnews.go.com",
    "title": "Optimism among US homebuilders weakens",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Business/wireStory/optimism-us-homebuilders-weakens-45509178"
}