{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:55:19+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "World's diplomats seeking reassurance from US at G20 meeting",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FInternational%2FwireStory%2Fworlds-diplomats-seeking-reassurance-us-g20-meeting-45507808.json",
    "image_url": "http://abcnews.go.com/International/wireStory/worlds-diplomats-seeking-reassurance-us-g20-meeting-45507808",
    "language": "en",
    "localpath": null,
    "maintext": "Foreign ministers from most of the world's leading powers are heading to a diplomatic summit of the Group of 20 industrialized and emerging economies in Germany, with all eyes on the new U.S. Secretary of State for clues about the direction Washington will take over the next four years.\nAt the talks Thursday and Friday in the western city of Bonn, U.S. allies are seeking reassurances from Rex Tillerson that the administration of U.S. President Donald Trump won't ditch a decade of close cooperation among G-20 nations on climate change, international development and the global economy.\nRussia, China, Saudi Arabia and Turkey, meanwhile, are looking to gauge the man they'll be dealing with on some of the more sensitive areas of foreign policy in the coming years — including conflicts in Syria and Ukraine, territorial disputes in the South China Sea and nuclear disarmament.\n\"The issue for any country that's not America is to try and flesh out what Trump means by 'America first,'\" said Christopher Smart, a fellow at the Chatham House think tank and former Obama administration adviser on international economic affairs.\nA shift away from multilateral diplomacy could see U.S. allies pitted against each other in a bid for Washington's attention, opening up new battle lines. At the same time, smaller countries could be left to pick up the cost of financing international organizations — as well as the burden of behind-the-scenes negotiations — previously shouldered largely by the State Department.\nSo far, Tillerson has struck a more moderate tone than Trump, suggesting a desire for continuity rather than a radical break with the past, Smart said. How that will work in practice, and who genuinely has the new president's ear, is something diplomats will be trying to find out both in the summit's two working sessions and during a flurry of bilateral meetings at a German government guest house on a mountain overlooking the River Rhine.\n\"Russia would be a very interesting conversation to hear,\" said Smart, noting that the G-20 meeting comes days after Trump's national security adviser Michael Flynn resigned over his contacts with Moscow.\nThis week's talks are also seen as a dress rehearsal for Germany's hosting of the G-20 leaders in Hamburg on July 7-8, which Trump has said he'll attend.\nGerman Chancellor Angela Merkel is trying to downplay differences with Trump — who called her refugee policy \"a total disaster\" — by stressing Berlin's willingness to cooperate with his administration. Earlier this month, she sent her foreign minister, Sigmar Gabriel, to Washington to meet with Tillerson within hours of his Senate confirmation.\nGabriel, who is also new to the post following a recent Cabinet reshuffle, said Wednesday that talks among the G-20 — which also includes Argentina, Australia, Brazil, Canada, India, Indonesia, Japan, Mexico, South Africa, South Korea and several European countries — are key to ensuring that foreign policy is \"more than crisis management.\"\n\"We would be well-advised not to constantly run from one blaze to the next with the fire extinguisher,\" he said, stressing the importance of preventing crises. Germany saw first-hand two years ago how conflicts in Syria, Iraq and Afghanistan led to an unprecedented movement of refugees into Europe, with a lasting impact on the continent.\nWithout mentioning the United States by name, Gabriel said problems caused by terrorism, water shortage and humanitarian emergencies couldn't be tackled through isolation. \"Climate change can't be fought using barbed wire,\" he said.\nStill, few believe that this year's G-20 meetings will be as harmonious as Germany's stewardship of the G-7 format two years ago, which produced pictures of Merkel and Obama strolling across an Alpine meadow.\nLeft-wing groups are planning a protest Thursday near the conference venue, which for decades was home to West Germany's parliament before the capital was moved to Berlin following the country's reunification.\nBonn has since become an example of Germany's vision for multilateral diplomacy, hosting numerous international organizations and United Nations offices with a particular focus on climate change — an issue the new U.S. administration has expressed skepticism about.\n———\nFollow Frank Jordans on Twitter at http://www.twitter.com/wirereporter",
    "source_domain": "abcnews.go.com",
    "title": "World's diplomats seeking reassurance from US at G20 meeting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/International/wireStory/worlds-diplomats-seeking-reassurance-us-g20-meeting-45507808"
}