{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-01-02 18:43:51+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Lane Kiffin leaving Alabama before next week's title game",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FSports%2Flane-kiffin-leaving-alabama-weeks-title-game%2Fstory%3Fid%3D44514292.json",
    "image_url": "http://a.abcnews.com/images/Sports/espnapi_dm_170102_ncf_nick_saban_on_lane_kiffin_wmain.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lane Kiffin will not be coaching the Alabama offense when the Crimson Tide take on Clemson in the College Football Playoff title game on Jan. 9.\nKiffin has already accepted the head-coaching job at Florida Atlantic University, but he was expected to continue at Alabama through the end of the season. Steve Sarkisian will take over as Alabama's offensive coordinator ahead of schedule.\n\"We made the decision because it was in the best interest of our players, our program and for Lane for him to assume his duties at Florida Atlantic,\" Alabama coach Nick Saban told ESPN on Monday. \"We mutually agreed that this was best for both programs.\"\nKiffin had been late to several events in the past week leading up to the Peach Bowl -- meetings and media day -- so much that some Alabama staff members said they \"were done with him,\" sources told ESPN's Brett McMurphy.\nLast Thursday, Kiffin appeared 15 minutes late to the team's media day for the Peach Bowl and was the last Alabama coach to leave the event. By the time he got out of the Georgia Dome locker room to where the buses were supposed to be, they were already headed back to the team hotel in downtown Atlanta.\nSaban said Sarkisian, who had already been named Kiffin's successor, will be in charge of Alabama's game plan for the championship game.\nKiffin said he expects an easy transition for Sarkisian, noting how Sarkisian's personality should mesh better with Saban's than his did.\n\"I'm not saying it's bad with him at all,\" Kiffin said. \"I would say Sark manages people better than I do.\"\n\"This wasn't an easy decision and we appreciate the way Lane handled this in terms of doing what is best for our team,\" Saban said in a statement. \"At the end of the day, both of us wanted to put our players in the best position to be successful. Obviously, we are in a unique situation here where we have our next offensive coordinator already on staff. We have full confidence that Sark will step in right away and make this a smooth transition.\"\nKiffin reiterated in the statement that this is the best move for everyone.\n\"After going through these last couple of weeks, trying to serve the best interests of two universities as an offensive coordinator and a head coach, it became apparent that both programs would be better served by me giving all my time and efforts to being the head coach at FAU,\" Kiffin said. \"After meeting with Coach Saban during preparations last night and this morning, we mutually decided that it was in everyone's best interests for the players and the program for Coach Sarkisian to take over all responsibilities as offensive coordinator for the championship game.\n\"This was a very difficult decision, but it's a decision made in the best interests of the program. I look forward to helping Alabama win another championship, and would like to thank Coach Saban, the staff, and all the players and fans for the past three years at UA for an unforgettable time and championship run. Roll Tide!\"\nThe move came after an uneven offensive performance against Washington in which quarterback Jalen Hurts passed for a season-low 57 yards.\nSaban could be seen on the sideline yelling at Kiffin during the first quarter after a three-and-out on the opening series, the latest incident in what sometimes was a contentious relationship between the coaches.\nKiffin, who credits Saban for showing him how to handle an entire program as a head coach, joked last week that he couldn't recall any fond memories at Alabama, only the so-called \"ass-chewings\" Saban gave him from time to time.\nSeveral Alabama staff members were also \"dumbfounded\" about those Kiffin comments, sources told McMurphy, and also Kiffin's comments that \"fun is not a word we use around here.\"\nIn past weeks, Alabama sources told ESPN that Kiffin would not have been allowed to return after this season. However, Kiffin said at his FAU introductory press conference and at the Peach Bowl events that those reports were not true.\n\"I don't know where that came from: that the Kiffin-Saban marriage had run its course,\" Kiffin said last week.\nESPN's Alex Scarborough contributed to this report.",
    "source_domain": "abcnews.go.com",
    "title": "Lane Kiffin leaving Alabama before next week's title game",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Sports/lane-kiffin-leaving-alabama-weeks-title-game/story?id=44514292"
}