{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-02-15 14:59:20+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "\"GMA\" taste tests some pricey gourmet salts.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FLifestyle%2Fgma-frugal-foodie-pick-gourmet-salts%2Fstory%3Fid%3D45495837.json",
    "image_url": "http://a.abcnews.com/images/US/ABC-salt-ml-170215_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Salt is no longer just plain white.\nThe kitchen staple now comes in colors that you would typically find in a Crayola box: Himalayan Pink, Hawaiian Black, Persian blue, are some of the gourmet varieties, although they can cost ten times more than your run-of-the-mill table salt.\nSelmelier Mark Bitterman -- a selmelier is a specialist who helps you choose the most appropriate salt to season your meal -- has crammed dozens of varieties of salt from all over the world into his salt boutique in New York City, where you can find exotic varieties that can cost up to $272 dollars a pound. Bitterman prefers to call them “craft salts” to reflect the expertise involved in their production, many mined by hand without the use of heavy industrial machinery.\n“I like to say we’re not looking for a subtle improvement in the flavor of your food,\" said Bitterman. \"We’re looking for a mind-blowing improvement. It should taste flat out better.\"\nChefs like David Burke have their favorites: He uses Himalayan Pink almost exclusively in his restaurants, believing it has added health benefits.\n“It’s a healthier salt based on its DNA for the human body,” said Burke. “It’s the most natural salt for human consumption.”\nChef Marcus Guiliano also promotes a mineral-rich salt, endorsing an American-made brand for his kitchen.\n“The great thing about this salt is all the trace minerals that are still intact naturally, the electrolytes that are in there,” said Guiliano. “[This] salt does taste different.”\nThe health benefits associated with high mineral salts are not entirely clear.\n“The thinking is minerals are really important to human health, so if you’re going to choose a salt you may as well choose a salt that has more minerals,” said Robin Foroutan, a registered dietitian and nutritionist. “The reality is it may or may not make a really big difference.”\nBut do they taste better? \"GMA\" wanted to find out so we asked Chef James Briscione, Director of Culinary Development at the Institute of Culinary Education in New York City, to prepare a blind taste test using an affordable kosher salt, which cost $3 a box, Himalayan Pink salt, $10 a jar, and an expensive French Gourmet salt from France, with a price tag of $48.\nWe then invited three food professionals, Robert Ramsey, a chef-instructor, Julia Turshen, cook book author, and Rebecca Raben, a student at the Institute for Culinary Education to take part in a two-part taste test. Our panel was asked to sample three pieces of chicken, identified only by a letter, so they couldn’t tell which salt went on which piece of chicken. We then instructed them to identify which they liked the best, and then which they thought was the most expensive.\nRaben and Turshen picked the expensive French “Fleur de sel” gourmet salt as their favorite.\n“I liked that it was assertive really got the salty flavor of it,” said Raben.\nWhen it came to picking which they thought was the most expensive salt, Julia, the cook book author picked the kosher salt.\n“My hat’s off to Kosher. It really fooled me I thought it was the fancy one,” said Turshen.\nWhile Chef Robert correctly picked the chicken seasoned with the most expensive salt, he actually preferred the taste of the kosher salt.\n“I think there are subtle differences that are there,” said Ramsey. “But if I wasn’t tasting them back to back I don’t think I would be able to taste the difference at all.”\nThe gourmet salt manufacturers \"GMA\" contacted said they don’t make specific health claims but believe their mineral-rich salts are a better choice, one salt manufacturer told us,\n“…natural minerals in even small amounts can certainly come into play with our nutrition.”\nAccording to some chefs when it comes to gourmet salts, texture may make more of a difference than taste and while some gourmet salts might not taste very different from the refined table salt, the colors and shapes lend for a more interesting culinary experience.\nAs they say, \"you eat with your eyes first.\"",
    "source_domain": "abcnews.go.com",
    "title": "'GMA' Frugal Foodie: How to pick gourmet salts",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/Lifestyle/gma-frugal-foodie-pick-gourmet-salts/story?id=45495837"
}