{
    "authors": [
        "Abc News"
    ],
    "date_download": "2017-04-18 12:16:05+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "Lawyers for the alt-right conspiracy theorist, Alex Jones, called him a \"performance artist\" during a pretrial custody hearing between Jones and his ex-wife.",
    "filename": "http%3A%2F%2Fabcnews.go.com%2FGMA%2Fvideo%2Fwife-alex-jones-called-unstable-amid-custody-battle-46857464.json",
    "image_url": "http://a.abcnews.com/images/GMA/170418_gma_llamas2_0738_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Transcript for Ex-wife of Alex Jones called him unstable amid custody battle\nAin Back with new questions about one of president trump's top supporters. Alex Jones known for his conspiracy theories is in the middle of a bitter custody battle and now his lawyer is arguing all of his talk on the radio is really just part of him being a performance artist. Our chief correspondent Tom llamas here with the details. Reporter: Alex Jones claimed president trump called him directly of the election to thank him and his audience for their loyalty but does Jones really support trump or one big act for ratings? Donald Trump, I hope you can help uncripple America. Thank you so much sir. Reporter: Every day millions watch, read or listen to Alex Jones, one of president trump's biggest and most controversial cheerleaders. I just want to finish by saying your reputation is amazing. I will not let you down. You will be very, very impressed, I hope. Reporter: Praise from then candidate trump even though Jones the alt-right conspiracy theorist behind the site infowars claimed the tragedy at sandy hook where 20 children were shot and killed was a hoax. Sandy hook is a synthetic completely fake with actors in my view manufactured. Reporter: He claims 9/11 was an inside job. I'll tell you the bottom line, 98% chance this was a government orchestrated controlled bombing. I've been telling you this was going to happen. Reporter: But now the Austin American statesman said lawyers for him says the man behind those radical ideas that garnered more continue a billion YouTube views is just plain a character, that he is a performance artist. The shocking claim coming during a pretrial custody hearing between Jones and his ex-wife. Reporters Jonathan tilllove has been in court covering the case for the paper. It's one of Alex Jones' law lawyers said that to hold Alex Jones accountable for the character he plays on hold would be like holding Jack Nicholson for playing the role joker in \"Bat man.\" Reporter: His ex-wife says he's not a stable person. Caring for their three children full time and he broadcasts from his home where he their kids can watch him. I will break your jaw. I will knock your teeth out. I will break your nose and I will break your neck. Reporter: The case and judge said it should be best for the children. This case is not about infowars and I don't want it to be about infowars. Now, jurors will have to decide about there is a difference between Alex Jones the host and Alex Jones the father. Jones and his wife have been divorced since 2015. He currently has full custody of the children. Jury selection is now under way. Tom, let's talk about it with Dan Abrams right now. Sir, Alex Jones' whole brand is based on the idea giving you the real story and not the fake news. Now he seems caught between pro-tensioning his brand and preserving his wherelationship with his kids. Saying outrageous things is good for ratings and can help you get shares and views and traffic and money and yet saying really outrageous things does in the help in the context of a custody battle. The judge is saying I don't want it to be about infowars. That's a good sign for Alex Jones because he wants to separate as much as possible out what he says there from what he does in person. Does that mean the judge is buying the argument -- Not necessarily. Look, and because we got to be careful. This is a custody battle where you decide what is in the best interest of the children. And that's ultimately what the judge is going to have to focus on. Hyper focus on. Try not to get too caught up in what he says. Now, the problem for Alex Jones is if you do get a judge who says, my goodness, these sorts of things said in the house where his studio is nearly the children, et cetera, could be detrimental to them. I mean it's sort of an unbelievable situation here. The real question is going to be in my view from a media perspective. Do his listeners square? Do we know -- he's not rebutting his lawyer. I don't think they're going to care. Look, these are people listening to stuff talking about 9/11 conspiracy theories and how Oklahoma City and sandy hook and all these other things were an inside job. You get some language in a custody hearing where he said, oh, I was an entertainer. I don't think people will hold him accountable to facts like a judge will. Over to robin. All right, George, coming up\nThis transcript has been automatically generated and may not be 100% accurate.",
    "source_domain": "abcnews.go.com",
    "title": "Ex-wife of Alex Jones called him unstable amid custody battle",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnews.go.com/GMA/video/wife-alex-jones-called-unstable-amid-custody-battle-46857464"
}