{
    "authors": [
        "Alison Humble",
        "Tara N",
        "Carol Mason",
        "Kylie P"
    ],
    "date_download": "2017-02-15 15:54:47+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 13:30:16",
    "description": null,
    "filename": "http%3A%2F%2Fbookgirl.beautyandlace.net%2Fbook-review-country-roads.json",
    "image_url": "http://bookgirl.beautyandlace.net/files/2016/06/headingo-copy-100x100.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Author: Nicole Hurley-Moore\nISBN: 978-1-76029-531-8\nRRP: $29.99\nCountry Roads is a rural romance set in the small fictional Victorian town of White Gum Creek. A small town with a great sense of community and a rather rampant rumour and gossip mill; so very much like all the small towns you read about in rural romances.\nThere is nothing ground-breakingly original in Country Roads but it is still an enjoyable read. In the wake of drought farmers are hoping for a decent rainfall to herald better seasons but in the mean time they are trying to ensure the farms can stay afloat. This means different things to different farmers, some are simply being more frugal with their spending like Jack Duprey who is putting off making any purchases until things are looking a little better; some are selling off parcels of land or some of their stock to create a safety net and then there are the ones trying to create a false sense of security within the town by flashing cash and making offers on properties they couldn’t possibly afford.\nWhite Gum Creek is a small town where most of the families have been around for generations so even though newcomers are welcomed they aren’t always viewed as permanent additions to the town, or viewed as locals for decades. The ‘blow-ins’ are often not expected to stay, especially if they come from a city.\nMatt Harvey is a Melbourne born and bred author who picks up a parcel of land in town as a fresh start and writers retreat after suffering severe writer’s block in the aftermath of the car accident that left him injured and his fiancee deceased. Unfortunately for Matt it was land that the Dupreys had been hoping to buy in a purchase that would increase their property which made Bec a little less welcoming than she may have been.\nRebecca Duprey lives and breathes Bluestone Ridge, the family property. Her father had an accident and has been wheelchair bound for a couple of years, there is a lot that he can no longer do so he likes to retain complete control of the running of the farm and the finances. Bec understands, in theory, but it doesn’t stop her hurting and feeling like the hired help. She’s buried her heart and soul in the family property and feels like her input is unappreciated. Part of her unwavering dedication to the property is that it keeps her out of town, away from the rumour mill and closed off from forming attachments.\nThe story is a heartwarming tale of taking chances, of facing your fears and opening yourself up to new experiences. It’s also the tale of old rivalries, underhanded tactics and sacrifice.\nBec fell in love young and had her heart shattered in the worst way. Living in a small town meant that everyone had an opinion and she was the talk of the town, and she hated it. She never made it clear what had happened but there was always talk and she has spent the years since keeping as far from her ex as possible. It’s no surprise that she’s a little sceptical when he starts sniffing around again, he wants her to forgive him but more than that it seems he wants her back…. the question is why.\nThere were characters that I really disliked, whose behaviour was deplorable but there were characters that I really liked. They were well developed and their motivations were completely understandable.\nCountry Roads has a cast of characters who have suffered, and we share in their suffering but also in their recovery. In the way that they can empathise and share understanding with one another. Most of the storylines were nicely rounded up by the end of the book but there are loose ends that I am interested to know more about and there is a part of me that hopes for a follow up novel about the return to living for one of the secondary characters.\nI enjoyed Country Roads, it was a sweet story and the characters were engaging.\nCountry Roads is book #5 for the Australian Women Writer’s Challenge 2017.\nNicole Hurley-Moore can be contacted on her Website, Facebook and Twitter.\nCountry Roads is available now through Allen & Unwin and from Booktopia, Angus & Robertson Bookworld and where all good books are sold.\nYou May Also Like:",
    "source_domain": "bookgirl.beautyandlace.net",
    "title": "Book Review: Country Roads",
    "title_page": null,
    "title_rss": null,
    "url": "http://bookgirl.beautyandlace.net/book-review-country-roads"
}