{
    "authors": [
        "Lisa W",
        "Ann-Marie Day",
        "Jessica Gill"
    ],
    "date_download": "2018-05-31 03:28:13+00:00",
    "date_modify": null,
    "date_publish": "2018-05-31 08:25:20",
    "description": null,
    "filename": "http%3A%2F%2Fbookgirl.beautyandlace.net%2Fbook-review-birthright.json",
    "image_url": "http://bookgirl.beautyandlace.net/files/2016/06/headingo-copy-100x100.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rating: 5.0. From 2 votes. Please wait...\nAuthor: Fiona Lowe\nISBN: 9781489246745\nRRP: $29.99\nPublisher: HQ Fiction\nCopy: Courtesy of the Publisher\nBirthright was a March book club title and I snuck the reading in right at the end of the month, then got caught up in admin for April and before you know it I’m looking down the barrel of JUNE and still haven’t written the review. That means it’s been way too long so this review is definitely going to be a bit of a challenge to write but I’m determined to get it done before throwing myself into June admin.\nThe book opens on Mother’s Day with Sarah awakening to an alarm that didn’t need to be set, way too early for any Sunday let alone Mother’s Day. In what is a common thought for many mothers she finds herself thinking, on more than one occasion throughout the day, that this is supposed to be her day. She hosts a Mother’s Day lunch at her place for her mother and siblings trying to walk the fine line between having a mother’s day for herself and celebrating her mother.\nI really loved this book and the themes it raised though I have to say that I really didn’t like most of the characters at one point or another.\nFiona Lowe started her writing career with romance novels but in the last couple of years has spread her typing fingers and expanded into family sagas, and this one certainly is a saga. There is drama, betrayal, secrets, lies and despicable behaviour.\nIt’s one thing to have a family pull out the swords and fight like carrion over a will after a death in the family when emotions are already high and grief is in the mix. I think it’s a completely different thing for the backstabbing and sneaking around to try and find out, then change, the terms of a will before the family member is even on their deathbed, it is completely reprehensible. Family should be about so much more than what you’re going to get when your loved ones pass away. I know this sort of thing happens, and it happens a lot, but it doesn’t make it any easier for me to fathom.\nI actually don’t know which character I liked the least, there was so much deplorable behaviour going on.\nMargaret is the family matriarch and she’s a formidable woman, she’s always been the strength of the family but it doesn’t take long to see how she plays her children off against one another and manipulates them all. Her strength and perceived invincibility make it harder to watch her health begin to deteriorate, and her personal struggle with her ailments after always being so strong, both mentally and physically.\nBirthright explores the idea of inheritance and whether it is a birthright or a reward earned for being a dutiful child, do the right thing for your parents in life and you will be rewarded by their death. Or do you deserve a fair share just by being one of the offspring? It also explores all of the pitfalls and strings attached when that inheritance is dangled in front of you; whether for compliance, incentive or the pure joy of manipulation.\nAll of these characters have more than their fair share of angst and family issues, outside of any sibling rivalry that they’re facing. I think Ellie is my favourite character, she’s flawed and she knows it. She is the baby of the family and there is quite a decent age gap between herself and Sarah and Cameron. They weren’t living at home in their small Victorian town when she became a troubled teen and went a little wild, before leaving town and vowing not to return.\nThe long held resentments that have been kept well hidden start to break free and battle lines are most definitely drawn as a family ends up losing sight of their family bonds.\nThere is so much drama in this family that it’s no wonder battle lines were drawn but some of the issues they face are issues that you need your family by your side for.\nI really enjoyed following the family through fracture and drama to watch them come through the other side. Inheritance isn’t the only issue facing the Jamieson’s, there’s abuse, infidelity, divorce, building new business, out of character teenage behaviour, betrayal, lies and shady business dealings. And that’s before they start uncovering the secrets that were buried in the past.\nBirthright was a story that definitely captured my attention and kept me enthralled, even when I couldn’t find much to like about the characters. A book that I would recommend unreservedly, and will have me looking out for the new Fiona Lowe title.\nFiona Lowe can be found on Facebook, Twitter, and her Website.\nBirthright is book #14 for the Australian Women Writer’s Challenge 2018.\nThanks to Harlequin 20 of our Beauty and Lace Club members have read Birthright and you can read what they thought at BOOK CLUB: Birthright.\nBirthright is available now through Harlequin and from Angus and Robertson Bookworld, Booktopia and where all good books are sold.\nYou May Also Like:",
    "source_domain": "bookgirl.beautyandlace.net",
    "title": "Book Review: Birthright",
    "title_page": null,
    "title_rss": null,
    "url": "http://bookgirl.beautyandlace.net/book-review-birthright"
}