{
    "authors": [
        "Trish Drinkwater",
        "Emma Reed",
        "Cheryl Haining",
        "Deb Mitchell"
    ],
    "date_download": "2018-02-03 12:44:56+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 09:38:20",
    "description": null,
    "filename": "http%3A%2F%2Fbookgirl.beautyandlace.net%2Fbook-club-reads-for-february-2018.json",
    "image_url": "http://bookgirl.beautyandlace.net/files/2016/06/headingo-copy-100x100.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rating: 5.0. From 1 vote. Please wait...\nThe silly season is over, school is back in session and routine is slowly returning to life. Hopefully, that means that I can start getting on top of things, slowly because I’m still a little further behind than I wanted to be.\nFebruary we have quite a great list ahead of us. There are some titles I have been super excited for and I can’t wait to get to. I really want to get this out so I will keep it quick and just tell you about the amazing books we have coming up.\nGrace On The Court – Maddy Proud\nBlack Inc. Books – Piccolo Nero – Children’s\nGrace Parker tries to figure out how to handle the 3Bs: boys, boy bands and ball sports.\nThings were simple for netball nerd Grace Parker at primary school. She was captain of her school team – and with her best friends, Stella and Mia, by her side, they won the grand final. Back then, her biggest problem was persuading her parents to buy her tickets to see Friday at Five, the world’s hottest boy band.\nBut high school’s a whole new story … Grace’s greatest rival on the court, Amber Burns, just made the same netball team as her. Her twin brother, Gus, is devastated he didn’t make the A-grade AFL side. Her older brother, Tyler, is ignoring her. And as if that wasn’t enough for a 13-year-old girl to handle, gorgeous aspiring rockstar Sebastian King is suddenly paying her a lot of attention.\nSay You’ll Remember Me – Katie McGarry\nHarlequin – HQ Young Adult – Young Adult\nThey stood together against the world\nWhen Drix was convicted of a crime — one he didn’t commit — he thought his life was over. But opportunity came with the new Second Chance Program, the governor’s newest pet project to get delinquents off the streets, rehabilitated and back into society. Drix knows this is his chance to get his life back on track, even if it means being paraded in front of reporters for a while.\nElle knows she lives a life of privilege. As the governor’s daughter, she can open doors with her name alone. But the expectations and pressure to be someone she isn’t may be too much to handle. She wants to follow her own path, whatever that means.\nWhen Drix and Elle meet, their connection is immediate, but so are their problems. Drix is not the type of boy Elle’s parents have in mind for her, and Elle is not the kind of girl who can understand Drix’s messy life.\nBut sometimes love can breach all barriers.\nFighting against a society that can’t imagine them together, Drix and Elle must push themselves — Drix to confront the truth of the robbery, and Elle to assert her independence — and each other to finally get what they deserve.\nSilent Corner – Dean Koontz\nHarper Collins Publishers – HarperCollins – Thriller\nFrom #1 New York Times bestselling author of dark psychological suspense and modern classics of mystery and adventure comes a thriller that ventures into science, secrecy and danger.\n“I very much need to be dead.”\nChilling last words left by a man who had everything to live for but took his own life. People of talent and accomplishment, people seemingly happy and sound of mind, are committing suicide in surprising numbers. A disturbing pattern is beginning to emerge.\nFBI agent Jane Hawk, recently widowed, is determined to find out why. Which means going rogue and into ‘the silent corner’ – living entirely off the grid even as she hunts her foes. The enemies pursuing her are seemingly endless and unstoppable. But Jane is as clever as they are cold-blooded, as relentless as they are ruthless. And this one woman will uncover a secret so terrifying that it challenges the limits of science itself.\nThe Queen of Bloody Everything – Joanna Nadin\nPan Macmillan – Mantle – Contemporary fiction\n“Small town, small minds,” you say, as now-to-be-neighbours watch us through twitching nets as we drag dustbin bags and old crisp boxes from the back of Maudsley Mick’s Transit. I stare back defiantly as I march up the path, ignoring the trail of tampons, playscripts, a potato masher that I leave in my wake. I am still, of course, happy to style myself as you. Because you – and Mick, and Toni, and the revolving cast of misfits, dropouts and almost-damned that bed down on borrowed floors – are all that I know.\nBut that is about to change…\nDido Sylvia Jones is six years and twenty seven days old when she moves from London squat to suburban Essex and promptly falls in love with Tom Trevelyan, the boy next door. It’s not just him Dido falls for, though: it’s also his precocious sister, Harry, and their fastidious, controlling mother, Angela.\nBecause Angela is everything that Edie – Dido’s own mother – is not. And the Trevelyans are exactly the kind of family Dido dreams of.\nNormal.\nWhich is what Dido wants to be, more than anything else in the world.\nBut normal is the very thing Edie can never be, as Dido – and the Trevelyans, including Dido’s beloved Tom – will eventually learn the hard way.\nLike the very best families, Joanna Nadin’s The Queen of Bloody Everything is funny, warm, tender and heart-breaking in equal measure. Part love story, it’s ultimately about mothers and daughters; about realising, however long it takes, that family might be what you make it, but you can’t change where you come from.\nThe Right Girl – Ellie O’Neill\nSimon & Schuster – General Fiction\nWhat do you do when your perfect life . . . isn’t?\nFreya has the best life – she’s officially in love and her floristry business, Blooming Brilliant, is going from strength to strength.\nTwo years ago, it was a different story. She was barely employed as the worst waitress in the world, with no hope of a boyfriend, and no bank balance. But then she got BBest, a lifestyle app that knows you better than you know yourself. It changed everything. It streamlined her life, taking her likes and dislikes and skills and foibles, and gave her the best options so she doesn’t make mistakes anymore. Freya has never looked back – and neither has anyone else. Everyone loves BBest, it’s a game changer.\nBut if she’s so in love, why doesn’t it feel exactly right? And who is that mysterious man in her beloved grandfather’s bookshop with soulful eyes that leave her unstitched? All of a sudden Freya has so many questions – and no one seems to be able to answer them. She begins to wonder what she really agreed to when she let BBest into her life. Then her grandfather is arrested, and Freya is thrust into a world she could never have imagined in her shiny, successful existence.\nWhen you have the perfect life, should you listen to your head or your heart?\nThe Ruin – Dervla McTiernan\nHarper Collins – Harper Collins AU – Crime & Mystery\nGalway 1993: Young Garda Cormac Reilly is called to a scene he will never forget. Two silent, neglected children – fifteen-year-old Maude and five-year-old Jack – are waiting for him at a crumbling country house. Upstairs, their mother lies dead.\nTwenty years later, a body surfaces in the icy black waters of the River Corrib. At first it looks like an open-and-shut case, but then doubt is cast on the investigation’s findings – and the integrity of the\npolice. Cormac is thrown back into the cold case that has haunted him his entire career – what links the two deaths, two decades apart? As he navigates his way through police politics and the ghosts of the past, Detective Reilly uncovers shocking secrets and finds himself questioning who among his colleagues he can trust.\nWhat really did happen in that house where he first met Maude and Jack? The Ruin draws us deep into the dark heart of Ireland and asks who will protect you when the authorities can’t – or won’t.\nThe Rules of Backyard Croquet – Sunni Overend\nHarper Collins – Harper Collins AU – General Fiction\nDisgraced fashion prodigy Apple March has gone into hiding, concealing herself within the cashmere and silk folds of a formerly grand fashion boutique – the hanging of blouses and handling of difficult patrons now her only concern.\nBut when her sister Poppy needs a wedding dress, old passions are reignited … along with threats from her past.\nAs Apple finds herself falling for someone she shouldn’t, her quest to re-emerge becomes entangled in a time she wants forgotten, and life unravels as quickly as it began to mend.\nFrom the cool heart of Melbourne, to Paris and New York, in an effervescent world of croquet, Campari and cocoon coats, can Apple prevail over demons past to become the woman she was born to be?\nThe Woman In The Window – A.J. Finn\nHarper Collins – Harper Collins GB – Thriller/Suspense\nWhat did she see?\nIt’s been ten long months since Anna Fox last left her home. Ten months during which she has haunted the rooms of her old New York house like a ghost, lost in her memories, too terrified to step outside.\nAnna’s lifeline to the real world is her window, where she sits day after day, watching her neighbours. When the Russells move in, Anna is instantly drawn to them. A picture-perfect family of three, they are an echo of the life that was once hers.\nBut one evening, a frenzied scream rips across the silence, and Anna witnesses something no one was supposed to see. Now she must do everything she can to uncover the truth about what really happened. But even if she does, will anyone believe her? And can she even trust herself?\nA huge thanks goes out to the publishers without whom we could not offer such great reads. Harlequin, HarperCollins, Pan Macmillan, Black Inc. Books and Simon and Schuster. We are so grateful for the support you show us, we couldn’t do it without you.\nIf you aren’t yet a member of the Beauty and Lace Club there is still time to join, head over to the signup page and take a look: yoursay.beautyandlace.net.\nHappy Reading, have fun selecting preferences and we look forward to hearing what you think.\nYou May Also Like:",
    "source_domain": "bookgirl.beautyandlace.net",
    "title": "Book Club Reads for February 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://bookgirl.beautyandlace.net/book-club-reads-for-february-2018"
}