{
    "authors": [
        "Jennifer Heyward",
        "Rachel Kriss-Newell",
        "Carla Ruesseler",
        "Anne Maree Peachey",
        "Christine Laouris"
    ],
    "date_download": "2017-01-02 19:23:48+00:00",
    "date_modify": null,
    "date_publish": "2017-01-03 05:06:03",
    "description": null,
    "filename": "http%3A%2F%2Fbookgirl.beautyandlace.net%2Fblog-tour-book-review-to-the-sea.json",
    "image_url": "http://bookgirl.beautyandlace.net/files/2016/06/headingo-copy-100x100.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Author: Christine Dibley\nISBN: 978-1-74354-744-1\nRRP: $32.99\nTo The Sea is the debut novel of Tasmanian author Christine Dibley, a novel which weaves Irish folklore into a contemporary missing person case for a captivating read which will definitely keep you on your toes.\nZoe Kennett is a seventeen year old girl from a big family celebrating Christmas in the family’s beach house on the Tasmanian coast; she is an accomplished swimmer and sailor who disappeared in calm, clear waters.\nDetective Inspector Tony Vincent is the senior officer who responds to the call and the further the investigation delves the more the pieces don’t seem to fit.\nThe story is told from multiple points of view and spans centuries, and continents. Dibley has deftly woven Irish folklore into the narrative in a way that leaves everyone wondering, could this actually play a part in the disappearance of a talented 17-year old girl.\nTo The Sea is very much a character driven novel and through the pages we realise just how little these characters knew about Zoe. She is one of five children and the youngest by far, her oldest nieces and nephews are the same age as her, meaning that her siblings really don’t know her very well at all. They had all moved out of home, and many away from Tasmania, before she was born. This was one aspect of the story I could relate to because I moved out of home when my youngest sister was still a baby and my other sisters were still quite young; it really does have a profound affect on the relationship you form with siblings from long distances.\nIn Zoe’s case it wasn’t just her siblings that didn’t know her well. Her cousins, her friends and even the boyfriend her family wasn’t aware of didn’t know her intimately.\nDifferent characters told their own stories, all of which melded for a cohesive and gripping story with some unpredictable twists and an ending that I didn’t see coming.\nThe theme of history repeating throughout the generations is palpable and it left me making predictions that didn’t always come to fruition.\nI really am a little at a loss of what I want to say about To The Sea because I don’t want to spoil anything and this is a very complex family saga. The characters and the dynamics are intricate and well developed, leaving you needing to know more at every turn. The size of the book was a little daunting to begin with, 447 pages is a little heftier than I’ve been reading of late, but I got through it quite quickly because I was so entranced.\nDibley has captured the beauty and the untamed wilds of the oceans and the coastlines in her settings, both in Tasmania and in Ireland. Her writing evokes vivid pictures of both land and sea, as well as her main characters, and I can’t wait to see what she may have in store for us next.\nBe sure to check back tomorrow because we have an interview with Christine Dibley where we learn a little more about her process and her story.\nChristine Dibley can be followed on Facebook.\nTo The Sea is book #64 for the Australian Women Writer’s Challenge 2016.\nTo The Sea is published by Pan Macmillan and is available now from Angus & Robertson Bookworld, Booktopia and where all good books are sold.\nRRP: $32.99\nYou May Also Like:",
    "source_domain": "bookgirl.beautyandlace.net",
    "title": "Blog Tour Book Review: To The Sea",
    "title_page": null,
    "title_rss": null,
    "url": "http://bookgirl.beautyandlace.net/blog-tour-book-review-to-the-sea"
}