{
    "authors": [
        "K.C. Wise",
        "Written By"
    ],
    "date_download": "2018-02-03 05:56:36+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 17:03:56",
    "description": null,
    "filename": "https%3A%2F%2Fblackbunchedmassmom.com%2F2018%2F02%2F02%2Fquiet-thoughts-reclaiming-ritual%2F.json",
    "image_url": "https://blackbunchedmassmom.com/wp-content/uploads/2018/02/IMG_20180127_120224-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Photo: My mother-in-law gifted me an amaryllis bulb for Christmas and it has come into full bloom. This photo was actually taken last week… the sunlight was too dramatic to resist. I’ve never had a “forced bulb” in winter before. It’s an absolutely wonderful gift for the house, adding much-needed color and elegance to the room. It makes me want to add more to the house plant collection. I’m running out of window space!\nA meeting I had scheduled for yesterday morning was gloriously cancelled, giving me my first free morning in nearly two weeks. I was almost giddy when I put the boys on the bus and got back in the house. What to do with myself? I committed to scrubbing the two bathrooms we have, which were embarrassing, to say the least. I changed into my cleaning clothes and started taking out the necessary tools of the trade. I looked at the mirror to assess its level of need and noticed my hair.\n“I ought to take this time to clean up these edges,” I said out loud, looking over things.\nIt’s a tricky word, “clean.” It’s a powerful word when it comes to my hair. I thought about why I said it and what I meant by it. I washed my just on Monday, so it was plenty clean. Looking at the thick new growth, the scraggly new grays (I feel like I get a new one every day), my hair has never been healthier. I’d sacrificed a curated, neat look for much needed healthy growth. I can’t remember when I last twisted my hair.\nI’ve maintained my natural hair since 2008, and started locing it a few months after Minor was born. I remember visiting Maryland that summer, my 2-strand twists starting to make their change to baby locs. I was standing in my Father’s kitchen and he eyed me with complete contempt.\n“Locs are disgusting,” he spat. “They stink. They get ashy. They are just dirty. Never met a woman with ’em who I didn’t think, ‘that’s just dirty hair.'”\nI was shocked more than I was angry at the moment. It was a statement that pierced right through every layer of me. There are few things worse a person can say to me, let alone my own father. “Who calls their own daughter ‘dirty’? Who the hell does that?”\n“I’m not calling you dirty. I’m calling your hair dirty! It’s a dirty choice for wearing your hair! It’s unattractive!”\nThere were so many reasons to argue with him, and I did. He was unconvinced and I was disappointed in the most visceral ways. I rejected his bullshit outright, doubling down on my commitment to loc my hair just to prove him wrong. But, as hurtful words do, they dug in, finding places to live and changing my behavior. It came in the form of over-conditioning my hair and twisting it too often. I felt the compulsion to wash it, to keep the locs perfectly curated and never, ever become unkempt. My locs started to thin and break from the overwork. Years of hard work came undone as I lost some, twisted others together in an effort to save them. I decided to stop twisting. I think I’ve gone at least 6 months without touching it, if not longer. The resulting growth has been phenomenal.\nThe hard won new growth, thick and untamed, was beautiful in its own way. But as I’ve had to participate in more than a few professional events recently, I’ve been covering it up with headbands and scarves. I tell myself it’s out of presentation… but I wonder if I subconsciously have decided that my pure, raw hair is just not appropriate for public consumption. I thought, as I approached the process with these reflective questions in mind, how I could reclaim the ritual of twisting. How can I make this a ritual that feeds me, rather than a compulsion to conform me to an imposed image from the outside?\nMy Quiet Thoughts are on how good it felt to go through the process. The warmed oils on my scalp, the long shower to wash and condition, the velvety raw cocoa butter in my fingers during the twisting, the click and clack of the clips I use to hold the twists in position as I go. I listened to an audiobook and took my time. The only thing I missed was the community of home: growing up, hair was a family activity with me, Mom and my sister in the kitchen or at a salon. It was always hours-long and a pain… but now, ever alone in these sorts of things, it would have been nice to hear stories in familiar cadence, laugh at stories only we can tell, commune over the shared narrative of womanhood and Blackness. I don’t know when I’ll next need to do it, but I hope that my next retwist will be as satisfying and filling as this one was.\nIn the end, I was indeed “clean.” My hair looks fabulous; the new growth now integrated with the established twists, the length of each loc now more pronounced. I feel more confident and bold, feeling like I’m presenting my best self when I walk into these meetings and events coming up. As my roles evolve and my involvement grows, the love for myself is my best tool, my most beautiful feature.\nUltimately, a person will see me or they won’t. They’ll know me, or they’ll pass me over. I have to choose myself. I have to know that I’m beautiful.\nIt’s a night of howling wind carrying cold that cuts straight to the bone. It bites and scratches at uncovered skin, burrowing through even the thickest coats and sweaters underneath. The sky is clear, the sun golden on the western horizon. You see the ball of fire and dare it to be more helpful, pleading for it to give off even a degree more heat before it visits the other parts of the world. It is unsympathetic, I guess. At least we have the full moon to look forward to in a bit.\nMy Dear Reader, it’s cold, but it’s Friday. Even cold Fridays are for wishes. I wish you, first and foremost, all the warm stuff. I’m talkin’ the works: an oversized blanket, socks that go well above the ankles, flannel pants and long-sleeved shirts, a roaring fire if you can have one, a steaming cup of comforting tea. Share or don’t share, Dear Reader! Well, share. Warmth is literal and figurative… and on nights like this, you most certainly need both! I wish you a very good book to get lost in and a good chunk of time to read it. A good counter-balance to all the loudness to come on Sunday night, no? I wish you a beautiful natural thing to stare at for a moment: a forced bulb in a window, an animal strolling by, a glorious sunset, or a mesmerizing sunrise. I hope it inspires you for the rest of the weekend and spurs you to create something beautiful yourself. I wish you the warmth of a held hand, a kiss on the cheek. I wish you the pleasure of a secret, or the intimacy of a whisper in your ear. Something that makes you want to pull a person close, to feel the warmth of their breath, the power of their steady gaze. When was the last time you really had a halting moment with the person you love? Spark something this weekend, Dear Reader. You don’t need a holiday to do that, you know.\nI wish you the powerful knowledge that you are infinitely beautiful. Your presence in this world matters and what you choose to do on a daily basis has weight and meaning. There are people near and far who think of you and love you, who admire you not only because of what you’ve accomplished, but simply because of who you are. Walk with a strong sense of self-love and trusting purpose. You are the light in the darkness for more people than you could possibly know.\nUntil Monday, stay warm and take care.\n(and Go Eagles! For the love of goodness, PLEASE beat the Patriots!!!!)\nShare this: Facebook\nTwitter\nPinterest\nEmail",
    "source_domain": "blackbunchedmassmom.com",
    "title": "[Quiet Thoughts] Reclaiming Ritual",
    "title_page": null,
    "title_rss": null,
    "url": "https://blackbunchedmassmom.com/2018/02/02/quiet-thoughts-reclaiming-ritual/"
}