{
    "authors": [
        "K.C. Wise",
        "Written By"
    ],
    "date_download": "2018-05-31 03:34:57+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 17:43:42",
    "description": null,
    "filename": "https%3A%2F%2Fblackbunchedmassmom.com%2F2018%2F05%2F30%2Fof-pride-and-neighbors%2F.json",
    "image_url": "https://blackbunchedmassmom.com/wp-content/uploads/2018/05/IMG_20180528_091602-1024x768.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Photo: Why is it so impossible to get a photo of both of them smiling at the camera at the same time?\nMy two little bears proudly marched in the Memorial Day parade on Monday. The whole thing was very Small Town America, but with the obvious Massachusetts twist of having our colonial company lead the parade with fife and drum. The middle school band, the high school band, a single camo-colored jeep with 3 town officials riding in it, a Boy Scouts troop, a Girl Scouts troop and two Cub Scout troops made up the marchers, with most of the onlookers on the street being the parents in town. There is commentary there: about values and ritual and such… but I’ll let that be. All I know is that I spent my time with another Scout Mom catching up and chatting in a minivan while waiting for the parade to go up the street and then come down another one.\nThe boys were proud participate. As you can see from the photo, they looked mighty sharp in their uniforms. I didn’t have a great impression of Scouts before having kids and watching them participate. I really must say that Scouting has done a lot for my two boys. It has taught them a lot and presented them with multiple opportunities to try safe, yet challenging, new things. Watching them march by with their flags and little waves… it was very nice indeed.\nI will say that I’m mighty grateful that everyone behaved. I had my misgivings, given the current climate, of being a Black women at a “patriotic” affair. But it was family friendly and everyone was on their best behavior. I have to learn to better trust my neighbors, despite the darkness that has bubbled to the surface.\nAnd now it’s a sprint to the end of the school year. My God, we’ve got something going on every single day. I’m keeping this post short tonight because I’ll be stepping out the door in one hour to teach my class. Between now and then, I need to fry fish, serve it for dinner, eat it, get dressed, and do something about this hair. Madness, Dear Reader, madness.\nBut I did want to share one more picture today. Look at this monster who stepped into my yard!\nSo here is the thing, though: this photo was taken near the playfort and the playfort abuts the stone fence. How did the turtle traverse the stone fence!? Like… there is no way, right? There is absolutely no way? I’m super confused!\nI’m officially surrounded by my favorite animals: turtles, owls, and foxes. Our hawk family is a bonus, but I didn’t love hawks until we moved here. I have always loved turtles and consider them to be good luck. While taking pictures, I spoke this guy for a while, asking for a little bit of luck, a little bit of wisdom. I texted my friend a photo and she told me that this is a snapping turtle and is probably more bad news than good. Their bites, I hear, are really awful. In the time it took me to get to Wegmans and back, dude bro had cleared out. I guess he was just passing through. I do hope he left a bit of luck (and not poop) behind.\nI’ve got to get back to the gauntlet. Oh, Wednesdays! But I will be here for Quiet Thoughts. I hope you are keeping up with it all like I am, Dear Reader. Lord, it’s a lot right now, isn’t it?\nUntil then, take care.\nShare this: Facebook\nTwitter\nPinterest\nEmail",
    "source_domain": "blackbunchedmassmom.com",
    "title": "Of Pride and Neighbors",
    "title_page": null,
    "title_rss": null,
    "url": "https://blackbunchedmassmom.com/2018/05/30/of-pride-and-neighbors/"
}