{
    "authors": [
        "Architect",
        "Graduate",
        "University Of Michigan",
        "Articles",
        "Seeds",
        "Comments",
        "Since"
    ],
    "date_download": "2017-08-14 21:42:00+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 14:38:00",
    "description": "WASHINGTON (The Borowitz Report)—A disturbing hostage video surfaced on Monday showing an American man woodenly reciting words that were not his own.\nThe video, which was broadcast on all the major news networks, raised concerns for the man, whose robotic performance indic …",
    "filename": "https%3A%2F%2Fannethefan.newsvine.com%2F_news%2F2017%2F08%2F14%2F38179382-man-in-hostage-video-forced-to-recite-words-not-his-own-the-new-yorker.json",
    "image_url": "https://m.newsvine.com/servista/imagesizer?file=annethefan826D3250-904A-C54B-865E-BFFFB7ADB2F5.jpg&width=original",
    "language": "en",
    "localpath": null,
    "maintext": "WASHINGTON (The Borowitz Report)—A disturbing hostage video surfaced on Monday showing an American man woodenly reciting words that were not his own.\nThe video, which was broadcast on all the major news networks, raised concerns for the man, whose robotic performance indicated that he was reading a prepared statement under duress.\nWhile the man appeared well fed and, to a certain extent, healthy, his facial expressions and body language convinced experts that the act of reciting the prepared text was an extraordinary ordeal for him.\nHarland Dorrinson, a forensic psychologist, compared the man’s performance with hours of earlier footage of him and said that the man had “never expressed these sentiments before.”\n“He did not seem to understand what he was saying,” the psychologist said. “At times, he appeared to be reading these words phonetically.”\nAdditionally, Dorrinson said, the man’s speech patterns in the hostage video were strikingly different from those in earlier videos of him. “From the moment he began speaking, the subjects in his sentences agreed with the verbs,” he said.\n\"That set off alarm bells.\"",
    "source_domain": "annethefan.newsvine.com",
    "title": "Man in Hostage Video Forced to Recite Words Not His Own | The New Yorker",
    "title_page": null,
    "title_rss": null,
    "url": "https://annethefan.newsvine.com/_news/2017/08/14/38179382-man-in-hostage-video-forced-to-recite-words-not-his-own-the-new-yorker"
}