{
    "authors": [
        "Architect",
        "Graduate",
        "University Of Michigan",
        "Articles",
        "Seeds",
        "Comments",
        "Since"
    ],
    "date_download": "2017-06-14 20:56:16+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 13:56:00",
    "description": "Former prosecutors who have served in both Republican and Democratic Administrations told me that an obstruction-of-justice case against Trump is a no-brainer. “Comey’s testimony in a grand jury would be enough to get an indictment,” Julie O’Sullivan, wh …",
    "filename": "https%3A%2F%2Fannethefan.newsvine.com%2F_news%2F2017%2F06%2F14%2F37749593-is-trump-now-a-subject-of-the-mueller-investigation-the-new-yorker.json",
    "image_url": "https://m.newsvine.com/servista/imagesizer?file=annethefanD1C88A0E-7C74-C22D-46AE-EDE656BCA7FC.jpg&width=original",
    "language": "en",
    "localpath": null,
    "maintext": "Former prosecutors who have served in both Republican and Democratic Administrations told me that an obstruction-of-justice case against Trump is a no-brainer. “Comey’s testimony in a grand jury would be enough to get an indictment,” Julie O’Sullivan, who was part of the team that investigated Whitewater, the Clinton land deal that attracted a special prosecutor in the early nineties, said. To O’Sullivan, Comey’s detailed account of the Oval Office meeting in which Trump cleared the room and then told Comey to let go of the investigation of Michael Flynn, whom Trump had fired, the previous day, was especially damning because it showed that Trump knew that what he was doing was wrong.\n“For a prosecutor, this attempt to hide the conversation, all antenna are going up,” O’Sullivan told me. “That tells you that he has a consciousness that what he’s about to do is wrong. It’s like having a bonfire with documents in the back yard. It’s wonderful. Seriously, this is the best thing ever for a prosecutor.”\nTo be sure, there is some disagreement among former prosecutors. “I think it is very reckless for any former prosecutor to say an obstruction-of-justice case can or can’t be made based on one witness’s testimony,” Matthew Whitaker, a former U.S. Attorney who was appointed by President George W. Bush, and who ran as a Republican Senate candidate in Iowa, in 2014, said. “That makes me queasy. I’m shocked that so many former prosecutors are convicting the President of that crime.” But, among former prosecutors, Whitaker appears to be in the minority.\nThere is some public evidence that Mueller is taking the obstruction accusation seriously. He asked for and received all the memos that Comey wrote memorializing Comey’s interactions with Trump. Why would Mueller need those unless he was looking into possible obstruction?\nClick on link for more juicy details....",
    "source_domain": "annethefan.newsvine.com",
    "title": "Is Trump Now a Subject of the Mueller Investigation? - The New Yorker",
    "title_page": null,
    "title_rss": null,
    "url": "https://annethefan.newsvine.com/_news/2017/06/14/37749593-is-trump-now-a-subject-of-the-mueller-investigation-the-new-yorker"
}