{
    "authors": [
        "Architect",
        "Graduate",
        "University Of Michigan",
        "Articles",
        "Seeds",
        "Comments",
        "Since"
    ],
    "date_download": "2017-02-15 08:23:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:23:00",
    "description": "MOSCOW (The Borowitz Report)—Russian President Vladimir Putin is “starting to get concerned” that the puppets he installed in the executive branch of the U.S. government “might not be up to the task at hand,” sources confirmed on Tuesday.\nAccordin …",
    "filename": "https%3A%2F%2Fannethefan.newsvine.com%2F_news%2F2017%2F02%2F14%2F36917684-putin-starting-to-wonder-if-his-puppets-are-smart-enough-to-pull-this-off-the-new-yorker.json",
    "image_url": "https://m.newsvine.com/servista/imagesizer?file=annethefanE3E10B3A-C057-2AF9-2FF3-39FADECFD502.jpg&width=original",
    "language": "en",
    "localpath": null,
    "maintext": "MOSCOW (The Borowitz Report)—Russian President Vladimir Putin is “starting to get concerned” that the puppets he installed in the executive branch of the U.S. government “might not be up to the task at hand,” sources confirmed on Tuesday.\nAccording to the sources, the flame-out of the national-security adviser Michael Flynn was only the most recent event that has caused Putin to wonder if the figureheads he propelled into office are “just too dim-witted” to serve the goals of the Russian Federation.\n“When you choose a puppet, you’re looking for a sweet spot,” one source close to Putin said. “You want to choose someone who’s dumb enough to be manipulated, but not so dumb that he can’t find the light switches.”\n“Increasingly, it looks like we missed that sweet spot,” the source said.\nPutin is reportedly willing to have a “wait and see” attitude with his current puppets, but, if things do not improve markedly, he will not hesitate to “make some changes,” the source said.\n“President Putin knew that this bunch didn’t have a lot of experience in government and that there were bound to be some growing pains,” the source said. “But geez.”",
    "source_domain": "annethefan.newsvine.com",
    "title": "Putin Starting to Wonder If His Puppets Are Smart Enough to Pull This Off - The New Yorker",
    "title_page": null,
    "title_rss": null,
    "url": "https://annethefan.newsvine.com/_news/2017/02/14/36917684-putin-starting-to-wonder-if-his-puppets-are-smart-enough-to-pull-this-off-the-new-yorker"
}