{
    "authors": [
        "Joshua Varghese"
    ],
    "date_download": "2017-01-02 11:52:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 10:44:38",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fhonda-navi-gets-two-makeovers-for-2017%2F.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Honda’s exciting mini-bike, the Navi is now available in two more avatars: Chrome and Adventure\nLess than a year after the Navi was launched, it still delivers on excitement and quirkiness for those bold enough to buy it. This new year, Honda Motorcycle and Scooter India (HMSI) have decided that the Navi is due for a couple of aesthetic upgrades.\nThe Navi is now available in two major variants, the Chrome and the Adventure. While the style of the scooter remains intact, you can see that it has a distinct personality in both the avatars. The Adventure edition is for those of you who are willing to rough it out. It comes laden with a knuckle-guard set, bash-plate, headlight protector, adventure visor, custom dual-tone seat cover, luggage box and adventure stripes.\nThe Chrome variant is slightly short of goodies but makes up for it with liberal splashes of chrome on the black paint that is standard for both variants. It has a headlight protector, side lower cover, rear grip, bash-plate and luggage box. Although some of the features mentioned here are not visible in the picture, Honda have claimed that it comes as standard on the vehicle.\nBoth the variants are out in the market. You can book the Adventure edition or the Chrome edition on the Navi app (available on Google Play); they are priced at Rs 49,720 and Rs 46,260 (ex-showroom, Pune) respectively.\nRelated Posts via Categories",
    "source_domain": "bikeindia.in",
    "title": "Honda Navi Gets Two Makeovers For 2017",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/honda-navi-gets-two-makeovers-for-2017/"
}