{
    "authors": [
        "Joshua Varghese"
    ],
    "date_download": "2017-10-07 03:34:11+00:00",
    "date_modify": null,
    "date_publish": "2017-10-03 07:48:21",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fspecial-edition-vespa-red-launched-to-support-fight-against-hiv%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3Dspecial-edition-vespa-red-launched-to-support-fight-against-hiv.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "As we reported earlier, Piaggio India have launched the Vespa Red priced at Rs 87,009 (ex-showroom). There is more to this product than meets the eye. Although the scooter remains the same mechanically, its vibrant coat of paint is not just a marketing gimmick.\nVespa have announced that they will donate $50 (Rs 3,300 approx.) to the Global Fund to fight AIDS in India for every scooter sold in the country. They went on to add that the money generated from the sale of one scooter can provide more than 165 days of life-saving medication.\nThe new scooter was unveiled by Bollywood actor and UN Women Goodwill ambassador, Farhan Akhtar. In addition to presenting the scooter, Akhtar was gifted a scooter, becoming the first owner of the Vespa Red in India.\nGlobally, the Vespa 946 is sold in a completely-red avatar and Vespa donate $150 to (RED) for each scooter sold. In India we won’t be seeing the Vespa 946 Red. Instead, we will have to be content with the 125-cc Vespa Red scooter in a similar fully-red paint scheme, from the alloy wheels to the seat. The 125-cc engine continues to make 10.06 PS at 7,500 rpm and a peak torque of 10.6 Nm at 6,000 rpm.\nFor the price, Vespa are also offering exclusive Vespa Red merchandise – a helmet, a T-shirt, and a hat.\n(RED) are an organisation founded in 2006 and have raised more than $450 million for the Global Fund to help people ailing from tuberculosis, AIDS, and malaria. One of their primary intentions is to make sure that a mother with HIV does not pass the virus to her unborn child.\nWe wish Vespa and (RED) the best in their endeavour to create a world where no child is born with the fatal virus.\nStory: Joshua Varghese",
    "source_domain": "bikeindia.in",
    "title": "Special Edition Vespa Red Launched to Support Fight Against HIV",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/special-edition-vespa-red-launched-to-support-fight-against-hiv/?utm_source=rss&utm_medium=rss&utm_campaign=special-edition-vespa-red-launched-to-support-fight-against-hiv"
}