{
    "authors": [
        "Harket Suchde"
    ],
    "date_download": "2017-06-15 09:49:37+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 11:07:09",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fmv-agusta-present-the-extraordinary-rvs1%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3Dmv-agusta-present-the-extraordinary-rvs1.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "RVS stands for Reparto Veicoli Speciali; a new special projects division within MV Agusta tasked with creating exclusive, hand-built, limited edition motorcycles that are put together on a ‘special vehicles’ production line at the company’s Schiranna factory.\nThe RVS#1 is the first product of this new division (hence the #1), and is based on the Brutale Dragster 800, which, in turn, is derived from the firm’s successful Brutale 800 middle-weight streetfighter. Powered by the latest Euro 4-spec version of MV Agusta’s compact 800-cc three-cylinder engine that makes 150 PS at 12,800 rpm, and with the generous use of carbon fibre and titanium to drop weight to just 160 kg, the RVS#1 is clearly a performance-oriented work of art. The Brutale-derived tubular steel trellis frame is known for its dynamic capability, and the sporty riding position is a clear indicator that this bike is meant for more than pootling around town on. With the sporty nature of the motorcycle in mind, fully-adjustable Marzocchi upside-down forks handle suspension duties up front, while the rear is taken care of by a fully-adjustable Sachs unit; both ends get 125 mm of suspension travel.\nThe attention to detail on this motorcycle is excellent, and nothing is left to chance. Up front, the cutting-edge adaptive headlight incorporates several LED segments, which switch on and off depending on the current speed and lean angle, to provide the best illumination exactly where needed. The shapely fuel tank is inlaid with titanium segments and shows off a beautifully machined filler cap, while the seat gets an attractive honeycomb pattern. Titanium also features on the upper triple-clamp plate and the brake and clutch lever protectors. The Kineo wire-spoked wheels feature one-off machining, while the front wheel is further adorned with a pair of purpose-built ‘Batfly’ brake discs by Braking Sunstar. On the right side of the bike is a pair of powerful LED spotlights mounted on a carbon-fibre support, while the CNC machine-finished footrests are inspired by the MV Agusta cogwheel logo. Keeping weight down is a priority, and carbon-fibre features on a lot of components, including the front and rear mud-guards, the swingarm protector, side fairings, radiator air scoops and chain guard.\nMV Agusta are also providing an optional track-only SC Project titanium exhaust specifically built for this motorcycle, with specific mapping to squeeze out every bit of power from that compact triple.\nWe still don’t know how many units of this extravagant motorcycle will be built, nor do we know how it will be priced, however what we can be sure of, is that MV Agusta have created yet another tantalising piece of automotive mastery.\nCan’t get enough of the RVS#1? Check out the video MV Agusta put out regarding the bike right here –",
    "source_domain": "bikeindia.in",
    "title": "MV Agusta Present the Extraordinary RVS#1",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/mv-agusta-present-the-extraordinary-rvs1/?utm_source=rss&utm_medium=rss&utm_campaign=mv-agusta-present-the-extraordinary-rvs1"
}