{
    "authors": [
        "Team Bike India"
    ],
    "date_download": "2017-10-07 03:34:14+00:00",
    "date_modify": null,
    "date_publish": "2017-10-04 10:17:25",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2F2018-triumph-bonneville-speedmaster-unveiled%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3D2018-triumph-bonneville-speedmaster-unveiled.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Revealed in the UK, the latest Bonneville variant is based on the Bobber but features high-end cycle parts – including new suspension and brakes. Along with the new Speedmaster, Triumph also showcased the Bobber Black which, as the name suggests gets an all-black treatment on the exhaust and engine, along with a twin-disc front brake and smaller 16-inch wheels with a wider tyre.\nThe Speedmaster borrows inspiration from classic American cruisers of the 1960s and aims to give the British brand access to new customers who fancy cruiser styling and relaxed riding position at comparatively entry-level pricing. It gets a hard-tail-style chassis and swingarm which further enhances its retro styling like the Bobber, but gets pulled-back ‘beach’ handlebars and low saddle height which add to its cruiser appeal. Moreover, the Speedmaster is a two-seater where the rear seat can be removed if one wants to convert the bike into a single-seater.\nPowered by the Bobber’s 1,200-cc, twin-cylinder, liquid-cooled engine, the Speedmaster promises to offer strong mid-range performance with improved torque flow. Also new are the 310-mm twin disc brakes with Brembo callipers up-front along with 41-mm forks (90 mm travel) and an adjustable mono-shock at the back.\nBeing positioned as a cruiser, the Speedmaster gets a larger 12-litre fuel tank which improves the range, so that one makes fewer fuel stops while touring. Electronics include cruise control, ABS, traction control and pre-set ride modes. The instrument console looks similar to the one seen on other bikes from the Bonneville family.\nBoth the 2018 Triumph Bonneville Speedmaster and Bobber Black are expected to be launched in India next year, and possibly showcased during the 2018 Auto Expo. As of now, the Triumph Bonneville range consists of the T120, T100, Street Twin, Thruxton R, the recently launched Scrambler and, of course, the Bobber.",
    "source_domain": "bikeindia.in",
    "title": "2018 Triumph Bonneville Speedmaster unveiled",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/2018-triumph-bonneville-speedmaster-unveiled/?utm_source=rss&utm_medium=rss&utm_campaign=2018-triumph-bonneville-speedmaster-unveiled"
}