{
    "authors": [
        "Harket Suchde"
    ],
    "date_download": "2017-10-07 03:34:08+00:00",
    "date_modify": null,
    "date_publish": "2017-10-04 07:16:02",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Ftriumph-motorcycles-open-up-factory-visitor-experience%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3Dtriumph-motorcycles-open-up-factory-visitor-experience.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "From the 1st of November, Triumph fans will be able to take a deep-dive into the brand’s history at a shiny new Factory Visitor Experience at Triumph HQ in Hinckley, UK.\nTriumph is one of those legendary motorcycle brands with a long and storied history. 115 years worth of it, in fact. The brand also has a legion of followers around the world who are interested in its heritage. Triumph have created this Factory Visitor Experience in order to help these enthusiasts chart the progress of the brand through its long and fascinating existence.\nThe Experience includes various exhibits that deal with Triumph’s design evolutions, engineering prowess, and manufacturing set up. The exhibit also includes a section dedicated to Triumph bikes that made appearances in famous films. This includes the likes of that iconic Bonneville that king of cool Steve McQueen used in The Great Escape, and the Speed Triple Tom Cruise was seen gunning around on in action flick Mission Impossible 2. Other examples of seminal Triumph rides that can be found at the Visitors Centre include the first ever Triumph No1, built in 1902, and prototype race engine that will be used in the Moto2 from 2019 onwards.\nSpeaking at the event, Paul Stroud, Chief Commercial Officer, Triumph Motorcycles, said, “We are very proud and excited to be able to invite Triumph and motorcycling fans from around the world to come and experience our brand first-hand, here at the factory where every Triumph starts its life. With so many important and rare bikes on display, the Visitor Experience will be a must for motorcycle and movie fans alike, but also an opportunity to help us celebrate our proud heritage and our passion for building great motorcycles. We hope this will reward and inspire every fan of the brand, and ignite a love for Triumph in a whole new generation.’’\nVimal Sumbly, Managing Director, Triumph Motorcycles India, added, “The visitor centre is an amazing platform for the brand to showcase the all-round advancements of Triumph motorcycles. The treatment of the art of motorcycle-making is at the heart of this visitor centre, a characteristic that will make it a must see on every motorcycle enthusiast’s bucket list. As India has gradually proven to be a key market for the brand, it is indeed a prestigious moment for us and I congratulate the team for the superb execution of the project and hope that we keep adding to this amazing journey as we go along.”\nYou can enter the Visitors Centre and have a look around for free, or book a 90-minute factory tour at £15 (Rs 1300 approx) per person.",
    "source_domain": "bikeindia.in",
    "title": "Triumph Motorcycles open up Factory Visitor Experience",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/triumph-motorcycles-open-up-factory-visitor-experience/?utm_source=rss&utm_medium=rss&utm_campaign=triumph-motorcycles-open-up-factory-visitor-experience"
}