{
    "authors": [
        "Harket Suchde"
    ],
    "date_download": "2017-06-15 09:49:34+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 07:39:23",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fducati-multistrada-950-and-monster-797-launched-in-india%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3Dducati-multistrada-950-and-monster-797-launched-in-india.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "More affordable Ducati Multistrada and Monster models now available in India at 12.6 lakh and 7.77 lakh respectively (both ex-Delhi).The Ducati Multistrada 950, as the name suggests, is the smaller version of the Multistrada 1200 which makes it more manageable and suitable for newer riders. Using lightweight materials from the Multistrada 1200 and Enduro, Ducati designers have managed to keep the 950 lean. Powering the Ducati Multistrada 950 is a 937-cc, twin-cylinder Testastretta which makes 113 PS at 9,000 rpm and a peak torque of 96.2 Nm at 7,750 rpm. The long list of electronics include DSP (Ducati Safety Pack) which comes with ABS and Ducati Traction Control. You also get four riding modes (Sport, Touring, Urban and Enduro) to suit every riding style.\nThe bike comes with completely new light-weight rims, big 19-inch and 17-inch front and rear wheels respectively wrapped in Pirelli Scorpion Trail 2 or Scorpion Rally rubber, and dual-320mm front disc brakes. The Multi 950 also gets an increased rake and trail, a longer wheelbase, multiple riding modes and fully adjustable Kayaba front forks among other things. Of course, being a Multistrada, the bike comes with a 20-litre fuel tank, and the same saddle as the one on the 1200 Enduro. The Multistrada 950 is priced at Rs 12.6 lakh (ex-Delhi).\nThe other bike launched today is the baby Monster which sits between the Scrambler and the full-sized Monster 821. The new Ducati Monster 797 will take on the Kawasaki Z900 and the recently launched Triumph Street Triple 765. Replacing the Monster 796, the new 797 is powered with a 803-cc, air-cooled Desmodue twin which churns out 75 PS at 8,250 rpm and 68.9 Nm of peak torque at 5,750 rpm. With 90 per cent of the power spread between 4,000 to 8,500 rpm, the Monster 797 promises to be a hoot to ride, staying true to the Monster legacy.\nIt also shares its bigger sibling – the Monster 1200S’ fuel tank and headlights, and brakes from the 959 Panigale. The Monster 797 also gets a slipper clutch, and a freshly designed double-sided swing arm and a shorter wheelbase when compared to the 796. Coming to the features, the new bike reintroduces the use of cooling winglets for the Desmodue and gets Brembo brakes and ABS as standard. You also get Ducati’s multimedia nad smartphone connectivity options. The 797 is available in three shades – Star White Silk, Dark Stealth, and Ducati Red. The Monster 797 carries a sticker of Rs 7.77 lakh (ex-Delhi), prices for both bikes are introductory and will be altered when GST comes into play.",
    "source_domain": "bikeindia.in",
    "title": "Ducati Multistrada 950 and Monster 797 launched in India",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/ducati-multistrada-950-and-monster-797-launched-in-india/?utm_source=rss&utm_medium=rss&utm_campaign=ducati-multistrada-950-and-monster-797-launched-in-india"
}