{
    "authors": [
        "Team Bike India"
    ],
    "date_download": "2017-02-15 14:26:49+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 12:30:45",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fum-motorcycles-open-first-dealership-in-punjab%2F.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "American motorcycle maker UM International have opened their first showroom in Chandigarh, Punjab the land of five rivers.\nThe dealership located in Chandigarh at Jindal Agencies Pvt Ltd, Plot No 5, Industrial Area, Phase1, was inaugurated by Rajeev Mishra, CEO – UM Lohia Two Wheelers Pvt Ltd, in the presence of Shubham Garg Director,UM Royal Punjab. The Chandigarh dealership is spread over a total of 2,200 sq ft, which includes an area of 1,500 sq ft for sales & service support. Customers will have access to the entire range of UM merchandise and accessories as well. The company also announced that 24×7 Roadside Assistance Programme (RSA) will also be available for all customers of the city.\nSpeaking at the launch, Rajeev Mishra, CEO – UM Lohia Two Wheelers Pvt. Ltd, said, “Chandigarh as we all know is India’s best planned city which boasts of well maintained, beautiful roads. Additionally its close proximity to the mountains makes the city an ideal playground for motor heads and nomads alike. Moreover Chandigarh is known for its automobile culture, and we’re confident of getting an excellent response from this city. We have been working very hard to create motorcycles that engage with the rider and offer a balance between ergonomics and performance. We’re hoping this dynamism is something even the customers feel.”\nStory: Sahej Patheja\nRelated Posts via Categories",
    "source_domain": "bikeindia.in",
    "title": "UM Motorcycles Open First Dealership In Punjab",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/um-motorcycles-open-first-dealership-in-punjab/"
}