{
    "authors": [
        "Ravi Chandnani"
    ],
    "date_download": "2017-10-07 03:34:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-03 08:58:01",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fsuzuki-launch-ecstar-lubricants-in-india%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3Dsuzuki-launch-ecstar-lubricants-in-india.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Suzuki’s global lubricant brand now available in India.\nSuzuki Motorcycle India Private Limited recently launched Suzuki Japan’s global lubricant brand Ecstar in India. Suzuki claim that the new line of engine oil is formulated to enhance engine performance and prolong the motor’s life. The R9000 (10W40) engine oil is designed for Suzuki motorcycle engines and consists of a blend of high-quality synthetic base oil additives that help to reduce friction, provide better performance, and prevent sludge and other deposits.\nSuzuki also claims that the Ecstar engine oil helps their motorcycle engines achieve better thermal stability, which provides better engine protection. Suzuki claim that the R9000 also helps the engine in cold conditions for an effortless start up and longer engine life. The R9000 is available for the Gixxer range and also for Suzuki’s big bikes like the Hayabusa and GSX series. The new engine oil will be available through all the Suzuki dealerships across the country and soon the company will also make it available through other channels as well.\nOn the occasion of the launch, Suzuki Motorcycle India Private Limited’s Managing Director, Satoshi Uchida, commented, “It is our constant effort to offer customers innovative and evolved products that allow them to derive superior experiences from their Suzuki motorcycles. ECSTAR oil from Suzuki is a powerful lubricant that not only enhances the enactment of its vehicles, but with its optimal lubricant formulation, will offer customers outstanding engine protection, a longer life-cycle for their two-wheeler as well as lower maintenance and fuel costs. ECSTAR oil ensures durability and better performance even in unfavourable riding conditions like uneven roads, extreme weather conditions, combustion contaminants, etc.”",
    "source_domain": "bikeindia.in",
    "title": "Suzuki Launch Ecstar Lubricants in India",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/suzuki-launch-ecstar-lubricants-in-india/?utm_source=rss&utm_medium=rss&utm_campaign=suzuki-launch-ecstar-lubricants-in-india"
}