{
    "authors": [
        "Joshua Varghese"
    ],
    "date_download": "2017-01-02 05:48:49+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 05:44:01",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fcng-fuelled-scooters-launched%2F.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Mahanagar Gas Limited (MGL) in association with M/s Eco Fuel launch CNG-powered scooters in Mumbai.\nAt the launch of this initiative, Honourable Union Minister of State (Independent Charge) for Petroleum and Natural Gas, Dharmendra Pradhan, said that more than 36 lakh scooters in the Mumbai Metropolitan Region (MMR) could opt for this facility. CNG-fueled vehicles have been on a steady rise in the MMR over the last year owing to their eco-friendly nature and cost-efficiency.\nThe CNG kit that is currently on sale features two cylinders with a capacity of 1.2 kg each. The numbers show that the vehicles can run approximately 120 km per kg of fuel which can be worked out to 60 paise per kilometre; significantly lesser than an equivalent calculation with petrol. In the initial phase, the scooters will be retro-fitted with a kit from Lovato. Presently two kit manufacturers namely M/s ITUK and M/s Lovato have got two-wheeler CNG kits approved by ARAI, Pune and ICAT Gurgaon respectively. Lovato has got approval for 18 scooter models of various OEMs present in the market. After considering the potential in this market, other manufacturers are also expected to jump into the fray soon.\nThe current line-up of vehicles that are compatible with the kit include Hero Maestro, Duet and Pleasure, the Honda Activa and Dio, the Suzuki Access, LET’S and Swish, the TVS Jupiter, Scooty Zest and Wego, the Yamaha Alpha, Fascino and Ray, the Mahindra Duro DZ, Gusto and Gusto 125 and the Vespa 125.\nThe linear average distance across CNG stations in the MMR is as follows:\nWestern: 1.52 km\nCentral: 1.47 km\nNavi Mumbai: 3.2 km\nKDAB: 4.5 km\nThe newly-launched MGL Connect app helps customers locate the nearest fuelling station without hassle. We hope the trend catches on.\nRelated Posts via Categories",
    "source_domain": "bikeindia.in",
    "title": "CNG-fuelled Scooters Launched",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/cng-fuelled-scooters-launched/"
}