{
    "authors": [
        "Joshua Varghese"
    ],
    "date_download": "2017-10-07 03:34:17+00:00",
    "date_modify": null,
    "date_publish": "2017-10-05 12:18:25",
    "description": null,
    "filename": "http%3A%2F%2Fbikeindia.in%2Fkawasaki-launch-kx450f-and-klx450r-in-india%2F%3Futm_source%3Drss%26utm_medium%3Drss%26utm_campaign%3Dkawasaki-launch-kx450f-and-klx450r-in-india.json",
    "image_url": "http://bikeindia.in/wp-content/themes/metro-pro/images/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Kawasaki have expanded their competition motorcycle portfolio in India with the launch of two new models: KX450F and KLX450R. The feature-rich KX450F is priced at 7.97 lakh while the comparatively raw KLX450R is priced at 8.49 lakh, both prices are ex-showroom, Delhi.\nJumping mounds, throwing up dust while blazing through trails, and sliding the rear wheel in the mud while negotiating a corner are just the kind of things that would constitute a satisfying time on the latest Kwackers in India. The motocross machine, the KX450F, and its enduro-focused sibling the KLX450R look like fun motorcycles with a lot of potential when you take into account Kawasaki’s proven expertise in the AMA Supercross Championships over the years.\nThe more accessible KX450F is the result of decades of experience in the motocross arena and features a host of features that have been improved over time. The 2018 model is powered by a 449-cc, liquid-cooled, four-stroke, fuel-injected engine mated to a five-speed gearbox. Kawasaki claim that the motorcycle delivers power from early in the rev-band through to the top. Kawasaki have made changes to the intake ports, intake valves, and opted for a new offset cylinder. Engine components now weigh two kg lighter than before. When coupled with the slimmer, lighter, aluminium perimeter frame, the motorcycle has lost nearly three kg over its predecessor. The motorcycle now weighs 108.8 kg with a 6.3-litre fuel tank. Making life much easier for racers, Kawasaki have also thrown in Launch Control.\nOther features include a Showa SFF (Separate Function Fork)-Air TAC (Triple Air Chamber). Each leg of the fork performs a separate function. The left side houses the damping cartridge and the one on the right contains the pneumatic air spring, in addition to three pneumatic air chambers to tune the air-spring side of the fork. Seating position for different riders can be managed thanks to the adjustable handlebar (four positions) and adjustable foot-pegs (two positions). Kawasaki are also offering an accessory that will enable you to make changes to engine maps without a PC. The KX FI Calibration Controller is a portable hand-held calibration tool which is equipped with seven preset settings.\nKawasaki have revealed that the enduro-oriented KLX450R is primarily focused on performance. It is powered by the same 449-cc unit that drives the KX450F albeit with a slightly lesser compression ratio. Kawasaki have kept this motorcycle raw and focused on enduro, thus denying it as many features as the KX450F. The engine is carburetted and mated to a five-speed gearbox. However, it does feature an electric starter and a simple digital instrument cluster. At 126 kg it may not be the lightest off-roader option from the Japanese manufacturer but it does have the largest capacity fuel tank at eight litres.\nWith these additions, Kawasaki have a total of six off-road-focused competition motorcycles. Read about the other motorcycles in Kawasaki India’s off-road range: KLX110 and KLX140, and KX100F and KX250F.\nStory: Joshua Varghese",
    "source_domain": "bikeindia.in",
    "title": "Kawasaki Launch KX450F and KLX450R in India",
    "title_page": null,
    "title_rss": null,
    "url": "http://bikeindia.in/kawasaki-launch-kx450f-and-klx450r-in-india/?utm_source=rss&utm_medium=rss&utm_campaign=kawasaki-launch-kx450f-and-klx450r-in-india"
}