{
    "authors": [
        "Mila Gibson"
    ],
    "date_download": "2017-12-11 20:50:28+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Facranger.com%2F2017%2F12%2F11%2Fnursing-program-receives-honor%2F.json",
    "image_url": "http://acranger.com/wp-content/uploads/2011/10/Hester_Chris4.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Brett Herring\nAs the director of Amarillo College’s associate degree nursing program prepares to retire, the program will be honored by the Texas Board of Nursing.\nAC’s nursing department has received several commendations over the years, but this is the third time in a row it will be recognized by the state board.\nThe benchmark for registered nurse licensure pass rates is 80 percent or above each year and AC’s licensure pass rates have been over 90 percent.\n“Around 70% of RN’s in the area are Amarillo College graduates. They start out with a dream of being a nurse, of bettering the lives of their families and those that they care for as a Nurse,” Lyndi Shadbolt, the director of the ADN program, said.\nShadbolt noted that her students receive hands-on training and preparation to enter the workforce.\nAC’s nursing department has been ranked 10th largest associate degree nursing program in Texas according to the Texas Board of Nursing’s report.\nWhile in the program, students have the privilege of getting help to guide them along the way as they become professionals. Community colleges have the unique opportunity of truly contributing to the community with the school’s program graduates.\n“I’m heading into my last semester of this degree, and it’s been an honor to learn from such an amazing group of people and be able to be a part of this outstanding program,” Megan Smith, a nursing major said. “The feeling of knowing I was enrolled in one of the best programs in Texas is the topping of the cake.”\n“As I retire next semester, I know that this great legacy of nursing education at Amarillo College will continue. We provide a strong foundational education that serves our graduates and our community,” Shadbolt, the director of the ADN program, said.\nThe recognition the nursing program received from the Texas Board of Nursing is something to be proud of, Shadbolt said. The announcement will be made at the Texas Board of Nursing meeting in Austin this January.",
    "source_domain": "acranger.com",
    "title": "Nursing program receives honor:",
    "title_page": null,
    "title_rss": null,
    "url": "http://acranger.com/2017/12/11/nursing-program-receives-honor/"
}