{
    "authors": [
        "Mila Gibson"
    ],
    "date_download": "2017-12-12 08:01:31+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Facranger.com%2F2017%2F12%2F11%2Fael-department-wins-second-place%2F.json",
    "image_url": "http://acranger.com/wp-content/uploads/2016/09/studentspeak-678x509.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Keegan Ried\nThe Amarillo College Adult Education and Literacy department (AEL) is receiving statewide recognition. AC’s AEL department recently won second place for the College Integration award and received a check worth $30,000 from the Texas Workfore Commission.\nThe College Integration award is presented to organizations that exemplify excellence in providing services to high school equivalency (HSE), English as a second language (ESL) and college transitions students. “I am so very proud of the work of the AEL team,” Edie Carter, dean of academic success, said.\nCarter noted that when it comes to integrating HSE and ESL students with the rest of the college student body, AC is the exception rather than the rule.\n“Traditionally, adult education has been viewed as a separate program. Amarillo College’s leaders have worked hard to integrate AEL students,” said Alicia Panelli, AEL data analyst.\n“This integration allows us to encourage and support the students as they move beyond their GED to receive a certificate or college degree.”\nGetting a GED is an integral step in obtaining a higher education, but Carter said these students face many other challenges. “Breaking down barriers for HSE, ESL and transitions students has led individuals toward a brighter tomorrow, which, in turn, strengthens our community,” Carter said.\nAC’s programs have been so successful that the institution is now helping other colleges by providing guidance and mentoring.\n“AC faculty and staff are developing a national reputation for educating and supporting our students and ensuring they are able to achieve a college certificate or degree no matter what level they start in their education journey,” Dr. Russell Lowery-Hart, AC president, said.\n“If our community is going to diversify its economy and grow our economic opportunities, we have to educate every student in our community – including those who need GED and ESL services.”",
    "source_domain": "acranger.com",
    "title": "AEL department wins second place:",
    "title_page": null,
    "title_rss": null,
    "url": "http://acranger.com/2017/12/11/ael-department-wins-second-place/"
}