{
    "authors": [
        "Jack Nimble"
    ],
    "date_download": "2018-02-03 02:43:23+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Facranger.com%2F2018%2F02%2F02%2Fbirkenfeld-named-ac-police-chief%2F.json",
    "image_url": "http://acranger.com/wp-content/uploads/2018/01/Birkenfeld-mugshot.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Kiara Allen:\nA new leader has taken over the Amarillo College Police Department as the college’s first female police chief.\nAfter obtaining multiple AC degrees, completing the Law Enforcement Academy, and spending eight years doing various police work, Stephanie Birkenfeld is back at AC to revamp and clean up the Police Department.\n“I saw opportunity to be able to lead the department in a new direction and make a difference in how our officers are viewed and how they feel about their jobs,” Birkenfeld said.\nBirkenfeld said that working in a male dominated profession has never affected her work ethic and she has not had any problems maintaining authority.\nStudents said they are happy to see a woman in this traditionally male position. “I am so pleased that AC has a woman as the chief of police. I think it is sad that it’s taken so long, but I suppose late is better than never. The fact that nobody has made a big deal out of her position is appealing because it shows that she has the same amount of respect as any other man who has been in her position,” Macey Gibaszek, an education major, said.\nSince Jan. 1, Birkenfeld has already applied for and received state funding to cover the cost of 11 new rifle-resistant vests, matching the number of officers employed by the college.\nBirkenfeld replaced the previous chief, Steve Chance, who retired at the end of 2017.",
    "source_domain": "acranger.com",
    "title": "Birkenfeld named AC Police chief",
    "title_page": null,
    "title_rss": null,
    "url": "http://acranger.com/2018/02/02/birkenfeld-named-ac-police-chief/"
}