{
    "authors": [
        "Jack Nimble"
    ],
    "date_download": "2018-02-04 03:20:14+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Facranger.com%2F2018%2F02%2F03%2Flowery-hart-testifies-to-senate-committee%2F.json",
    "image_url": "http://acranger.com/wp-content/uploads/2015/10/the-ac-report-october-16-2015.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Stevi Breshears\nOn Thursday, Jan. 19, Amarillo College President Dr. Russell Lowery-Hart represented community colleges and universities across the country on a panel of financial aid and economic experts for the United States Senate Committee on Health, Education, Labor and Pensions.\nTogether, the policymakers discussed ways to simplify the financial aid process for students across the country.\n“We have students that don’t apply for financial aid, one, because they don’t think they’re eligible when they are, and, two, because the process is so complicated that they don’t think that they can complete it, or that they don’t think they’re smart enough to complete it,” Lowery-Hart said.\nFor many students, financial aid is the deciding factor as to whether or not they get to attend college.\n“The cost of higher education has exploded, especially at the university level, and I think community colleges have done a much better job at keeping costs in check, but we still have work to do ourselves,” Lowery-Hart said. “Financial aid really is the stopgap that helps middle class students and low-income students be able to afford going to college, and we know that a college degree equals a better job that pays more.”\nWhile better education is important on an individual level, it’s also beneficial to the rest of society.\n“Our economy depends on us not only enrolling students, but graduating students, and we wouldn’t be able to do that without financial aid. We would not be able to graduate the students we have without financial aid,” Lowery-Hart said.\nNow that the committee has heard from the panel of policymakers, the committee members will use the information they’ve gathered to vote on laws to alter the financial aid process. New laws could be seen as early as this summer.",
    "source_domain": "acranger.com",
    "title": "Lowery-Hart testifies to senate committee",
    "title_page": null,
    "title_rss": null,
    "url": "http://acranger.com/2018/02/03/lowery-hart-testifies-to-senate-committee/"
}