{
    "authors": [
        "Number Fan",
        "Katie Martinez",
        "Mike Haynes"
    ],
    "date_download": "2017-10-07 00:04:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-04 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Facranger.com%2F2017%2F10%2F04%2Fbridging-the-classroom-age-gap%2F.json",
    "image_url": "http://acranger.com/wp-content/uploads/2017/10/woman-698987_1920-678x509.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "“Oh my gosh! Will that person ever shut up?!” We are all adults here. We do not have to pretend that this thought has not crossed our minds at some point during our college career. Whether you’re a millennial having to listen to an old dinosaur of a classmate drone on about “how things used to be,” or you’re an individual who is more advanced in years having to sit through the incessant chattering of a young whippersnapper, it’s easy to dismiss those peers whose age is vastly different from your own.\nAmarillo College is well known for encouraging people from all walks of life, and of all ages to go to school, but the very concept of welcoming diversity also creates issues in the classroom. The student body of AC represents nearly every living generation in our community, and there are times that the tension in the classroom between those of different ages is palpable.\nOlder students, usually those who’ve already had families and careers, walk into the classroom with a lifetime of experience and wisdom. This knowledge has been gained through many years of blood, sweat and tears and is invaluable to our society as our young people begin grappling with the stresses of life. These older more seasoned students tend to share their knowledge with others through stories and life examples and, for some younger students, this comes across as stuffy, antiquated, useless or downright boring. “Damn it, Nancy! We’re here to learn about new things, not typewriters and rotary phones.” Even with all this wisdom, people still tend to become jaded and inflexible if there is no one to challenge their ideologies and help them to retain their flexibility in the face of a struggle.\nYounger students bring with them energy, vitality for life, new perspectives and lives that are essentially blank canvases that allow them to be more inventive and agile. These students tend also to be more technologically savvy which is a huge helpmate in today’s world. This can cause problems though because they can usually be found with their faces glowing from the nearest device checking their social media and watching the latest Netflix series. Older students often see their younger counterparts as distracted by tech and unprepared to face the hardships that life will bring. They see this generation who live on instant gratification and wonder if any real work will ever get done.\nWe, the Ranger staff, find it disappointing to see the strengths and value of both sets of students go to waste. We want to see the wisdom of those who have lived life be passed on to the younger students so that they will not have to learn those lessons the hard way. Likewise, we want to see the younger set teaching the older students how to adapt to a world that is changing faster all the time.\nOur challenge to you is to open yourself to the possibility that you do not have all the answers. Put down your cell phone or slide rule and ask yourself “What can I learn from the people I meet today?”",
    "source_domain": "acranger.com",
    "title": "Bridging the classroom age gap:",
    "title_page": null,
    "title_rss": null,
    "url": "http://acranger.com/2017/10/04/bridging-the-classroom-age-gap/"
}