{
    "authors": [
        "Jack Nimble"
    ],
    "date_download": "2018-02-04 03:21:17+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Facranger.com%2F2018%2F02%2F03%2Fgoing-against-the-tide%2F.json",
    "image_url": "http://acranger.com/wp-content/uploads/2015/10/the-ac-report-october-16-2015.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Brandan Waldrop:\nSome popular trends make more sense than others. The Tide pod challenge has teens ingesting the laundry detergent and pushing the boundaries in their endless quest for likes and social media approvals in today’s digital age.\nYouTube has taken an initiative and removed all Tide pod challenge videos from its site completely, yet the challenge still seems to be going strong. The American Association of Poison Control Center (AAPCC) has spoken out recently as well, with a high-alert, noting that there has indeed been a significant rise in calls due to intentional ingestion of the detergent. In fact, in the month of January, there were 86 cases of intentional ingestion handled by the AAPCC, which now has Tide and US Consumer Product Safety Commission teaming up to release messages pleading that people (mostly teens) not to eat their product. As if it’s not common sense already.\nI find this common sense paradox humorous. I personally ignored it initially, like I do with most of the viral stupidity that trends from day to day, yet somehow this one has stayed in the spotlight for longer than I would have expected or ever hoped.\nShould we keep bubble-wrapping the world for everyone in order to make it a safer place or should we just let natural selection work its magic for the sake of humanity? Perhaps I’ll need to show my I.D. the next time I need to purchase laundry detergent thanks to these viral teens and their YouTube star career goals.\nSo I suppose the whole point of this rant, is that conventionally speaking, it’s obviously a no-brainer idiotic thing to take part of, yet we as adults should perhaps not be so quick to judge and degrade others for partaking. Most of us helped create this monster in a sense by giving an iPhone to our young children in order to keep them occupied or quiet, so you have to expect these sort of ridiculous repercussions down the line, because yes, technology has advanced no doubt, but our brains still remain primitive and have yet to update along with it.",
    "source_domain": "acranger.com",
    "title": "Going against the Tide:",
    "title_page": null,
    "title_rss": null,
    "url": "http://acranger.com/2018/02/03/going-against-the-tide/"
}