{
    "authors": [
        "Russell Freeman",
        "Russell Freeman Is Pastor Of Warrior Creek Baptist Church In Gray Court ."
    ],
    "date_download": "2017-12-11 21:55:11+00:00",
    "date_modify": null,
    "date_publish": "2017-11-30 15:41:11",
    "description": null,
    "filename": "https%3A%2F%2Fbaptistcourier.com%2Fbible-study%2Fassurance-knowing-know%2F.json",
    "image_url": "https://baptistcourier.com/wp-content/themes/baptistcourier/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Every classroom has at least four types of students who turn in their tests. The first group of students did well, and they know they did well. They go home ready to enjoy the weekend. A second group did poorly, and they know they did poorly. Perhaps they knew they would do poorly before they even took the test. A third group of students feels confident that they did well, but they find out during the next period that they bombed the test. Students in a fourth group feel terrible about the test, only to find out during the next class period that they aced the test. Doing well and knowing that one did well are not the same.\nSalvation is not taking a test. It doesn’t depend on doing well or studying hard. But, like the four types of students, people can relate to Christ in four different ways. A person can know Christ and have confidence that this knowledge is genuine (2 Timothy 4:8). Others don’t know God, and they know that they don’t know Him (Romans 1:32). Jesus warns us not to be in a third group: those who are confident they know God without knowing Him (Matthew 7:21-23). A fourth group contains those who know God but deal with doubt as to whether this knowledge is genuine (Matthew 28:17, Mark 9:24, and Jude 22).\nThe goal is to be in the first group. We want to know God and know that we know Him. We often call this second type of knowledge “assurance of salvation.” As we conclude looking at the virtues in 2 Peter 1, we see that Peter connects the virtues with assurance: “Be zealous,” he says, “to make your calling and election sure” (2 Peter 1:10). How does assurance of salvation relate to faith, love and the other six virtues?\nLooking at verses 8-11 gives clarity. Peter says first in verse 8 that the virtues (“these things”) should both characterize our lives and be growing. To use one example, self-control is not an all-or-nothing characteristic. A follower of Christ has self-control, but he or she will almost always have room to grow. The second half of verse 8, along with verse 9, warn us: If we do not have these virtues, we will be idle, fruitless and forgetful. We will, Peter says, be nearsighted or even blind regarding the truth. C.S. Lewis memorably captures this truth in “The Magician’s Nephew” when he explains Uncle Andrew’s experience in Narnia: “What you see and hear depends a good deal … on what sort of person you are.”\nVerse 10 gives us a healthy balance between what God does and what we do. “Calling” and “election” refer to what God does in salvation, but we are to make these things “sure.” As these character traits become a part of who we are, the fact that God has called us becomes more obvious. In verse 11, Peter shows us that the path of virtues is an entrance into the kingdom.\nHow do we know God and know that we know Him? Knowing God begins with faith. If this knowledge is genuine, we change. As we grow in the virtues, we and others become assured of that calling and election.\n— Russell Freeman is pastor of Warrior Creek Baptist Church in Gray Court.",
    "source_domain": "baptistcourier.com",
    "title": "Assurance: Knowing What We Know",
    "title_page": null,
    "title_rss": null,
    "url": "https://baptistcourier.com/bible-study/assurance-knowing-know/"
}