{
    "authors": [
        "Baptist Press"
    ],
    "date_download": "2017-06-15 00:16:02+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 11:13:30",
    "description": null,
    "filename": "https%3A%2F%2Fbaptistcourier.com%2F2017%2F06%2F3-1m-cooperative-program-gift-featured-in-ec-report%2F.json",
    "image_url": "https://baptistcourier.com/wp-content/uploads/2017/06/3.1M-Cooperative-Program-gift-featured-in-EC-report1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Flanked by more than two dozen Florida pastors, Tommy Green of the Florida Baptist Convention presented a gift of $3,136,500 to the Southern Baptist Convention during the Executive Committee report June 13 in Phoenix.\nThe CP gift, from the sale of the Florida convention’s former building, was among numerous facets of the Executive Committee’s report to messengers during the convention’s 160th session since the SBC’s founding in 1845.\nExecutive Committee recommendations adopted by messengers included appreciation for Jim Wells, the SBC’s outgoing registration secretary who is battling cancer, and establishing a process for selling the SBC Building in Nashville in the event of a significant offer.\nThe Executive Committee also highlighted the report of the Women’s Advisory Council appointed by EC president Frank S. Page in January 2016.\nFlorida CP gift\nThe Florida convention’s gift to the Cooperative Program was 51 percent of $6.15 million received from the sale of the former Baptist Building in downtown Jacksonville, which was completed June 7.\nThe 51 percent allocation is in keeping with the convention’s CP budget that sends 51 percent to the Cooperative Program and retains 49 percent for Florida Baptist ministries.\n“This gift is over and above our regular CP giving and specific to the sale of this property,” Green, the Florida convention’s executive director, said to the applause of messengers.\nGreen noted that the pastors on the platform “represent our Florida Baptist family, among many who are seated in the convention center. Florida Baptists enthusiastically in 2015 made a strategic decision concerning the division of Cooperative Program dollars given in our state.”\nPrior to 2015, Florida had retained 59 percent of CP gifts in the state. The 2015 decision “led to a paradigm shift which changed our CP formula to releasing 51 percent to the SBC CP and retaining 49 percent of CP dollars in Florida.”\nGreen was named as Florida’s state exec in 2015 and immediately began the process of shifting more funds to the SBC.\n“This decision of sending more than we keep of CP dollars from our churches has resulted in a reversal of a decade-long decline in CP dollars in Florida,” Green told messengers.\n“We are now trending upward and rejoice in a $3 million increase from Florida Baptist churches to the SBC CP this past year,” he said. “Florida Baptist ministries continue at a high level, and we are grateful to report a 4.5 percent increase in baptisms through Florida Baptist churches this past year.\n“Our prayer is that God will multiply these dollars in taking the Good News of Jesus Christ to the ends of the earth.”\nAcknowledging the gift, Page said the funds will “go straight into the mission field” and expressed appreciation to Florida Baptists on “behalf of all Southern Baptists and the sake of the Gospel.”\nThe money retained in Florida provided $2.3 million for the purchase of a 28,568-square-foot convention building in south Jacksonville; $700,000 to endow the John Sullivan Chair of Baptist History at the Baptist College of Florida; and $13,500 for ministry in the state.\nJim Wells recognition\nWells, who was unable to attend the convention, was honored by messengers with a resolution of appreciation for his 15 years of service.\n“He had hoped against hope to be here to conclude his service in Phoenix,” Page told messengers, noting that the 2003 SBC annual meeting in Phoenix marked Wells’ first year in the position.\nPage read one of the resolution’s clauses to messengers: that Wells “has fought a long and courageous battle with cancer … that though the doctor has said he had only a few days left on this earth, he was ‘confident in these final hours that God is in control,’ that he is ‘looking forward to a day when we will worship at the feet of Jesus together’ and that he intends to devote his time remaining to ‘praying for the lost.'”\nWells most recently had been the Missouri Baptist Convention’s strategic partners catalyst after serving as director of missions for the Tri-County Baptist Association and pastor of nine churches in nearly 50 years of ministry.\nPage, in a prayer, said, “… we plead Your mercy upon our brother in Christ and his dear wife Judy. Thank You for their service over these years. We pray in Jesus’ name that as the master physician You would visit him powerfully and closely. We love him and Judy. We lift them to your throne today.”\nBuilding sale process\nMessengers approved a process for the sale of the SBC Building in Nashville in the event of a favorable offer being received. Acting on a recommendation by the Executive Committee, messengers authorized it “to continue studying the advisability of a sale of the SBC Building, and to sell the property upon such terms and conditions, and at such a time, if any, as the Executive Committee may hereafter approve.”\nShould a sale occur, various costs such as the current feasibility study would be deducted from the proceeds, which would then be distributed according to agreed-upon percentages based on those in place when the building opened in the mid-1980s:\n— The EC would have a 56 percent share, including the original interests of the former Education Commission and Stewardship Commission which were closed as part of the 1990s Covenant for a New Century SBC reorganization.\n— The Council of Seminary Presidents would have a 26 percent share, encompassing the original interests of the former Historical Commission, which also was closed in the SBC reorganization, and Seminary Extension. The Southern Baptist Historical Library and Archives is now operated by the seminary presidents council.\n— The ERLC would have a 14 percent share, reflecting the original interest of the former Christian Life Commission.\n— The Southern Baptist Foundation would have a 4 percent share.\nWomen’s Advisory Council\nPage recognized the work of the Women’s Advisory Council, which he appointed two years ago to address his conviction that women were under-involved in SBC processes. Women, Page said, make up 52-53 percent of the entire Southern Baptist population.\n“God gifts women according to His biblical roles, but those gifts that He has given them must be utilized in His Kingdom,” Page said. “We know women can minister so beautifully to each other, and we wanted to find a way to find out what were the best practices and just encourage women in their involvement of ministry to each other and in the Kingdom of God.”\nThe Women’s Advisory Council, chaired by Rhonda Kelley of New Orleans Baptist Theological Seminary, presented its report to Page June 12 at the Many Faces of the SBC booth in the exhibit hall. Page said the report, which includes the council’s findings, suggestions and action steps, would be posted online at sbc.net for all Southern Baptists to read and “to hold us accountable for the implementation of these suggestions.”\nPage noted that the Women’s Advisory Council is one of several councils he began appointing on his second day in his role as EC president, each one representing a subset of people in the convention who may not have been “as involved and connected as we would wish.”\nThese groups “have been precious persons with whom to work,” Page said, adding that he had met with Native American, African American, Asian American, Hispanic and Latino leaders since he has been in Phoenix for the annual meeting.\nCooperative Program allocation\nMessengers also approved a 2017-2018 Cooperative Program Allocation Budget of $192,000,000.\nThe budget maintains current allocations to the convention’s ministries, including 50.41 percent of receipts to the International Mission Board and 22.79 percent to the North American Mission Board, for a total of 73.20 percent allocated for world missions ministries.\nThe convention’s six seminaries will receive 22.16 percent. The seminary enrollment formula for funding will be: Gateway Seminary, 2.11 percent; Midwestern Seminary, 2.93 percent; New Orleans Seminary, 3.72 percent; Southeastern Seminary, 4.03 percent; Southern Seminary, 5.17 percent; Southwestern Seminary, 3.96 percent; and .24 percent to the Southern Baptist Historical Library and Archives, a ministry overseen by the seminary presidents. (Cumulative numbers may not match the sum of individual seminary percentages due to rounding.)\nThe budget designates 1.65 percent to the ERLC. The SBC Operating Budget, the only CP-funded facilitating ministry, encompassing SBC annual meeting costs and the work of the Executive Committee, will receive 2.99 percent of the budget.\nAdditionally, messengers amended the formula for distributing any overage of gifts above the CP Allocation Budget to increase the IMB’s portion from 51 percent to 53.4 percent and decrease the SBC Operating Budget portion from 2.4 percent to 0 percent.\nAn SBC Operating Budget of $7,450,000 for the 2017-2018 fiscal year also was approved by messengers.\nExecutive Committee recommendations\nMessengers approved several additional recommendations from the Executive Committee, including:\n— providing representation to four states or territories on the Executive Committee.\nThe four areas were granted EC representation although they do not have the number of church members stipulated by SBC Bylaw 30.\nThe recommendation amended Bylaw 18 to list the Dakotas, Iowa, Minnesota-Wisconsin and Montana as each being entitled to a single representative on the Executive Committee. All other states and defined territories have EC representation.\n— selection of three cities for upcoming SBC annual meetings — Salt Lake City in 2025, which was the site of the SBC’s 1998 meeting; Orlando, Fla., site of the 1994 and 2000 annual meetings; and Indianapolis, site of the 1992, 2004 and 2008 annual meetings.\n— streamlining the SBC Business and Financial Plan’s Section XIX, now titled “Publishing and Merchandising Policy,” to read in part: “All entities of the Convention should give priority to using the services of LifeWay Christian Resources for editing, publishing, and distributing published materials that are to be sold. Entities may publish their own materials in print or digital form promoting their assigned ministries.”\n— authorizing the International Mission Board to move to an Oct. 1-Sept. 30 fiscal year, responding to an IMB trustee request that would enable the mission board “to conduct their finances more efficiently and more effectively evaluate and project the Lottie Moon Christmas Offering.” The Executive Committee, LifeWay Christian Resources and North American Mission Board utilize an Oct. 1-Sept. 30 fiscal year, while GuideStone Financial Resources utilizes the calendar year and the six SBC seminaries utilize an Aug. 1-July 31 fiscal year.\n— adopted a 2021-2022 SBC Calendar of Activities along with several amendments to the calendars from 2017-2018 through 2020-2021.\nWhen all of the recommendations had been presented, a messenger asked the Executive Committee to consider providing “some form of explanation on each of them … so that the messengers would be better informed on making the decisions to approve or disapprove.”\nSBC president Steve Gaines responded, “We will receive that as a recommendation to the Executive Committee, as a request.”\nEC president Frank Page also addressed the messenger’s request, saying to the convention, “As you’ve dealt with these issues, please remember that we hold your trust tightly and we cherish it. This is a deliberative body, the largest openly deliberative body that still exists. But know that the Executive Committee also deliberates carefully at multiple levels dealing with each of the issues before they’re ever presented to you, from small groups to medium size [groups] to the large plenary sessions. Our Executive Committee members are not rubber-stampers. They ask questions, they deliberate, they discuss and sometimes disagree. So know that we hold your trust carefully and we count it to be precious.”\n— Barbara Denman is director of communications for the Florida Baptist Convention; Art Toalston is senior editor of Baptist Press; Erin Roach is a writer based in Nashville.",
    "source_domain": "baptistcourier.com",
    "title": "$3.1M Cooperative Program gift featured in EC report",
    "title_page": null,
    "title_rss": null,
    "url": "https://baptistcourier.com/2017/06/3-1m-cooperative-program-gift-featured-in-ec-report/"
}