{
    "authors": [
        "Baptist Press"
    ],
    "date_download": "2017-06-15 00:16:06+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 11:13:30",
    "description": null,
    "filename": "https%3A%2F%2Fbaptistcourier.com%2F2017%2F06%2Fec-receives-cp-report-frames-building-sale-process%2F.json",
    "image_url": "https://baptistcourier.com/wp-content/uploads/2017/06/EC-receives-CP-report-frames-building-sale-process1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Southern Baptist Convention Executive Committee heard a report today (June 12) that “escrowing, withholding [and] reducing” gifts through the Cooperative Program is “not as widespread” as thought in February when the EC’s CP Committee created a special committee to study the issue.\nThe EC also voted to ask the SBC for authorization to sell the SBC Building in Nashville if a favorable offer is made. The committee additionally adopted a resolution of appreciation for SBC registration secretary Jim Wells, who has completed 15 years of service and will not attend this year’s SBC annual meeting due to an ongoing battle with cancer.\nCP report\nThe ad hoc Cooperative Program Study Committee — formed in February based on reports of churches’ escrowing or withholding CP funds over concerns related to SBC entities — said a “cooperative spirit” that “underlies the Southern Baptist Convention” has yielded healing and a renewal of cooperation in the convention, according to a verbal report by CP Committee chairman Rolland Slade.\nThe committee was not yet prepared to quantify its assessment of CP-related actions by churches, said Slade, pastor of Meridian Baptist Church in El Cajon, Calif. The limited number of churches that have withheld, escrowed or reduced gifts through CP have cited “various reasons — not just one entity or individual or personality.”\nThe 13-member study committee will issue a final report at the September EC meeting in Nashville, Slade said. That report will include data on the number of churches that have escrowed, reduced and withheld CP funds, Slade said. That data will be drawn from a survey of state Baptist convention executive directors as well as data compiled by the EC staff on contacts from individuals and churches.\nSlade said in an interview the EC staff received a “frenzy” of “calls, emails [and] letters” related to CP earlier this year, “but that has tapered off over time as we all began to pray” and communicate. “We’re at a healing.”\nThe study committee was created less than a week after it was reported that Dallas-area Prestonwood Baptist Church would escrow CP funds over “various significant positions taken by the leadership of the Ethics & Religious Liberty Commission.” The ERLC released an extended statement in March “seeking unity in the Southern Baptist Convention,” and Prestonwood announced in April following an internal study that it would resume giving through CP.\nSome Southern Baptists had also expressed concern over participation by the ERLC and the International Mission Board in a friend-of-the-court brief supporting a New Jersey Islamic society in a religious liberty lawsuit.\nSBC Building recommendation\nA process for the sale of the SBC Building was approved by the Executive Committee for recommendation to messengers at the annual meeting in Phoenix. No sale is being negotiated for the downtown Nashville facility, EC president Frank S. Page said in a Q&A for the current edition of SBC LIFE, but a process is needed in the event of an offer that merits action.\nThe recommendation to messengers would authorize the Executive Committee “to continue studying the advisability of a sale of the SBC Building, and to sell the property upon such terms and conditions, and at such a time, if any, as the Executive Committee may hereafter approve.”\nShould a sale ever occur, the recommendation states that proceeds, after such costs as the current feasibility study, would be distributed according to agreed-upon percentages based on those in place when the building opened in the mid-1980s:\n— The EC would have a 56 percent share, including the original interests of the former Education Commission and Stewardship Commission which were closed as part of the 1990s Covenant for a New Century SBC reorganization.\n— The Council of Seminary Presidents would have a 26 percent share, encompassing the original interests of the former Historical Commission, which also was closed in the SBC reorganization, and Seminary Extension. The Southern Baptist Historical Library and Archives is now operated by the seminary presidents council.\n— The ERLC would have a 14 percent share, reflecting the original interest of the former Christian Life Commission.\n— The Southern Baptist Foundation would have a 4 percent share.\nThe discussion of a possible sale stems from the sale of the former LifeWay Christian Resources campus across the street in November 2015 amid a building boom in Nashville. The 14.5-acre property sold for a reported $125 million. The SBC Building sits on just over three-fourths of an acre.\nPage, in the Q&A, noted, “The bottom line of all of this is stewardship. If we were ever to sell the building, we would want to assure that we receive an amount that would allow us to not only relocate to a less expensive location, but also to subsidize a part of the Executive Committee ministry so we could lower our Cooperative Program allocation once again. We would love to be able to send more money to reach the lost and engage all unreached people groups for Christ.”\nWells resolution\nThe resolution of appreciation for Wells noted his “transformative servant leadership” and “humble, yet principled leadership style.”\nWells, who will “draw his service [as registration secretary] to a close” with the Phoenix annual meeting according to the resolution, has “served eight Southern Baptist Convention presidents, providing guidance and leadership to hundreds of presidentially-appointed SBC Credentials Committee members and Tellers of the Convention, as well as hundreds of volunteers enlisted, in consultation with each year’s local arrangements committee, to serve in the registration area.”\nWells’ ministry spans five decades and includes service as a Missouri Baptist Convention staff member, a director of missions, pastor of nine Missouri churches and an EC member, the resolution stated.\nThe EC “pledge[d] to intercede for Jim Wells as he faces his cancer with courage and faith, for his wife Judy as she ministers to him during this time of illness, and for the two of them as they prepare themselves for a time of temporal separation until That Day when the Lord will make all things new.”\nIn addition to recommending that messengers to the SBC annual meeting adopt the resolution, the EC appointed Wells’ chief assistant Don Currence of Missouri as acting registration secretary and named SBC recording secretary John Yeats to perform the recording secretary’s “platform duties.”\nExecutive Committee’s 100th anniversary\nThe 100th anniversary of the Executive Committee’s founding occasioned comments by Page, who noted it was created in a unanimous vote during the six-day SBC annual meeting in New Orleans in 1917. Such occurrences, he noted, are “miraculous” in Baptist life.\nThe action followed arguments during the 1916 annual meeting in Hot Springs, Ark., “about the need for an executive-type committee. … There was a large group of people who wanted to consolidate all the entities into one large body to control and promote everything as one entity. There were many who didn’t agree with that.”\nA yearlong study produced the recommendation for the Executive Committee’s creation, said Page, the sixth leader of the entity, which was created with a key assignment: “To act for the convention during the interim of its meetings on matters not otherwise provided for in its plans of work.”\nPage referred EC members to a Baptist Press story June 8 by BP chief national correspondent David Roach on the EC’s 100-year service, typically in behind-the-scenes fashion, in advancing the convention’s work.\nThe EC’s 100th anniversary will be marked by:\n-– an updated edition of the Albert McClellan book “The Executive Committee of the Southern Baptist Convention” incorporating updated material by Augie Boto, the EC’s executive vice president, and Roger S. Oldham, vice president for convention communications and relations.\n— a special edition of SBC LIFE, the journal of the Executive Committee, marking its first 100 years.\n— a “low-key” birthday party/anniversary celebration, as Page phrased it, during the EC’s September meeting in Nashville. The EC opted for a September commemoration rather than one in Phoenix, “with so much going on” during the June 13-14 SBC annual meeting.\n“The Executive Committee does not exist for and of itself,” Page said. “We are a coordinating, supporting, encouraging body. … We exist to see the other entities of the Southern Baptist Convention do their very best work encouraging our churches to work with SBC missions and ministries.”\nIn other actions, the EC:\n— recognized 10 members ending their terms of service: Michael W. (Mike) Routt, Colorado, 2009-2017; Wayne Robertson, Georgia, 2007-2017; Charles W. Boling, Illinois, 2007-2017; Wilma J. Booth, Illinois, 2009-2017; Timothy A. (Tim) Ohls, Kansas-Nebraska, 2009-2017; William E. (Eddie) Kinchen, Mississippi, 2009-2017; Jeff L. Paul, Missouri, 2009-2017; Bryan (Scott) Davis, North Carolina, 2009-2017; Jeffrey B. (Jeff) Watson, North Carolina, 2009-2017; and Danny S. Sinquefield, Tennessee, 2009-2017.\n— heard a report from SBC president Steve Gaines, who spoke on the theme of the annual meeting — “Pray! For such a time as this,” drawn from Luke 11:1 and Esther 4:14.\n“I believe with all my heart that the next few years will set the course for America for a long, long time,” Gaines said, voicing concern that his grandchildren may have to live “in a country that is so anti-Jesus that they’re having to watch every move they make. I want to see them worship in a country that is embracing Jesus again.\n“If God set us on fire, if we really got fresh fire, fresh wind in our hearts … God can use us again,” Gaines said.\nIn a time of prayer, Gaines interceded, “Lord, we look at our nation and we see so much sin, we see so much that is against Your Word and Your will. People are in so much bondage. They need to be set free, dear God. … Help us to share Your Gospel; help us to be about our Father’s business; help us to seek first the Kingdom of God; help us to follow You, Jesus, and be fishers of men, make disciples, baptize disciples and teach disciples.”\n— selected Salt Lake City as the site for the 2025 SBC annual meeting. Southern Baptists met there for the first time in 1998. Next year’s annual meeting will be in Dallas.\n— reelected both Stephen Rummage, pastor of Bell Shoals Baptist Church in Brandon, Fla., to a second one-year term as chairman and Shane Hall, pastor of First Southern Baptist Church in Oklahoma City, as vice chairman. Stacy Bramlett, a member of First Baptist Church in Collierville, Tenn., was elected as secretary, succeeding Becky Illingworth who had served the maximum two one-year terms.\n— presented a resolution of appreciation to Mark Edlund, who will retire in July as executive director/treasurer of the Colorado Baptist General Convention after 16 years of service. The resolution was adopted during the EC’s February meeting in Nashville.\n— received for review the 2017-2018 SBC Comprehensive Budget, which includes statements of income and operating budget summaries for all SBC entities.\n— heard a report that EC officers have reviewed Page’s job performance and granted him a 3 percent pay raise that includes a cost of living adjustment and an increase based on merit.\n— David Roach is chief national correspondent for Baptist Press, the Southern Baptist Convention’s news service. Art Toalston is BP’s senior editor.",
    "source_domain": "baptistcourier.com",
    "title": "EC receives CP report, frames building sale process",
    "title_page": null,
    "title_rss": null,
    "url": "https://baptistcourier.com/2017/06/ec-receives-cp-report-frames-building-sale-process/"
}