{
    "authors": [
        "Tobin Perry"
    ],
    "date_download": "2017-12-11 21:55:09+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 10:06:03",
    "description": null,
    "filename": "https%3A%2F%2Fbaptistcourier.com%2F2017%2F12%2Fdrs-mickey-caison-retires-from-sbcs-greatest-job%2F.json",
    "image_url": "https://baptistcourier.com/wp-content/uploads/2017/12/DRs-Mickey-Caison-retires-from-SBCs-greatest-job1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Think back among the most harrowing disasters in recent U.S. history: 9/11, Hurricane Katrina, the Oklahoma City bombing, the Midwest floods of 1993, the Northridge earthquake and Hurricanes Andrew, Harvey and Irma.\nMickey Caison has represented Southern Baptists at each of them.\nAs national director of Southern Baptist Disaster Relief for most of the past 23 years, Caison has led Baptist volunteers to share the love of Christ during difficult days across the country as well as abroad.\n“I had the greatest job in SBC life,” Caison said. “I fell in love with seeing God work in people’s lives. I couldn’t get away from it. I wanted to be there. It’s so powerful to watch.”\nCaison officially retired from the North American Mission Board at the end of August, but he is currently in Houston, still serving as part of the Southern Baptist response to Hurricane Harvey. Caison was the last remaining staff member to transition from the former Brotherhood Commission to NAMB when the SBC entity was formed in 1997.\nCaison can see roots that led him to SBDR all the way back to his childhood. He remembers as a 5-year-old watching his father’s grocery store burn down. As a 12-year-old, he went with his brother-in-law, a police officer, to a wreck where three people were killed and two others were trapped in the car. A few years later, his best friend was killed riding a bicycle in front of his father’s business.\n“I saw tragedies; I saw horror; I saw grief. As a child, even the deaths of my grandmothers played into that,” Caison said. “As I put all of those things together, I realized God implanted in me a desire … to never be in a position where I couldn’t help other people.”\nWhen disaster relief came along, “it was only a natural fit,” providing a unique context for sharing Jesus Christ. “He’s ultimately the greatest hope, the only hope we have.”\nCaison, then a South Carolina pastor, first became aware of SBDR while attending the 1986 Southern Baptist Convention in Atlanta and going through a mobile DR unit set up by Alabama Baptists.\nBut it wasn’t until three years later that Caison saw firsthand the impact Southern Baptists have in disaster situations. He had been working with local emergency services when Hurricane Hugo hit the area. After seeing the extent of the damage, Caison called the South Carolina Baptist Convention and told them his community needed help. Trucks were already on the way.\nFor nine months, SBDR volunteers served Caison’s community and helped get people back on their feet. His church and the local fire department fed and housed the volunteers. The church raised about $260,000 to help local families impacted by the disaster.\n“We fell into that opportunity to care and love on people beyond the physical, even into the spiritual realm,” Caison said. “God showed me up close and personal what can happen when you tie the command to ‘go and make disciples’ with the command to care for people.”\nCaison was hooked. His church worked with the South Carolina Baptist Convention to create the first feeding unit in the state. Caison and a team from his church took the feeding unit to Florida in August 1992 to help with the aftermath of Hurricane Andrew. Though they initially planned to serve 1,500 meals a day, the team stayed in Florida for six weeks and served 15,000 meals a day.\nIn 1994, after leading several disaster responses when fulltime staff weren’t available, the SBC Brotherhood Commission asked Caison to become SBDR national director.\nCaison oversaw one of the most significant innovations in disaster relief a few years later when SBDR began deploying chaplains during 9/11. Caison had seen the value of chaplains during the Southern Baptist response to the 1995 Oklahoma City bombing, as Baptist chaplains in the police department and Federal Bureau of Investigation had responded powerfully to the spiritual needs in the aftermath. When 9/11 hit, Caison called Sam Porter, then-director of Oklahoma Baptist Disaster Relief and now NAMB’s new SBDR national director, and asked him to bring some of the chaplains who had helped at Oklahoma City.\n“I saw those chaplains walking the streets in downtown Manhattan, going up to those makeshift memorials, and being in the morgue and at Ground Zero with the cops and the firemen and all,” Caison said. “It was so critical for us to have the chaplains with us to deal with the immense spiritual needs that were there. I knew they needed to be a big part of our future.”\nCaison also led SBDR’s efforts in its largest deployment in history after Hurricane Katrina, as Southern Baptists subsequently served more than 15 million meals in New Orleans and southern Mississippi. SBDR also spent five years helping to rebuild the Gulf Coast after the initial response.\nCaison said he has seen God work through volunteers in amazing ways during his 30 years in SBDR. He has seen God use the Southern Baptist response to disasters to change not only the lives of those they’re serving, but to transform those who serve as well.\n“You know, people say there are no miracles today,” Caison said. “I see them every day as I see what God is doing…. You just have to pay attention. It’s gotten to the point that I know it’s going to happen. I just praise Him when it happens over and over and over again.”\nNAMB president Kevin Ezell said Caison’s influence has been remarkable.\n“Mickey’s contribution to Southern Baptist relief efforts goes beyond measure,” Ezell said. “His role has been pivotal, and we are deeply indebted to him. He put off retirement not once but twice to help us out. Even now, he continues. That’s the kind of heart he has for serving.”\nAfter 23 years of denominational service, Caison is asking God for the opportunity to serve as a transitional pastor somewhere in the north Atlanta area.\n“As a pastor, I empowered people and that’s what I want to try to do again,” Caison said. “I want to serve churches that are in the throes of a crisis and be able to step in and help them work through that crisis and put them on a good footing, so their next pastor can come in and take them to a new level.”",
    "source_domain": "baptistcourier.com",
    "title": "DR's Mickey Caison retires from SBC's 'greatest job'",
    "title_page": null,
    "title_rss": null,
    "url": "https://baptistcourier.com/2017/12/drs-mickey-caison-retires-from-sbcs-greatest-job/"
}