{
    "authors": [
        "Tom Strode"
    ],
    "date_download": "2017-06-15 00:16:09+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 11:13:29",
    "description": null,
    "filename": "https%3A%2F%2Fbaptistcourier.com%2F2017%2F06%2Fmessengers-ok-9-resolutions-to-vote-on-alt-right-proposal%2F.json",
    "image_url": "https://baptistcourier.com/wp-content/uploads/2017/06/messengers-ok-9-resolutions-to-vote-on-alt-right-proposal1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Messengers to the 2017 Southern Baptist Convention passed resolutions Tuesday (June 13) repenting of prayerlessness and calling for leaders to practice biblical morality before deciding late at night to vote Wednesday on a previously rejected proposal denouncing the “alt-right.”\nThe approved resolutions covered some hot-button theological and moral issues, but the proposed resolution on the “alt-right” — a movement that supports white nationalism — gained the most attention.\nThe Resolutions Committee chose not to report out the proposal to messengers. An effort by the resolution’s author to bring the “alt-right” measure to the floor failed in the afternoon session, and a motion by another messenger in the evening session also fell short. Each motion required a two-thirds majority, and the evening vote received only 58 percent approval.\nThe committee reconvened during the evening, however, and asked the Committee on Order of Business for time Wednesday to present a new “alt-right” resolution, chief parliamentarian Barry McCarty told messengers. The Committee on Order of Business approved, McCarty said. Messengers then approved unanimously or nearly unanimously a vote on the resolution scheduled for 2:45 p.m. Wednesday.\nMessengers approved all nine resolutions they received from the committee with unanimous or nearly unanimous votes. In those resolutions, they:\n— Confessed as sin any lack of prayer and called on Southern Baptists to commit to at least 15 minutes a day of prayer and regular fasting as they are able, as well as petitions to God to grant revival and the salvation of millions of people.\n— Expressed gratitude for leaders who live consistently moral lives, urged all leaders to abide by God’s moral standards and pledged prayer for the country’s leaders to resist temptation.\n— Reaffirmed the doctrine of penal substitutionary atonement — which says Jesus took upon Himself in His death the divine punishment due sinners — “as the burning core of the Gospel message and the only hope of a fallen race.”\n— Denounced Planned Parenthood’s “immoral agenda and practices,” in addition to urging all government defunding and commending the Ethics & Religious Liberty Commission (ERLC) for making federal removal of money for the country’s leading abortion provider a priority in its legislative agenda.\n— Called for Southern Baptists and other Christians not to participate “in the sin of gambling,” encouraged pastors and convention leaders to continue to teach Southern Baptists about the deceptiveness of gambling and urged government at all levels to halt state-sponsored gambling.\n— Urged Southern Baptists to pray for and invest in evangelism and discipleship efforts with college students and strengthen the relationship between parachurch campus ministries and local churches.\n— Voiced gratitude to God on the 500th anniversary of the Protestant Reformation for its courageous leaders and urged recommitment to its convictions while advocating for religious liberty for all.\n— Offered thanks on the 100th anniversary of the SBC Executive Committee and commended the entity for its promotion of the Cooperative Program, the convention’s unified giving plan.\n— Expressed gratitude to God, as well as Southern Baptists in the Phoenix area and all others who helped with this year’s meeting.\nReporting the resolution on prayer as the first matter for messengers to consider was significant, said Barrett Duke, Resolutions Committee chairman, in a news conference afterward. That resolution included some “very specific language” for Southern Baptists, he said.\nWhen asked by a reporter about the absence of President Trump’s name from the resolution on moral leadership, Duke said, “There was no need to single out President Trump or anyone else. We simply believe the resolution stands on its own without bringing particular characters into it.”\nTrump’s multiple marriages and past actions toward and comments about women were subjects of concern among Southern Baptists and others during the 2016 election, although many Southern Baptist church members voted for him in November.\nRegarding the measure on gambling, Duke said “We looked back, and we noticed that we never in the past have actually labeled gambling as a sin in that kind of explicit way.”\nERLC president Russell Moore described the resolution on penal substitutionary atonement as “very well worded, reflecting the viewpoint of the Baptist Faith & Message [the SBC’s statement of faith] and in a context where penal substitutionary atonement has been the subject of a hot debate in recent years.”\nHe told reporters it was a “very appropriate word for this convention to speak to the fact that we believe, as the book of Romans teaches, that God is both just and the justifier of the one who has faith in Jesus through the atoning sacrifice of Christ.”\nAfter the approval of all nine resolutions, Texas pastor Dwight McKissic moved to bring his proposal on the “alt-right” to messengers. McKissic, pastor of Cornerstone Baptist Church in Arlington, asked that the SBC “would go on record to abate darkness that’s invading our nation right now.” Many “alt-right” members claim to be Southern Baptists, he said.\nMcKissic’s motion failed to receive the two-thirds majority required, however.\nIn explaining why the committee did not report out McKissic’s resolution, Duke told reporters afterward the panel spent a number of hours considering the proposal “before we finally said we just didn’t see a way that we could speak to the multiple issues that were raised in that resolution in a way that we felt would be constructive.”\nDuke said the committee agreed with the resolution’s point on racism, but thought it and other “elements [in the proposal] already had been addressed recently” in Southern Baptist life.\nThe committee also chose not to act on resolutions submitted regarding Genesis, pro-life support, unity in the SBC and country, collaboration on ministry to refugees, praying for the peace of Jerusalem and encouragement of trustee representation.\nDuke is a member of Emmanuel Baptist Church in Billings, Mont., and executive director of the Montana Southern Baptist Convention.\nThe other committee members, in alphabetical order, are: Ken Alford, pastor, Crossroads Baptist Church, Valdosta, Ga.; Felix Cabrera, pastor, Iglesia Bautista Central, Oklahoma City, a mission of Oklahoma City’s Quail Springs Baptist Church, and co-founder of the Hispanic Baptist Pastors Alliance; Linda Cooper, member, Forest Park Baptist Church, Bowling Green, Ky., and national president of Woman’s Missionary Union; Jason Duesing, member, Antioch Bible Baptist Church, Gladstone, Mo., and provost and associate professor of historical theology at Midwestern Baptist Theological Seminary, Kansas City; David Leavell, pastor, First Baptist Church, Millington, Tenn.; Matthew McKellar, member, First Baptist Church, Dallas, and associate professor of preaching at Southwestern Baptist Theological Seminary, Fort Worth, Texas; Jeffrey Riley, member, Edgewater Baptist Church, New Orleans, and professor of ethics at New Orleans Baptist Theological Seminary, New Orleans; Rolland Slade, pastor, Meridian Southern Baptist Church, El Cajon, Calif.; and James Smith, member, Covenant Community Church, Fredericksburg, Va., and vice president of communications of the National Religious Broadcasters, Washington, D.C.\n— Tom Strode is Washington bureau chief for Baptist Press, the Southern Baptist Convention’s news service.",
    "source_domain": "baptistcourier.com",
    "title": "Messengers OK 9 resolutions, to vote on 'alt-right' proposal",
    "title_page": null,
    "title_rss": null,
    "url": "https://baptistcourier.com/2017/06/messengers-ok-9-resolutions-to-vote-on-alt-right-proposal/"
}