{
    "authors": [
        "Grace Thornton"
    ],
    "date_download": "2017-12-11 21:55:16+00:00",
    "date_modify": null,
    "date_publish": "2017-12-07 15:45:09",
    "description": null,
    "filename": "https%3A%2F%2Fbaptistcourier.com%2F2017%2F12%2Fchurch-imparts-heart-missions-young%2F.json",
    "image_url": "https://baptistcourier.com/wp-content/uploads/2017/12/Church-imparts-a-heart-for-missions-to-its-young1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After Myra Middlebrook’s mother died in 2010, she found some money her mom had tucked away — and she knew exactly what it was.\n“I knew it was her Lottie Moon Christmas Offering for that year,” Middlebrook said. “She put money away all year for missions. She always had.”\nFor the years that her mother worked, she squirrelled away a portion of her income in a jar each month. Then after she retired, she began a quilting business and gave a 10th of the profits to the annual offering, which goes to fund the work of International Mission Board missionaries overseas.\n“I’m a firm believer that missions is what God wants us to do, whether that’s to go ourselves or to give so others can go,” Middlebrook, 74, said. “That’s what my mother taught me years ago.”\nSo when December rolled around, Middlebrook gave the money she had found, just as her mom would have wanted.\n“When I was growing up, the ladies of the church had several groups called circles, and every year in January just after Christmas, they would start putting up money each month for the Lottie Moon Christmas Offering,” Middlebrook recounted. “That tradition was a big part of our church, and these days we try to keep it going.”\nThe women of Mon-Aetna Baptist Church in Union, S.C.– along with the men — save all year, putting as much money away in little jars as they can afford to live without.\nIt’s not a small thing for a church birthed in a hard-working town.\n“It’s a mill church built between two cotton mills,” said Brenda Going. “We were all just like one big family brought together by the mill. Growing up, we could walk everywhere — to the church, the mill and the school. We weren’t afraid back then, but we weren’t rich either.”\nBut Going, 75, just like Middlebrook, grew up watching her mother separate money out for missions even when times were hard.\n“The women back then sacrificed. They would do a little extra wash or something to make a little extra money, but they wouldn’t let anybody know about it,” Going said. “I remember my mother getting out our weekly offering for church and she would separate it out — $5 for the elevator fund, $5 for choir robes and a few dollars for whatever else was needed.”\nAnd she would separate some out for Lottie, too.\n“Lottie was a household word for us,” Going said. “Everybody would clean out their pocket money and save it up for the Christmas offering.”\nAnd as a result, Mon-Aetna Baptist still consistently supports the International Mission Board’s missionary force. They usually set their goal for $20,000, and there are “very few times we haven’t met it,” Going said.\nIt’s because as a community, the missions offering was a dinner-table topic.\n“We had a lady down the street, Mrs. Adams, who would bring missionaries to talk to us after school,” Going said.\nShe has a picture of her and a bunch of her friends at 7 or 8 years old, standing on the other side of the school fence waiting on the missionary to arrive.\n“Our excitement for Lottie goes back to people like Mrs. Adams and like my grandmother and mother who instilled in me how big missions were,” Going said.\nThose after-school missionary visitors brought the world and its needs close, and they taught her with pictures the story of Lottie Moon, a missionary who sacrificed her life to reach the people of China with the hope of the Gospel.\nThe pennies and nickels Going scrimped and collected brought her into the thick of the story: Missions was personal.\n“We grew up knowing and singing about how Jesus loves the little children of the world, and we knew that when it was Christmastime, Lottie came first, above all the things we wanted,” Going said.\nMiddlebrook agreed.\n“All of us can’t go to the mission. All of us can’t go across the sea,” she said, though she can think of a few people from the area who have gone to serve over the years.\n“There are people who are able to go overseas and spread the Gospel, and this is one way we can help — to emphasize the special offering and tell people about what the missionaries are doing.”\nPastor Chris Gulledge leads Mon-Aetna Baptist Church in reaching not only Union County, S.C., with the Gospel but also in reaching the world, encouraging the church to increase its Lottie Moon Christmas Offering goal from $20,000 to $30,000.\nThe offering, started in 1888, supports Southern Baptists’ collective international missions effort. It helps fund more than 3,600 field personnel and engage the 3,203 unreached people groups still without a Gospel witness of any kind. This year’s offering goal is $160 million.\nMiddlebrook, Going and the rest of Mon-Aetna Baptist Church are ready to do their part. At offering time, they will walk one by one to the altar and deposit the contents of their jars.\nIt’s a touching moment, they said.\nIt was during that part of the service that Middlebrook put her mother’s last Lottie Moon Christmas Offering gift in the offering place seven years ago. She will keep on giving her own offering, the way her mother taught her.\nAnd both she and Going hope that the next generation will carry on the legacy.\n“The world is changing, and it’s so important that we pass down the importance of missions,” Going said. “You’re never too young to learn what it means. And you’re never too young to get involved.”\nFor more information about the Lottie Moon Christmas Offering or to order or download related videos and other resources for your church, visit imb.org/lmco.\n— Grace Thornton is a writer in Birmingham, Ala. This article first appeared in SBC LIFE, journal of the Southern Baptist Convention’s Executive Committee.",
    "source_domain": "baptistcourier.com",
    "title": "Church imparts a heart for missions to its young",
    "title_page": null,
    "title_rss": null,
    "url": "https://baptistcourier.com/2017/12/church-imparts-heart-missions-young/"
}