{
    "authors": [
        "John Aravosis",
        "Article Archive"
    ],
    "date_download": "2017-02-15 02:40:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 08:00:41",
    "description": null,
    "filename": "http%3A%2F%2Famericablog.com%2F2017%2F02%2Fun-american-t-shirt-resist-trump-style.html%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BAMERICAblogGay%2B%2528AMERICAblog%2BGay%2529.json",
    "image_url": "http://americablog.com/wp-content/uploads/2017/02/Trump-profile-bw4.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As part of our ongoing “Resist Trump” effort, I’ve created a new anti-Trump t-shirt that I call “un-American.” 100% of the proceeds go to financing our work to fight the Trump agenda.\nThe shirt incorporates ~250 words describing the horror that is Donald Trump. From racist, sexist, and homophobe to pretty much anything you can come up with, I included it.\nBuy your shirt here, only available for the next two weeks.\nHere is a close-up of the design, and below is how the shirt looks from afar. The idea is to have it be a bit of a surprise as you get closer to the shirt.\nWe have six t-shirt colors, including: white, black, navy blue, sports grey, red, and brown. Shirts costs $20 each, with an additional charge for shipping. And 100% of the profits go to support our work — as we sell more shirts, our margins grow.\nThis campaign will run for two weeks. I hope you like it, and thanks as always for your support. Get your shirt here! And thanks as always, JOHN\nWith the election of Donald Trump, AMERICAblog’s independent journalism and activism is more needed than ever.\nPlease support our work with a generous donation. (If you prefer PayPal, use this link.) We don’t make much on advertising, we need your support to continue our work. Thanks.\nFollow me on Twitter & Facebook:\nFollow @aravosis",
    "source_domain": "americablog.com",
    "title": "\"Un-american,\" the t-shirt to resist Trump in style",
    "title_page": null,
    "title_rss": null,
    "url": "http://americablog.com/2017/02/un-american-t-shirt-resist-trump-style.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+AMERICAblogGay+%28AMERICAblog+Gay%29"
}