{
    "authors": [
        "John Schaffner"
    ],
    "date_download": "2017-06-15 02:54:38+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 19:29:12",
    "description": null,
    "filename": "http%3A%2F%2Fbuckheadview.com%2F2017%2F06%2F14%2Fbike-lanes-peachtree-re-routed-maple-drive-pharr-road%2F.json",
    "image_url": "http://buckheadview.com/wp-content/uploads/2017/06/DSC_1609.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Plans to construct bike lanes along one block of Peachtree Road in Buckhead—from Maple Drive to Shadowlawn Avenue—have become a fatally flat tire after the appraised cost of right ow way acquisition for the construction project came in at $8 million, much higher than anticipated.\nThe Buckhead Community Improvement District (BCID) announced plans at its May 24 board meeting to now route the bike lanes down Maple Drive from Peachtree Road to Pharr Road to connect to existing bike lanes on that east-west thoroughfare, according to a report by the Buckhead Reporter newspaper.\nThe bike lanes were to have been part of the third phase of the BCID’s Peachtree Transformation project, which has been in the planning phases for many years and is aimed at making Peachtree Road more accessible for pedestrians. Read more here.\nIn December 2015, the The Georgia Department of Transportation decided to eliminate bike lanes from its design for improving traffic flow and pedestrian safety along Peachtree Road from Pharr Road south to the bridge over I-85.\nDarion Dunn, the director of capital improvements and planning for the BCID, reportedly told Reporter Newspapers a reason for the change was due to the Georgia Department of Transportation eliminating bike lanes that were planned to run on Peachtree Road south of the BCID’s planned bike lanes.\nThe third phase of the BCID’s Peachtree Transformation project includes granite curbing and medians, trees, wide sidewalks, street furniture, and dedicated left turn lanes. Other parts of the third phase will move forward.\nThe Buckhead reporter also noted that Livable Buckhead Executive Director Denise Starling announced at the BCID meeting that bike share stations will be coming to Buckhead at Tower Place and Piedmont Center office developments. Starling does not yet have firm dates for their installation.\nThe stations are part of the Relay Bike Share program serving Atlanta, Starling said. The program began with 100 bikes in June 2016, and recently expanded to 500 bikes in April. No stations have yet been installed in Buckhead.\n–John Schaffner",
    "source_domain": "buckheadview.com",
    "title": "Bike lanes on Peachtree Road re-routed down Maple Drive to Pharr Road",
    "title_page": null,
    "title_rss": null,
    "url": "http://buckheadview.com/2017/06/14/bike-lanes-peachtree-re-routed-maple-drive-pharr-road/"
}