{
    "authors": [],
    "date_download": "2017-06-15 02:54:35+00:00",
    "date_modify": null,
    "date_publish": "2017-06-07 19:27:58",
    "description": null,
    "filename": "http%3A%2F%2Fbuckheadview.com%2F2017%2F06%2F07%2Fgeorgia-film-academy-executive-director-jeffrey-stepakoff-headlines-bba-signature-luncheon%2F.json",
    "image_url": "http://buckheadview.com/wp-content/uploads/2017/06/Jeff-Stepakoff-Headshot.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "11:30 a.m\nJune 15\nLuncheon set foronat the JW Marriott Buckhead\nBuckhead, Atlanta — Jeffrey Stepakoff, executive director of the Georgia Film Academy, will provide the keynote address during the Buckhead Business Association’s (BBA) Signature Luncheon in June.\nGeorgia topped the list for film production in 2016, according to a new report. Stepakoff’s keynote will focus on how Georgia’s role in the film and TV industry and how the Georgia Film Academy is utilizing this growth to create a sustainable ecosystem which will help create jobs and drive the state’s economy.\nThe Luncheon will be held from 11:30 a.m. until 1:30 p.m. on June 15 at the JW Marriott Buckhead. Tickets start at $75 for members and $85 for non-members; sponsor tables are also available.\nIn Fiscal Year 2016, the state hosted 245 feature films, commercials, music videos, television movies and series. Georgia-lensed productions generated an economic impact of more than $7 billion during the year, according to the Georgia Department of Economic Development.\nDuring the Luncheon, the BBA will present the Buckhead Public Safety Awards to members of the Atlanta Police Department (Zone 2), the Fulton County Sheriff’s Office and Atlanta Fire Rescue Department.\nPrevious BBA Signature Luncheons featured a “State of Public Safety” and Atlanta Falcons Head Coach Dan Quinn’s first keynote address as the team’s head coach.\nFor more information, visit buckheadbusiness.org.\nJeffrey Stepakoff Bio\nJeffrey Stepakoff was raised in Atlanta, Georgia. He is an accomplished writer-producer and an experienced academic, with a 28-year entertainment industry career that includes sweeping internationally-recognized credits, leadership roles in content creation and production management, and a track record of collaboration, innovation, and success in virtually all forms of commercial media.\nAfter earning a BA from the University of North Carolina at Chapel Hill, School of Journalism and Mass Communication, and then completing his Master of Fine Arts in Playwriting at Carnegie Mellon University, School of Drama, Stepakoff moved to Hollywood and began writing and producing film, television and digital entertainment.\nHe has “written by” or “story by” credits on thirty-seven television episodes, has written for fifteen different series, and has been a writer and/or writer-producer on eight primetime or first-run cable staffs, credited on more than two hundred episodes of popular television. The TV credits for which he is most known include the Emmy-winning The Wonder Years, Sisters, Wild Card, Hyperion Bay, The Magic School, C16:FBI, Robin’s Hoods, Land’s End, Flipper, Sons & Daughters, Major Dad, The Yakov Smirnoff Show, Beauty & the Beast, Have Faith, Simon & Simon, and break-out hit Dawson’s Creek, where he was Co-Executive Producer. Until July 2015, he worked as the Co-Executive Producer of Chasing Life for ABC Family.",
    "source_domain": "buckheadview.com",
    "title": "Georgia Film Academy Executive Director Jeffrey Stepakoff Headlines BBA Signature Luncheon",
    "title_page": null,
    "title_rss": null,
    "url": "http://buckheadview.com/2017/06/07/georgia-film-academy-executive-director-jeffrey-stepakoff-headlines-bba-signature-luncheon/"
}