{
    "authors": [
        "John Schaffner"
    ],
    "date_download": "2018-05-30 16:02:02+00:00",
    "date_modify": null,
    "date_publish": "2018-05-29 20:31:31",
    "description": null,
    "filename": "http%3A%2F%2Fbuckheadview.com%2F2018%2F05%2F29%2Fbba-luncheon-feature-public-safety-awards-childrens-healthcare-coo%2F.json",
    "image_url": "http://buckheadview.com/wp-content/uploads/2018/01/BBA-2018-Awards-2.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Buckhead Business Association will present its Buckhead Public Safety Awards during the association’s annual Signature Luncheon Thursday (May 31) at which Dr. Patrick Frias, chief operating officer of Children’s Healthcare of Atlanta, will deliver the keynote address.\nDr. Frias plans to share details about Children’s recent expansion projects and the positive impact they are expected to have on the Buckhead area during his speech during the luncheon,\nwhich will be held 11:30 am – 1:30 pm at the Grand Hyatt Buckhead, 3300 Peachtree Rd NE.\nGuests are encouraged to donate to Children’s Healthcare of Atlanta when purchasing event tickets online. Dr. Frias will receive the donation as part of a check presentation during the event. The cost of luncheon tickets are $75 for BBA members and $85 for non-members.\nThe Public Safety Awards are presented annually by the BBA as a way to recognize the “hard work, dedication and heroism exemplified by members of the Atlanta Police Department (Zone 2), the Fulton County Sheriff’s Office and Atlanta Fire Rescue Department.”\nAtlanta Fire Rescue Department Firefighter Cornelius Griffin has been selected to receive this award for finishing in the top five of 150 candidates to successfully complete the Fire Sergeant Process. This process is extremely competitive and one of the toughest processes that Atlanta Fire Rescue Department administers.\nAtlanta Police Department (Zone 2) Officer D. Giovanna was nominated for this award based on a “consistently high level of motivation and dedication as well as his response to a vehicle break-in in progress. D. Giovanna’s quick response and thorough police work led to safe apprehension of the suspect.”\nFulton County Sheriff’s Department Deputy Faith Hampton was nominated for jumping in to subdue a suspect that was resisting arrest and had injured her partner. “While serving a protection order, Deputy Hampton and her partner observed a male and female in possession of illegal narcotics and drug paraphernalia. When the suspects led the deputies on a foot chase, Deputy Hampton chased and apprehended the female subject. She then saw the male subject was resisting arrest and her partner was injured in the struggle so Deputy Hampton acted quickly, deploying her Taser to subdue the subject and help her partner.”\nAs COO, Frias oversees operations of all three Children’s hospitals and 29 neighborhood locations, including Marcus Autism Center. He is responsible for all service lines and physicians employed or managed by Children’s, which includes more than 514 physicians and over 200 advanced practice professionals, and represents 60 pediatric specialties ranging from primary care to the most highly specialized pediatric services.\nDr. Frias is an accomplished, board-certified pediatric cardiologist who maintains a practice within Sibley Heart Center Cardiology and is an associate professor of pediatrics at the Emory University School of Medicine. He is a Fellow, American College of Cardiology, Fellow, American Academy of Pediatrics and Member, American College of Physician Executives.\nPrior to his role as COO, Dr. Frias served as Children’s Chief Physician Officer and Chief of the Children’s Physician Group (2013-2015), Children’s Professional Staff President (2012-2013), and as Director of Outpatient Services for Sibley (2005-2013). Dr. Frias joined the Children’s professional staff in 2000.Dr. Frias and his wife have a daughter and three sons.\nAt the luncheon Thursday, area businesses will have an opportunity to purchase vendor tables to showcase their goods and services and there will be networking time for professionals.\nTickets and more information are available at www.buckheadbusiness.org.",
    "source_domain": "buckheadview.com",
    "title": "BuckheadViewBBA luncheon to feature Public Safety Awards, Children's Healthcare COO",
    "title_page": null,
    "title_rss": null,
    "url": "http://buckheadview.com/2018/05/29/bba-luncheon-feature-public-safety-awards-childrens-healthcare-coo/"
}