{
    "authors": [
        "Evan Minto",
        "David Estrella"
    ],
    "date_download": "2018-02-04 02:19:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 18:39:00",
    "description": "Anime, manga, and video game blog featuring reviews, columns, a podcast, and more.",
    "filename": "https%3A%2F%2Fanigamers.com%2Finterviews%2Fyuri-on-ice-staff-discuss-sayo-yamamoto-skating-animation%2F%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BAniGamers%2B%2528Ani-Gamers%2529.json",
    "image_url": "http://www.anigamers.com/uploads/thumbnails/Yuri-on-Ice-Victor-Skating_20180131232414_20180131233517.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Last June at AnimeNEXT 2017 in Atlantic City, NJ, we sat down for a brief interview with four staff members from the international smash hit figure skating anime Yuri!!! on Ice . Junpei Tatenaka was the lead animator for many of the key skating scenes in the series. Noriko Itou served as both an animator and prop designer. In the latter role, she was responsible for many of the series’ most memorable props, such as the characters’ phone cases and even the katsudon that features prominently in the series. Izumi Hirose served as color designer, helping visually define the series’ many tonal shifts. Finally, Takahiro Ogawa was one of the animation producers, managing schedules on what appeared to be a particularly difficult production. We unfortunately only had 15 minutes to chat with these talented creators, but in that brief time they revealed a number of interesting stories about their animation techniques, the scheduling adjustments the team made during production, and the experience of working with auteur director Sayo Yamamoto.\nThank you to AnimeNEXT’s press and guest relations staff, interpreter Yui Sehara, and of course Mr. Tatenaka, Ms. Itou, Ms. Hirose, and Mr. Ogawa for making this interview possible!\nMr. Tatenaka, you worked with Sayo Yamamoto on the Animator Expo short “Endless Night.” How did your work on that project help with your work on Yuri!!! on Ice ?\nTatenaka: Because I had experience with “Endless Night,” when Yuri!!! came along I knew how difficult it was going to be, and that it was going to be a lot of work. I tend to exaggerate the characters’ arms and legs in my animation. It’s a kind of Disney-style squash and stretch, where the characters’ arms extend further than normal. And Ms. Yamamoto wanted more realistic movements, like tracing from live-action, without the exaggerated stretches. But if you directly trace over live-action human figures, then it’s sort of weaker than the actual live-action footage. So I snuck in a couple stretches, not to the point where it’s exaggerated but just enough so that the movement is fluid and makes sense as an animation. Just enough where it’s not noticeable. And that’s been a concept I’ve been dealing with from “Endless Night” all the way through Yuri!!! on Ice : how much is too much and how little is too little? I’m still trying to find it.\nColor designer Izumi Hirose (left) and animator Junpei Tatenaka (right)\nIs that something only you were doing, or was that a general technique among the Yuri!!! on Ice animators?\nTatenaka: Eiji Abiko and I have very different styles. We did communicate about how much stretching was going in and what kind of style we did, but we weren’t trying to make our artwork completely the same.\nOgawa: And that helped to distinguish each individual character and their skating style so that they didn’t all become the same style.\n“If you directly trace over live-action human figures, then it’s sort of weaker than the actual live-action footage. So I snuck in a couple stretches, not to the point where it’s exaggerated but just enough so that the movement is fluid and makes sense as an animation.”\nWere the characters assigned to particular animators?\nOgawa: In the beginning, yes, each person had one character. Starting around episode 5 we were limited on time so whoever finished and had a free hand would jump onto the next character.\nIn episode 1, Mr. Tatenaka did Victor’s free skate. Mr. Abiko did Katsuki Yuri and Yuri Plisestky was also Mr. Tatenaka. That’s the way it was for the first couple episodes. After episode 5 it was whoever could get their hands on it, because after that episode the number of characters in the skating scenes grew, so only using the two of them became impossible.\nMs. Itou, you’re credited with Animation Direction for episodes 1-7 odd of Yuri!!! on Ice , while Saori Sakiguchi is credited with episodes 6-12 even. Why was the work assigned in that way?\nItou: Usually there are about four animation directors and they work simultaneously so that you can have four episodes going at the same time. There weren’t enough people on Yuri so we only had two. Because there weren’t four people to handle it simultaneously it just so happened that we went with odds and evens, to streamline it.\nAnimator and prop designer Noriko Itou\nMs. Itou, you’ve worked with a lot of directors who produce original works in a lot of unique styles. I was wondering if you could tell me about the different demands of those directors, specifically Kunihiko Ikuhara and Sayo Yamamoto?\nItou: Both directors are very unique. They have their own style. And they have their own ideas in their mind that can be very strict. I didn’t have a lot of conversations with Mr. Ikuhara since I was working outside the studio at the time. I grew up watching Utena , though. Twelve years after I first watched Utena , I was working on a series with the director! His color is all over that series; you know that it’s his work just by the artwork and how everything is designed. A lot of the staff who worked on Utena with Mr. Ikuhara came back to work on his new series just because everyone loves his talent and they have respect for his work. They’re fans. The newer staff who were fans back in the day got older and came to work on his series.\nThere’s probably a similar thing with Ms. Yamamoto: a lot of her fans grow up and become her staff. A lot of people join wanting to work with Ms. Yamamoto. They’re pretty similar in that sense.\nSince I’m a fan of this project I have to change the subject for a bit: Ms. Hirose, you worked on Dead Leaves , a project where director Hiroyuki Imaishi went a little wild. It’s got a sort of comic book style that’s very different from a lot of anime. What was it like working with him on that project? What kinds of instructions did he give you as a director?\nHirose: It was my first series as a color director. Everyone involved in that project was really into it, very energetic. So I had free reign on the color. The only thing Mr. Imaishi said was “do it in an American comic style.” The shadows had to be all black, no tones.\nCheck out the rest of our AnimeNEXT 2017 coverage.",
    "source_domain": "anigamers.com",
    "title": "Yuri!!! on Ice Staff Discuss Sayo Yamamoto and Skating Animation",
    "title_page": null,
    "title_rss": null,
    "url": "https://anigamers.com/interviews/yuri-on-ice-staff-discuss-sayo-yamamoto-skating-animation/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+AniGamers+%28Ani-Gamers%29"
}