{
    "authors": [
        "Victoria"
    ],
    "date_download": "2017-10-07 08:34:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "German LCC Eurowings has asked passengers to vote on potential new destinations, ticking boxes for passenger engagement, marketing and route development. Eurowings has said the ‘You vote, we fly’ campaign is an industry first. I can see other airlines kicking themselves for not thinking of this sooner.",
    "filename": "http%3A%2F%2Fatwonline.com%2Fblog%2Fdemocratic-route-development.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/10/vmblog.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "German LCC Eurowings has asked passengers to vote on potential new destinations, ticking boxes for passenger engagement, marketing and route development.\nEurowings has said the ‘You vote, we fly’ campaign is an industry first. I can see other airlines kicking themselves for not thinking of this sooner.\nAfter an initial round of voting, three destinations will be shortlisted. The winner will be selected during a live finale on social media site Facebook and will be added to the Eurowings network for summer 2018.\nThere are three reasons why this is a smart strategy:\n1/ Marketing impact: Eurowings is less well-known than easyJet and Ryanair. This campaign shows innovative thinking; it engages directly with passengers and gives them a voice in the airline’s strategy and decision-making. In this digital era, social media plays a huge role and passengers increasingly expect products to be tailored to their needs. This taps several market trends and has the potential translate into bottom line profit.\n2/ Finding an undiscovered gem: Network evaluations are usually primarily based on historic traffic data. By asking travelers themselves where they want to fly to, Eurowings might uncover untapped demand that isn’t contained in historic data.\n3/ Choice, but not too much choice: Rather than giving passengers a free say, Eurowings has offered 10 possibilities. This is wise move, as internet voters can be a difficult audience. This shortlist will undoubtedly be places that the airline is evaluating anyway. A choice of 10 options focuses votes into valuable feedback and makes it easier to deliver on the end result.\nHowever, I can see two initial drawbacks. Just because a person votes for a destination, it doesn’t mean they will act on it. Will the campaign actually reach the people who will pay money for tickets? For example, more lucrative business travelers may be unlikely to participate, but these destinations seem to be fairly leisure-focused and more suited to a social-media audience.\nThe choices available to vote on are Belfast in Northern Ireland, Bergen in Norway, Biarritz in France, Brac in Croatia, Castellón in Spain, Mostar in Bosnia and Herzegovina, Podgorica in Montenegro, Shannon in Ireland, and Trapani and Trieste in Italy.\nBy listing the 10 potential destinations, is there a danger that Eurowings could tip off its competitors about its route-development evaluations? Airlines tend to play their cards pretty close to their chest when it comes to network expansion, but this would give Eurowings their own unique data set, indicating the potential interest in serving those cities.\nVictoria Moores victoria.moores@penton.com",
    "source_domain": "atwonline.com",
    "title": "Democratic route development",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/blog/democratic-route-development"
}