{
    "authors": [
        "Polina Montag-Girmes"
    ],
    "date_download": "2018-05-30 20:20:16+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fregulation%2Frussia-suspends-aoc-saratov-airlines.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Russia’s Federal Air Transport Agency has suspended the air operator’s certificate (AOC) for Saratov Airlines, effective May 31, because of a violation of flight safety rules.\nSaratov Airlines confirmed it has stopped all flights and announced it will issue refunds.\nAccording to an agency statement, Saratov’s flight time plans were in violation of fatigue control regulations. In addition, the agency said the crews deliberately failed to comply with flight time limitations and, further, that airline management did not monitor the situation. Authorities denounced the company to be unreliable in the way it monitors and accounts for crew flight time.\nThe agency is in negotiations with other airlines—including Aeroflot Airline, Utair Aviation, S7 Airlines, Red Wings Airlines, Ural Airlines—to carry Saratov passengers through June 13.\nAuthorities carried out inspections in March after a Saratov Airlines Antonov An-148, en route from Moscow Domodedovo-Orsk, crashed several minutes after takeoff on Feb. 11, killing all 71 passengers and crew. The carrier’s An-148 fleet was grounded after the crash.\nRussian authorities temporarily restricted Saratov’s AOC after the crash, but at the end of April extended it through May 30.\nOn May 17, Saratov announced it was rebranding as Ivolga Airlines and had already taken delivery of its first Embraer E-190 with the new branding.\nPolina Montag-Girmes Montag.girmes@gmail.com",
    "source_domain": "atwonline.com",
    "title": "Russia suspends AOC for Saratov Airlines",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/regulation/russia-suspends-aoc-saratov-airlines"
}