{
    "authors": [
        "Ben Goldstein"
    ],
    "date_download": "2018-05-30 18:17:44+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Faeropolitics%2Fdot-opposes-consumer-protections-senate-house-faa-reauthorization-bills.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "The US Department of Transportation (DOT) told Sen. Bill Nelson (D-Florida), ranking member of the Senate Committee on Commerce, Science and Transportation, in a May 23 letter that consumer protections included in both chambers’ FAA reauthorization bills are “unnecessary, expensive and counterproductive.”\nIn the letter, DOT deputy general counsel James Owens singled out a provision in the Senate bill that would require DOT to create rules to determine which airline fees “are unreasonable or disproportionate to the cost incurred by the air carrier.” The counsel claimed such a provision would signal a “return to the pre-1978 era,” back when the US federal government controlled domestic airline fares and rates.\nThe provision in question would require DOT to examine fees incurred for flight cancellation, checked baggage, seat selection and flight changes. The Department alleges such a measure would “reverse to a significant extent the ground rules that have governed the airline industry since the Carter Administration.”\nThe administration voiced displeasure that the bill would mandate airlines and ticket agents disclose the fees to consumers at all points of sale. According to the letter, the rule is “exceedingly broad” and “resource-intensive,” and would be costly for airlines to implement.\nDOT also complained about both bills’ “unnecessary and burdensome” reporting requirements to Congress, which the counsel wrote would “divert scarce personnel time and resources” from the Department’s primary mission, and increase “bureaucratic drag” impeding the FAA’s efficient operation of the National Airspace System (NAS).\nAirlines for America has previously come out against the provision, claiming it would result in “government-mandated price controls.”\nThe Department also objected to a section of the Senate bill that would prohibit airlines from denying boarding to any passenger cleared by the gate attendant to board an aircraft. The administration argued the rule would make it difficult for airlines to continue the current practice of overselling scheduled flights to compensate for “no-shows.”\nThe rule was prompted by public outcry following a viral video of the forced removal of a United Airlines passenger in April 2017.\nIn response, Sen. Nelson said the letter “reads more like something written by airlines instead of the government watchdog that’s supposed to be protecting consumers,” according to Reuters.\nBen Goldstein, Ben.Goldstein@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "DOT opposes consumer protections in Senate, House FAA reauthorization bills",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/aeropolitics/dot-opposes-consumer-protections-senate-house-faa-reauthorization-bills"
}