{
    "authors": [
        "Mark Nensel"
    ],
    "date_download": "2017-02-15 11:38:39+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairline-financials%2Ficelandair-posts-89-million-2016-net-profit.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/02/icelandair-767-300-lhr-rf.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Icelandair Group reported a 2016 net profit of $89.1 million, down 20% from $111.2 million in net income for 2015.\nRevenue for the year increased 12.8% to $1.3 billion from $1.1 billion in 2015. EBITDA fell 3% to $219.8 million.\nIcelandair reported total international passenger numbers of 3.7 million in 2016, up 19.5% from 2015. International traffic was up 21.7% to 11.2 billion RPKs; international capacity increased 23.2% year-over-year to 13.7 billion ASKs, producing an international passenger load factor of 82.2%, down 1 point from 2015.\nRegional flight passengers for the year totaled 322,700, up 8.9% from 2015. Load factor for the year on regional flights was 69.3%, down 5.1 points from 2015.\nPassenger numbers climbed 15% from 2.26 million in 2013 to a record 2.6 million in 2014. Load factor was up 1.1% to 80.4%. The increase in passenger numbers was greatest on the tourist market to Iceland, a 23% rise year-over-year, accounting for 38% of total passenger numbers in 2016. On the Europe-North America service via Iceland, which at 50% is the company’s largest market, passenger numbers were up 22% in 2016.\nCargo traffic also increased in 2016, rising 4.9% from 2015 to 105.4 million FTKs.\nAs of Dec. 31, 2016, Icelandair’s fleet totaled 48 aircraft, up five from 2015. Forty aircraft are owned; eight are leased. The fleet comprises 29 Boeing 757-200s, one 757-300, six 767-300s, one 737-700, two 737-800, two Bombardier Q200s, three Q400s and four Fokker F-50s. The company has ordered 16 new 737 MAX 8 and MAX 9 aircraft, which are scheduled for delivery beginning in the first quarter of 2018.\n“The results for the year are the second best in the company’s 80-year history, and on the whole operations were successful over the year in challenging conditions,” Icelandair president and CEO Björgólfur Jóhannsson said.\nBut Jóhannsson cautioned about a recent turn of events that could make 2017 a troubling year.\n“At the beginning of this year … it is clear that circumstances are very challenging …Icelandair’s flow of bookings has taken a negative turn. Bookings are slower than expected, and average airfares in the market have fallen below projected levels,” Jóhannsson said. “In the last few days we have seen news confirming that this development is affecting the airline industry in general. This trend can principally be traced to increased competition, but it can also be argued that uncertainty resulting from changes in international politics has affected demand … currency trends have been unfavorable for the company compared to last year; in addition, fuel prices are rising.”\n“We need to look to the future and determine how we intend to meet these changed circumstances … Icelandair will make adjustments in the structure of its air fares and increase the diversity of its product offerings … to meet increased competition and changed patterns of consumer behavior,” Jóhannsson said.\nMark Nensel mark.nensel@penton.com",
    "source_domain": "atwonline.com",
    "title": "Icelandair posts $89 million 2016 net profit",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airline-financials/icelandair-posts-89-million-2016-net-profit"
}