{
    "authors": [
        "Sean Broderick"
    ],
    "date_download": "2018-04-25 04:25:51+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Flabor%2Ffrontier-trans-states-airlines-agree-new-pilot-flow-program.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/frontier-airbus-a320-neo-lax-rf-5k5a4530.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Denver-based Frontier Airlines has agreed to a flow-through program for Trans States Airlines (TSA) pilots, giving the mainline carrier feed for its aggressive expansion plans, while the regional carrier gets a benefit to help it attract more pilot applicants.\nThe deal paves the way for TSA pilots to flow up to Frontier as first officers in as little as two years.\n“With forecasted retirements, it's no secret that the demand for highly qualified pilots will grow over the next several years,” Frontier COO Jim Nides said. “This new partnership helps address our future pilot staffing needs while providing pilots entering the workforce a certainty for their careers.”\nFrontier is in expansion mode, with a target of serving 50 million passengers with a 200-aircraft Airbus narrowbody fleet by 2026. The carrier currently serves more than 80 destinations and operates 300 flights per day with 80 A320-family aircraft, a mix of ceos and neos. Frontier, part of privately held Indigo Partners, does not release detailed traffic or financial information.\nThe agreement gives Missouri-based TSA a leg up on competitors that do not have flow-through agreements, and aligns with the carrier's existing operation. Frontier is the third-largest carrier at Denver International Airport with an 11% share of traffic in 2017, US Transportation Department figures show, and—like Trans States—has a pilot base in the city.\n“Judging by the popularity of our growing Denver crew base with our crews, we expect Frontier’s significant presence in Denver to be very attractive to our pilot group,” Trans States chief pilot Lee Stelzner said.\nThe agreement makes qualified Trans States pilots eligible immediately. First officers must complete a minimum of two years’ active service with Trans States, while pilots who have upgraded to captain must complete a minimum of one year of active service after upgrading, Trans States said.\nSean Broderick, sean.broderick@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "Frontier, Trans States airlines agree to new pilot flow program",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/labor/frontier-trans-states-airlines-agree-new-pilot-flow-program"
}