{
    "authors": [
        "Karen"
    ],
    "date_download": "2017-12-11 08:11:23+00:00",
    "date_modify": null,
    "date_publish": "2017-12-10 00:00:00",
    "description": "It's 3am, London time, Monday and I'm sitting on the floor of Heathrow Terminal 5. My British Airways flight was supposed to get me home to Washington DC Sunday evening. However, there was a little sleet and snow around London and the system ground to a halt.",
    "filename": "http%3A%2F%2Fatwonline.com%2Fblog%2Fbritish-airways-heathrow-uk-border-force-mess-big-time.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "It's 3am, London time, Monday and I'm sitting on the floor of Heathrow Terminal 5.\nMy British Airways flight was supposed to get me home to Washington DC Sunday evening. However, there was a little sleet and snow around London and the system ground to a halt. As I arrived at Heathrow T5, there a lot of flight had already been canceled (mostly to or from Europe) and delays. And there were long lines of people waiting to get re-ticketed.\nThere was not a lot of snow, but weather can quickly have a knock-on effect. Nevertheless, given that snow was forecast, it was surprising to see that BA and Heathrow seemed little prepared to handle the changes and heavier workloads they must have known would be likely.\nMy flight (an American Airlines ticket operated by BA) was delayed about three hours - first because there was insufficient gates for incoming aircraft as they backed up; then because a passenger's bag had to be unloaded after we boarded; and then for de-icing.\nBut as we finally prepared to leave the gate there was a bang, it went dark and the captain announced there had been an APU failure. By the time the APU restarted, the captain announced worse news; the crew was now at the edge of its roster time and there was no spare crew. The flight was canceled and we would have the de-board. We were on the aircraft almost another hour -- because we were waiting for gate agents, they said.\nWe were told we'd have to go back through immigration, collect our bags, then return to check-in where BA staff would rebook our flights and find us hotel accommodation.\nFrom the moment we de-boarded, however, there was no sight at all of any BA staff. We backtracked through T5's tortuously complicated transit system. This involves two sets of escalators and elevators. The escalators were not working and only two of the three elevators worked, so there was a big backup and crush. But much worse was to come. At immigration, the queues snaked forever. Again, not a single BA or Heathrow agent to be seen. There was no proper signage and a lot of confusion as masses of people from canceled flights tried to work out which was the right place to be for UK, EU or other passports. In the end, it didn't matter. The queues all became one huge clog. I stood for three hours. So did many elderly people and families with small children. There was no one to help or prioritize them.\nAfter three hours, when I at last cleared UK Border Force & Immigration, there was more chaos in the baggage area. Hundreds of bags were piled across the floor in no order and with no signs. And no-one helping anyone to locate their bags. It was now 1am and we finally heard a BA voice (but did not see a BA person), sternly telling us if we couldn't see our bags we must leave the baggage area. We were told there would be no help with hotels; and BA could do nothing more until they reopened at 5am. BA may have been off the hook for any assistance where weather was the cause of cancellation, but my flight was canceled because of an APU failure and crew unavailability. Nevertheless, there was no one at all to help.Karen\nSo here I am, at now 3.30am, on the floor of a freezing cold T5. No bags, No ticket, No idea when I'll get out of here. BA.com and AA.com are useless - clearly the system just caves in when there is an unforeseen event, which is precisely when you want an airline's online system to work. There are, of course, lots of miserable, tired, cold people sharing this floor with me. They are all BA customers. But there is no evidence of any BA or Heathrow staff. Even if some are working behind the scenes to try and make tomorrow a better day, there should be staff out here with their customers. But there is no evidence whatsoever that they see themselves as being in the service industry or that they regard these people on the floor as their customers.\nKaren Walker karen.walker@informa.com",
    "source_domain": "atwonline.com",
    "title": "British Airways, Heathrow & UK Border Force mess up big time",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/blog/british-airways-heathrow-uk-border-force-mess-big-time"
}