{
    "authors": [
        "Aaron Karp"
    ],
    "date_download": "2017-04-18 05:52:20+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairlines%2Ftrump-moves-restore-ex-im-bank-full-functionality.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "The US Export-Import bank (Ex-Im), a key financing tool for major commercial aircraft transactions, moved a step closer to becoming fully functional again after US President Donald Trump nominated two new Ex-Im board members.\nThe nominees are former US Reps. Scott Garrett (R-New Jersey) and Spencer Bachus (R-Alabama). Garrett was nominated by Trump to be Ex-Im’s president, while Bachus would be a board member. Both would have four-year terms. The US Senate must confirm the nominations.\nOnce a non-controversial US government agency that financed export credit loans, helping facilitate commercial aircraft deals, Ex-Im became a political lightening rod in 2015, with many lawmakers—particularly Republicans—criticizing it as a vehicle for crony capitalism. Ex-Im’s authorization expired altogether for more than five months in 2015 before Congress restored its authority through 2019 in December 2015. However, Ex-Im has been only partially operational since then because it lacks the requisite number of board members to authorize transactions of more than $10 million, meaning it could not finance, among other deals, most Boeing commercial aircraft orders.\nThat status appeared unlikely to change after Trump was elected president; as a candidate, he had regularly blasted Ex-Im and promised to shut it down. But the president reversed course last week, telling the Wall Street Journal that while he once considered Ex-Im to be a “ridiculous thing,” he has come to understand that “actually it’s a very good thing and it actually makes money.”\nHe then moved to nominate Garrett and Bachus, setting the stage for Ex-Im to be restored to full power if they are confirmed to the board. “This is a crucial next step to restoring a quorum on the bank’s board so it can approve transactions larger than $10 million and restore American export competitiveness in the global marketplace,” the US Aerospace Industries Association (AIA) said in a statement, adding, “The bank currently has a backlog of 40 deals worth more than $30 billion that it cannot process … Ex-Im Bank support is critical for US exporters in the aerospace and defense industry—both large companies and their small and medium suppliers.”\nHowever, some members of Congress pointed out that Garrett was among the lawmakers who have been vocal critics of Ex-Im and is an odd choice to lead the agency, calling into question how firm Trump’s new support for Ex-Im actually is.\nAaron Karp aaron.karp@penton.com",
    "source_domain": "atwonline.com",
    "title": "Trump moves to restore Ex-Im Bank to full functionality",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airlines/trump-moves-restore-ex-im-bank-full-functionality"
}