{
    "authors": [
        "Adrian Schofield"
    ],
    "date_download": "2018-04-25 04:27:04+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fmro%2Ftwo-air-new-zealand-787s-grounded-after-engine-inspections.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/air-new-zealand-boeing-787-9-akl-rf-5k5a8342.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Air New Zealand grounded two of its Boeing 787-9s April 21 for what could be an extended period after some of the 787 fleet’s engines failed inspections directed by safety regulators.\nFour of the carrier’s Rolls-Royce Trent 1000 engines have had to be sent to a Rolls facility in Singapore for repairs, an airline spokesperson told ATW’s sister publication Aviation Daily. After swapping some of the Trent 1000s within the fleet, two of the carrier’s 11 787-9s will be left without engines.\nThe latest inspections were carried out after the FAA and European Aviation Safety Agency (EASA), in collaboration with the manufacturer, identified new concerns with intermediate pressure compressor blade fatigue and cracking. The issue requires more urgent attention than had previously been advised, the regulators said.\nOperating restrictions and additional inspections were ordered by the FAA and EASA, and other national aviation authorities, including New Zealand’s, have endorsed these actions. The new measures apply to the Package C series of Trent 1000s with more than 300 cycles. Air New Zealand had nine engines in this category, and all have now been inspected.\nThe airline noted that because of the large number of engines affected globally, there is “very high demand on Rolls-Royce’s maintenance facility meaning it may take a number of months before Air New Zealand’s engine repair work can be completed.” Rolls-Royce has said that the newest inspection requirements apply to 380 engines.\nAir New Zealand has already been reshuffling its fleet and making changes to its schedule to accommodate the inspections and operating restrictions, which reduced the limits for flights using extended-range twin-engine operations performance standards (ETOPS). Many flights have had to be rescheduled, and some canceled. More schedule changes will be announced in coming days.\nThe carrier is also planning to bring in extra aircraft, and will once again lease aircraft from European operator Hi Fly next month. Air New Zealand wet-leased two widebodies from Hi Fly recently to cover for previous 787 engine issues, although these have now been returned. Aviation Daily understands the airline is considering dry-leasing some 777s in the longer-term, although the source of these aircraft is unknown.\nAir New Zealand “remains fully compliant with the directives” from the FAA, EASA and Rolls-Royce, said David Morgan, the carrier’s chief operational integrity and standards officer. “Like Air New Zealand, aviation regulators prioritize safety over everything else and EASA and FAA have taken a very conservative approach in the checks and restrictions they’ve put in place around these engines,” Morgan said.\nAdrian Schofield, avweekscho@gmail.com",
    "source_domain": "atwonline.com",
    "title": "Two Air New Zealand 787s grounded after engine inspections",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/mro/two-air-new-zealand-787s-grounded-after-engine-inspections"
}