{
    "authors": [
        "Alan Dron"
    ],
    "date_download": "2018-02-03 02:44:03+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fregulation%2Fsweden-implements-new-rules-uav-use.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Sweden has become the latest country to regulate the use of unmanned aerial vehicles (UAVs), or drones, covering both private and commercial operators.\nSwedish Transport Agency Transportstyrelsen said that while the rapidly developing UAV technology presents great opportunities, the craft must be operated safely.\nUnder the new rules, Swedish UAV operators must fly their craft more than 5km (3.1 miles) away from an airport’s active runway, or at least 1km away from a helicopter landing area.\nNeither may fly UAVs “over a short distance or in such a way that can disrupt a rescue operation in progress”—presumably in the event of an accident where emergency service helicopters are present.\nUAVs may only be flown in controlled airspace by special permission and on terms set by the relevant air traffic control unit for the airspace concerned, according to the new regulations.\nOperators controlling a drone in traffic information zones or traffic information areas, must maintain a two-way radio connection, or equivalent, in agreement with air traffic management. Flights in a traffic zone may only be done after consultation with the relevant airport.\nUAV operators violating these rules face a fine or imprisonment, the agency warned.\nNations are scrambling to find ways to control, or integrate UAV operations, given the fears that a collision between a drone and an airliner or light aircraft could result in a crash.\nAlan Dron alandron@adepteditorial.com",
    "source_domain": "atwonline.com",
    "title": "Sweden implements new rules for UAV use",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/regulation/sweden-implements-new-rules-uav-use"
}