{
    "authors": [
        "Helen Massy-Beresford"
    ],
    "date_download": "2018-04-25 04:26:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fregulation%2Feu-regulator-investigates-alitalia-state-loan.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/alitalia-aircraft-fco-rf-img0668.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The European Commission (EC) has opened an in-depth investigation to assess whether Italy’s €900 million ($1.1 billion) bridge loan to flag carrier Alitalia constituted state aid and whether it complied with European Union (EU) rules for aid to companies in difficulty.\nAlitalia, which is 49% owned by Etihad Airways, filed for bankruptcy in May 2017 after employees rejected a labor agreement that would have unlocked shareholder funding for a turnaround plan.\nThe carrier has kept operating with the help of government funding as the process for finding an investor continues slowly, with UK LCC easyJet, Lufthansa and Cerberus Capital Management in the running and Lufthansa seen as the frontrunner.\nCommissioner Margrethe Vestager, in charge of competition policy, said: “The Commission has a duty to make sure that loans given to companies by member states are in line with the EU rules on state aid. We will investigate whether this is the case for Alitalia.\"\nThe Italian government awarded a €600 million bridge loan to the airline in May 2017, adding an extra €300 million to the loan in October and notifying the European Commission that the funding was classified as “rescue aid”.\nThe Commission said it had received a number of complaints in 2017 alleging that the loan constituted state aid that was not compatible with the applicable EU rules.\n“The Commission’s current view is that the state loan may constitute state aid,” the EC said. “It will now investigate further whether the loan satisfies the conditions under the Guidelines.”\nThe EC said it had concerns that the duration of the loan—from May 2017 until at least December 2018—exceeded the maximum of six months for a rescue loan. “Furthermore, the Commission has doubts as to whether the aid is limited to the minimum necessary.”\nIt now plans to investigate whether these initial concerns are justified.\nUnder EU state aid rules, public interventions in favor of companies can be considered free of state aid when they are made on terms that a private operator would have accepted under market conditions.\nAlitalia has had a troubled financial history and this is not the first time its funding has come under scrutiny.\nA €300 million loan granted to Alitalia following a previous bankruptcy in 2008 was found to come under the classification of state aid, but Compagnia Aerea Italiana, the consortium of investors that holds 51% of Alitalia, was not forced to pay back the loan because it was not considered a legal successor to the bankrupt airline.\nIrish budget carrier Ryanair had brought a court case over the earlier loan, but lost its appeal.\nHelen Massy-Beresford, helen.massy-beresford@aviationweek.co.uk",
    "source_domain": "atwonline.com",
    "title": "EU regulator investigates Alitalia state loan",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/regulation/eu-regulator-investigates-alitalia-state-loan"
}