{
    "authors": [
        "Aaron"
    ],
    "date_download": "2017-12-11 23:10:08+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": "With the US Department of Transportation (DOT) dropping proposed rules that would have required airlines to disclose add-on fees—most prominently checked baggage fees—“up front,” there is a lot of finger wagging in the media and among politicians about “secret” or “hidden” airline fees.",
    "filename": "http%3A%2F%2Fatwonline.com%2Fblog%2Fshould-movie-theaters-disclose-popcorn-prices-front.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/12/aaron-karp-2_0.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With the US Department of Transportation (DOT) dropping proposed rules that would have required airlines to disclose add-on fees—most prominently checked baggage fees—“up front,” there is a lot of finger wagging in the media and among politicians about “secret” or “hidden” airline fees.\nFirst, it’s worth noting that baggage fees made up 2.7% of US carriers’ total revenue in the 2017 third quarter, according to DOT data. Base fares made up 75% of US airlines’ total revenue. So while bag fees do help airlines earn money, they are not, by any means, a primary source of airline revenue—nor, as I’ve explained before, is there evidence the fees drive up the total price passengers are paying. Second, it is unclear how the “up front” disclosure would work—if one person searching for a fare has no intention of checking a bag and another person plans to check two or three, how do you include the fee in the fare on an airline website or a search engine? An average, splitting the difference between the total cost paid for no checked bags and three bags checked? Should the cost of a beer or a glass of wine on a domestic flight be included in the “up front” ticket price as well?\nFinally, there is little secret about airline checked baggage fees, which have been around for a decade now in the US. How many people really show up at the airport and are stunned to pay a bag fee? The specific fees are there for anyone to see on airline websites, not hidden from public view.\nAs a thought experiment, think about add-on fees in commercial aviation much the same way you’d think about “fees” in other commercial industries. For example, are popcorn and soda “fees” hidden by movie theaters? Why not disclose popcorn charges “up front” by including them in the movie ticket price? How about a beer and a hot dog at a baseball game? Why not include two $8 beers in the price of a bleacher ticket at a baseball stadium? How about the satellite radio or heated seats in a car? Why aren’t these included in the sticker price? So on and so on. We pay added “fees” all the time that are not included in the base price of a product or service.\nAirlines do include taxes in flight ticket prices; hotels do not, even though every guest has to pay them. When you see a hotel room price online, you know it is $20 or so low because the taxes are not included. Nor is the cost of breakfast room service.\nThe fact remains that some air travelers almost never check bags, some check one and others check multiple bags. Why should each of these passengers pay the same total price?\nSouthwest Airlines, of course, has made “no fees” a central part of its brand. And consumers can choose to fly the carrier for this reason. But the only reason this is such a distinguishing characteristic is that everyone knows every other US airline charges so-called “hidden” baggage fees.\nAaron Karp aaron.karp@informa.com",
    "source_domain": "atwonline.com",
    "title": "Should movie theaters disclose popcorn prices ‘up front’?",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/blog/should-movie-theaters-disclose-popcorn-prices-front"
}