{
    "authors": [
        "Tony"
    ],
    "date_download": "2018-05-30 18:18:24+00:00",
    "date_modify": null,
    "date_publish": "2018-05-07 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fengines%2Frolls-royce-speeds-permanent-trent-1000-engine-fix.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/05/787glider-tonyosborne.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Rolls-Royce is accelerating the process of inspections and the development of a permanent fix for the issues impacting its Trent 1000 Package C engine powering the Boeing 787.\nThe issues, which have caused wide disruption to several 787 operators and forced the storage of aircraft in an engineless state, has prompted Rolls-Royce to increase maintenance capacity to deal with a new inspection regime, announced in April, and develop a more permanent fix for the problem that the company hopes to begin testing in June.\nThe company is hoping the fix will solve cracks found in the blades of the intermediate pressure (IP) compressor rotor.\nA revised compressor blade has been installed in a test engine. If successful, the company hopes to have the first parts available for engine overhauls by the end of the year, rather than in 2019 when the company originally planned.\nThe issues have prompted a number of regulators to reduce extended-range, twin-engine operations standards (ETOPS) clearances for some of the 787s powered by Rolls-Royce engines. Some airlines have been forced to readjust schedules or bring in extra aircraft to deal with the capacity shortfalls.\nSome 380 Package C engines are in-service with airlines, Rolls-Royce said in April.\n“We fully recognize the unacceptable levels of disruption our customers are facing,” Rolls-Royce civil aerospace president Chris Cholerton said. “We are intensely focused on minimizing this and we have set our teams the challenge of doing everything we can to recover our customers’ operations as swiftly as possible.”\nThe company has increased inspection capacity by opening what it calls additional MRO lines with inspections being performed at London Heathrow Airport and the company’s site in Derby, England, as well as in Singapore. The company is planning to increase this capacity further still.\nRolls-Royce has not provided details on the new blade, but said its development has been accelerated using new simulations processes and what is calls a “fast make” competencies in its supply chain. The company has also developed on-wing inspection techniques.\nTony Osborne/Aviation Week tony.osborne@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "Rolls-Royce speeds up permanent Trent 1000 engine fix",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/engines/rolls-royce-speeds-permanent-trent-1000-engine-fix"
}