{
    "authors": [
        "Katie Cantle"
    ],
    "date_download": "2017-04-17 19:17:55+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Fchina-eastern-china-southern-approved-new-airport-investment.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/04/china-southern-a321s-bjs-rf.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "China Eastern and China Southern airlines have won approval from the National Development and Reform Commission of China (NDRC) to invest in Beijing’s new airport, which is expected to open in 2019.\nShanghai-based China Eastern and Guangzhou-based China Southern will invest CNY13.2 billion ($1.9 billion) and CNY14.8 billion, respectively, in the yet-to-be-named airport in an effort to enhance their positions in the Beijing market.\nIn July 2016, the Civil Aviation Administration of China announced the two carriers, along with other SkyTeam members, will move to the new airport, which is located Beijing's Daxing district.\nBeijing-based Air China and other Star Alliance member carriers are expected to remain at Beijing Capital Airport, which has a slot shortage.\nChina Eastern and China Southern are expected to build their own infrastructures at Beijing’s new airport based on their respective passenger boardings. This would account for 40% of the airport’s annual passenger volume—which is projected to be 45 million in 2020, 72 million in 2025, and 100 million in the longer term.\nAccording to the NDRC, China Eastern’s infrastructure at the new airport will cover 1.16 million sq m (12.5 million sq. ft.) and China Southern’s infrastructure will be 1.09 million sq m. (11.7 million sq. ft.).\nChina Eastern plans to position Beijing’s new airport as its core strategic hub for its most profitable Beijing-Shanghai route, increase the number of long-haul routes from Beijing, and strengthen cooperations with other SkyTeam members. Currently, China Eastern has no direct intercontinental long-haul route from Beijing.\nIn 2011, China Southern signed a cooperation agreement with the Beijing government to allocate 200 Airbus A330s and A380s to the new airport over the next 10 years.\nBoth carriers can take a four-year transition period to transfer all domestic and international routes to the new airport in exchange for favorable policies and support in areas that include international traffic rights, slots allocation, airport charges and ground handling.",
    "source_domain": "atwonline.com",
    "title": "China Eastern, China Southern approved for new airport investment",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/china-eastern-china-southern-approved-new-airport-investment"
}