{
    "authors": [
        "Helen Massy-Beresford"
    ],
    "date_download": "2018-04-25 04:26:11+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Flabor%2Fair-france-strikes-continue-impact-operations.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/air-france-airbus-a380-jnb-rf-img4551.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Air France said it expected to operate almost 75% of its flights on April 24 as strikes over pay continue.\nThe carrier said 70% of long-haul flights should go ahead, as well as 65% of medium-haul flights to and from Paris Charles de Gaulle and 80% of short-haul flights.\nThat estimate is based on 27.2% of pilots, 19.9% of cabin crew and 15.6% of ground crew taking part in the strikes.\nOn April 23, also a strike day, flights were operating as expected, according to the carrier, which had predicted 65% of long-haul flights, 65% of medium-haul flights to and from Charles de Gaulle and 80% of short-haul flights would operate.\nLast week, Air France-KLM CEO Jean-Marc Janaillac launched a company-wide consultation with Air France staff, putting his own job on the line in a bid to put an end to the strikes after unions rejected the carrier’s latest offer of a multi-year “growth pact” pay proposal, which promised a 7% wage increase over four years. It also included individual increases, which included scope to adjust that if Air France’s financial result was less than €200 million ($246 million) and to apply a reversion clause in case of higher inflation or a negative financial result.\nThe electronic vote on the offer will be open from April 26 to early May, and Janaillac has declared himself “personally accountable for the consequences of the vote.”\nUnions have called for more walkouts in early May and the company said the strikes so far have cost an estimated €220 million ($270 million).\nHelen Massy-Beresford, helen.massy-beresford@aviationweek.co.uk",
    "source_domain": "atwonline.com",
    "title": "Air France strikes continue to impact operations",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/labor/air-france-strikes-continue-impact-operations"
}