{
    "authors": [
        "Jens Flottau"
    ],
    "date_download": "2018-04-25 04:26:21+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairframes%2Fairbus-a350-900-ultra-long-range-aircraft-makes-maiden-flight.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/a350-900-ulr-singapore-airlines-take.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Airbus A350-900 ULR (ultra long-range) made its first flight on April 23, starting a short flight test program ahead of its first delivery in the second half of 2018.\nThe aircraft, MSN 216, will be the only one involved in the test campaign that, according to A350 head of marketing Marisa Lucas-Ugena, will take only weeks to complete. Launch customer Singapore Airlines has ordered seven. The airline—so far the only airline that has ordered the type—plans to re-introduce nonstop flights from Singapore to New York, among other destinations. Airbus hopes Qantas will also select the type for the planned expansion of ultra-long haul services from Australia.\nThe A350-900 ULR features a maximum takeoff weight (MTOW) of 280 tons, up from the current maximum of 275 tons. Airbus also introduced aerodynamic changes to the wing: the winglets are now 0.5 meters higher and the flap fairings are extended by 0.3 meters. The wing twist has also been changed slightly. The changes to the wing will become standard also on the A350-900, for which the 280-ton MTOW will be on offer as well.\nThe ULR version will incorporate changes to the center fuel tank to allow more fuel volume to be used. The aircraft will be able to carry an additional 24,000 l of fuel compared to the standard -900. According to Airbus, it will have a range of 9,700 nm compared to 8,100 nm for the A350-900 and 7,950 nm for the -1000. The A350-900 ULR competes with Boeing’s 787-9 and 777-8X in the small market for ultra long-haul routes. United already deploys the 787-9 on sectors such as Los Angeles-Singapore and Qantas recently introduce non-stop flights from Perth to London-Heathrow.\nJens Flottau, jens.flottau@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "Airbus A350-900 ultra long-range aircraft makes maiden flight",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airframes/airbus-a350-900-ultra-long-range-aircraft-makes-maiden-flight"
}