{
    "authors": [
        "Linda Blachly"
    ],
    "date_download": "2018-04-25 04:24:01+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fmro%2Fmro-briefs-april-24-2018.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Embraer Services & Support signed a services agreement with Belavia Belarusian Airlines to support the carrier’s E-Jets fleet. The program will support Belavia’s existing fleet of two E-175s and two E-195s.\nS7 Technics was selected by Russia’s Azimuth Airlines for its first Sukhoi Superjet 100 (SSJ100) C-Check. The aircraft was redelivered to the operator after its first heavy maintenance check, which was completed at Domodedovo International Airport at the beginning of April. The current project, the C-check on Azimuth Airlines’ SSJ 100 was the ninth heavy maintenance check on the type for the provider.\nMagellan Aerospace has a 5-year, C$48 million ($37.5 million) Airbus contract to supply A330 wing ribs.\nStandardAero has a 3-year contract from Canada’s Air Georgian to provide maintenance support out for 17 Honeywell 36-150RJ APUs for its Bombardier CRJ100/200s; work will be performed at Maryville, Tennessee.\nFastener Distribution Holdings (Audax Private Equity) has acquired Southern California-based Blue Sky Industries, which distributes C-class parts to MROs and OEMs.\nAirbus was selected by Philippine Airlines to provide component maintenance support for six A350-900s under its Flight Hour Services (FHS) program, powered by SkyWise data platform.\nSR Technics has a 10-year Hong Kong Express contract to provide component maintenance, pool access and logistical services out of Kuala Lumpur (pools in Hong Kong) for 20 Airbus A320ceos/12 A320neos.\nCavu Aerospace has purchased 20 ex-American Airlines’ MD-80s for part out.",
    "source_domain": "atwonline.com",
    "title": "MRO Briefs-April 24, 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/mro/mro-briefs-april-24-2018"
}