{
    "authors": [
        "Sean Broderick"
    ],
    "date_download": "2018-04-25 04:24:11+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Faircraft-orders-deliveries%2Funited-takes-first-boeing-737-max-set-begin-services-june.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/ual737-max-9nwvw05-v33131510418mr-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "United Airlines has taken delivery of its first Boeing 737 MAX-family aircraft, a 737-9, and confirmed plans to start service with the newest Boeing narrowbody twinjets in early June.\nThe Chicago-based carrier, which has 161 737 MAX-family aircraft on order, expects to take delivery of three 737-9s in April and six before the aircraft enters scheduled service on June 7. It will have 10 737-9s by year-end, meaning the aircraft will make up nearly half of the 24 planned additions to the carrier’s mainline fleet in 2018.\nInitial 737-9 routes will connect United’s Houston’s George Bush Intercontinental Airport hub and five cities: Anchorage, Alaska; Austin, Texas; Fort Lauderdale and Orlando, Florida; and San Diego, California. The Anchorage service marks the return of a seasonal route. Additional 737-9 flights will begin June 29.\nUnited’s 737-9s are configured with 179 seats, including in 20 first-class and 44 in economy plus. Like the carrier’s 787s, the 737 MAXs will feature a special livery the airline said is intended to emphasize its eco-friendliness.\nMeanwhile, United said its Polaris business-class rollout will see a retrofitted aircraft join the fleet about once every 10 days through 2020. The carrier announced Polaris in mid-2016, including a new business-class cabin, onboard service and lounges. Production delays at seat-manufacturer Zodiac Aerospace have delayed United’s retrofit plans.\nSean Broderick, sean.broderick@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "United takes first Boeing 737 MAX; set to begin services in June",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/aircraft-orders-deliveries/united-takes-first-boeing-737-max-set-begin-services-june"
}