{
    "authors": [
        "Alan Dron"
    ],
    "date_download": "2018-05-30 18:18:34+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fregulation%2Fuk-introduces-laws-target-reckless-uav-users.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "The UK introduced new laws May 30 that will restrict all unmanned aerial vehicles (UAVs) from flying above 400 ft. and within 1km (.62 mile) of airport boundaries.\nHowever, the British Airline Pilots’ Association (BALPA) responded with alarm to the announcement, saying that—while it is pleased the government is taking steps to improve safety—the restrictions need to go much further to make the use of drones near airports safe.\nBALPA described the “limited restrictions” allowing drones to be flown up to 400 ft. just 1km from an airport boundary as “very dangerous” as aircraft would already be at a lower altitude at this point on approach to an airport. It urged stronger regulations.\nFollowing a steady increase in reports of UAV incidents with aircraft—89 were recorded in 2017 compared to 71 in 2016—the new measures are intended to reduce the possibility of damage to windows and engines of aircraft. The changes will become formally effective July 30.\nUAV users who flout the new height and airport boundary restrictions could be charged with recklessly or negligently acting in a manner likely to endanger an aircraft or any person in an aircraft. This could result in an unlimited fine, up to five years in prison, or both.\nFrom Nov. 30, 2019, owners of UAVs weighing 250 grams (.55 lb.) or more will also be required to register with UK aviation regulator the CAA and UAV pilots will have to take an online safety test, in an attempt to weed out irresponsible flyers.\nUsers who fail to register or sit for competency tests could face fines of up to £1,000 ($1,330).\nEventually, UAV operators will also be required to use apps so they can access information needed to make sure any planned flight can be made safely and legally.\n“We are seeing fast growth in the numbers of drones being used, both commercially and for fun,” UK aviation minister Baroness Sugg said May 30.\n“While we want this industry to innovate and grow, we need to protect planes, helicopters and their passengers from the increasing numbers of drones in our skies. These new laws will help ensure drones are used safely and responsibly.”\nBALPA demurred: “We hoped we would see something similar to the regulations introduced in Australia, which state that unmanned operations must not be flown within 3 nautical miles (around 5.5km or 3.45 mile) of an airfield,” BALPA flight safety specialist Steve Landells said.\n“BALPA is not anti-drone and we understand the commercial considerations in not making laws too restrictive, but a hobbyist drone has no business being flown near an airport.”\nLondon Gatwick Airport COO Chris Woodroofe said it welcomed “the clarity that today’s announcement provides as it leaves no doubt that anyone flying a drone must stay well away from aircraft, airports and airfields. These clear regulations, combined with new surveillance technology, will help the police apprehend and prosecute anyone endangering the traveling public.”\nIn addition to measures introduced May 30, a draft Drones Bill will be published this summer, which will give police more tailored powers to intervene on the spot if drones are being used inappropriately.\nFor model aircraft flying associations that have a long-standing safety culture, work is underway with the CAA to make sure drone regulations do not impact their activity.\nAlan Dron alandron@adepteditorial.com",
    "source_domain": "atwonline.com",
    "title": "UK introduces laws to target reckless UAV users",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/regulation/uk-introduces-laws-target-reckless-uav-users"
}