{
    "authors": [
        "Kurt Hofmann"
    ],
    "date_download": "2018-04-25 04:23:11+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairlines%2Flaudamotion-eurowings-end-cooperation.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/laudamotion_0.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lufthansa LCC subsidiary Eurowings will end its cooperation agreement with Austrian startup LaudaMotion by the end of May, LaudaMotion confirmed to ATW. The move follows the April 11 announcement that German leisure carrier Condor is also ending its cooperation with the startup carrier by the end of the month.\nBoth announcements come after LaudaMotion founder Niki Lauda agreed to sell a 24.9% stake to Irish LCC Ryanair March 28, with the option of taking the share up to 75% following regulatory approvals. Ryanair is investing close to €100 million ($123 million) into the equity as well as startup support.\nLaudaMotion was created using assets acquired from Austrian carrier NIKI, which Lauda also founded. NIKI became a 100% subsidiary of airberlin in 2011, but ceased operations in December after airberlin went into bankruptcy in October. Lufthansa had wanted to acquire NIKI, but was blocked by European competition authorities.\nEurowings MD Oliver Wagner said in an April 11 telephone conference that the LCC will use spare aircraft to make up for capacity loss from the termination of the LaudaMotion cooperation. From June 1, the carrier will have its own operations in Germany, Switzerland and Vienna.\nAn industry source told ATW that as of June 1, LaudaMotion’s fleet will comprise 10 Boeing 737s operated by Ryanair and 11 Airbus A320 family aircraft from LaudaMotion, which had previously planned to have 15 Airbus aircraft available by June 1.\nThe number of 737s will be partly reduced when more Airbus aircraft from Lufthansa become available.\nThe original plan was for Ryanair to fly from Berlin with six aircraft for LaudaMotion. Two additional Ryanair 737s will be based in Zurich; the bases for the remaining two aircraft are not known.\nKurt Hofmann hofmann.aviation@netway.at",
    "source_domain": "atwonline.com",
    "title": "LaudaMotion, Eurowings to end cooperation",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airlines/laudamotion-eurowings-end-cooperation"
}