{
    "authors": [
        "Alan Dron"
    ],
    "date_download": "2018-05-30 18:17:34+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairline-financials%2Fsas-scandinavian-airlines-narrows-1h-losses-improved-earnings.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/05/sas-airbus-a320-neo-lhr-rf-5k5a9222_0.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Scandinavian Airlines (SAS) reported a 2018 first-half net loss of SEK597 million ($68.8 million), narrowed from SEK876 million in the year-ago period.\nThe carrier said underlying earnings improved over the 1H of its 2017-18 financial year, which helped reduce the net loss. SAS made the loss on turnover fractionally up at SEK18.9 billion, compared to SEK18.8 billion a year ago.\nOverall, factors including deterioration of the Swedish kroner against other currencies; a longer, colder-than-normal winter; and rising fuel prices have kept the company in the red.\nSAS’s first half, which runs from November to the end of April, is traditionally the weaker period of the year.\nHowever, the underlying earnings trend for 2Q was because of “successful seasonal adjustments, which together with sales campaigns and efficient pricing policies led to higher passenger numbers and a slightly more positive than expected yield trend,” CEO Rickard Gustafson said.\nHe added that the implementation of efficiency measures continued and contributed to a year-on-year decrease of 2.5% in currency-adjusted unit cost, excluding jet fuel.\nNoting the ongoing sharp rise in fuel prices, Gustafson said SAS was hedged at around 83% of planned consumption for 3Q and 91% for 4Q, at a price of around $600 per tonne.\nCFO Torbjørn Wist noted that economic headwinds during 2Q had included an adverse currency exchange balance of SEK145 million.\nUnseasonably cold weather well into April had also led to higher aircraft de-icing costs than normal and had affected punctuality.\nIn a sign of good prospects for the second half of the year, he said that economics in Scandinavia were strong and Europe generally was relatively stable. SAS’s guidance for its full-year figures remained at SEK1.5 to 2 billion, before tax and non-recurring items.\nGustafson said that around half of SAS’s short-haul fleet has been outfitted with refurbished cabins and 30 aircraft had been fitted with high-speed Wi-Fi.\nIn the 1H, SAS ordered 50 Airbus A320neos, plus five options, which are expected to maintain the airline’s momentum in heading toward an all-Airbus fleet by 2023, phasing out Boeing 737s.\nAsked during a conference call whether some of the newly ordered A320neos might be converted to A321neo LRs, Gustafson described the larger aircraft as “an interesting opportunity that may open up a new market that could be of interest to SAS. We’ve not made a decision yet, but I do admit that we’re looking at it very seriously and running the numbers on different destinations, both eastbound and westbound, to see if there might be a market for us here.”\nAnd, on the possibility of IAG acquiring LCC Norwegian Air Shuttle, he said it did not matter who owned the Norwegian carrier—it would remain a “strong, ambitious and aggressive competitor in our backyard.”\nAlan Dron alandron@adepteditorial.com",
    "source_domain": "atwonline.com",
    "title": "SAS Scandinavian Airlines narrows 1H losses on improved earnings",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airline-financials/sas-scandinavian-airlines-narrows-1h-losses-improved-earnings"
}