{
    "authors": [
        "Linda Blachly"
    ],
    "date_download": "2017-06-14 22:50:27+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fleasing%2Fallegiant-air-lease-13-a320s-alafco.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/06/allegiant-a320-fll-rf.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ultra-low-cost carrier (ULCC) Allegiant Air has signed a 12-year lease with Kuwait-based ALAFCO Aviation Lease and Finance Co. for 13 Airbus A320s.\nThe Las Vegas-based carrier said the eight-year-old aircraft are expected to enter service beginning in the first quarter of 2018. The agreement includes an option to purchase at the end of the lease term.\nThe A320s will be configured with 186 seats and will be powered by CFM International’s CFM56-5B engines.\nAllegiant called the agreement “another important step” toward the ULCC’s planned transition to an all-Airbus fleet by 2019.\nAllegiant chairman and CEO Maurice Gallagher said the fleet transition “will not only bring the benefit of operating efficiencies in training, scheduling, maintenance and more, but will also mean key economic advantages through greater fuel efficiency and higher seat capacity. This puts us in an ideal position for the future: to continue offering travelers the industry’s best fares, while at the same time increasing reliability.”\nIn May, Allegiant took delivery of its first-ever new A320. The A320s will eventually replace Allegiant’s fleet of 47 MD-80s, 12 of which are expected to exit the fleet this year.\nALAFCO CEO and vice chairman Ahmad Alzabin said Allegiant is ALAFCO’s first US customer. “With the recent establishment of ALAFCO’s Irish subsidiary, we expect further penetration into the North American market,” he said.\nThis transaction brings Allegiant to a total of 92 Airbus aircraft either in service or committed for future delivery.\nLinda Blachly linda.blachly@penton.com",
    "source_domain": "atwonline.com",
    "title": "Allegiant Air to lease 13 A320s from ALAFCO",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/leasing/allegiant-air-lease-13-a320s-alafco"
}