{
    "authors": [
        "Kurt Hofmann"
    ],
    "date_download": "2018-05-30 23:39:48+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairframes%2Fethiopian-airlines-be-first-african-carrier-operate-100-aircraft.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "When Ethiopian Airlines takes delivery of its 100th aircraft—a Boeing 787-9—on June 5, the Star Alliance member will become the first African airline to operate a 100-aircraft fleet in the history of the continent.\nEthiopian Group CEO Tewolde GebreMariam said the “100-fleet milestone, which we have achieved ahead of our Vision 2025 targets, compels us to revise our plans with a view to phase in more aircraft and further expand our network.”\nEthiopian, which was the first to begin jet service on the African continent in 1962, has five more Boeing 787-900s and 16 Airbus A350-900s on order, among others.\nOn May 4, the carrier has placed a follow-on order for 10 Bombardier Q400s, plus purchase rights for five additional Q400 turboprops.\nThe carrier´s fleet is made up of Airbus A350-900, Boeing 787-8, 787-9, 777-300ER, 777-200LR, 777-200F and Bombardier Q400 aircraft, with an average age of less than five years.\nThe fast-expanding network reaches more than 110 international destinations covering five continents and will be extended with 3X-weekly Addis Ababa-Jakarta services starting July 17. The new service will be routed via Bangkok with 787-8s and marks the first flights into Jakarta operated by an African carrier.\nKurt Hofmann, hofmann.aviation@netway.at",
    "source_domain": "atwonline.com",
    "title": "Ethiopian Airlines to be first African carrier to operate 100 aircraft",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airframes/ethiopian-airlines-be-first-african-carrier-operate-100-aircraft"
}