{
    "authors": [
        "Helen Massy-Beresford"
    ],
    "date_download": "2018-04-25 04:24:21+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Faircraft-orders-deliveries%2Fryanair-takes-options-25-boeing-737-max-aircraft.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Irish LCC Ryanair is exercising options on 25 Boeing 737 MAX 200 aircraft, bringing its total firm orders for the type to 135. The first MAX is scheduled to arrive in the first half of 2019.\n“These aircraft, which are valued at more than $3 billion at current list prices, increase Ryanair’s total orders to more than 650 737’s since first partnering with Boeing in 1994, and allow Ryanair to grow its traffic to 200 million customers per annum by 2024,” the fast-growing carrier said.\nRyanair placed an order for 100 737 MAX aircraft in 2014, with an option for 100 more.\nThe airline still has a further 75 options remaining from that order and will take delivery of the first of the aircraft in spring 2019, it said.\nRyanair operates an all-Boeing fleet with an average age of six-and-a-half years. The LCC said the new aircraft will reduce fuel consumption by up to 16% and noise emissions by 40%, while offering 4% or 8 more seats per flight (197 versus 189) than its 737-800NGs.\nIn June 2017, Ryanair also announced it was buying an additional 10 737 MAX 200s, five of which would be delivered in the first half of 2019 and the rest of which would be arriving in the first half of 2020.\nHelen Massy-Beresford, helen.massy-beresford@aviationweek.co.uk",
    "source_domain": "atwonline.com",
    "title": "Ryanair takes options on 25 Boeing 737 MAX aircraft",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/aircraft-orders-deliveries/ryanair-takes-options-25-boeing-737-max-aircraft"
}