{
    "authors": [
        "Katie Cantle"
    ],
    "date_download": "2018-04-25 04:25:31+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Fhainan-airlines-continues-expand-international-services.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/hainan-airlines-airbus-a330-200-syd-rf-5k5a5972.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "China’s Hainan Airlines plans to open at least 40 international services from Hainan by the end of 2022 as China implements a new national policy for building Hainan as a free trade port.\nEarlier in April, Beijing announced a new policy granting a 30-day visa-free visit to Hainan for citizens from 59 countries, effective May 1.\nHainan Province governor Shen Xiaoming has also vowed to expand the number of international services from Hainan to at least 100 in the next two or three years.\nOver the past two years, the Haikou-based carrier has launched 10 international and regional (Hong Kong, Macau and Taiwan) services from Hainan.\n“In 2017, Hainan Airlines carried nearly 20 million passengers in Hainan on 125,000 domestic and international flights, of which passenger boardings reached more than 600,000 on international and regional routes,” the carrier’s chairman Bao Qifa has previously stated.\nHainan Airlines currently operates 53 services from Hainan to 40 international destinations, which the carrier plans to increase in three phases over the next five years.\nPlans include:\n1. Increasing the number of international services originating in Hainan to 58;\n2. Growing the number of international services from Hainan to 100; and\n3. Attracting 2 million inbound passengers to Hainan.\nHainan Airlines parent HNA Group is also committed to building Haikou Meilan International Airport as a gateway to Japan, Korea and Southeast Asia, a major inbound passenger traffic channel connecting with Europe, America and Australia and a south sea hub on Maritime Silk Road.\nHNA Group is also taking an active part in the construction of Sanya Phoenix International Airport, which aims to handle 38 million passengers by 2025 and 70 million by 2045.\nCurrently, international traffic supplied by Hainan Airlines only accounts for 4% of Sanya’s passenger throughput. This year, the carrier plans to launch 10 new services from Sanya to Southeast Asian destinations.\nHNA Group owns three airports—Haikou Meilan Airport, Sanya Phoenix and Qionghai Bo’ao Airport in Hainan.",
    "source_domain": "atwonline.com",
    "title": "Hainan Airlines continues to expand international services",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/hainan-airlines-continues-expand-international-services"
}