{
    "authors": [
        "Alan Dron"
    ],
    "date_download": "2017-12-11 23:09:58+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Flondon-gatwick-boost-capacity-larger-pier.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "London Gatwick Airport plans to more than double the size of its North Terminal’s Pier 6 to keep pace with the airport’s growing number of passengers.\nGatwick is the UK’s second largest airport and the busiest single-runway airport in the world, handling 45 million passengers annually.\nThe project, part of the airport’s five-year capital investment program, will cost £180 million ($240 million).\nBefore work on the extension can start, however, two major enabling projects must be completed. These involve moving the stand for the Airbus A380 from its existing location on Pier 6 to a newly created stand on Pier 5 and widening and re-aligning a taxiway to allow A380s to move between the airport’s single runway and their new stand.\n“This is one of the most important programs of work we have in our current capital investment program, as it will give a crucial boost to our operational efficiency and help us to grow sustainably,” Gatwick construction director Raymond Melee said. “It will be complex, as it is right in the heart of our airfield, but we are experienced in delivering complicated projects in challenging environments at Gatwick.”\nGatwick has appointed US-based contractor Bechtel to handle the project because of what the airport described as the contractor’s expertise in delivering construction projects within complex working environments.\nBechtel will be responsible for the management of engineering, procurement and construction works and will be integrated alongside Gatwick’s construction and development teams.\n“We know that construction in the middle of a very busy airfield can be complex, so we will be working alongside Gatwick’s operational teams to ensure the work is sequenced carefully and that the passenger experience is maintained throughout,” Bechtel UK MD Paul Gibbs said.\nWork is scheduled to start in 2018.The program will be run in four phases, the last of which will be the building of the western extension of Pier 6 itself. This is expected to be operational by 1Q 2022.\nPier 6 follows major transformation projects such as the re-development of the North Terminal, and the newly constructed Pier 1, as well as major works on Pier 5 to create a second level.\nAlan Dron alandron@adepteditorial.com",
    "source_domain": "atwonline.com",
    "title": "London Gatwick to boost capacity with larger pier",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/london-gatwick-boost-capacity-larger-pier"
}