{
    "authors": [
        "Mark Nensel"
    ],
    "date_download": "2017-02-15 11:38:08+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fmanufacturers%2Frolls-royce-2016-profits-down-45.json",
    "image_url": "http://atwonline.com//sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Rolls-Royce Holdings reported £915 million ($1.1 billion) in underlying profit before finance charges and tax for the full-year 2016, down 45% year-over-year, on underlying revenues of £13.8 billion, down 2%.\nThe UK-based group’s total order book for the year was £79.8 billion, up £3.3 billion on the same period last year, led by the group’s civil aerospace division, which reported an order intake of £14.1 billion in 2016, a £1.3 billion increase over 2015. Civil aerospace’s order book closed at £71.4 billion, up £4.4 billion from 2015, which the company said includes a £2.1 billion benefit from a 5% decrease in its long-term foreign exchange rate.\nDuring the year, civil aerospace sales included a $2.7 billion order from Norwegian for Trent 1000 engines; a $1.2 billion order from Garuda Indonesia for Trent 7000 engines and a $900 million order from Virgin Atlantic for the Trent XWB.\nFor the full year, Rolls-Royce’s civil aerospace division underlying revenue grew 2% to £7.1 billion, but underlying profit before tax and finance charges dropped 55% to £367 million.\nThe company also reported a £671 million charge for financial penalties related to settlement agreements with investigating authorities over “historic bribery and corruption involving intermediaries in a number of overseas markets.”\n“[In 2016] we accelerated the transformation of Rolls-Royce. We increased our large engine output by 15% … and made good technical progress in the final stages of the development of the three new large engines due to enter service over the next 12 months,” CEO Warren East said.\n“Rebuilding trust and confidence in the Group and its long-term prospects remains a key priority for the management team,” East said. “[For 2017] year-on-year incremental progress will be modest; our medium-term trajectory for revenue, profit and free cash flow remains unchanged … [in the long term], the roll-out of new engines, led in particular by the Trent XWB, 1000 and 7000, together with a growing aftermarket, is expected to drive significant revenue growth over the coming 10 years as we build toward a 50% plus share of the installed widebody passenger market.”\nThe Group reported free cash inflow in 2016 of £100 million, compared to £179 million in 2015. The Group is targeting its 2017 free cash flow to be similar to 2016. The group’s capital expenditure for 2017 is expected to be approximately £600 million, compared to £626 million in 2016.\nMark Nensel mark.nensel@penton.com",
    "source_domain": "atwonline.com",
    "title": "Rolls-Royce 2016 profits down 45%",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/manufacturers/rolls-royce-2016-profits-down-45"
}