{
    "authors": [
        "Victoria Moores"
    ],
    "date_download": "2017-12-11 18:56:07+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Faircraft-interiors%2Fetihad-introduces-buy-board-refreshments.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/12/snack-box-sweet-low-res.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Under the initiative, announced on Dec. 11, economy class passengers will be able to buy snack boxes.\nAbu Dhabi-based Etihad Airways will continue offering complimentary meals in economy class, but is to add buy-on-board drinks, snacks and amenity kits as the airline continues to experiment with new products.\nUnder the initiative, announced on Dec. 11, economy class passengers will be able to buy snack boxes, champagne ($8) and cold-brew coffee ($4), as well as amenity kits ($22) and sleepwear ($35) on board.\n“Etihad Airways is always looking at new ways to give our guests more power and control over their experience, through options to customize and personalize their journey. In addition to providing extra comfort and choice in the air, some of the items are great gift ideas, particularly in the run up to the holiday season. We will monitor guest satisfaction and aim to expand the range of items for sale in the future,” Etihad Airways VP-guest experience and delivery Linda Celestino said.\nAs part of the product revamp, Etihad recently began offering chauffeur transfers, hand-luggage only fares, paid lounge access, neighbor-free and extra-legroom seats for economy passengers.\nThese initiatives form part of Etihad’s drive to tap digital, increase customer choice and diversify revenues.\nVictoria Moores victoria.moores@penton.com",
    "source_domain": "atwonline.com",
    "title": "Etihad introduces buy-on-board refreshments",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/aircraft-interiors/etihad-introduces-buy-board-refreshments"
}