{
    "authors": [
        "Victoria Moores"
    ],
    "date_download": "2017-12-11 18:55:36+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fmanufacturers%2Frolls-royce-wins-approval-itp-acquisition.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Rolls-Royce has secured the authorizations it needs to acquire the remaining 53.1% of Industria de Turbo Propulsores (ITP) from Spanish engineering and construction firm Sener Grupo de Ingeniería.\nITP is a joint venture between Rolls-Royce (46.9%) and Sener (53.1%), which was created in 1989. The JV supplies turbines for Rolls-Royce’s civil engines and is active on the UltraFan future engine program, which is slated to enter service from 2025.\nUnder a shareholder’s agreement signed in 2003, during a certain period year Sener held a put option which gave it the right—but not the obligation—to sell its shares in ITP to Rolls-Royce at a specified price.\nSener exercised that option in 2016, but the companies have been waiting on Spanish clearance for the deal that has now been secured.\n“Approval from the authorities in Spain paves the way for Rolls-Royce to conclude the acquisition,” Rolls-Royce said.\nRolls-Royce is paying €720 million ($847.3 million) for the 53.1% shareholding, which will be paid in eight installments of cash—or Rolls-Royce shares—over a two-year period following completion.\nCompletion is expected before the end of 2017 and Rolls-Royce has elected to make the first payment in shares. Up to half the purchase price can be settled in shares.\n“The decision on the form of subsequent payments will be determined as each individual payment falls due,” Rolls-Royce said.\nBilbao-headquartered ITP employs over 3,000 people and participates on all of Rolls-Royce’s existing Trent programs through risk and revenue sharing agreements. Its activities include aircraft engine design, research, development and manufacturing, as assembly and testing.\nOutside of Spain, ITP has facilities in India, Malta, Mexico, the UK and the US.\nVictoria Moores victoria.moores@penton.com",
    "source_domain": "atwonline.com",
    "title": "Rolls-Royce wins approval for ITP acquisition",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/manufacturers/rolls-royce-wins-approval-itp-acquisition"
}