{
    "authors": [
        "Polina Montag-Girmes"
    ],
    "date_download": "2018-05-30 23:40:08+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairline-financials%2Faeroflot-group-posts-2-million-net-loss-1q-2018.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/05/aeroflot-boeing-737-800-mxp-rf-5k5a1407.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Aeroflot Group reported a 2018 1Q net loss of RUB11.5 billion ($2 million), nearly doubled from a year-ago period. Revenue for the quarter was RUB111.9 billion, up 8.5% year-over-year (YOY).\nThe results are published according to International Financial Reporting Standards (IFRS).\n“This is the first time that Aeroflot Group has published its consolidated IFRS financial results for the first quarter of the year. This has been made possible by the company’s focus on improving its internal accounting systems with the goal of accelerating the closing of the accounting period and submitting its financial reporting,” Aeroflot deputy CEO for commerce and finance Shamil Kurmashov said. “Publishing 1Q financial results will increase transparency for stakeholders, above all shareholders and investors, and will help them deepen their understanding of the company and its seasonal trends.”\n“The first three months are traditionally weak for the Russian aviation market. This is due to a number of factors, primarily seasonality of demand, as fewer passengers fly during this period,” Kurmashov added.\nIn 1Q Aeroflot Group carried nearly 11 million passengers, up 6.6% YOY. Domestic traffic reached 6.1 million, up 6.5% YOY, international traffic increased 6.8% to 4.9 million. “Yields grew 3.6%, supported by currency effects, and leading to accelerated revenue growth for the quarter relative to annual rates,” the company said in a statement.\nOperating costs, excluding aircraft fuel costs, increased 11% YOY to RUB89.5 billion; fuel costs were up 24.1% YOY to RUB34 billion. Operating lease expenses reached RUB18.5 billion, up 24.3% YOY, because of fleet expansion. The fleet increased 51 aircraft, or 21.1% YOY, on operating leases.\nAeroflot Group includes Moscow Sheremetyevo-based Aeroflot Airline, St. Petersburg-based Rossiya Airlines, LCC Pobeda Airlines, and the Russian Far East-based Aurora Airlines.\nAeroflot announced May 29 Shamil Kurmashov will step down as deputy CEO for commerce and finance to focus on a new area of business. The company is in the process of identifying a candidate to take up this position on a permanent basis.\nPolina Montag-Girmes montag.girmes@gmail.com",
    "source_domain": "atwonline.com",
    "title": "Aeroflot Group posts $2 million net loss in 1Q 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airline-financials/aeroflot-group-posts-2-million-net-loss-1q-2018"
}