{
    "authors": [
        "Mark Nensel"
    ],
    "date_download": "2018-02-03 02:45:14+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairline-traffic%2Fiata-fuel-prices-labor-costs-likely-slow-passenger-growth-2018.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Worldwide passenger traffic grew 7.6% in 2017, outpacing the 10-year average annual growth rate of 5.5%, as passengers responded to an overall improvement in the global economy and lower airfares, according to IATA’s Air Passenger Market Analysis for December 2017, released Feb. 1.\nGlobal passenger capacity was up 6.3% for the full year, producing an 81.4% total market passenger load factor, up 0.9 point from 2016.\nDecember passenger traffic moderated, however, with a 6.2% year-over-year rise in traffic, the slowest growth rate in three months.\nIATA forecast passenger traffic growth in 2018 will continue to be above trend, but will nonetheless be slightly slower than 2017. “This is mainly because increases in airline input costs—fuel prices but also labor costs in certain countries—mean that we are unlikely to see the same degree of demand stimulation from lower airfares in 2018 that we have seen in recent years,” IATA senior economist David Oxley said.\nTraffic growth should continue to be in the 7.5% to 8% region during early 2018, Oxley said.\nInternational passenger traffic grew in all the world regions, led—for the first time since 1994—by Asia-Pacific carriers. Asia-Pacific international traffic was up 9.4% in 2017, driven by strong economic growth in the region as well as increased route options for travelers. Capacity in the region was up 7.9%; the regional load factor increased 1.1 point YOY to 79.6%.\nLatin American carriers saw their fastest growth rate for international travel since 2011, with 9.3% traffic growth in 2017. Capacity in the region grew 8% and the regional load factor grew by one point to 82.1%\nEuropean carriers’ international traffic increased 8.2% during the year, driven by strong economic conditions in the region, IATA said. Capacity rose 61.1%, pushing up load factor by 1.6 points to 84.4%, the highest of all regions.\nAfrican carriers showed a 7.5% increase in international traffic in 2017, as conditions in Nigeria, one of the continent’s largest economies, improved as oil prices rose.\nInternational passenger traffic for North American carriers rose at its fastest rate since 2011, IATA said, increasing 4.8% in 2017, driven by an improved economic picture in the region. The August-September hurricanes, however, slowed the momentum. And inbound international traffic has slowed as well, partly attributable to new US-imposed immigration and security restrictions put into place during the year.\nFor Middle East carriers, international traffic slowed compared to 2016, rising 6.6% in 2017, compared to 11.5% the previous year. The Middle East-North America market segment was particularly hard hit, related to the now-lifted ban on PEDs but also affected by US-proposed travel bans on certain Middle East countries. 2017 was also the first time the Middle East region’s share of the international travel market decreased in 20 years, Oxley said, falling 0.2 point to 9.1%.\nIn domestic traffic, India and China had the strongest results for 2017, rising 17.5% and 13.3% respectively, and driven by economic expansion and additional unique airport pairs being offered in each country.\nRussia had its strongest domestic traffic growth since 2014, rising 10.1%, also attributable, Oxley said, to an improvement in economic conditions seen in the country as oil prices increased, as well as domestic network growth.\nJapan had its strongest domestic traffic growth since 2013, rising 5.8%, driven in part by an improving Japanese economy IATA said.\nNorth American domestic traffic matched the 3.8% five-year average pace in 2017, but was actually down from 2016’s 4.6% growth.\nAnd Brazil returned to positive territory with 3.5% domestic traffic growth in 2017, following a 5.5% drop in 2016. Oxley noted that Brazil’s domestic growth “came in spite of a 4.5% reduction in the number of domestic airport pairs in operation.”\nMark Nensel mark.nensel@informa.com",
    "source_domain": "atwonline.com",
    "title": "IATA: Fuel prices, labor costs likely to slow passenger growth in 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airline-traffic/iata-fuel-prices-labor-costs-likely-slow-passenger-growth-2018"
}