{
    "authors": [
        "Kelsey Atherton"
    ],
    "date_download": "2018-02-03 02:45:25+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fregulation%2Findustry-condemns-video-drone-close-encounter-frontier-aircraft.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/02/drone.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The unmanned aerial vehicle (UAV) industry and hobbyists alike have been quick to condemn an alleged close encounter with commercial airliner. News of the incident emerged after an undated video taken from the UAV, or drone, involved was posted on YouTube.\nThe 27-sec.video clip starts airborne above Las Vegas. How high the drone is flying is not clear, but it appears obviously above the altitude limit set by the FAA as a large white object moves into frame. The camera turns to track the object, which is revealed to be an Airbus in Frontier Airlines livery. The camera pans around as the aircraft passes underneath. It is hard to make out relative distances in the unmarked expanse of sky, but it appears to be uncomfortably close.\nBy all appearances, this is clearly and explicitly an illegal and reckless flight by a drone. The unmanned aircraft is above 400 ft., it is near an airport, and it is above another, manned aircraft—all gross violations of the rules that govern unmanned aviation.\nThe Academy of Model Aeronautics, which represents hobbyist pilots of drones and model airplanes, immediately released a statement: “No one should be flying in a careless and reckless manner and—importantly—all drone and model aircraft pilots must stay well clear of manned aircraft. We condemn the type of operation depicted in this video.”\nOnline, people worked to track down the specific airport—McCarran International—and figure out from flight paths and the low sun in the sky when exactly this happened. Elsewhere within the hobby community, other drone pilots shared the video of the flight, condemning the reckless action of the pilot.\nThe Association of Unmanned Vehicles Systems International, a drone industry group, also released a statement condemning the close call: “All UAS operators need to understand their aircraft, stay well clear of manned aircraft and adhere to the law. AUVSI supports strict enforcement against careless and reckless operators who endanger the safety of the airspace and violate the law.”\nFAA said it is aware of the incident and is investigating.",
    "source_domain": "atwonline.com",
    "title": "Industry condemns video of drone close encounter with Frontier aircraft",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/regulation/industry-condemns-video-drone-close-encounter-frontier-aircraft"
}