{
    "authors": [
        "Kurt Hofmann"
    ],
    "date_download": "2017-10-07 08:34:52+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Feasyjet-set-launch-german-routes-if-airberlin-deal-finalized.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/10/easyjet-a319-ams-rf_0.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "UK-based LCC easyJet plans to launch German domestic flights from Berlin to Stuttgart, Dusseldorf and Munich if a bid to acquire parts of the insolvent airberlin’s short-haul business is finalized.\nAn easyJet supervisory board member told ATW: “It is well known that we submitted an offer for up to 30 airberlin Airbus A320s, which all would be operating mainly from Berlin. If the deal is finalized as planned, easyJet will get a market share in Berlin of 60%,” the source said.\nMeanwhile, airberlin negotiations with the short list of bidders—which include the Lufthansa Group and easyJet—for parts of the insolvent carrier will continue through Oct. 12.\nLufthansa’s bid for airberlin assets is focused on securing the 38 Airbus A319/320s it currently wet leases from the bankrupt airline. The German group is also interested in airberlin subsidiaries LGW, Austria-based NIKI and 13 airberlin Airbus A320s.\nAirberlin filed for insolvency Aug. 15 after 29.2% shareholder Etihad Airways withdrew financial support.\nOver the recent weeks, several other parties submitted proposals for airberlin—Niki Lauda, who was partnering with UK-based Thomas Cook Group and its German leisure airline subsidiary Condor to bid for NIKI and other parts of airberlin; investor groups and entrepreneurs Hans Rudolf Wöhrl and Utz Claassen; and German-based leisure carrier TUIfly, among others.\nA member of airberlin management told ATW the sale of airberlin would end up between Lufthansa and easyJet as “so many people from Lufthansa are involved and working on this project, which is well advanced now.”\nHowever, the European Union Commission must review the deals for compliance with internal market regulations, the source said.\nKurt Hofmann, hofmann.aviation@netway.at",
    "source_domain": "atwonline.com",
    "title": "EasyJet set to launch German routes if airberlin deal is finalized",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/easyjet-set-launch-german-routes-if-airberlin-deal-finalized"
}