{
    "authors": [
        "Mark Nensel"
    ],
    "date_download": "2017-02-15 11:38:49+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fmanufacturers%2Fcfm-international-bookings-25-2016.json",
    "image_url": "http://atwonline.com//sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "CFM International booked orders for 2,677 engines in 2016, a 25.4% increase over 2,135 engines ordered in 2015.\nTotal value for CFM’s 2016 orders neared $36 billion at list prices, a 33.3% rise over 2015.\nIn 2016, CFM reported orders for 1,801 LEAP engines, including commitments and spares, up 28.7% from 1,399 orders of the engine type in 2015. Orders for CFM56 engines from commercial, military and spare parts customers totaled 876, up 19% from 2015.\n“One of the most amazing things we saw [in 2016] was the continued strength of CFM56 orders.” CFM International president and CEO Gaël Méheust said. “We actually received 140 more CFM56 engine orders in 2016 than we had in 2015.”\nThe Ohio-based manufacturer said it produced 1,665 CFM56 engines and 77 LEAP engines in 2016, with the LEAP-1A making its entry into commercial service on an A320neo with Turkey’s Pegasus Airlines in August 2016.\nCFM’s LEAP-1A is an engine option for Airbus A320neo family aircraft; the LEAP-1B is the sole engine behind Boeing’s 737 MAX aircraft; and the LEAP-1C is the sole Western engine for the COMAC C919.\nThe company began transitioning to LEAP engine production in 2016, aiming for full transition by 2020 with an annual production rate of over 2,000 engines. CFM plans to continue building CFM56 spare engines to support the in-service fleet and will produce spare parts for the program until around 2045, the manufacturer said.\nTo date, CFM is reporting more than 12,200 LEAP engine orders and commitments (excluding options), valued at over $170 billion at list prices.\nCFM’s customers in 2016 included AirAsia, Spanish carrier Air Europa, Las Vegas-based Allegiant Airlines, Asiana Airlines, Irish lessor AWAS, China’s CDB Leasing, China Aircraft Leasing Co. (CALC), US-based Delta Air Lines, Malaysia Airlines, China’s Qingdao Airlines, Irish lessor SMBC Aviation Capital, Standard Chartered Bank, TAP Portugal, Indonesian lessor Transportation Partners, VietJet Air and Icelandic budget carrier WOW Air.\nMark Nensel mark.nensel@penton.com",
    "source_domain": "atwonline.com",
    "title": "CFM International bookings up 25% in 2016",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/manufacturers/cfm-international-bookings-25-2016"
}