{
    "authors": [
        "Michael Bruno"
    ],
    "date_download": "2018-04-25 04:27:14+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fife%2Fgogo-names-new-leadership-team.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Inflight connectivity and entertainment provider Gogo continued its leadership overhaul April 20 with several reassignments for top executives.\nThe latest moves come after Gogo on March 5 announced the departure of its then-CEO and appointment of Oakleigh Thorne, then a director who also headed Gogo’s largest shareholder, Thorndale Farm.\nAccording to the latest announcement:\n• John Wade will be the first president of Gogo’s commercial aviation division, a new position;\n• Sergio Aguirre will be president of Gogo’s business aviation division and will continue to be responsible for managing the division;\n• Jon Cobin will become chief strategy officer and executive VP-corporate development, another new position; and\n• Anand Chari, previously chief technology officer, will move into a new role as strategic technology advisor.\n“Gogo has a deep bench of talent and this realigns our leadership structure to accelerate our strategic priorities of driving quality for airlines and passengers and sharpening our operational focus,” Thorne said. “These appointments will help Gogo fully capitalize on John and Sergio’s deep aviation experience while enhancing accountability with end-to-end responsibility for our two critical divisions. We are also confident that Jon's new role will help maximize the value of inflight internet and help us realize our significant long-term growth and value creation opportunities.”\nThe new roles take effect May 1.\nMichael Bruno/Aviation Week michael.bruno@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "Gogo names new leadership team",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/ife/gogo-names-new-leadership-team"
}