{
    "authors": [
        "Linda Blachly"
    ],
    "date_download": "2018-02-03 02:43:28+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fit-distribution%2Fit-distribution-feb-2-2018.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Thai-based NokScoot implemented Hahn Air Systems’ H1-Air product, meaning the carrier will be available for HR-169 ticketing in all major GDSs worldwide under the reservation code H1. Earlier in 2017, the airline signed an HR-169 interline agreement with Hahn Air, making NokScoot available under its own XW code in the Abacus/Sabre, Amadeus and TravelSky GDSs.\nDiscover the World and Cathay Pacific Airways launched their new sales and marketing representation in Ecuador. This marks the 14th country in Latin America where Discover the World represents Cathay Pacific and its regional subsidiary, Cathay Dragon.\nAirbus launched a new iflyA380 iOS app that enhances Airbus’ existing iflyA380.com booking assistant with more choices, features and content and new possibilities to interact with the A380, including taking a sneak peek at the cockpit.\nStar Alliance Round the World (RTW) fares has reduced the minimum number of stopovers from three to two for all RTW fares. This change increases the number of itineraries available under the RTW product for travel on the Star Alliance network.\nIATA recognized IT provider Maureva as a certified provider and deployment partner of Air Austral, for its New Distribution Capability (NDC) initiative.\nChina’s XiamenAir and GE signed an MOU covering several areas, including fleet management support and services, digital solutions, leadership training and aviation health management programs, as well as intra-industrial alignment and cooperation to support the globalization of XiamenAir.",
    "source_domain": "atwonline.com",
    "title": "IT & Distribution-Feb. 2, 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/it-distribution/it-distribution-feb-2-2018"
}