{
    "authors": [
        "Aaron Karp"
    ],
    "date_download": "2017-06-14 22:50:48+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fgovernment-affairs%2Fqatar-airways-ceo-al-baker-asks-icao-step.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/06/qatar-a380-syd-rf.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Qatar Airways CEO Akbar Al Baker has called on ICAO to step in to the diplomatic rift between Qatar and the Gulf states that have closed their airspace to Qatar Airways.\nSaudi Arabia, the United Arab Emirates (UAE), Bahrain and Egypt last week cut diplomatic ties with Qatar, cutting off all flights from Qatar and disallowing Qatar Airways from using their airspace. The move not only halted air traffic between Qatar and the four Gulf states, but also is forcing Qatar Airways to fly longer distances on some long-haul routes to avoid those countries’ airspace.\n“This blockade is unprecedented and it is in direct contradiction to the convention that guarantees rights to civil overflight,” Al Baker said in a June 14 statement. “We call upon the International Civil Aviation Organization to declare this an illegal act. We are not a political body, we are an airline, and this blockade has stripped us of the rights which are guaranteed to us.”\nNevertheless, Al Baker said it is “business as usual” for state-owned Qatar Airways “with the vast majority of flights operating as scheduled.”\nIn the last week, while the restrictions have been in place, Qatar Airways has operated 1,200 flights between Doha and more than 150 destinations “with 90% of those flights departing within 15 minutes of their scheduled departure time,” Qatar Airways said.\nThe airline has said it will focus on expansion to other parts of the world. This week it launched Doha-Dublin service, and it will start flights between Doha and Nice, France July 4. Doha-Skopje, Macedonia flights are scheduled to commence July 17.\nQatar Airways is not shying away from its usual strong presence at the Paris Air Show, where next week its new “QSuite” business-class offering will be showcased.\nAaron Karp aaron.karp@penton.com",
    "source_domain": "atwonline.com",
    "title": "Qatar Airways CEO Al Baker asks ICAO to step in",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/government-affairs/qatar-airways-ceo-al-baker-asks-icao-step"
}