{
    "authors": [
        "Alan Dron"
    ],
    "date_download": "2018-02-03 02:43:24+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Fvilnius-airport-begins-major-terminal-reconstruction.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/02/vilnius-airport.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lithuania’s largest airport at Vilnius is preparing to start a four-year makeover of its terminal building that will double its capacity.\nVilnius Airport, which in summer 2017 closed for 35 days to allow a major reconstruction of its runway, will start to modernize and expand its terminal building this month.\nThe terminal, which opened in 2007, has an annual design throughput of 9,500 passengers a day. In peak summer periods, this number can jump to as many as 15,000.\nIn 2017, the airport exceeded its annual design capacity of 3.5 million by 300,000 passengers. The new work, when completed, will allow the airport to handle 20,000 passengers daily, giving an annual capacity of around 7 million.\n“After the reconstruction, passengers will be provided with a faster and a more convenient customer service as well as an expanded commercial area,” airport director Olaf Martens said. “The refurbished terminal will also provide better working conditions for our employees.”\nThe modernization process will start with the reconstruction of the sterile area, which will be completed by the end of 2018. Reconstruction of the apron and taxiway will be conducted together with the transformation of the airport’s public traffic infrastructure until 2020. Finally, remaking the terminal’s departure area will take place from 2019 to 2021.\nCost of the project is estimated at €60 million ($75 million).\nAlan Dron alandron@adepteditorial.com",
    "source_domain": "atwonline.com",
    "title": "Vilnius Airport begins major terminal reconstruction",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/vilnius-airport-begins-major-terminal-reconstruction"
}