{
    "authors": [
        "Alan Dron"
    ],
    "date_download": "2018-04-25 04:23:41+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Faircraft-interiors%2Foman-air-unveils-new-first-class-cabin-acting-ceo-reportedly-confirmed.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/04/new-first-class-b787-9-oman-air-3.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Oman Air has unveiled a new first-class “mini-suite” on its fleet of Boeing 787s, as it responds to new premium products from other Gulf carriers such as Emirates Airline and Qatar Airways.\nThe Muscat-based carrier made the announcement at the opening of the Arabian Travel Market exhibition in Dubai April 22.\nThe development came as multiple media outlets in the region reported that acting CEO Abdulaziz al-Raisi has been confirmed in the top position.\nAl-Raisi had undertaken the CEO role on an acting basis since the departure in October 2017 of CEO Paul Gregorowitsch.\nThe new first-class suite, like the new Emirates first-class cabin, has high partitions to provide additional privacy to premium customers, although initial photographs suggest the Omani suite’s dividers are lower (55 in.) than the Emirates’ arrangement.\nThe airline said the seat is one of the longest lie-flat accommodation options available on any commercial airliner.\nOther suite features include:\nan electronically controlled privacy divider;\na full-size bed length (with ottoman) of 76 in. to top of headrest, with a bed width of 30 in.;\na dedicated wardrobe and stowage for cabin baggage;\na one-piece large meal table and separate cocktail table;\na chilled in-suite minibar; and\na touch-screen IFE handset; 22-in. video monitor.\nOman Air is undergoing a fleet and network expansion program, which will see the airline operate up to 70 aircraft to around 60 destinations by 2022.\nUntil now, the carrier has heavily relied on government funding, which has ceased. According to Reuters, Al-Raisi, speaking at the Arabian Travel Market, said the carrier could potentially break even “in the next two to three years”—at least three years after the initial target date set by Gregorowitsch.\nAlan Dron alandron@adepteditorial.com",
    "source_domain": "atwonline.com",
    "title": "Oman Air unveils new first-class cabin; acting CEO reportedly confirmed",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/aircraft-interiors/oman-air-unveils-new-first-class-cabin-acting-ceo-reportedly-confirmed"
}