{
    "authors": [
        "Mark Nensel"
    ],
    "date_download": "2017-10-07 08:35:43+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Flabor%2Fendeavor-air-pilots-reach-tentative-agreement-contract-extension.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/10/endeavor-air-crj900.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pilots for Delta Air Lines’ wholly owned subsidiary and regional carrier Endeavor Air, represented by the Air Line Pilots Association (ALPA), has reached a tentative agreement with management on an extension of their existing contract through to Jan. 1, 2024.\nSpecific details of revisions to the contract were not revealed.\nEndeavor pilots will consider the agreement and begin casting votes for its ratification in November, concluding the vote at month’s end.\nEndeavor Air flies for Delta as Delta Connection, operating 136 regional jets on 700 daily flights to 120 cities in the US and nine cities in Canada. Endeavor is based in Minneapolis, Minnesota and maintains hub operations at Hartsfield-Jackson Atlanta International Airport, Detroit Metropolitan Airport, Minneapolis-St. Paul International Airport and New York City, at both New York JFK and La Guardia.\nIn August, Endeavor parent Delta ended its regional flying contract with SkyWest Inc. subsidiary ExpressJet and decided to move 31 Bombardier CRJs to Endeavor Air. The 28 CRJ900s and three CRJ700s will operate from Atlanta as Delta Connection flights. The move will increase Endeavor’s fleet to 154 aircraft by July 2018, beefing up Endeavor’s 76-seat fleet to 112 aircraft while reducing Endeavor’s fleet of 50-seat CRJ-200s from 58 to 42.\nEndeavor has approximately 4,000 employees—42% of which are pilots—and transports over 10 million passengers per year.\nMark Nensel mark.nensel@penton.com",
    "source_domain": "atwonline.com",
    "title": "Endeavor Air pilots reach tentative agreement on contract extension",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/labor/endeavor-air-pilots-reach-tentative-agreement-contract-extension"
}