{
    "authors": [
        "Victoria Moores"
    ],
    "date_download": "2017-06-14 22:49:26+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairframes%2Feasyjet-takes-first-airbus-a320neo.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/06/easyjet-a320neo-vm.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EasyJet CEO Carolyn McCall and her staff take delivery of the airline’s first A320neo.\nUK low-cost carrier (LCC) easyJet has received its first Airbus A320neo, kicking off deliveries from an order for 130 of the re-engined twinjets.\nWith the June 14 handover, easyJet became the 25th A320neo operator. The 186-seat London Luton-based aircraft will enter commercial service June 15 and will be mixed in with the rest of easyJet’s newly reconfigured 186-seat A320 fleet, which tends to serve primary airports, but will not operate any specific routes. EasyJet also operates 180-seat A320s and 156-seat A319s.\n“[This aircraft] opens a new chapter in easyJet’s history, it marks a milestone of our 300th [Airbus] aircraft and will significantly reduce our cost per seat that allows us to offer low fares,” easyJet CEO Carolyn McCall said, speaking at the handover ceremony in Toulouse.\nThe A320neo’s CFM International LEAP 1A engines deliver 15% better fuel efficiency and McCall was quick to stress the significance of this efficiency gain, which she said is “relevant at any fuel price.”\n“When we were talking about the neo to begin with, fuel was higher [priced] than it is today, but fuel is still the largest single cost for an airline and therefore that fuel efficiency is incredibly important for an airline, regardless of the fuel price,” she said.\nThe gains of the neo primarily stem from the type’s engines. “Seven years ago, we committed to bringing to market an engine with 15% better efficiency than the current generation of engines. Seven years later, we did it. We have sold 12,500 LEAP engines. It would not have been a success had we not been selected by easyJet,” CFM International CEO Gaël Méheust said in Toulouse.\nAlongside the efficiency gains, the LEAP-powered neo has a better environmental footprint. Since 2000, easyJet said it has cut its emissions by a third from 116g to fewer than 80g per passenger kilometer and the neo delivery means it is now setting a new goal.\n“With the addition of the A320neo and A321neo, we’ve further planned improvements,” McCall said. “EasyJet is now setting an even tougher carbon emissions target of 72g by 2022. That’s a 10% reduction from today and a 38% improvement from 2000. That target is incredibly important to easyJet and that is what we intend to achieve.”\nAs of March 31, easyJet operated a fleet of 266 Airbus aircraft, comprising 144 A319s and 122 A320s. The LCC has another 27 A320ceos on order, plus 100 A320neos and 30 that it recently converted to 235-seat A321neos for delivery from July 2018.\nOver the last eight years, easyJet has switched its focus from the A319 to the A320. The LCC acquired two A321s when it bought GB Airways, but these were the wrong seat density, so they were phased out.\nEasyJet then increased its A320 density by retrofitting its existing fleet and line fitting them on new arrivals, before opting for the A321neo. “The upgauge is a real advantage for us. We waited on the A321 [order] until the neo,” she said, adding that most of easyJet’s direct rivals have already followed this path and therefore have limited gains to make.\nMcCall said the conversion to larger A321neos is linked with easyJet’s primary airport strategy, to maximize capacity and minimize noise at slot-congested hubs. The A321neos will have similar range to easyJet’s existing fleet, she said.\nEasyJet has unexercised purchase rights on 100 A320neos, which can be converted to A321neos. “We are able to take more A321neos in the future under the 2013 framework agreement we have with Airbus, but we have not committed to more,” McCall said, adding the fleet plan is reviewed on a regular basis and a further update will be given at the airline’s third-quarter results.\nSpeaking at the ceremony, Airbus CEO Tom Enders said the A321neo is a “little delayed,” but the test flights and certification work is ongoing.\nTo date, Airbus has delivered a total of 117 A320neos.\nVictoria Moores victoria.moores@penton.com",
    "source_domain": "atwonline.com",
    "title": "EasyJet takes first Airbus A320neo",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airframes/easyjet-takes-first-airbus-a320neo"
}