{
    "authors": [
        "Victoria Moores"
    ],
    "date_download": "2017-06-14 22:49:36+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Feasyjet-offer-passengers-vip-handling-option-london-luton.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2017/06/easyjet-london-luton.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "UK low-cost carrier easyJet is rolling out a new premium ancillary product, where passengers can board from the private jet terminal at London Luton Airport for a £475 ($604) fee.\nThe VIP service, which is being offered in partnership with executive jet handling company Signature Flight Support, is available with immediate effect. It includes parking outside Signature’s newly opened terminal, use of the amenities and refreshments, private customs, immigration, security screening and transport directly to the aircraft.\nPassengers will be boarded at the same time as “Speedy Boarders.” The charge, which is set by Signature, is £475 for the first passenger and £120 for any additional travelers, although there may be initial promotions to build the service. EasyJet will market the service via its website and “below the line marketing,” receiving a commission from Signature.\nLaunching the service at the Signature terminal June 13, easyJet CEO Carolyn McCall said: “It’s all about ancillary revenues. We are constantly looking for new revenue streams. This is quite innovative for a budget airline and we’ve got to see how this goes. It’s not going to be something huge.\n“This is not about trying to get more upmarket, or to take the space someone else has. It’s a real opportunity for a specific type of passenger—like second home owners and those celebrating a special occasion,” she said.\nWhile easyJet customers might seem an unlikely audience for a premium service, research shows they identify with higher-profile brands and 20% are flying on business. Also, groups are increasingly hiring private jets and this service would work out cheaper, although easyJet plans to stick with its “bread-and-butter ancillaries” like hotels and car insurance.\n“There is a big difference [to a paid lounge]. A lot of passengers don’t want to go through the hassle of the airport experience. This is a particular kind of passenger who wants something completely different and is less price sensitive. The profile of our passengers make a good fit, otherwise Signature wouldn’t do it.”\nSignature has offered a similar service from London Gatwick for the last three to four years, but this is the first time the two companies have joined forces to formalize the offer.\n“Signature ELITE Class has been extremely successful at London Gatwick Airport,” Signature Flight Support Europe, Middle East and Africa division managing director Evie Freeman said. “We look to continue to expand Signature ELITE Class services to additional airports in the future.”\nThere is no exclusivity agreement between easyJet and Signature, but McCall said they are a preferred partner and there are “definitely opportunities” to extend the service to airports like Venice, Milan and Geneva.\nShe added that easyJet is “seriously considering” reserving overhead lockers in the first six or seven rows for Speedy Boarding customers, including those using the Signature service. McCall said easyJet has no plans to package the Signature product with other ancillaries or as part of its Flight Club loyalty scheme for now.\nIn the first quarter of 2018, the airline will roll out a new commercial system, which will make it easier to offer a “whole range” of products, which will be dynamically packages and served to the customer, McCall said.\nLondon Luton Airport is Britain’s busiest executive aviation airport, with three private terminals and around 30,000 arrivals and departures each year—roughly a quarter of all such flights in the UK.\nVictoria Moores victoria.moores@penton.com",
    "source_domain": "atwonline.com",
    "title": "EasyJet to offer passengers VIP handling option at London Luton",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/easyjet-offer-passengers-vip-handling-option-london-luton"
}