{
    "authors": [
        "Kurt Hofmann"
    ],
    "date_download": "2018-02-03 02:44:54+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Femirates-launch-santiago-de-chile-services-july.json",
    "image_url": "http://atwonline.com/site-files/atwonline.com/files/uploads/2018/02/emirates-boeing-777-200lr-rf-img-9974.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Emirates Airline is launching services to Santiago de Chile, the Dubai-based carrier’s fourth South American passenger route, starting July 8.\nThe 5X-weekly service will use a two-class Boeing 777-200LR, which offers 38 business-class seats in a 2-2-2 configuration and 264 seats in economy class.\nThe new service is routed via Sao Paulo-Guarulhos airport (Brazil) and complements an existing daily Airbus A380 flight between Dubai and Sao Paulo. In total, Emirates will operate 12X-weekly services to Sao Paulo.\nEmirates president Tim Clark said the start of the Chile operations “underlines our commitment to South America with our fourth destination on the continent and another five flights to Sao Paulo.”\nEmirates is also adjusting its North American network and will introduce a new nonstop service between Newark Liberty International Airport (New Jersey) and Dubai from June 1, adding to its existing daily flight that will have a stop in Athens (Greece).\nThe new nonstop service will use a Boeing 777-300ER, which offers eight first-class suites, 42 business-class seats and 306 economy-class seats.\nHowever, Emirates will reduce New York JFK services from March 25 to three daily flights—two nonstop flights to Dubai and one via Milan (Italy). Also from March 25, Emirates will add two flights a week each to Fort Lauderdale and Orlando (Florida), effectively returning to daily services at both airports.\nKurt Hofmann hofmann.aviation@netway.at",
    "source_domain": "atwonline.com",
    "title": "Emirates to launch Santiago de Chile services in July",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/emirates-launch-santiago-de-chile-services-july"
}