{
    "authors": [
        "Linda Blachly"
    ],
    "date_download": "2018-04-25 04:24:51+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Fairline-routes-april-23-2018.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Delta Air Lines will launch up to 5X-weekly New York JFK-Lisbon, Portugal Boeing 757 service from Oct. 27; 3X-weekly Los Angeles (LAX)-Paris Charles de Gaulle (CDG) Airbus A330 service and 4X-weekly LAX-Amsterdam A330 service from Oct. 27; and 3-4X-weekly Indianapolis-Paris CDG Boeing 767-300ER service from May 24.\nAdria Airways launched 4X-weekly Hamburg-Ljubljana service.\nRussia’s S7 Airlines will begin 3X-weekly Novosibirsk-Tomsk Embraer E-170 service June 3.\nUral Airlines will launch 2X-weekly Moscow Domodedovo-Qarshi (Uzbekistan) Airbus A320 family service May 2.\nTurkish Airlines will increase Istanbul-Sochi (Russia) Boeing 737-800 frequency from 5X-weekly to daily June 4.\nRussia’s Yakutia Airline will resume weekly Ulan-Ude-Seoul seasonal Sukhoi Superjet 100 service May 29 through Sept. 28.\nNew York-based JetBlue Airways will begin daily Fort Lauderdale-Grand Cayman service from Oct. 25.\nHong Kong Airlines will begin daily Hong Hong-Manila Airbus A320 service from June 1.\nIndia’s Jet Airways and Aeromexico are codesharing on flights between India’s Delhi and Mumbai and Mexico City via London Heathrow Airport. Jet Airways will put its 9W code on flights operated by AeroMexico from London to Mexico’s capital city. In turn, Aeromexico will put its AM code on the direct flights offered by Jet Airways from London to cities in India.\nJetBlue and JetSuiteX announced a first-of-its-kind partnership making JetSuiteX-operated flights available on JetBlue.com with a new codeshare agreement. For travel starting May 1, 2018, JetBlue will place its B6 airline code on JetSuiteX Air-operated flights between West Coast destinations, offering new point-to-point routes for JetBlue customers. This includes flights between Burbank, Calif. (BUR); Concord, Calif. (CCR); Oakland, Calif. (OAK); and Las Vegas (LAS), and marks the first codeshare between a semi-private public charter operator (JetSuiteX) and a major national carrier.",
    "source_domain": "atwonline.com",
    "title": "Airline Routes-April 23, 2018",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/airline-routes-april-23-2018"
}