{
    "authors": [
        "Sean Broderick"
    ],
    "date_download": "2018-04-25 04:25:41+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fatwonline.com%2Fairports-routes%2Fprescott-city-officials-pull-boutique-airlines-endorsement.json",
    "image_url": "http://atwonline.com/sites/all/themes/atwonline/images/logo.png",
    "language": "en",
    "localpath": null,
    "maintext": "Prescott, Arizona city officials have told the US Department of Transportation (DOT) they no longer support a bid from Boutique Airlines to provide short-term air service after US regional Great Lakes Airlines abruptly ceased passenger flight operations March 26. The move came after receiving input from the community.\nIn an April 18 letter to DOT, Prescott mayor Greg Mengarelli said the city rejected all three proposals it received for interim essential air service (EAS), citing “new information.” Prescott Municipal Airport director Robin Sobotta, confirmed to ATW’s sister publication Aviation Daily that public pushback against air service with single-engine aircraft led the city to change its stance.\nPrescott earlier this month said it would back a bid from San Francisco-based Boutique Air to operate Pilatus PC-12s to Los Angeles and Phoenix. Boutique also proposed operating the service with twin-engine Beech King Airs, but the projected subsidy needed to make the service viable was deemed too high, city officials said.\nTwo other bidders, Advance Air and Mokulele Airlines, faced the same challenges. Advance proposed King Airs, while Mokulele proposed single-engine operations.\nPrescott asked DOT for rapid re-bid for interim service, but the turnaround time require could see the process skip directly to finding a long-term EAS provider. Prescott officials are confident that, given enough time to adjust schedules, small Part 121s operators will find the city an attractive addition their networks.\n“Prescott is a growing community,” Mengarelli wrote. “We are confident that our focused efforts will yield a viable long-term air service solution and dramatically increase our passenger traffic in the future.”\nPrescott is part of central Arizona’s Yavapai County, which has a population of about 220,000. The airport’s enplanements totaled about 5,800 in 2017, a 60% increase from 2016.\nGreat Lakes, which shut down all flight operations last month, was contracted to serve Prescott with 30-seat Embraer Brasilias through April 2019.\nSean Broderick, sean.broderick@aviationweek.com",
    "source_domain": "atwonline.com",
    "title": "Prescott city officials pull Boutique Airlines endorsement",
    "title_page": null,
    "title_rss": null,
    "url": "http://atwonline.com/airports-routes/prescott-city-officials-pull-boutique-airlines-endorsement"
}