{
    "authors": [
        "Sabuhi Gard",
        "Helen Nugent",
        "Ruth Sunderland",
        "Philippe Pollet",
        "Hanushka Toni",
        "Iona Bain",
        "Isabel Hardman",
        "Richard Ekins",
        "Graham Gee",
        "Tom Goodenough"
    ],
    "date_download": "2017-10-07 00:29:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "‘We are all going to live longer, so why not invest in it?’­ seems to be the premise of Jim Mellon and Al Chalabi’s new book, Juvenescence – Investing in…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Flife-expectancy-is-on-the-rise-is-that-something-that-can-be-invested-in-and-if-so-how%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/elderly.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=413",
    "language": "en",
    "localpath": null,
    "maintext": "‘We are all going to live longer, so why not invest in it?’­ seems to be the premise of Jim Mellon and Al Chalabi’s new book, Juvenescence – Investing in the Age of Longevity. Mellon and Chalabi forecast that within the next 20 years, the average life expectancy in the developed world will rise to between 110 and 120.\nAs Mellon explains: ‘The increase in life expectancy is due to environmental factors, the rise of universal medical treatment, antibiotics, improved diet. The next step [in science] is going to change the fundamental biology of the human being, by genetic editing, stem cells, pharmaceutical intervention, as well as tissue regeneration.’\nHooray, you might say, but it raises the ethical question: Do we want to live longer? After all, by living longer in the UK, the older generation would be putting more strain on the already over-stretched National Health Service (though who knows – it might not exist in 20 years’ time) and the UK state pension. Between October 2018 and October 2020, both men and women’s state pension age will increase to 66. And between 2026 and 2028, it will rise again to 67.\nIn their book, Mellon and Chalabi discusses all sorts of questions, from whether ageing is actually a disease, to whether it can be slowed, reversed or eliminated. In this extract the authors discuss organ replacement:\nProgress in organ replacement is now taking several forms:\nCryopreservation of organs to allow for a longer time between harvesting and implantation; Improved immune suppression, allowing less specific organ matches to be successfully made; Organs grown in animals, probably in pigs, to be harvested for human use, and without adverse immune reactions. Organs grown from stem cells; Bioprinting of tissues and organs using 3D techniques\nSo how can an investor be part of investing in longevity? Mellon and Chalabi give examples of three types of portfolio you can hold depending on the level of risk you would like to take: Conservative, Moderate or Speculative. All three portfolios comprise of global companies which are transforming and disrupting the diseases of ageing.\nThe co-authors say in the book: ‘From immunotherapies, to “repurposed old drugs”, to gene therapies, to stem cells, to mitochondrial uncouplers, to mTOR pathway inhibitors, to NAD precursors, to resveratrol and more.’\nCompanies mentioned in the Conservative portfolio are: Amgen Inc; Oxford Biomedica plc – a spin out of the University of Oxford, whose pipeline includes treatments for Parkinson’s Disease, cancer, and retinopathy, and Juno Therapeutics Inc, a US-listed immune-oncology company focused primarily on advanced blood cancers.\nMellon says: ‘We [Al Chalabi] did a similar thing in our previous book “Cracking The Code”, and many of those portfolios now have doubled in value.’\nMellon also believes that in the next two to three years, there will be great advances in Artificial Intelligence (AI) with some companies like Novartis AG investing in this area.\n‘I am fundamentally optimistic that people can live longer and have a healthy life span (or healthspan), but the policymakers have to do more to address fundamental changes [associated with a global ageing population],’ he says.\nThe Office of National Statistics (ONS) predicts that by 2035, there will be around 58,000 people living in the UK over the age of 100 – a quadrupling from today’s figure.\nBy 2030, the number of people in the world aged 60 years or over is projected to grow by 56% to 1.4 billion, rising further to over 2 billion by 2050. The number of people aged 80 or over will also grow, reaching 434 million by 2050, in contrast to approximately 125 million today.\nJim Mellon and Al Chalabi are donating the proceeds of this book to longevity charities ‘in order to help science get off the ground’.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Life expectancy is on the rise. Is that something that can be invested in - and if so, how?",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/life-expectancy-is-on-the-rise-is-that-something-that-can-be-invested-in-and-if-so-how/"
}