{
    "authors": [
        "William Cook",
        "Douglas Murray",
        "Philip Sime",
        "Rod Liddle",
        "Ed West",
        "James Forsyth",
        "Jonathan Mirsky",
        "Lionel Shriver",
        "John R. Bradley",
        "Brendan O'Neill"
    ],
    "date_download": "2017-10-06 16:23:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Is there an alternative to the AfD? on Coffee House | The German Embassy threw a lavish party in London’s Belgrave Square last night to toast the…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fis-there-an-alternative-to-the-afd%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/tt.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=730&h=486",
    "language": "en",
    "localpath": null,
    "maintext": "The German Embassy threw a lavish party in London’s Belgrave Square last night to toast the Bundesrepublik’s Day of German Unity, but although the Bier and Sekt flowed freely, and the Ambassador’s Residence was awash with chatter, disunity rather than unity was the main topic of the day.\nGermany’s Tag der Deutschen Einheit marks the Reunification of Germany in 1990, one of those rare events in German history of which all Germans can feel proud. The Embassy’s annual jamboree is always jolly, yet there’s a ghost at every feast. Last year’s Banquo was Brexit. This year, it’s AfD.\nAs German politicians meet in smoke-free rooms to thrash out the formation of the next government (almost certainly a coalition between Angela Merkel’s Christian Democrats, the Free Democrats and the Greens), the question preoccupying German journalists and diplomats is what on earth to do about Alternative für Deutschland, who’ve gone from no seats at all in the last parliament to a whopping 94 this time.\nMerkel’s coalition with the Greens and the Free Democrats will go some way towards neutralising AfD’s influence, leaving the Social Democrats as the official opposition – but whichever way you cut it, there’s no getting round it: Alternative fur Deutschland is now the third biggest party in the Bundestag. On a day when Germans should be celebrating 27 years of unity between East Germans and West Germans, the contrast between voting patterns in the two Germanies is a matter of grave concern.\nAlternative fur Deutschland polled twice as many votes in Eastern Germany as they did in Western Germany, as did Germany’s hard left party, Die Linke. Conversely, the soft-left Social Democrats and Merkel’s centre-right Christian Democrats polled twice as many votes in the West. You don’t need to be a psephologist to work this one out. West Germans still support centrist parties, left or right – East Germans are putting their faith in extremists.\nMost German centrists I’ve spoken to, both left and right, offer a simplistic solution to this problem. They hope and expect that AfD will tear itself apart. Judging by AfD’s recent record in local government, this seems like a fair bet. During the last year, a series of regional elections have propelled AfD into state parliaments throughout Germany where they’ve proceeded – as centrists predicted – to set about squabbling among themselves.\nSo far, AfD’s performance in the national parliament has been true to form. Former leader Frauke Petry shocked supporters after AfD’s election triumph when she quit the party and declared she’d take her seat as an independent. She’s now been charged with perjury. Deputy Leader Alexander Gauland can be relied upon for cringeworthy gaffs at the most inopportune moments, offending a range of public figures of various ethnicities, from integration minister Aydan Özoğuz to international footballer Jerome Boateng. Yet although AfD would struggle to organise a piss-up in a Bavarian Brauhaus, they still managed to attract nearly thirteen percent of the national vote. Even if the party implodes, as centrists are hoping, its disgruntled voters aren’t simply going to shuffle back meekly to the CDU or the SPD.\nTalking to a range of Germans at the German Embassy last night, it was encouraging to find that some observers suggest a more constructive path. AfD must be normalised rather than ostracised, they argue. For German democracy to prosper, it must become a legitimate part of the political process, rather than a cuckoo in the nest. There is an encouraging precedent for this approach – not from the far right, but from the hard left. A decade ago, Die Linke were pariahs – unreconstructed communists, damned by their association with the atrocities of the East German regime. Now, having served in various state governments, they’ve learnt to cooperate with other parties – and have become a respectable party in their own right.\nGerman politicians understand that most AfD voters aren’t racists. They’re mainly small c conservatives worried about immigration, and bewildered by the shifting landscape of modern life. Beyond the big cities, Germany is a very traditional country – old-fashioned by British standards and resistant to rapid change. AfD began as a party of intellectuals – bankers and academics angry about Greek bailouts and the Euro. That it became a populist movement wasn’t just because of Merkel’s million migrants – it was also because she’s repositioned her Christian Democrats as a party of the centre. Unless the CDU leans right on immigration and integration, AfD will continue to prosper, however shambolic it appears.\nFor me, the most telling takeaway from last night’s bash was the political affiliation of the guest list. There were hundreds of Germans here last night – all sophisticated and prosperous. I couldn’t find a single person here who’d admit to voting AfD. In last month’s election, it was one in eight. A generation since reunification, there are still two Germanies, but now the border is between different generations and different expectations – not just between East and West.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Is there an alternative to the AfD?",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/is-there-an-alternative-to-the-afd/"
}