{
    "authors": [
        "Stephen Pollard",
        "Jacob Heilbrunn",
        "Alex Massie",
        "Katy Balls",
        "Tom Goodenough",
        "Douglas Murray",
        "The Spectator",
        "John Hemming",
        "Mary Wakefield",
        "Julie Burchill"
    ],
    "date_download": "2017-08-14 15:59:57+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "When you tweet as often as I do, you learn to take the rough with the smooth. Even though it has led to death threats (dealt with by the police) I…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F08%2Fthis-is-what-happens-when-you-compare-donald-trump-to-jeremy-corbyn%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/08/Trumps-People-copy_SE.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=413",
    "language": "en",
    "localpath": null,
    "maintext": "When you tweet as often as I do, you learn to take the rough with the smooth. Even though it has led to death threats (dealt with by the police) I overwhelmingly enjoy it. I like the immediacy of it and I like the interaction.\nBest of all, I learn from it.\nAnd yesterday I learned something loud and clear. To be accurate, I had something confirmed that I and many others have long thought: that, at least on social media, much of the support for Jeremy Corbyn is akin to a cult, with the Labour leader worshipped as a god-like creature who cannot be criticised.\nYesterday morning, I read President Trump’s statement in reaction to the events in Charlottesville, Virginia, in which he condemned ‘this egregious display of hatred, bigotry and violence on many sides.’\nIt struck me – as it has many others – that in refusing to condemn the white supremacists by name, and equating them with those who were demonstrating against them, he was employing the same form of words, and using the same political wriggle, that Jeremy Corbyn had done in his statement about Venezuela when he said: ‘What I condemn is the violence that has been done by any side, by all sides, in this.’\nThe parallels seemed interesting. In both cases – Charlottesville and Venezuela – there is no grey area. No decent politician should find it difficult to come down on one side in either case. Any politician – any human being – with a shred of humanity and decency should not have to think twice about condemning the behaviour of either the white supremacists in Charlottesville or the Maduro regime in Venezuela. But for President Trump and Jeremy Corbyn, that has indeed proved impossible, each instead blaming respectively ‘many sides’ in Charlottesville and ‘all sides’ in Venezuela.\nAnd so I tweeted this, with a link to a story pointing out President Trump’s equivocation: ‘Read his words: Trump is the mirror image of Corbyn on Venezuela.’\nWe could have a semantic debate about the meaning of ‘mirror image’ but from many of the replies to my tweet, it was clear what I meant: President Trump’s refusal to attach specific blame to the white supremacists in Charlottesville is as bad as Jeremy Corbyn’s refusal to attach specific blame to the Maduro regime in Venezuela.\nFor many of those who replied, this prompted an interesting discussion about the two men’s (very different) ideological roots and political bases, and how they are in thrall to them.\nBut for many, many more (a few hundred), this was evidence of something else altogether – my own moral degeneracy. I was apparently not only showing my support for the fascists but using Donald Trump’s words as a mechanism for attacking Jeremy Corbyn. Because – and I doubt this will surprise you – those many more all had something in common: their avowed support for Jeremy Corbyn. And anyone who criticises Mr Corbyn is by definition ‘scum’.\nMost of the tweets in response to me were the usual insults – par for the course from Corbyn supporters, along the lines of ‘You are a moron’ ‘You fat fascist supporting scum’ and such like. Typically, some seemed to think my religion was behind all this: ‘Tell them any crap at the Shul but don’t pretend it’s news.’\nBut more interesting was the commentary the tweets provided on the intellectual contortions involved in being a Corbynite keyboard-warrior. A series of self-proclaimed lefties couldn’t see the flaw in attacking me for a tweet in which I attacked Trump for not unambiguously condemning fascists.\nTo take a few:\n‘Making that sort of equivalence, between neonazis and those fighting them, is shameful apologism for the former.’\n‘Pollard was severely minimising evil of white supremacism.’\n‘Focus on the fascists in Poland and Hungary and US truly terrifying. Disgusting that you equate Corbyn with the far right.’\n‘I would never have believed that Democratic Socialism was considered more dangerous to the elite than real, actual Fascism, but there it is.’\n‘Are you really that thick to compare what is going on in Venezuela to neo Nazis in Charlottesville? Shameless bullshit from you.’\nAnd my personal favourite:\n‘Shut up, you’re stupidity and utterly pathetic rhetoric belongs back up your backside where poop belongs’ – and this from a tweeter whose biography (under a picture of Jeremy Corbyn) reads: ‘Decency at all times, respect, kindness and truth.’\nI don’t like accusing those with whom I disagree of being stupid. It is rude, and it is rarely true. But in this instance, I struggle to find another explanation for supporters of a supposedly progressive political leader attacking someone for a tweet pointing out that the president of the US had failed properly to condemn white supremacists.\nUnless, as I have suggested, they are simply unthinking – and are, in effect, worshippers in a cult. And if the leader of that cult is attacked, the attacker must be vilified.\nLet’s see what today brings…\nStephen Pollard is editor of the Jewish Chronicle",
    "source_domain": "blogs.spectator.co.uk",
    "title": "This is what happens when you compare Donald Trump to Jeremy Corbyn",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/08/this-is-what-happens-when-you-compare-donald-trump-to-jeremy-corbyn/"
}