{
    "authors": [
        "Ed West",
        "Nick Hilton",
        "Tom Goodenough",
        "Matthew Taylor",
        "Stephen Daisley",
        "Brendan O'Neill",
        "David Butterfield",
        "Jonathan Mirsky",
        "Lionel Shriver",
        "Rod Liddle"
    ],
    "date_download": "2017-10-06 16:23:15+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "I think it’s fair to say that Theresa May did not have a cracking conference, but the sympathy vote might even help her. I certainly felt sorry for the…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fthe-best-way-to-learn-about-socialism-is-to-experience-it%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/GettyImages-856250368.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=413",
    "language": "en",
    "localpath": null,
    "maintext": "I think it’s fair to say that Theresa May did not have a cracking conference, but the sympathy vote might even help her. I certainly felt sorry for the Prime Minister, and instinctively don’t like the nasty playground teasing from the Men of Twitter. (She does have diabetes, too, which can’t help.)\nBut she has to go nonetheless, not because she’s unlucky but because she has a tin ear; why else would she choose to raise such issues as racial discrimination in mental health, sores that can’t be healed but which invariably paint the Tories as the ‘Nasty Party’ – a Ratnerism she coined. Ditto with tuition fees. As for her plan to build more council houses – only an extra 5,000 a year, as it turned out – and dealing with housing inflation with further cash for ‘Help to Buy’, these are woeful non-solutions, when we desperately need Right to Build.\nWhich 4 or 5 things should Britain prioritise? 18-24 yr olds versus pensioners Good luck Britain pic.twitter.com/qT8BXpwNGo — Matthew Goodwin (@GoodwinMJ) October 4, 2017\nHouse-building, along with ‘Our NHS’, is pretty much the only thing the young and old can actually agree on, the youth vote otherwise being a total lost cause for the Tories. Not that homes will be the silver bullet – as long as we have an economy filled with low-skilled temporary jobs then new properties will continue to get taken up by migrants doing skivvy jobs for London’s middle class and young Britons will still find themselves locked out of the sought-after zones 2 and 3 properties their parents and grandparents could afford. But, since the young cannot see the contradiction between their desire for an affordable home and their belief in free movement as a global citizen, there’s little that can be done about that.\nMy instinctive reaction to the Tory youth problem is that maybe we should stop pandering to a demographic whose prefrontal cortex hasn’t fully developed, part of a desperate urge for middle-aged people to gain the plaudits of the young and beautiful. (Rather like those types who tweet about the profound things their 8-year-old has told them about politics, which in no way are just their own opinions parroted back at them, if these conversations did actually take place – which they definitely did. Please: I really, really don’t care what your children think of Donald Trump.)\nThe real question is whether the young will change as they get older. Maybe not. I sometimes feel we’re the equivalent of the last pagan generation of Rome and what we’re witnessing is the start of a new culture entirely, as conservatism among the under-40s is genuinely a dying creed. It’s not that younger people are actively left-wing but that being left-wing (as in progressive, rather than actually socialist) is the default state; in effect it has replaced Christianity as people’s moral anchor.\nThat partly explains why, whatever the Tories ineptly throw in Corbyn’s direction, it just doesn’t stick, because people still believe that Labour’s intentions are good, and in the absence of any strong economic argument to vote Conservative (see Referendum, Brexit) people wish to be virtuous.\nCan anything be done to stop this? I’m not entirely sure. Conservatives certainly missed a trick after the fall of Communism in blackening the name of that ideology in the same way that Fascism was; the wider effect of deNazification was to damage by association the wider conservative hinterland around that strain of pathological nationalism, giving a somewhat toxic air to all forms of social conservatism. The same thing might have happened to socialism had Communism’s crimes become imbedded in the consciousness.\nBut nothing was really done to convey the idea that taking people’s property and freedom in the name of an arbitrary, unworkable goal doesn’t mean you have good intentions, especially when it has been tried a number of times and failed before.\nAnd so young people generally don’t care. They don’t care about Venezuela because it’s too far away, or the 1970s because it was too long ago, and they still hate the Conservatives. So maybe the only way they’ll learn first-hand; maybe in the long term the best thing is that Corbyn does win. I’m obsessed with history but I’m a great believer in the idea that people never learn from it, or at least learn all the wrong lessons; Europe’s entire post-war history has been an attempt to escape communal violence but, like Oedipus running away from Corinth to prevent prophesied disaster, we are only ensuring that it happens.\nThe problem here is not just Brexit, but that Brexit and the economic uncertainty it has brought has exposed how intellectually exhausted conservatism is in Britain; the Tories have simply relied too much on their USP of being the people who can sensibly run the economy, without any real vision of the future, no intellectual hinterland, no heroic narrative to inspire, no confidence in its ideas, and also little interest in using actual empirical arguments to back up its beliefs – all this while faced with a youthful movement filled with passionate intensity. I feel sorry for Mrs May, but a coughing, grey-faced woman in front of a collapsing backdrop just about sums up the state conservatism finds itself in.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "The best way to learn about socialism is to experience it",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/the-best-way-to-learn-about-socialism-is-to-experience-it/"
}