{
    "authors": [
        "Charles Moore",
        "Tom Goodenough",
        "Matthew Taylor",
        "Nick Hilton",
        "James Forsyth",
        "Jonathan Mirsky",
        "Lionel Shriver",
        "Rod Liddle",
        "John R. Bradley",
        "Brendan O'Neill"
    ],
    "date_download": "2017-10-06 16:23:08+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Is Jeremy Corbyn following the Ian Paisley playbook? on Coffee House | By the simple expedients of being cheerful and attacking Jeremy Corbyn, Boris Johnson…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fis-jeremy-corbyn-following-the-ian-paisley-playbook%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/GettyImages-854696290.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=1024&h=683",
    "language": "en",
    "localpath": null,
    "maintext": "By the simple expedients of being cheerful and attacking Jeremy Corbyn, Boris Johnson scored a deserved hit at the Tory conference on Tuesday. It is right not to be shy about questioning Mr Corbyn’s record. But while it is true that Mr Corbyn has never wavered, over 40 years, in his extreme socialist views, it is also worth noting that he has recently changed his tone a lot. It reminds me of how Ian Paisley, without ever recanting his anti-Popery, dropped his noisy and lurid 1970s expressions of it, and adopted a more modern political voice. In his speech in Brighton last week, Mr Corbyn almost completely left out one of his deepest convictions — the need for a return of trade union power. Those who know his mind will find traces of this belief if they look hard, but the public in general and the young in particular will have heard only about more public spending, the re-nationalisation of utilities and railways and higher taxes on the rich. The hard left is always obsessed with hard power, and the unions are their essential tool for capturing the economy. So when Mr Corbyn barely mentions them, his omission is entirely deliberate.\nThis is an extract from Charles Moore’s Notes, which appears in this week’s Spectator",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Is Jeremy Corbyn following the Ian Paisley playbook?",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/is-jeremy-corbyn-following-the-ian-paisley-playbook/"
}