{
    "authors": [
        "Peter Hoskin",
        "Fisun Güner",
        "Claudia Massie",
        "Sam Leith",
        "Tom Goodenough",
        "Philip Collins",
        "Isabel Hardman",
        "Katy Balls",
        "William Cook",
        "Damian Thompson"
    ],
    "date_download": "2017-10-06 16:23:12+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Want to feel like a kid again? Now, if you’re of a certain age, inclination and fortune, you can. Last week, Nintendo launched its SNES Classic Mini, a…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fin-preserving-its-heritage-gaming-is-maturing-as-an-art-form%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/snes_classic_mini_super_famicom_jp-e1507301571429.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=730&h=507",
    "language": "en",
    "localpath": null,
    "maintext": "Want to feel like a kid again? Now, if you’re of a certain age, inclination and fortune, you can. Last week, Nintendo launched its SNES Classic Mini, a modernised and miniaturised version of a console that it first released over 25 years ago. It comes loaded with 20 games from back then, including Super Mario World and The Legend of Zelda: A Link to the Past, and it has gamers palpitating. The SNES Classic Mini sold out a few frantic minutes after it was first made available to order. Anyone who missed out will have to face the merciless price inflation of eBay.\nThis sort of harkening-back is nothing new – last year, for example, Nintendo released a Classic Mini version of an even earlier console – but it is becoming far more prevalent. Some of the oldest names in video gaming, including Atari and Spectrum, have announced their own retro machines. Sega recently published an app that brings its classic games to smartphones. The landscape is strewn with re-releases, vinyl soundtracks, memorabilia, podcasts and websites. It’s starting to look as though gaming’s past could occupy its future.\nFirst, though, the present. Why is this happening now? Part of the answer is, of course, nostalgia – not just among gamers who now have the money to fulfil their childhood dreams, but also among game designers who now have the coding skills.\nSonic Mania, which came out in August, is a case in point. Its main developer, Christian Whitehead, is so infatuated with the titular blue hedgehog that he once received a cease and desist order from Sega for transferring an early 1990s game to his iPhone. These days, Sega is instead asking him to continue and persist. Sonic Mania looks like old, two-dimensional Sonic. It plays like old, hyperkinetic Sonic. It’s so close to the original games that it even contains altered versions of their levels. Fans, such as Whitehead, have been brought into the fold, and allowed to frolic.\nIt’s telling that Whitehead came to the attention of Sega with an iPhone, as technology is another reason for the rise of retro. Years ago, fast technological improvements meant that developers could make games that were ever more detailed and cinematic. Photorealism was the most propulsive ideal in gaming. Then something changed.\nThe technology kept on advancing, but the distances between different console generations – between, say, the PlayStation 3 and the PlayStation 4 – appeared to shorten. At the same time, millions of people gained new gaming devices in their back pockets – smartphones – that were powerful for their size, but not so powerful when compared to other, housebound systems. This created an environment in which photorealism was less important, and where old games could have a second chance.\nAnd they sure are getting it. In July, Square Enix published an excellent, updated version of its ten-year-old game Final Fantasy XII for the PlayStation 4. Much the same has been done, in recent months, for old titles such as Street Fighter II, Crash Bandicoot and Mega Man. These releases have been remastered so that they work with current, high-definition devices. Some have received gameplay refinements so that they are more in line with modern expectations. Yet, fundamentally, they still offer the same experience as they did originally.\nThe cynical view is that, with these remasters, games companies are simply after new money for old product. But is the same said of those who publish old books, plays, films or music? By no longer allowing its history to fade as new consoles are released, gaming is maturing as an art form. The ability to play old games means the ability to appreciate them. Without that, it’s possible that their pixelated graphics and their bleepy-bloopy soundtracks would be dismissed by today’s gamers as an evolutionary step, rather than celebrated as a glorious aesthetic in their own right.\nGaming’s growing confidence in it past could lead to some problems, however. While the quest for photorealism has become less urgent in recent years, it never really stopped, and now it’s making amazing strides into virtual reality. This means that developers may one day have to ask: does the future belong to games that look like games, or to games that look like the world? Is co-existence an option?\nBut those clouds are gathering far beyond the horizon. In the meantime, Sonic keeps on running, Mario keeps on jumping, Link keeps on swinging the Master Sword – and, most importantly, gamers keep on playing happily. Let gladness reign for now.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "In preserving its heritage gaming is maturing as an art form",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/in-preserving-its-heritage-gaming-is-maturing-as-an-art-form/"
}