{
    "authors": [
        "Louise Gray",
        "Charles Moore",
        "Martin Vander Weyer",
        "Camilla Swift",
        "Ed West",
        "Lara Prendergast",
        "Joanna Williams",
        "Tom Goodenough",
        "Philip Collins",
        "Isabel Hardman"
    ],
    "date_download": "2017-10-06 16:23:10+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Can you have your grass-fed beef and eat it? on Coffee House | Grass-fed beef just came off the North London dinner party menu. A report by the Food Climate…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fcan-you-have-your-grass-fed-beef-and-eat-it%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/segrave.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=413",
    "language": "en",
    "localpath": null,
    "maintext": "Grass-fed beef just came off the North London dinner party menu. A report by the Food Climate Research Network at the University of Oxford dismissed claims by Prince Charles and others that grazing animals on permanent pasture can reduce carbon dioxide emissions.\nThe old argument was that the carbon dioxide absorbed by growing grass outweighed the greenhouse gas emissions generated from the stomachs of the cows. But a comprehensive study by FCRN found that this is only the case in a very small number of well-managed farms. In most cases the amount of methane in a cow’s burps far outweighs the carbon stored in the soil through allowing grass to grow.\nDr Tara Garnett, lead author of the study, says that no-one is getting a ‘climate change free lunch’.\n‘Ultimately, if high consuming individuals and countries want to do something positive for the climate, maintaining their current consumption levels but simply switching to grass-fed beef is not a solution,’ she says.\nBut does this mean we should stop eating grass-fed beef altogether?\nLet’s look at the alternatives. Dr Garnett, who is a vegetarian, says eating cheap chicken and pork is not the answer. She points out that the growth of intensive farming is leading to the clearance of forests in other countries to grow feed crops such as GM soy. Instead she talks about eating less meat and by less, I mean a lot less.\nChapter 5 of the report sets out how much meat would be available if animals were only grazed on land that could not be used to grow human food, by-products of agriculture or food waste. The amount of meat available under this ‘livestock on leftovers’ model is about 21g of animal protein per person per day, so a small steak every week. This is much lower than previous estimates by WWF and others, but it is not nothing.\nThen there are all the other benefits of grass-fed beef. Biodiversity tends to be higher on mixed farms where there is livestock as well as arable fields because of the different habitats provided. Lapwings are just one species that benefit from grazed grassland.\nLivelihoods and landscape is also important to consider. In Britain especially remote rural economies rely on farm work and much of the landscape we know and love is maintained to handle livestock.\nThe Sustainable Food Trust argue that these benefits are just part of the picture. Patrick Holden, the Chief Executive, points out that animal manure can be used to fertilise crops, therefore reducing the need for chemicals and improving soils. He says the future of sustainable British agriculture will rely on these kind of mixed farms and if people really want to improve the environment they should be eating more British grass-fed beef, not less.\nIt can be confusing for the consumer attempting to be an ‘ethical carnivore’, never mind someone in North London preparing to host a dinner party for environmentalists. My advice would be stick to vegetarian or vegan Ottolenghi and very occasionally serve up a damn good grass-fed steak.\nLouise Gray is the author of The Ethical Carnivore",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Can you have your grass-fed beef and eat it?",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/can-you-have-your-grass-fed-beef-and-eat-it/"
}