{
    "authors": [
        "Nick Hilton",
        "Ed Cumming",
        "Stephen Pollard",
        "Tom Goodenough",
        "Jacob Heilbrunn",
        "Lucy Vickery",
        "The Spectator",
        "Francis Spufford",
        "James Delingpole",
        "Martin Vander Weyer"
    ],
    "date_download": "2017-08-14 16:00:02+00:00",
    "date_modify": null,
    "date_publish": "2017-08-05 00:00:00",
    "description": "If he takes a break from the 24-hour feed of Fox News and switches over to HBO in time to join his country in the millennial kumbaya that is Game of…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F08%2Fdaenerys-targaryen-has-become-the-donald-trump-of-game-of-thrones%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/08/05_07_GameOFThrones_S07.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=413",
    "language": "en",
    "localpath": null,
    "maintext": "If he takes a break from the 24-hour feed of Fox News and switches over to HBO in time to join his country in the millennial kumbaya that is Game of Thrones, Donald Trump might find himself gazing into the uncanny valley. Daenerys Targaryen is a striking doppelgänger: same initials, same preternaturally bright hair, same reliance on ‘fire and fury’. If Trump becomes a full-on Thronie, it’s surely only a matter of time before the White House’s conveyor belt for officials includes a demand to bend the knee in the Oval Office.\nWe open the latest episode of Game of Thrones – ‘Eastwatch’ – by witnessing the fallout from the last episode’s vicious, and catchily monikered, Loot Train Attack. Daenerys is offering a stark choice to the survivors: bend the knee or be immolated by her pet dragon. There has been a rippling undercurrent of concern so far this series, predominantly from her Hand, Tyrion, about whether the bloodthirsty Targaryen gene is starting to dominate the Queen. We see it here in full technicolor: Tyrion urges Daenerys not to destroy House Tarly, and yet she does, because even her smartest advisors need to know that, like a grown man on Twitter at 3am, she’s in charge.\nWhilst Daenerys’s behaviour is troubling her closest allies, Jon Snow is continuing on his single-minded quest to defend the living, breathing world from the undead horde who are, quite literally, at the gate. At the end of the episode we get a Magnificent Seven moment as Jon, Jorah, Tormund, Gendry, Beric Dondarrion, Thoros of Myr and The Hound all head north of the wall, from Eastwatch, on a bizarrely King Kong inflected quest to bring a zombie to King’s Landing. With further hints that Jon is the true Targaryen heir abounding in this episode, he must now be the frontrunner to sit on the Iron Throne at the series’ close. The most obvious alternative to that, however, is an alliance with the Mother of Dragons – presumably involving a wedding (preferably of no specific colour), given the lusty looks they’ve been shooting one another – in which he might iron out her tendency towards capital punishment (although he did once hang a child…).\nCersei, meanwhile, achieves nothing in a military or political sense, but has, once again, been knocked up by her brother. Congratulations. She also seems, to an extent, to bury the hatchet with Tyrion (and not in his skull) as she realises that a bigger opportunity to secure the Lannister dynasty has presented itself, so long as she can stay alive long enough. Almost all seasons before have built towards a climactic war in Westeros, but this season, rather aptly in the current climate, seems to be heading towards multi-party treaty negotiations. It might not be the battle of Blackwater Bay or the Bastards, but it will be a compelling resolution to a season that is setting up the final battle between ice and fire.\nWinterfell seems to be the last vestige of classic Game of Thrones on the current board. Arya and Sansa are squabbling, whilst Sansa mulls over her own claim to power. Bran is busy staring at trees (frankly he is more tolerable as a raven than as a human) whilst Arya and Littlefinger engage in a bizarre cat-and-mouse sequence, which ultimately shows that House Baelish is still the wildcard player in the Game. He is gambling on Sansa to take him all the way to the Red Keep, and even though it feels inconsequential compared to dragons and the walking dead, it may well come back to haunt the Targaryen/Snow alliance.\nBut if we are to continue rooting for the Dragon Queen, she must show a little more humanity. She has a collection of unorthodox allies, some of the show’s best characters, but she must keep their trust and respect. ‘Dracarys’, her command for Drogon to breathe fire, has become the Westeros equivalent of ‘You’re fired!’. Unlike White House press secretaries, however, talented military advisors don’t grow on trees: she must avoid the traps her father, the Mad King, fell into. ‘Eastwatch’ is the new season of Game of Thrones’ most elegant, well-paced episode, and it shows how an unfancied outsider can become a confident, charismatic and controversial leader once they have their finger on the nuclear, or more draconic, option.\nGame of Thrones airs on Sky Atlantic at 2am on Mondays and then again at 9pm.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Daenerys Targaryen has become the Donald Trump of Game of Thrones",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/08/daenerys-targaryen-has-become-the-donald-trump-of-game-of-thrones/"
}