{
    "authors": [
        "Katy Balls",
        "Sebastian Payne",
        "Martin Vander Weyer",
        "Tom Goodenough",
        "Douglas Murray",
        "Stephen Pollard",
        "The Spectator",
        "Jacob Heilbrunn",
        "John Hemming",
        "Mary Wakefield"
    ],
    "date_download": "2017-08-14 21:41:02+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "There are many ways to dampen down speculation surrounding one’s leadership ambitions. However, writing an article headlined ‘I do not plan to be PM, but…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F08%2Fwhy-you-shouldnt-bet-on-a-rees-mogg-premiership-just-yet%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2015/06/Jacob.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=412",
    "language": "en",
    "localpath": null,
    "maintext": "There are many ways to dampen down speculation surrounding one’s leadership ambitions. However, writing an article headlined ‘I do not plan to be PM, but here is how the Tories could lead better’ isn’t one of them. This is what Jacob Rees-Mogg did this morning for the Telegraph, thereby pouring petrol on reports over the weekend that he is ‘sounding out’ friends and considering throwing his hat into the ring to be the next leader.\nWhile one Tory MP, Heidi Allen, has already broken rank to say she would leave the party if Rees-Mogg were to become leader, many activists will hope the reports prove to be true. The Moggster – as he has come to be known – has developed a cult following, with Tory activists deeming him to be the Conservative answer to Corbyn. In a sign that the Old Etonian’s traditional conservative values – no to gay marriage, yes to spending cuts – have a place in modern times, he has more than 40,000 followers on Instagram and 29,000 likes on Facebook.\nBut before anyone gets too carried away, there are a few things to note (not least that it’s August). Even if Rees-Mogg were to aim for No 10, a Conservative leadership contest would work against such a rogue candidate. Unlike in the Labour party, a candidate must survive several rounds of votes by MPs. Plus, when Theresa May does go, the vacancy won’t just be for leader, it will be for Prime Minister. It follows that someone with Cabinet experience is a safer bet. In truth, it’s likely that Rees-Mogg is aware of his limitations. But he – like his colleagues – will also know that leadership talk can increase the chance of getting a plum government role when the time comes.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Why you shouldn’t bet on a Rees-Mogg premiership just yet",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/08/why-you-shouldnt-bet-on-a-rees-mogg-premiership-just-yet/"
}