{
    "authors": [
        "Tony Lodge",
        "Alex Massie",
        "John Longworth",
        "Tom Goodenough",
        "Matthew Parris",
        "Jonathan Mirsky",
        "Lionel Shriver",
        "Rod Liddle",
        "John R. Bradley",
        "Brendan O'Neill"
    ],
    "date_download": "2017-10-06 16:23:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Why the Tories must smash the railopolies on Coffee House | Britain’s railways provide a striking example of how a half-baked privatisation goes wrong. The…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fwhy-the-tories-must-smash-the-railopolies%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/08/train-commute.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=414",
    "language": "en",
    "localpath": null,
    "maintext": "Britain’s railways provide a striking example of how a half-baked privatisation goes wrong. The Centre for Policy Studies today introduces a new word to the political and economic lexicon: Railopoly; noun, the exclusive possession or control of train services by a single company (public or private) which faces no competition or threat of. The private train monopolies which have been allowed to replace the old nationalised British Rail have become entrenched in the safe knowledge that ministers will not object and regulators will keep preventing competition. But how and why? Quite apart from allowing bad policies, can’t Conservatives realise that preserving the current unsatisfactory system gives credibility to Jeremy Corbyn’s plans to renationalise?\nOn the 25th anniversary of the Tory White Paper which led to privatization, the sector has largely become a collection of Whitehall-sponsored railopolies. Ministers hide behind shiny new trains and a good safety record but ultimately preside over a railway network where passengers have barely any choice, enjoy no fare competition, increasingly face overcrowding and suffer from growing union militancy. It could and should be so much better.\nAllowing these monopolies contradicts the most basic pledges set out by John Major in 1992. The foreword to his White Paper, New Opportunities for the Railways, pledged to extend the benefits of private sector management, skill and entrepreneurial spirit to the railways to deliver ‘more competition, greater efficiency and a wider choice of services more closely tailored to what customers want’.\nUnfortunately, Conservatives have largely abandoned more on–track competition and choice. This is in part down to the dogged belief by mandarins, with presumed acquiescence from their political masters, that the only way of squeezing more money out of train franchises is to promise that they won’t face competition. In effect this means promising a lengthy monopoly regardless of the impact on passengers and the regions. It is not helped by the regular churn of ministers (four different rail ministers in the past six years) and the free hand civil servants at the Department for Transport have been allowed for far too long. Older rail executives now talk of there being more Whitehall micromanagement today than in the heyday of state control.\nA hard truth was pithily explained in an article for The Times last month by the former CEO of the East Coast franchise, Michael Holden. ‘Whenever fares go up or there is a disruption it is a common mistake to blame privatisation. Yet the railways are not privatised, certainly not in a way that compares with energy, telecoms or aviation.’ Holden here does us a service by making it clear that although train companies may compete when they bid to win a franchise, most can rightly assume, given present policies, that they will face no competition, unlike aviation or telecoms. Consequently the system encourages and delivers a private railopoly to run the trains for years.\nIronically, it was the Blair Government which agreed to some genuine if small scale on-track rail competition, known as ‘open access’, in the noughties. It has worked. Tonight, at London King’s Cross, passengers can reap the benefits as they choose from one of three intercity companies to reach Yorkshire and the North East. New statistics show they each enjoy the highest UK rail passenger satisfaction ratings – all above 90 per cent – and lead on value for money, timekeeping, reliability and getting a seat compared with all other train firms. Astonishingly, this model, where the Whitehall-chosen franchise competes directly on the same track with two private companies has not been encouraged elsewhere. Passengers out of London Paddington, Waterloo, Victoria, Euston, Liverpool Street and across the great cities of the west country and the north west deserve to enjoy the same benefits as those along the east coast. Importantly this line has seen consistent growth and fares have risen much less than elsewhere on the network.\nNo more choice is delivered whether monopolies are private or public. But private ones have been defended by Tories and consciously allowed to grow despite legislation originally designed to deliver competition. Both increase the role of the state as the ultimate manager, regulator and arbiter. Ministers have either been told, or worryingly genuinely believe, that this situation is manageable, acceptable and right. It leads to a culture of inaction where the very concept of upholding and strengthening sector liberalisation is parked.\nA key problem is that though there has been some progress from this halfway house supporters of renationalisation can point to a longer list of perceived failings. It is these which secure the headlines and send ministers running for the hills. Friends of Claire Perry, the previous rail minister who resigned last year, told the Daily Telegraph, ‘she was fed up with justifying how crap our railways are’. In truth fare rises have been low compared with the old nationalised British Rail, new trains are being delivered and more people are travelling by rail than at any time since the 1920s on a network half the size. But so long as privatisation remains incomplete and passengers do not see and feel a better deal then there can be no real political progress.\nTories must be seen to deliver new and consumer friendly policies alongside remaking the case for free markets with appropriate regulation. The Prime Minister’s speech to the Tory conference offers some hope with her pledge to ‘take on monopolies’ and ‘reform free markets when they don’t work’ – the railways present a great opportunity. Ministers should pledge to deliver real passenger choice, make the railopolies face tough competition and win back the policy agenda from the left. Otherwise Corbyn’s drive for nationalisation will win even more supporters, most of whom don’t remember the failures and managed decline of British Rail.\nTony Lodge is Research Fellow at the Centre for Policy Studies",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Why the Tories must smash the railopolies",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/why-the-tories-must-smash-the-railopolies/"
}