{
    "authors": [
        "Tom Goodenough",
        "Douglas Murray",
        "The Spectator",
        "John Hemming",
        "Mary Wakefield",
        "Julie Burchill",
        "Jacob Heilbrunn",
        "Richard Ekins",
        "Rod Liddle",
        "James Delingpole"
    ],
    "date_download": "2017-08-14 09:15:55+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "What the papers say: The dangers of a rushed Brexit on Coffee House | Theresa May is back from holiday and the Brexit work continues in earnest. Over the…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F08%2Fwhat-the-papers-say-the-dangers-of-a-rushed-brexit%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/08/GettyImages-818729678.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=1024&h=757",
    "language": "en",
    "localpath": null,
    "maintext": "Theresa May is back from holiday and the Brexit work continues in earnest. Over the next few days, two key papers – spelling out detail on the customs union and the Irish border – will be published. There’s no doubt, says the Times, that this ‘is a crucial week for Brexit’. ‘After more than a year of disagreement and drift’, there are now some ‘encouraging signs’ that things are slowly being put in order: the joint article written by Philip Hammond and Liam Fox and which was published yesterday advocating a transition period, is one such sign. The publication of reports ‘to flesh out the banal slogans’ touted so frequently so far, will also help matters, suggests the Times. Yet the paper is also worried the process may now be happening too quickly. With ‘too much time wasted’, the need for clarity is vital; yet, rushing things is ‘foolish’. It’s clear that ‘not enough time’ has been given over to dealing with the Brexit process. The big ‘danger’ of being too quick in preparation now is that poorly thought through papers could have ‘to be altered or scrapped half way though the bargaining in Brussels if they prove unfeasible’. Given that Theresa May is already no stranger to making a U-turn, ‘this could have as dire consequences for the Brexit negotiating team as it had for Conservative Party credibility’.\nThe Guardian meanwhile aims its criticism at Donald Trump, saying the President’s failure to directly condemn white nationalists following the violence in Virginia could show that ‘America may be on the road to perdition’. ‘There is absolutely no moral equivalence’, argues the paper, between the white nationalists and those on the other side ‘who demonstrated peacefully against them’. Yet despite the death of a protester clearly being brought about by an act of terrorism, the Guardian says Trump ‘utterly failed in his primary duty to uphold equality and speak the truth’. The key role of the head of state in situations like these is to ‘stand up’. But ‘Mr Trump was found wanting,’ the Guardian concludes.\nDonald Trump’s words also come in for criticism in the FT. The paper argues that the President’s denouncing of violence ‘on many sides ‘drew ‘a moral equivalence between the counter-protesters and the armed white supremacists’. Some have said Trump’s words are a ‘dog whistle’ to his ‘target audience’, But for the FT this gives ‘the president and his team more credit than they deserve’. Instead, ‘the statement had the subtlety of a billy club’, says the paper, which agrees with the Guardian that one of the president’s key duties – to ‘provide moral leadership’ – isn’t being fulfilled with Trump in the White House.\nThe Sun meanwhile opts for a lighter subject: Jeremy Hunt’s £44,000 taxpayer-funded toilet, which the Health Secretary has had installed in his office. ‘It’s especially galling’ given the savings being imposed on the NHS, which is ‘trying to save £22billion by 2020’, says the paper. It is ’dead wrong’, says the Sun, for Hunt to be given such a privilege. On the back of ‘years of talking about the need for cuts’, one thing is now clear: ‘Mr Hunt…looks a right hypocrite’",
    "source_domain": "blogs.spectator.co.uk",
    "title": "What the papers say: The dangers of a rushed Brexit",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/08/what-the-papers-say-the-dangers-of-a-rushed-brexit/"
}