{
    "authors": [
        "Camilla Swift",
        "Helen Nugent",
        "John Fitzsimons",
        "Rebecca O'Connor",
        "Tom Bill",
        "Laura Whitcombe",
        "Stephen Pollard",
        "Tom Goodenough",
        "Jacob Heilbrunn",
        "Lucy Vickery"
    ],
    "date_download": "2017-08-14 16:00:00+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "Driving in central London is a minefield at the best of times. What with the confusion of the congestion charge zone, one-way streets at every turn…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F08%2Fhow-one-london-junction-is-raking-in-fines-of-200000-per-day%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/08/traffic-london.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=414",
    "language": "en",
    "localpath": null,
    "maintext": "Driving in central London is a minefield at the best of times. What with the confusion of the congestion charge zone, one-way streets at every turn, cyclists all over the place and it being nigh-on impossible to park, it’s a wonder that anyone even tries to drive in London. Perhaps this is all a tactic by the Mayor to put off drivers from coming in to the capital. It does seem like a pretty good tactic, to be fair.\nThe latest gripe is about one particular junction in Bank, from which cars are banned, and only buses and bikes are allowed to drive through. However, the rules were only changed last year, in a bid to reduce the number of accidents in that particular area. It’s not the change of rules that’s upset people, though. What is causing an issue is that the fact that since 7 June, the City of London has been issuing Penalty Charge Notices at a cost of £130 to motorists travelling through the junction, which is policed by seven separate cameras. In the first month, from 7 June to 14 July, these cameras captured an average of 1,500 cars passing though the junction each day. That means that, according to figures released by the City of London in response to a Freedom of Information Act request, this one junction is raking in fines of over £16,000 an hour; almost £200,000 per day. Is this all really in the name of ‘safety’, then – or is it a clever ploy by the council to bring in some extra dosh?\nA few years ago, a similar story was causing a stir, about a ‘box junction’ with yellow hashed lines in Fulham, which generated £2.7million in fines in just one year for Hammersmith and Fulham Council. That junction was only serving an average of 111 fines per day though – and even that caused a rumpus. I suppose the crux of the matter is whether this is a safety issue, as the City of London suggests, or a money-making scheme which others, including the Tory MP Charlie Elphicke, suggest.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "How one London junction is raking in fines of £200,000 per day",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/08/how-one-london-junction-is-raking-in-fines-of-200000-per-day/"
}