{
    "authors": [
        "William Cook",
        "The Spectator",
        "James Forsyth",
        "Emily Hill",
        "Matthew Lynn",
        "Bryan Appleyard",
        "Alexander Chancellor",
        "Brendan O'Neill",
        "Rose Asani",
        "Ed West"
    ],
    "date_download": "2017-01-02 15:54:34+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 10:11:25",
    "description": null,
    "filename": "http%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F01%2Fgermany-wont-break-rules-britains-sake%2F.json",
    "image_url": "http://blogs.spectator.co.uk/files/2017/01/l.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Back in the summer of 2015, a year before the Brexit vote, I was summoned to the German Embassy in London for a special briefing by a senior member of Germany’s Social Democrats. The man from the SPD didn’t mince his words: David Cameron might secure a few small concessions in his forthcoming renegotiation with the EU, but it was inconceivable that he could obtain any significant changes in Britain’s relationship with Europe. For Germany, free movement of people within the European Union was sacrosanct – and even if Deutschland had been willing to change the rules for Britain’s sake, any major alteration would need to be ratified by all the other member states. That process would take years, not months. There simply wasn’t time. Cameron had raised British expectations to an unrealistic level, and any Briton hoping for a brand new deal was bound to be disappointed. The man from the SPD was right. The rest is history. A year later, Britain voted out.\nThis was an important story, but at the time it didn’t get much traction. Why not? Because it didn’t suit the needs of either side in the great Brexit debate. Neither Europhiles nor Europhobes wanted to talk down Cameron’s chances. Remainers didn’t want to spread doom and gloom about the intransigence of our EU allies. Leavers preferred to keep their powder dry, so they could give Dave both barrels when he returned from Europe virtually empty handed. So both sides kept shtum, and the public were left with a vastly inflated notion of what Berlin might be prepared to do to keep Britain sweet.\nEighteen months on much has changed, yet the situation is strangely similar. A new Prime Minister is about to embark on yet another renegotiation with the EU, and even though this time the negotiation is about exit terms, rather than the terms which might have persuaded the UK to stay, British expectations remain just as unrealistic as they were under David Cameron.\nPoliticians will always try to spin a story whichever way it suits them (the man from the SPD was trying to dampen British expectations, to bolster Cameron’s Remain campaign) but civil servants have no particular axe to grind, and since Britain voted out I’ve spoken to various German civil servants about the view from Berlin. Everyone I talk to tells me the same story. They’re bemused and bewildered by the implacable British belief (held by both Leavers and Remainers) that Germany will be willing to make major concessions to the UK, so they can carry on selling us tariff-free cars or fridges or whatever. The rules are the same for everyone. There will be no exceptions. As one German official told me, bluntly, ‘it’s black and white.’\nThe British are a pragmatic breed, always keen to find new interpretations of old rules, even if it means bending those rules close to breaking point. The Germans aren’t like that. Through the chaos of the last century, in a land with no natural borders that’s so often been a battlefield, rules were all they had. It’s what makes Germany such an efficient and exasperating place. ‘Alles muss in ordnung sein’ (everything must remain in order) is a mantra that permeates every area of public life. It isn’t just a preference for keeping things neat and tidy. It’s about making sure everything is planned and organised, right down to the smallest detail. It means doing everything by the book.\nWhen Russia invaded Crimea, Angela Merkel decided to impose sanctions. German businesses stood to lose billions. They lobbied the German government, but Merkel remained implacable. The sanctions stood. For Crimea, read Brexit. A hard Brexit will hurt German exports, but that doesn’t make a soft Brexit any more likely. Like David Cameron before her, the best that Theresa May can expect from Germany is a few marginal concessions, and the sooner her government comes clean about this, the better it’ll be for all concerned.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Germany won't break the rules for Britain's sake",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.spectator.co.uk/2017/01/germany-wont-break-rules-britains-sake/"
}