{
    "authors": [
        "Ross Clark",
        "The Spectator",
        "James Forsyth",
        "Emily Hill",
        "Matthew Lynn",
        "Bryan Appleyard",
        "Alexander Chancellor",
        "Brendan O'Neill",
        "Rose Asani",
        "Ed West"
    ],
    "date_download": "2017-01-02 15:54:37+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 12:25:06",
    "description": null,
    "filename": "http%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F01%2Fgarden-villages-good-idea-lets-get-bulldozers-rolling%2F.json",
    "image_url": "http://blogs.spectator.co.uk/files/2017/01/o.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "There are few terms in the English language as irritating as ‘eco-village’ – which is really just ‘housing estate’ dressed up to sound more acceptable to Nimbys. Nevertheless, today’s announcement of 14 such ‘garden villages’ should be welcomed. Concentrating new homes in purpose-built new towns, villages and suburbs, where services and infrastructure are built as part of the development, upsets people who live nearby but ultimately it is the least painful way of accommodating the new homes which are so desperately needed.\nAnd this time, please, can we please get the bulldozers rolling. For years, George Osborne used to talk about new towns. But while they got stuck in the pipeline, something quite different happened: the government loosened the planning system so that developers – at least those with good lobbying skills, if not actual corruption — can cherry-pick sites wherever they fancy. The result has been little developments of executive homes springing up along country lanes which can’t cope with the traffic. In one case where I live, permission was recently granted for a housing estate of 80 park homes along a single-track road – in spite of the drainage authority warning that the drains can’t cope. This is how schools and surgeries get overloaded and streets get flooded – when new homes are dumped in the countryside without any extra infrastructure or services to support them.\nThe only way we are going to civilise housing development is by building homes in conjunction with infrastructure. We need to be building new homes in places where new roads, schools, drains, surgeries, shops and all the rest form part of the development. We need, in short, new towns along the lines of those built post-war.\nTrouble is, there never seems to be enough money to build the required infrastructure, which is why Osborne’s new towns and villages kept failing. But there could quite easily be enough money if only the government returned to the practice of the post-war new towns: and compulsorily-purchased the land required for new homes, at agricultural value. An acre of agricultural land in the south of England costs around £10,000. Give it planning permission for new homes and it is suddenly worth £1 million or more. At the moment that uplift in value is pocketed by the lucky owner of the land who has managed to persuade – by fair means or foul – a bunch of planning officers and councillors to grant it permission.\nYet if that uplift in value was instead to be taken by development corporations who were obliged to spend it on infrastructure, we would have ample roads, schools, surgeries and all the rest. If they could buy land at agricultural value, grant it planning permission and then sell plots to private developers, the rate of house-building could be speeded up enormously.\nThere is just one hurdle to overcome: the ‘landbanking’ lobby – companies which exist to speculate on development land. They, of course, rather enjoy the present system for the huge windfall profits it creates. The planning system depresses the value of land generally, but then pumps up the value of development plots. It effectively transfers wealth from landowners generally to the lucky few who know how to play the system.\nThat is no free market, and so no-one should object to what I have proposed as an interference in the free market. True, compulsory-purchase is a form of state confiscation and so offends some people. But without it we would have no coherent system of roads, railways and other infrastructure. There is no reason why these powers should not be used to ease the housing crisis, too.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Garden villages are a good idea. Let's get the bulldozers rolling",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.spectator.co.uk/2017/01/garden-villages-good-idea-lets-get-bulldozers-rolling/"
}