{
    "authors": [
        "Damian Thompson",
        "Tom Goodenough",
        "Philip Collins",
        "Isabel Hardman",
        "Katy Balls",
        "William Cook",
        "Ed West",
        "Charles Moore",
        "James Kirkup",
        "David Green"
    ],
    "date_download": "2017-10-06 16:22:56+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Our guest on today’s Holy Smoke podcast is A.N. Wilson, author of a hugely admired biography of Queen Victoria and – as you’ll hear – the most mischievous…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fthe-protestant-passions-of-queen-victoria-her-biographer-a-n-wilson-reveals-all%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/Queen_Victoria_by_Bassano-1.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=414",
    "language": "en",
    "localpath": null,
    "maintext": "Our guest on today’s Holy Smoke podcast is A.N. Wilson, author of a hugely admired biography of Queen Victoria and – as you’ll hear – the most mischievous intellectual in the land.\nCristina Odone and I started out by asking about Victoria’s vigorous (and possibly whisky-fuelled) persecution of Anglo-Catholics in the Church of England: the Queen lobbied hard for the legislation that sent several of them to jail for popish “ritualism”.\nBut that was the just the beginning of Wilson’s hilarious whistlestop tour of the passions and prejudices of Queen Victoria. Topics discussed: Victoria’s surprising liberalism (and indulgence towards actual Roman Catholics), the quasi-Victorian moralising of virtue-signalling students, the gentle but unswerving Protestantism of our own monarch…\nAnd, right at the end, A.N. Wilson’s thoughts on the syncretistic horrors of the coronation service Prince Charles is planning – and the even ghastlier ceremony that would replace it should he die before succeeding his mother.\nIn other words: you can’t miss this podcast. Here it is:\nAnd don’t forget to subscribe on iTunes for more like this.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "The Protestant passions of Queen Victoria: her biographer A.N. Wilson reveals all",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/the-protestant-passions-of-queen-victoria-her-biographer-a-n-wilson-reveals-all/"
}