{
    "authors": [
        "Tony Diver",
        "Jack May",
        "Ella Whelan",
        "Tom Slater",
        "Dan Hitchens",
        "Douglas Murray",
        "Stephen Pollard",
        "The Spectator",
        "Jacob Heilbrunn",
        "John Hemming"
    ],
    "date_download": "2017-08-14 21:41:00+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The NUS’s latest stunt is leaving students worse off on Coffee House | The National Union of Students isn’t good for much beyond the occasional discount…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F08%2Fthe-nuss-latest-wheeze-is-leaving-students-worse-off%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/08/ste0.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=620&h=413",
    "language": "en",
    "localpath": null,
    "maintext": "The National Union of Students isn’t good for much beyond the occasional discount voucher which it sends to its members. But its latest campaign still proved a big hit. The NUS called on its members to boycott the National Student Survey, suggesting that it could be used to justify higher fees if universities scored highly. Students need little encouragement not to do something; unsurprisingly, the plan worked. Last week, it emerged that a dozen universities didn’t get enough responses for their surveys to be deemed valid. Top universities – including Cambridge, Oxford, UCL and Bristol – were among those affected.\nThe NUS is busy claiming success. Yet this characteristically petty protest has actually left students – and applicants – worse off. Rather than engaging the government on their policy, the NUS simply tried to obstruct the survey – and the Teaching Education Framework, of which it was a part. In doing so, the NUS may have thwarted the government’s plan but it has done its members a disservice by silencing the voices of students.\nFor all the bluster about the survey being a tool of the evil Tory government, it’s worth remembering that it was actually meant as a way of helping students. Studying at university doesn’t come cheap. And for those forking out a fortune in fees, the survey offers a valuable indication of what students really think of their institutions. Where league tables are often based on graduate research programmes, the NSS answers a more straightforward question: do graduates think their time at university was worth it? For those heading off to university next month, knowing that someone else thought their own hard work – and tuition fees – was a worthwhile investment, is crucial.\nWhat’s more, unlike in-house surveys conducted by the universities themselves, the National Student Survey is harder to spin – offering a fair comparison across the country. Where teaching, pastoral care or administrative support is poor, the NSS gives students a stick with which to beat their university for wasting their cash. When the results come in, it gives universities a reason to listen, to plan and to improve.\nSo while the NUS’s activists are pleased, the real effect of this campaign has been to rob applicants of information and censor students. The role of student activism should be the opposite: to create free, open debate and hold failing institutions to account. If only our union bosses, propelled to power by widespread apathy, could do that, perhaps students might care more.\nTony Diver is a final-year History and Politics student at Christ Church, Oxford.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "The NUS’s latest stunt is leaving students worse off",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/08/the-nuss-latest-wheeze-is-leaving-students-worse-off/"
}