{
    "authors": [
        "Philip Leiser",
        "Sabuhi Gard",
        "Hanushka Toni",
        "Ian Stewart",
        "Camilla Swift",
        "Spectator Money",
        "Isabel Hardman",
        "Richard Ekins",
        "Graham Gee",
        "Tom Goodenough"
    ],
    "date_download": "2017-10-07 07:15:03+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Why you should invest in founder-owned businesses on Coffee House | Should it make a difference to investors if a company is owned by its founder? You might…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fwhy-you-should-invest-in-founder-owned-businesses%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/GettyImages-492444264.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=730&h=486",
    "language": "en",
    "localpath": null,
    "maintext": "Should it make a difference to investors if a company is owned by its founder? You might argue that a founder-owner would have a deeper interest in the long-term success of his or her corporate creation. Or perhaps having the owner hanging around the management board would inhibit risk taking. But here’s the strange thing: as far as I’ve been able to establish, no studies have ever been done asking if founder (as distinct from family) ownership is a factor in the share performance of various companies. So my colleague Viktoria Lyttkens and I spent six months looking into it – and the results are quite remarkable.\nWe examined 347 companies listed in Stockholm, where we both live, and studied their performance from 2002 to 2010 – a period that takes in good times and bad. And the conclusion: the shares of the companies that were at least 10 per cent owned by the founder performed on average eight per cent better per year than the rest of the companies. That is an over-performance that makes a huge difference in the long run. Even when adjusted for industry affiliation and for the proportion of small companies and value companies, our findings remain true and are statistically significant.\nSo why should this be? It’s hard to say for sure, but we have a few suggestions.\nA founder is usually keen on the survival and prosperity of the company in the long run. He often treats the company as his baby and wants it to do well, so younger generations of his family will one day be able to take over. A founder generally knows the company to a depth unrivalled by other owners. He is also likely to have a deep knowledge of the industry and probably have a lot of personal contacts within the business. These things are likely to be beneficial when finding suitable board members, a CEO and other people in key positions in the company. Another thing that probably can’t be under estimated is the founder’s ability to serve as a transmitter of culture. Besides this, a founder that is a major owner of a listed company is often likely to have a big portion of his own wealth invested in the firm: a good incentive to really endeavor. So, the founder probably has the experience, motivation, long-sightedness and drive to create value more than less devoted owners like institutions.\nThis raises a fascinating prospect. If the same theme holds true in UK and US companies, then identifying those that are at least 10 percent founder-owned might be an effective and cheap way of beating the market. Indeed, Warren Buffett seems to have been using partly a similar formula.\nHis holding company Berkshire Hathaway owns listed equities as well as mainly wholly owned subsidiaries. These subsidiaries make up a large part of Berkshire’s net asset value. These companies have often been acquired from the founder who passes on ownership but continues to work for the company they founded. In this way, Berkshire Hathaway has been the owner of many subsidiaries which have benefited from having their dedicated founders still being involved. That is possibly one reason for Berkshire’s long-term success.\nSo is this a formula that can be adopted by individual investors? Certainly: just identify some new companies, establish who the founder is and see if he or she owns 10 percent. It won’t be a magic bullet – nothing in investment ever is – but it could well be a factor to consider.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Why you should invest in founder-owned businesses",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/why-you-should-invest-in-founder-owned-businesses/"
}