{
    "authors": [
        "Isabel Hardman",
        "James Forsyth",
        "Jonathan Mirsky",
        "Lionel Shriver",
        "John R. Bradley",
        "Rod Liddle",
        "Deborah Ross",
        "Brendan O'Neill",
        "Will Heaven",
        "Matthew Parris"
    ],
    "date_download": "2017-10-07 00:28:58+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Grant Shapps isn’t the most popular man in the Tory party at the moment, but at least he has a friend to keep him company this evening. By sheer…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fandrew-mitchell-to-speak-at-plotter-grant-shapps-dinner-tonight%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2013/06/andrew-mitchell.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=600&h=400",
    "language": "en",
    "localpath": null,
    "maintext": "Grant Shapps isn’t the most popular man in the Tory party at the moment, but at least he has a friend to keep him company this evening. By sheer coincidence, Andrew Mitchell has long been booked to speak at the Welwyn Hatfield MP’s Conservative Association annual dinner tonight.\nBut Mitchell is very keen not to appear to be a fellow plotter, having given a speech at the Cambridge Union last night in which he praised the Prime Minister’s ‘courage of high order’ for completing ‘what was an important and interesting speech in impossible circumstances, and I think all of us in politics should recognise that’.\nSpeaking to Coffee House, Mitchell said: ‘By coincidence I agreed six months ago to do Grant Shapps’ Conservative Association dinner tonight. I will tell them there is no denying we are in a bit of a hole at the moment, but that the way out is for the government to focus on three key points: to deliver the best possible Brexit, address the issue of intergenerational fairness, and fight again the battles which we thought we had finished fighting on the virtues of free enterprise which we thought we had finished fighting when Mrs T was on the throne.’\nOh, to be a fly on the wall when members are allowed to ask questions after the speech.",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Andrew Mitchell to speak at plotter Grant Shapps’ dinner tonight",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/andrew-mitchell-to-speak-at-plotter-grant-shapps-dinner-tonight/"
}