{
    "authors": [
        "Richard Ekins",
        "Graham Gee",
        "Katy Balls",
        "The Spectator",
        "Matthew Lynn",
        "Jonathan Mirsky",
        "John R. Bradley",
        "Deborah Ross",
        "Rod Liddle",
        "Isabel Hardman"
    ],
    "date_download": "2017-10-07 07:15:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-05 00:00:00",
    "description": "The Supreme Court is changing.  Three new Justices are taking office, including Lady Black, who is only the second woman to serve on the UK’s highest…",
    "filename": "https%3A%2F%2Fblogs.spectator.co.uk%2F2017%2F10%2Fwill-the-uks-new-senior-judge-change-the-supreme-court%2F.json",
    "image_url": "https://spectatorblogs.imgix.net/wp-content/blogs.dir/11/files/2017/10/5.jpg?auto=compress,enhance,format&crop=faces,entropy,edges&fit=crop&w=730&h=486",
    "language": "en",
    "localpath": null,
    "maintext": "The Supreme Court is changing. Three new Justices are taking office, including Lady Black, who is only the second woman to serve on the UK’s highest court. The first, Lady Hale, was this week officially sworn in as President of the Supreme Court, making her the UK’s most senior judge. Lady Hale was appointed a member of the Appellate Committee of the House of Lords – then the UK’s top court – in January 2004, which became the Supreme Court in October 2009. She is by any measure not only an extremely experienced judge, but also a legal trailblazer. What will her appointment as President mean for the law?\nOne should not overstate the importance of her new office. The President may be the UK’s most senior judge but is responsible for a court of only twelve judges (contrast the leadership role of the Lord Chief Justice) and the President’s main duty is to determine the size and composition of the panels that hear appeals. The Court usually sits in panels of five, but sometimes seven or nine Justices will sit in the most important cases. Exceptionally, all the Justices sat in Miller (the Article 50 case). It will be for Lady Hale to decide how often the Supreme Court sits in larger panels.\nLady Hale’s tenure as President will be short: she must retire no later than early 2020. However, she will leave her mark on the future composition of the Court itself. At least three vacancies will arise during her tenure – Lord Mance, Lord Hughes and Lord Sumption are all due to retire in 2018 – and the President chairs the commission that recommends candidates for appointment as a Justice. The judges who sit on this commission tend to enjoy a decisive say on who is recommended for appointment. As a staunch supporter of judicial diversity, Lady Hale is likely to press for some (or all) of those three vacancies to be filled by non-traditional candidates (i.e. not by white men).\nPerhaps the most important power that the President enjoys is that of the bully pulpit. A well-timed intervention by the Court’s President can guarantee press headlines, as shown by Lord Neuberger’s summer warning that judges needed clarity about how UK law would develop after Brexit. Lady Hale has a reputation for being outspoken. She has gone further in some extra-curial speeches than is prudent, most notably when last autumn she broke the ‘golden rule’ that judges do not discuss individual cases by commenting publicly in Malaysia about the Article 50 litigation which was then heading for the Supreme Court. Lady Hale subsequently expressed surprise that a speech in Malaysia had caused such a stir back in the UK. Given the frenzy surrounding the Article 50 litigation, this was a striking instance of political naivety from such an experienced judge. It will be interesting to see whether Lady Hale tempers her remarks in her new role.\nLady Hale’s long judicial service means that her outlook is no mystery. Philosophical differences amongst our judges matter and Lady Hale clearly adopts a relatively expansive view of judicial power. She is an enthusiast for the judicial role that the Human Rights Act introduced, sees the courts as pivotal in protecting minorities from (legislative) majorities, and is not as willing as other judges to defer to other institutions or to hew so closely to settled law.\nIn Jackson, the 2005 challenge to the Hunting Act, Lady Hale was one of a handful of judges to speculate about whether judges might in future be able to impose limits on parliamentary sovereignty. In Yemshaw, a case about homelessness, Lady Hale led a quasi-unanimous court in radically re-interpreting the Housing Act, introducing a new approach to statutory interpretation that invites judges to depart from what they know Parliament originally intended. In Doogan, the Glasgow midwives case, Lady Hale led her colleagues in interpreting legislation in such a way as to undercut the Abortion Act’s protections for conscience, while avoiding questions about the human rights of conscientious objectors.\nIn Nicklinson, the challenge to the Suicide Act, Lady Hale was willing to go even further than the European Court of Human Rights in demanding that Parliament decriminalise assisted suicide. She was one of only two judges (of nine) willing then and there to declare the Suicide Act incompatible with human rights, even though the matter had clearly not been the subject of proper argument before the Court. Litigation challenging the Suicide Act is before the High Court now and will almost certainly make its way back to the Supreme Court soon.\nLady Hale is not always the most radical member of the court. In Evans, the case about disclosure of the Prince of Wales’s letters to ministers, she joined Lord Mance, now Deputy President, in misconceiving the statutory scheme Parliament enacted in the Freedom of Information Act. This led Lady Hale to wrongly order the release of the letters, thereby quashing the Attorney General’s exercise of his statutory power to block disclosure. But she resisted the then President, Lord Neuberger, who sought effectively to rewrite the legislation so as to remove the power altogether. Still, Lady Hale, usually joined by Lord Kerr of Tonaghmore (former Lord Chief Justice of Northern Ireland), often opts for more adventurous adjudication. In Tigere, they quashed government policy of limiting student loans on the basis of immigration status, giving short shrift to arguments about the importance of that status and showing themselves willing to extend a right to education well beyond the right recognised by the European Court of Human Rights.\nIt is only in some cases that these differences in judicial philosophy loom large. But those cases matter, not only because of their direct public importance but also because they frame future litigation and adjudication. Lady Hale is not a maverick. Her approach to the law, especially to constitutional law, is shared by many lawyers, scholars, and some judges, in the UK and elsewhere. In becoming President of the Supreme Court, Lady Hale takes up an important public office, which she will discharge conscientiously and with good humour. The office will amplify the voice she gives to a well-known approach to judicial power, one that we think highly problematic. However, it remains the case that Lady Hale, like every other Supreme Court Justice, has only one vote. Her appointment will not itself transform the Court. The future of the Court will turn instead on how many of her colleagues, on any particular panel and at large, share the same philosophy and how closely the public and elected representatives follow the exercise of the Court’s jurisdiction and stand ready, when occasion calls, to address its misuse.\nRichard Ekins is Fellow of St John’s College, Oxford and Head of Policy Exchange’s Judicial Power Project. Graham Gee is a member of Policy Exchange’s Judicial Power Project and a fellow at the University of Sheffield",
    "source_domain": "blogs.spectator.co.uk",
    "title": "Will the UK’s new senior judge change the Supreme Court?",
    "title_page": null,
    "title_rss": null,
    "url": "https://blogs.spectator.co.uk/2017/10/will-the-uks-new-senior-judge-change-the-supreme-court/"
}