[
  {
    "article_id": "b2b3391b2efdf0721a35d9f6c7bb592e",
    "title": "소비자협의회, 아이스크림 가격 '소비자 기만'…원유값 상승의 4배",
    "link": "https://sports.hankooki.com/news/articleView.html?idxno=6843878",
    "keywords": null,
    "creator": [
      "임현지 기자"
    ],
    "video_url": null,
    "description": "[스포츠한국 임현지 기자] 10월 들어 아이스크림 가격이 인상된 것과 관련해 소비자단체가 “인상 요인이 타당하지 않다”며 가격을 내려야 한다고 주장했다.한국소비자단체협의회 물가감시센터는 그동안 원유가격 상승을 요인으로 가격을 올린 아이스크림 제조사들이 원유를 사용하지 않는 제품까지 함께 인상했다고 30일 밝혔다.협의회에 따르면 이달 들어 롯데웰푸드가 아이스크림 제품을 최대 25% 인상했고, 빙그레는 6일 자로 ‘메로나’를 17.2% 인상했다. 앞서 이들 회사는 지난 2월에도 10~25% 가량 가격을 올린 바 있다.제조사들이 밝힌 가",
    "content": "[스포츠한국 임현지 기자] 10월 들어 아이스크림 가격이 인상된 것과 관련해 소비자단체가 “인상 요인이 타당하지 않다”며 가격을 내려야 한다고 주장했다. 한국소비자단체협의회 물가감시센터는 그동안 원유가격 상승을 요인으로 가격을 올린 아이스크림 제조사들이 원유를 사용하지 않는 제품까지 함께 인상했다고 30일 밝혔다. 협의회에 따르면 이달 들어 롯데웰푸드가 아이스크림 제품을 최대 25% 인상했고, 빙그레는 6일 자로 ‘메로나’를 17.2% 인상했다. 앞서 이들 회사는 지난 2월에도 10~25% 가량 가격을 올린 바 있다. 제조사들이 밝힌 가격 조정 요인은 바로 원유가격이다. 국내 원유 1L 가격은 지난해 1월 947원이었고 같은 해 10월에 999원으로 5.5% 인상됐다. 그러나 올해 1월은 996원으로 0.3% 인하됐으며, 이달 1084원으로 8.8% 인상됐다. 5~8%대 인상폭을 기록한 원유가격 대비, 아이스크림 가격은 최대 네 배 이상 오른 셈이다. 그러나 가격이 인상된 아이스크림 중 국내산 원유를 원재료로 하는 제품은 ‘빙그레 투게더 바닐라맛’ 하나뿐이었다. 롯데웰푸드의 '월드콘XQ'는 외국산 혼합분유를, 메로나는 수입산 혼합탈지분유를 사용하고 있었다. 그러나 수입산 탈지·전지분유 지난달 기준 가격 역시 전년 평균보다 미국산 분유는 25.3%, EU산은 2.4% 하락했다. 협의회 관계자는 “올해 2차례나 가격 인상을 실시한 아이스크림 업체들이 내세우는 원유가 인상에 의한 가격 인상이라는 주장은 맞지 않다”며 “원유를 사용하지 않는 아이스크림에 대해서도 가격 인상을 단행해, 소비자를 기만하고 소비자의 부담을 심화시켰다고 추측할 수밖에 없다”고 지적했다. 이어 “빙과업체들에게 원유 가격 상승폭보다 과도하게 아이스크림 가격을 인상한 결정을 철회하고 오히려 가격을 인하할 것을 요구한다”며 “올해 1월부터 시행되는 용도별 차등가격제로 원가를 낮출 수 있는 요인이 발생했으므로 관련 부처에서는 시장 내 유가공 제품 가격이 안정화될 수 있도록 관리해야 할 것”이라고 덧붙였다.",
    "pubDate": "2023-10-30 06:12:58",
    "image_url": null,
    "source_id": "sports_hankooki",
    "source_priority": 486721,
    "country": [
      "south korea"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "43b992c97e107d2c7beb348752d52ac0",
    "title": "PL Stock Report: Dr. Reddy's Laboratories (DRRD IN) - Q2FY24 Result Update – In line EBITDA aided by gRevlimid and PLI incentives - REDUCE",
    "link": "https://www.thehansindia.com/business/pl-stock-report-dr-reddys-laboratories-drrd-in-q2fy24-result-update-in-line-ebitda-aided-by-grevlimid-and-pli-incentives-reduce-833418",
    "keywords": [
      "Business"
    ],
    "creator": [
      "The Hans India"
    ],
    "video_url": null,
    "description": "Dr. Reddy's Laboratories (DRRD IN) - Param Desai - Research Analyst, Prabhudas Lilladher Pvt Ltd.",
    "content": "Prabhudas Lilladher Pvt Ltd Dr. Reddy's Laboratories (DRRD IN) - Param Desai - Research Analyst, Prabhudas Lilladher Pvt Ltd. Rating: REDUCE | CMP: Rs5,397 | TP: Rs5,300 Q2FY24 Result Update – In line EBITDA aided by gRevlimid and PLI incentives Quick Pointers: § Margins came in at 26.6%; down 270 bps QoQ adjusted for PLI incentives. § India formulation grew in high single digit, adj for divestment and NLEM. We increase our FY24/25E EPS estimates by 13.5%/7.6% aided by higher gRevlimid sales, however base business profitability continues to remain moderate. Dr. Reddy’s (DRRD) Q2FY24 EBITDA was largely in-line with our estimate, while base business margins ex of Revlimid and PLI incentives continued to remain muted below ~19-20%. Further thin US pipeline in near term remains a key risk. At CMP, DRRD is trading at expensive valuations of 24x P/E on FY25E adjusted for gRevlimid. We maintain our ‘Reduce’ rating with revised TP of Rs5,300/share (Rs5,150 earlier) as we roll forward; valuing at 23x Sept 2025E EPS for base business. Any big ticket ANDA approvals and sharp recovery in base business margins are key risks to our call. § Revenue growth aided by US generics: DRRD’s sales grew by 9% YoY at Rs 69bn; largely in-line with our estimate. The growth momentum continued, mainly by gRevlimid sales. US revenue came in at $384mn ($389mn in Q1FY24) vs our est of $380mn. Domestic business adjusted for divestment and NLEM price impact grew in high single digit. PSAI sales grew by 9% YoY. EU increased 26% YoY, while Russia sales declined by 2% YoY. § EBIDTA adjusted for PLI incentives came lower than est: DRRD reported EBIDTA at Rs 20bn; Adj for PLI incentives; EBITDA came in at Rs18.3bn; down 7% QoQ. Ex Revlimid and PLI incentives, we believe EBITDA came in at Rs9-10bn. Adj OPM for PLI incentives came in at 26.6% down 270bps QoQ, we est 29%. Segment wise PSAI margins were at 17.8% (15% in Q1FY24) and generic margins were at 63.6% (63.9% in Q1FY24). § Key concall takeaways: (1) US business: Filed 2 and launched 4 ANDAs in US during quarter. Guided for 25-30 new launches in FY24. The price erosion in this quarter was in single digits. Q2FY24 sales was aided by market share expansion in core portfolio and integration of Mayne acquisition. On gNuvaring market share should ramp up in coming quarters (2) Biosimilars: Overall 20-25% of R&D spend is towards biosimilar. Expect first wave of launch from FY27. Filed for Rituximab and may launch in FY25 (3) Domestic business: Mgt expects to beat the IPM growth going ahead. Chronic therapies contribute 35% of the India business. Will be partnering with innovators and have closed 10 such licensing deals with focus areas like Cardiovascular, Diabetic, CNS, and Oncology (4) Europe: Base volumes and growth from injectables and tender wins supported performance. Launched 20 products (5) Russia business declined YoY due to currency devaluation. The YoY growth in CIS and EM sales was on account of price increases. (6) PSAI: Growth was largely due to new launches. Profitability to improve as volume picks up. (7) Company expects growth to accelerate in China as approvals are picking up (8) Tax rate likely to be in range of 24-25% (9) PLI incentives to be higher for FY24. H1FY24 reported Rs2.3bn of incentives from PLI booked as reduction from COGS. (Click on the Link for Detailed Report) Show Full Article",
    "pubDate": "2023-10-30 05:03:01",
    "image_url": null,
    "source_id": "thehansindia",
    "source_priority": 58957,
    "country": [
      "india"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "3ff68d10edc3e7c96166eb06b33342df",
    "title": "이스타항공, 29일 인천발 후쿠오카·나트랑 노선 운항 개시",
    "link": "https://sports.hankooki.com/news/articleView.html?idxno=6843867",
    "keywords": null,
    "creator": [
      "홍성완 기자"
    ],
    "video_url": null,
    "description": "[스포츠한국 홍성완 기자] 이스타항공이 지난 29일부터 인천발 후쿠오카와 나트랑 노선 운항을 시작했다고 30일 밝혔다.인천-후쿠오카 노선의 첫 편은 ZE641편으로 188명의 승객을 태우고 오전 10시20분 인천을 출발해 오전 11시13분 일본 후쿠오카공항에 도착했다. 이스타항공의 인천-후쿠오카 노선은 매일 오전편과 오후편으로 하루 2왕복 운항한다.29일 저녁 9시10분에는 인천-나트랑 노선의 첫 편(ZE561)이 인천공항에서 나트랑 깜라인공항으로 출발했다. 인천-나트랑 노선은 11월19일까지 수, 목, 토, 일 주 4회 운항하고",
    "content": "[스포츠한국 홍성완 기자] 이스타항공이 지난 29일부터 인천발 후쿠오카와 나트랑 노선 운항을 시작했다고 30일 밝혔다. 인천-후쿠오카 노선의 첫 편은 ZE641편으로 188명의 승객을 태우고 오전 10시20분 인천을 출발해 오전 11시13분 일본 후쿠오카공항에 도착했다. 이스타항공의 인천-후쿠오카 노선은 매일 오전편과 오후편으로 하루 2왕복 운항한다. 29일 저녁 9시10분에는 인천-나트랑 노선의 첫 편(ZE561)이 인천공항에서 나트랑 깜라인공항으로 출발했다. 인천-나트랑 노선은 11월19일까지 수, 목, 토, 일 주 4회 운항하고 11월20일부터 증편해 매일 운항하게 된다. 후쿠오카와 나트랑은 일본과 베트남의 대표적인 관광지로 아름다운 자연경관과 관광 인프라가 잘 갖춰진 인기 노선이다. 이스타항공은 첫 운항을 기념해 후쿠오카와 나트랑을 오가는 전편에서 승무원과 함께하는 기내 이벤트를 진행했다. 이스타항공 관계자는 “운항거리가 긴 인천발 국제선에 차세대 신기종인 B737-8 기재를 집중 투입하고 있다”며 “B737-8 기재는 연료 효율이 좋을 뿐 아니라 엔진 소음이 적고 경량 좌석과 스카이 인테리어로 쾌적한 실내 공간을 제공해 승객들의 여정의 편의를 더할 수 있다”고 말했다.",
    "pubDate": "2023-10-30 04:58:56",
    "image_url": null,
    "source_id": "sports_hankooki",
    "source_priority": 486721,
    "country": [
      "south korea"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "879eedf5bdc28421c0d4525b0a7c50cc",
    "title": "Crypto Week Ahead: Bitcoin Continues To Ride 'Uptober' Highs As Spot ETF Continues To Woo Investors",
    "link": "https://news.abplive.com/business/crypto/crypto-week-ahead-october-30-november-4-bitcoin-spot-etf-zodia-gemini-1639172",
    "keywords": [
      "Cryptocurrency"
    ],
    "creator": [
      "Shayak Majumder"
    ],
    "video_url": null,
    "description": "Bitcoin (BTC), the oldest and most valued crypto in the world, comfortably managed to remain above the $34,000 mark as ‘Uptober’ draws to an end. The steady rally could largely be attributed to the positive market sentiment around Bitcoin Spot ETFs, as more and more companies are looking to jump onto the boom wagon. Of course, the US Securities and Exchange Commission’s (SEC) decision to not challenge the Grayscale ETF application last week has lent a positive push to the prices, which continue to show dividends at the time of writing. As always, It remains to be seen how long the latest rally can sustain itself.  Before we proceed further, readers should note that the overall crypto market and coin prices are extremely volatile in nature. There are no foolproof methods to ascertain how cryptocurrencies are expected to behave in the future. This article is aimed at helping investors stay on top of the current market scenarios and the biggest events that have already taken place as well as some upcoming occurrences that are worth noting. Investors are advised to do their own research before taking any call.  Crypto Prices Over The Past Week Last Monday (October 23), the overall crypto market cap stood at $1.16 trillion. BTC price stood at around $30,700, ETH price stood at around $1,700. A week later, the overall market cap jumped to $1.26 trillion. Check Out Top Crypto Prices Today   DeFi's total volume stands at $2.68 billion, at 9.85 percent of the total market 24-hour volume. In the case of stablecoins, the overall volume stands at $23.77 billion, at 87.32 percent of the total 24-hour market volume. As per CoinMarketCap, the overall market fear and greed index stood at ‘Greed’ with 72 points (out of 100) — seeing a significant boost in investors’ confidence when compared to last Monday. BTC dominance, at the time of writing, stood at 52.97 percent. Over the past seven days, Bitcoin achieved a high of $34,911.49 (on October 25) and a low of $30,500.93 (October 23). Ethereum, on the other hand, saw a high of $1,852.53 (October 26) and a low of $1,665.73 (October 23). Crypto Events To Note In recent developments within the cryptocurrency investment space, ProShares Bitcoin Strategy ETF and VanEck Bitcoin Trust have made significant strides. The ProShares Bitcoin Strategy ETF, introduced to the market in October 2021, is designed to generate returns mirroring those of Bitcoin by engaging in Bitcoin futures contracts. Notably, the Fund does not make direct investments in bitcoin itself. As of the latest data, the ETF has displayed an impressive 80 per cent year-to-date increase in performance, but it's worth noting that it has also seen a 36 per cent decline since its inception. On October 27, VanEck took a significant step by submitting a preliminary prospectus for the VanEck Bitcoin Trust, an exchange-traded fund (ETF). This ETF is structured with the primary goal of replicating bitcoin's performance, less operating expenses, by directly holding bitcoin. According to information provided in the preliminary prospectus, the custody of all Bitcoin holdings on behalf of the Trust will be entrusted to Gemini Trust Company LLC. These developments reflect the ongoing evolution and diversification of investment options in the cryptocurrency market, as investors seek new ways to gain exposure to digital assets while managing associated risks. In a recent cryptocurrency market update, CoinDesk reported that Bitcoin (BTC) has exhibited a notable surge in its bullish momentum. Over a week, BTC witnessed a remarkable gain of over 14 per cent, ultimately stabilising at approximately $33,700. This surge followed Bitcoin's recent attainment of its annual peak at $35,000, albeit falling short of breaking through that crucial price level. It is worth noting that Bitcoin's performance closely mirrors the 14 per cent increase recorded in the CoinDesk Market Index (CMI). Furthermore, the cryptocurrency market displayed notable strength in the CoinDesk Computing Sector (CPU), which is an index designed to monitor protocols dedicated to establishing and supporting the infrastructure for Web3 and distributed computing. The CPU index observed substantial growth of over 17 per cent, primarily driven by the impressive performance of tokens such as Chainlink (LINK) and Fetch.AI (FET). These gains in the computing sector underline the growing interest in projects related to the development of Web3 and distributed computing systems within the cryptocurrency landscape. Lastly, as reported by CNBC, Zodia Custody, a crypto security company under the ownership of the renowned British banking giant Standard Chartered, has disclosed its forthcoming launch of services in Hong Kong. This development signifies the latest strategic expansion move by the United Kingdom-based firm into the Asia-Pacific region. Zodia Custody, established in 2020, specialises in providing secure cryptocurrency storage solutions to financial institutions. Julian Sawyer, the CEO of Zodia, emphasised that the Hong Kong market exhibits a unique demand profile, primarily stemming from institutional entities rather than individual retail customers. He asserted that such institutional demand aligns seamlessly with Zodia's service offerings. Julian Sawyer also highlighted the proactive stance of the Hong Kong government and regulatory bodies in recognising the significance of digital assets in shaping the future financial landscape. They aspire to position Hong Kong as a central hub for the burgeoning cryptocurrency industry. What Crypto Traders Are Saying About Current Market Scenario Mudrex co-founder and CEO Edul Patel told ABP Live, “Throughout the weekend, Bitcoin's price remained consistently above $34,000, supported by the ongoing positive sentiment regarding the approval of Bitcoin Spot ETF applications in the US. The ProShares Bitcoin Strategy ETF (BITO) experienced its second-highest trading week ever, accumulating $1.7 billion in trading volume, while the Grayscale Bitcoin Trust (GBTC) recorded a significant trading volume of $800 million, further fueling optimism in the market. Bitcoin’s price has grown more than 13 percent in the last 7 days. Meanwhile, Ethereum has held its value above the $1,700 level.” WazirX Vice President Rajagopal Menon offered his take, “The prospect of high-interest rates has settled in the market as some stakeholders had anticipated. This could impact Bitcoin’s price even as ETF potential is driving optimism to peak levels. The US Fed meeting this week will clarify many aspects of the future of the economy.” Subscribe And Follow ABP Live On Telegram: t.me/officialabplive Disclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers.",
    "content": "Bitcoin (BTC), the oldest and most valued crypto in the world, comfortably managed to remain above the $34,000 mark as ‘Uptober’ draws to an end. The steady rally could largely be attributed to the positive market sentiment around Bitcoin Spot ETFs, as more and more companies are looking to jump onto the boom wagon. Of course, the US Securities and Exchange Commission’s (SEC) decision to not challenge the Grayscale ETF application last week has lent a positive push to the prices, which continue to show dividends at the time of writing. As always, It remains to be seen how long the latest rally can sustain itself. Before we proceed further, readers should note that the overall crypto market and coin prices are extremely volatile in nature. There are no foolproof methods to ascertain how cryptocurrencies are expected to behave in the future. This article is aimed at helping investors stay on top of the current market scenarios and the biggest events that have already taken place as well as some upcoming occurrences that are worth noting. Investors are advised to do their own research before taking any call. Crypto Prices Over The Past Week Last Monday (October 23), the overall crypto market cap stood at $1.16 trillion. BTC price stood at around $30,700, ETH price stood at around $1,700. A week later, the overall market cap jumped to $1.26 trillion. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Check Out Top Crypto Prices Today DeFi's total volume stands at $2.68 billion, at 9.85 percent of the total market 24-hour volume. In the case of stablecoins, the overall volume stands at $23.77 billion, at 87.32 percent of the total 24-hour market volume. As per CoinMarketCap, the overall market fear and greed index stood at ‘Greed’ with 72 points (out of 100) — seeing a significant boost in investors’ confidence when compared to last Monday. BTC dominance, at the time of writing, stood at 52.97 percent. Over the past seven days, Bitcoin achieved a high of $34,911.49 (on October 25) and a low of $30,500.93 (October 23). Ethereum, on the other hand, saw a high of $1,852.53 (October 26) and a low of $1,665.73 (October 23). Crypto Events To Note In recent developments within the cryptocurrency investment space, ProShares Bitcoin Strategy ETF and VanEck Bitcoin Trust have made significant strides. The ProShares Bitcoin Strategy ETF, introduced to the market in October 2021, is designed to generate returns mirroring those of Bitcoin by engaging in Bitcoin futures contracts. Notably, the Fund does not make direct investments in bitcoin itself. As of the latest data, the ETF has displayed an impressive 80 per cent year-to-date increase in performance, but it's worth noting that it has also seen a 36 per cent decline since its inception. On October 27, VanEck took a significant step by submitting a preliminary prospectus for the VanEck Bitcoin Trust, an exchange-traded fund (ETF). This ETF is structured with the primary goal of replicating bitcoin's performance, less operating expenses, by directly holding bitcoin. According to information provided in the preliminary prospectus, the custody of all Bitcoin holdings on behalf of the Trust will be entrusted to Gemini Trust Company LLC. These developments reflect the ongoing evolution and diversification of investment options in the cryptocurrency market, as investors seek new ways to gain exposure to digital assets while managing associated risks. In a recent cryptocurrency market update, CoinDesk reported that Bitcoin (BTC) has exhibited a notable surge in its bullish momentum. Over a week, BTC witnessed a remarkable gain of over 14 per cent, ultimately stabilising at approximately $33,700. This surge followed Bitcoin's recent attainment of its annual peak at $35,000, albeit falling short of breaking through that crucial price level. It is worth noting that Bitcoin's performance closely mirrors the 14 per cent increase recorded in the CoinDesk Market Index (CMI). Furthermore, the cryptocurrency market displayed notable strength in the CoinDesk Computing Sector (CPU), which is an index designed to monitor protocols dedicated to establishing and supporting the infrastructure for Web3 and distributed computing. The CPU index observed substantial growth of over 17 per cent, primarily driven by the impressive performance of tokens such as Chainlink (LINK) and Fetch.AI (FET). These gains in the computing sector underline the growing interest in projects related to the development of Web3 and distributed computing systems within the cryptocurrency landscape. Lastly, as reported by CNBC, Zodia Custody, a crypto security company under the ownership of the renowned British banking giant Standard Chartered, has disclosed its forthcoming launch of services in Hong Kong. This development signifies the latest strategic expansion move by the United Kingdom-based firm into the Asia-Pacific region. Zodia Custody, established in 2020, specialises in providing secure cryptocurrency storage solutions to financial institutions. Julian Sawyer, the CEO of Zodia, emphasised that the Hong Kong market exhibits a unique demand profile, primarily stemming from institutional entities rather than individual retail customers. He asserted that such institutional demand aligns seamlessly with Zodia's service offerings. Julian Sawyer also highlighted the proactive stance of the Hong Kong government and regulatory bodies in recognising the significance of digital assets in shaping the future financial landscape. They aspire to position Hong Kong as a central hub for the burgeoning cryptocurrency industry. What Crypto Traders Are Saying About Current Market Scenario Mudrex co-founder and CEO Edul Patel told ABP Live, “Throughout the weekend, Bitcoin's price remained consistently above $34,000, supported by the ongoing positive sentiment regarding the approval of Bitcoin Spot ETF applications in the US. The ProShares Bitcoin Strategy ETF (BITO) experienced its second-highest trading week ever, accumulating $1.7 billion in trading volume, while the Grayscale Bitcoin Trust (GBTC) recorded a significant trading volume of $800 million, further fueling optimism in the market. Bitcoin’s price has grown more than 13 percent in the last 7 days. Meanwhile, Ethereum has held its value above the $1,700 level.” WazirX Vice President Rajagopal Menon offered his take, “The prospect of high-interest rates has settled in the market as some stakeholders had anticipated. This could impact Bitcoin’s price even as ETF potential is driving optimism to peak levels. The US Fed meeting this week will clarify many aspects of the future of the economy.” Subscribe And Follow ABP Live On Telegram: t.me/officialabplive Disclaimer: Crypto products and NFTs are unregulated and can be highly risky. There may be no regulatory recourse for any loss from such transactions. Cryptocurrency is not a legal tender and is subject to market risks. Readers are advised to seek expert advice and read offer document(s) along with related important literature on the subject carefully before making any kind of investment whatsoever. Cryptocurrency market predictions are speculative and any investment made shall be at the sole cost and risk of the readers.",
    "pubDate": "2023-10-30 04:57:37",
    "image_url": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/05/01/866d077552abf27ad986b43baea828bb1682923313327402_original.jpg",
    "source_id": "abplive",
    "source_priority": 10959,
    "country": [
      "india"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "1e5586400b6e43ec7776a0b96b78bec4",
    "title": "Vision Plan To Make India Developed Economy Of $30 Trillion By 2047 To Be Out By December: NITI Aayog CEO",
    "link": "https://news.abplive.com/india-at-2047/niti-aayog-vision-document-to-make-india-developed-economy-by-2047-1639168",
    "keywords": [
      "INDIA AT 2047"
    ],
    "creator": [
      "ABP News Bureau"
    ],
    "video_url": null,
    "description": "After Prime Minister Narendra Modi gave a call on making India a developed country by 2047, when it will be celebrating 100 years of Independence, a vision document is on works to realise the goal and will be ready in the next three months. Divulging the details to reporters, NITI Aayog CEO BVR Subrahmanyam said the draft \"Vision India @2047\" document to make India a developed economy of about USD 30 trillion by 2047 would be presented by December 2023. Besides highlighting the institutional and structural reforms needed to make India a developed nation, the document will address the poverty issue and the \"middle-income trap\".  \"A vision plan is being prepared for India to become a developed economy of about USD 30 trillion (USD 29.2 trillion) by 2047... the whole purpose of the vision document is to avoid the middle-income trap,\" PTI quoted Subrahmanyam as saying. \"We are worried about the middle-income trap... India has to cut through the poverty thing and middle-income trap,\" he further said. READ | India Needs To Grow At 8-9 Per Cent For 20 Years To Become Developed Country By 2047: Deloitte The middle-income trap is a scenario where a middle-income country is unable to transition to a high-income economy and achieve higher per-capita income levels. This may be due to rising costs and declining competitiveness. However, it is easier for low-income countries to transition to middle-income economy faster due to factors like low wages and cheap labour. How Goal To Make India 'Vikshit Bharat' By 2047 Is Progressing In May, PM Modi had asked all Chief Ministers to work towards the goal of making India 'Vikshit Bharat' by 2047 during the Governing Council meeting of NITI Aayog. On August 15, addressing the nation from the ramparts of the Red Fort on India's 77th Indepnedence Day, PM Modi had said the country would be among the top three economies in the near future. India is currently the fifth-largest economy in the world, after the US, China, Japan, and Germany.  The process to make the draft vision document, however, was started back in 2021, with the Cabinet Secretary and 10 Sectoral Groups of Secretaries (SGoSs) being asked to prepare sectoral visions, PTI reported. In these two years, several rounds of meetings and consultations with various stakeholders, industry chambers, export promotion council, think tanks and research institutions have taken place.  NITI Aayog came into the picture earlier this year and was asked to consolidate the 10 sectoral visions into a combined document for \"Vikshit Bharat @2047\". Another round of brainstorming with businessmen Gautam Adani, Mukesh Ambani and Alphabet CEO Sundar Pichai will take place next month. \"Consultations with SGoSs and thought leaders (including chairman Adani Group Gautam Adani, chairman of Reliance Industries Mukesh Ambani and Google and Alphabet CEO Sundar Pichai) will take place in November 2023,\" PTI quoted Subrahmanyam as saying. Sectors and upcoming technologies where India can be a world leader will also be part of the vision document. It will also recommend ways to leverage India's market size and address regional disparities. States are also developing their own vision documents, the NITI Aayog CEO said. Recently, in an interview to PTI, Deloitte South Asia CEO Romal Shetty said India needs to grow at 8-9 per cent for the next 20 years to realise its aspiration of becoming a developed nation by 2047. Shetty said India's space sector had the potential to investments of $100 billion by 2040. \"We need to grow at 8-9 per cent till at least 2047 to become a developed economy.... moving away from middle income level... To grow at that pace is not easy. Very few countries in the world have been able to grow at a pace of 8-9 per cent year-on -year,\" Shetty told PTI.",
    "content": "After Prime Minister Narendra Modi gave a call on making India a developed country by 2047 , when it will be celebrating 100 years of Independence, a vision document is on works to realise the goal and will be ready in the next three months. Divulging the details to reporters, NITI Aayog CEO BVR Subrahmanyam said the draft \"Vision India @2047\" document to make India a developed economy of about USD 30 trillion by 2047 would be presented by December 2023. Besides highlighting the institutional and structural reforms needed to make India a developed nation, the document will address the poverty issue and the \"middle-income trap\". \"A vision plan is being prepared for India to become a developed economy of about USD 30 trillion (USD 29.2 trillion) by 2047... the whole purpose of the vision document is to avoid the middle-income trap,\" PTI quoted Subrahmanyam as saying. \"We are worried about the middle-income trap... India has to cut through the poverty thing and middle-income trap,\" he further said. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); READ | India Needs To Grow At 8-9 Per Cent For 20 Years To Become Developed Country By 2047: Deloitte The middle-income trap is a scenario where a middle-income country is unable to transition to a high-income economy and achieve higher per-capita income levels. This may be due to rising costs and declining competitiveness. However, it is easier for low-income countries to transition to middle-income economy faster due to factors like low wages and cheap labour. How Goal To Make India 'Vikshit Bharat' By 2047 Is Progressing In May, PM Modi had asked all Chief Ministers to work towards the goal of making India 'Vikshit Bharat' by 2047 during the Governing Council meeting of NITI Aayog. On August 15, addressing the nation from the ramparts of the Red Fort on India's 77th Indepnedence Day, PM Modi had said the country would be among the top three economies in the near future. India is currently the fifth-largest economy in the world, after the US, China, Japan, and Germany. The process to make the draft vision document, however, was started back in 2021, with the Cabinet Secretary and 10 Sectoral Groups of Secretaries (SGoSs) being asked to prepare sectoral visions, PTI reported. In these two years, several rounds of meetings and consultations with various stakeholders, industry chambers, export promotion council, think tanks and research institutions have taken place. NITI Aayog came into the picture earlier this year and was asked to consolidate the 10 sectoral visions into a combined document for \"Vikshit Bharat @2047\". Another round of brainstorming with businessmen Gautam Adani, Mukesh Ambani and Alphabet CEO Sundar Pichai will take place next month. \"Consultations with SGoSs and thought leaders (including chairman Adani Group Gautam Adani, chairman of Reliance Industries Mukesh Ambani and Google and Alphabet CEO Sundar Pichai) will take place in November 2023,\" PTI quoted Subrahmanyam as saying. Sectors and upcoming technologies where India can be a world leader will also be part of the vision document. It will also recommend ways to leverage India's market size and address regional disparities. States are also developing their own vision documents, the NITI Aayog CEO said. Recently, in an interview to PTI, Deloitte South Asia CEO Romal Shetty said India needs to grow at 8-9 per cent for the next 20 years to realise its aspiration of becoming a developed nation by 2047. Shetty said India's space sector had the potential to investments of $100 billion by 2040. \"We need to grow at 8-9 per cent till at least 2047 to become a developed economy.... moving away from middle income level... To grow at that pace is not easy. Very few countries in the world have been able to grow at a pace of 8-9 per cent year-on -year,\" Shetty told PTI.",
    "pubDate": "2023-10-30 04:50:20",
    "image_url": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/1ad1483941269e2baf019a85328728361698640745587320_original.jpg",
    "source_id": "abplive",
    "source_priority": 10959,
    "country": [
      "india"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "b3ff11b1362ecb61b4564849bffa409e",
    "title": "‘A lot of uncertainty’ for retailers heading into the Christmas period",
    "link": "https://www.skynews.com.au/business/a-lot-of-uncertainty-for-retailers-heading-into-the-christmas-period/video/9030e5f624927482e290484698b2eecf",
    "keywords": [
      "Australia",
      "Business",
      "business",
      "fb",
      "msn",
      "yt"
    ],
    "creator": [
      ""
    ],
    "video_url": null,
    "description": "Australian Retailers Association Industry Affairs Chief Fleur Brown says there is “a lot of uncertainty” and challenges for businesses as the Christmas trading period approaches. “It’s a battle out there for consumers, but also for retailers, particularly small retailers,” Ms Brown told Sky News Australia. “Unfortunately, the results are telling us that there’s a lot of uncertainty out there and so many challenges for these businesses to face as they head into the really important Christmas trading period.” Ms Brown said retailers and Australians are awaiting the RBA's interest rate decision next Tuesday as that will determine how much people spend over the Christmas period. “We are hoping that rates will stay on hold, and that will give a little bit more optimism for retailers,” she said.",
    "content": "Australian Retailers Association Industry Affairs Chief Fleur Brown says there is “a lot of uncertainty” and challenges for businesses as the Christmas trading period approaches. “It’s a battle out there for consumers, but also for retailers, particularly small retailers,” Ms Brown told Sky News Australia. “Unfortunately, the results are telling us that there’s a lot of uncertainty out there and so many challenges for these businesses to face as they head into the really important Christmas trading period.” Ms Brown said retailers and Australians are awaiting the RBA's interest rate decision next Tuesday as that will determine how much people spend over the Christmas period. “We are hoping that rates will stay on hold, and that will give a little bit more optimism for retailers,” she said.",
    "pubDate": "2023-10-30 04:36:38",
    "image_url": null,
    "source_id": "skynewsau",
    "source_priority": 13361,
    "country": [
      "australia"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "6f3d91ee28098537e1e7e0b75909b4ed",
    "title": "Dhamra LNG Terminal Built Entirely On Promoter Finance; No Fin Commitment From IOC, GAIL: Sources",
    "link": "https://news.abplive.com/business/dhamra-lng-terminal-built-entirely-on-promoter-finance-no-fin-commitment-from-ioc-gail-sources-1639165",
    "keywords": [
      "Business"
    ],
    "creator": [
      "PTI"
    ],
    "video_url": null,
    "description": "Adani Group built an LNG import facility at Dhamra in Odisha entirely based on financial backing of promoters, with no financial undertaking or guarantees of public sector giants IOC and GAIL, who merely were tenants, sources said. Clarifying the group's position, they said Indian Oil Corporation (IOC) and GAIL (India) Ltd have hired capacity on the newly built terminal at rates lower than a similar but older and depreciated facility at Dahej in Gujarat. This came in response to reported comments by Trinamool Congress MP Mahua Moitra, who is facing a Lok Sabha Ethics Committee examination over cash for query in Parliament, on Dhamra being built on financial backing and commitments to buy gas at a fixed price. The project cost of Dhamra LNG terminal is Rs 6,450 crore, the sources said responding to Moitra's assertion that the terminal to import natural gas in its liquid form, called LNG, was built at a much higher cost than Rs 5,000 crore that IOC incurred in construction of a similar sized facility at Ennore in Tamil Nadu. Sources said no amount upfront or during the project either as cash or bank guarantee has been given by IOC and GAIL. The project is fully financed by equity and debt by shareholders of Dhamra LNG terminal, they said, rejecting the assertion that IOC and GAIL paid Rs 46,500 crore. IOC had in 2015 signed to use up to 60 per cent of the terminal's 5 million tonnes a year capacity for importing gas for its refineries at Haldia in West Bengal and Paradip in Odisha. GAIL too had signed up for 1.5 million tonnes of the terminal's regasification capacity. Sources asserted that its tariff and commercial terms of Dhamra LNG terminal (inclusive of port charges) was arrived at through competitive benchmarking. Petronet LNG (which is owned by IOC, GAIL, BPCL and ONGC) operates India's largest LNG terminal at Dahej was used as benchmarking the tariff and commercial terms, they said. Dhamra tariff is 1.5 per cent lower (Rs 46.49 per ton or Rs 21 crore annually over 4.5 million tonnes of LNG capacity use) than Dahej LNG terminal charges and has better commercial terms as well. Moitra had, however, compared the tariff of Dhamra with Ennore, which was commissioned not so long back. This charge compares to Rs 57.38 per mmBtu regasification charges for Ennore LNG terminal, he had said. Originally, IOC and GAIL had on September 21, 2016, signed a 'non-binding' agreement to buy a 50 per cent stake in Adani Group's Rs 5,500-crore Dhamra LNG project in Odisha. But that agreement expired on September 20, 2018, without being translated into a firm pact apparently because of differences over valuation. Sources said IOC and GAIL import LNG on their own and only pay tolling charges. Dhamra LNG will not buy and sell LNG during the operations of the facility. It only provides the service of LNG handling and dispatch, they said, rejecting the claim of a 20-year fixed payment by IOC and GAIL to Adani for gas. On a charge that businessman Darshan Hiranandani posed questions on Adani Group using Moitra's parliamentary logins as his business was impacted because of IOC and GAIL committing to Dhamra, sources said Hiranandani's H-Energy had obtained a NOC from the Kolkata Port Trust to set up a LNG terminal in Kukrahati in February 2020. Though this NOC is still valid, they have been unsuccessful in progressing the same. This terminal of H-Energy would cater to the same catchment area being serviced by Dhamra LNG, they said. H-Energy was also looking at IOC and GAIL to book capacity for their terminal. However, they were unable to justify a value proposition to IOC and GAIL that was better than what was being offered at Dhamra LNG terminal. This stymied their efforts to develop this facility, sources claimed. On IOC and GAIL not taking equity in Dhamra, they said the LNG terminal was able to offer commercially competitive terms to the users and given the pipeline tariff competitiveness of supplying nearby consumption centres, IOC and GAIL were confident of bringing LNG at the cheapest terms via Dhamra to their consumption centres. Hence, their strategic objective was met without injecting equity and they decided to progress on a capacity booking basis only. The strong credentials of the project developers and the significant amount of pre-investment undertaken by Adani gave further confidence to IOC and GAIL on project completion, they added.  (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)",
    "content": "Adani Group built an LNG import facility at Dhamra in Odisha entirely based on financial backing of promoters, with no financial undertaking or guarantees of public sector giants IOC and GAIL, who merely were tenants, sources said. Clarifying the group's position, they said Indian Oil Corporation (IOC) and GAIL (India) Ltd have hired capacity on the newly built terminal at rates lower than a similar but older and depreciated facility at Dahej in Gujarat. This came in response to reported comments by Trinamool Congress MP Mahua Moitra, who is facing a Lok Sabha Ethics Committee examination over cash for query in Parliament, on Dhamra being built on financial backing and commitments to buy gas at a fixed price. The project cost of Dhamra LNG terminal is Rs 6,450 crore, the sources said responding to Moitra's assertion that the terminal to import natural gas in its liquid form, called LNG, was built at a much higher cost than Rs 5,000 crore that IOC incurred in construction of a similar sized facility at Ennore in Tamil Nadu. googletag.cmd.push(function() { googletag.display(\"div-gpt-ad-6601185-5\"); }); Sources said no amount upfront or during the project either as cash or bank guarantee has been given by IOC and GAIL. The project is fully financed by equity and debt by shareholders of Dhamra LNG terminal, they said, rejecting the assertion that IOC and GAIL paid Rs 46,500 crore. IOC had in 2015 signed to use up to 60 per cent of the terminal's 5 million tonnes a year capacity for importing gas for its refineries at Haldia in West Bengal and Paradip in Odisha. GAIL too had signed up for 1.5 million tonnes of the terminal's regasification capacity. Sources asserted that its tariff and commercial terms of Dhamra LNG terminal (inclusive of port charges) was arrived at through competitive benchmarking. Petronet LNG (which is owned by IOC, GAIL, BPCL and ONGC) operates India's largest LNG terminal at Dahej was used as benchmarking the tariff and commercial terms, they said. Dhamra tariff is 1.5 per cent lower (Rs 46.49 per ton or Rs 21 crore annually over 4.5 million tonnes of LNG capacity use) than Dahej LNG terminal charges and has better commercial terms as well. Moitra had, however, compared the tariff of Dhamra with Ennore, which was commissioned not so long back. This charge compares to Rs 57.38 per mmBtu regasification charges for Ennore LNG terminal, he had said. Originally, IOC and GAIL had on September 21, 2016, signed a 'non-binding' agreement to buy a 50 per cent stake in Adani Group's Rs 5,500-crore Dhamra LNG project in Odisha. But that agreement expired on September 20, 2018, without being translated into a firm pact apparently because of differences over valuation. Sources said IOC and GAIL import LNG on their own and only pay tolling charges. Dhamra LNG will not buy and sell LNG during the operations of the facility. It only provides the service of LNG handling and dispatch, they said, rejecting the claim of a 20-year fixed payment by IOC and GAIL to Adani for gas. On a charge that businessman Darshan Hiranandani posed questions on Adani Group using Moitra's parliamentary logins as his business was impacted because of IOC and GAIL committing to Dhamra, sources said Hiranandani's H-Energy had obtained a NOC from the Kolkata Port Trust to set up a LNG terminal in Kukrahati in February 2020. Though this NOC is still valid, they have been unsuccessful in progressing the same. This terminal of H-Energy would cater to the same catchment area being serviced by Dhamra LNG, they said. H-Energy was also looking at IOC and GAIL to book capacity for their terminal. However, they were unable to justify a value proposition to IOC and GAIL that was better than what was being offered at Dhamra LNG terminal. This stymied their efforts to develop this facility, sources claimed. On IOC and GAIL not taking equity in Dhamra, they said the LNG terminal was able to offer commercially competitive terms to the users and given the pipeline tariff competitiveness of supplying nearby consumption centres, IOC and GAIL were confident of bringing LNG at the cheapest terms via Dhamra to their consumption centres. Hence, their strategic objective was met without injecting equity and they decided to progress on a capacity booking basis only. The strong credentials of the project developers and the significant amount of pre-investment undertaken by Adani gave further confidence to IOC and GAIL on project completion, they added. (This report has been published as part of the auto-generated syndicate wire feed. No editing has been done in the headline or the body by ABP Live.)",
    "pubDate": "2023-10-30 04:30:31",
    "image_url": "https://feeds.abplive.com/onecms/images/uploaded-images/2023/10/30/fb97dec32d0530675b0fa10c23b523141698640065398314_original.jpg",
    "source_id": "abplive",
    "source_priority": 10959,
    "country": [
      "india"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "6471dfe842b2bcb799bd1dd3447a3161",
    "title": "Apple India Revenue Nears $6 Bn Milestone In FY23",
    "link": "https://inc42.com/buzz/apple-india-revenue-nears-6-bn-milestone-in-fy23/",
    "keywords": [
      "News",
      "Mobile",
      "Software"
    ],
    "creator": [
      "Meha Agarwal"
    ],
    "video_url": null,
    "description": "Apple’s India business has recorded a revenue of INR 49.3K Cr (almost $6 Bn) in FY23, marking an increase of…",
    "content": "Apple’s India business revenues in the year FY23 marked an increase of 48% from INR 33.3K Cr ($4.03 Bn) in FY22 The FY23 results came in just a few days after Tata acquired the Karnataka plant of Wistron Corp for $125 Mn Earlier this year, Apple CEO Tim Cook also launched Apple stores in Mumbai and Delhi Apple’s India business has recorded a revenue of INR 49.3K Cr (almost $6 Bn) in FY23, marking an increase of 48% from INR 33.3K Cr ($4.03 Bn) in FY22. According to RoC filings, Apple India generates 94.6% of its revenue from sales of products and 5.4% from maintenance and services. The net profit surged 76% to INR 2,229 Cr in FY23 from INR 1,263 Cr in FY22, as per the filings. The FY23 results came in just a few days after Tata Electronics Private Limited (TEPL) confirmed the acquisition of the iPhone manufacturing unit of the Taiwanese firm Wistron Corp for $125 Mn. As part of this deal, Tata will acquire the Karnataka plant of Wistron, which employs about 10,000 people to assemble iPhone14. Prior to this, Tata was manufacturing the metal body of Apple smartphones at its Tamil Nadu plant. The global smartphone brand has ambitious goals for its Indian market. According to Counterpoint Research , Apple sold 1.5 Mn units of its iPhones during the first week of the festive season sale. The Cupertino-based smartphone maker started the pre-booking of its latest iPhone series — iPhone 15, 15 Plus, 15 Pro, and 15 Pro MaxiPhone 15, 15 Plus, 15 Pro, and 15 Pro Max — in India on September 15. Just a few days ahead of its launch, a study stated that Apple was all set to end 2023 with a 7% market share in the country , which is largely dominated by Android smartphones. Apple has surged ahead of Samsung in smartphone exports from India, accounting for 49% of the country’s 12 Mn smartphone shipments in the second quarter of 2023 (Q2 2023). For its part, Apple has been rapidly increasing its production capabilities in India over the past few quarters via its contract manufacturers. It is expected to commence the production of AirPods at the Hyderabad facility of Taiwanese contract manufacturer Foxconn by the end of next year. The Hyderabad plant is projected to initiate large-scale manufacturing by December 2024 with an approved investment of $400 Mn by Foxconn. Also, Apple’s key supplier Jabil Inc has reportedly started manufacturing AirPods components in India. Earlier this year, Apple CEO Tim Cook also launched the first Apple store in Mumbai and a second one in Delhi.",
    "pubDate": "2023-10-30 04:26:11",
    "image_url": null,
    "source_id": "inc42",
    "source_priority": 140464,
    "country": [
      "india"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "17e4dbe0bec90305b0eb7247d9da4ef6",
    "title": "Victoria bounces back to become Australia’s strongest economy",
    "link": "https://www.skynews.com.au/business/finance/victoria-bounces-back-to-become-australias-strongest-economy/video/de5e853668e12dfbc5d7e1f1fca5f76e",
    "keywords": [
      "Australia",
      "Business",
      "Finance",
      "business",
      "fb",
      "finance",
      "msn",
      "yt"
    ],
    "creator": [
      ""
    ],
    "video_url": null,
    "description": "New analysis suggests Victoria is now Australia’s strongest economy. CommSec’s quarterly ‘State of the States’ report reveals Victoria has skyrocketed from fifth on the ladder to first. The state’s performance was strong across all eight indicators, including economic growth and population growth. South Australia is the second best-performing economy ahead of New South Wales and Queensland. Victoria’s Deputy Premier Ben Carroll said, “Goes to show that a lot of the investments we’ve been making over a long period are really showing and paying dividends”.",
    "content": "New analysis suggests Victoria is now Australia’s strongest economy. CommSec’s quarterly ‘State of the States’ report reveals Victoria has skyrocketed from fifth on the ladder to first. The state’s performance was strong across all eight indicators, including economic growth and population growth. South Australia is the second best-performing economy ahead of New South Wales and Queensland. Victoria’s Deputy Premier Ben Carroll said, “Goes to show that a lot of the investments we’ve been making over a long period are really showing and paying dividends”.",
    "pubDate": "2023-10-30 04:22:55",
    "image_url": null,
    "source_id": "skynewsau",
    "source_priority": 13361,
    "country": [
      "australia"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  },
  {
    "article_id": "f3d964d45e199eaede85694c59bb6aa3",
    "title": "롯데관광개발, 세계 1위 크루즈 선사와 12번째 연간 협약",
    "link": "https://sports.hankooki.com/news/articleView.html?idxno=6843863",
    "keywords": null,
    "creator": [
      "조민욱 기자"
    ],
    "video_url": null,
    "description": "[스포츠한국 조민욱 기자] 롯데관광개발은 글로벌 크루즈 선사인 코스타 크루즈와 2024년 크루즈 전세선 운항 계약을 진행했다고 30일 밝혔다.세계 1위 크루즈 기업인 카니발 그룹에 속한 이탈리아의 코스타 크루즈사와 지난 2010년 9월 동북아시아에서는 처음으로 인연을 맺은 이후 이번이 12번째 연간 운항 계약이다.롯데관광개발은 지금까지 43회 국제 크루즈선 운항을 통해 4만9900명 모객에 성공했다.백현 롯데관광개발 대표는 “크루즈 1척이 항공기 15대와 맞먹는 관광객을 수용하는 만큼 크루즈 사업은 지역경제 활성화와 일자리 창출에",
    "content": "[스포츠한국 조민욱 기자] 롯데관광개발은 글로벌 크루즈 선사인 코스타 크루즈와 2024년 크루즈 전세선 운항 계약을 진행했다고 30일 밝혔다. 세계 1위 크루즈 기업인 카니발 그룹에 속한 이탈리아의 코스타 크루즈사와 지난 2010년 9월 동북아시아에서는 처음으로 인연을 맺은 이후 이번이 12번째 연간 운항 계약이다. 롯데관광개발은 지금까지 43회 국제 크루즈선 운항을 통해 4만9900명 모객에 성공했다. 백현 롯데관광개발 대표는 “크루즈 1척이 항공기 15대와 맞먹는 관광객을 수용하는 만큼 크루즈 사업은 지역경제 활성화와 일자리 창출에 이바지하는 선진국형 고부가가치 관광산업”이라며 “앞으로 차별화한 크루즈 여행상품을 선보여 국내 크루즈 여행 대중화 및 크루즈 관광산업 저변 확대에 더욱 노력하겠다”고 말했다 이번 연간 협약을 통해 충청권 최초의 크루즈 시대를 연다고 회사 측은 설명했다. 롯데관광개발은 내년 5월8일 충남 서산시 대산항을 모항으로 대만 기륭, 일본 오키나와, 미야코지마를 거쳐 부산에 도착하는 1항차 크루즈 상품에 대한 모객을 진행 중이다. 이와 함께 내년 5월14일 부산에서 일본 사카이미나토, 가나자와를 오가는 2항차 크루즈 상품도 판매 중이다. 이를 위한 다양한 프로모션도 진행 중이다. 이번 크루즈여행에 투입하는 코스타 세레나호는 우리나라를 모항으로 출발하는 크루즈 가운데 최대 규모(11만4000톤, 전장 290m, 전폭 35m)로 최대 3780명을 수용하는 메머드급 선박이다. 1000명 이상을 수용할 수 있는 2개의 코스식 정찬 레스토랑과 함께 총 4개의 수영장과 워터 슬라이드 및 1400명이 동시에 각종 공연과 이벤트를 관람할 수 있는 대극장 등을 갖췄다.",
    "pubDate": "2023-10-30 04:19:06",
    "image_url": null,
    "source_id": "sports_hankooki",
    "source_priority": 486721,
    "country": [
      "south korea"
    ],
    "category": [
      "business"
    ],
    "language": "english"
  }
]