{
    "authors": [],
    "date_download": "2018-02-03 00:02:09+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F02%2F1979-sid-vicious-dies-of-a-drug-overdose-in-new-york-city%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2018/01/1979.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "To the New York City Police Department and Medical Examiner’s Office, he was John Simon Ritchie, a 22-year-old Englishman under indictment for murder but now dead of a heroin overdose in a Greenwich Village apartment. To the rest of the world, he was Sid Vicious, former bassist for the notorious Sex Pistols and the living embodiment of everything punk rock stood for and against. His death, which likely came as a surprise to very few, came on this day in 1979.\nSid Vicious was the last member to join the Sex Pistols, taking over for fired bassist Glen Matlock in early 1977. What he famously did not bring to the table was musical ability. Vicious faked his way through early gigs with the band, reportedly with his amplifier occasionally unplugged on stage by his own band mates. What he didn’t have to fake was the attitude. Sid Vicious was the perfect living embodiment of the punk esthetic, a street kid who really did walk around London with a swastika on his chest, a padlocked chain around his neck and a gigantic chip on his shoulder. As his good friend the critic and author Alan Jones put it, “Sid, on image alone, is what all punk rests on.”\nSeven months into his tenure as a Sex Pistol, Sid Vicious was introduced to a troubled American girl on the London punk scene named Nancy Spungen. Almost immediately, they began a relationship that led to both of their deaths. By all reports, they were very much in love, but their shared heroin addiction led to repeated instances of violence between them. Sid’s addiction may have hastened the dissolution of the Sex Pistols midway through their first U.S. tour in January 1978, and it certainly contributed to the still mysterious events surrounding Nancy’s death by stabbing on October 12 of that same year in the Chelsea Hotel room she shared with Vicious in New York City.\nFreed on bail after his arrest for the Spungen murder, Sid landed himself back in jail in December 1978 for assaulting Patti Smith’s brother in a bar with a broken bottle. After seven weeks of detention and detox in the Rikers Island jail, Vicious made bail again on February 1, 1979. Late that same night, at a party, he would put heroin into his system that the Medical Examiner would later estimate to have been 80% pure. Sid Vicious died in the early morning hours of February 2, 1979.\nSource: www.history.com",
    "source_domain": "bowienewsonline.com",
    "title": "1979 Sid Vicious dies of a drug overdose in New York City",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/02/1979-sid-vicious-dies-of-a-drug-overdose-in-new-york-city/"
}