{
    "authors": [],
    "date_download": "2017-06-15 01:27:04+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2017%2F06%2Fhigh-school-baseball-muensters-jones-earns-2a-mvp%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2016/07/patterson-sky-box.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "All-Tournament Teams\nHere are the Conference 1A-6A all-tournament teams from the state baseball tournament, which took place in Austin and Round Rock last week.\nThe Texas High School Baseball Coaches Association made the selections, and tournament most valuable players were named by the media.\nConference 1A\nPitcher: Hunter Pope, Abbott; Catcher: Damon Gerik, Fayetteville; 1B: Trace Richey, Gail Borden County; 2B: Lane Fritsch, Fayetteville; 3B: Matthew Pevehouse, Abbott; Shortstop: Payton Hemmitt, Fayetteville; OF: Weston Cantrell, Abbott; Braden Rohde, Fayetteville; Steven Carrillo, Gail Borden County; Utility: Gabe Nelson, Gilmer Union Hill\nChampionship Game MVP: Brent Mynar, Abbott\nConference 2A\nPitcher: Austin Hendrix, Dallardsville Big Sandy; Catcher: Carson Cheaney, Muenster; 1B: Dax Neece, Albany; 2B: Clay Stevens, Muenster; 3B: Parker McGrew, Muenster; SS: Chance Coker, Groveton; OF: Kagen Dangelmyer, Muenster; Bryce Holmes, Big Sandy; Broch Holmes, Big Sandy; Utility: Brian Hamilton, Albany\nChampionship Game MVP: Blayne Jones, Muenster\nConference 3A\nPitcher: Ryan Gully, Wall; Catcher: Dryden Virden, Wall; 1B: Skyler Hill, Georgetown County; 2B: Will Haley, Nacogdoches Central Heights; 3B: Scout Sanders, Whitesboro; SS: Grayson Rodriguez, Central Heights; OF: Gage Weishuhn, Wall; Braden Thomas, Central Heights; Brock Rosenquist, Wall; Utility: Rowan Arrant, Central Heights\nChampionship Game MVP: Cade Watson, Central Heights\nEditor’s Note: See the complete list and all of the tournament scores in the June 14 Bowie News.\nUniversity Interscholastic League. (Logo provided by the UIL, used with permission)",
    "source_domain": "bowienewsonline.com",
    "title": "HIGH SCHOOL BASEBALL: Muenster’s Jones earns 2A MVP",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2017/06/high-school-baseball-muensters-jones-earns-2a-mvp/"
}