{
    "authors": [],
    "date_download": "2018-02-04 00:11:26+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F02%2Flady-indians-run-out-of-steam-against-jacksboro%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2017/11/nocona-basketball-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In another tough matchup for the Nocona Lady Indians, they came up just a bit short at home against Jacksboro on Tuesday.\nThe Lady Indians wanted to further shake up the district standings against a one loss Jacksboro team that just gave Bowie their first loss the previous game. They just ran out of juice in the end to lose 53-47.\nNocona came out early and was able to jump on Jacksboro 14-6 in the first quarter with their fast pace and a few 3s. Jacksboro has a size advantage on every team in the district so early on the Lady Indians played a packed in zone defense instead of their normal press.\nThis left room for Jacksboro shooters, but early they were not knocking shots from the perimeter.\nNocona’s offense kept up the good pace and shooting in the second quarter, making three 3’s to take a 29-19 lead into halftime. Jacksboro was able to get a little bit more of the offense going by force as they were frustrated by the tight zone. They did make one 3 to break the ice and set the tone for the second half.\nThe third quarter slowed down to a crawl as both teams struggled offensively. It was the type of game that favored Jacksboro as they cut into the lead. The Lady Indians still led 33-28 heading into the fourth quarter, but trouble was on the horizon.\nTo read more, pick up a copy of the weekend edition of the Bowie News.",
    "source_domain": "bowienewsonline.com",
    "title": "Lady Indians run out of steam against Jacksboro",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/02/lady-indians-run-out-of-steam-against-jacksboro/"
}