{
    "authors": [],
    "date_download": "2018-02-03 00:03:26+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F02%2Fgroundhog-saw-his-shadow-more-winter%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2017/01/groundhog-day-for-web.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "PUNXSUTAWNEY, PA. – The results of Groundhog Day 2018 are in: According to legend, we’re in for six more weeks of winter because Punxsutawney Phil saw his shadow predicting six more weeks of winter.\nThe Pennsylvania groundhog isn’t the only weather-predicting rodent in this quirky American tradition, but he is the most famous. And according to the Punxsutawney Groundhog Club, his opinion is the only one that matters.\nAt 7:25 a.m. Eastern time on a hill outside Punxsutawney, Pa., known as Gobbler’s Knob, the seemingly immortal Phil Phil — the same rodent who launched the tradition in 1887, if you believe his handlers — looked for his shadow.\nFlipping a coin might be as accurate as Phil. Since 1988, the groundhog was “right” 14 times and “wrong” 16 times. In other words, only 14 times did the national average temperature for the remainder of February match what would be expected based on what the groundhog predicted.\nInformation from the The Punxsutawney Groundhog Club’s Inner Circle\nThe rodent emerged from his lair to the cheers of thousands in the crowd. Those cheers turned to groans after the animal’s weather forecast, which comes amid a winter that has brought record-breaking freezing temperatures across the U.S. — not to mention a powerful winter storm known as a “bomb cyclone.”\nLegend has it if a furry rodent casts a shadow on Groundhog Day, Feb. 2, expect six more weeks of winter-like weather. If not, expect spring-like temperatures. Last year, the furry rodent “predicted” six more weeks of winter.",
    "source_domain": "bowienewsonline.com",
    "title": "Groundhog saw his shadow, more winter",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/02/groundhog-saw-his-shadow-more-winter/"
}