{
    "authors": [],
    "date_download": "2018-07-04 09:36:10+00:00",
    "date_modify": null,
    "date_publish": "2018-07-03 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F07%2Fmontague-county-fireworks-shows%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2018/03/legend-bank-loans.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Montague County will celebrate July 4th with fireworks’ shows on the actual holiday.\nThe Nocona Lions Club presents its 51st year of fireworks on July 4 at Weldon Robb Park on Lake Nocona. Phil Staley, member of the Lions, said each year they seem to grow and gets brighter than ever.\nThe Lions ask that citizens do not shoot their personal fireworks off in Weldon Robb Park, but go to Benton Park or Boone Park to avoid any safety issues with the larger fireworks’ show. Fireworks start about dark.\nThe annual decorated boat floatilla invites participants to take part from 2 to 4 p.m. Boats begin lining at Weldon Robb Park (formerly jaycee Park) and travel around the lake showing their patriotic colors. There is no cost, it’s just for fun.\nSaint Jo’s July 4th spectacular begins early in the day with Old Jo’s Firecracker 5K Run. The run starts at 8 a.m. Register at getmeregistered.com. There is a variety of age brackets for both male and female for this certified track run. Chip timing will be available.\nThere will be onsite registration starting at 6:30 a.m. on the day of the race. Chicken will be from 6:30 to 8 a.m. at the gazebo on the town square.\nThe fireworks show will be at Boggess Park at dark around 9 p.m. Guests can bring their lawn chairs and blankets for a fun evening.\nThere will be live music, free watermelon served by the Montague County Child Welfare Board and a concession stand starting at 6 p.m.\nThe Saint Jo Chamber of Commerce will have its popular homemade ice cream contest the July 4th Freeze-Off at 7:30 p.m. Teams of one to four people are invited to create their favorite recipe and offer it up to the judges.\nWinners chose by popular vote and an independent pane of judges will take the cold goodness and then announce the winners. First place wins $100, second place wins $50 and third wins $25. To register call Randie Burton at 995-2964.",
    "source_domain": "bowienewsonline.com",
    "title": "Montague County fireworks shows",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/07/montague-county-fireworks-shows/"
}