{
    "authors": [],
    "date_download": "2017-06-15 01:27:14+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2017%2F06%2Fhigh-school-football-longhorns-open-with-notre-dame%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2016/07/patterson-sky-box.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By ERIC VICCARO\nsports@bowienewsonline.com\nThe Forestburg High School football team will have an interesting quirk in its 2017 schedule.\nSee, the Longhorns play a rare football home-and-home with Wichita Falls Notre Dame as part of this year’s slate.\nNotre Dame visits Forestburg for the season-opener on Sept. 1, and the teams play each other again in Wichita Falls on Sept. 29.\n“It’s different to play the same team twice during the regular season,” said first-year head coach Thomas Tritz. “But, I think it’s going to be a benefit for us.”\nThe reason why Forestburg will play Notre Dame twice is that Fort Worth Nazarene, of Crowley, dropped the Longhorns from their schedule.\nForestburg has three straight games at home to open the schedule, with Strawn on Sept. 8 and Weatherford Christian Sept. 15. Read more in the June 14 Bowie News.\nFOOTBALL\nChampionship Trails\nAugust\nScrimmages\nAug. 18, at Fort Worth Covenant Classical, 6 p.m.; 25, Tioga, 7 p.m.\nSeptember\nRegular Season\n1, Wichita Falls Notre Dame; 8, Strawn; 15, Weatherford Christian; 22, at Gordon; 29, at Wichita Falls Notre Dame\nOctober\n6, at Savoy; 13, at Newcastle (*); 20, Saint Jo (^); 27, Idle\nNovember\n3, at Bryson; 10, Gold-Burg\nEditor’s Note: All regular-season games will feature a 7:30 p.m. kickoff.\n* District 12-1A-I opener\n^ Homecoming game.\nNew Forestburg head football coach and athletic director Thomas Tritz, who was most recently at Wellman-Union. (News photo by Eric Viccaro)",
    "source_domain": "bowienewsonline.com",
    "title": "HIGH SCHOOL FOOTBALL: Longhorns open with Notre Dame",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2017/06/high-school-football-longhorns-open-with-notre-dame/"
}