{
    "authors": [],
    "date_download": "2017-02-15 02:42:03+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2017%2F02%2Fthe-st-valentines-day-massacre%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2016/08/083114LemonHerbChickenPhoto-326x245.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "George “Bugs” Moran was a career criminal who ran the North Side gang in Chicago during the bootlegging era of the 1920s. He fought bitterly with “Scarface” Al Capone for control of smuggling and trafficking operations in the Windy City. Throughout the 1920s, both survived several attempted murders. On one notorious occasion, Moran and his associates drove six cars past a hotel in Cicero, Illionis, where Capone and his associates were having lunch and showered the building with more than 1,000 bullets.\nA $50,000 bounty on Capone’s head was the final straw for the gangster. He ordered that Moran’s gang be destroyed. On February 14, a delivery of bootleg whiskey was expected at Moran’s headquarters. But Moran was late and happened to see police officers entering his establishment. Moran waited outside, thinking that his gunmen inside were being arrested in a raid. However, the disguised assassins were actually killing the seven men inside.\nThe murdered men included Moran’s best killers, Frank and Pete Gusenberg. Reportedly Frank was still alive when real officers appeared on the scene. When asked who had shot him, the mortally wounded Gusenberg kept his code of silence, responding, “No one, nobody shot me.”\nThe St. Valentine’s Day Massacre actually proved to be the last confrontation for both Capone and Moran. Capone was jailed in 1931 and Moran lost so many important men that he could no longer control his territory. On the seventh anniversary of the massacre, Jack McGurn, one of the Valentine’s Day hit men,was killed him in a crowded bowling alley with a burst of machine-gun fire.\nMcGurn’s killer remains unidentified, but was likely Moran, though he was never charged with the murder. Moran was relegated to small-time robberies until he was sent to jail in 1946. He died in Leavenworth Federal Prison in 1957 of lung cancer.\n– History.com Staff",
    "source_domain": "bowienewsonline.com",
    "title": "The St. Valentine’s Day Massacre",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2017/02/the-st-valentines-day-massacre/"
}