{
    "authors": [],
    "date_download": "2017-02-15 02:41:59+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2017%2F02%2Ffreida-ann-gatlin%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2017/02/cali-lilly.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Freida Ann Gatlin\nJune 6, 1918 – February 11, 2017\nBOWIE – Freida Ann Gatlin, 98, passed away on Feb. 11, 2017 in Bowie, TX.\nThe family will receive friends from 6-8 p.m. Feb. 24, 2017 at The White Family Funeral Home.\nA funeral service will be at 1:30 p.m. Feb. 25 at First Baptist Church of Bowie. Burial will follow at Brushy Cemetery.\nFreida was born June 6, 1918 in Atoka, TN to John and Vivian (Miller) LaCoste. She married William Lawrence Gatlin on Jan. 23, 1938 in Marion, AR. They were blessed with four children. She was a devoted wife, mother and grandmother.\nFreida was a member of the First Baptist Church for 31 years and a member of the Esther Sunday School class. She was also a member of the Al-Alanon, AL-Ateen and the Texas Education Extension.\nShe is preceded in death by her parents, John and Vivian LaCoste; husband, William Gatlin; sisters, Margaret McDowell, Francis Scott and Ella Brewer; grandsons, Steven Anthony Lavelle and William Todd Gatlin; and great granddaughter, Angel Gatlin.\nFreida is survived by her children, Mariam Vance and husband Ray, Fremont, CA, Evelyn Mizer and husband Bill, Roanoke, Vivian Younker and husband Bob, Bowie and Bill Gatlin and wife Carol, Bowie; 13 grandchildren; 32 great grandchildren; 14 great-great grandchildren; and numerous nieces and nephews.\nArrangements have been entrusted to The White Family Funeral Home of Bowie.\nPaid publication",
    "source_domain": "bowienewsonline.com",
    "title": "Freida Ann Gatlin",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2017/02/freida-ann-gatlin/"
}