{
    "authors": [],
    "date_download": "2018-05-30 21:50:59+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F05%2Fbowie-sports-camps-next-week%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2018/05/Bowie-Logo.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bowie High School will be having its football and softball camps next week for kids.\nFor football, the camp is open to kids incoming second through ninth grades.\nThe camp will start on June 4 and go through June 7. The camp time will be from 9 a.m. to 11:30 a.m. at the high school football stadium.\nThe cost of the camp will be $65. There will be a $10 discount for each additional child in a family signed up.\nThe goals of the camp will be to learn the fundamentals of football, become a better a player and have fun.\nActivities will include: Agility drills, passing drills, receiving drills and defensive drills. There also will be a Punt, Pass and Kick Contest, 7-on-7 touch football and a 40-yard dash.\nThe Bowie football staff will be giving instruction. Campers will receive a T-shirt.\nParents can sign their kids up on the first day.\nThe softball camp will also be next week.\nThe camps will start at 8:30 a.m. and go to 11:30 a.m. from June 5 to June 7 at the high school softball field.\nIncoming second through ninth graders will be allowed to attend.\nThe focus for campers will be an emphasis on hitting, bunting, throwing, infield, outfield, base-running, pitching, and catching for the girls.\nThe high school staff will be giving instruction.\nDuring breaks, drinks and snacks will be available to buy.\nCampers who sign up by June 1 are guaranteed a T-shirt.\nThe cost for campers will be $60, with $10 off for each additional camper. School employees only have to pay $40.\nSign ups will be available on the first day of camp as well.\nChecks should be made payable to Coach Brant Farris.",
    "source_domain": "bowienewsonline.com",
    "title": "Bowie sports camps next week",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/05/bowie-sports-camps-next-week/"
}