{
    "authors": [],
    "date_download": "2017-02-15 02:42:01+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2017%2F02%2Ffive-makeup-mistakes-that-make-you-look-older%2F.json",
    "image_url": "http://myfashionchronicles.com/wp-content/uploads/2013/03/5-Makeup-Mistakes-that-Make-You-Look-Older2.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By My Fashion Chronicles\nWhether your 25, 40, 50, or older we all want to stay looking fabulous! There is nothing wrong with aging! That’s the beauty of life, we get old, it happens. But many people don’t realize maybe it’s not your age that’s making you appear older; it could be the way you are applying your makeup! By changing a few of these makeup mistakes, you can appear more youthful and not to mention you will look healthier and more natural!\nYour Eyebrows Are Too Dark!\nChoosing the right color for your eyebrows is key. Many of us don’t realize that choosing the wrong color pencil for your brows can make you appear older and look unnatural. Never choose an eyebrow pencil that is darker than your eyebrows. You want to choose a shade that’s lighter than your natural brow color; you will see a huge difference! Image from About Style.\nDark Eye Makeup\nWith darker eye makeup it will completely transform your age. If you are trying to achieve a younger look, stick to neutral colors for your eyes. Use your natural beauty to your advantage! By keeping things natural and light it will help achieve a flawless look! Image from Polyvore.\nDark Circles Under Your Eyes\nBe sure that as you add mascara and eyeliner to the bottom of your eyes, that you are not leaving smudges and darkening the skin under your eyes. You can use a concealer (green or yellow tones counter the dark circles under your eyes) to brighten your eyes and will take away the “saggy eye” effect. This will make them bigger and brighter creating a more youthful look.\nMatte Powders and Foundation\nYounger looking skin reflects light, using powders and foundations that are matte will make your face appear dull. Matte powders (all powders in general) will fall into the creases of your face making them appear like wrinkles. So try and find products that have light defusing pigments to help your skin look glowing and bright! Try using translucent powder in place of your other powder. It should give you just enough glow to look really pretty and healthy! This Laura Mercier translucent powder is one of my favorites.\nNo Blush And No Contouring\nBy applying blush to your cheeks it will help give your face a slight lift, and will meet 2 new friends: your cheekbones. Ignoring your cheekbones is a makeup travesty. If you don’t use blush, you may have a washed out look taking away that flawless glow. Give some life to those cheeks and start-using blush! And if you REALLY want to meet your face’s full potential, you should do some highlighting and contouring, which will help give your face more shape by defining your bone structure. It is amazing what you can do with contouring and highlighting. It is the best way to accentuate your beautiful features, while minimizing the features that you don’t love. Try it out and see for yourself! Contouring is MY FAVORITE! Image from The Skinny.",
    "source_domain": "bowienewsonline.com",
    "title": "Five makeup mistakes that make you look older",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2017/02/five-makeup-mistakes-that-make-you-look-older/"
}