{
    "authors": [],
    "date_download": "2018-05-30 21:51:23+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F05%2Fthe-greatest-quarterback-ever-is%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2018/05/Tom-Brady-Web.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In football, quarterback is arguably the most important position on the field. A great one can raise the ability of everyone on offense and is the de facto leader. While the position has always been important, with the rise of the passing game being exploited the position seems to have doubled in importance.\nAt the highest level of the NFL, it has been argued in this decade the only way a team can win a Super Bowl is with a quarterback who is deemed elite (Although backup quarterback Nick Foles threw a wrench into this thinking in the last Super Bowl).\nHow do we know when a quarterback is elite? When we see it, because that is vague enough for sports fans to argue quarterbacks merits.\nWith the importance of the position weighing so heavily in fans minds, the quarterback position is largely connected with and measured in championships.\nOtto Graham\nThe standard was set way back in the 1950s, before the NFL was huge, when Otto Graham of the Cleveland Browns (hard as that is to believe) led his team 10 championship games all 10 years he played and won seven of them.\nFour of those wins came in another league, but with four of the teams from that league later joining the NFL they had plenty of talent themselves, Graham is regarded as the greatest winner in NFL history though most modern fans have no idea who he is.\nJohnny Unitas\nThe next quarterback thrown in the argument is Johnny Unitas, who played from 1955-1973, mostly for the Baltimore Colts.\nWhile not as big of a winner, he did win championships in 1958 and 1959 and Super Bowl V.\nThe 1958 championship is arguably one of the most important games in the history of the league, as the Colts beat the New York Giants 23-16 in the league’s first ever overtime game. It was given the name of “The Greatest Game Ever Played.”\nEven with popular quarterbacks in the 1970s like Terry Bradshaw and Roger Staubach taking the NFL to another level of popularity thanks to television, Unitas was still the standard in most observer’s minds.\nJoe Montana\nIn the 1980s came Joe Montana from the San Francisco 49ers. Along with his coach Bill Walsh, they stepped up the sophistication of the passing game even more with their famed West Coast offense.\nIt relied even more on the timing of the quarterback and receivers, but focused on short routes that, in Walsh’s mind, could make up for his team’s weakness in running the ball, at least initially. Every modern day passing offense takes standard elements from that West Coast offense.\nWhile Montana did not have prototypical size or arm strength, his accuracy, touch, improvisation with his feet and uncanny ability to lead his team back on the biggest of stages made him magical.\nHis famed late drives to win against the favored Cowboys in the 1982 NFC Championship game and his 92-yard drive to win Super Bowl XXIII are the stuff of NFL legends. His usual calm composure when he played made everything he did seem effortless and in a term, magical.\nWhile he played on great teams, Montana always had and seemed to play great when his team needed him to.\nHis four Super Bowl wins in the 1980s, tying him with Bradshaw for the most, along with his three Super Bowl MVPs unquestionably made Montana the greatest modern-day winner in league history at the quarterback position. No one had ever won more titles the way he had and no one did for the next few decades.\nTom Brady\nIn the early 2000s, a dynasty led by an unheralded quarterback seemed to threaten this as the New England Patriots won three Super Bowls in four seasons by the middle of the decade.\nThe famous Tom Brady was a sixth round pick in the year 2000 and was the seventh quarterback taken. The Patriots already had a franchise quarterback in Drew Bledsoe and had just signed him to a long and rich contract extension.\nBledsoe getting hurt in the second game of the 2001 season gave Brady his chance and he led the Patriots on an unprecedented season. They went 11-5 and won a famous divisional playoff game against the Oakland Raiders, upset the Pittsburg Steelers in the AFC Championship game and then upset the “Greatest Show on Turf” St. Louis Rams in the Super Bowl that featured a now famous drive by Brady to set up the game winning field goal on the final play.\nTheir second Super Bowl two years later again featured Brady coming through with a drive late in the game to set up a game winning field goal, almost on the final play, to win the Super Bowl against the Carolina Panthers.\nWhile not as dramatic, their third Super Bowl win the next year against the Philadelphia Eagles did feature a good game from Brady, although it was his first and so far only Super Bowl win he was The talk died down as Brady did not have his best game, mostly due to facing a ferocious pass rush. He had failed where Montana never had on the biggest stage.\nA missed season due to injury and a couple of playoff exits the next three years kept him in the conversation for the best quarterback in the league, but best ever talks were put on the backburner, even as Brady started to become more and more responsible for the Patriots offensive success as he put up the best numbers of his career.\nIn 2012, the Patriots again made it to the Super Bowl and were favored to win against the Giants. Again, a ferocious pass rush by the Giants limited Brady enough so the Giants could win in another upset. With two losses, talks were even more put to bed.\nBrady and the Patriots continued to stay relevant the rest of this decade and then some. After two years of losses in the AFC Championship game, Brady and the Patriots made it back to the Super Bowl in 2016 against the defending champions the Seattle Seahawks.\nLooking like nothing would slow him down this past season even as he turned 40, Brady led his team back to the Super Bowl for an outrageous eighth time since the turn of the century.\nHe faced the Eagles and in one of the most explosive offensive showings in Super Bowl history, one in which Brady broke not only the Super Bowl record, but the postseason record by passing for 505 yards, the Eagles won 41-33. The loss bumps his Super Bowl record to 5-3 and leaves some people questioning what they know or how to evaluate just a year after proclaiming him the new “best ever.”\nThe only people who care about this stuff are hard core sports nerds. Players who are named the greatest of all time do not get another trophy.\nSo why do we sports fans do it? Like every generation, we want to believe our culture, our music, our movies, our sports stars were the best that was and will ever be. Dismissing the younger and older generations and what they lived through is what gives us validation we lived during special times.\nDo you agree with my choice for the greatest quarterback of all time? No? Who do you think it is? Click the link below to take our survey and share your thoughts, whether your agree or disagree.\nhttps://www.surveymonkey.com/r/783TL6S",
    "source_domain": "bowienewsonline.com",
    "title": "The greatest quarterback ever is…",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/05/the-greatest-quarterback-ever-is/"
}