{
    "authors": [],
    "date_download": "2018-02-03 00:02:11+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F02%2Fhelen-beth-worley-curry%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2018/02/OBIT-curry-293x300.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Helen Beth (Worley) Curry\nJuly 26, 1931 – January 31, 2018\nBOWIE – Helen Beth (Worley) Curry fondly known as “Becky,” 86, passed away on Jan. 31, 2018 in Bowie, TX.\nA memorial service will be at 11 a.m. Feb. 3 in the chapel of The White Family Funeral Home of Bowie.\nBecky was born July 26, 1931, in Bowie to Dave and Erle Worley. She was a retired elementary school teacher, serving in the Graham Schools as well as the Irving School District.\nBecky was a Bowie High School graduate in the class of 1948 where she participated in the Jackrabbit band and where she received the honors from her classmates of once being named “Miss Congeniality” as well as “Most Beautiful.” She loved her years at BHS where she met many life-long friends. One of those special classmates was Roy Curry, whom she later married.\nShe was a faithful wife and loving mother of two children, a daughter, DiAnne and a son, Bronc. After they were in school, Becky made the decision to go back to school herself. She graduated from Midwestern State University, cum laude, where she earned her teaching degree.\nFollowing her retirement, Becky and Roy moved back to Bowie and became involved in various community interests such as delivering Meals on Wheels, supporting the Bowie Library, as well as supporting the education of young people through their interest in the Bowie Educational Foundation. Becky participated in Maids and Matrons, Precepts Bible Studies and various bridge clubs.\nBecky is preceded in death by her husband, Roy L. Curry, Sr.; her parents; brothers, Dave and Bob Worley and a sister, Mary Jo Carlisle.\nShe is survived by her sister, Kathryn “Bunny” Sanders, Bowie; daughter, DiAnne and husband Dr. James Dunn, Bowie; son, Bronc Curry and wife Lisa, Grand Prairie; and grandsons, James W. Dunn and wife, Jennifer, and Daniel W. Dunn.\nIn lieu of flowers, donations may be made to The Bowie Educational Foundation at P.O. Box 992, Bowie, Texas 76230-0992.\nArrangements entrusted to The White Family Funeral Home of Bowie.\nPaid publication",
    "source_domain": "bowienewsonline.com",
    "title": "Helen Beth (Worley) Curry",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/02/helen-beth-worley-curry/"
}