{
    "authors": [],
    "date_download": "2018-02-04 00:11:23+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F02%2F2005-gonzales-becomes-first-hispanic-u-s-attorney-general%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2016/07/patterson-sky-box.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "On February 3, 2005, Alberto Gonzales won Senate confirmation as the nation’s first Hispanic attorney general despite protests over his record on torture.\nThe Senate approved his nomination on a largely party-line vote of 60-36, reflecting a split between Republicans and Democrats over whether the administration’s counterterrorism policies had led to the abuse of prisoners in Iraq and elsewhere. Shortly after the Senate vote, Vice President Dick Cheney swore in Gonzales as attorney general in a small ceremony in the Roosevelt Room at the White House. President Bush, who was traveling, called to congratulate him.\nGonzales was born in 1955 in San Antonio, Texas, the son of migrant workers and grew up in a small, crowded home in Houston without hot water or a telephone. He joined the U.S. Air Force in 1973 after graduating high school. Following a few years of service, Gonzales attended the U.S. Air Force Academy.\nAfter leaving the military, Gonzales attended Rice University and Harvard Law School before Bush, then governor of Texas, picked him in 1995 to serve as his general counsel in Austin and in 2001 brought him to Washington as his White House counsel. In this new role, Gonzales championed an extension of the USA Patriot Act.\nAfter Gonzales became attorney general, he faced scrutiny regarding some of his actions, most notably the firing of several U.S. attorneys and his defense of Bush’s domestic eavesdropping program. The firings became the subject of a Senate Judiciary Committee in 2007. Concerns about the veracity of some of his statements as well as his general competency also began to surface.\nDemocrats began calling for his resignation and for more investigations, but President Bush defended his appointee, saying that Gonzales was “an honest, honorable man in whom I have confidence,” according to an Associated Press reportfromApril.\nA few months later, however, Gonzales decided to step down.\nOn August 27, he gave a brief statement announcing his resignation (effective September 17), stating that “It has been one of my greatest privileges to lead the Department of Justice.” He gave no explanation for his departure. In his resignation letter, Gonzales simply said that “. . . this is the right time for my family and I to begina new chapter in our lives.”\nGonzales and his wife Rebecca have three sons.\nSource: www.history.com",
    "source_domain": "bowienewsonline.com",
    "title": "2005 Gonzales becomes first Hispanic U.S. attorney general",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/02/2005-gonzales-becomes-first-hispanic-u-s-attorney-general/"
}