{
    "authors": [],
    "date_download": "2018-05-30 21:50:50+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fbowienewsonline.com%2F2018%2F05%2F1997-jonathan-levin-is-tortured-and-killed-by-his-former-student-2%2F.json",
    "image_url": "http://bowienewsonline.com/wp-content/uploads/2018/03/legend-bank-loans.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jonathan Levin, a popular 31-year-old English teacher, is stabbed and shot to death in his Upper West Side apartment in New York City. The son of Time Warner chairman Gerald Levin, Jonathan was known by many to be wealthy. When he did not show up for work, investigators searched his apartment and found his lifeless body bound to a chair with duct tape. Levin’s bankcard was missing from his wallet, and $800 had been removed from his account around the time that he was killed.\nPolice learned from Levin’s answering machine tape that Corey Arthur, a former student in Levin’s remedial English class at William H. Taft High School in the Bronx, called Levin on May 30 to arrange a meeting. Apparently, Arthur and his accomplice, Montoun Hart, tortured Levin with a kitchen knife in order to get him to tell them his debit card code. They turned on the vacuum cleaner and stereo to cover up his screams.\nArthur, arrested a week after the murder, first claimed that he had been at Levin’s apartmentsmoking crackwhen two other men came in and killed him. However, his story lost its credibility at trial when his fingerprints were found on the duct tape. Even still, Arthur denied being the one who pulled the trigger of the fatal shot.\nArthur was found guilty of second-degree murder and received 25 years to life in prison. Hart, despite his 11-page signed confession, was acquitted after convincing jurors that the confession had been coerced out of him when he was drunk.\nSource: www.history.com",
    "source_domain": "bowienewsonline.com",
    "title": "1997 Jonathan Levin is tortured and killed by his former student",
    "title_page": null,
    "title_rss": null,
    "url": "http://bowienewsonline.com/2018/05/1997-jonathan-levin-is-tortured-and-killed-by-his-former-student-2/"
}