{
    "authors": [],
    "date_download": "2017-12-12 05:25:17+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 17:51:38",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fdisgusting-black-woman-pleads-guilty-beating-disabled-white-teen-live-camera-gets-no-prison-time%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-4.png",
    "language": "en",
    "localpath": null,
    "maintext": "The Chicago woman who live streamed the racially charged beating of a white Chicago teen with mental disabilities, pleaded guilty to hate crimes and was sentenced to just 4 years probation this Friday.\nBrittany Covington, 19, has been in custody since her arrest in January.\nCook County Circuit Judge William Hooks called the event “horrific” and banned Covington from using social media for her 4 years of probation. Covington was also banned from communicating with the other two co-defendants, and she has been ordered 200 hours of community service.\nHooks told Covington he could have imposed a prison sentence but added, “I’m not sure if I did that you’d be coming out any better.”\nI disagree, and I’m sure the parents of that disabled child, and other families would agree. This disabled child was lured from school to an empty apartment where he could be tied up and brutalized on camera just because he was white, this certainly calls for jail time. This 19 year old girl should not be allowed back in society if this is the type of damage she is capable of causing.\nShe clearly wasn’t thinking about the repercussions of her actions in the slightest if she was live streaming the crime on Facebook, which is scary, a young woman who is willing to commit a crime this heinous should be removed from society until she can learn to live with others.\nThree others were charged in the incident: alleged ringleader Jordan Hill, 19, as well as Tesfaye Cooper, 19, and Covington’s sister, Tanishia, 25. Their cases are still pending.\nAll of these young adults deserve to spend time behind bars for this disgusting act of violence and racism. There is clearly a deep seeded anger here for the white population that isn’t going to be solved with 4 years off Facebook, these young adults need help, and need to be removed from society.",
    "source_domain": "americannews.com",
    "title": "DISGUSTING: Black Woman Pleads Guilty For Beating Disabled White Teen Live On Camera, Gets No Prison Time",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/disgusting-black-woman-pleads-guilty-beating-disabled-white-teen-live-camera-gets-no-prison-time/"
}