{
    "authors": [],
    "date_download": "2017-02-15 04:47:26+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 04:04:16",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Falert-border-patrol-make-chilling-announcement-caught-crossing-border%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-14-at-5.43.45-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "According to recent reports, the U.S. Customs and Border Protection and U.S. Border Patrol agents just apprehended two individuals who were attempting to sneak across the border over the weekend—but they weren’t who you might expect.\nCBP confirmed to Breitbart Texas that one Iraqi national and one Egyptian national were detained after illegally entering the country through Mexico. Though CBP did not confirm if the two criminals were men, another source implied they were both males.\nBorder Patrol released a statement confirming agents from Lordsburg Station apprehended the two individuals at 2:15 PM along Arizona State Route 80.\n“Record checks and interviews produced no derogatory information and the two individuals were placed into removal proceedings,” the statement said.\nThe area of the border where the two foreign nationals are believed to have crossed does not have barriers, Breitbart reports. The area south of the border from where the individuals were apprehended is notoriously controlled by criminal groups working for the Sinaloa Federation or cartel. It is highly unlikely the two men from the Middle East were traveling into the United States without the cartel’s consent.\nAt this point, we cannot confirm the intentions of these two individuals, but we do know they were breaking the law by entering the country. Whether they had harmful intent or not, this is just another example of why we need a border wall.\nWhat do you think? Do you support Trump’s wall?",
    "source_domain": "americannews.com",
    "title": "ALERT: Border Patrol Make Chilling Announcement About Who They Caught Crossing The Border",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/alert-border-patrol-make-chilling-announcement-caught-crossing-border/"
}