{
    "authors": [],
    "date_download": "2017-12-11 16:59:11+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 13:44:11",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Farmed-robber-threatens-clerk-gunpoint-clerks-gaze-triggers-unbelievable-reaction-video%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-2.png",
    "language": "en",
    "localpath": null,
    "maintext": "An armed robber attempt to rob a Florida Walgreens was thwarted when he ran into some intense anti-theft technology that he was clearly not expecting.\nThe Broward County Sheriff’s Office said that an unidentified robber walked into the Walgreens at 1751 Bonaventure Blvd at around 2.30pm on Monday.\nThe man’s face was covered by a red hood and a ball cap and he casually walked up to the counter after grabbing a few items off the shelf.\nThe store clerk started to ring up the transaction and as he was doing so the man in the red hoodie pulled out a pistol and pointed it at the clerk.\nUnfortunately for the hooded thief, the ‘stoic clerk stood in quiet resistance’, according to a statement from the sheriff’s department.\n‘He didn’t speak. He didn’t move. He simply stared back at the armed man, almost expressionless.’\nThe man in the red hoodie repeatedly demanded the money in the register but the cashier wouldn’t budge, he just stood and stared at the man with the gun.\nWatch this video and see just how insane this man’s reaction is to having a gun in his face.\nBroward County Sheriff’s Office spokesperson, Gina Carter, said that although the situation turned out for the best this time, authorities say its safer to comply with an armed assailant.\n‘Even this kind of quiet resistance is dangerous, but luckily for this clerk, it worked out in his favor,’ she added.\nThis cashier must either have a death wish, or has nerves of steel because that was nerve wrecking for me to watch, I can’t imagine being there.\nThe suspect is being described as a 5 foot 9, African-American male in his early 20′ weighing around 150 pounds.\nBoward County authorities believe he may be connected to similar robberies in the area.\nAnyone with information on this crime is urged to call Broward Crime Stoppers at 954-493-TIPS.",
    "source_domain": "americannews.com",
    "title": "Armed Robber Threatens Clerk At Gunpoint, But Clerk's Gaze Triggers An Unbelievable Reaction [VIDEO]",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/armed-robber-threatens-clerk-gunpoint-clerks-gaze-triggers-unbelievable-reaction-video/"
}