{
    "authors": [],
    "date_download": "2017-12-12 05:25:21+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 18:02:18",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fwapo-reporter-publishes-photo-empty-arena-trump-rally-apologizes-trump-blasted%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-84.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Washington Post reporter posted fake pictures showing an empty venue for a Trump rally, but in reality the venue was packed to the rafters, at least he came forward to apologize after embarrassing himself.\nDave Weigel, the Washington Post reporter in question took a picture of the venue hours before Trump had arrived in order to discredit the event, but he was quickly called out by the POTUS, to which, Weigel quickly responded with an apology.\nWeigel responded minutes after a tweet from Trump, who said he had “put out a phony photo of an empty arena hours before I arrived.”\nWeigel said he took the tweet down after Daily Mail political editor David Martosko told him he had gotten it wrong.\n“Sure thing: I apologize. I deleted the photo after @dmartosko told me I’d gotten it wrong. Was confused by the image of you walking in the bottom right corner,” he tweeted.\nThis exchange, Trump calling out the reporter and the reporter apologizing, came just 24 hours after Trump bashed CNN and ABC for putting out incorrect reporting that they later apologized for.\nTrump referred to ABC News correspondent Brian Ross as a “fraudster” at the rally, a week after Ross falsely reported that former national security adviser Michael Flynn had directed Trump to contact Russian officials during the campaign.\nABC later corrected the report to say that the president directed Flynn to contact Russia after he was elected.\n“They took this fraudster from ABC, they suspended for a month. They should have fired him for what he wrote. He drove the stock market down 350 points in minutes,” the president said Friday. “I said to everybody, get yourself a lawyer and sue ABC News.”\nYou can’t just make absurd claims and wait until you get called out on it, then just apologize and hope everything is back to normal.",
    "source_domain": "americannews.com",
    "title": "WaPo Reporter Publishes Photo Of Empty Arena At Trump Rally, Apologizes After Trump Blasted Him",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/wapo-reporter-publishes-photo-empty-arena-trump-rally-apologizes-trump-blasted/"
}