{
    "authors": [],
    "date_download": "2017-08-14 07:38:06+00:00",
    "date_modify": null,
    "date_publish": "2017-08-13 18:28:50",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fdems-struggling-find-direction-everything-points-barack-obama-preparing-political-comeback%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/obama-comeback.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Since midterms are coming up soon, the Democratic party are being evaluated and it seems like they are in need of some assistance. Barack Obama might be just the guy to help.\nThe Hill reports that aides to Obama called it a “delicate dance” as he will try to balance his good name among liberals so that he is not the first thing they think of when casting their votes.\nObama is focused on fundraising to help the party rebuild after losing over 1,000 seats at the federal and state level.\nThe Hill in July were told that Obama has met with DNC Chairman Tom Perez along with other Democratic superiors to help with the “future of the Democratic Party.”\n“He’ll tread lightly because he is not going to be the face of the party when it actually counts in 2020 and 2024,” Julian Zelizer, a Professor of History and Public Affairs at Princeton University said to The Hill.\nHe continued, “So the extent to which he would emerge and speak to a wide range of issues would preclude the emergence of someone else. They must find a standard-bearer for future elections, and I think he can at least in the short term suck up all the available oxygen.”\nSince leaving the Executive Branch, Obama has been pretty straightforward at times.\nThe former president gave his public support on “National Gun Violence Awareness Day” on June 2 by expressing “let your voice be heard and show your commitment to reducing gun violence.”\nWhile his signature legislation is being fought on Capitol Hill, Obama let Americans know that he understands “repealing and replacing the Affordable Care Act has become a core tenet of the Republican Party. Still, I hope that our Senators, many of whom I know well, step back and measure what’s really at stake.”",
    "source_domain": "americannews.com",
    "title": "Dems Struggling To Find Direction… Everything Points To Barack Obama Preparing His Political Comeback",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/dems-struggling-find-direction-everything-points-barack-obama-preparing-political-comeback/"
}