{
    "authors": [],
    "date_download": "2017-12-12 05:25:15+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 18:11:14",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Ftrump-doesnt-fear-wrath-god-says-jerry-brown%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-85.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "California Gov. Jerry Brown (D) says President Trump‘s stance on climate change demonstrates that he does not appear to fear the “wrath of God” or have any regard for the “existential consequences” of his environmental policies.\nNot true, Trump’s job is just to worry more about worldly consequences for the citizens of America. Trump wisely didn’t back us into a corner where we have promised other countries a certain output of fossil fuels, so we basically have capped our economic potential.\nThe United States is the biggest economy in the world, and has the most responsibilities of any other country in the world, so to hamstring our country by promising that we will only produce so much, puts us in a bad position.\n“I don’t think President Trump has a fear of the Lord, the fear of the wrath of God, which leads one to more humility … this is such a reckless disregard for the truth and for the existential consequences that can be unleashed,” Brown said in an interview on CBS’s “60 Minutes,” which aired on Sunday.\nBrown, who studied to become a Jesuit priest prior to entering politics, has been a vocal critic of the Trump administration.\nHis comments come in the wake of massive wildfires in Southern California that are raging out of control and destroying thousands of acres of property.\nBrown is clearly trying to draw the conclusion that global warming is responsible for the wildfires of Southern California and that Trump isn’t interested in dealing with the situation, but thats not the case. Trump has declared a state of emergency in Southern California.\nThe order allows the Federal Emergency Management Agency to coordinate disaster relief efforts in the areas affected by the wildfires.\nNorthern California grappled with a series of wildfires earlier this year that took the lives of 44 people and resulted in billions of dollars of damage.",
    "source_domain": "americannews.com",
    "title": "Trump Doesn't Fear \"Wrath Of God\", Says Jerry Brown",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/trump-doesnt-fear-wrath-god-says-jerry-brown/"
}