{
    "authors": [],
    "date_download": "2017-02-15 04:47:26+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 04:05:47",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fhappening-trump-launches-massive-raids-illegals-scatter-like-roaches-look-caught%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-14-at-4.32.22-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "Officials from U.S. Immigration and Customs Enforcement conducted raids in at least 6 states this week, arresting illegal immigrants and providing a glimpse into what the country can expect from Trump’s “law & order” administration.\nThe raids reportedly took place in Georgia, Illinois, New York, California, North Carolina, and South Carolina. The criminals were arrested at their homes and workplaces. Rep. Joaquin Castro told the Washington Post that he talked to an official at ICE’s San Antonio office, confirming they had “launched a targeted operation in South and Central Texas as part of Operation Cross Check.”\n“People are panicking,” Atlanta immigration attorney Hiba Ghalib told the Post. “People are really, really scared.”\nRumors were circulating of ICE using checkpoints in Texas and North Carolina, though the agency calls these reports “dangerous and irresponsible.” The fact remains that if these people were not in our country illegally and breaking laws, they would have nothing to fear. David Marin, ICE’s field director in Los Angeles, told reporters that 75 percent of the 160 people detained in the operation in Los Angeles this week had felony convictions; the rest had felony convictions or were living here illegally.\n“Dangerous criminals who should be deported are being released into our communities,” Marin commented.\nICE officials also told NBC News that 200 criminal illegals had been arrested in Georgia and the Carolinas.\n“We’re talking about people who are threats to public safety or a threat to the integrity of the immigration system,” Department of Homeland spokeswoman Gillian Christensen told the Post.\nWhat do you think of the ICE’s crackdown on illegal immigration? Is this the kind of security our country needs?",
    "source_domain": "americannews.com",
    "title": "IT’S HAPPENING: Trump Launches Massive Raids, Illegals Scatter Like Roaches… Look Who They Caught",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/happening-trump-launches-massive-raids-illegals-scatter-like-roaches-look-caught/"
}