{
    "authors": [],
    "date_download": "2017-02-15 04:47:26+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 03:59:45",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fbreaking-geraldo-rivera-makes-shocking-announcement-say-goodbye%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-14-at-5.18.11-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "This week, Fox News contributor Geraldo Rivera gave viewers some shocking news: he would be resigning from his position as an associate fellow of Calhoun College at Yale University.\nRivera announced his decision after Yale revealed plans to rename the college because of former Vice President John C. Calhoun’s support of slavery. Calhoun was Vice President of the United States from 1825 to 1832. He was also a U.S. Senator and Secretary of State.\n“I made this decision because I think it is the right thing to do on principle,” Yale University President Peter Salovey said in a statement. “John C. Calhoun’s principles, his legacy as an ardent supporter of slavery as a positive good, are at odds with this university.”\nOver the weekend, Rivera took to social media to blame the school’s “intolerant insistence on political correctness” for his decision.\n“Resigned yesterday as Associate Fellow of #CalhounCollege at #Yale,” he tweeted. “Ben an honor but intolerant insistence on political correctness is lame.”\n“Slavery was abhorrent sin. Will #Yale students now petition to change name of #USA capital? #Washington was a slave holder as was #Jefferson,” Rivera continued. “To judge 200 yr old early 19th century historic figure by standards of the 21st century as #Yale is doing is more Orwellian than inspired.”\nWhat do you think of Rivera’s response? Do you agree with him?",
    "source_domain": "americannews.com",
    "title": "BREAKING: Geraldo Rivera Makes Shocking Announcement… Say Goodbye",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/breaking-geraldo-rivera-makes-shocking-announcement-say-goodbye/"
}