{
    "authors": [],
    "date_download": "2017-08-14 20:24:17+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 18:27:10",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fsix-major-companies-decided-boycott-trump-lets-boycott%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/Donald-Trump-Article-of-impeachment.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Of course when a career politician was running these six major companies had no problem sponsoring the 2012 GOP presidential convention. However, they have since retracted their support in 2016 when Donald Trump was nominated for the title.\nThe Hill revealed Wells Fargo, JP Morgan Chase, UPS, Motorola, Ford, and Walgreens have all refused to participate in last year’s GOP convention upon learning that Trump was to be the nominee. Although, they will never admit that this is the reason why they pulled out, it is quite obvious why the slap in the face occurred.\nTo make things even worse, Wells Fargo agreed to sponsor the Democratic convention’s host committee held in Philadelphia.\n“We are supporting the City of Philadelphia host committee given our significant community bank and team member presence,” stated Erika Reynoso, spokeswoman for Wells Fargo. “Our decisions around the host committees were determined late last year before either party determined the nominees. This is consistent with our past practices.”\nOther companies are retracting their support and turning their backs on our President. For example, Conservative Fighters reported that Heineken has shipped out their product in search of “a world without borders or barriers.”\nThe company has recently introduced this outrageous marketing strategy to sell their beer, take a look, “Here’s to an Open World: To a world without borders or barriers. To the belief that there’s more that unites us than divides us. To finding common ground. So raise a bottle with the person next to you. Because a stranger is just a friend you haven’t had a cold Heineken with yet. Open your world.”\nIronically the company is purposely ignoring countries such as Germany, France, and Sweden who have all previously supported the idea of open borders, even though this support has shown them an increase in violent crime and terrorism. Most Americans do not want to fear for their communities and polls show that 80% disapprove of sanctuary city policies, and 52% of voters are actually in support of the President’s temporary ban of refugees.\nSHARE this story if you are going to start boycotting these companies!",
    "source_domain": "americannews.com",
    "title": "Six Major Companies Decided To Boycott Trump… Let’s Boycott Them!",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/six-major-companies-decided-boycott-trump-lets-boycott/"
}