{
    "authors": [],
    "date_download": "2017-08-14 07:38:12+00:00",
    "date_modify": null,
    "date_publish": "2017-08-13 17:06:27",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fsenior-citizens-scary-announcement-medicare-affecting%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/senior-woman-thinking.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A huge bomb was dropped on Wednesday when a high-ranking congressional auditor testified that federal health officials need to crack down on billing errors by the insurer because they made more than $16 billion in improper payments to private Medicare Advantage health plans last year.\nJames Cosgrove, director of health care reviews for the Government Accountability office, stated while testifying before the House of Ways and Means oversight subcommittee that the Medicare Advantage improper payment rate was 10 percent in 2016, which totals $16.2 billion as reported by Public Integrity.\nThis news has come one week after Attorney General Jeff Sessions publicized the arrests of 412 people, at least 100 doctors, denoting the health care fraud schemes that supposedly ripped off the government for about $1.3 billion, mostly from Medicare.\nFlorida Republican Rep. Vern Buchanan, chairman of the House of Committee on Ways and Means expressed during Wednesday’s hearing “When trying to understand how much fraud is in Medicare, the answer is we simply don’t know.”\nHe also mentioned that “Understanding payment errors is important as every dollar reported lost in error serves to undermine the good work of the program and could represent a dollar that should be spent on providing care to beneficiaries. However, different types of errors require different analytics and different solutions.”\nWhat are your thoughts on this?",
    "source_domain": "americannews.com",
    "title": "SENIOR CITIZENS: Scary Announcement About Medicare Affecting You",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/senior-citizens-scary-announcement-medicare-affecting/"
}