{
    "authors": [],
    "date_download": "2017-02-15 04:46:53+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 04:01:01",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fobama-rolls-sleeves-take-trump-rallying-troops%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-14-at-5.23.11-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "Just weeks after leaving the White House, Barack Obama is already orchestrating a plan to take Donald Trump down.\nAccording to reports from Infowars, Obama is leading an army of 30,000 protesters from his “command center” in his new home in Washington D.C.—just two miles away from the White House. Insiders have revealed that Obama is likely creating a “shadow government” to protect his legacy. The nationwide network of protesters is known as “Organizing for Action” and identifies itself as a movement that “grew out of Obama’s first presidential campaign.” It claims to have 250 local chapters throughout the country.\nReports indicate the group is desperately working to save Obamacare by planning 400 health care-focused events in the majority of states this year. They will be teaming up with liberal groups like the Center for American Progress and Planned Parenthood. The organization has already organized anti-Trump protests—many of which have turned into violent riots.\nOn Sunday, Trump spoke out against holdover members of the Obama administration who have leaked private information about phone conservations he had with leaders of Australia and Mexico.\n“It’s a disgrace that they leaked because it’s very much against our country,” Trump told Fox News. “It’s a very dangerous thing for this country.”",
    "source_domain": "americannews.com",
    "title": "Obama Rolls Up Sleeves To Take Trump Down… He Is Rallying The Troops",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/obama-rolls-sleeves-take-trump-rallying-troops/"
}