{
    "authors": [],
    "date_download": "2017-04-18 11:23:37+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 05:54:56",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fhappening-mother-bombs%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/04/Screen-Shot-2017-04-17-at-10.53.58-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "It appears the “Mother of All Bombs” is living up to its name—at least if the latest Islamic State death tolls from last week’s attack\nin Afghanistan are any indication.\nAccording to the Wall Street Journal, nearly 100 bodies have been pulled from the tunnels hit by the largest non-nuclear bomb in\nAmerica’s arsenal. As of Saturday, CNN reported the death toll at 94, but Afghan officials only expect that number to rise.\nThe “Mother of All Bombs” is the nickname for the GBU-43/B Massive Ordnance Air Blast, which weighs in at a whopping 21,000\npounds. The bomb was designed to penetrate bunkers and tunnels. The target for the bomb dropped on the Achin district of\nNangarhar Province was a tunnel complex that was being used as a safe haven for Islamic State group leaders.\nThe MOAB is designed to explode six feet above the ground, meaning that the blast penetrates downwards instead of radiating\nfrom the site of the blast, collapsing structures below the surface.\n“This was the first time that we encountered an extensive obstacle to our progress,” Gen. John Nicholson, the top military general\nin Afghanistan, said on Friday. “It was the right time to use it tactically against the right target on the battlefield.\nOf course, the decision to use the MOAB is not without controversy. But it certainly sent a message to ISIS leaders: Trump’s\nAmerica means business",
    "source_domain": "americannews.com",
    "title": "It’s Happening… The Mother Of All Bombs",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/happening-mother-bombs/"
}