{
    "authors": [],
    "date_download": "2017-01-02 14:45:14+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 03:55:33",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fwhite-house-admin-turns-obama-want-bring-reveal%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/01/Screen-Shot-2017-01-01-at-2.43.57-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "Michael R. Wear spent years working as a White House staffer before serving as President Barack Obama’s faith outreach coordinator in the 2012 election. Now, he’s just come forward to share his experience of Obama’s approach to the Christian religion in his book, Reclaiming Hope: Lessons Learned in the Obama White House About the Future of Faith in America.\nWear told a reporter at the Atlantic about what happened after he drew up a faith-outreach fact sheet describing the president’s views on poverty. The piece was called, Economic Fairness and the Least of These. Of course, Wear was referring to a line in the Bible in which Jesus commands his disciples to care for “the least of these,” or the poor and marginalized. The reference clearly went over the heads of the Obama administration.\n“Another staffer repeatedly deleted ‘the least of these,’ commenting, ‘Is this a typo? It doesn’t make any sense to me. Who/what are ‘these’?” The Atlantic explained.\nWear also commented that the Obama administration was “unnecessarily antagonistic toward religious conservatives,” especially when it came to abortion funding and contraception requirements. This attitude has now spread throughout the entire Democratic Party—making no effort to connect to religious voters in the latest election.\n“Reaching out to evangelicals doesn’t mean you have to become pro-life,” he argued. “It just means you have too not be so in love with how pro-choice you are, and so opposed to how pro-life we are.”\nClearly, ignoring such an important part of the population did not end well. 81 percent of Evangelicals and a majority of Catholics ended up voting for Donald Trump.",
    "source_domain": "americannews.com",
    "title": "White House Admin Turns On Obama They Want To Bring Him Down, Reveal",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/white-house-admin-turns-obama-want-bring-reveal/"
}