{
    "authors": [],
    "date_download": "2017-06-14 18:54:01+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 18:50:09",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fwatch-crazy-lib-reporter-run-mouth-cop-get-taught-career-ending-lesson-matter-seconds-video%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-13-at-4.04.19-PM-1.png",
    "language": "en",
    "localpath": null,
    "maintext": "A Philadelphia reporter just experienced first-hand what it is like to commit career suicide in front of a live audience.\nOn Sunday, Colleen Campbell was at the Helium Comedy Club when she was asked to leave. New York City comic Wil Sylvince, who was also at the venue at the time, said Campbell was being loud and disruptive.\nSylvince managed to capture the 28-year-old on video outside the venue as she went on a violent rant against a security guard and a police officer who were simply asking her to go home. On her way out of the venue, Campbell allegedly “assaulted (kicking, punching, and eye poking) 3 of the employees in the bar area right outside the showroom.” Campbell also reportedly yelled, shoved, and even pretend to spit at the security guard before she was ultimately handcuffed and arrested.\n“You’re arresting a girl for no f***ing reason,” she yelled in the officer’s face. “If I had my tits out and my ass hanging out you wouldn’t arrest me right?”\nCampbell graduated from Temple University in 2016 with a B.A. in broadcast journalism.\n“I work at a f**king news station mother*cker,” she said. “I work at PHL 17.”\nPHL-TV has since scrubbed Campbell’s biography from their website, along with most of her videos and articles. Her personal social media accounts have also been deleted.",
    "source_domain": "americannews.com",
    "title": "Watch Crazy Lib Reporter Run Her Mouth At Cop, And Get Taught Career Ending Lesson In Matter of Seconds [VIDEO]",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/watch-crazy-lib-reporter-run-mouth-cop-get-taught-career-ending-lesson-matter-seconds-video/"
}