{
    "authors": [],
    "date_download": "2017-12-11 16:59:09+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 13:33:15",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Ftrump-throws-away-obamas-military-rules-now-massively-crushing-isis-faster-pace-expected%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-1.png",
    "language": "en",
    "localpath": null,
    "maintext": "Democrats may not want to admit it, but Trump has been crushing one of his major goals since entering office and that is destroying ISIS. Since taking over office, Trump as scrapped most of the Obama era military rules and gave the current military more freedom to engage terrorism and ISIS, and needless to say, the U.S. military is making quick work of ISIS.\nWithin just one year of the military having increased freedom, we have seen massive gains as ISIS loses ground in the middle east.\nISIS once governed immense territory in Iraq and Syria, ruling over 8 million people and controlling profitable refineries, agriculture, smuggling routes, and arsenals. Now, ISIS controls just 3 percent of Iraq and 5 percent of Syria. Their leader, Abu Bakr al-Baghdadi, is in hiding, and American forces and regional allies have liberated key cities like Mosul, Raqqa, Tel Afar, and Rawa.\nBrig. Gen. Andrew Croft, the ranking U.S. Air Force officer in Iraq, told Fox News he credits the Trump administration with providing the right leadership.\n“The leadership team that is in place right now has certainly enabled us to succeed,” Croft said. “I couldn’t ask for a better leadership team to work for, to enable the military to do what it does best.”\nThe President’s hands-off approach has led to accelerated results. “It moved more quickly than at least I had anticipated,” Croft said. “We and the Iraqi Security Forces were able to hunt down and target ISIS leadership, target their command and control.”\nMarine Col. Seth Folsom, who oversaw fighting in Al Qaim near the Syrian border, described feeling “liberated” under the new leadership.\n“I never felt constrained. In a lot of ways, I felt quite liberated because we had a clear mandate and there was no questioning that.”\nBrig. Gen. Robert “G-Man” Sofge, the top U.S. Marine in Iraq, echoed Folsom’s sentiment, saying commanders have “enjoyed not having to deal with too many distractions and there was no question about what the mission here in Iraq was.”\nHe continued:",
    "source_domain": "americannews.com",
    "title": "Trump Throws Away Obama's Military \"Rules\", Is Now Massively Crushing ISIS At A Faster Pace Than Expected",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/trump-throws-away-obamas-military-rules-now-massively-crushing-isis-faster-pace-expected/"
}