{
    "authors": [],
    "date_download": "2017-08-14 20:24:11+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 13:41:22",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Flib-antifa-protester-punches-female-gop-reporter-live-tv-reacts-next-priceless%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/antifa-terrorist.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The biased liberal media has been covering the events that transpired in Charlottesville over the weekend.\nWhile they have been busy berating the protestors, liberal media has failed to report the armed “antifa” liberal counter-protesters that have swarmed in and threatened the lives of protesters and many others, including reporters.\nAlthough this did not make headlines, it is worth reporting that an “anti-fascist” counter-protester became infuriated that a female reporter from The Hill was filming him, so he punched her in the face.\nThe reporter, Taylor Lorenz, wrote this on her Twitter after releasing the video detailing the event, “The video cuts off at the end b/c some asshole came over and punched me in the face and kicked my phone for recording (I said I was press).” She continued, “I’m filing a charge against the guy for punching me but it’s slammed at the police station right now so prob nothing will happen.”\nLorenz posted an updated statement to her page stating, “Also people asking (I’m fine!) really fucking pissed at the guy who punched me mostly because he cut off my stream. Turns out the guy who punched me in the face for recording after the incident already had a warrant out for his arrest. So he’s being held.”\nDo you think it is important for media to report occurrences such as this?",
    "source_domain": "americannews.com",
    "title": "Lib “Antifa” Protester Punches A Female GOP Reporter Live On TV… How She Reacts Next Is Priceless",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/lib-antifa-protester-punches-female-gop-reporter-live-tv-reacts-next-priceless/"
}