{
    "authors": [],
    "date_download": "2017-12-12 05:25:13+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 17:27:23",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fvideo-national-anthem-rendition-army-navy-game-massive-wakeup-call-nfl-kneelers%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-3.png",
    "language": "en",
    "localpath": null,
    "maintext": "Watch this video and tell me if you see anything different than we have been seeing in football recently. If you noticed like I did, not a single person in the entire stadium was kneeling, which is how it is supposed to be.\nArmy and Navy met again Saturday afternoon on a snowy field in Philadelphia to play a football game that has been played for over 100 years.\nThe Army-Navy football game is one of the most storied sports traditions in the country.\nThis is the 118th year the two teams have met, they generally meet in a neutral city between the two schools, often times in an NFL stadium because of it’s capacity and the sheer number of fans wishing to attend the game.\nBefore the game, the choirs of the Annapolis and West Point academies joined together to sing the national anthem. It was a solemn moment and was made even more beautiful by the falling snow, and like we noted before, not a single person in that stadium was kneeling, and what a powerful moment it was.\nThe National Anthem is supposed to be inclusionary, it is supposed to bring Americans together, on that field it represented the fact that despite our differences, two different arms of the military, two different school, two different teams, we are truly on the same team, we are all Americans who love this country.\nIn the NFL however, they are trying to take the anthem and make it divisive, they are trying to make it about, some are standing, some are sitting and that draws the line on the type of person you are, but that’s not true at all.\nI am all ears to hear about issues NFL players have about society, everybody knows it’s not perfect, but to use the national anthem to further your point is unpatriotic and Americans don’t take too kindly to that.",
    "source_domain": "americannews.com",
    "title": "[VIDEO] National Anthem Rendition By Army-Navy Game Is A Massive Wakeup Call To All NFL Kneelers",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/video-national-anthem-rendition-army-navy-game-massive-wakeup-call-nfl-kneelers/"
}