{
    "authors": [],
    "date_download": "2017-08-14 07:38:08+00:00",
    "date_modify": null,
    "date_publish": "2017-08-13 17:28:58",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fvideo-alert-state-emergency-declared-small-protestations-turn-massive-riots%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/state-of-emergency-virginia.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "BREAKING NEWS: Massive race riots have engulfed Charlottesville, Virginia. White nationalists and counter protesters are causing a violent scene. The nightmare became even worse after a driver viciously plowed into a group of anti-fascist protestors hitting up to 20 people on purpose.\nThis appalling video displays a Dodge Charger accelerating into a crowd, as bodies are being thrown and people are screaming. At this time, it is not known how many people are injured.\nHere's the moment a car slams into a crowd protesting white nationalists in #Charlottesville. Backs up and leaves. pic.twitter.com/xlhqYxXmGU — Kevin Rincon (@KevRincon) August 12, 2017\nA counter protester hurled a rock at the car, which caused the driver to swerve and ram into the people as well as cars in its path, before driving off.\nThe horrific scene was described by a witness, “Yeah, it was intentional.About 40 miles an hour, hit about 15-20 people, crashed into the two cars in front of it, and then backed up and sped away while cops were standing on the side of the road and didn’t do anything.”\nThe Daily Mail reported:\nPresident Trump is expected to address the riots this afternoon.\nFirst Lady Melania Trump posted these sentiments on her Twitter feed, “Our country encourages freedom of speech, but let’s communicate w/o hate in our hearts. No good comes from violence.”\nThere have been numerous arrests made so far. The Mayor of Charlottesville, Mike Signer, condemned “cowardly parade of hatred, bigotry, racism, and intolerance march down the lawns of the architect of our Bill of Rights.”\nAs more information becomes available, we will keep you updated.",
    "source_domain": "americannews.com",
    "title": "State Of Emergency Declared... Small Protestations Turn Into Massive Riots",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/video-alert-state-emergency-declared-small-protestations-turn-massive-riots/"
}