{
    "authors": [],
    "date_download": "2017-08-14 07:38:14+00:00",
    "date_modify": null,
    "date_publish": "2017-08-13 16:25:24",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fbreaking-hillary-clinton-panic-mode-witness-agrees-testify%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/hillary-witness-testify.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hillary Clinton has been complaining about Donald Trump’s apparent “collusion” with Russia for the past few months in order to detract attention away from herself. It looked like things were looking up for her, until now because a key witness has just agreed to testify against her.\nThe Senate Judiciary Committee issued a subpoena to the co-founder of Fusion GPS, Glenn Simpson, who has been on Clinton’s payroll for years. Fusion GPS was the company that sent out information regarding unconfirmed allegations against President Donald Trump detailing the event that he had prostitutes urinate on him in a hotel in Moscow, which just so happened to be the same room that Barack Obama once stayed in.\nThe subpoena was initially issued because Simpson refused to testify, but it has since been retracted because Simpson has willingly agreed to testify.\n“However, since that time, Mr. Simpson, through his attorney, has agreed to provide a transcribed interview and requested that the subpoena compelling his attendance at Wednesday’s hearing be waived,” committee Chairman Chuck Grassley (R-Iowa) and Ranking Member Dianne Feinstein (D-Calif.) said in a statement. “We’ve reached an agreement on this request and have withdrawn the subpoena.”\nFusion GPS spread claims that Natalia Veselnitskaya met with Donald Trump Jr. to get dirt on Clinton. Veselnitskaya is involved with Fusion GPS, and Attorney General Loretta Lynch used this special relationship to get the lawyer into the U.S. without a visa.\nIt would seem that Veselnitskaya, Clinton, and Fusion GPS all teamed up to frame Trump. All signs are saying that they were hard at work on the Russia collusion before the President even won the election.\nWhat do you think?\nSHARE if you think Hillary Clinton should be LOCKED UP!",
    "source_domain": "americannews.com",
    "title": "BREAKING: Hillary Clinton In Panic Mode, Witness Agrees To Testify Against Her",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/breaking-hillary-clinton-panic-mode-witness-agrees-testify/"
}