{
    "authors": [],
    "date_download": "2017-08-15 06:54:19+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 04:21:30",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Felizabeth-warren-tries-participate-veteran-rally-gets-brutal-response-instead%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/elizabeth-warren-vet-meeting.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Senator Elizabeth Warren (D-MA) failed to respond to an invitation to a veterans event in late August and now one Massachusetts-based veterans group has it out for the lawmaker.\nOn August 26, Veterans Assisting Veterans are hosting a rally that they initially invited Warren to attend. The group has since revoked their previous invitation because as The Boston Herald reported, she favors illegal immigrants over improving services for veterans.\nVAV spokesman John MacDonald said, “If you don’t want to respond, you don’t want to support, we asked you to come to our rally, our message to you is stay home. We don’t want you.” He continued “I think that really demonstrates where her heart is. To me, it’s really, really frustrating, and our group is really frustrated.”\nThese concerns are not recent MacDonald states, as Warren has continually neglected the needs of veterans.\nMacDonald made sure to clarify that VAV is in no way against immigration and is thankful for the duty that immigrants have served in America’s armed forces. This group made sure to call out Warren for using immigrants for “political theater” while continuously pushing their needs aside.\nHere is section of the open letter VAV published in February:\nWarren finally responded to the group’s letter 113 days later:\nThe politicians response was not taken well by the public.\nThe veterans “need advocates,” MacDonald expressed in August in Washington D.C.\n“We shouldn’t have to fight this hard,” he pleaded.\nWhat are your thoughts on this?",
    "source_domain": "americannews.com",
    "title": "Elizabeth Warren Tries To Participate To A Veteran Rally… Gets A Brutal Response Instead",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/elizabeth-warren-tries-participate-veteran-rally-gets-brutal-response-instead/"
}