{
    "authors": [],
    "date_download": "2017-06-14 18:54:05+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 16:20:26",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fbernie-sanders-says-christianity-insult-muslims%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-13-at-4.48.30-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "Bernie Sanders has just proven once and for all how biased he truly is against Christians. He proved that once again recently when he violated a Constitutional mandate that you are not allowed to apply a religious test when running for office.\nThe Vermont senator criticized White House Deputy Budget Director nominee Russell Vought for his Christian beliefs in relation to Islam. Sanders declared he would oppose Vought on those grounds, basing his decision on an article Vought wrote in defense of Wheaton College.\n“This is the fundamental problem,” Vought wrote. “Muslims do not simply have a deficient theology. They do not know God because they have rejected Jesus Christ his Son, and they stand condemned.”\n“It is hateful,” Sanders said of the writing. “It is Islamophobic. And it is an insult to over a billion Muslims throughout the world.”\nSanders went on to grill Vought, asking him if he believed that the statement in his article was Islamophobic.\n“Absolutely not. I’m a Christian and I believe in a Christian set of principles based on my faith,” Vought stated. “That post, as I stated in the questionnaire to this committee, was to defend my alma mater, Wheaton College, a Christian school that has a statement of faith that includes the centrality of Jesus Christ for Salvation.”\n“I understand you are a Christian. But this country is made up of people who are not just — I understand that Christianity is the majority religion, but there are other people who have different religions in this country and around the world,” Bernie fired back.\nVought responded by saying, “As a Christian, I believe that all individuals are made in the image of God and are worthy of dignity and respect regardless of their religious beliefs.”\n“I would simply say, Mr. Chairman, that this nominee is really not someone who is really what this country is supposed to be about,” Sanders concluded. “I will vote no.”",
    "source_domain": "americannews.com",
    "title": "Bernie Sanders Says Christianity Is An Insult To Muslims",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/bernie-sanders-says-christianity-insult-muslims/"
}