{
    "authors": [],
    "date_download": "2017-08-14 07:38:10+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 05:24:26",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Ftrump-denounces-white-supremacist-riots-virginia-liberals-instantly-try-bring%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/trump-condems-white-supremacist.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Trump berated the White Nationalist march that took place yesterday in Charlottesville, Virginia. Of course, liberals are angry that he did. The violent march turned deadly when a car bulldozed a group of protestors at full speed on purpose. The President has tweeted, “We ALL must be united & condemn all that hate stands for. There is no place for this kind of violence in America. Lets come together as one!”\nJoining the President in condemning the march is Melania Trump and Mike Pence. For example, the First Lady tweeted, “Our country encourages freedom of speech, but let’s communicate w/o hate in our hearts. No good comes from violence. #Charlottesville.”\nAnother example is this tweet from Mike Pence, “I stand with @POTUS against hate & violence. U.S is greatest when we join together & oppose those seeking to divide us. #Charlottesville.”\nSo what exactly are liberals mad at? They seem to be upset because this was ‘too vague.’ They also tried to blame the entire march on our President.\nPaul Scheer tweeted, “Glad our President & VP are taking such a hard stand on “Hate” & “Violence” b/c clearly there is nothing else more specific happening there.”\nThere are many people beginning to think that President Trump is a coward. The man cannot seem to do anything right in the eyes of liberals.",
    "source_domain": "americannews.com",
    "title": "Trump Denounces White Supremacist Riots In Virginia, Liberals Instantly Try To Bring Him Down",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/trump-denounces-white-supremacist-riots-virginia-liberals-instantly-try-bring/"
}