{
    "authors": [],
    "date_download": "2017-08-14 20:24:15+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 15:03:11",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fgop-dems-regroup-attack-trump-protest-comments-get-instantly-shut-mike-huckabee%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/mike-huckabee.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "On Sunday morning, the condemnation of President Donald Trump continued on both political sides.\nMike Huckabee, former presidential candidate and Arkansas Governor, defended our President.\nThis all started after Trump made comments condemning violence, but he left out two important words that could have changed his fate: “white supremacists.”\nWhat he did say actually ignited the flame even more. See if you can guess why everyone was outraged.\n“We condemn in the strongest possible terms this egregious display of hatred, bigotry, and violence on many sides. On many sides.”\nThat’s right, you guessed it, “many sides.”\nAlthough all parties were out of line, Trump fails to single out white nationalist protesters, which is why he is not looking good in the eye’s of the public right now.\nHuckabee wondered if Trump is being unfairly criticized for this whole mess when he appeared on “Justice with Judge Jeanine” on Fox News, Saturday Night.\nHe made mentions that Trump is being held to a double-standard, which was reported by Mediaite:\nHuckabee issued another statement that honored the President for not jumping to conclusions before all of the facts were available to the public:\nJames Alex Fields Jr, a 20-year-old Ohio resident, is the driver of the car that bulldozed counter-protesters on Saturday, which resulted in the death of a 32-year-old woman and injury to at least a dozen more.\nFields is being held without bond, three counts of malicious wounding, pending charges of one count of second-degree murder, and one count of hit and run.\n‘LIKE’ if you are happy he is locked up.",
    "source_domain": "americannews.com",
    "title": "GOP And Dems Regroup To Attack Trump Over Protest Comments, Get Instantly Shut Down By Mike Huckabee",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/gop-dems-regroup-attack-trump-protest-comments-get-instantly-shut-mike-huckabee/"
}