{
    "authors": [],
    "date_download": "2017-08-15 06:54:21+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 20:48:31",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fgop-senator-destroyed-obamacare-repeal-receives-massive-blow-return%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/08/susan-collins.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "GOP Senator Susan Collins betrayed her party when she decided to undermine the Obamacare repeal bill last month. She even tried to make herself look better by making up some absurd Planned Parenthood excuse that had no factual evidence and made her look ridiculous.\nUnfortunately for Collins, the Senator does not seem highly favored according to the latest polls. Town Hall has reported that 60 percent of respondents in Collin’s home state of Maine are less likely to vote for her in a primary due to her sabotage on the Obamacare repeal. Things only got worse for her when the polls proved that only 28 percent of respondents would even carry out voting for Collins in a potential primary situation, and 55 percent would rather vote for someone who had the support of Gov. Paul LePage.\nCollins has been historically popular among her home state of Maine, so she must be utterly horrified to see the state that her popularity is in now. Voters are wondering if she is even a Republican.\nPresident Trump criticized Senate Majority Leader Mitch McConnell for not removing Senator Lisa Murkowski, Senator John McCain, nor Collins from their chair positions in the Senate, which would have forced them into voting for the proposed health care bill.\nTrump has stated in reference to this, “He should have known that he had a couple of votes that turned on him and that should have been very easy to handle, whether it’s through the fact that you take away a committee chairmanship or do whatever you have to do.”\n‘SHARE’ if you think Susan Collins is a traitor.",
    "source_domain": "americannews.com",
    "title": "GOP Senator Who Destroyed Obamacare Repeal Receives A Massive Blow In Return",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/gop-senator-destroyed-obamacare-repeal-receives-massive-blow-return/"
}