{
    "authors": [],
    "date_download": "2017-06-14 18:54:03+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 18:41:23",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fbreaking-dems-rocked-massive-12-person-arrest-finally-happening%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-13-at-4.49.42-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "According to recent reports, a group of Indiana Democrats has been arrested in connection with submitting fraudulent voter registrations. Prosecutors charged 11 temporary canvassers and their supervisor, Holiday Burke, who were working for the Indiana Voter Registration Project, for submitting false voter registration applications before the 2016 election.\nThe group is managed by Patriot Majority USA, which has links to the Democratic Party and former President Bill Clinton. The organization became the subject of an investigation in August after Hendricks County flagged a dozen registrations as being ‘suspicious.’\nProsecutors and police believe the fraud occurred because of “a very bad, ill-advised business practice” of giving canvassers a daily quota of registrations to meet. Workers have admitted to falsifying registrations, noting that they faced the possibility of losing their job if they didn’t register at least 10 new voters a day. The affidavit says supervisors told canvassers “to obtain their quota by any means necessary.”\n“By giving someone a financial motive to (meet a quote) is what caused these canvassers to cut corners and do things that not only undermined the goal of having legitimately registered voters but led to a situation where we allege it bled over into criminal conduct,” Marion County Prosecutor Terry Curry said.\nIf convicted, the defendants will face a prison term of up to 2.5 years.",
    "source_domain": "americannews.com",
    "title": "BREAKING: Dems Rocked With Massive 12 Person Arrest… It’s Finally Happening",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/breaking-dems-rocked-massive-12-person-arrest-finally-happening/"
}