{
    "authors": [],
    "date_download": "2017-02-15 04:47:26+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 04:02:33",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fbreaking-justice-dept-slams-transgenders-worst-news-lives%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-14-at-5.26.31-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "Last week, liberals desperately tried to prevent Jeff Sessions from becoming Attorney General. Now that their efforts have failed miserably, he can begin using the Justice Department to take down some of the most controversial and obstructive liberal policies passed under Obama’s administration.\nAccording to reports, one of the first items on the agenda is dismantling the transgender bathroom rules that have made many Americans feel unsafe.\nThese rules have made many people feel unsettled, from adult women fearing for their safety to teenagers who don’t feel comfortable with vague guidelines about who can watch them change in the locker room. The concern surrounds the fact that men and women could abuse this rule by lying about their sexual orientation.\nSources say the DOJ will engage in a massive rollback in the rules that put girls and women in vulnerable situations.\nOf course, not everyone is happy about the decision. Mara Keisling, the executive director of the National Center for Transgender Equality, firmly opposes what she calls a reversal of the “progress” made under Obama.\n“We saw this coming, and it’s not a surprise, but the Trump administration is a mess,” she told The Huffington Post. “They take on the people they perceive as the weakest first. I don’t think they understand how strong we are.”\nWhat do you think? Do you agree with this policy reversal?",
    "source_domain": "americannews.com",
    "title": "BREAKING: Justice Dept. SLAMS Transgenders With The Worst News Of Their Lives",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/breaking-justice-dept-slams-transgenders-worst-news-lives/"
}