{
    "authors": [],
    "date_download": "2017-10-07 00:32:03+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 14:58:22",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2F26453-2%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/10/Jimmy-kimmel-blames-rep-vegas-shooting.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jimmy Kimmel is a disgusting and insensitive human being. Can you believe that he tried to blame the Vegas massacre on Republicans not once, but twice. This time, Kimmel got totally eviscerated by Ben Shapiro.\n“I’m not gonna get deep into it again, I said what I had to say last night. But I do want to say something to these nuts who spent most of the day today on television and online attacking those of us who think we need to do something about the fact that 59 innocent people were killed,” Kimmel stated.\nHe continued, “They say it’s inappropriate to be talking about it because it’s too soon. Well, maybe it’s too soon for you, because deep down inside in your heart, you know you bear some responsibility for the fact that almost anyone can get any weapon they want. And now you want to cover yourself until the storm of outrage passes, and you can go back to your dirty business as usual.”\n“But it’s not too soon for us, because we’re Americans, and the last time I checked, the First Amendment is at least as important as the Second Amendment, so we will talk about it, and shame on you for suggesting we do otherwise,” Kimmel added.\nBen Shapiro explained, “Even the guns that he was using; I’m not sure there’s any evidence that gun control would have done anything. He obtained his weapons legally; he had gone through federal background checks; there’s no evidence of significant mental illness to this point, so all this seems like is people shouting, ‘Do something’ while they have no particular solutions and no expertise on guns or gun control. The suggestion that gun control is going to put an end to incidents like this, that is an evidence-less proposition based on an emotional response.”\nBAM!\nTake a look at Ben Shapiro’s complete stance in the video below:",
    "source_domain": "americannews.com",
    "title": "[VIDEO] Jimmy Kimmel Attacks Republicans Again \"You Know You Bear Some Responsibility\", But Gets Eviscerated By Ben Shapiro",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/26453-2/"
}