{
    "authors": [],
    "date_download": "2017-06-14 18:53:59+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 16:27:19",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fmuslims-rage-pamela-geller-says-sharia-law-misogynistic-anti-semitic-anti-infidel-anti-gay-anti%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/06/Screen-Shot-2017-06-13-at-4.48.52-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "On Monday’s Breitbart News Daily, Pamela Geller, president of the American Freedom Defense Initiative, discussed the anti-sharia law marches that took place this weekend.\n“It’s great to see Americans are waking up,” Geller said in the interview with host Raheem Kassam. “Sharia is the most brutal and extreme system of governance ideology on the face of the Earth. It is misogynistic. It is anti-Semitic. It is anti-infidel. It is anti-gay. It is anti-free speech.”\n“It is, as Sam Harris said, the ‘motherlode of bad ideas,’” she continued. “And, of course, it’s been slow in educating the American people because you have this enormous machine, this leftist-Islamic machine that controls much of the information battlespace – if it’s media or culture, movies, entertainment, and even in the coverage of these marches, it was enormously and wildly slanted, which, of course, we’re used to.”\n“But the American people are waking up. Clearly, they’re waking up in Europe as well, although, of course, I was disappointed, unquestionably, in the U.K. elections because I just think Labor and Corbyn are so to the left of bad,” Geller added.\nLater in the interview, Kassam noted that the UK government was quick to block people like Geller from entering the country because their speech was classified as ‘unacceptably divisive.’ At the same time, they opened their door to 23,000 jihadis.\n“Oh, I completely agree. The fact is, you’re not going to have me advocate for May. She did ban me and said Muslims might get violent if I was to appear,” Geller said, referring to actions British Prime Minister Theresa May took as home secretary. “Well, you know, how did that work out for you, PM May?”\nWhat do you think of Geller’s comments? Do you agree or did she take things too far?",
    "source_domain": "americannews.com",
    "title": "Muslims Rage After Pamela Geller Says, Sharia Law Is ‘Misogynistic, Anti-Semitic, Anti-Infidel, Anti-Gay, And Anti-…’",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/muslims-rage-pamela-geller-says-sharia-law-misogynistic-anti-semitic-anti-infidel-anti-gay-anti/"
}