{
    "authors": [],
    "date_download": "2017-02-15 04:46:55+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 04:07:22",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fbreaking-americas-popular-cheese-recalled-immediately-throw-away-can-kill-family%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-14-at-5.51.20-PM.png",
    "language": "en",
    "localpath": null,
    "maintext": "It’s time to check your fridges. Sargento Foods Inc. has just issued a massive recall of seven cheeses due to a potential contamination from listeria monocytogenes. The company confirms no illnesses have been reported yet.\nListeriosis is a serious infection contracted by eating food contaminated with bacteria. An estimated 1,600 people get infected each year—and about 260 die. The bacteria is most harmful to pregnant women, newborns, adults aged 65 or older, and people with weakened immune systems.\nSargento is continuing to closely monitor and gather information from their supplier, based in Middlebury, Ind. The supplier reportedly notified Sargento Food Inc. that a specialty Longhorn Colby cheese it supplied had potentially been contaminated and needed to be recalled.\nThe company continues to respond to their consumers and provide reimbursements. If you purchased cheese, you can call 1-800-CHEESES or email the company via the Contact page on their website.\nThe recalled products include:\n– Sargento Ultra Thin Slice Longhorn Colby\n– Sargento Chef Blends Shredded Nacho & Taco Cheese\n– Sargento Slice Colby-Jack Cheese\n– Sargento Slice Pepper Jack Cheese\n– Sargento Chef Blends Shredded Taco Cheese\n– Sargento Off The Block Shredded Fine Cut Colby-Jack Cheese\n– Sargento Off the Block Shredded Fine Cut Cheddar Jack Cheese\nNo other Sargento branded products were affected by this recall.\nPlease share this information with your family and friends.",
    "source_domain": "americannews.com",
    "title": "BREAKING: America’s Most Popular Cheese Recalled… IMMEDIATELY Throw It Away, This Can Kill Your Family",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/breaking-americas-popular-cheese-recalled-immediately-throw-away-can-kill-family/"
}