{
    "authors": [],
    "date_download": "2017-12-11 16:59:13+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 13:22:51",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Fnancy-pelosi-claims-god-democrats-supports-dreamers%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed.png",
    "language": "en",
    "localpath": null,
    "maintext": "House Minority Leader Nancy Pelosi sad at a Thursday press conference that “God is with” democrats who support the dreamers and their fight to stay in this country.\nA reporter asked Pelosi: “Have you changed your mind at all about being willing to accept some border wall funding or immigration crackdown funding within a DREAM Act fix?”\nPelosi responded:\n“I don’t know, when you say, ‘Have you changed your mind?’ We said to the President the night he agreed to the DACA legislation we have a responsibility to protect our border and we think there are many things we can do working together to do that. And Members have been working in a bipartisan way to address that.\n“So we’re not backing off anything, including meeting the needs of protecting our border. We are not going to turn this country into a reign of terror of domestic enforcement and have the DACA, the DREAMers, pay that price.\n“But I’m optimistic. I always have been. God is with us on this. Our country is great. We know our greatness springs from the vitality that newcomers bring to our country. Eighty percent at least of the American people support the DREAMers.\n“And some Members at the President’s holiday event the other night – he called it a holiday event, by the way. It wasn’t a Christmas party, it was a holiday event – At that, the Republican Members were saying to me, ‘This is 80 percent in my district, people support the DREAMers.’ And I’ve had some of their spouses say to me, ‘We have” to get the DREAM Act.’ “So this has, again, bipartisan support. We can find our common ground.”\nNancy Pelosi desperately wants to keep the Dreamers in this country because she knows it is a larger percentage of the California Democratic voters, but is it in the best interest of the entire country?",
    "source_domain": "americannews.com",
    "title": "Nancy Pelosi Claims \"God Is With The Democrats\" And Supports The DREAMers",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/nancy-pelosi-claims-god-democrats-supports-dreamers/"
}