{
    "authors": [],
    "date_download": "2017-12-12 05:25:19+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 18:18:54",
    "description": null,
    "filename": "http%3A%2F%2Famericannews.com%2Ftrans-man-now-leader-major-feminist-group%2F.json",
    "image_url": "http://americannews.com/wp-content/uploads/2017/12/unnamed-86.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Trans men are not only invading women’s sports, now they are leading feminist organizations, which completely smacks in the face their idea of “patriarchy.”\nGabrielle Bouchard, a transgender man, has been elected as the new president of the largest feminist organization in Quebec, according to LifeSiteNews.\nThe Federation des Femmes du Quebec is basically the Canadian version of America’s NOW, and “represents some 300 feminist groups and about 700 individual members.”\nBouchard’s appointment has not gone over well in some of Quebec’s media circles, saying that placing a man ahead of a feminist organization only serves to reinforce the patriarchy. Bouchard rejects such claims.\n“They are saying we’ll tolerate trans women as long as they are not in a position of power,” Bouchard told Canadian Press. “We’ll tolerate lesbians in the movement as long as they stand 10 feet away.”\nHe accuses the critics of falling into a patriarchal construct that “presumes all women live the same experience — which is not true.”\n“All the barriers I face are actually based in sexism,” he said. “They also happen to be based in transphobia. I am living at the intersection of trans identity and being a woman, and it creates a marginalization that some women don’t face.”\nSo shouldn’t you be a representation of what woman face as the leader of their organization? The vast majority of women don’t face transphobia as an issue in their everyday lives, so why is electing a leader who faces this issue important?\nJournal du Montreal writer Denise Bombardier wrote two columns critical of Bouchard’s election. “Who is this man who became a woman as an adult?” she questioned. “How can she speak on behalf of all women, as someone who was raised in a masculine culture, ignoring the experiences that women have lived through since they were born?”",
    "source_domain": "americannews.com",
    "title": "Trans Man Is Now The Leader Of Major Feminist Group",
    "title_page": null,
    "title_rss": null,
    "url": "http://americannews.com/trans-man-now-leader-major-feminist-group/"
}