{
    "authors": [
        "Teri Lyon"
    ],
    "date_download": "2018-05-31 08:11:23+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fsuburban-family-experiencing-the-abington-heights-sudent-art-show-1.2343599.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343596.1527693420!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It has become an annual tradition for me to spend the Thursday evening before Memorial Day with some pretty cool art – not in NYC at The Met or MOMA, but at Abington Heights High School.\nLast Thursday, I continued the tradition, strolling through the Art Wing and Auxiliary Gym of the high school during its annual student art show. As I nibbled on light refreshments and listened to a little music, I was blown away by the work of more than 400 student artists! The exhibitors came from grades 9-12, in art classes taught by Eileen Healey, Abby Fenton and Kayla Collurra, and photography taught by Tim Butler.\nMs. Healey, for one, was a fan.\n“You will see a variety of work from all of our students,” she said, from classes like ceramics, jewelry, sculpture, photography, digital media, mixed media, intro to 3D design, art 1, art 2, art 3, art 4 and creative expansion. She said students and teachers put their heads together to decide which art would be displayed.\nThe teacher said the annual event, which has been going on “forever” is the perfect venue “to showcase our students’ creative talent.”\nButler said he is proud of his photography students who are serious about their work and always rise above a challenging assignment.\n“They always bring me something new and better than before,” he said.\nMs. Healey commented, “As art teachers, we are all very proud to see the growth in artistic ability with all of our art students.”\nMy daughter, Carolyn Lyon, is one of those students.\nA senior, this was Carolyn’s fourth AHHS art show. In fact, Carolyn and Michah Beahan designed the promotional posters.\nAlthough she plans to major in Spanish Culture at Lehigh University, art has always been one of Carolyn’s passions.\n“Art has been a part of my life, and it has become my favorite creative outlet by far,” she said. “ I’ve enjoyed moving forward from simply drawing into more interesting mediums such as ceramics, watercolor, and oils as I’ve gotten older – much of which I wouldn’t have been able to explore without my classes at school.”\nShe said she has enjoyed being in her high school art show every year, especially this one.\n“I’ve been waiting four years to do my senior display, and I’m so excited that I finally get to show off all my hard work,” Carolyn said. “The art show this year is really great. I think my senior class is full of an exceptional amount of talented artists.”\nCarolyn said she works “in a vast array of mediums, and I think it’s fun to be able to express yourself in so many different ways.”\nHer favorite pieces in the art show were her chalk pastel works. “I did a large still life and a hand study, and I like the level of realism I achieved with both,” she said.\nMichah is a senior who plans to study art illustration with a minor in creative writing at University of the Arts in Philadelphia. He is consumed with art and took five art classes at AHHS this year.\n“Ever since I was a little kid, I knew this was what I wanted to do. I’ve always been fascinated with children’s books,” he said.\nHe said the art show is “really nice.”\n“I always like seeing the displays of the other students.”\n“It has been very exciting to watch all the seniors pull out their art from every year for their displays,” said Molly McHale, an art student who has loved participating in the AHHS Art Show.\nMolly plans to attend Penn State University’s main campus in the fall.\nSenior Skylar Conway was also enthusiastic about being in the show. Skylar will study illustration at Marywood University. Her favorite piece in her exhibit is a watercolor painting of tigers.\n“This class has a lot of talent. I’m glad we have the chance to showcase it,” Skylar said.\nTERI LYON IS AN EXPERIENCED MOM, GRANDMOM AND FREELANCE WRITER WHO LIVES IN GLENBURN TOWNSHIP WITH THE YOUNGEST OF HER THREE DAUGHTERS AND THEIR CAT.",
    "source_domain": "abingtonsuburban.com",
    "title": "Suburban Family: Experiencing the Abington Heights sudent art show",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/suburban-family-experiencing-the-abington-heights-sudent-art-show-1.2343599"
}