{
    "authors": [
        "Elizabeth Baumeister"
    ],
    "date_download": "2018-05-31 08:10:18+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fremembering-a-man-i-never-got-to-meet-1.2343604.json",
    "image_url": "http://www.thesuburbanweekly.com/images/icons/icon_app_medium.png",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nI wove through the sea of red, white and blue at Monday’s parade in Clarks Summit, my thoughts focused on the reason for the holiday. Memorial Day is about honoring the men and women who lost their lives while serving in the U.S. military. But the casualties of war also include lives lost after veterans return home.\nMy thoughts drifted to a man I’ve never met but without whom I would not be alive.\nMy grandfather Norval was a World War II veteran who served in Northern Africa and France. Although he returned safely home after three years in the Army, a different battle awaited him, one that grew inside his mind and eventually claimed his life.\nI realized how little I know about him. So I asked my mother to share some memories.\nShe described her father as a loner, introvert and hard worker who did a lot around the house, kept a garden and took good care of the yard. He was also a member of the local Methodist church.\n“As we were growing up, it was always special that we all had dinner together … we each had our place around the table, and daddy would pray before we ate,” she remembered.\nSome of her happiest memories with her dad are annual family camping trips, usually in the Adirondacks, visits to see his Aunt Rosie in Buffalo and the local firemen’s field days, which included parades, carnivals and fireworks.\nHer father didn’t talk much about the war, but when he did, it was after dinner around the table when she or one of her three siblings begged for stories.\nMy grandma Ida and Norval went to the same small school. Both were shy, but fell in love over time.\nThey were engaged just before he went into the service and married when he received an unexpected weekend pass.\nAfter his return, they went on a belated honeymoon to Niagara Falls.\nI wish I could end this story with “and they lived happily ever after.”\nAlthough there were many happy days, as time went on, Norval retreated deeper into himself. He was worn down by always working long hours, only to never have enough. He worked toward earning a high school diploma through correspondence courses, but didn’t have the money to finish.\nMy mom remembers sitting with him in the living room late at night doing their homework together.\nMost evenings, however, she said he would come home from work, eat supper and go right to bed.\nShe was 16 when he died.\n“The reason my dad took his life is because he had lost hope,” mom said.\nNo one knows whether or not his suicide had anything to do with his wartime experiences. But according to a U.S. Department of Veterans Affairs (VA) report released in 2014, the risk of suicide is 22 percent higher among veterans than civilian adults.\nI found myself wishing on Memorial Day that I could tell my grandfather how proud I am of his service to our country and thank him for everything he gave me. And I found myself wishing I could tell other veterans who have lost faith and hope that both still exist, that there’s still love in the world and that there’s still reason to live.\nLifeline\nAn average of 20 veterans died by suicide each day in 2014, according to the VA. If you or someone you know is experiencing thoughts or warning signs of suicide, call the U.S. National Suicide Prevention Lifeline at 800-273-TALK (8255). This free, 24/7 service provides suicidal people and those close to them with support, information and local resources.",
    "source_domain": "abingtonsuburban.com",
    "title": "Remembering a man I never got to meet",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/remembering-a-man-i-never-got-to-meet-1.2343604"
}