{
    "authors": [
        "Staff Report"
    ],
    "date_download": "2018-05-31 08:11:41+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fsports%2Fabington-heights-kyle-burke-earns-piaa-gold-medal-in-track-and-field-1.2343620.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343619.1527693990!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nCHRISTOPHER DOLAN / STAFF PHOTOGRAPHER Abington Heights’ Kyle Burke competes in the Class 3A 1600 meter run at the PIAA Track and Field state championship at Shippensburg University on Saturday, May 26.\nKyle Burke’s burst of speed in the final 100 meters earned him the PIAA gold medal Saturday in the Class 3A 1,600-meter run in 4 minutes, 16.93 seconds at Shippensburg University.\nBurke became the fourth Abington Heights boy to win a PIAA gold medal in track and field and first since 1980 when Doug Davis won the shot put.\n“I didn’t know how the race was going to play out,” Burke, a senior, said. “There have been finals where it goes out really quick. Sometimes it goes out really slow. And it just happened to go out slow this year. So, I knew that from leagues and districts this year I was able to close real hard last lap. So, I knew that I just had to keep myself close to really have a shot. Then a couple guys just gradually faded off and then there was about three of us with 200 (meters) to go. So, I just had to wait for the right time and go for it.”\nWhen he crossed the finish line, he was thrilled in earning his first PIAA medal.\n“It was an exhilarating experience,” Burke said. “I hadn’t gotten a medal in any other sport, so to have the first one be a gold in my last high school race ever it was just a culmination of four years of hard work and I just let it out in that moment.”\nThe future Lehigh University student, who will major in computer science. said he will look back on his high school career with pride.\n“I’m definitely happy with it,” he said. “You look back as a freshman, I was not anything special. There are some guys in the state where they come in and they’re right at the top from the start, but I’ve had to work my way up gradually year by year and then to finish it off with a state title. I’m very proud of how everything’s gone. I’m definitely happy with it. Even with all the successes and failures, it makes it worth it.”",
    "source_domain": "abingtonsuburban.com",
    "title": "Abington Heights' Kyle Burke earns PIAA gold medal in track and field",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/sports/abington-heights-kyle-burke-earns-piaa-gold-medal-in-track-and-field-1.2343620"
}