{
    "authors": [],
    "date_download": "2018-05-31 08:10:12+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fdance-recital-to-benefit-anastasia-scholarship-fund-1.2343592.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343590.1527691648!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nArabesque Academy of Dancing will present 'The Greatest Show' at 2 p.m. Sunday, June 3, at the People's Security Theater at Lackawanna College. Proceeds will benefit the Anastasia Scholarship Fund in memory of Anastasia Jaditz, daughter of Clarks Summit residents Dr. Steven and Mary Beth Jaditz. Tap students performing are, from left: Mela Leo, Cassie Kutra, Alison Samudio, Evelyn Ciero, Emma Gilman, Leah Crawley, Autumn Hollister and Natalie Deal. Anastasia Jaditz\nArabesque Academy of Dancing will present its annual production,“The Greatest Show,” at 2 p.m. Sunday, June 3 at the People’s Security Theater at Lackawanna College. It will feature musical selections from “The Greatest Showman” and other circus themed numbers.\nTickets, priced at $15-$18, can be obtained online at dancing.yapsody.com, by calling the studio at 570-842-8744 or at the door on the day of the performance.\nProceeds will benefit the Anastasia Scholarship Fund in memory of Anastasia Jaditz, daughter of long-time Clarks Summit residents Dr. Steven and Mary Beth Jaditz.\nAccording to the recital program, “Anastasia Jaditz was a true lover of the arts and had an absolute passion for the stage. She studied and taught dancing for many years locally, and during her high school career, she was a very active part of the Scranton Prep Players.”\nShe was killed in a car accident during her freshman year of college.\nThe scholarship was established to offer formalized dance training to students who cannot afford lessons. It also assists in paying for costumes for those students who wish to perform in local special events.",
    "source_domain": "abingtonsuburban.com",
    "title": "Dance recital to benefit Anastasia Scholarship Fund",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/dance-recital-to-benefit-anastasia-scholarship-fund-1.2343592"
}