{
    "authors": [],
    "date_download": "2018-05-31 08:11:44+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fabington-business-and-professional-spotlight-biondi-franklin-insurance-agency-1.2343613.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343612.1527693600!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nFrom left, first row: Rita Lowry and Jessica Franklin. Second row: Diane Drobinski, Michael Speranzo and Robin Opeil.\nBiondi-Franklin Insurance Agency\n790 Northern Blvd., Suite F, South Abington Township\n570-587-2840\nqualityinsurance.com\nOwner: Michael J\nSperanzo\nProducts and/or services offered: Auto, (including Motorcycles and motor homes) Home, Business, Life and Flood Insurance\nWhat sets you/your business apart?\nMainly putting customers first. Coverage in order to protect them at the best price. Customer service is number one.\nI have a great staff that preforms annual reviews for coverage and changes in customer needs.\nWhat is your favorite part of doing business in the Abington’s?\nThe community aspect – everyone is so accommodating – local businesses and groups. We are a long-time business here in the Abington’s since 1979, it will be 40 years next year and I am here four-and-a-half years.\nOther information: I have worked for Erie Insurance for 28 years, 15 years as an adjustor, eight years as district sales manager and now as an owner. My insurance background helps me handle customer’s needs. As an independent agent, I am able to price quotes from 15 different carriers, which gives my customers more options.\nFamily: Fiancé Robin and children Mike, 18; Tyler, 17, and Ethan, 10.",
    "source_domain": "abingtonsuburban.com",
    "title": "Abington Business and Professional Spotlight: Biondi-Franklin Insurance Agency",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/abington-business-and-professional-spotlight-biondi-franklin-insurance-agency-1.2343613"
}