{
    "authors": [
        "Linda Scott"
    ],
    "date_download": "2018-05-31 08:10:15+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fschool%2Fabington-heights-senior-ted-lambert-shares-love-for-music-1.2343640.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343639.1527694268!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nSUBMITTED PHOTO Theodore ‘Ted’ Lambert, an Abington Heights High School senior, has been playing the cello since fifth grade.\nCellist Theodore “Ted” Lambert has an impressive high school career at Abington Heights. And it all started with a little nudge from a classmate in fifth grade.\n“It was peer pressure,\" he said. \"A friend suggested it and it worked out. I have been playing a long time.”\nAbington Heights High School music teacher Allison Covell spoke highly of the senior and his talents.\n“Teddy has been a true inspiration to have in our music department,” she said. “He is an extremely gifted cellist, always reaching new heights and graciously sharing his gift with others.”\nSome of the highlights from his resume include:\n• Principal cellist of the Abington Heights Symphony orchestra during his junior and senior years\n• Principal cellist of the Pennsylvania Music Education Association (PMEA) district 9 and region 4 for the past three years\n• Ranked 11th and 7th cellist at the PMEA state level in his sophomore and junior years\n• Part of a master class led by world renowned pianist Fei Fei Doug\n• One season with the Wyoming Seminary Civic Orchestra during his sophomore year\n• Received the Director Award for orchestra in the spring\n• Cellist in the school play “Les Misérables” in his sophomore year\n• Taught cello to other students at Abington Heights in his junior year\n• Nominated for WVIA artist of the week and named WVIA artist of the year among 40 other artists for the performing arts\nHe also participated in the NEPA Philharmonic mentoring program in his sophomore and senior years. Through this, he played in a Philharmonic concert at the Kirby center in Wilkes Barre and was part of a chamber group that performed at Marywood University in May.\nOutside of music, Lambert participated in the scholastic bowl team and competed in the schools Envirothon. He has competed in the America Chemical Society National Olympiad.\nLambert also learned to play the violin. He performs mostly classical music, but also plays pop and modern tunes in various concerts.\nHe performs at weddings, church masses, funerals and other events.\n“The cello is easy to play,” Lambert said. “It is easy to convey my feelings to the audience when I play. It is a beautiful instrument overall. I will always have music in my life.”\nHe plans to attend the University of Delaware to study chemical engineering. He does not plan on pursuing a minor in music but hopes to perform with chamber groups in Delaware.\n“Music speaks to everyone,” he said. “Every person hears the same thing but interprets it differently. It is so special because of this and is one of our greatest tools for expressing our emotions to one another.”",
    "source_domain": "abingtonsuburban.com",
    "title": "Abington Heights senior Ted Lambert shares love for music",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/school/abington-heights-senior-ted-lambert-shares-love-for-music-1.2343640"
}