{
    "authors": [
        "Joshua Arp"
    ],
    "date_download": "2018-05-31 08:10:41+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fgreen-scene-healing-trees-part-two-1.2343616.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343614.1527693697!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nEnclosed bark caused the demise of this Clarks Green tree. Noah Macey mows by a fallen Norway spruce in Clarks Green.\nTo some residents of the Abingtons, it may seem our trees are under attack from a supernatural force.\nIn early April, I helped a friend cut up five large spruce trees blown over at his property in North Abington Township.\nTwo weeks ago, as a community, we lost dozens of mature trees in the first strong thunderstorm of the season.\nAnd, anyone in the entire northeast corner of North America is seeing the progressive destructive march of the emerald ash borer, an accidental immigrant from Asia with an exclusive taste for ash trees.\nTo some tree owners who have been affected, the hit to their checking accounts has them wondering if they would be better off without trees. To the other extreme, some people are feeling the loss almost as if the tree were a family member. These long-term homeowners may have planted that tree decades ago, and after nurturing its life and having it nurture their lives, now with the house emptied of most of its humans, that tree had been a living connection to a precious past.\nAll trees can be turned into lumber, and in this way (unique among other creatures), fallen trees can live on. Some people make furniture grade lumber from pieces of wood as small as firewood.\nMany years ago, I used my chainsaw mill and made picture frames from a fallen Norway spruce in Waverly. My wife took pictures of an apple tree on the property from the different seasons of the year, put the pictures in the frame, and gave it to the family as a special gift.\nRecently, a reader asked my opinion on the health of her ash tree. Sadly, I had to inform her that soon the tree will have to come down. But I remembered that her husband mills their fallen trees, so I was able to explain with a smile that the tree is now ready for the workshop.\nOne advantage of salvaging wood from sentimental trees is portability. Some friends of ours love their trees on both sides of the U.S.-Canada border. (If you think Canadians are just friendly Americans, you haven’t violated some rule at the border). They managed to escape a threatening border incident when they moved salvaged lumber from their Clarks Summit home to their adult son’s home in Canada. So their special tree is now an internationally illegal, but nonetheless special table top. They did not learn their lesson, however, and for their daughter’s wedding in the U.S., they decorated with sentimental birch poles smuggled from their cottage in Canada.\nThese are the reasons why, in spite of my wife’s constant search for more and better firewood, a beautifully long and straight ash log lies near its stump on our property awaiting not the maul but the mill.\nJOSHUA ARP IS AN ISA-CERTIFIED MUNICIPAL SPECIALIST, CLARKS SUMMIT’S MUNICIPAL ARBORIST AND AN OPERATOR OF AN ORGANIC LAWN AND LANDSCAPE MAINTENANCE BUSINESS. REACH HIM AT\nJOSARHUAP@AOL.COM.",
    "source_domain": "abingtonsuburban.com",
    "title": "Green Scene: Healing trees, part two",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/green-scene-healing-trees-part-two-1.2343616"
}