{
    "authors": [
        "Staff Report"
    ],
    "date_download": "2018-05-31 05:26:49+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fschool%2Fabington-heights-high-school-honor-roll-for-third-quarter-of-2017-18-1.2337921.json",
    "image_url": "http://www.thesuburbanweekly.com/images/icons/icon_app_medium.png",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nThe third-quarter Abington Heights Honor Roll has been announced.\nGrade nine: Corey Abel, Joseph Adams, Maria Adonizio, Olivia Albright, Jacob S. Anderson, John Arcangelo, Olivia Arcuri, Kylie M. Augis, Zachery L. Bator, Isabelle Bernard, Emma S. Blakiewicz, Seth T. Blakiewicz, Zachary Boersma, Abigail Bonczek, Russell Booth, Jhilik Bose, Gray-Paul Bossi, Claire E. Boyle, Abigail Brock, James W. Brown, Reilly Brown, Emily Burke, Sofia G. Capozzi, Isabella Cappellano-Sarver, Maggie K. Carper, Abigail Casal, Sailor Castellano, Rachael V. Chastain, Cole Chichura, Nicholas Clark, Casey Cleary, Seth Colan, Jules S. Colombo, Evan J. Cummings, Mariel G. Curra, Sahil Dalsania, Bryn Daniels, Sarah Darling, Haddy G. Davis, John A. Deibert, Connor Dempsey, Hugh D. Dempsey, Rachel Dempsey, Zoe Detter, Joseph Dougherty, Kyla Dougherty, Hailey P. Driesbaugh, Kevin Duong, Noah Durkin, Noelle K. Fantanarosa, Amelia J. Farry, Emily Fick, Ally Fink, Luke Gardiner, Scott Gilbert, Jordin Giovagnoli, Delaney Greenish, Brandon F. Grogan, Ashley Hamilton, Sydney A. Hauk, Lauren Heine, Isabella M. Hewitt, Isabel R. Holland, Adin Hopkins, Shaine Hughes, Nia Ivanov, Angel S. Jefferson, Harry D. Johnson, Liam Jordan, Derek Justave, Delaney J. Kaeb, Hayley Kane, Iwo Kasperkowicz, Makayla Keoonela, Jadd Khalil, Justine Klotz, Troy Kostiak, Claudia N. Kozar, Bennett L. Kubic, Clarke Kupinski, Cara LaBelle, Julia LaCoe, Morgan Langan, Ava M. Leach, Ethan Levine, Kohl H. Lindaman, Erin Lipkus, Kristin Lipkus, Maxmillian C. Loiacono, Lauren A. Lombardo, Nicholas Lowe, Madeline J. Lucas, Avery Maciak, Abigail Marion, Mary C. Marion, Gianna Marturano, Faith A. McCarroll, Willow McDonald, Mattie McGuinness, Madeline A. Meckwood, Luciano Medico, Rahique Mirza, Jewel Mitchell, Victoria J. Morris, Emily Mott, Jaina D. Mucovic, Riley E. Muherin, Allison G. Murray, Kyle Nealon, Nicholai Nocella, Jeremy A. Nothiger, Etienne J. Nunemaker, John Nzasi, Mark Nzasi, Matthew Nzasi, Mary V. O’Brien, Richard J. Padula, Arnav J. Patel, Dilan Patel, Jordan A. Patrick, Tyler Petty, Grace M. Phillips, Noelle Prisco, Brian P. Pronitis, Gavin T. Pryle, Kayla Przekop, Liam Raino, Joseph J. Rama, Kyra Reese, Elyse F. Rehder, Kevin Reid, Camille Rillstone, Michael Rodyushkin, Colin T. Rooney, Frank Rosenski, Joshua Schneider, Lauren Schofield, Kylie Schultz, Eric Schuster, Leanna M. Sciabbarrasi, Kaitlyn C. Seechock, Sabriya Seid, Elle Seyer, Jainil A. Shah, Sarah Siddiqui, Elyse Simakaski, Roy S. Slavin, Brooke Sorensen, Abigayle Steenback, Jacob Stevens, Sadie I. Stevens, Jason C. Thiel, Trevor Thomas, Ryan I. Tinkelman, Sydney N. Vachino, Adam Vale, Emma R. Wagner, Lily Wagner, Charles D. Warholak, Erin Wasko, Samuel Weis, Lily V. Whetsell, Kaelee Whipple, Bailey L. White, Hanna R. White, Chris Wickenheiser, Joshua M. Wiesel, Sean Wilkerson, Justin B. Williams and Isabella T. Wisenburn.\nGrade 10: Erin Albright, Makenzie M. Allred, Nathaniel Armstrong, Nihal S. Arslan, Miriam Barren, Brett Beemer, Lauren Berry, Jillian Bird, Julia Brown, William Brown, Brady Brust, Tristan P. Burns, Raymond Chen, Dillon P. Clearwater, Emily Conway, Charlie Cornell, George J. Cottell, Julianna M. Crandle, Michael Crowley, Daniel E. Cummins, James Dana, Spencer R. Dana, Nicholas Davenport, Dominick DeSeta, Clare Della Valle, Brooke K. Dennison, Anna Domiano, Frances Donahoe, Lucy Earl, Amelia E. Fan, Harrison Fedor, Daniel Flickinger, Camilla Fontini, Alexa Ford, Madison Fox, Samantha Gaidula, Emma Gibson, Grace Gilmore, Kayleigh Glennon, Luke A. Glidewell, Alyssa Green, Abigail E. Greene, Yehoshua Griver, Peton A. Gualtieri, Mara Hamm, James Hankee, Kirsten Hardy, Rory M. Harris, Alexes Harvey, Sadie H. Henzes, Adele Hollander, Robert M. Horvath, Sidney E. Horvath, Joseph T. Houlihan, Rachel Hunter, Varun Iyengar, Corinne M. Jacoby, Sean Kane, Matthew Kelleher, Caroline Kelly, Thomas J. Kerrigan, Keane Kiat, Andrew B. Kirtley, Rachel E. Klein, Emily Klien, Brandon Klotz, Shaelyn L. Kobrynich, Lauren Koczwara, Catherine Anne Kupinski, Isabel Lam, Kylie Loughney, Brian P. Lynott, Michael Malone, Anna Marchetta, Olivia Marchetta, Zoe McGlynn, Anne McHale, Santino R. Medico, Shervin Mokhtari, Paige Moletsky, Grace M. Munley, Angela Natale, Louis Natale, Faatihah Nayeem, Allison Nealon, Ryan P. O’Malley, Jared J. Ocwieja, Elif Z. Onat, Disha Patel, Jenna Patel, Audrey E. Phillips, Julia Poulson-Houser, Michael Pusateri, Jakob R. Quanbeck, Christian Ragnacci, Andrew Rama, Bryce Reiner, Zachary A. Roditski, Holly Ross, Audrey E. Rubner, Nina S. Sampogne, Natalie Schoen, Abigail E. Schrader, Quinton I. Schultz, Gordon A. Segall, Jack Slusser, Carson J. Smith, Lucy E. Specht, Ian Stevens, Morghan Stiles, Benjamin Storey, Sean Sullivan, Clare M. Sykes, Alexandra Thornton, Makenna Thorpe, Corey Tokash, Gianna E. Toth, Sam Traweek, Stephan L. Tserovski, Maria H. Tully, William Tung, Zachary M. Walter, Hanwen Wang, Jacob Weinberg, Zachary Wheeland and Ty H. Wilmot.\nGrade 11\nLuke T. Abdalla, Justin R. Altieri, Caroline G. Ames, Emma K. Arbuckle, Rachel Asante, Samuel Babushko, Madison Badalamente, Joseph Barcia, Bryan Barlow, Natalie Bartels, Sarah N. Bath, Danielle Beamish, Brandon Beck, Ryelee A. Benedict, Alexa Boersma, Elizabeth Bonczek, Anna E. Bonsick, Tyler R. Bormann, Noah Braid, Suzanna Brock, Mikaila L. Brown, Morgan Bruno, Emily R. Cacioppo, Matthew Calvey, William S. Cardone, William P. Carlin, Edmund Champlin, Ashley Chrysler, Vincent Crandle, Robert Curran, Aiden P. Curry, Brynn Dana, Rebecca Darling, Arla G. Davis, Clayton Davis, Shawn DeFazio, Alison Fiorillo, Ryan Flynn, John Frantz, Richard Fried, George Frietto, Oliviah M. Gearhart, Jacob Gerardi Matthew Glancey, Abigail M. Greskovic, Stephen Haggerty, Megan A. Healey, Danielle F. Heine, Sophia E. Hlavac, Hannah M. Hughes, Mohammed M. Iftekhaar, Keena Jackson, Kathleen D. Jordan, Bridget C. Jubon, Linley Keisling, Connor Kelleher, Daniel T. Kelleher Andrew J. Keris, Olivia R. Kerrigan, Zachary J. Kierzkowski, Rachel N. Klien-Hart, Mikayla Kohanski, Nina E. Kozar, Conor R. Kryeski, Michaelene Kulig, Amber L. Kusma, Evanna Lello, Anthony M. Lionetti, Joseph W. Lisk, Nicolas A. Lombardi, Kira M. Loomis, Masen J. Lounsbery, Lauren Ludwikowski, Carlee N. MacPherson, Nicholas Madera, Camille Marquardt, Calista Marzolino, Shane C. McGinley, Jane Mecca, Jessica Mendo, Andrew Miller, Eryn J. Miller, Caleb Molitoris, Destiny Moon, Aidan Mullen, James Myers, Jacob Naholnik, Connor Napierala, Andrew J. Nealon, Jack Nealon, Christopher Newell, Gerron L. Niemann, Nicholas Notari, Molly O’Malley, Tyler J. Opeil, Modupe V. Osuntokun, Emily Parry, Leia M. Parry, Heet Patel, Mahir Patel, Kylie E. Patrick, Alexandra M. Perfilio, Cameron Pettinato, Jacob R. Petty, Emily Phillips, Liam P. Pitchford, Aidan Price, Elizabeth J. Pronitis, Joshua Przekop, Sara J. Regni, Ashley Reiner, Elizabeth Rembecki, Kailey Rothenberger, Sydney N. Rothka, Sloan Seid, Noah Shields, Ryan Siebecker, Kyra Sladicki, Krutik Solanki, Julia Spindler, Isabella Stanton, Lauren Strain, Olivia Stuenzi, Greg Sweeney, Madelyn R. Sykes, Tamane Takehara, Connor Thorpe, George P. Tinsley, Madison Tricarico, Collin Tully, Nathan D. Van Fleet, Taryn C. Wells and Katerina J. Williams.\nGrade 12: Lacey M. Ammenhauser, Cassidy A. Bartkowski, Micah J. Beahan, Kyra E. Beckish, Lauryn E. Beermann, Joseph C. Beyrent, Alexander J. Bi, Sandon T. Birch, Savannah M. Blaum, Maria R. Bordonaro, Alec W. Bradican, Abby F. Brown, Alayna L. Brown, Madelyn E. Brown, Arielle L. Burdett, Julia G. Burke, Kyle P. Burke, Ryan J. Burke, Michael T. Bushko, Lauren A. Carroll, Tricia R. Caucci, Kyle J. Chrysler, Emily E. Clauss, Cyler A. Cleary, Ross A. Cohen, Christian A. Coronel, Ariel K. Corrigan-Mills, Audrey E. Cottell, Cameron L. Craig, Sydney M. Crum, Katherine E. Dammer, Frank J. DeFazio, Aidan S. Demkowich, Mary S. Dempsey, Alexander E. Derry, Isabelle B. Dikeman, Cecilia A. Donahoe, Mariah A. Dougherty, Lauren M. Durante, Kazimir J. Fantanarosa, Ashlynn M. Fitzgerald, Evan W. Florey, Skyler L. Fox, Trevor J. Gabura, Kaitlyn R. Gilhooley, Cianna M. Giordano, Austin J. Glidewell, ShaLena L. Gonzalez, Kaleigh T. Greenish, Bristol S. Grenfell, Nathan P. Gronsky, Gregory W. Guditus, Zackary L. Guinup, Isaiah N. Hall-Grzybowski, Alexander M. Hamilton, Joseph A. Harrington, Garrett S. Harris, Amanda K. Hazlett, Cohen L. Hodge, Chelsi A. Hoffmeier, Owen R. Holland, Victoria B. Hood, Sharon J. Houlihan, Arjun Iyengar, Mats M. Jonsson, Mateen Kasim, Julia A. Kasperkowicz, James T. Kazmierski, Benjamin D. Knox, Alexis Koczwara, Paris R. Koehler, Hannah Kowalski, Alyssa M. Kresge, Schyler M. Krieger, Dawn N. Kroptavich, Cassandra L. Ksiazek, Theodore E. Lambert, Jack A. Leightcap, Hannah L. Linker, Alexa A. Longcor, Kiera Lucash, Tara E. Lydon, Carolyn T. Lyon, Isabel K. MacGregor, Samantha E. Machler, Emily M. Mahoney, Emma G. Marion, Christian J. Matsell, Kento Matsui, Meghan McGinley, Molly C. McHale, Alexis L. Mercado, Gabrielle J. Michno, Antonia V. Milas, Clara J. Miller, Mackenzie M. Milo, Haqique Mirza, Alexandria Moletsky, Abigail E. Molnar, Paige E. Morgan, Daniel C. Muller, Sarah E. Murray, Andrew M. Myers, Sarah C. Nealon, Liam Neary, Meghan M. Noone, Halle E. O’Neil, Chase M. Overholser, Pariseema S. Pancholy, Mia Q. Paris, Parth P. Patel, Samantha L. Petty, Seth D. Pollock, Matthew D. Post, Siena Rainey, John R. Rama, Clarie H. Reed, Kailynne P. Riker, Emily E. Royce, Carina D. Salerno, Perri Scott, Phoebe M. Sebring, Kelly B. Seechock, Jonathan P. Sileo, Lauren E. Simakaski, Mia R. Smith, Schuyler E. Smith, April M. Sokalsky, Naudia M. Solan, Jordan D. Spatt, Nichole A. Spencer, Kaila R. Steenback, Samuel C. Stevens, Summer M. Stevens, Dakota K. Stiles, Katelyn G. Stoppe, Talia R. Sullum, Marissa C. Sunick, Maria R. Sutton, Alana N. Swartz, Maria G. Terrinoni, Courtney M. Toroni, Adam P. Traweek, Daniel C. Turshon, Daniel J. Uhranowsky, Anna C. Van Wert, Anshul Verma, Brianna J. Wahlers, Kimberly A. Ward, Benjamin R. Weis, Hannah E. White, Samantha E. Wilkerson, Ariana E. Wisenburn, Elizabeth P. Wright, Khira L. Wudarski and Jonathan R. Yocum.",
    "source_domain": "abingtonsuburban.com",
    "title": "Abington Heights High School honor roll for third quarter of 2017-18",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/school/abington-heights-high-school-honor-roll-for-third-quarter-of-2017-18-1.2337921"
}