{
    "authors": [
        "Julie Jeffery Manwarren"
    ],
    "date_download": "2018-05-31 08:11:26+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fjonathan-and-rachel-strayer-make-their-mark-on-local-theatre-scene-1.2343603.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343601.1527694281!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nJULIE JEFFERY MANWARREN / FOR THE ABINGTON SUBURBAN Jonathan and Rachel Strayer, of Ghostlight Productions, introduced Shakespeare in the Park to the Abingtons in 2009. The upcoming production of ‘Hamlet’ will be the theater group’s 10th Shakespeare in the Park event.\nJonathan and Rachel Strayer met in college and quickly found they shared a passion for drama and theatre.\n“It was something really clear to us, even as college students and initially dating, that we both had a love and passion for theater,” Rachel said. “We felt we were stronger together than separately.”\nThe couple married in 2005.\nThis year, they celebrate a milestone for Ghostlight Productions, their theatre group based in the Abingtons. “Hamlet,” set for the first two weekends in June at South Abington Park, will be their 10th Shakespeare in the Park performance.\nJonathan is an assistant professor and theatre director at Clarks Summit University. Rachel is an assistant professor and theatre director at Keystone College.\nThe couple discussed using drama to engage more with the community. Connecting with friends, Jeremy and Jill Kemmerer, Ghostlight Productions was born. In 2009 they produced their first Shakespeare in the Park event.\n“In the beginning, we had no money,” Rachel shared. “Shakespeare in the Park was an entity that we knew existed, but at the time didn’t have anything like that here. The township came along side of us, allowing the use of space at South Abington Park. We worked with people we already knew and just sort of ran from there.”\nThrough the years, Ghostlight has produced such works as “Twelfth Night,” “Julius Caesar” and “Macbeth.”\n“‘Macbeth’ was a production that Jonathan and I really loved. Jonathan had a vision going in and enjoyed directing it. I got into my role as Lady Macbeth which was a fantastic experience for me. It was also the only year that we didn’t have rain during one of our performances,” Rachel said, laughing. “We do perform rain or shine.\nWe had 51 people show up to audition that year, which was astounding. We worked with people we would have never met otherwise. Many have stayed with us and become part of the Ghostlight family.”\nThis year’s production is supported through the Lackawanna County Arts and Culture Community Grant and the Pennsylvania Council on the Arts Project Grant as well as local sponsors.\nThe Strayers, along with Jeremy Kemmerer, rotate the directing duties. This year, Jonathan Strayer is directing “Hamlet.” He looked at the “First Folio” and every version of “Hamlet” attributed to Shakespeare that he could get his hands on, piecing together a script that felt true to Shakespeare but also met their needs. Jonathan created a work that is concise and action-focused. His result is a strong script that speaks to Shakespeare’s intention.\n“Almost everyone knows the story of ‘Hamlet’, or, at least thinks they do,” Jonathan said. “I want to jar the familiarity out of our audience with a story that starts and ends a bit differently than most ‘Hamlets.’ We also have some pretty great fight scenes that were choreographed by our Fight Director, Jared Kirby out of New York City.”\nWhen they’re not developing scripts, or practicing with their cast, the Strayers enjoy attending theatre, the Pennsylvania Shakespeare Festival, planning costume parties or relaxing at home with their Jack Russell Terrier, who, to no one’s surprise, is named Shakespeare.\nThere isn’t a lot of down time for this powerhouse theatre couple. Rachel, has written several works, including “Drowning Ophelia,” which was produced and performed in California. The play was also directed by Jonathan and performed in Scranton, where it was produced through Gaslight Theatre Company.\nJonathan and Rachel direct productions individually every year for Clarks Summit University and Keystone College. In March, they were able to bring the two drama departments together.\n“We collaborated with Keystone College and CSU to do a joint production of ‘Much Ado About Nothing,’” Rachel said. “We co-directed it and the cast was a mix of students from both schools. It was such a cool experience.”\nThey worked together in January to teach theater classes in South Africa.\nCollaboration seems to be key for the Strayer’s success.\n“We enjoy each other’s creativity.” Rachel shared. “We have different strengths and weaknesses that we have found really complement each other. We can’t imagine not doing this together. Even with our individual projects, we bounce things off each other and I’ll ask ‘What do you think about this?’ It’s just another blessing that we get to share this particular passion and do it together.”\nJonathan agreed, adding, “We love working together. We both wanted to do theatre and found that we were stronger as a collaborative, creative force than not. That doesn’t mean we don’t have solo projects, especially at our respective schools, but we always come back to working together.”\nIn the past, Ghostlight Productions held dinner theatres and stage combat intensives. In 2014, they introduced the Underage Theatre for Young Actors.\nJonathan assures there is more coming from Ghostlight in the future.\n“We almost always have one or two things that we are talking about doing,” he said. “It is really just a matter of time and scheduling. We’ve talked about a play reading series over the next year and an additional combat intensive in the fall.”\n“Hamlet,” Ghostlight Productions’ 10th Shakespeare in the Park production, will be held at South Abington Park behind the basketball courts over the first two weekends in June. Performances are at 6:30 p.m. Fridays and Saturdays, June 1, 2, 8 and 9 and at 2:30 p.m. Sundays, June 3 and 10. Admission is free and attendees are encouraged to bring chairs or blankets to sit on. For more details visit\nghostlightnepa.com.",
    "source_domain": "abingtonsuburban.com",
    "title": "Jonathan and Rachel Strayer make their mark on local theatre scene",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/jonathan-and-rachel-strayer-make-their-mark-on-local-theatre-scene-1.2343603"
}