{
    "authors": [
        "Anne Armezzani"
    ],
    "date_download": "2018-05-31 08:10:47+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fthe-gathering-place-notes-summer-schedule-begins-1.2343595.json",
    "image_url": "http://www.thesuburbanweekly.com/polopoly_fs/1.2343593.1527691652!/fileImage/httpImage/image.jpg_gen/derivatives/landscape_700/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nRadzieski Sznyter\nIt’s chilly, but looking at the colors around us makes it official: winter is over. There’s no mistaking that deep, fresh green of the new grass.\nRobert Frost captured the beauty of spring perfectly when he wrote, “Nature’s first green is gold.”\nAt The Gathering Place (TGP), we welcome everyone to stroll by and visit.\nOur spring classes ended May 22 with the final night of Furniture Refinishing. Class participants brought home “new” furniture remade in their own style. Thanks to Val Langan of Woods and Company for her artistic advice.\nSummer events\nFive events are coming up for the summer, along with several classes. The first is a Medication Take-Back from 10 a.m. to 2 p.m. Saturday, June 2. The public is encouraged to bring expired or unused medications for proper disposal. Thanks to the Volunteer Action Center for this opportunity.\nOur second event is a poetry reading called, “Two Local Ladies Read Their Poetry.” Laurel Radzieski and Daryl Sznyter will read their poetry and talk about writing at 7 p.m. Saturday, June 23.\nRadzieski just published her book of poems, “Red Mother.”\nSznyter will present poems from her debut collection, “Synonyms for (OTHER) Bodies.”\nWhat better way to spend a summer evening than listening to talented ladies creating images through language?\nVisiting TGP, you can view new paintings in our gallery. Our fourth Art Show will open Friday, June 22, with the theme “Land, Sea and Sky.” Anyone interested in being part of this show may send the entry form, available online at\ngatheringplaceCS.org, and a digital file of the pieces submitted by June 8. It’s a joy to wander through TGP on a summer day, admiring art from area artists.\nWe hope to be open more hours for summer and plan on 6-8 p.m. Tuesdays and Thursdays and 10 a.m. to 4 p.m. Wednesdays, Fridays and Saturdays. To make that possible, we are looking for volunteers to be gallery sitters. This official-sounding title simply means a volunteer would be at TGP, relaxing or reading, so others can visit.\nIf you would like to be a gallery sitter, call Anne at 570-881-7612.\nThere’s even more. Why not start your day on June 30 with a quick run around town? The National Running Center will sponsor a 5K Strawberry Run at 9 a.m. and Kids’ Fun Race after the 5K, followed by Strawberry Festival activities.\nYou can enjoy strawberry shortcake, strawberry lemonade, and goods from vendors. Once you are refueled, you can take part in games, with water balloon launching among the favorites. The Festival will run from 9-11:30 a.m.\nSummer classes\nStep into our air-conditioned center and soak up some summer scholarship. Among the classes will be two about opera, taught by Abby Zieger, which will tie into Glimmerglass trips on July 24 and 31. Tickets are still available for “The Barber of Seville.”\nWe will also offer classes on composting with Master Gardener Georgiann Eccleston, home and fire safety with Bob Bass, computer help in PowerPoint and desktop publishing with Lisa Imbriacco, CPR and creative writing for grades 7 to 12.\nMore classes will be added. Watch for details in the newspaper or on our website.\nSaying goodbye\nSaying goodbye to winter is easy. Saying goodbye to friends is not. Like all organizations, TGP has needed leaders to help us fulfill our dream.\nOne of these leaders, especially during the capital campaign, is MaryAnn Nichols, a key factor for our success. She will be moving away and will be greatly missed. We thank her for her dedication, positive outlook, inspiration and grace in bringing TGP to reality.\nSafe travels, MaryAnn, and wishes for happiness in your new home.\nWe hope to see you at The Gathering Place. In the meantime, get out and enjoy that sunshine.\nOr run between the raindrops and smile.\nBecome a volunteer\nThe Gathering Place is seeking volunteers to be gallery sitters. If you like the idea of relaxing at The Gathering Place on a summer afternoon or evening so others can visit the Clarks Summit community and arts center, call Anne at 570-881-7612.",
    "source_domain": "abingtonsuburban.com",
    "title": "The Gathering Place Notes: Summer schedule begins",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/the-gathering-place-notes-summer-schedule-begins-1.2343595"
}