{
    "authors": [
        "Staff Report"
    ],
    "date_download": "2018-05-31 08:10:44+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fschool-briefs-week-of-may-31-2018-1.2343585.json",
    "image_url": "http://www.thesuburbanweekly.com/images/icons/icon_app_medium.png",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nDean’s lists\nBucknell University\nThe following Abington-area students were named to Bucknell University’s dean’s list for outstanding academic achievement during the spring semester. A student must earn a grade point average of 3.5 or higher on a scale of 4.0 to receive dean’s list recognition.\n•Ruhani Aulakh, of Waverly Township, Class of 2019\n•Ceilia Severini, of Clarks Summit, Class of 2018 Clarion University\nJohn M. Walsh, of Dalton was named to the dean’s list for the spring semester at Clarion University of Pennsylvania. To earn placement on the dean’s list, students must be enrolled in at least 12 credits and earn a 3.5 grade point average.\nMansfield University\nSamantha Seidel, of Dalton was named to the spring dean’s list at Mansfield University. To be named to the dean’s list, a student must be attending the university full-time and attain at least a 3.5 GPA for the semester.\nMount St. Mary’s University\nKayla Agentowicz, of Clarks Summit earned dean’s list honors for the spring semester at Mount St. Mary’s University.\nNazareth College\nAudra Nealon, of South Abington Township, was named to the dean’s list for the spring semester at Nazareth College. Nealon is majoring in music therapy. A student’s grade point average must be at least 3.5 or above, and they must complete 12 credit hours of graded work that semester in order to be included on the dean’s list at Nazareth.\nNortheastern University\nJessica Rickwood, of Clarks Summit was named to Northeastern University’s dean’s list for the spring semester. Rickwood is majoring in speech-lang pathol/audiology. To achieve the dean’s list distinction, students must carry a full program of at least four courses, have a quality point average of 3.5 or greater out of a possible 4.0 and carry no single grade lower than a C- during the course of their college career.\nPresident’s list\nMansfield University\nRichard Pollock, of Dalton was named to the Mansfield University president’s list for the spring semester. To be named to the president’s list, a student must attend the university full-time and attain at least a 4.0 QPA for the semester.\nGraduations\nArcadia University\nEmily Sandercock, of Waverly Township, received a Bachelor of Arts in political science during Arcadia University’s undergraduate commencement ceremony on May 18.\nGettysburg College\nBrianna Eagen, of Waverly Township graduated from Gettysburg College on May 20, receiving a Bachelor of Arts.\nLackawanna College\nThe following Abington-area students were awarded degrees or certificates during Lackawanna College’s 124th commencement May 19 in the College’s Student Union in downtown Scranton.\n• Colin Joseph Dietz, of South Abington Township, associate in applied science, accounting\n• Aditya Agrawal, of South Abington Township, associate in science, business administration\n• Dana Charles Williams, of Waverly Township, associate in science, business studies\n• Jack Quinn, of Waverly Township, associate in science, cardiac sonography\n• Danielle Annette Zeplin, of Clarks Summit, associate in science, criminal justice\n• Audrey Jane Ross, of Clarks Summit, associate in science, liberal studies\n• Erik James Hayden, of Dalton, associate in science, petroleum & natural gas technology\n• Chastity Tina Heffley, of Clarks Summit, associate in science, physical therapist assistant\n• Vanessa Lauren Lempicky, of North Abington Township, associate in science, physical therapist assistant\n• Nolan Beth Sweet-Browning, of Clarks Summit, certificate, paramedic\nWilkes University\nWilkes University awarded nearly 800 bachelor’s, master’s and doctoral degrees at its 71st spring commencement ceremonies on May 19. Local residents who received degrees are:\n• Laura Blacker, of South Abington Township, Master of Science in education\n• Abigail Burke, of Clarks Summit, Bachelor of Science in biology\n• Todd Gies, of West Abington Township, Master of Science in education\n• Lindsey Maduro, of Dalton, Master of Science in education\n• Matthew Wheeland, of Clarks Summit, Bachelor of Business Administration in marketing\nAwards &\nhonors\nWilkes University\nAbigail Burke, of Clarks Summit was one of more than 60 graduating seniors recognized for their academic achievement at the annual academic awards ceremony. Burke received the Outstanding Scholar with highest grade point average, presented by the biology & health sciences department and Dr. Michael Steele.",
    "source_domain": "abingtonsuburban.com",
    "title": "School Briefs: Week of May 31, 2018",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/school-briefs-week-of-may-31-2018-1.2343585"
}