{
    "authors": [
        "Staff Report"
    ],
    "date_download": "2018-05-31 08:11:11+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "https%3A%2F%2Fabingtonsuburban.com%2Fnews%2Fcalendar%2Fcommunity-calendar-week-of-may-31-2018-1.2343589.json",
    "image_url": "http://www.thesuburbanweekly.com/images/icons/icon_app_medium.png",
    "language": "en",
    "localpath": null,
    "maintext": "Article Tools Font size – + Share This\nONGOING\nFree yoga classes: Mission Yoga take its Free Community class to South Abington park this summer. Classes will be held Saturdays at 10 a.m. on May 26, June 23, July 28 and August 25. The Free Community yoga class will be open level for one hour. There will be a free kids yoga class for ages 5-10 at the same time. Bring a mat if you have one. If it rains, the class will move into Mission Yoga’s new location across from the park. Info: mission-yoga.com.\nCraft and Chat: A casual setting where artists with and without special needs come together to create and relate. Fridays, June 8, 15 and 22, 10 a.m. at The Gathering Place, 304 South State St., Clarks Summit.\nUPCOMING\nKids’ fishing derby: Lackawanna Federation of Sportsmans Clubs and Lackawanna Valley Trout Unlimited are sponsoring the 68th Annual Kids Fishing Derby for ages 9-15 at Lackawanna State Park on Saturday June 2 from 9 a.m. to 1 p.m.\nClarks Summit Cleanup: Councilman Patrick Williams, in conjunction with PennDOT and DEP, rescheduled the Great Clarks Summit Cleanup for Saturday, June 2, 10 a.m. to noon. Councilman Williams is organizing volunteers to go to area parks and help make them beautiful. Anyone interested and willing to volunteer should wear appropriate attire and meet in the front of the Clarks Summit Borough Building, 304 S. State St. Gloves, trash bags and safety vests for the cleanup will be provided.\nChicken barbecue: The Clarks Green United Methodist Church, 119 Glenburn Road, will hold its 39th annual “Feast of the Chicken BBQ” June 2, noon to 6 p.m. Tickets, available at the door or in advance, are $10 for adults and $5 for children 12 and under. Eat in or take out. Proceeds support programing and operational expenses of the church.\nAHCL banquet: The Abington Heights Civic League’s end of year banquet will be held June 5 at 6 p.m. at Constantino’s, 1385 Lackawanna Trail, Glenburn Township. Items for The Griffin Pond Animal Shelter will be collected. New members are always welcome. For more information call 570-587-3101.\nBlood drive: In partnership with the American Red Cross,\nthe Waverly Community House will host a community blood drive June 6, 10 a.m. to 6 p.m. Whole blood and double red blood cell donations will be taken. Walk-ins are welcome, but those who would like to schedule a donation for a specific time may visit\nredcrossblood.org or call 800-733-2767 to do so. Appointments will also be taken by the main office at the Waverly Community House, 570-586-8191, ext. 2. Download the Red Cross Blood Donor app on the App Store, Google Play or by texting BLOODAPP to 90999. Donors who give blood at this drive will receive a $5 Amazon.com Gift Card, courtesy of Suburban Propane.\nMemory Cafe: A Place where people with memory loss and their caregivers can share a cup of coffee and socialize with others. June 8, 10 a.m. at The Gathering Place, 304 South State St., Clarks Summit. Info: email gatheringplacecs@gmail.com or call 570-575-0384.\nPancake breakfast: Dalton United Methodist Church, 125 S. Turnpike Road, will hold a pancake and sausage breakfast June 9 from 8-11 a.m. The cost is $8 for adults and $4 for children; add eggs for $1.\nDance recital: The students of Joan’s Dance Studio will present “Steps Up on the Stage” June 9, 7:30 p.m. at Clarks Summit Elementary School on West Grove Street. Tickets, available at the door, are $10.\nBook club: The next meeting of the Mysteries and Detectives Book Club will be Tuesday June 12 from 7 to 8:30 p.m. at the Abington Community Library. The book selection for June is Patricia Wentworth’s “Grey Mask” a Miss Silver mystery. The author for July is Elizabeth George.\nMedicare counseling: In partnership with the Voluntary Action Center, the Waverly Community House will host a free informational Medicare counseling session June 13, 5:30-8 p.m. An APPRISE Counselor will be available in the CRB Room in the South Wing of The Comm. For those who are new to Medicare, contemplating retirement or have received mailings from their plan that they don’t understand.\nGolf tourney: The Lackawanna Blind Association will host the 32nd Annual William J. Jordon, M.D., Memorial Swing for Sight Golf Tournament on Monday, June 18 at Glen Oak Country Club in Clarks Summit. For more information and reservations call 570-342-7613.",
    "source_domain": "abingtonsuburban.com",
    "title": "Community calendar: Week of May 31, 2018",
    "title_page": null,
    "title_rss": null,
    "url": "https://abingtonsuburban.com/news/calendar/community-calendar-week-of-may-31-2018-1.2343589"
}