{
    "authors": [],
    "date_download": "2017-04-17 21:40:15+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 12:00:47",
    "description": "SCIENCE You can’t squeeze blood from a stone, but wringing water from the desert sky is now possible, thanks to a new spongelike device that uses sunlight to suck water molecules from air, even in low humidity. (Science) How else is solar energy being harnessed? Teachers, scroll down for a quick list of key resources…",
    "filename": "https%3A%2F%2Fblog.education.nationalgeographic.com%2F2017%2F04%2F17%2Fsolar-powered-device-pulls-water-from-thin-air%2F.json",
    "image_url": "https://natgeoeducationblog.files.wordpress.com/2014/02/34027.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "SCIENCE\nYou can’t squeeze blood from a stone, but wringing water from the desert sky is now possible, thanks to a new spongelike device that uses sunlight to suck water molecules from air, even in low humidity. (Science)\nHow else is solar energy being harnessed?\nTeachers, scroll down for a quick list of key resources in our Teachers Toolkit.\nDiscussion Ideas\nThe great Science article describes a new prototype device that uses solar energy to pull water out of thin air. Where does the water seemingly created by the device actually come from? It really does come from the air, although air is not really all that thin. The air that surrounds our planet is thick with gases such as nitrogen, oxygen, argon, carbon dioxide, helium, neon … and water. (Read our encyclopedic entry to learn more about our amazing atmosphere.) Atmospheric water is probably most obvious to us in humid weather, in which the air contains a large amount of water. However, smaller amounts of atmospheric water are present even in arid climates.\nHow does the water-harvesting device work? Take a look at the great Science diagram for some help. At night, the device is opened, allowing air to flow into a MOF that grabs and holds water molecules. During the day, the chamber is closed, and the sun’s heat causes the MOF to release the water as vapor that condenses and is collected. The device, using one kilogram of MOF, is able to extract 2.8 liters (3 quarts) of water a day from air with humidity as low as 20%.\nWhat obstacles remain for the water harvester? It’s a complex device that can’t be easily assembled by people not working at MIT and Berkeley. The zirconium used in the MOF “costs $150 a kilogram (2.2 pounds), making water-harvesting devices too expensive to be broadly useful.”\nWhy is this water harvester considered such an important development? The device has the potential to help address the freshwater crisis, in which millions of people do not have access to clean freshwater. Learn more about the freshwater crisis with our lesson plan. The device is especially intriguing because it holds potential for use in arid and remote areas that are not connected to a power grid or water pipeline system. The chemist in the video, Omar Yaghi, reminds us that “One-third of the world’s population lives in arid regions, where water is scarce. But the air in those regions contains about 30% humidity.”\nTEACHERS TOOLKIT\nScience: This new solar-powered device can pull water straight from the desert air\nUC Berkeley: Pulling drinkable water out of dry air\nNat Geo: What is solar energy? encyclopedic entry\nNat Geo: Will there be enough freshwater? lesson",
    "source_domain": "blog.education.nationalgeographic.com",
    "title": "Solar-Powered Device Pulls Water from Thin Air",
    "title_page": null,
    "title_rss": null,
    "url": "https://blog.education.nationalgeographic.com/2017/04/17/solar-powered-device-pulls-water-from-thin-air/"
}