{
    "authors": [],
    "date_download": "2017-10-07 02:02:01+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "http%3A%2F%2Fblogs.findlaw.com%2Fblotter%2F2017%2F10%2Fsteven-avery-denied-new-murder-trial-despite-new-evidence.html%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BBlotter%2B%2528FindLaw%2BBlotter%2529.json",
    "image_url": "http://blogs.findlaw.com/blotter/images/findlaw-public-social-logo-600.png",
    "language": "en",
    "localpath": null,
    "maintext": "Despite losing the motion, Avery's attorney has not given up the fight. Apparently, the decision came as a surprise to both sides, as they had recently reached an agreement regarding testing certain pieces of new evidence, and amending the motion for a new trial based upon the anticipated test results. However, the judge considering the motion was unaware of the planned tests and amendment .\n'Making a Murderer' subject Steven Avery had his motion for a new trial denied by a Wisconsin judge this week. The motion for a new trial was based upon new evidence, including DNA evidence and witnesses that were never provided to the defense by the state.\nNew Evidence Not Good Enough\nThe judge ruled that the new evidence presented by Avery's attorneys just was not good enough to make a difference. Specifically, she explained that, weighed against the evidence presented at trial, the expert reports Avery's attorney presented in the motion were ambiguous, and just not strong enough to sway the result.\nIn short, to successfully persuade a judge to grant a new trial, a convicted defendant must be able to show that new evidence is so strong that a reasonable probability exists that it would result in a different outcome. Moving for a new trial is a procedure that is separate from filing an appeal. Generally, either there needs to be new evidence, or some other miscarriage of justice, like juror misconduct or a prosecutor withholding evidence, for a new trial to be granted.\nThe Fight's Not Over\nAt this stage, Avery's attorney is hoping that the ruling can be set aside, or vacated, based upon an agreement between her and the state. However, for this to occur, the court would need to approve the agreement, which may be a tall order, given the judge just dealt with a 1,000 plus page motion with a six page order, and may not want to do so again so soon.\nIf the court does not vacate this ruling, Avery will need to appeal the ruling, which may or may not be successful, as often appeals cannot correct every mistake.\nRelated Resources:",
    "source_domain": "blogs.findlaw.com",
    "title": "Steven Avery Denied New Murder Trial Despite New Evidence",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.findlaw.com/blotter/2017/10/steven-avery-denied-new-murder-trial-despite-new-evidence.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Blotter+%28FindLaw+Blotter%29"
}