{
    "authors": [
        "Molly Zilli"
    ],
    "date_download": "2018-03-20 08:41:18+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "http%3A%2F%2Fblogs.findlaw.com%2Fblotter%2F2018%2F03%2Foklahoma-finds-another-way-to-execute-people.html%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BBlotter%2B%2528FindLaw%2BBlotter%2529.json",
    "image_url": "http://blogs.findlaw.com/blotter/images/findlaw-public-social-logo-600.png",
    "language": "en",
    "localpath": null,
    "maintext": "But while the gas may simplify the execution procedure, critics argue its use is unprecedented, and the legislation was pushed through with little medical research to support it. Since the tactic is untested it could also violate prisoners' rights .\nWhile Oklahoma used to execute people at a relatively high rate compared with the rest of the country, the state took a three-year break after a series of mishaps occurred in its death chambers. Now, as the state looks for more fool-proof ways to put people to death , the legislature has approved Nitrogen as it's go-to killing cocktail.\nLawmakers Looking to Gas Death Row\nPrisons in Oklahoma may begin using nitrogen to execute people later this year. The process -- called \"hypoxia\" -- would work by using nitrogen gas, an asphyxiant, to replace the oxygen in a prisoner's blood stream. Proponents argue that the method is more humane than other techniques as the prisoner would simply lose consciousness and die painlessly.\nWhy Nitrogen?\nAs public support for the death penalty has dropped over the years, so too has the availability of the drugs most commonly used to execute prisoners. Midazolam and pentobarbital, drugs commonly used in lethal injections, have become more and more difficult to procure, forcing state governments to look elsewhere. Nitrogen, on the other hand, is widely available, cheap, and easy to administer -- a plus for a state with a recent history of botched executions.\nAny Objections?\nCritics worry that lawmakers rushed to pass the bill authorizing this low-cost execution method without properly studying this particular application of nitrogen. As public defender, Dal Baich, noted, \"This method has never been used before and is experimental.\" Oklahoma would be the first state to kill death row inmates using nitrogen.\nFrom minor crimes to capital offenses, if you're facing criminal charges, it's important to speak to an attorney as early on in the process as possible.\nRelated Resources:",
    "source_domain": "blogs.findlaw.com",
    "title": "Oklahoma Finds Another Way to Execute People",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.findlaw.com/blotter/2018/03/oklahoma-finds-another-way-to-execute-people.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Blotter+%28FindLaw+Blotter%29"
}