{
    "authors": [
        "Jeffrey Yano"
    ],
    "date_download": "2018-02-03 09:44:43+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "http%3A%2F%2Fblogs.findlaw.com%2Fblotter%2F2018%2F02%2Felon-musk-sells-flamethrowers-are-they-legal-to-own.html%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BBlotter%2B%2528FindLaw%2BBlotter%2529.json",
    "image_url": "http://blogs.findlaw.com/blotter/images/findlaw-public-social-logo-600.png",
    "language": "en",
    "localpath": null,
    "maintext": "Watch out for flamethrower bearing BBQers this summer. Elon Musk, the attention-grabbing entrepreneur behind Tesla and SpaceX, has fired up Twitter and legions of his loyal followers with a brand-spanking new toy -- a commercially available flamethrower .\nThe Future Is Flamethrower?\nMusk's flamethrower has already become a hit. Pre-sales have quickly sold out online. There's no word about future flamethrowers hitting the market, so this might be a gag gift or the start of a new trend. But it raises interesting legal questions which, yes, we're here to blog about.\nIt's Easier to Buy a Flamethrower Than a Gun\nYou might be surprised to learn that only two states regulate flamethrowers. California requires flamethrower users and buyers to have a permit, while Maryland bans them entirely. But you shouldn't be too surprised. There's never been a wave of flamethrower-related violence to spur states and Congress to enact flamethrower laws. Hence their absence.\nAll flamethrowers will ship with a complimentary boring fire extinguisher -- Elon Musk (@elonmusk) February 1, 2018\nThat might change soon, however. California is already rumbling about a ban on flamethrower sales, and we'd expect other states to follow if necessary.\nUse Your Flamethrower Wisely\nWhat's always prohibited are crimes -- no matter what's used to commit them. Most criminal laws criminalize actions - murder, kidnapping, assault, etc. -- and \"add on\" counts or prison time for using prohibited items.\nELON I BOUGHT 6 FLAMETHROWERS NOW THE TSA IS TELLING ME I'M ON SOME SORT OF WATCHLIST?!? WHAT HAVE I DONE PLEASE HELP -- Riccardo \"fluffyblockchain\" Spagni (@fluffypony) February 1, 2018\nThose definitions are flexible: a car can be deadly weapon, as can be a surgeon's hands. A flamethrower might pose an interesting case for an appellate court someday, but it's not something we'd expect to be a winning argument.\nRelated Resources",
    "source_domain": "blogs.findlaw.com",
    "title": "Elon Musk Sells Flamethrowers: Are They Legal to Own?",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.findlaw.com/blotter/2018/02/elon-musk-sells-flamethrowers-are-they-legal-to-own.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Blotter+%28FindLaw+Blotter%29"
}