{
    "authors": [],
    "date_download": "2017-10-07 02:01:59+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "http%3A%2F%2Fblogs.findlaw.com%2Fblotter%2F2017%2F10%2Fmom-jailed-for-not-vaccinating-son.html%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BBlotter%2B%2528FindLaw%2BBlotter%2529.json",
    "image_url": "http://blogs.findlaw.com/blotter/images/findlaw-public-social-logo-600.png",
    "language": "en",
    "localpath": null,
    "maintext": "This week, Michigan mom Rebecca Bredow was sentenced to seven days in jail for failing to vaccinate her 9-year-old son, but her real crime was ignoring a consent order to do so.\nVaccinations have been a hot topic for years now, and even with little evidence they are harmful to children , many parents are choosing to not vaccinate their kids. And for the most part, that's OK, legally speaking. But there are a few exceptions to that rule, and one of them is when a judge orders you to vaccinate your child.\nShots Fired\nFiguring out child care decisions after a divorce can be complicated enough. According Bredow, she and her ex-husband, James Horne agreed to suspend immunizations when their son was 2 years old, and he hasn't received a vaccination since. Despite her claims that Horne is only using the vaccination issue as leverage in their custody battle, Bredow's attorney signed a November court order for vaccination, a move Judge Karen McDonald interpreted as Bredow's consent to vaccinations.\n\"I understand you love your children. But what I don't think you understand is that your son has two parents, and dad gets a say,\" McDonald told Bredow during a court hearing this week. \"It's clear to me that you don't care about orders even if you agree to them, which you did.\" McDonald found Bredow guilty of contempt and sentenced her to seven days, handing over temporary custody of the child to Horne.\nVax Law\nWhile vaccinations aren't, for the most part, legally mandatory, many schools will require vaccines for attendance and some states will require vaccines for attendance at any public school. Even so, a majority of states still provide exemptions for vaccinations on religious grounds, and many, including Michigan, also provide exemptions for and personal reasons.\nThere may be civil liability for not vaccinating your children, and possibly even criminal liability for not seeking the proper medical care for your children. Vaccinations and the law is still a bit of a gray area, so consult an attorney about your rights and responsibilities as a parent.\nRelated Resources:",
    "source_domain": "blogs.findlaw.com",
    "title": "Mom Jailed for Not Vaccinating Son",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.findlaw.com/blotter/2017/10/mom-jailed-for-not-vaccinating-son.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Blotter+%28FindLaw+Blotter%29"
}