{
    "authors": [],
    "date_download": "2017-10-07 02:02:03+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": null,
    "filename": "http%3A%2F%2Fblogs.findlaw.com%2Fblotter%2F2017%2F10%2Ftop-5-things-to-know-about-criminal-appeals.html%3Futm_source%3Dfeedburner%26utm_medium%3Dfeed%26utm_campaign%3DFeed%253A%2BBlotter%2B%2528FindLaw%2BBlotter%2529.json",
    "image_url": "http://blogs.findlaw.com/blotter/images/findlaw-public-social-logo-600.png",
    "language": "en",
    "localpath": null,
    "maintext": "But the appeals process isn't quite as simple as saying, \"I didn't like the verdict.\" Nor is it as interminable as many think. Here's what you need to know about criminal appeals.\nWe tend to get most of our legal information, especially in the criminal context, from television and movies, with the odd, sensationalized news story thrown in. And that's true when it comes to criminal appeals as well: prisoners on death row can delay their execution for years on appeal; good convictions get tossed out on a technicality, bad convictions get overturned after an innocent person spends decades in prison; DNA evidence exonerates someone sentenced to die.\n1. When Can You Appeal a Conviction?\nWhile an appeal, naturally, can't be filed until after a conviction, the grounds for the appeal often must be laid far in advance of a verdict. While nearly all defendants are granted the right of at least one appeal, and an attorney for that appeal, the reasons for the appeal will vary, and will need to be convincing to overturn a conviction.\n2. 5 Signs You May Have Ineffective Counsel\nOne of those reasons is that your attorney was ineffective. Unfortunately, the bar for ineffectiveness is a bit higher than your lawyer not getting you acquitted. Defendants generally need to prove that but for their counsel's incompetence, the outcome of the trial would've been different.\n3. What Is Harmless Error\nThere are also varying standards upon which appeals are judged. A criminal investigation or trial need not be perfect to survive an appeal. Even if a trial ruling is erroneous, if that error would not have altered the outcome of the trial, it is deemed harmless and the conviction will stand.\n4. Death Row Appeals: Rights and Limitations\nPeople often bemoan how long inmates sit on death row in between their conviction and their execution. But in matters of life and death, courts don't want there to be any mistakes. And with so many prisoners being exonerated by DNA evidence, there's no reason to rush things.\n5. Criminal Resentencing: How Does It Work?\nNot all successful appeals mean freedom for the defendant. You can also appeal a sentence, and have your sentence changed. Here's how it works.\nRelated Resources:",
    "source_domain": "blogs.findlaw.com",
    "title": "Top 5 Things to Know About Criminal Appeals",
    "title_page": null,
    "title_rss": null,
    "url": "http://blogs.findlaw.com/blotter/2017/10/top-5-things-to-know-about-criminal-appeals.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+Blotter+%28FindLaw+Blotter%29"
}