{
    "authors": [
        "Connor Wilkie",
        "Dennis St. Pierre"
    ],
    "date_download": "2018-02-03 07:45:13+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 20:40:09",
    "description": null,
    "filename": "http%3A%2F%2Falgonquintimes.com%2Fnews%2Fstudent-who-suffered-serious-injury-in-c-building-staircase-dies%2F.json",
    "image_url": "http://algonquintimes.com/wp-content/uploads/2014/01/at-banner1.png",
    "language": "en",
    "localpath": null,
    "maintext": "A student who was found injured and unconscious in a stairwell in the College’s C Building Jan. 17 has died.\nAlgonquin president Cheryl Jensen issued a statement to the college community at 3:15 p.m. Feb. 2.\n“I first want to offer my heartfelt condolences to the family of this student,” wrote the president. “I would ask that everyone keep them in their thoughts and prayers. I know our entire Algonquin community, especially this student’s friends, classmates, professors and mentors, will be grieving this terrible loss. I have reached out to the student’s family to offer any assistance our College can provide.”\nShe asked that the privacy of the student’s loved ones be respected and the college would not be providing further details.\n“For this reason, I would ask everyone to be mindful of our College values in your interactions, online and in person.”\nShe also reminded the community that there are supports in place to help anyone cope with the tragic news.\nOfficially termed an accident at the time, the cause and the circumstances behind the death remain unknown.\nWhat is known is that emergency crews were called immediately when the accident was discovered just before 4 p.m. on Jan. 17. The male student was taken to hospital for treatment of injuries.\nThere is extensive construction going on in and around that area of the college as the new innovation centre takes shape, though there has been no suggestion by the college or police that the accident may be linked to the activity.\nFurther information will be made available pending the police investigation.",
    "source_domain": "algonquintimes.com",
    "title": "Student who suffered serious injury in C building staircase dies",
    "title_page": null,
    "title_rss": null,
    "url": "http://algonquintimes.com/news/student-who-suffered-serious-injury-in-c-building-staircase-dies/"
}