{
    "authors": [
        "Dennis St. Pierre"
    ],
    "date_download": "2018-02-03 07:45:23+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 19:36:52",
    "description": null,
    "filename": "http%3A%2F%2Falgonquintimes.com%2Fopinions%2Fits-a-good-time-to-have-bad-eyes%2F.json",
    "image_url": "http://algonquintimes.com/wp-content/uploads/2018/02/Unknown.png",
    "language": "en",
    "localpath": null,
    "maintext": "I can recall multiple times where something I’ve taken for granted became a challenge. Simple things like sleeping or showering are made difficult .\nYou could say having poor vision is unfortunate but for me, and a large chunk of the population, it’s a reality.\nBut guess what? I can see and do anything anyone can, thanks to corrective lenses.\nWhether I’m waking up in the morning or going to sleep at night, the one thing that remains the same in my routine is my need to see.\nI get up I put on glasses, I go to sleep I take off my glasses. Every morning and every night, it’s the same thing. I take them off, I can’t see, I put them on — perfect vision.\nMy eyes are bad and there’s no way around it. It doesn’t matter how much I wish that one day I wake up to perfect vision, it it will never happen.\nMost of my life I’ve needed either glasses or contacts to be able to function on a day-to-day basis. Yes I hate having to wear them all the time but at the same time they’re one of the things I’m most grateful for.\nWithout them I wouldn’t be able to see what life offers. I’d be stuck wondering what everything truly is. Obviously they’re not nearly as comfortable as wearing nothing, but I’ll take the discomfort over not being able to see a TV that’s four feet in front of me.\nI’ve played sports that involve helmets my entire life and, unfortunately for me, they don’t make helmets so that glasses can fit under them.\nEnter contact lenses.\nWhen I first started wearing contacts I hated them. Sticking my finger in my eye every day clearly caused discomfort but it ultimately allowed me to play sports without any setbacks.\nFrom time to time I’ll just be sitting and my vision will go blurry, evidently a result of one contact falling out. That may be one of the most annoying things that can happen. I have to hope I can find the contact and safely put it back in my eye or else I’ll be stuck with great vision in one eye and horrible vision in the other.\nWhen most people wake up they get up and get on with their day. For me the first thing I need to do is grab my glasses or find a mirror and insert my contacts. Having to rely on something like my glasses/contacts obviously sucks, but it’s also amazing how a lens can make such an impact on someone’s life.\nWith modern technology there are procedures that enable people who wear corrective lenses, to ultimately not wear them.\nWhat an amazing time to be alive.\nThere are obviously risks, side effects and costs involved with it, but all in all it’s a pretty good time to have bad eyes.\nAs much as I wish I were the guy with 20/20 vision, I can certainly say I love glasses and contacts. I’ll continue to have this love/hate relationship with corrective lenses but I can safely say my life has been saved by one of the greatest creations in human history.",
    "source_domain": "algonquintimes.com",
    "title": "It’s a good time to have bad eyes",
    "title_page": null,
    "title_rss": null,
    "url": "http://algonquintimes.com/opinions/its-a-good-time-to-have-bad-eyes/"
}