{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 14:58:18+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:35:35",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fmortgage-foreclosure-notice-of-mortgage-foreclosure-sale-1401%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "THE RIGHT TO VERIFICATION OF THE DEBT AND IDENTITY OF THE ORIGINAL CREDITOR WITHIN THE TIME PROVIDED BY LAW IS NOT AFFECTED BY THIS ACTION.\nNOTICE IS HEREBY GIVEN: That default has occurred in the conditions of the following described mortgage:\nDATE OF MORTGAGE:\nOctober 27, 2003\nORIGINAL PRINCIPAL AMOUNT OF MORTGAGE: $235,760.18\nMORTGAGOR(S): Jason E. Henricksen and Bonnie K. Henricksen, husband and wife\nMORTGAGEE: CitiFinancial Mortgage Industrial Loan Company, a Minnesota corporation\nDATE AND PLACE OF FILING: Recorded on November 5, 2003 as Document Number 1870341.0 in the Office of the County Recorder of Anoka County, Minnesota.\nASSIGNMENTS OF MORTGAGE: Assigned to: Kondaur Capital Corporation, as separate trustee of Matawin Ventures Trust Series 2014-4 by assignment recorded on June 8, 2015 as Document Number 2109913.001; corrected of record by Corrective Assignment of Mortgage recorded on November 30, 2015 as Document No. 2124223.005 in the Office of the County Recorder of Anoka County, Minnesota; thereafter assigned to Wilmington Savings Fund Society, FSB, d/b/a Christiana Trust, as Owner Trustee of the Residential Credit Opportunities Trust III by assignment recorded on August 2, 2017 as Document Number 2177339.001 in the Office of the County Recorder of Anoka County, Minnesota.\nLEGAL DESCRIPTION OF PROPERTY: Lot 2, Block 2, River Pines 1st Addition, Anoka County, Minnesota.\nSTREET ADDRESS OF PROPERTY: 5850 157TH LANE, RAMSEY, MN 55303\nCOUNTY IN WHICH PROPERTY IS LOCATED:\nAnoka County, Minnesota.\nTHE AMOUNT CLAIMED TO BE DUE ON THE MORTGAGE ON THE DATE OF THE NOTICE: $344,136.99\nTRANSACTION AGENT: None\nNAME OF MORTGAGE ORIGINATOR: CitiFinancial Mortgage Industrial Loan Company, a Minnesota corporation\nRESIDENTIAL SERVICER:\nFCI Lender Services, Inc.\nTAX PARCEL IDENTIFICATION NUMBER: 14-32-25-43-0013\nTRANSACTION AGENTS MORTGAGE IDENTIFICATION NUMBER: None\nTHAT no action or proceeding has been instituted at law to recover the debt then remaining secured by such mortgage, or any part thereof, or, if the action or proceeding has been instituted, that the same has been discontinued, or that an execution upon the judgment rendered therein has been returned unsatisfied, in whole or in part.\nPURSUANT, to the power of sale contained in said mortgage, the above described property will be sold by the Sheriff of said county as follows:\nDATE AND TIME OF SALE:\nDecember 1, 2017 at 10:00 AM.\nPLACE OF SALE: Anoka County Sheriffs Office, 13301 Hanson Boulevard NW, Andover, Minnesota.\nto pay the debt then secured by said mortgage and taxes, if any actually paid by the mortgagee, on the premises and the costs and disbursements allowed by law. The time allowed by law for redemption by said mortgagor(s), their personal representatives or assigns is six (6) months from the date of sale.\nTIME AND DATE TO VACATE PROPERTY: Unless said mortgage is reinstated or the property redeemed, or unless the time for redemption is reduced by judicial order, you must vacate the premises by 11:59 p.m. on June 1, 2018.\nTHE TIME ALLOWED BY LAW FOR REDEMPTION BY THE MORTGAGOR, THE MORTGAGORS PERSONAL REPRESENTATIVES OR ASSIGNS, MAY BE REDUCED TO FIVE WEEKS IF A JUDICIAL ORDER IS ENTERED UNDER MINNESOTA STATUTES, SECTION 582.032, DETERMINING, AMONG OTHER THINGS, THAT THE MORTGAGED PREMISES ARE IMPROVED WITH A RESIDENTIAL DWELLING OF LESS THAN FIVE UNITS, ARE NOT PROPERTY USED IN AGRICULTURAL PRODUCTION, AND ARE ABANDONED.\nMORTGAGOR(S) RELEASED FROM FINANCIAL OBLIGATION ON MORTGAGE: Jason E. Henricksen and Bonnie K. Henricksen\nDated: September 29, 2017\nWILMINGTON SAVINGS FUND SOCIETY, FSB, D/B/A CHRISTIANA TRUST, AS OWNER TRUSTEE OF THE RESIDENTIAL CREDIT OPPORTUNITIES TRUST III\nMortgagee\nTHE ACADEMY LAW GROUP, P.A.\nBy: /s/\nRebecca F. Schiller, Esq.\nN. Kibongni Fondungallah, Esq.\nSamuel R. Coleman, Esq.\n*Corbin C. Smith, Esq.*\nAttorneys for Mortgagee\nThe Academy Professional Building\n25 Dale Street North\nSt. Paul, MN 55102\n(651) 209-9760\n(17-0874-FC01)\nChris Irk\nAttorney\nLicensed to practice law in IL (6300084), IA (AT0012899), MN (0397886) & WI (1101191)\nWirbicki Law Group LLC\n33 W. Monroe Street, #1140\nChicago, IL 60603\n(312) 360-9455 ext. 7334\nFax: 312-360-9461\nwww.wirbickilaw.com\nTHIS IS A COMMUNICATION FROM A DEBT COLLECTOR.\nPublished in the\nAnoka County UnionHerald\nOctober 6, 13, 20, 27,\nNovember 3, 10, 2017\n740520",
    "source_domain": "abcnewspapers.com",
    "title": "Mortgage Foreclosure - NOTICE OF MORTGAGE FORECLOSURE SALE",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/mortgage-foreclosure-notice-of-mortgage-foreclosure-sale-1401/"
}