{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 16:29:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:42:15",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fadvertisement-for-bidsproposa-independent-school-district-no-16-4%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "SPRING LAKE PARK, MN\nNOTICE OF BID\nIndependent School District No. 16, Spring Lake Park, Minnesota, is presently soliciting competitive Prime Contract Bids for the Spring Lake Park High School Phase 2 Renovations Project. Sealed bids in duplicate will be received at Spring Lake Parks District Service Center, 1415 81st Ave NE, Spring Lake Park, MN 55432. No other agent is authorized to receive bids. Bids will be received until 2:00PM local time, on Tuesday, October 24th, 2017 at which time they will be publicly opened and read aloud. Bidders are invited to attend. Bids received after this time will be returned unopened.\nThe complete Bid Form shall be submitted without alterations, additions, or erasures. All bids shall be on a lump sum basis. No bid may be withdrawn for a period of 60 days after bid receipt without consent of the Owner. Each bidder shall accompany the Bid Form with a bid security as described in the Instructions to Bidders. The Owner reserves the right to reject any or all bids and to waive any irregularities in bids.\nThis project involves: Significant renovation of the existing high school two story classroom building as well as the auto shop and wood shop areas.\nDirect communications regarding this Project to the office of the Construction Manager: Jason Rentmeester ([email protected]) Kraus-Anderson(R) Construction, 8625 Rendova Street NE, P.O. Box 158, Circle Pines, MN, 55014, Tel: 612-366-4672.\nObtain Bidding Documents, including the Bid Form, Drawings and Specifications, via free electronic download by visiting www.isqft.com. Contact Kari Aufrere with any plan room downloading or ordering questions at 612-335-2796 or [email protected] to receive an invite. Printer and Kraus-Anderson will not be responsible for notifying individual parties who obtained documents without completing the checkout process, when Addenda are issued.\nBidding Documents will be available for inspection at: Minneapolis Builders Exchange, St. Paul Builders Exchange, ISQFT, Franz Reprographics, McGraw Hill, and Reed Construction Document Processing.\nA Pre-Bid conference will be held at the following locations and times:\nSpring Lake Park District Service Center:\nMonday, October 16, 2017 at 10:00AM.\nIndependent School District No. 16\nSpring Lake Park, Minnesota\nPublished in the\nBlaine/Spring Lake Park Life\nOctober 6, 13, 2017\n741174\nhttp://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/741174-1.pdf",
    "source_domain": "abcnewspapers.com",
    "title": "Advertisement For Bids/Proposa - INDEPENDENT SCHOOL DISTRICT NO. 16",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/advertisement-for-bidsproposa-independent-school-district-no-16-4/"
}