{
    "authors": [
        "Olivia Alveshere",
        "Staff Writer",
        "Since",
        "I Have Primarily Covered The Anoka-Hennepin",
        "Spring Lake Park School Districts As Well As The City Of Spring Lake Park For Abc Newspapers."
    ],
    "date_download": "2017-10-06 17:59:57+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 12:45:24",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fnorthern-starz-stages-first-adult-production%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/ARTSNorthernStarz.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Since 2013, I have primarily covered the Anoka-Hennepin and Spring Lake Park school districts as well as the city of Spring Lake Park for ABC Newspapers.\nAfter staging its first young adult production in August, Northern Starz Children’s Theatre continues to cast a wider net when it comes to casting.\n“Death by Arrangement,” opening Oct. 12, features a cast comprised entirely of adults, including four parents of regular Northern Starz child actors.\n“I think there’s a need for it in the area,” said Rachel Bohnsack, executive director of the theater. “There’s not a lot of adult theater.”\nBohnsack compares the Northern Starz Players community theater troupe’s first production to the movie “Clue,” a “comedic whodunit.”\nSet in London, the show follows Detective Sergeant as he tries to solve the murder of Evan MacKenzie. It seems everyone in his house had a reason to want him dead and sufficient time to execute the murder.\n“It’s funny. It keeps you on your toes and keeps you guessing,” Bohnsack said.\nThe show runs at the Ramsey theater, 5300 Alpine Drive NW, Oct. 12-15.\nThe curtain rises at 7 p.m. Oct. 12-14 with matinee performances at 2 p.m. Oct. 14 and 15.\nTickets are available at www.northernstarz.org. They cost $10 for adults and $7 for students and seniors.\nThe theater has additional new ventures on the horizon: Northern Starz will be the first theater in Minnesota to participate in the Penguin Project program, which helps youth with special needs stage a musical. Additionally, the newly formed Social Interest Troupe will get kids involved in productions that tackle today’s issues.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Northern Starz stages first adult production",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/northern-starz-stages-first-adult-production/"
}