{
    "authors": [
        "Olivia Alveshere",
        "Staff Writer",
        "Since",
        "I Have Primarily Covered The Anoka-Hennepin",
        "Spring Lake Park School Districts As Well As The City Of Spring Lake Park For Abc Newspapers."
    ],
    "date_download": "2017-10-06 18:00:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 11:45:33",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fneighborhood-crime-watch-program-gets-a-reboot%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/Neighborhood-watch-1024x683.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Since 2013, I have primarily covered the Anoka-Hennepin and Spring Lake Park school districts as well as the city of Spring Lake Park for ABC Newspapers.\nThe Anoka Police Department is looking to revive its Neighborhood Crime Watch program and is seeking neighborhood block captains. The Anoka Police Department is working to relaunch the Neighborhood Crime Watch program in the city. File photo\nThe program, which seeks to connect neighbors in order to prevent and expediently report crime, was cut about a decade ago with slashes to the budget and insufficient staffing levels to sustain it, according to Officer Paul Schley, head of the Community Oriented Policing and Problem Solving division of the Anoka Police Department.\nIn his first year as Anoka’s police chief, Eric Peterson is working to reduce any public unease.\n“One of my initiatives is to decrease the fear of crime in our community,” Anoka Police Chief Eric Peterson said. “I have realized that we need to have our community watching out for each other.”\nPeterson was sworn in as chief in November 2016. Days later, 95-year-old Albert Loehlein was found beaten to death in his Anoka home.\nPeterson, with the Anoka County Attorney’s Office and Sheriff’s Office, held informational meetings for seniors feeling unsafe in their homes, and he started a new department tradition, Cookout with Cops, in August.\nResuscitating the Neighborhood Crime Watch program will be another step to keep the community connected.\n“People want to know what’s going on in their community,” Schley said. And “without the general public, we can’t solve crime.”\nCrime was up in Anoka in 2016 with 20,947 calls for service coming through Anoka County Central Communications. In 2015, there were 820 fewer calls, and 2015 marked an increase of 2,139 calls from 2014, according to police data.\nProperty crimes in particular have seen increases: In 2016, burglary was up 65 percent from the previous year with 68 instances in the city. Robbery was up 37.5 percent from 8 to 11. Theft was up less dramatically – 4 percent – with 517 instances in 2016 compared with 497 in 2015. Auto theft specifically was up 50 percent with 36 instances recorded.\nPeterson is hopeful these instances will decrease with the Neighborhood Watch Program keeping chains of communication open between neighbors.\n“We need to enlist the help of each individual neighborhood,” he said. “Now is the perfect time to do that.”\nNeighborhood block captains will serve as liaisons with police, setting up community meetings and trainings and sharing ideas.\nIndividuals interested in serving as block captains are asked to contact Nicole Neis, crime prevention technician, at 763-576-2807 or [email protected].\nAn initial meeting with potential block captains will be held sometime in early November, according to Schley.\nTechnology will make it easier for block captains to communicate with police than it might have been the last time the program was operation.\nCrime mapping software was implemented in Anoka a little over a year ago.\n“It’s really an underutilized tool by the public,” Schley said.\nTo see crimes reported in Anoka, visit www.communitycrimemap.com.\nEditor Mandy Moran Froemming contributed to this report.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Neighborhood Crime Watch program gets a reboot",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/neighborhood-crime-watch-program-gets-a-reboot/"
}