{
    "authors": [
        "Sun Editor"
    ],
    "date_download": "2017-10-06 19:29:57+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 13:28:55",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fecm-editorial-understand-school-district-needs-before-casting-your-ballots%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Tuesday, Nov. 7, is an election day focused on local governmental issues. Many areas of Minnesota will have ballots for city officials, school board members, township officers, park district board members and local ballot questions.\nYour participation in these elections is very important. If you have questions the Minnesota Secretary of State’s web page (sos.state.mn.us) presents a section entitled “What’s On My Ballot?” You should also notice that early voting has begun. Absentee ballots cast before Election Day are an increasingly important part of Minnesota’s election process.\nIn all, 46 Minnesota school districts will have operating levy questions on the ballot and 39 will present voters with bonding questions for new or remodeled facilities. These are significant if not critical issues for your schools and we urge you to give these ballot questions careful and informed attention.\nThere is a basic difference between a bond question and an operating levy question.\nOperating Levy Questions\nSo what is an operating levy question? Generally it is a question on the ballot asking for property tax support for the running of the schools. In some districts it is a renewal of a previously voter-approved tax levy. In some instances the operating levy request will be divided into two or more questions, each addressing a specific but different need. The questions may include an annual increase for inflation.\nIn the past 15 to 20 years, voter-approved tax levies have become a basic part of Minnesota school funding. During those years the amount of state funding hasn’t kept pace with basic inflationary costs. Program requirements have also been added to school responsibilities without adequate state funding.\nThe voter-approved operating levy procedure has become a necessary tool for school districts dealing with funding issues. These property tax levies aren’t for “extras” but for curriculum, programs, services and class size. Your vote may make a difference. Students in districts where voters have approved operating levies typically are at an advantage to students in districts where levies were not approved.\nBond Questions\nA bond question asks voters for approval to borrow money for projects related to facility and capital equipment needs. The bond is like a mortgage. The monies aren’t used to run the schools but to build, maintain and/or equip the schools.\nThe bond calls for a payback period of a specific number of years. Bonds for new schools, for example, often have a 20-to-30 year payback. Equipment bonds may have a payback of 5-to-10 years, depending on the projected life of the equipment.\nEach district’s request is unique to that district’s needs. Student population growth demands additional space. Shift in student population location requires new schools in areas where neither schools nor homes had been located before. Changes in technology and higher expectations for student learning require space and equipment to provide opportunity for quality learning.\nStudent safety is a greater need today than it was for previous generations and it has become more difficult to keep schools safe and secure. Safety and health improvements are costly and often require bond support for implementation.\nThe reason the proposed bond and levy issues are referred to as ballot “questions” is because your vote on those issues is based on a yes or no answer. But the real question, and it is a question not a foregone conclusion, is “how will my vote affect the students in our schools?”\nEach school district should have completed a study process, open to the public, to determine the needs on which the ballot questions are based. Each question should be accompanied with an analysis of what will happen for the students if the issues are approved and what will happen if they are voted down. These answers and support data should be available to the public in either print form, on-line and/or in public forums.\nWe encourage voters to find those answers and consider the impact of their vote on students. School districts have a responsibility to inform the voters of consequences of their vote. We encourage and expect school districts to make that information readily available for voters to consider.\nParents of students now enrolled in the schools have the clearest focus of the consequences of a yes or no vote. However, community members without students in the schools have a responsibility to be informed on these questions because it is their community that will be defined by the management of these schools.\n– An opinion of the ECM Publishers Editorial Board. Reactions to this editorial — and to any commentary on these pages – are always welcome. Send to: [email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "ECM Editorial: Understand school district needs before casting your ballots",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/ecm-editorial-understand-school-district-needs-before-casting-your-ballots/"
}