{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 14:58:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:35:05",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fmortgage-foreclosure-notice-of-assessment-lien-foreclosure-sale-60%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "NOTICE IS HEREBY GIVEN that default has been made in the terms and conditions of the Declaration of Spring Crest Homeowners Association (henceforth the Declaration) recorded in the office of the Recorder for Anoka County, Minnesota on September 27, 1984, as Document No. 654837, which covers the following property:\nLot 13, Block 1, Spring Crest Estates, according to the recorded plat thereof, and situate in Anoka County, Minnesota\nWHEREAS, pursuant to said Declaration, there is claimed to be due and owing as of September 29, 2017, from Toni Yurich, title holder, to Spring Crest Homeowners Association, a Minnesota non-profit corporation, the principal amount of Six Thousand, Eight Hundred Fifty-Seven and 61/100ths Dollars ($6,857.61) for assessments, late fees and related charges, plus assessments, collection costs, attorneys fees and other amounts will be incurred since said date, including costs of collection and foreclosure;\nWHEREAS, no action is now pending at law or otherwise to recover said debt or any part thereof;\nWHEREAS, the owner has not been released from the financial obligation to pay said amount;\nWHEREAS, pursuant to the Declaration, said debt created a lien upon said premises in favor of Spring Crest Homeowners Association as evidenced by the amended lien statement recorded on September 14, 2017, in the office of the Anoka County Recorder as Document No. 2180862.006;\nWHEREAS, pursuant to the power of sale granted by the owner(s) in taking title to the premises subject to said Declaration, said lien will be foreclosed by the sale of said property by the sheriff of said county at the Anoka County Sheriffs Department, 13301 Hanson Boulevard NW, Andover, Minnesota, on November 22, 2017, at 10:00 oclock a.m., at public auction to the highest bidder, for cash, to pay the amount then due for said assessments, together with the costs of foreclosure, including attorneys fees as allowed by law. The time allowed by law for redemption by the unit owners, their personal representatives or assigns is six (6) months from the date of said sale.\nThe following information is provided pursuant to Minnesota Statutes Sections 580.025 and 580.04:\n(1) Street Address of Property: 534 78th Avenue NE, Spring Lake Park, MN 55432\n(2) Name of Transaction Agent, Residential Mortgage Servicer, Lender &/or Broker: N/A\n(3) Tax Parcel Identification Number of the Property: 02-30-24-43-0076\n(4) Transaction Agents Mortgage Identification Number, if known: N/A\n(5) Name of Mortgage Originator, if stated on mortgage: N/A\n(6) Date on which Occupant must vacate Property, if mortgage is not reinstated under Section 580.30 or property redeemed under 580.23: 11:59 p.m. on May 22, 2018. If the foregoing date is a Saturday, Sunday or legal holiday, then the date to vacate is the next business day at 11:59 p.m.\nREDEMPTION NOTICE\nTHE TIME ALLOWED BY LAW FOR REDEMPTION BY THE MORTGAGOR, THE MORTGAGORS PERSONAL REPRESENTATIVES OR ASSIGNS, MAY BE REDUCED TO FIVE WEEKS IF A JUDICIAL ORDER IS ENTERED UNDER MINNESOTA STATUTES, SECTION 582.032, DETERMINING, AMONG OTHER THINGS, THAT THE MORTGAGED PREMISES ARE IMPROVED WITH A RESIDENTIAL DWELLING OF LESS THAN FIVE UNITS, ARE NOT PROPERTY USED FOR AGRICULTURAL PRODUCTION, AND ARE ABANDONED.\nDated: September 29, 2017\nTOOHEY LAW FIRM, P.A.\nBy: Jennifer C. Toohey,\nI.D. #0343742\nAttorneys for Lienor\n11660 Theatre Drive, Suite 280\nChamplin, MN 55316\n(763) 401-4120\nLienor:\nSpring Crest Homeowners Association\nBy: Jennifer C. Toohey\nIts: Attorney in Fact\nTHIS INSTRUMENT WAS DRAFTED BY:\nTOOHEY LAW FIRM, P.A.\n11660 Theatre Drive, Suite 280\nChamplin, MN 55316\n(763) 401-4120\nFile No. 7014.002\nPublished in the\nAnoka County UnionHerald\nOctober 6, 13, 20, 27,\nNovember 3, 10, 2017\n740440",
    "source_domain": "abcnewspapers.com",
    "title": "Mortgage Foreclosure - NOTICE OF ASSESSMENT LIEN FORECLOSURE SALE",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/mortgage-foreclosure-notice-of-assessment-lien-foreclosure-sale-60/"
}