{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 16:29:11+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:41:46",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fmortgage-foreclosure-notice-of-mortgage-foreclosure-sale-1408%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "THE RIGHT TO VERIFICATION OF THE DEBT AND IDENTITY OF THE ORIGINAL CREDITOR WITHIN THE TIME PROVIDED BY LAW IS NOT AFFECTED BY THIS ACTION.\nNOTICE IS HEREBY GIVEN, that default has occurred in conditions of the following described mortgage:\nDATE OF MORTGAGE: May 29, 2015\nMORTGAGOR: Jessica R. Truesdale, a married woman.\nMORTGAGEE: Mortgage Electronic Registration Systems, Inc.\nDATE AND PLACE OF RECORDING: Filed June 1, 2015, Anoka County Registrar of Titles, Document No. 530829.002 and also by Corrective Mortgage Recorded December 30, 2016, Document No. 544983.005 on Certificate of Title No. 129896.\nASSIGNMENTS OF MORTGAGE: Assigned to: Lakeview Loan Servicing, LLC. Dated September 19, 2017 Filed September 20, 2017, as Document No. 551525.001.\nSaid Mortgage being upon Registered Land.\nTRANSACTION AGENT: Mortgage Electronic Registration Systems, Inc.\nTRANSACTION AGENTS MORTGAGE IDENTIFICATION NUMBER ON MORTGAGE:\n100109800002943000\nLENDER OR BROKER AND MORTGAGE ORIGINATOR STATED ON MORTGAGE: Plaza Home Mortgage, Inc.\nRESIDENTIAL MORTGAGE SERVICER: LoanCare, LLC\nMORTGAGED PROPERTY ADDRESS: 1810 139th Ave Northwest, Andover, MN 55304\nTAX PARCEL I.D. #:\n34-32-24-12-0040\nLEGAL DESCRIPTION OF PROPERTY:\nLot 12, Block 2, Parkside at Andover Station CIC No. 255\nCOUNTY IN WHICH PROPERTY IS LOCATED: Anoka\nORIGINAL PRINCIPAL AMOUNT OF MORTGAGE: $145,809.00\nAMOUNT DUE AND CLAIMED TO BE DUE AS OF DATE OF NOTICE, INCLUDING TAXES, IF ANY, PAID BY MORTGAGEE:\n$148,112.21\nThat prior to the commencement of this mortgage foreclosure proceeding Mortgagee/Assignee of Mortgagee complied with all notice requirements as required by statute; That no action or proceeding has been instituted at law or otherwise to recover the debt secured by said mortgage, or any part thereof;\nPURSUANT to the power of sale contained in said mortgage, the above described property will be sold by the Sheriff of said county as follows:\nDATE AND TIME OF SALE:\nDecember 1, 2017 at 10:00 AM\nPLACE OF SALE: Anoka County Sheriffs Office, 13301 Hanson Boulevard NW, Andover, MN\nto pay the debt then secured by said Mortgage, and taxes, if any, on said premises, and the costs and disbursements, including attorneys fees allowed by law subject to redemption within six (6) months from the date of said sale by the mortgagor(s), their personal representatives or assigns unless reduced to Five (5) weeks under MN Stat. 580.07.\nTIME AND DATE TO VACATE PROPERTY: If the real estate is an owner-occupied, single-family dwelling, unless otherwise provided by law, the date on or before which the mortgagor(s) must vacate the property if the mortgage is not reinstated under section 580.30 or the property is not redeemed under section 580.23 is 11:59 p.m. on June 1, 2018, unless that date falls on a weekend or legal holiday, in which case it is the next weekday, and unless the redemption period is reduced to 5 weeks under MN Stat. Secs. 580.07 or 582.032.\nMORTGAGOR(S) RELEASED FROM FINANCIAL OBLIGATION ON MORTGAGE: None\nTHE TIME ALLOWED BY LAW FOR REDEMPTION BY THE MORTGAGOR, THE MORTGAGORS PERSONAL REPRESENTATIVES OR ASSIGNS, MAY BE REDUCED TO FIVE WEEKS IF A JUDICIAL ORDER IS ENTERED UNDER MINNESOTA STATUTES, SECTION 582.032, DETERMINING, AMONG OTHER THINGS, THAT THE MORTGAGED PREMISES ARE IMPROVED WITH A RESIDENTIAL DWELLING OF LESS THAN FIVE UNITS, ARE NOT PROPERTY USED IN AGRICULTURAL PRODUCTION, AND ARE ABANDONED.\nDated: September 29, 2017\nLakeview Loan Servicing, LLC\nMortgagee/Assignee of Mortgagee\nUSSET, WEINGARDEN AND LIEBO, P.L.L.P.\nAttorneys for Mortgagee/Assignee of Mortgagee\n4500 Park Glen Road #300\nMinneapolis, MN 55416\n(952) 925-6888\n100 – 17-005783 FC\nTHIS IS A COMMUNICATION FROM A DEBT COLLECTOR.\nPublished in the\nAnoka County UnionHerald\nOctober 6, 13, 20, 27,\nNovember 3, 10, 2017\n741825",
    "source_domain": "abcnewspapers.com",
    "title": "Mortgage Foreclosure - NOTICE OF MORTGAGE FORECLOSURE SALE",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/mortgage-foreclosure-notice-of-mortgage-foreclosure-sale-1408/"
}