{
    "authors": [
        "Abc Newspapers"
    ],
    "date_download": "2017-01-02 16:16:47+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 09:01:01",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F01%2F02%2Funionherald-crime-briefs-for-dec-30-2%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2016/12/rolled-newspaper-2-1-838x1024.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Letter against tree trimming\nTo the Editor: In my humble opinion that part of the electric power company’s ordinance which purports to give the company the right to trim such trees as may interfere with its wires is not worth the ink it took to write it – and I trust that all independent, tree owning, patriotic Anokans will resist its enforcement.\n– 100 years ago, Dec. 27, 1916\nAnoka Union\nFarm Machinery emergency meeting to be held\nThe farm machinery emergency and how to meet it – a critical problem facing every farmer in 1942 and “for the duration” – will be the subject of a county-wide Farm Machinery Day at Anoka, Thursday, January 29, which is expected to bring out one of the largest gatherings of farmers in the history of this county. Owing to war demands for steel, new machinery will be very scarce this year and even repair parts may be impossible to get unless farmers act early instead of waiting until a few days before their machinery is needed.\n– 75 years ago, Dec. 31, 1941\nAnoka Herald\nFire kills girl on Christmas\nFourteen-year-old Jacqueline Cherne was killed in an early morning Christmas fire that gutted her home and nearly claimed her parents and eight brothers and sisters.\n– 50 years ago, Dec. 30, 1966\nAnoka County Union\nSupreme Court decision benefits Anoka-Ramsey\nA Minnesota Supreme Court decision Dec. 20 was good news for Anoka-Ramsey Community College. The Supreme Court threw out Gov. Arne Carlson’s vetoes of higher education funding, which had been approved by the 1991 session of the Minnesota Legislature. The state’s highest court ruled the vetoes illegal.\n– 25 years ago, Dec. 27, 1991\nCoon Rapids Herald\n• Compiled by Eric Hagen\nEditor’s note: “Looking Back” is reprinted exactly as the items first appeared.",
    "source_domain": "abcnewspapers.com",
    "title": "UnionHerald Looking Back for Dec. 30",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/01/02/unionherald-crime-briefs-for-dec-30-2/"
}