{
    "authors": [
        "Abc Newspapers"
    ],
    "date_download": "2017-10-06 16:28:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 11:18:21",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fletters-to-the-editor-for-oct-6%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/letters-to-editor.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A resounding ‘No’ vote\nTo the Editor:\nThe Nov. 7 Anoka-Hennepin School District referendum deserves a resounding NO vote!\nIt is well documented that off-year voting patterns indicate a substantially lower voter turnout than even year results. I didn’t need to form a committee to investigate this phenomenon.\nIn fact It is sometimes referred to as “placing a large frog in a small pond!” And we know who the frog is!\nThis is precisely the reason the district embraces the timing of this unfortunate “bail-out”.\nTwo hundred and fifty million dollars over a period of 25 years is a substantial reward failing to be more proactive in an asset management role. And now it has become a crisis. No surprise there!\nOver the years the public school system in this country has become a unionized government monopoly placing a priority on the welfare of its employees over and above that of the students in the class room.\nWhen the district decides to provide the same level of energy to the welfare of students as it does to protecting tenured “jobs for life”, I will gladly support it. Until then:\nSay no on Nov. 7. Don’t subsidize a unionized government monopoly at the expense of a future generation.\nJim Hafner\nCoon Rapids\nVoting for the Conservative\nTo the Editor:\nI’ve heard that there is a school board election this fall. My husband and I will be voting for Brian Herda, because he is the Conservative in the race. Brian has a background in accounting, like my husband, Tim. Yes, it’s important to have a “numbers guy” watching out for taxpayers in the Anoka-Hennepin School District.\nTim and I raised our two children in this area, and we’re now grandparents. So, we realize the importance of having a good school district for developing the next generation of community leaders. We urge others in Ramsey, Andover and Ham Lake to vote for Brian Herda.\nColleen Graber\nRamsey\nTurn the lights on for veterans\nTo the Editor:\nThree 20,000 square foot, four story, very sturdy cottages sit dark and empty on the grounds of the old State Hospital in Anoka. Homeless veterans commit suicide every day.\nIt doesn’t have to be that way. We can turn those lights on, and 20 veterans will be living safely and warmly inside this winter.\nIn cooperation with the city of Anoka, Eagle’s Healing Nest of Sauk Centre is going to rescue those three cottages. They will become a home for veterans who might otherwise not live to see spring.\nOver 275 people rallied by the cottages last Thursday to kick off this effort. It was an amazing evening as we heard from three veterans who have had their lives rescued at the “Nest.” Eighty-one people volunteered to help that night.\nYou can be part of this, too. This project will not be funded with federal, state, county, or city money. It will all be done by the people who gratefully enjoy the freedoms provided by these brave men and women, who have fallen onto hard times.\nOur goal is to make one of the cottages habitable by Dec. 1, less than two months from now. Why not delay? Because Dec. 2 is going to be a cold day, and 20 homeless veterans deserve better than spending another winter in a cardboard box under a bridge.\nPlease join our efforts. We need everything. Plumbers, electricians, concrete masons, and a fire/smoke alarm contractor. Volunteers to redo ceilings, patch holes, paint walls, and reglaze a hundred broken windows. We need a new 1M BTU gas boiler and a couple big water heaters. And $100,000 for parts and repair materials, less if we can get donations.\nMost of all, we need dozens of partners who believe that one person can save another person’s life. To join with us, email us at [email protected] or call 651-296-3733.\nAnd if you can help us get the stuff we need to get these cottages squared away, that will be awesome.\nBe a hero for vets.\nJim Abeler\nAnoka\nWriter makes curious claims\nTo the Editor:\nA recent letter to the editor claimed that the Democratic Party has gained control over black people by promoting “out-of-wedlock births.” According to the letter writer, this has been accomplished by rewarding “these women with government assistance.”\nThis is all very interesting because Republican politicians have been crowing for two decades about how wonderful the welfare reform of the nineties has been. Does this mean that for 20 odd years Republicans haven’t noticed Democrats doling out “assistance” money to black women?\nThe letter writer goes on to state that there is a direct correlation between the act of voting for Democratic candidates and a spike in black out-of-wedlock births from 23 percent to 72 percent over a 50 year period.\nIt’s remarkable how potent the mere act of voting must be – regardless of the actual outcome of elections – because during the last 36 years Republicans have had control of both the U.S. Senate and House of Representatives for half of those years. Again, it seems odd that when Republicans controlled one or both houses of congress they failed to address the Democratic payola scheme.\nIt certainly couldn’t be because Republicans aren’t concerned about African Americans and other minorities because they seem extremely motivated to come up with creative ways to undermine their voting rights.\nUsing the letter writer’s thesis, this could be tough love on the part of Republicans who are only trying to save black voters from themselves. Continued votes for Democrats could result in 100 percent of black births occurring out-of-wedlock. Apparently, Democrats refuse to use their hypnotic power over black people to compel them to procreate only after marriage.\nThe letter writer observes that black people continue to vote for Democrats because they “are told the Republicans are racist” – yes, it’s difficult to imagine that black voters could have come to that conclusion if someone hadn’t “told” them.\nGene Case\nAndover",
    "source_domain": "abcnewspapers.com",
    "title": "Letters to the Editor for Oct. 6",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/letters-to-the-editor-for-oct-6/"
}