{
    "authors": [
        "Peter Bodley",
        "Contributing Writer"
    ],
    "date_download": "2017-10-06 22:29:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 16:45:12",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fvictim-witness-program-renewed%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "A state grant awarded to the Anoka County Attorney’s Office last year to expand its victim witness services has been renewed.\nThe Anoka County Board Sept. 26 authorized execution of a grant agreement with the Minnesota Department of Public Safety Office of Justice Programs, Crime Victims Services Grant Unit totaling $279,028 for fiscal years 2018 and 2019 with annual renewals until 2021.\nIn 2017, the county received $139,514 from the state agency to expand services for under served populations such as elderly and non-English-speaking crime victims.\nThe county attorney’s office had to reapply for the grant and submit a performance report with its application, according to Emily Douglas, victim witness services manager.\n“The state must have been satisfied with what we are doing because the grant renewal was approved very quickly,” Douglas said.\nWith last year’s grant, the county attorney’s office hired two new employees for the victim witness services department, one a specialist to work with victims and witnesses 65 years and older, she said.\nIn 2012, the county attorney’s office founded the Minnesota Stop Abuse and Financial Exploitation elders initiative to reduce elder abuse through training, policy and education and the coalition of SAFE community and law enforcement partners produced a Minnesota-focused informational toolkit and video, all leading to a merger with the Vulnerable Adult Justice Project to create the nonprofit Minnesota Elder Justice Center.\nThe other new staff member was a legal secretary “to help us administratively” deal with case loads that have grown as the number of felony cases charged by the county attorney’s office has increased, Douglas said.\nAccording to Douglas, most non-English speaking clients seen by victim witness services speak Spanish and one of the existing staff who can speak Spanish has been assigned to work with them.\nSome of the grant money will be allocated to allow the employee to take online classes to improve Spanish-speaking skills, Douglas said.\nIn addition, recorded phone messages at the department are in a variety of languages and all victim witness services materials are being translated in Spanish, Russian, Somali and Arabic to serve non-English speaking clients, she said.\nThe mission of the county’s victim witness program is “to protect the rights and interests of crime victims and witnesses in the criminal justice system, while encouraging participation in the court process and addressing individual needs brought on by victimization.”\nThe program provides victim and witness services for cases charged by the county attorney’s office which include felonies, some gross misdemeanor and misdemeanors and juvenile delinquency cases.\nServices include court advocacy, trial updates and financial assistance/restitution, according to the county attorney’s website.",
    "source_domain": "abcnewspapers.com",
    "title": "Victim witness program renewed",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/victim-witness-program-renewed/"
}