{
    "authors": [
        "Brian James Siddons"
    ],
    "date_download": "2017-01-02 13:15:26+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 07:00:39",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F01%2F02%2Fgrant-provides-east-bethel-with-funds-for-zamboni%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "In a letter from the Minnesota Amateur Sports Commission Dec. 1, the city of East Bethel was informed that it received a James Metzen Mighty Ducks Ice Arena Grant.\nWhat began as an effort to upgrade an aging 1996 propane-powered Zamboni for the East Bethel Ice Arena led to City Council approval of the $72,000 grant for a new electric-powered Zamboni.\nIn a unanimous vote on the Dec. 21 consent agenda, the City Council confirmed acceptance of the grant.\nJack Davis, city administrator for East Bethel, said “all funding is generated by ice arena user fees. No city monies will be used for the purchase of this equipment.”\nEast Bethel is expected to place its order as soon as possible and receive the new Zamboni in six to eight months, just in time for the 2017-2018 season.\nThe net cost to the city, after selling the current unit and re-directing budgeted 2017 repair costs, will be approximately $44,000.\nThe expected life of a new electric-powered Zamboni is 20 to 25 years. Fuel costs of electric versus propane are approximately the same over the life of the unit, with battery replacement being the main cost factor of the new unit.\nThe grant proposal had been discussed at several council meetings this year, in particular how the costs of maintaining the city owned Zamboni would compare to a new unit.\nCouncil Member Ron Koller, at the Aug. 17 council meeting stated that “the engine was just replaced last year, and I can’t support buying a new (Zamboni) just because someday in the future it might have to be replaced.”\nDavis brought up other issues relating to the current unit, such as “more restrictive air quality standards for indoor ice arenas” and “loss of revenue” if the current unit was out for repair.\nAs council debated a variety of cost comparisons at the Aug. 17 meeting, Mayor Steve Voss said “for $2,000 a year … the grant would allow the city to own a new Zamboni that is safer for the air quality inside the ice arena.”\nThe grant program, which provided a record $10 million in available monies this year, was renamed in Metzen’s honor after he died in July. Metzen served in the Minnesota Legislature for over 40 years, was at the forefront of creating the Mighty Ducks grant program in 1995 and remained a strong proponent of the statewide program. Originally geared toward supporting the growth of girls ice hockey, the funding has stretched its reach to include many aspects of youth hockey. There were 29 grants approved this year, 15 in 2015 and 10 in 2014.",
    "source_domain": "abcnewspapers.com",
    "title": "Grant provides East Bethel with funds for Zamboni",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/01/02/grant-provides-east-bethel-with-funds-for-zamboni/"
}