{
    "authors": [
        "Olivia Alveshere",
        "Staff Writer",
        "Since",
        "I Have Primarily Covered The Anoka-Hennepin",
        "Spring Lake Park School Districts As Well As The City Of Spring Lake Park For Abc Newspapers."
    ],
    "date_download": "2017-01-02 19:18:50+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 12:00:05",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F01%2F02%2Fwomen-sentenced-after-attack-on-st-francis-teenager%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2016/12/gavel2-2-1024x1024.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Since 2013, I have primarily covered the Anoka-Hennepin and Spring Lake Park school districts as well as the city of Spring Lake Park for ABC Newspapers.\nBoth women charged in the assault of a 15-year-old St. Francis girl this summer were ordered to write her an apology letter and pay restitution.\nIn August, the women were arrested after allegedly hitting and kicking 15-year-old Sydney DeTenancour and cutting off some of her hair in a wooded area near The Ponds Golf Course in St. Francis June 17.\nA video of the attack has been viewed on Facebook more than 500,000 times.\nCassandra Teal Borden, 19, of Cedar, hit and kicked the victim nearly 50 times. She was convicted of fifth-degree misdemeanor assault Nov. 14, and as part of a plea agreement, she had a fourth-degree property damage misdemeanor charge for allegedly breaking the victim’s cellphone dismissed at sentencing.\nAlexis Sue Nelson, 20, of Zimmerman, was also charged with fifth-degree misdemeanor assault after allegedly cutting off several inches of the victim’s hair.\nNelson received a stay of adjudication Dec. 19. The case will be dismissed after one year if she completes conditions set forth by the judge, including writing a letter of apology to DeTenancour, taking medications as directed, continuing counseling with a psychiatrist, paying $80 in restitution and more.\nAt sentencing last month, Borden was also ordered to write a letter of apology. She had a 90-day jail sentence stayed for one year during which time she will be on probation. In addition, Borden was ordered to pay $669 in restitution, attend anger management, complete 40 hours of community service and earn her GED certificate.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Women sentenced after attack on St. Francis teenager",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/01/02/women-sentenced-after-attack-on-st-francis-teenager/"
}