{
    "authors": [
        "Patrick Slack"
    ],
    "date_download": "2017-10-06 13:26:55+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 08:10:39",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fwriters-block-a-night-to-remember-great-coaches%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/Patrick-Slack-1024x989.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "My dad has always been my biggest fan. Patrick Slack\nSo I wasn’t all that surprised by the two parts of an email I got back from him the day I sent him my first column here at ABC Newspapers.\nThe first part was very heartfelt and kind.\nThe second part, though, suggested a few more column inches be devoted to him the next time around. I was going to laugh it off, but then he took me out for dinner on Sunday, and hey, I can be bought. Just kidding … for the most part.\nI was lucky enough to not only have my dad be my dad growing up, but also my wrestling coach for a short stretch of his 33 years at my high school. Before that, I got to tag along to practices and on long bus rides to matches and tournaments, learning from an early age about life behind the scenes of a high school team, especially for a coach.\nI was reminded of a lot of these times on Friday night in Anoka.\nThe city of Anoka celebrated Coach Stan Nelson Day with a get-together and on-field ceremony before the high school game, with players from Nelson’s first Anoka season in 1953 through his last in 1978 in attendance. Tracking down so many people who have since scattered to different areas took months of time and effort on the part of event organizers. The fact so many people were willing to come back for their former coach nearly 40 years after his final season – for some individuals over 60 years since they had played for him – spoke volumes.\nThe phrase “tough, but fair,” was used several times. It was always followed with how much ‘Coach Nelson’ cared for his players, and in turn how much they cared for him. As I was listening I could imagine hundreds of former wrestlers saying the same thing about my dad. And maybe muttering something under their breath about barrel rolls.\nMost people recognize the importance coaches have on shaping young athletes, but it can still be easy to take for granted. It also isn’t something for coaches to take lightly. High school athletes are coming off of full days of school and then are challenged to compete for several hours, sometimes in practice, other times in games lasting until late at night. The time spent with a team during the week can exceed the time spent at home.\nI had the pleasure – and occasional displeasure – of playing for several types of coaches in various sports growing up, and get to watch and interact with many more as a sports reporter.\nThe best I have seen are passionate about their sport and even more so about their players. This passion can come across in understated ways. It can also come across in rather loud voices. But either way, players feed off of coaches who believe in them, and this confidence can go a long way in life.\nThere is also a delicate balancing act coaches must tread between developing character and being competitive on the field. Ideally, the two will go hand in hand: players will be inspired to work harder, play fair and ultimately reach their potential. A lofty ideal and much easier said than done, but the goal to aspire to.\nWhen I used to go to sporting events, I used to think of the coaches, the players and the fans as three distinct entities. I have come to realize coaches really become the biggest fans of all.\nThanks Coach Nelson and to all of the former Anoka players for letting me be a part of a special night of reminiscing.\nAnd thanks Dad. Let’s do dinner again next month.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Writer’s Block: A night to remember great coaches",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/writers-block-a-night-to-remember-great-coaches/"
}