{
    "authors": [
        "Eric Hagen",
        "Staff Writer",
        "I Cover The Cities Of Andover",
        "Blaine",
        "Ramsey. I Have Worked At Abc Newspapers Since August"
    ],
    "date_download": "2017-10-06 14:58:12+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:44:30",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Framsey-approves-tax-levy-increase-up-to-8-54%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/ThinkstockPhotos-80410231-1024x683.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "I cover the cities of Andover, Blaine and Ramsey. I have worked at ABC Newspapers since August 2007.\nThe city of Ramsey could be collecting 8.54 percent more revenue from taxpayers in 2018 than it did in 2017.\nAt its last meeting in September, the Ramsey City Council on a 5-1 vote approved a tax levy of $11.37 million. The 2017 levy was $10.48 million.\nAlthough this number is used to give property owners an estimate of how high their property taxes could be in 2018, the council does not vote on the final number until Dec. 12. But the levy cannot be any higher than $11.37 million already approved, although it can stay the same or be lowered..\nCity Administrator Kurt Ulrich and Finance Director Diana Lund presented the preliminary budget and levy for next year on Sept. 26. They explained the increase, how the money is divvied up and how much taxes could go increase.\nProperty values are set each spring for the following year. Values play a big role in how much taxes a property owner pays and any contention of the value must be brought up during the springtime public hearing.\nThe median home value in Ramsey this year was $176,900. Next year it will be $197,700. This homeowner would have paid $661 to the city of Ramsey in 2017, which increases to $743 in 2018. In addition, they would pay property taxes to Anoka County and the school district.\nLund noted that the Nov. 7 vote on the Anoka-Hennepin School District referendum comes after these property tax estimates are mailed, so they will not factor in what the tax increase would be for an individual property if the referendum passes.\nCouncil Member John LeTourneau said the 8.54 percent levy increase “represents the activity that’s appropriate for our community.”\n“I don’t know if it’s necessarily fair or a good way to review our proposal based on what other communities are doing because each community has their own set of expectations and needs that they’re meeting,” he said. “I think it’s reasonable for the things we need to be doing.”\nWhy the increase?\nCouncil Member Chris Riley opposes such a large tax increase. He said the Consumer Price Index for inflation and Social Security increases are both slated to increase by less than 2 percent.\nRiley said he has been reading ABC Newspapers’ stories to keep track of what other cities are doing. He saw that Andover is proposing a 4 percent levy increase, Coon Rapids is looking at a 4.8 percent increase and Spring Lake Park’s council approved a 4.67 percent increase.\n“None of these numbers indicate why a city should go up 8.54 percent,” he said.\nMayor Sarah Strommen said each has their own needs and pays for services in different ways. She noted that Ramsey has needed to take on more debt to pay for road maintenance projects that were long neglected.\n“We have to make sure we’re comparing apples to apples and not apples to oranges,” the mayor said.\nIn her PowerPoint presentation, Lund walked through the significant factors that led to a proposed 8.54 percent levy increase. As it stands, the increase between the 2017 and 2018 levies is $895,337.\nAlmost $500,000 of the increase is devoted to personnel costs. The proposed wage increase for all employees is 2.5 percent on Jan. 1 and an additional 0.5 percent on July 1. Health insurance costs for the city are going up 7.38 percent.\nThe council is also supportive to the idea of hiring a full-time senior planner, full-time parks maintenance worker and part-time engineering administrative assistant. A currently part-time IT technician would also become a full-time under the proposed 2018 budget.\nThe next biggest contributor is more debt. For three consecutive years, the city has done a 10-year bond sale to pay for road projects.\nOther items of note for 2018 are the need for a new dump truck that could also plow roads in the winter, new self contained breathing apparatus gear for the firefighters, general election, a city survey and the need to hire some outside help for the engineering and building inspection departments.\nThe tax impact for individual properties could have been greater had it not been for a citywide market value increase of 10.6 percent. This caused Ramsey’s tax capacity rate to decrease.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Ramsey approves tax levy increase up to 8.54%",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/ramsey-approves-tax-levy-increase-up-to-8-54/"
}