{
    "authors": [
        "Eric Hagen",
        "Staff Writer",
        "I Cover The Cities Of Andover",
        "Blaine",
        "Ramsey. I Have Worked At Abc Newspapers Since August"
    ],
    "date_download": "2017-10-06 19:30:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 13:45:56",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2F30-years-of-resolving-conflict%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/mediation-services-1024x683.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "I cover the cities of Andover, Blaine and Ramsey. I have worked at ABC Newspapers since August 2007.\nIt has been 30 years since Mediation Services for Anoka County started serving Anoka County residents. Lonni McCauley was one of the original founders of Mediation Services of Anoka County, which is celebrating its 30th anniversary. Photo by Eric Hagen\nMost of the cases it handles revolve around conflicts between neighbors, landlords and tenants, bullying and financial disputes, but they can also serve as mediators for parents going through a divorce.\nThey have resolved differences between senior citizens on mundane issues that added up over time, brought shoplifters and store managers face-to-face, gotten students who were fighting to talk to each other and encouraged more proactive dialogue between family members when there’s estate disputes.\n“We pride ourselves on being impartial,” said Carol Markham-Cousins, who has been Mediation Service’s executive director since February. “It doesn’t mean we don’t have bias because we’re human beings. So we do a lot of what does it mean to have bias training.”\nIn 2016, almost 1,500 individuals worked with Mediation Services, according to Christine Carney, chairperson of the board of directors.\nLooking into the future, Markham-Cousins would like to expand programming in the schools. There’s a pilot project that started last spring at the high school and middle school in Coon Rapids. Persistent fighting between students are the issues that have come up. She gathers everyone in a circle to air their grievances and to have them hear the other side.\n“The more we can get students to talk together in a safe environment that’s where it really gives kids an opportunity to repair the harm they’ve done,” she said.\nA majority of the revenue comes from grants and contracts, including with Anoka County. In 2016, grants and contracts accounted for more than 75 percent of revenue. The next biggest revenue source was contributions and fundraisers, which was about 20 percent of the revenue.\nMediation Services has a fundraiser coming up on Nov. 2 at the Bunker Hills Event Center, 12800 Bunker Prairie Road NW, Coon Rapids. The “Sip, Sample & Support” fundraiser takes place from 5:30 to 8:30 p.m. and the cost is $50 per ticket. RSVPs must be submitted by Oct. 12. Visit www.mediationservice.org to order tickets.\n30 years of service\nLonni McCauley was one of the key founders. She also credited Gene Merriam, Susan Anderson, Bill Hunt and Bob Thistle with helping to start what became a non-profit organization and also wants to thank the many people who have been staff, board members or volunteer mediators.\nMcCauley’s career includes 30 years of managing non-profit organizations, which also included the Minneapolis League of Women Voters, Anoka Technical College Foundation and Stepping Stone Emergency Housing. She would later became mayor of Coon Rapids.\nAccording to McCauley, the genesis of Mediation Services for Anoka County started after she had been trained as a mediator as part of her job managing the Brooklyn Center Chamber of Commerce.\n“It was such a great idea and so unique that I thought we should do this in Anoka County,” she said.\nShe first approached Thistle, who was the city manager of Coon Rapids at the time, but later appeared at other city council and township board meetings around Anoka County.\nOftentimes, there would be a controversial issue that came up on the agenda before she spoke.\n“I would get to stand up and say we have one solution for this. Help us to develop mediation services and we can help you with your problems that you and your residents have,” she said.\nAnn Wallerstedt was hired as the first executive director and stayed on for 20 years. Following in her footsteps were Kathi Jensen, Dave Bartholomay and Markham-Cousins.\nMcCauley has not served on the board of directors for a long time, but still volunteers three days a week as a mediator, including for cases that could go to conciliation court.\nShe remembers a case where there were about a dozen family members around a table making accusations about neglect of elderly parents and harassment.\n“It took three hours and in the end they were crying, hugging each other and saying restraining orders would be lifted,” she said.\nAnother case McCauley remembers involved a dispute between two brothers over farm property and equipment their father had left them after he died.\n“There was a huge dispute on acreage, who was using whose equipment, who ruined another’s tractor by not putting oil in it,” she said.\nThe mediator asked each brother to prepare a list of expenses they felt the other brother owned them. One brother came with a list that summed up the expenses that McCauley believes totaled more than $20,000. The other brother came with a suitcase full of receipts.\nMcCauley was worried how long it would take to work through all the paperwork and thought his demands would be much higher than his brother’s but they ended up being only a couple thousand dollars off.\nThey agreed to one brother paying a small sum to the other brother. They sold their mother’s cabin and split the profit and one brother who had tightly held onto a trust fund agreed to share the money with the other brother.\n“The sisters-in-law were so tired of 20 years of grief between their husbands. They were crying,” she said.\nBut there is not always a happy ending.\nMcCauley remembers someone accusing a neighbor of trespassing on their property to get to a lake. This case was left unresolved and McCauley believes that at least one of the neighbors seemed to enjoy the confrontation. She saw at times that people would rather fight than mend a divide.\nBut people must be careful to not let neighborhood disputes spiral out of control. She referenced the New Brighton case in which Neal Zumberge murdered his neighbor Todd Stevens on May 5, 2014. Stevens’ girlfriend was also injured in the shooting. There were numerous issues raised in court, but one was that Zumberge was upset that his neighbors were feeding deer.\nZumberge was sentenced to life in prison in September 2015.\n“That’s what can happen when you have neighbors who are unwilling to work together. The issues may be small, but they get larger in people’s minds all the time,” she said.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "30 years of resolving conflict",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/30-years-of-resolving-conflict/"
}