{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 16:29:15+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:41:20",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fschool-board-independent-school-district-16-14%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "MINUTES OF THE\nSEPTEMBER 12, 2017\nSCHOOL BOARD\nREGULAR MEETING,\n1415 81ST AVE NE, SPRING LAKE PARK, MN\nThis is an abridged version of the September 12, 2017 School Board Regular Meeting minutes. The complete version can be found on the District website at springlakeparkschools.org and at the District Services Center in the Superintendents Office.\nParents Sheena Blalock-Davies and Josh Davies addressed the Board and Administration regarding concerns involving the current classroom placement of their child. Chairperson Stroebel thanked them for sharing their concerns.\nA. Call To Order and Pledge Of Allegiance\nChairperson Stroebel called the meeting to order at 7:00pm. The following School Board members were present: Stroebel, Ruch, Amundson, Hennen, Forsberg, and Delfs, along with Superintendent Ronneberg and Student Council School Board Representative Stoeckl. School Board members absent: Easter due to personal illness. Student Council School Board Representative absent: Lall\nB. Agenda Approval – the agenda was approved with the following additions: a. removal of item I. Closed Session;\nb. removal of policy 709 from Action Item 2.\nC. Some Future Events – Chairperson Stroebel read aloud the events as listed in the agenda.\nD. Consent Agenda – the items of the consent agenda were approved including minutes, bills paid, and personnel items.\nE. Presentations, Special Guests, And Recognition\n2017-18 Spring Lake Park High School International Students – Ms. Sue Davis, American Field Service (AFS) East Metro Area Team member introduced Cedric Leuenberger from Switzerland, Romina Montti Zapata from Chile, and Veera Toikka from Finland. The three students shared information regarding their families and school in their home country, favorite things to do, the activities/athletics they are participating in at Spring Lake Park High School, and what drew them to the USA. Board members asked follow up questions and welcomed the students to Spring Lake Park Schools.\nCertificate of Excellence in Financial Reporting from the Association of School Business Officials-International: Spring Lake Park District 16 is a multiple-winner of this award, most recently for its Comprehensive Annual Financial Report for Fiscal year ended June 30, 2016. Dr. Jeff Ronneberg mentioned that this award is a representation of the purposeful work that Ms. Amy Schultz, Director of Business Services, her team, and the board do to ensure the fiscal responsibility of the District. Budget reductions havent been necessary for several years and there is no projection for reductions in the near-term. Property tax savings provided through four recent bond refundings have saved district taxpayers more than $12 million. The districts voter approved operating levy has not increased since 2002, is the lowest levy of five neighboring districts, and ranks 36th out of 38 metro districts, among members of the Association of Metropolitan School Districts. Effective and creative use of district funds allows for lower class size, increased competitiveness in the job market to attract and retain high quality staff, and further investment in student learning.\nF. Discussion, Reports, Information Items\n2017-18 District Operational Plan (DOP) – The DOP and update meets Worlds Best Workforce plan and reporting requirements. Dr. Ronneberg and Dr. Rahn provided an overview of the 2016-17 student achievement results, district desired results, district leverage goals, and school leverage goals. In addition, an overview was given of key achievement points of three DOP projects that align with and focus on student results: Accelerating Student Learning, K-12 Math, and Inviting Student Learning Environment. The District Operational Plan (DOP) meets the Minnesota Department of Educations Worlds Best Workforce Plan requirements. The DOP can be found on the District website by choosing the Discover Spring Lake Park Schools tab, followed by Our Strategic Plan.\nTeacher Recruitment – Project Update – This project focuses on ensuring high-quality instruction, designing and implementing options to attract candidates for hard to fill positions and increasing diversity in our workforce, while building Spring Lake Park Schools as an employer that people choose to stay with. This school year the district is experiencing 94.7% staff retention rate, which exceeds the market average significantly. For those choosing not to return, relocation, retirement and staying home due to family responsibilities were found to be the main reasons. Mr. Stromberg, Director of Human Resources, summarized who has been hired in Spring Lake Park Schools for the 2017-2018 school year, highlighting key leadership positions and strategic priorities. The district has attracted some highly-respected leaders to fill these positions. In addition, Mr. Stromberg highlighted the significant progress made in diversifying staff.\nFacilities Update – Ms. Schultzs presentation focused on recently completed projects at Spring Lake Park High School, the elementary schools, and Westwood Complex. In addition, she gave an update on construction of the new K-4 elementary school and progress of the work being done on the C and CTE wing of the high school. She invited all community members to tour the new high school science addition during the community open house on September 30. Dr. Ronneberg stated his appreciation for the work being done and the passing of the bond, leading to the creation of conditions to both teach and learn differently as we work towards the district mission. He invited people to check out Spring Lake Park Schools.\nSuperintendents Report – Dr. Ronneberg highlighted the location of Personalized Learning and District Operational Plan information on the district website. In addition, he shared a video of the first day of school across the district.\nG. Action Items\n1. UAW Local 125 – Child Care 2017-2019 Agreement was approved\n2. Second Reading of Revised School Board Policies was approved.\n3. Second Reading to Delete School Board Policy was approved.\n4. October Board Meeting Date Change was approved.\nH. Board Forum And Reports\nChairperson Stroebel welcomed Student Council Student Representative Liz Stoeckl as student representative to the school board for the 2017-2018 school year. Ms. Stoeckl is a junior at the high school and reviewed activities and athletics during the first couple weeks of school. Member Hennen mentioned that a parent shared her excitement about moving in to the district because of the great things she has heard about Spring Lake Park Schools. Member Delfs shared that she and Member Forsberg received notification that they have been chosen as delegates to the Delegate Assembly. The position is a two-year term. Member Forsberg gave a brief update on NEMetro 916. In addition, she will continue to attend AMSD meetings as the NEMetro 916 representative. Chairperson Stroebel mentioned that he attended the recent AMSD meeting.\nI. Closed Session – removal approved during agenda approval item.\nJ. Adjournment – adjournment of the meeting was approved. Meeting adjourned at 8:50pm.\nAmy Hennen, Clerk,\nSpring Lake Park Schools,\nIndependent School District 16\nPublished in the\nBlaine/Spring Lake Park Life\nOctober 6, 2017\n741796",
    "source_domain": "abcnewspapers.com",
    "title": "School Board - INDEPENDENT SCHOOL DISTRICT 16",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/school-board-independent-school-district-16-14/"
}