{
    "authors": [
        "Abc Newspapers"
    ],
    "date_download": "2017-10-06 21:00:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:08:20",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Funionherald-looking-back-for-oct-6%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Anoka County Fair a success\nTaken from every standpoint and striking an average, the county fair which was held last week was superior to any which have been held during the past six years. While some of the exhibits were below the standard of previous years because of the early frost, others were so much better than ever before that on the whole, a great improvement could be noted.\n– 100 years ago, Oct. 3, 1917\nAnoka County Union\nScrap iron needed now\nSunday, October 11 marks the real start of the “Scrap Harvest” in Anoka county. This drive ends October 21, and up to that time Anoka county must collect 1043 tons of scrap metal. On Sunday, 200 trucks and 500 men will go out into the county to collect scrap from the farms.\n– 75 years ago, Oct. 7, 1942\nAnoka Herald\nTwo gunmen rob junior college\nTwo gunmen posing as students robbed the book store at Anoka-Ramsey Junior College in Coon Rapids shortly before 1 p.m. Wednesday and escaped with an estimated $1400.\n– 50 years ago, Oct. 6, 1967\nAnoka County Union\nCoon Rapids basks in success of “Mighty Ducks”\n“The Mighty Ducks,” filmed earlier this year entirely in the Twin Cities, including the Coon Rapids Ice Arena, opened in some 1,200 theaters across the country Oct. 2. Arena Manager Bob Larsen said the Hollywood production company spent nine days filming at Cook Arena last February. And they gave the arena a lump sum payment that more than made up for the loss of ice rentals during that period.\n– 25 years ago, Oct. 9, 1992\nCoon Rapids Herald\n• Compiled by Eric Hagen\nEditor’s note: “Looking Back” is reprinted exactly as the items first appeared.",
    "source_domain": "abcnewspapers.com",
    "title": "UnionHerald Looking Back for Oct. 6",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/unionherald-looking-back-for-oct-6/"
}