{
    "authors": [
        "Sam Herder",
        "Sports Reporter",
        "Sam Is The Sports Reporter For Abc Newspapers",
        "Covering High School",
        "Junior College",
        "Community Sports In The Area. He Joined The Staff In October"
    ],
    "date_download": "2017-02-15 15:54:42+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 09:41:02",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F02%2F15%2Fblaine-dominates-rogers-7-0-to-advance-to-section-finals%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/02/SP-Blaine-girls-hockey2.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sam is the sports reporter for ABC Newspapers, covering high school, junior college and community sports in the area. He joined the staff in October 2016.\nBlaine players celebrate Gabby Rosenthal’s second-period goal in a 7-0 win against Rogers. The Bengals advance to the Section 5AA title game on Friday. (Photo by Sam Herder)\nWith its Section 5AA championship game opponent watching, the top-seeded Blaine girls hockey team (21-3-2) made a statement in the semifinals, defeating fifth-seeded Rogers (19-6-2) 7-0 Tuesday in Roseville.\nThe Bengals are set to take on second-seeded Maple Grove (22-4-1) in the title game at 7 p.m. Friday at the Roseville Ice Arena. Maple Grove beat third-seeded Centennial (15-12) 5-3 in the game following Blaine’s.\nThe Bengals spread the wealth in the 7-0 win with five different players scoring. Blaine scored twice in the first period, three times in the second and two times in the third.\nControlling the puck for most of the game, Blaine got started when Courtney Moser found Sarah Ganley in front of the net, who buried it for an easy goal. With less than a minute remaining in the first period, Gabby Rosenthal gave Blaine a 2-0 lead off a rebound with the assist from Ramsey Parent and Paige Beebe.\n“I didn’t think our start was very good,” Blaine head coach Steve Guider said. “We were very sloppy and didn’t handle the puck very well. About the second half through the first period, I thought we got better. We started to play. We didn’t have a very good practice on Monday, and we started the game how we practiced … But we got better.”\nRosenthal wasn’t done yet, scoring her second goal five minutes into the second period, assisted by Kenzie Wylie and Beebe.\nThe lead extended to 4-0 with an Abby Jones goal and Megan McKenzie assist, then 5-0 with one second left in the second when Moser found the net with another assist from Beebe along with Emily Brown.\nMoser added a second goal midway through the third period, assisted by Ganley. Miranda Zepeda added the seventh goal for good measure three minutes later. Courtney Moser had two goals and an assist for the Bengals. (Photo by Sam Herder)\n“It’s good and you need that,” Guider said on his team’s scoring distribution. “The nice part is we don’t have to rely on one line to score for us. We’ve had two, sometimes three lines, that have been able to contribute. You get to this point of the season, it’s critical to have scoring from multiple areas.”\nBlaine and Maple Grove are both from the Northwest Suburban Conference. The two teams finished in a 1-1 overtime tie on Feb. 4, the only time they played this season. The Bengals did outshoot the Crimson 38-26.\nIt will be a matchup pitting two top five teams in the state with Maple Grove No. 3 and Blaine No. 4.\n“Maple Grove is all around a quality team, but their goaltending is second to none,” Guider said. “They have the best goaltending in Minnesota right now. It will be a challenge and we have our work cut out for us.”\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Blaine dominates Rogers 7-0 to advance to section finals",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/02/15/blaine-dominates-rogers-7-0-to-advance-to-section-finals/"
}