{
    "authors": [
        "Patrick Slack"
    ],
    "date_download": "2017-10-06 21:00:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:00:56",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fa-night-to-remember-on-coach-stan-nelson-day%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/SP-Stan-Nelson-4-1024x683.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Anoka celebrated Coach Stan Nelson Day before Friday’s game.\nIt was a night about a man, his family and the generations of football players who became a part of it.\nAnoka celebrated Coach Stan Nelson Day on Friday night, with players spanning the entirety of the coach’s 26-year tenure returning to celebrate and honor Nelson.\nA pregame reunion for players and fans from when Nelson coached in Anoka from 1953–1978 was held in town, followed by a plaque unveiling at Goodrich Field and an ovation at midfield before the night’s high school game between Anoka and Woodbury.\nPlayers remember ‘Coach’\nOne of Nelson’s first coaching decisions was to start a freshman at quarterback. Even if that player, Chuck Wennerlund, had other ideas about where to play.\nIt turned out to be the start of many wise moves, as Wennerlund became a four-year starter.\n“For some reason, I don’t know why, he chose me,” Wennerlund said. “I originally commented to him, I didn’t want to play quarterback, I wanted to play defensive end. I thought I had a better chance of playing. “But he said, no, you’re going to play quarterback.\nThen all of a sudden – I was really the third string kind of guy because there were two seniors ahead of me – before the first game, the week of practice he switched me to quarterback and I was there for four years.”\nWennerlund noted the patience Nelson showed in him as he gained experience, and the motivational figure he was.\n“He was a very inspiring man to me,” Wennerlund said. “I became very enthused listening to him in his pre-game talks. I just had to go out there and play well, there wasn’t any option on that. I learned a newer meaning of competing.\n“He was plenty tough, but he was very fair and just inspired you to play the game of football.”\nJerry Hall, a captain on that first team and who had a son play on Nelson’s final team, agreed full-heartedly, sharing that Nelson grabbed the players’ attention from the outset.\n“I was here on this field, late summer of ’53 when the new coach, this guy, comes walking down the stands,” Hall said. “Just a half a dozen, dozen of the guys were playing football and that was when we met Stan Nelson.\n“He was a young guy. He looked tough. He wasn’t joking, just wanted to say hello and meet us. Very straightforward. We could kind of tell this was going to be a serious matter playing ball for Coach Stan Nelson.”\nThe Anoka teams became a part of their coach’s family history, with each year adding another chapter.\n“I think that tells the story all by itself,” Hall said. “We had a special one-on-one relationship, one-on-one team. But to see 20 teams like this, 30 teams come together. Of course we’ve known that through the years. You could tell how deeply, deeply these grown-up men feel about Coach Nelson.\n“He feels so much for people, certainly for his family first. And then we became his family, those kids on the field. When you took that on, there was responsibility.”\nDuane Blaska, who went on to play quarterback for the University of Minnesota’s 1960 and 1961 Rose Bowl teams, highlighted how Nelson prepared his players for life beyond the high school level and cared about his players far more than just for what they could do on the field.\n“I think anybody that was at the get-together would say the same thing: Stan was really a great coach and even a better person, so we were just fortunate to be able to play for a guy like him,” Blaska said. “At the time, none of us really knew of his background. He came as obviously a great athlete from Augsburg, but none of us knew about his war background. Then you place that all together, he got your attention.\n“He was tough, but fair. I know in my case, I had a chance to go down and play at the University of Minnesota afterward, they ran the same system as Stan did here at Anoka. So I had a great advantage and I had a great coach.”\nFamily the most important\nAfter attending Augsburg College and serving in World War II, Nelson coached for two years in Zumbrota and five years in Farmington.\nHe took over as head coach in Anoka in 1953 and remained until 1978.\nDuring that time, Anoka won conference championships in 1955, 1962, 1963, 1964, 1972 and 1976, including 33 consecutive wins from 1961-1964 and a state championship in 1964 that led to Nelson being named the Minnesota High School Coaches Association Coach of the Year.\nFor Nelson, though, the night was not about one person, but about family and the sport that brought so many people back to the community it began.\n“It’s not me that’s getting the award, it’s my family too,” he said. “I just am blessed with such a great family. Athletics has done so much for them. It’s been just a wonderful ride.\n“I really feel bad that my wife, who is most responsible for raising the family, isn’t here to enjoy it.”\nNelson was grateful for the generations of players who were able to attend and those involved in putting the night together.\n“I want to thank the Anoka Alumni Club, Anoka High School and all the fans and players that made it possible. It’s just been an awesome night. It’s something I never dreamt of.”\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "A night to remember on Coach Stan Nelson Day",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/a-night-to-remember-on-coach-stan-nelson-day/"
}