{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 16:29:09+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:41:37",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fschool-board-independent-school-district-16-15%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "MINUTES OF THE\nSEPTEMBER 26, 2017 SCHOOL BOARD WORK SESSION AND MEETING\n1415 81ST AVE NE, SPRING LAKE PARK, MN\nThis is an abridged version of the September 26, 2017 School Board Work Session and Meeting minutes. The complete version can be found on the District website at springlakeparkschools.org and at the District Services Center in the Superintendents Office.\nA. Call To Order\nChairperson Stroebel called the meeting to order at 6:01pm. The following School Board members were present: Stroebel, Ruch, Hennen, Forsberg, Easter, and Delfs, along with Superintendent Ronneberg. School Board member absent: Amundson, professional reasons.\nB. Agenda Approval – the agenda was approved as presented.\nC. Discussion Items\nInviting Student Learning Environment Project Update: Learning with Franklin Campbell Jones – Mr. Franklin Campbell Jones with Campbell Jones & Associates spent approx. 90 minutes with board members giving them a flavor of the professional learning work going on with +70 Spring Lake Park Schools staff members over the next few months on the topic of Cultural Proficiency. Mr. Campbell Jones led the board members through various activities and opportunities to further their understanding of the learning taking place.\nDistrict Operational Plan: Brief Project Updates – Dr. Ronneberg briefly reviewed the current draft of the Boundary Study Guiding Change with the board to get feedback an additional time as Ms. Schultz starts her work with the design team and input team. The board members had no suggestions for changes to the guiding change document or timeline. Dr. Ronneberg shared an update on other facility related projects\nSchool names – new K-4 elementary school – Mr. Noyed gave an overview of the school naming process, including timeline, solicitation of possible names, and online surveys to narrow the list of options. With board input the list was previously pared down to five names and a follow up survey was conducted. Board members discussed the survey results, and narrowed the list to thee names for further consideration. They will take additional time to consider these names before determining next steps.\nEnrollment Update – Ms. Schultz gave a quick overview of K-12 enrollment, noting that enrollment is up approximately 105 students this year. This is the year that Hazel Reinhardt predicted a lower Kindergarten class size. Currently Ms. Reinhardts prediction for enrollment for the 2017-2018 school year is accurate, different by only 11 students. A more in-depth enrollment report will be shared at the November board meeting.\nPreliminary Taxes Payable Levy 2018 Overview – Ms. Schultz shared information regarding the preliminary taxes payable levy for the 2018-2019 school year, reviewing the levy from last year, this year, and the changes between the two, along with the property tax calendar. This levy generates revenue for the 2018-19 school year. Board discussion centered around the administration recommendation to under levy – decreasing the maximum levy of 5.5% to 2.7%, a decrease of $625,000. Wording of Action Item 1 was updated to reflect that change, removing the word maximum and replacing with the actual levy amount as shown in the action item.\nOther – Dr. Ronneberg updated the board on a recent superintendent meeting regarding next steps in the withdrawal procedure from TIES.\nD. Action Items\n1. Certify the Proposed 2017 Payable 2018 Property Tax Levy in the Amount of $22,864,141.30 was approved.\nE. Adjournment – adjournment of the meeting was approved. Meeting adjourned at 8:26pm.\nAmy Hennen, Clerk,\nSpring Lake Park Schools,\nIndependent School District 16\nPublished in the\nBlaine/Spring Lake Park Life\nOctober 6, 2017\n741804",
    "source_domain": "abcnewspapers.com",
    "title": "School Board - INDEPENDENT SCHOOL DISTRICT 16",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/school-board-independent-school-district-16-15/"
}