{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 14:58:10+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:36:27",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fmortgage-foreclosure-notice-of-mortgage-foreclosure-sale-1402%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "NOTICE IS HEREBY GIVEN that default has occurred in the conditions of the following described mortgage:\nDATE OF MORTGAGE:\nDecember 09, 2005\nORIGINAL PRINCIPAL AMOUNT OF MORTGAGE: $124,700.00\nMORTGAGOR(S): Shana Anderson, An Unmarried Person\nMORTGAGEE: Mortgage Electronic Registration Systems, Inc., as nominee for GN Mortgage, LLC, its successors and/or assigns\nDATE AND PLACE OF RECORDING:\nRecorded: December 15, 2005 Anoka County Recorder\nDocument Number:\n1980522.002\nASSIGNMENTS OF MORTGAGE:\nAnd assigned to: Nationstar Mortgage LLC\nDated: August 15, 2017\nRecorded: August 31, 2017 Anoka County Recorder\nDocument Number:\n2179880.001\nTransaction Agent: Mortgage Electronic Registration Systems, Inc.\nTransaction Agent Mortgage Identification Number:\n100016500005531685\nLender or Broker:\nGN Mortgage, LLC\nResidential Mortgage Servicer: Nationstar Mortgage LLC DBA Mr. Cooper\nMortgage Originator:\nNot Applicable\nCOUNTY IN WHICH PROPERTY IS LOCATED: Anoka\nProperty Address:\n13210 Meadowood Trl NW,\nCoon Rapids, MN 55448-8400\nTax Parcel ID Number:\n05-31-24-12-0150\nLEGAL DESCRIPTION OF PROPERTY: Unit No. 68, Condominium No. 54, Shenandoah Villas 2nd Addition, a Condominium, Anoka County, Minnesota\nAMOUNT DUE AND CLAIMED TO BE DUE AS OF DATE OF NOTICE: $123,934.25\nTHAT all pre-foreclosure requirements have been complied with; that no action or proceeding has been instituted at law or otherwise to recover the debt secured by said mortgage, or any part thereof;\nPURSUANT to the power of sale contained in said mortgage, the above-described property will be sold by the Sheriff of said county as follows:\nDATE AND TIME OF SALE:\nNovember 20, 2017 at 10:00 AM\nPLACE OF SALE: Main Office of the Sheriff, 13301 Hanson Boulevard NW, Andover, Minnesota 55304\nto pay the debt secured by said mortgage and taxes, if any, on said premises and the costs and disbursements, including attorney fees allowed by law, subject to redemption within six (6) months from the date of said sale by the mortgagor(s), their personal representatives or assigns.\nIf the Mortgage is not reinstated under Minn. Stat. 580.30 or the property is not redeemed under Minn. Stat. 580.23, the Mortgagor must vacate the property on or before 11:59 p.m. on May 21, 2018, or the next business day if May 21, 2018 falls on a Saturday, Sunday or legal holiday.\nMortgagor(s) released from financial obligation: NONE\nTHIS COMMUNICATION IS FROM A DEBT COLLECTOR ATTEMPTING TO COLLECT A DEBT. ANY INFORMATION OBTAINED WILL BE USED FOR THAT PURPOSE.\nTHE RIGHT TO VERIFICATION OF THE DEBT AND IDENTITY OF THE ORIGINAL CREDITOR WITHIN THE TIME PROVIDED BY LAW IS NOT AFFECTED BY THIS ACTION.\nTHE TIME ALLOWED BY LAW FOR REDEMPTION BY THE MORTGAGOR, THE MORTGAGORS PERSONAL REPRESENTATIVES OR ASSIGNS, MAY BE REDUCED TO FIVE WEEKS IF A JUDICIAL ORDER IS ENTERED UNDER MINNESOTA STATUTES, SECTION 582.032, DETERMINING, AMONG OTHER THINGS, THAT THE MORTGAGED PREMISES ARE IMPROVED WITH A RESIDENTIAL DWELLING OF LESS THAN FIVE UNITS, ARE NOT PROPERTY USED IN AGRICULTURAL PRODUCTION, AND ARE ABANDONED.\nDATED: October 05, 2017\nASSIGNEE OF MORTGAGEE:\nNationstar Mortgage LLC D/B/A Mr. Cooper\nWilford, Geske & Cook P.A.\nAttorneys for Assignee of Mortgagee\n7616 Currell Blvd Ste 200\nWoodbury, MN 55125-2296\n(651) 209-3300\nFile Number: 038196F01\nPublished in the\nAnoka County UnionHerald\nOctober 6, 13, 20, 27,\nNovember 3, 10, 2017\n740637",
    "source_domain": "abcnewspapers.com",
    "title": "Mortgage Foreclosure - NOTICE OF MORTGAGE FORECLOSURE SALE",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/mortgage-foreclosure-notice-of-mortgage-foreclosure-sale-1402/"
}