{
    "authors": [
        "Olivia Alveshere",
        "Staff Writer",
        "Since",
        "I Have Primarily Covered The Anoka-Hennepin",
        "Spring Lake Park School Districts As Well As The City Of Spring Lake Park For Abc Newspapers."
    ],
    "date_download": "2017-10-06 20:59:58+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:45:16",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fanoka-hennepin-sets-maximum-preliminary-tax-levy%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Since 2013, I have primarily covered the Anoka-Hennepin and Spring Lake Park school districts as well as the city of Spring Lake Park for ABC Newspapers.\nThe Anoka-Hennepin School Board voted to set the 2018 preliminary tax levy at the maximum amount Sept. 25.\nThe vote was unanimous with Council Member Marci Anderson absent for the vote.\nThe district has historically set the tax levy at the maximum, which this year represents a 3.42 percent increase from 2017.\nThe proposed levy and information that will be included in the county’s proposed property tax statements does not include any calculations pertaining to the proposed referendum voters will decide on Nov. 7.\nThe levy is expected to be $3.2 million more than it was in 2017, $95.3 million total.\nThe increase is partially attributed to increasing adjusted net tax capacity and referendum market value in the district, which alters funding formulas. Levy increases and aid decreases with equalization, typically.\nAdjusted net tax capacity is up 7.45 percent, and referendum market value increased 5.65 percent between 2015 and 2016 in the district, according to a presentation by Chief Financial Officer Michelle Vargas. These figures are used to calculate taxes in 2018.\nFurthermore, enrollment continues to grow in the district, and because most formulas are based on student counts, that means the tax levy increases, too.\n“You would expect to see an increase in these formulas,” Vargas said.\nThis year’s estimate of adjusted pupil units represents an increase of 799.\nAdditionally, district referendum levies increase with inflation, estimated at 2.02 percent.\nIf a home’s value increases by less than 6 percent, Vargas would expect school district taxes to increase by 1 percent or less for homes under $300,000 if fiscal disparities hold, she said. That amounts to about $1 per month.\nWith the preliminary property tax levy set at the maximum, the amount levied cannot be increased other than by the election in November.\nAnoka-Hennepin is asking voters to decide on two questions, one for an increase to general education revenue by $226.20 per pupil annually for 10 years, approximately $9.5 million each year, with authorization to increase annually by the rate of inflation, and the other for $249 million to construct and renovate buildings to address safety, space and maintenance needs.\nThe second question is contingent on the first passing.\nThe total tax impact of both questions is $11 per month for the average homeowner in the district.\nA public hearing will be held on the proposed levy Dec. 11, and the board will set a final tax levy following that hearing.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "Anoka-Hennepin sets maximum preliminary tax levy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/anoka-hennepin-sets-maximum-preliminary-tax-levy/"
}