{
    "authors": [
        "Eric Hagen",
        "Staff Writer",
        "I Cover The Cities Of Andover",
        "Blaine",
        "Ramsey. I Have Worked At Abc Newspapers Since August"
    ],
    "date_download": "2017-10-06 16:29:13+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 10:45:24",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fschool-district-ymca-cant-agree-on-re-opening-oak-view-pool%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/uploads/sites/19/2017/10/ovms-pool-1024x685.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "I cover the cities of Andover, Blaine and Ramsey. I have worked at ABC Newspapers since August 2007.\nAs the Anoka-Hennepin School District worked toward drumming up community support for a referendum vote on Nov. 7, it met with the Andover YMCA to see if a partnership could lead to re-opening a pool that closed more than 15 years ago. The pool at Oak View Middle School has been closed since the spring of 2002. Multiple attempts have been made to re-open the pool with the latest concept being a partnership between the Anoka-Hennepin School District and the Andover YMCA, but the two sides could not reach an agreement. File photo\nThe potential partnership was not a new idea. In September 2012, parents, students and coaches appeared at a\nSchool Board meeting to ask for the Oak View Middle School pool to re-open. The Andover City Council decided that the city should not devote funds to re-open the pool but instead should be the connecting force in the school district and YMCA working together.\nNothing happened, but the idea of the school district and YMCA forming a partnership did not completely go away. Dickinson informed the Andover City Council at an April 2016 workshop that both sides had expressed interest in re-opening the pool.\nChuck Holden, the school district’s chief operations officer, said staff from the school district, YMCA and the city of Andover met several times over the past few months to see if a solution could be found.\n“There’s no way we could have afforded to open it on our own,” Holden said.\nThe YMCA was interested in having aquatics programming at Oak View Middle School before, during and after school hours. The middle school is a neighbor to the Andover YMCA.\nThe pool has no separate entrance, so swimmers and their families would have needed to check in like any other visitor. This would have included swiping a driver’s license and identifying yourself on camera before being let into the building and getting a visitor’s pass printed.\nHolden said the district would have also wanted these swimmers to be escorted to and from the pool so they would not be walking freely around the building.\nThis created additional expenses that nobody was willing to pay for, according to Holden and Allison Boes, executive director of the Andover YMCA..\n“Logistically at this point we couldn’t work it out,” she said.\nThe busiest times for the YMCA pool during the school year is early morning swim lessons for adults and after school lessons for kids, according to Boes.\nHolden said the school district would have only been interested in re-opening the Oak View Middle School pool if the Andover High School girls’ and boys’ swimming and teams could have used it for practices and competitions, but this would have conflicted with the YMCA’s programming.\nThe pool closed in the spring of 2002 after a school district levy failed in 2001. Andover High School opened in the fall of 2002 so it has never had a home pool.\nAndover’s teams share the Anoka Middle School for the Arts (Fred Moore campus) pool with the Anoka teams. Blaine and Coon Rapids share Northdale Middle School’s pool.\nThe district asked voters in 2002 and 2007 if they would approve a tax increase to re-open closed pools at Oak View Middle School and Coon Rapids Middle School, but the majority of people who showed up gave a thumbs down.\nThe Coon Rapids Middle School pool is no more. It is now used for a cafeteria and gymnasium.\nOn Nov. 7, voters in the Anoka-Hennepin School District are facing two questions. The first question asks for an increase to general education revenue by approximately $9.5 million each year, with authorization to increase annually by the rate of inflation. The second question asks for $249 million that includes construction of two new elementary schools, building additions so portable classrooms are no longer needed and completing construction of secured entrances at all schools.\nHolden said the Fit for the Future Task Force concentrated on classroom needs and re-opening the Oak View Middle School pool or converting it to another use was not recommended by the task force.\nHe believes it would be premature to completely get rid of the pool.\n“It’s a great pool and ideally we’d like to be able to re-open it,” he said.\n[email protected]",
    "source_domain": "abcnewspapers.com",
    "title": "School district, YMCA can’t agree on re-opening Oak View pool",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/school-district-ymca-cant-agree-on-re-opening-oak-view-pool/"
}