{
    "authors": [
        "Ecm Publishers"
    ],
    "date_download": "2017-10-06 14:57:57+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:34:57",
    "description": null,
    "filename": "http%3A%2F%2Fabcnewspapers.com%2F2017%2F10%2F06%2Fnotice-of-sales-notice-of-public-auction-sale%2F.json",
    "image_url": "http://abcnewspapers.com/wp-content/themes/paperboy/img/favicon.ico",
    "language": "en",
    "localpath": null,
    "maintext": "Seized Property\nUnder the authority in Internal Revenue Code section 6331, the property described below has been seized for nonpayment of Internal Revenue taxes due from Thomas L & Barbara J Bashaw. The property will be sold at public auction as provided by Internal Revenue Code section 6335 and related regulations.\nDate: October 18, 2017\nTime: 10:00 am. Bidder registration begins at 09:30 a.m.\nPlace: Aitkin County Sheriff Office, 217 2nd Street NW, Room 185, Aitkin, MN 56431\nProperty may be inspected drive by only.\nOnly the right, title, and interest of Thomas L & Barbara J Bashaw in and to the property will be offered for sale. If requested, the Internal Revenue Service will furnish information about possible encumbrances, which may be useful in determining the value of the interest being sold.\nPhysical address: 47123 156th Place, Tamarack MN 55787\nLegal Description: Lot 4, Block 2, First Addition to Wilsona Beach according to the filed plat thereof, subject to easements and mineral rights of record, if any.\nMinimum bid $51,000.00\nThe Terms of Payment: 20% of the highest bid, balance is due no later than November 15, 2017. All payments must be by cash, a certified , cashiers or treasurers check drawn on any bank or trust company incorporated under the laws of the United States or under the laws of any State, Territory, or possession of the United States, or by a United States postal, bank, or express money order. Make check or money order payable to the United States Treasury.\nThe Government reserves the right to reject any and all bids and to withdraw the property from the sale.\nFor additional information about the property and proposed sale, please contact Patty Hall; Property Appraisal & Liquidation Specialist at 214-422-7386 or visit www.i rsauctions.gov\nPublished in the\nAnoka County UnionHerald\nOctober 6, 2017\n740387",
    "source_domain": "abcnewspapers.com",
    "title": "Notice of Sales - NOTICE OF PUBLIC AUCTION SALE",
    "title_page": null,
    "title_rss": null,
    "url": "http://abcnewspapers.com/2017/10/06/notice-of-sales-notice-of-public-auction-sale/"
}