{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-04-17 18:33:21+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "While the country debates the merits of a new private jet for president Jacob Zuma, new data shows that a high number of ultra-wealthy South Africans own their…",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Fwealth%2F170567%2Fhigh-number-of-ultra-rich-south-africans-own-a-private-jet%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2016/06/Charter-jet.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "While the country debates the merits of a new private jet for president Jacob Zuma, new data shows that a high number of ultra-wealthy South Africans own their own plane.\nA recent report in the Sunday Times revealed that Zuma is set to get a new R1.3 billion private jet on top of the current presidential plane, Inkwazi, much to to the consternation of many who argue that the money could be better spent elsewhere.\nThe Sunday paper said that discussions are underway to purchase a jet which can seat 18 people for shorter trips in Africa, while Inkwazi will be used for international flights.\nNow data compiled by New World Wealth reveals that the president would be in crowded company should the deal progress, with as many 160 dollar multi-millionaires owning a private jet in South Africa.\nHigh demand for private jets in Africa has been pushed by poor commercial travel infrastructure and the massive distances between business hubs on the continent. Private jets are a popular choice for businessmen, and companies to eliminate the time wasted in airports.\nAccording to Corporate Jet Investor, dedicated to the business jet market, South Africa is 11th in the world in terms of jet registries, ahead of countries like Australia, France and Switzerland.\nJets can range in price, starting from as little as $500,000 for a second hand Learjet aircraft, or $4 million for a Beechcraft King Air, to in excess of $60 million for a Gulfstream 550 which can accommodate up to 12 passengers.\nFor companies, the Boeing Business Jet ranges between $55 million and $300 million plus, accommodating between 25 and 50 passengers, with three crew members.\nAccording to NWW’s South Africa 2017 Wealth Report, the country has a total of 40,400 dollar millionaires, and has many as 2,130 individuals with more than R125 million in their account.\nThe top private jet markets in Africa:\nRead: New ‘secret’ plan for a R1.3 billion private jet for Zuma",
    "source_domain": "businesstech.co.za",
    "title": "High number of ultra-rich South Africans own a private jet",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/wealth/170567/high-number-of-ultra-rich-south-africans-own-a-private-jet/"
}