{
    "authors": [],
    "date_download": "2017-01-02 18:09:19+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "28 of the 58 National Senior Certificate subjects written by the matric class of 2016 will have their marks adjusted upwards, assurance body Umalusi announced…",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Fgovernment%2F148481%2Fhalf-of-2016s-matric-subjects-will-have-their-marks-adjusted-upwards%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2014/07/Maths-fail.png",
    "language": "en",
    "localpath": null,
    "maintext": "28 of the 58 National Senior Certificate subjects written by the matric class of 2016 will have their marks adjusted upwards, assurance body Umalusi announced recently.\nWhile the number of subjects adjusted upwards has been disclosed, the reasons why certain subjects were chosen for a mark increase have not been made public, said Gavin Davis – the DA’s Shadow Minister of Basic Education.\nDavis recently wrote an open letter to Umalusi, asking the body why certain matric 2016 results were adjusted by it and the Department of Basic Education.\nIn the letter, Davis disclosed information about the matric 2016 mark adjustments which was revealed during a recent “standardisation meeting” with Umalusi and the department which he attended.\n“Some of the subjects saw a dramatic upwards adjustment,” said Davis, including maths and maths literacy.\nConfidential report\nDavis said attendees of the meeting were given data books on the mark adjustments and were told which marks would be adjusted.\nHe said the data was marked as confidential and he was given a confidentiality agreement to sign, which he did not do – on the grounds that his duty to act in the public interest overrode it.\nDavis said there was no reason why the matric results – and their adjustments – should not be open for the public to scrutinise.\nThe 28 subjects which were adjusted upwards are detailed in the table below, as per the information supplied by Davis.\nDavis said Tshivenda Home Language and Geography were adjusted using a non-computer-calculated formula. A group of subjects also only received half adjustments based on the recommended computer-calculated figures.\nThe full breakdown of adjustments per subject can be seen on MyBroadband.\nWhy marks are adjusted\nUpward mark adjustments normally take place when “the exam paper was demonstrably more difficult than previous years”.\nDavis said no evidence was put forward to “demonstrate that these papers were of a higher standard” and that the starting point for adjusting the marks was not the papers, but the results.\n“In cases when the raw mark was worse than last year’s, the department went back to the paper and found difficult questions to explain the drop in the raw mark. The DBE then motivated for the raw mark to be adjusted upwards accordingly.”\nDavis said this method was incorrect, as the difficulty of the paper should be assessed independently of the results.\n“The problem of using the raw marks… is that there may be cases in which the paper was of the appropriate standard, but the learners were below the standard of previous years.”\nHe also pointed out that where subject marks were higher than previous years, the department did not go back to the exam papers to see if they were “too easy”.\n26 subjects did not have their marks adjusted, while four subjects had their marks adjusted downwards.\n“There was little interrogation of why the raw mark was better than last year’s and whether this could have been because the paper was too easy,” said Davis.\n“Instead of adjusting the marks downwards, the good raw mark was accepted as a welcome sign that the system is improving.”\nSubjects which did not have their marks adjusted included:\nPhysical Science – raw mark of 35.48 and a rejected adjusted mark of 34.45.\n– raw mark of 35.48 and a rejected adjusted mark of 34.45. History – raw mark of 44.56 and a rejected adjusted mark of 44.01.\n– raw mark of 44.56 and a rejected adjusted mark of 44.01. English – raw mark of 54.72 and a rejected adjusted mark of 54.34.\nUmalusi was asked to comment on the mark adjustments, but it did not reply to questions.\nRead: SA private schools boast 98.67% pass rate",
    "source_domain": "businesstech.co.za",
    "title": "Half of 2016’s matric subjects will have their marks adjusted upwards",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/government/148481/half-of-2016s-matric-subjects-will-have-their-marks-adjusted-upwards/"
}