{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-01-02 10:33:52+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "The majority of South Africans have experienced a difficult 2016 financially. Thankfully, with a new year comes new planning and fresh goals.",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Ffinance%2F147715%2Fhow-to-make-your-money-work-harder-for-you-in-2017%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2015/07/Money-street-road.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The majority of South Africans have experienced a difficult 2016 financially. Thankfully, with a new year comes new planning and fresh goals.\nFor those who are looking towards 2017, Alexander Forbes financial planning consultant Rita Cool, provides some tips on how to make your money work harder for you.\nMake sure you have a budget – Without knowing what you spend money on you won’t know where you could find lost cash. Once you have identified where the money is going monthly you can decide how and where you can save\n– Without knowing what you spend money on you won’t know where you could find lost cash. Once you have identified where the money is going monthly you can decide how and where you can save Check your bank fees – Are you in the best structure for your needs? Are you paying for services that you never use? It is not impossible to move banks to get a better deal.\n– Are you in the best structure for your needs? Are you paying for services that you never use? It is not impossible to move banks to get a better deal. Don’t draw cash from banks other than your own so that you do not need to pay service charges – Make sure you know what the transaction fees would be if you draw from till points or transfer money to family. Did you know that you started paying interest immediately if you draw cash from a credit card and that you do not get three or six months’ interest free?\n– Make sure you know what the transaction fees would be if you draw from till points or transfer money to family. Did you know that you started paying interest immediately if you draw cash from a credit card and that you do not get three or six months’ interest free? Buy second hand and sell items – Anything from school clothes and TVs are bought and sold. Advertise properly to get the maximum amount so you can free up cash.\n– Anything from school clothes and TVs are bought and sold. Advertise properly to get the maximum amount so you can free up cash. Buy cash where possible – Interest rates on hire purchase items are very high and you pay around 20% more for those items than the sticker price.\n– Interest rates on hire purchase items are very high and you pay around 20% more for those items than the sticker price. Don’t try to keep up with your neighbours – Looks are deceiving. They might drive a fancy car but you don’t see that they don’t have no furniture or no savings for the future.\n– Looks are deceiving. They might drive a fancy car but you don’t see that they don’t have no furniture or no savings for the future. Shop around but don’t drive all over to get a “bargain” – The petrol spent to get the discount might not make it worthwhile. Buy long shelf life items when they are on sale. For example toilet paper and washing power can be kept for quite long but you need to know your prices to be able to make use of the value\n– The petrol spent to get the discount might not make it worthwhile. Buy long shelf life items when they are on sale. For example toilet paper and washing power can be kept for quite long but you need to know your prices to be able to make use of the value Use discount vouchers – The main food retailers have loyalty programme structures that can be tailored to your specific spending patterns. Make sure you claim point or vouchers but look out for monthly costs to belong to a rewards program. Ask yourself if your monthly savings validate the cost. Optimally a reward scheme shouldn’t cost you money.\n– The main food retailers have loyalty programme structures that can be tailored to your specific spending patterns. Make sure you claim point or vouchers but look out for monthly costs to belong to a rewards program. Ask yourself if your monthly savings validate the cost. Optimally a reward scheme shouldn’t cost you money. Drive at the speed limit – It saves petrol, fines your car and perhaps your life.\n– It saves petrol, fines your car and perhaps your life. Check your current insurances – Do an insurance rebroke. Make sure you are covered for what you need and take things off the list that you do not have any more and add what you have bought since the last update. Make sure you are not under or over insured and that your premium is market related. The cheapest premium isn’t always the best so be aware of exclusions and excesses and make sure you can afford the excess if you need to claim.\n– Do an insurance rebroke. Make sure you are covered for what you need and take things off the list that you do not have any more and add what you have bought since the last update. Make sure you are not under or over insured and that your premium is market related. The cheapest premium isn’t always the best so be aware of exclusions and excesses and make sure you can afford the excess if you need to claim. Check if you actually need a pay out on your insurance sometime in the future – In most cases you can reduce your monthly premiums by not having a pay out in the future. If you want a pay out in the future save the extra premium in an investment product, not a risk product.\n– In most cases you can reduce your monthly premiums by not having a pay out in the future. If you want a pay out in the future save the extra premium in an investment product, not a risk product. Be wary of consolidating debt – You might pay a lower interest rate but it might well be over a longer period so the total interest paid will be higher. If you have debt issues, set up a debt plan with dates and goals to reduce the debt little by little. Do not give up.\nRead: This is how much more money you spend over Christmas",
    "source_domain": "businesstech.co.za",
    "title": "How to make your money work harder for you in 2017",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/finance/147715/how-to-make-your-money-work-harder-for-you-in-2017/"
}