{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-06-15 06:14:35+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "The major highways between Joburg and Tshwane are in absolute chaos due to road blockages caused by a major taxi strike.",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Flifestyle%2F179385%2Ftaxi-strike-these-are-the-roads-you-must-avoid%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2016/02/Taxi-Minibus-Transport-e1469609373556.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The major highways between Joburg and Tshwane are in absolute chaos on Thursday morning due to road blockages caused by a major taxi strike.\nCommuters were also left stranded as Gauteng chairperson of the South African Taxi Council (Santaco), Ralph Jones, said the taxi industry would march to the South African Taxi Finance offices in Midrand.\n“This is to hand over a memorandum of grievances to the directors of the company. Some members of the taxi industry have been hard hit by the high interest rate of 28% and blacklisting due to payment of R15‚000 per month over 72 months,” he said in a statement.\n“We can’t take it any more‚” Jones said.\nMotorists were warned to avoid all major highways around Joburg and Pretoria, including the M1, N1, N12, N14, and parts of the N3 as taxis had been blocking these routes since the early hours of Thursday morning.\nThe City of Joburg called on motorists to avoid the following routes due to blockages.\nThere have also been reports of roads being blocked on main routes around Pretoria, with claims that taxi drivers are threatening those who are giving lifts to stranded commuters.\nThe Gautrain has also suspended its bus service as staff members are unable to reach stations, it said in a statement.\nThe Johannesburg Metro Police Department said that Santaco has been granted permission to march, and officers will be deployed in an attempt to ensure a smooth flow of traffic.\nSpokesperson, Isaac Mahamba told the SABC: “The areas that we think could be affected is the area around Rosslyn, some roads around the CBD and there’s a possibility that they might go and march to the SA Reserve Bank. We will deploy our metro police officers to monitor those areas that I’ve just mentioned.”\nGauteng education MEC Panyanza Lesufi called for parents to keep their kids at home due to the massive disruptions.\nThe Taxi strike is centered around Joburg and Pretoria today, but follows similar action held in Durban a few weeks back. Cape Town is yet to experience the same, but several commentators warn that a strike in the Mother City may also be on the cards soon.\nRead: SA taxi drivers may soon need to get training and a special certificate to operate",
    "source_domain": "businesstech.co.za",
    "title": "Taxi strike - these are the roads you must avoid",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/lifestyle/179385/taxi-strike-these-are-the-roads-you-must-avoid/"
}