{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-02-15 10:34:49+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The Democratic Alliance says that the ANC continues to reference members from the past because it is too embarrassed to talk about its current leaders.",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Fmedia%2F157677%2Fwatch-anc-too-embarrassed-to-talk-about-its-current-leaders-da%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2015/09/DA-vs-ANC.png",
    "language": "en",
    "localpath": null,
    "maintext": "The Democratic Alliance says that the ANC continues to reference members from the past because it is too embarrassed to talk about its current leaders.\nDA chief whip John Steenhuisen lambasted the ruling party in a speech delivered in Parliament on Tuesday during the State of the Nation (SONA) Debate.\n“I also would be pulling out O.R Tambo from the archives if this is what was sitting in the presidency of my party today, too embarrassed to talk about your current leaders, so you’ve got to go back and resurrect them from the past,” Steenhuisen said pointing in the direction of president Jacob Zuma, who was in attendance.\n“If O.R Tambo was around today, he would be disgusted with what’s happened to his party, and he would be disgusted with what’s happened to you,” the chief whip said.\nThe theme for SONA 2017 was: “The Year of Oliver Reginald Tambo: Unity in Action Together Moving South Africa Forward.”\nPresident Zuma opened his SONA address with the following last week:\n“An illustrious son of our country, President Oliver Reginald Tambo, would have turned 100 years old this year, had he lived.\n“This selfless patriot [dedicated] his adult life to a tireless pursuit of the liberation of our country and its people. He left a lasting legacy for all South Africans, and not only for his organisation, the ANC.\n“In his honour, we have declared the year 2017, the Year of Oliver Reginald Tambo. It is the year of unity in action by all South Africans as we move South Africa forward, together,” the president said.\nSteenhuisen dug in deeper:\n“How disappointing it must have been for each of the 9 million South Africans sitting at home without work, desperate for a glimmer of hope that things will get better. All they were served was a dish of more high rhetoric, more empty promises and yet another year of despair to add to the eight previous years of the Zuma presidency,” Steenhuisen told the house amid much heckling from ANC members.\nRead: Questions raised by Zuma’s SONA that no one can answer just yet",
    "source_domain": "businesstech.co.za",
    "title": "Watch: ANC too embarrassed to talk about its current leaders - DA",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/media/157677/watch-anc-too-embarrassed-to-talk-about-its-current-leaders-da/"
}