{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-06-15 10:47:34+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 00:00:00",
    "description": "South African minister of mineral resources Mosebenzi Zwani has announced government’s new position on mine ownership in the country, saying that 30% of all…",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Fbusiness%2F179547%2Fsouth-african-mines-must-be-30-black-owned-mining-minster%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2016/10/Zwane.png",
    "language": "en",
    "localpath": null,
    "maintext": "South African minister of mineral resources Mosebenzi Zwani has announced government’s new position on mine ownership in the country, saying that 30% of all mines need to be black-owned.\nThe minister made the announcement at a policy meeting on Thursday.\nAccording to Bloomberg, Zwane said that the new policy was that prospecting rights must also have 50% black control and the Mining Charter will channel a minimum of 1% of mine turnover to local communities.\nLate on Wednesday, the South African Chamber of Mines declined an invitation to attend a last-minute meeting that was to be held before the announcement.\nThe body said that it viewed the review of the mining rules as a flawed process, and would not be co-opted into participating in and providing support to the department of mineral resources’ agenda.\nThe chamber believes that government had failed to engage properly with stakeholders about the contents of the charter.\nA draft version of the charter which was released in April 2016 said all local assets must be 26% owned, irrespective of deals done to increase ownership in the past.\nRead: Mining minster Zwane joins Zuma and van Rooyen bid to block state capture report",
    "source_domain": "businesstech.co.za",
    "title": "South African mines must be 30% black-owned: Mining minster",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/business/179547/south-african-mines-must-be-30-black-owned-mining-minster/"
}