{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-02-15 12:06:52+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Fund manager Coronation has released a table detailing the rise of income tax over the past four years, ahead of finance minister Pravin Gordhan’s budget speech…",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Ffinance%2F156854%2Fhow-much-your-income-tax-has-increased-over-the-past-4-years-in-sa%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2015/05/Tax-03.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Fund manager Coronation has released a table detailing the rise of income tax over the past four years, ahead of finance minister Pravin Gordhan’s budget speech.\nGordhan will deliver his national budget speech on 22 February 2017.\n“While new and/or higher indirect taxes, closing loopholes and tightening the tax net may help, it is likely that the personal income tax system will bear a significant share of the load, as was the case in the preceding two budgets,” said Pieter Koekemoer, head of personal investments at Coronation.\nKoekemoer outlined how the effective rate of tax has changed over the last three years for different levels of taxable income.\n“We can expect a similar increase across the income spectrum in the next tax year. It is also likely that very high income earners (taxable income above R1 million) may be impacted by a higher marginal rate,” he said.\nHe further pointed out that Judge Dennis Davis, the chair of a tax reform committee, has suggested that this rate may be as high as 45%.\nThe table assumes 6% salary inflation for the indicated starting salary to illustrate the impact of bracket creep and rate changes, where applicable. It assumes the taxpayer is below 65.\nOlder taxpayers will have slightly lower effective tax rates, as they qualify for additional rebates.\nThe capital gains tax rate is a function of the marginal rate and the inclusion rate (currently 41% and 40% respectively for individuals).\nTreasury intends to raise an additional R28 billion in revenue in 2017 and a large chunk of this is expected to come from a 50 cents hike in the fuel levy which would raise an extra R10 billion annually.\nKyle Mandy, a tax policy leader at PWC (PricewaterhouseCoopers), told SABC: “We can’t see an increase in VAT. We have no choice but to see significant increases in the fuel levy, as we saw in the last couple of years. In the past two years we have seen an increase in terms of the ball park figure of 30 cents a litre.\n“So in the current year it will have to be significantly much higher than that if the minister is going to raise a significant amount of tax through this.”\nRead: These 4 graphs sum up South Africa’s massive economic challenges",
    "source_domain": "businesstech.co.za",
    "title": "How much your income tax has increased over the past 4 years in SA",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/finance/156854/how-much-your-income-tax-has-increased-over-the-past-4-years-in-sa/"
}