{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-04-18 11:14:28+00:00",
    "date_modify": null,
    "date_publish": "2017-04-18 00:00:00",
    "description": "The SA Post Office warns the public to be on alert of a parcel delivery scam designed to defraud them.",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Ftelecommunications%2F170773%2Fsa-post-office-warns-against-scam%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2016/02/South-African-Post-Office-SAPO.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The SA Post Office warns the public to be on alert of a parcel delivery scam designed to defraud them.\nMembers of the public receive phone calls by persons pretending to be from the Customs division of the SA Post Office. The caller informs them that a parcel is ready for collection – provided they first pay money into an account.\nAccording to the caller, the money is for customs duties and courier fees.\nIn one instance, a member of the public was requested to pay R1,500 in courier charges and R2,000 in customs fees, it said.\nMembers of the public are directed to a website that appears similar to the Speed Services website. The phone number, however, is in the United Kingdom with a prefix of +44.\nCustomers are also given a pin which they have to enter before they can ‘track’ the fictitious parcel. The Post Office stressed that it does not use pin numbers for its tracking service.\n“The SA Post Office does not require customers to make any bank deposit before parcels are released. In instances where SARS levy import tax on parcels from abroad, the import tax must paid at the Post Office counter when the item is collected. The customer will receive a receipt for this payment.\n“Where the Post Office has the cellphone number of the recipient, the customer will receive an SMS requesting him or her to collect the parcel at a specific Post Office branch. The SMS will not request that funds be deposited into an account,” it said.\nRead: SA Post Office wants to be a bank by mid-2017",
    "source_domain": "businesstech.co.za",
    "title": "SA Post Office warns against scam",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/telecommunications/170773/sa-post-office-warns-against-scam/"
}