{
    "authors": [],
    "date_download": "2017-01-02 15:07:22+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": "Government representatives who contravene national foreign policy should have their official passports taken away, the ANC said on Monday.",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Fgeneral%2F148477%2Fanc-wants-renegade-da-mayors-passport-taken-away%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2016/08/DAGauteng-e1472468868705.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Government representatives who contravene national foreign policy should have their official passports taken away, the ANC said on Monday.\n“The ANC… calls on Dirco (the Department of International Relations and Co-operation) urgently to confiscate all official and diplomatic passports from officials who are found to be wilfully undermining our foreign policy,” said ANC national spokesperson Zizi Kodwa.\nThe ruling party was responding to a trip to Taiwan – apparently aimed at seeking investment opportunities – which was undertaken by the DA’s Tshwane Mayor Solly Msimanga over the festive season.\nPreviously, the Department of International Relations and Co-operation harshly criticised the trip, saying it was in conflict with South Africa’s recognition of the One China policy.\nAccording to this, South Africa recognises Beijing as the sole legal government in China. Furthermore, as per this policy, Taiwan is considered a part of China.\nChina is currently South Africa’s biggest trading partner.\nPreviously, Msimanga’s office dismissed criticism of the trip as “short-sighted”.\n“The Executive Mayor of Tshwane believes that all potential opportunities for trade and investment must be diligently interrogated,” said spokesperson Samkelo Mgobozi late last month.\nOn Monday, Kodwa said that Msimanga, as a senior government official, was “bound” by existing government policy.\nBesides the suggestion of taking away the official passports of those who contravene the policy, the ANC also suggested that the Taipei Liason Office in Tshwane be reprimanded for issuing the invitation to Msimanga, as an act of “extreme disrespect for our foreign policy”.\nGovernment departments and parastals also needed to be “remind[ed]” of the country’s foreign policy, as well as “the centrality of the Presidency and Dirco”, suggested Kodwa.\n“The City government of Tshwane is not an autonomous state which acts on a frolic of its own outside of government policy.”\nHe said that Msimanga had transgressed, not only government policy, but also “the spirit of co-operative governance as enshrined in the constitution”.\n“He has started a precedence which, if allowed, can only render the entire system of government impotent,” warned Kodwa.\nNews24\nRead: Political turmoil in 2016 can be traced back to the 2008 financial crisis",
    "source_domain": "businesstech.co.za",
    "title": "ANC wants ‘renegade’ DA mayor’s passport taken away",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/general/148477/anc-wants-renegade-da-mayors-passport-taken-away/"
}