{
    "authors": [
        "Staff Writer"
    ],
    "date_download": "2017-02-15 15:08:52+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Three South African banks have been implicated among 17 banking groups in ‘widespread’ collusion relating to the the price-fixing of the rand.",
    "filename": "https%3A%2F%2Fbusinesstech.co.za%2Fnews%2Fbanking%2F157915%2Fsa-banks-face-massive-fines-over-price-fixing-and-collusion%2F.json",
    "image_url": "https://businesstech.co.za/news/wp-content/uploads/2015/09/Corruption-2.png",
    "language": "en",
    "localpath": null,
    "maintext": "Three South African banks have been implicated among 17 banking groups in ‘widespread’ collusion relating to the the price-fixing of the rand.\nFollowing an almost two-year investigation into the matter, the Competition Commission has now referred a collusion case to the Competition Tribunal for prosecution.\nAccording to the Competition Commission, it has been investigating the matter since April 2015. The investigation looked at cases of price fixing and market allocation in the trading of foreign currency pairs involving the rand.\nIn mid-2015, when the investigation kicked off, Competition Commissioner Tembinkosi Bonakele said that the collusion was widespread, and happened very “casually” through electronic platforms, such as group chats.\nReuters reported that the banks used an instant messaging chat room called “ZAR Domination”, to coordinate their trading activities when giving quotes to customers who buy or sell currencies.\nZAR is the code for the South African rand used in financial markets.\nIt has been alleged that currency traders have been buying and selling US dollars in exchange for the rand at fixed prices. This was accomplished by making false sales to drive up demand, or colluding to agree not to trade for specified periods of time.\nWhat sparked the local investigation is still unknown, however it followed several international investigations where prominent banking groups were brought to book for price-fixing, and were made to pay fines or settlements.\nIn South Africa’s case, the Commission is seeking an order declaring that the 17 banks are liable for the payment of an administrative penalty equal to 10% of their annual turnover.\n“The referral of this matter to the Tribunal marks a key milestone in this case as it now affords the banks an opportunity to answer for themselves‚” said the commissioner, Tembinkosi Bonakele.\nThe 17 banks implicated include:\nBank of America Merrill Lynch International\nBNP Paribas\nJP Morgan Chase & Co\nJP Morgan Chase Bank\nInvestec\nStandard New York Securities\nHSBC Bank\nStandard Chartered Bank\nCredit Suisse Group\nStandard Bank of South Africa\nCommerzbank AG\nAustralia and New Zealand Banking Group\nNomura International\nMacquarie Bank\nABSA Bank Limited (ABSA)\nBarclays Capital\nBarclays Bank\nRead: R500,000 fine or 10 years in jail for collusion and price-fixing in SA",
    "source_domain": "businesstech.co.za",
    "title": "3 South African banks face massive fines for price-fixing and collusion",
    "title_page": null,
    "title_rss": null,
    "url": "https://businesstech.co.za/news/banking/157915/sa-banks-face-massive-fines-over-price-fixing-and-collusion/"
}