{
    "authors": [
        "Teena L Myers"
    ],
    "date_download": "2018-02-03 14:34:07+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 12:59:31",
    "description": null,
    "filename": "http%3A%2F%2Fblog.nola.com%2Ffaith%2F2018%2F02%2Fmagnifying_glass_or_mirror_1.html.json",
    "image_url": "http://image.nola.com/home/nola-media/width620/img/faith/photo/18399777-standard.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Guest Blogger Sam Elliot\nThis week, I want to ask you to consider this question, do you spend more time inspecting your mate looking for flaws or do you spend more time inspecting yourself in an effort to be a better husband/wife? It is easy to fall into the trap of carrying a magnifying glass when we should be carrying a mirror. Proverbs 11:27 tells us, \" He who seeks good finds favor, but trouble comes to him who seeks evil\". In other words, we find what we search for. So, what are you searching for in your mate?\nI have found that it seems to be part of the human condition to shift into fault - finding mode when we finally get what we dream of. We seem to do it in every area of life. We dream of a car and soon after we get it, we are dreaming of a better car. We dream of a job and soon after getting it, we are complaining about its flaws. We get all excited about the latest fashion styles and then a few years later we are embarrassed by the pictures of us in these formerly awesome clothes. The list goes on. We do this in nearly every area of life and most of it is harmless, but when we begin to approach our husband/wife this way it is a big problem.\nThis involves false expectations, fear, and some pride. Let's start by looking at the false expectations. Many have the idea that marriage will create a life of happiness and rainbows that will be free of disappointments. They have the expectation that their husband/wife will be like a genie in a bottle that will always meet their every need. So, when their mate is unable to fill that role, they begin to look for flaws in their mate and spend their time thinking about the many flaws of their mate. In some instances, they convince themselves that they made a mistake in marrying someone so flawed. Some feel angry because they feel tricked. Others set out to control or fix their mate. All of these are toxic approaches that will create distance in the relationship.\nThe truth about marriage is that two flawed people are living life together. There will be fatigue, sickness, disappointments, a lack of knowledge about what to do, and a host of other struggles. Marriage is about a husband and wife who walk through life together helping, encouraging, and accepting each other. Fault-finding, criticism, and blame laying undermine our ability to enjoy the blessing of marriage as God intended.\nIt is not my job to find fault in my wife and fix her. It is my job to find fault in me and ask God to help me grow into a better husband and father. It is my job to stand by my wife and offer her love, acceptance, and encouragement. Have you fallen into a pattern of pointing out your mate's flaws? Today is the day to seek God's forgiveness and help to lift up your mate! I hope you will join me this week as we consider this further.\nYesterday, I mentioned that this is primarily driven by false expectations, fear, and pride. We thought a little about false expectations. Many get married without preparing themselves for the reality that their mate is a human with limitations in every area including knowledge, energy, abilities, finances, and character. When they come face to face with these limitations, disappointment follows. The answer is to accept our mate's limitations and work together to overcome the challenges of life.\nToday, I want to look at how fear plays into this equation. When we see the flaws and limitations of someone close to us we are faced with a choice. Either we can remember that they have positive qualities or we can re-define them according to these flaws. When we re-define our mate according to his/her flaws or limitations it opens the door for several negative practices.\nFirst of all, this re-defining causes us to lose respect and appreciation for our mate. We approach them with the fearful expectation of failure and disappointment. This affects every aspect of the relationship. People who have re-defined their mate this way have a disrespectful doom and gloom attitude toward their mate. They even tell themselves over and over that their mate is nothing special or is not what they had hoped for. This is poison in the relationship.\nSecondly, this leads to a lack of trust. This attitude leads to an inability to trust that their mate will handle anything properly so they develop the habit of second guessing everything their mate says or does. This leads to hopelessness.\nThird, this leads to a fear of our mate disappointing us in the future. This person begins to predict and expect the worst from their mate.\nFourth, this opens the door for many to relate to their mate as the chief fixer or corrector. Correcting everything their mate says. Instructing their mate on how to live and work and basically do everything. The relationship takes on a parent/child element and there is a seedbed for resentment. Everyone wants to be loved, appreciated, and encouraged by their mate. When that part of the relationship sours, the whole relationship becomes sour and unpleasant. So, are you focused on your mate's flaws? Do you spend your time fearful that your mate will fail you or embarrass you? Is fear overwhelming your admiration for your mate? It's time to re-visit your mate's strengths and good qualities.\nToday, I want to look briefly at the element of pride. Pride is really the foundation of this condition. The Bible has a lot to say about this, but I would like to remind you about the encounter Jesus had with the woman who was about to be stoned for adultery. The religious leaders looked to Jesus for His stance and He simply said, \"Whoever is without sin throw the first stone\". After a moment of reflection, they all dropped their stones and left. Jesus was not condoning or minimizing immorality. He instructed the woman to repent and turn away from this terrible sin. However, He was also making the point that since we have all failed and come up short, we are in no position to set ourselves up as judges over others. I need to make a side note here, we are commanded to come alongside others who are trapped in sin and help them come out to a life of freedom. So, helping someone is right and is not judging.\nThe point for our purposes is that none of us are in a position to look down on our mate and constantly keep track of all his/her successes and failures. I have known men and women who were so obsessed with the flaws of their mate that they were more like a taskmaster than a husband/wife. They were always correcting every word their mate spoke. They were planning their mate's daily schedule. They were inspecting everything their mate did. They appointed themselves to push their mate constantly. In conversation, they loved to tell others about how incompetence of their mate. They loved to laugh and brag about how they were exhausted from keeping their mate in line. In short, they made their mate miserable. All of this is built on an attitude of pride. They had forgotten that they also have flaws. They pretend that they have no limitations.\nThese people spent all their time inspecting their mate with a magnifying glass looking for something to complain about and fix. The truth is that everyone can see that they need to put down the magnifying glass and pick up a mirror because they have become the worst marriage partner of all. I have often thought concerning these people, \"Thank you God that I am not married to someone like that\". Here is a question, is that how you treat your mate? If so, today is the day to repent of pride and seek forgiveness and help from God and your mate!\nSo far, we have thought a little about how false expectations, fear, and pride factor into this toxic marriage habit that far too many practice. Today, I want to think a little more about how we define our mate. This could be re-stated in terms of what we say to ourselves about our mate.\nSome people keep a secret list of every way their mate has disappointed them and a list of terms or even names has become prominent in the way they think of their mate. Many times these are derogatory terms like; stupid, incompetent, frigid, stubborn, liar, lazy, untrustworthy, stingy, wasteful, sloppy, neat freak, and the list goes on and on. I think you get the point. These words normally come spilling out when you are upset. They define your mate and set the tone for how you will relate to your mate.\nRemember how you once defined your mate, back in the early days of your relationship. You used words like wonderful, handsome/beautiful, brilliant, capable, trustworthy, bright, and the list also goes on and on. The truth is that these two very different descriptions define the same person. The only thing that has changed is your attitude. I know life has probably dealt you some real challenges, but your mate is still the same person. There was an opportunity to call out the best in each other, lean on each other, and help each other through. This is what makes a marriage strong.\nInstead, too many resort to self-preservation by blaming their mate for everything. Instead of lifting each other up, too many throw stones of accusations and add another charge to the list of how their mate has let them down. It is impossible to have a warm, loving relationship like that. 1 Corinthians 13 tells us that real love forgives and keeps no record of wrongs. So, when we re-define our mate according to his/her limitations, flaws, and failures instead of by his/her strengths, gifts, talents, and successes what does that say about our love? Whether our mate has issues that need addressing or not is secondary, the primary concern is that we have a crisis of love. Love for our mate has been replaced by love of self that is willing to hurt our mate to protect self from disappointment. The greatest enemy of marriage is self. If it's time for you to get back on the right track, call out to God and He will help you!\nThe cure for this toxic condition is very simple, but requires a serious commitment to change. I would suggest first of all, that we need to inspect our heart to determine the truth about how we think of our mate. I would suggest making a list of what we tell ourselves about our mate. In talking to others, are we more likely to insult or lift up ur mate? Do you predict that your mate will let you down? Do you feel the need to correct or control what your mate says and does? Are you afraid your mate will embarrass you? Do you keep a list of your mate's flaws and failures from the past? What do you say when you are angry at your mate? Is that what you really believe?\nAfter coming to a clear understanding of your attitude about your mate, I would suggest taking that to Jesus in prayer seeking His forgiveness and help in changing.\nThe next step is to re-inspect your mate. This time, look for his/her strengths, successes, talents, gifts, and accomplishments. Think about how he/she is a blessing to you. Think about how he/she is a blessing to your children, grandchildren, and others. Spend some time thinking about the hole that would be left in your life if he/she suddenly died. Determine to spend your time looking at those things and be thankful for your mate rather than spending your time looking for faults to criticize and remembering things that disappointed you.\nThe next step might be the hardest. I would suggest that you confess your terrible attitude to your mate, apologize, and ask for forgiveness. Then, begin to share the list of things you appreciate with your mate. Watch the healing begin.\nBecause old habits die hard and new habits take about a month to get established, I would suggest that you spend some time everyday reviewing the list of blessings your mate brings to you. Think of meaningful ways to share your appreciation with your mate. When tempted to become critical, remember to resist and encourage instead! God has a plan to bless you through your mate... don't allow fault finding to ruin it!\nPastor Sam Elliot, an ordained Assemblies of God minister, successfully built a church plant from twelve members to three-hundred with many community outreach programs, events and a thriving Master's Commission program in South Carolina before heeding God's call in 2014 to plant a church in New Orleans. After two years of preparation Pastor Elliot will officially launch Real Life Church in January 2016. He \"envision[s] meeting people in an open, honest recognition of where their real life is and leading them into real, abundant life in Christ.\" He is the author of I Still Do: A guide for the Marriage Journey, a sixteen week devotional study guide.",
    "source_domain": "blog.nola.com",
    "title": "Magnifying Glass or Mirror?",
    "title_page": null,
    "title_rss": null,
    "url": "http://blog.nola.com/faith/2018/02/magnifying_glass_or_mirror_1.html"
}