{
    "authors": [
        "Teena L Myers"
    ],
    "date_download": "2018-05-30 16:41:18+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 11:10:21",
    "description": null,
    "filename": "http%3A%2F%2Fblog.nola.com%2Ffaith%2F2018%2F05%2Fno_camping_for_me.html.json",
    "image_url": "https://image.nola.com/home/nola-media/width620/img/faith/photo/13048237-standard.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Guest Blogger\nPastor Waylon Bailey\nBefore I was an older teenager, I camped out quite a bit. It all started with my family going on a camping trip with my best friend's family. Imagine four adults and four boys on a camping trip in one station wagon!\nI also did a lot of hiking and camping with my Boy Scout troop. It was always exciting and always an adventure.\nEven as an adult, a camping trip seemed like the most wonderful thing I could imagine. Anna and I hiked in and out of the Grand Canyon for her senior trip. We spent two nights in bunk houses on the banks of the Colorado River and a third night camping under the stars (no tent). We didn't freeze to death, but we felt that we would.\nIn all of those experiences there was excitement, and there was an element of being absolutely miserable. We were wet, cold, hot, and everything else that you could make you extremely uncomfortable.\nI couldn't help but think about that not long ago when I read again Paul's letter to the church at Corinth. He talked about the blessings awaiting us in heaven with our heavenly father.\nHe put it this way: \"For we know that if the earthly tent we live in is destroyed, we have a building from God, a house not made with hands, eternal in the heavens.\" (2 Corinthians 5:1).\nWhat an amazing contrast! While you might want to take a night or two on a camping trip, who would want to live forever in a tent?\nDo you see the contrast? In this life we live in a tent. When we are with the Father, we will be in an eternal house He has prepared for us (John 14: 1-6).\nThe light, momentary affliction of these days is nothing compared to the eternal weight of glory beyond all measure which our Heavenly Father is preparing for us (2 Corinthians 4:17).\nJames Denison reminded me that it is no longer cool do think about eternity. We all know that is true. Does anyone talk with you about heaven or where they will spend eternity?\nHe also said that the time will come when nothing other than eternity will matter.\nIsn't it time for you to think about the implications of all this for your life?",
    "source_domain": "blog.nola.com",
    "title": "No Camping for Me!",
    "title_page": null,
    "title_rss": null,
    "url": "http://blog.nola.com/faith/2018/05/no_camping_for_me.html"
}