{
    "authors": [
        "Teena L Myers"
    ],
    "date_download": "2018-02-03 14:34:10+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 12:25:45",
    "description": null,
    "filename": "http%3A%2F%2Fblog.nola.com%2Ffaith%2F2018%2F02%2Fbe_careful_with_anger_1.html.json",
    "image_url": "http://image.nola.com/home/nola-media/width620/img/faith/photo/18399777-standard.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "By Guest Blogger Sam Elliot\nThis week, I want to encourage you to get serious about taking control of how you handle anger. Anger is a normal emotional response. God gets angry. Jesus got angry. There is nothing wrong with anger, however we are responsible for what we do with our anger. Anger is like dynamite. If used properly, it can make the work of removing rock to build roads much easier. However, if used carelessly, it can be a terrible source of destruction. Anger can motivate a person to fight against injustice to pursue what's right. However, anger can ruin a marriage, wound children, and wreck a person's life. In life, we will experience anger. It is important for us to learn to control how we express it. I thought I would start the discussion by confessing to you that I have had to do a lot of work to deal with this myself. In fact, God has helped me more in this area than I can describe. I am so thankful because anger could have surely ruined my life and destroyed everything I love. My journey began when I was 18. I was about to be married to the young woman of my dreams and didn't want anything to mess it up. One day, after a rain, I got our farm truck stuck in the mud. This was always a terrible interruption in the day. I walked a half a mile to the tractor shed and after a lot of trouble cranked the old tractor and drove it to the site of the disabled truck. I hooked the cable to the truck and got ready to pull it out. I was beginning to feel relieved to finally be able to continue my day. Then, the tractor cut off. The battery was dead and I didn't have any way to start it without another long walk. I was angry at myself for letting the tractor cut off. I was angry for getting stuck in the mud. I was angry that I didn't have help. I was boiling inside. I grabbed some tools and sent them flying. Then, I grabbed a long steel pryer and bounced it off the tractor tire. as it was flying back from the tire, I saw my dream girl coming around the curve. She had been looking for me. She wanted to help me so we could be together. I had always justified those outbursts until then. I wondered if she would change her mind about marrying someone who could act so crazy over something so insignificant. She understood and married me anyway, but I knew I had to find a way to deal with anger in an appropriate way. i wish I could tell you that this was a one time decision with instantaneous results, but it is a long process filled with successes and failures and starting over. God's word is filled with wisdom and guidance about this issue. Is anger contaminating your marriage? If so, I hope you will decide today to get this under control before you lose your marriage. The first step is to confess it to God and seek His forgiveness and help. Proverbs 25:28 Whoever has no rule over his own spirit is like a city broken down with no walls. One of the driving factors in my journey has been the weight of God's opinion about the misuse of anger. Galatians 5:19 tells us that outbursts of rage are one of the defining fruits of a person who is walking in the flesh. This is grouped in with things like adultery, fornication, drunkenness, and witchcraft. This passage tells us that these behaviors war against our ability to walk in the Spirit. Then, it furthermore tells us that people who have a lifestyle marked by such behaviors will not inherit the kingdom of Heaven. Don't believe it? Read Galatians 5:16-21 for yourself. When I read this, I realized that it was crucial for me to revoke the permission I had given to myself to have outbursts of rage. I want to walk in the spirit, not the flesh and so anger must be harnessed and controlled. In addition, Col.3:8 tells us to put off all angry outbursts. In this passage, we are again told that angry outbursts and rage are qualities of someone who is not a follower of Jesus. Then, we are commanded to put these behaviors, along with others to death. Angry outbursts and rage should not be a part of our lifestyle as followers of Jesus. James 1 tells us that we should be slow to speak, quick to listen, and slow to become angry. Then, this passage goes on to tell us that the anger of man does not bring about the righteous life God desires for us. Many times, people feel that if we explode in anger on our mate with hurtful words, profanity, threats and even violence that he/she will finally hear us and our point will be clearly made and finally we will get what we want in the relationship. However, the truth is that this solution does great harm to the relationship and does not bring about what's right for us. Are you known as a person who has an explosive temper? Have you given yourself permission to protect yourself and get what you want through rants of rage? If so, God wants you to decide to put that part of your fleshly self to death and start walking in the spirit. I hope you will start today! In my journey to deal with anger in a way that is not sinful, I came face to face with the scriptures that made it clear that raging behavior and following Christ do not go together. Then, I encountered another set of scriptural commands that addressed this issue on another level. You see, the Bible makes it clear that anyone who gives full vent to his/her anger is a fool whose life will be filled with trouble because of their refusal to control anger. I thought it would be helpful too share some of those with you: Proverbs 12:16- \" A fool's wrath is known at once, but a prudent man covers shame\". In other words, a fool bursts out in anger like a knee-jerk reaction, but a wise person stays calm to consider how to handle situations. Proverbs 14:17 \"A quick tempered man acts foolishly\". Proverbs 19:19 \" A man of great wrath will suffer punishment;if you rescue him, you will have to do it again\" Proverbs 22:24 - \" Make no friendship with an angry man, and do not go with a furious man\". There are more, but these passages made it clear to me that until I got my temper under control, I was going to be a fool in God's eyes who would live a life of suffering the painful consequences of my out of control anger. But, worst of all, God was warning people to stay away from me because of this issue. Then I read Proverbs 16:32, \" He who is slow to anger is better than the mighty, And he who rules his spirit is better than he who takes a city\". Here is the great choice. How we handle anger will either take us down the painful path of fools or take us down the road of greatness. I made a decision to change many years ago and God has been helping me greatly. If you have the same choice before you, He will help you too. Why not start today! Ephesians 4:26 tells us, ' Be angry and do not sin, do not let the sun go down on your wrath, nor give place to the devil\". Let's make a few observations. First of all, anger is an emotional response that is neither righteous nor sinful. It becomes righteous or sinful depending on how we express it. Jesus expressed anger over the blatant disrespect for God in the temple. God expresses anger over evil. Anger can be a fuel to motivate us to take a passionate stand against wrongdoing. That is the righteous use of anger. However, when we use anger to send us into fits of harmful, outrageous behavior it becomes sin. Secondly, this passage makes it clear that we have the power to choose how we will express the anger that we feel. Rage-aholics insist that they just can't help it. In fact, they blame their terrible behavior on the actions or words of others. They think of themselves as victims of the behavior of others. However, that is not true. Each of us have the power of choice. We are responsible for our words and actions. Thirdly, this passage makes it clear that we should not harbor anger and offenses overnight let alone longer. This applies to our relationships with all others, but especially applies to our interactions with our mate. It is crucial to resolve conflicts quickly to restore peace and unity to the relationship. Finally, this passage makes it clear that when we hold onto anger and stubbornly refuse to forgive, we open a door for the devil to cause trouble for us. So, in my journey to get anger under control, I learned from God that fits of anger and rage are unacceptable behaviors for one who has chosen to follow Jesus. I discovered that these fits of anger are indicators of spiritual rebellion. Fits of rage demonstrate that one is living according to the fleshly nature rather than being led by the Holy Spirit. I also learned that God says that those who give full vent to their anger are fools whose lives will be filled with painful consequences. To top it off, the Bible tells us that allowing myself to throw fits of rage opens the door for the devil to create even more havoc in my life. I decided to deal with it and stop making excuses... Do you need to do the same thing? if so, Now is the time! If God has spoken to you about getting anger under control, congratulations! This means God is inviting you to draw closer to Him and take a step closer to spiritual maturity. As I shared on Monday, God led me to this decision when I was 18 years old and He has done a lot in my life in this area. He will do the same for you! There are some things you need to bring to this process, however so i want to share a few with you. First of all, you have to change your attitude toward how you deal with anger. Throwing fits of rage with yelling, screaming, profanity, threats, and violence can no longer be acceptable to you. That includes the quieter versions also like the silent treatment, the cold shoulder, and planning for revenge. To get anger under control, you have to agree with God that all of this is out of bounds and totally unacceptable. Second, you have to stop blaming others for your outbursts. Each of us is responsible for our actions and we have the power to control how we express anger. As long as we tell ourselves that we can't help it, we will continue to fail in this area. Third, we need to see fits of rage as sin and go to the Father to receive forgiveness when we fail. We need to ask God to help us find freedom from the flesh so we can walk in the spirit. Finally, we need to remember that this will be a process. It probably won't happen in an instant. It will be a trail filled with tests that produce success and failures. When we experience a success, it is important to acknowledge the growth and give thanks and praise to God for the work He is doing in us. When we fail, we need to humble ourselves before God and ask for forgiveness. We need to apologize to the people we hurt. Then, we need to renew our commitment to be free and simply start over. The main thing is to never give up. The foolishness of giving full vent to anger comes with an unbelievably high price tag. Allow anger to fuel passion to do what's right not to harm others. You can read this full article on my blog at nolarerallife.org. Before we go, I want to remind you about I Still Do, A Guide for the Marriage Journey. This devotional style book was created to strengthen your marriage. Each daily devotional is filled with Biblical principles, thought provoking questions, and practical suggestions. Order yours today at nolareallife.org or I Still Do on Facebook.\nPastor Sam Elliot, an ordained Assemblies of God minister, successfully built a church plant from twelve members to three-hundred with many community outreach programs, events and a thriving Master's Commission program in South Carolina before heeding God's call in 2014 to plant a church in New Orleans. After two years of preparation Pastor Elliot will officially launch Real Life Church in January 2016. He \"envision[s] meeting people in an open, honest recognition of where their real life is and leading them into real, abundant life in Christ.\" He is the author of I Still Do: A guide for the Marriage Journey, a sixteen week devotional study guide.",
    "source_domain": "blog.nola.com",
    "title": "Be Careful With Anger",
    "title_page": null,
    "title_rss": null,
    "url": "http://blog.nola.com/faith/2018/02/be_careful_with_anger_1.html"
}