{
    "authors": [
        "Victoria A. Zimmer",
        "Sarah Ferguson"
    ],
    "date_download": "2017-10-06 21:14:07+00:00",
    "date_modify": null,
    "date_publish": "2017-10-04 21:44:29",
    "description": "2017 All Catholic Boys Golf Championships Monsignor Martin High School Athletic Association October 9, 2017 Tan Tara golf club, North Tonawanda, New York",
    "filename": "http%3A%2F%2Fbuffalogolfer.com%2Fwordpress%2Fpress-release-2017-monsignor-martin-boys-golf-championship%2F.json",
    "image_url": "https://i1.wp.com/buffalogolfer.com/wordpress/wp-content/uploads/2012/08/mogolf-artsy.jpg?fit=16%2C32",
    "language": "en",
    "localpath": null,
    "maintext": "2017 All Catholic Boys Golf Championships Monsignor Martin High School Athletic Association\nDate Monday, October 9, 2017\nSite Tan Tara golf club, North Tonawanda, New York\nStructure 18 holes medal play for team championships\nShotgun Start 9 am over entire golf course\nDivision A-Low 5 of 6 scores per team will count toward team total\nDivision B-Low 4 of 6 scores per team will count toward team total\n18 holes of medal play for individual championship and New York State Catholic High School athletic association (NYSCHSAA) state qualifier.\nThe low, 18-hole scores(s) will be recognized as individual champion(s). No playoff will be held in the case of multiple champions. The low six scores and ties will be recognized as members of the All-Catholic team.\nThe Course Hole 1: 175 yards Hole 2: 531 yards Hole 3: 500 yards Hole 4: 422 yards\nHole 5: 345 yards Hole 6: 393 yards Hole 7: 409 yards Hole 8: 382 yards\nHole 9: 142 yards Front Nine Total: 3299 yards\nHole 10: 126 yards Hole 11: 539 yards Hole 12: 407 yards Hole 13: 504 yards\nHole 14: 333 yards Hole 15: 302 yards Hole 16: 364 yards Hole 17: 355 yards\nHole 18: 160 yards Back Nine Total: 3090 yards Course Total: 6389 yards\nSpectators Spectators will not be allowed on the golf course during play. They may watch from the clubhouse and surrounds, which afford views of the 1st and 10th tees, and the 9th and 18th greens.\nRegular Season Highlights\nDivision A Team Champion TBD\nDivision B Team Champion St. Mary’s of Lancaster\nLow 9-hole individual score Dylan Angelo (St. Joseph’s), 33 at Cazenovia Park\nLow 9-hole team score Canisius High School, 191 at Cazenovia Park\nLow 9-hole Average, Division A Dylan Angelo (St. Joseph’s) 38\nLow 9-hole Average, Division B Seiki Kawahara (Cardinal O’Hara) 39.7\n64 Qualified Golfers\nBishop Timon-St. Jude (Buffalo)\nRyan Sheehan Fergus Gould Matt Fahey Chris Fisher Matt Pilski Brendan Gavin Leo Camiloni Cian Gould Pat Scherer\nCanisius (Buffalo)\nMatt Jackson Matt Maouad Will Scherrer John Rehak Noah Braun Mike Beecher Jack Coyne Ryan Coyne John Rooney\nCardinal O’Hara (Tonawanda)\nZack Doell Seiki Kawahara Alex Kubuniec\nChristian Central (Williamsville)\nAlex Fink\nGow School (South Wales)\nZach Schectman Ben Fach Zach Eatroff Phil Davis\nNichols School (Buffalo)\nCavin Derrigan Anthony Tuber Gabe Schulefand Jack Stephen Jack Schlehr Andrew Darby Ashrut Sood Owen Daniels Carson Kania\nPark School (Amherst)\nJames Ellegate Shea Warren Alex Shop Noah Hutchins\nSt. Francis (Athol Springs)\nMike Donner Jack Haxton MIke Tomczak Noah Unger Nikko Lazzara Scott Emmerling Zach Plecas Ian Aigner\nSt. Joseph’s (Kenmore)\nDylan Angelo Shane Broad Connor MacDonald John Lomeo Will Ritchie Paul Dinicolantonio Max Lin Trey Perry\nSt. Mary’s (Lancaster)\nAlex Bellet Brady O’Brien Peter Duane Sam Dantonio Santo Lima Jared Mangan Cole Laskowski\nShare this: Twitter\nFacebook\nGoogle\nTumblr\nLinkedIn\nPinterest",
    "source_domain": "buffalogolfer.com",
    "title": "Press Release: 2017 Monsignor Martin Boy's Golf Championship",
    "title_page": null,
    "title_rss": null,
    "url": "http://buffalogolfer.com/wordpress/press-release-2017-monsignor-martin-boys-golf-championship/"
}