{
    "authors": [],
    "date_download": "2017-08-14 10:07:52+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 09:50:05",
    "description": "RAPISTS marrying their victims now seems to be an accepted cultural practice in Malaysia.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F08%2Frapists-marrying-victims-becoming-accepted-practice-malaysia%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/08/shutterstock_517770577.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two years ago, Riduan Masmud was charged of raping a 12 year old girl and to avoid prosecution, he took her as his wife. Image depicts a traditional Malay wedding ceremony. Source: Shutterstock\nRAPISTS marrying their victims now seems to be an acceptable cultural practice in Malaysia.\nTwo years ago, Riduan Masmud was charged of raping a 12 year old girl and to avoid prosecution, he took her as his wife. Utterly ridiculous.\nRiduan was eventually convicted and jailed for actually trying to bribe the girls father with RM10,000 (US$2330). At the time of the crime, which was in 2013, he was married with four children. The victim became his second wife.\nLast week, Rohani Abdul Karim, Malaysia’s Minister for Women, Family and Community Development, said that the now 16-year-old victim is healthy and doing fine while her rapist husband is serving his time in jail. In fact, she even paid him a visit once.\nSEE ALSO: Malaysia: Girl who married rapist is ‘fine’ – women’s minister\nNevermind that the girl hasn’t been to school since the incident because she feels too ashamed of what had happened. Nevermind that she says she intends to work to support herself although without finishing school, that opportunity will be bleak.\nNevermind all that because the minister who is supposed to be in charge and responsible of protecting the interests of women and families in Malaysia has said that she is doing fine and healthy. Utterly ridiculous.\nI think Malaysians really need to reflect and think about what is right and wrong when it comes to rape. The fact that a rape victim can ‘take responsibility’ for his actions by marrying his victim is clearly wrong, and worst is that it is so entrenched in the Malaysian system.\nAnd you know something is so entrenched in our society when it enters into our popular culture. In the last month, I have watched no less than three mainstream Malaysian movies in the cinema that treated rape very disturbingly.\nThe three movies are Kau Yang Satu, Minah Moto and Pencuri Hati Mr Cinderella. The first was directed by Osman Ali and the other two were directed Ahmad Idham Nazri. Yes, the movies were all written and directed by men.\nKau Yang Satu tells of a couple who were married through the arrangement of their fathers. One particular scene shows the husband raping the wife in order to ‘teach her a lesson’. She gets upset but eventually forgives him because he charms her by teaching her how to tie a neck tie!\nhttps://youtu.be/BHf7BYweDR4 Video can’t be loaded: The Fat Bidin Film Club (Ep 110) – Kau Yang Satu (https://youtu.be/BHf7BYweDR4)\nMinah Moto is a story about a group of women who likes to race motorcycles and one of them gets involved with male racers. She eventually gets raped but the scene is presented so comically and with such disrespect that you wonder what the director, Ahmad Idham, thinks of rape.\nhttps://youtu.be/CjMNMgZ39aA Video can’t be loaded: The Fat Bidin Film Club (Ep 104) – Minah Moto (https://youtu.be/CjMNMgZ39aA)\nNow the same director, in the film Pencuri Hati Mr Cinderalla, tells a story of a 45-year-old man who falls in love with a girl 20 years younger than him. She gets raped by his best friend’s son and they all converge in the best friend’s house to confront the son.\nThe sons apologises to him and to his father without ever acknowledging the girl he raped, who is sitting right next to him, and says that he will do the honourable thing and marry her. He said that he made this decision because his father had raised him to be a responsible person.\nSEE ALSO: M’sian MP derided for backing child marriage, saying rapists can wed victims\nSeveral months ago in April, Shabudin Yahaya, a Malaysian member of Parliament from the northern state of Penang, made a statement in Parliament that there is nothing wrong for a rapist to marry his victim because girls as young as nine years old were ready for marriage.\nHe even said that some young girls can appear physically older than their age. He elaborated that “some children aged 12 or 15, their bodies are like 18-year-old women”. I am going to say it again: utterly ridiculous.\nWhere is this thinking coming from? This is a very worrying culture that is developing in Malaysia and I hope that our society starts to realise it. But it sure doesn’t look that way. With all that is going on, I am at a lost for words if people were to ask for a solution to the problem.\n** This is the personal opinion of the writer and does not reflect the views of Asian Correspondent",
    "source_domain": "asiancorrespondent.com",
    "title": "Rapists marrying their victims is becoming an accepted practice in Malaysia",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/08/rapists-marrying-victims-becoming-accepted-practice-malaysia/"
}