{
    "authors": [],
    "date_download": "2017-08-15 01:20:56+00:00",
    "date_modify": null,
    "date_publish": "2017-08-20 00:00:00",
    "description": "“WE WON’T declare war, we just ask to get our land back,” said Cambodian Prime Minister Hun Sen last Friday, providing a window of six days for Lao troops he accused on encroaching on the kingdom’s territory to leave. The very next day, they did.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F08%2Fasean-50-region-marches-towards-peace-development-away-human-rights%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/08/2017-08-08T021837Z_1459864647_RC110A967A10_RTRMADP_3_ASEAN-PHILIPPINES-VIETNAM.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Honour guards march past the Association of Southeast Asian Nations (ASEAN) flag and Vietnamese flag in the background, after a flag raising ceremony to mark the 45th anniversary of the regional group at Vietnam's Ministry of Foreign Affairs in Hanoi, Vietnam August 8, 2017. Source: Reuters/Kham\n“WE WON’T declare war, we just ask to get our land back,” said Cambodian Prime Minister Hun Sen last Friday, providing a window of six days for Lao troops he accused on encroaching on the kingdom’s territory to leave. The very next day, they did.\nFifty years ago, prior to the establishment of the Association of Southeast Asian Nations (Asean), this kind of chest beating may well have sparked a full-scale war between Cambodia and its neighbours.\n“The likelihood of member-states resorting to war or the threat of war to resolve disputes among each other has been reduced to virtually zero,” said A. Ibrahim Almuttaqi, Head of the Asean Studies Program at Jakarta-based thinktank the Habibie Centre.\n“This is a far cry from the uncertain and distrustful situation that the region was in prior to 1967.”\nSEE ALSO: Asean Literary Festival celebrates art, free speech and 50 years of regional cooperation\nEven border clashes between Cambodia and Thailand between 2008 and 2011 which cost dozens of lives on either side fizzled out after the International Court of Justice ordered both militaries to withdraw from the disputed areas, with Asean representatives appointed to observe the ceasefire.\nFormed under American influence at a time when the region was synonymous with war, poverty and political instability, the “Asean way” of consensus building and intransigent non-interference has undoubtedly been a significant contributor to peace and economic development in Southeast Asia.\nNevertheless, Asean’s performance in promoting human rights and democracy has been lacklustre.\n“Leaders should seize upon this milestone to redouble their efforts to promote real change,” said Cambodian lawmaker Mu Sochua of the Asean Parliamentarians for Human Rights (APHR) group in a statement last week.\n“Asean consistently emphasises its ‘people-centered’ nature, but existing mechanisms and commitments are devoid of popular buy-in. They require fundamental restructuring if they are to succeed at their stated aims.”\nBangkok Declaration\n“Sports-shirt diplomacy” is how Time magazine described negotiations among the foreign ministers of five Southeast Asian countries at a resort in southern Thailand during August 1967.\nWhile the meeting was accompanied by “days of golf and conviviality,” the subsequent Bangkok Declaration was a hard-fought achievement: a document defined by regional cooperation to promote peace and stability through upholding the rule of law and principles of the UN Charter.\nSomewhat remarkably, the signing took place on 8 August 1967 – almost exactly a year after the cessation of violent conflict between Indonesia and Malaysia which had lasted from 1963 to 1966.\nAsean’s Declaration was founded on the principles of cooperation, amity and, importantly, non-interference. It prioritised accelerating “economic growth, social progress and cultural development” in “the spirit of equality and partnership.”\nSEE ALSO: Taming a ‘giant’: Expert says Asean must flex muscles to rein in China\nThe United States had pushed for Asean’s creation, while China criticised the regional organisation as another imperial project of the west. But last week, both warmly congratulated the regional bloc.\n“[We] look forward to continuing our partnership and friendship with the people and governments of Southeast Asia and the Asean Secretariat to advance peace, stability, and prosperity for all,” said a statement from US Secretary of State Rex Tillerson on Asean Day.\n“Our partnership is growing as we address shared challenges such as terrorism, trafficking in persons, and maritime security.”\nChinese President Xi Jinping personally congratulated Asean and almost identically echoed Tillerson’s sentiments, praising the bloc as a force for “regional peace, stability and prosperity.”\n“China is willing to continue sticking to the principles of amity, sincerity, mutual benefit and inclusiveness,” said state media outlet Xinhua.\nPeace and stability\n“The major achievement of Asean over the past 50 years has undoubtedly been the decades of peace that the region has enjoyed,” said Almuttaqi.\nWhile most of the Asean states have battled internal insurgencies of the communist, Islamist or separatist variety – seen most recently in Marawi City in the Philippines – none have gone to war with each other since the 1980s.\nCouched between the rival giants of China and India, the bloc is also proving more and more important for Asian and global security – not least via its annual Regional Forum.\nLast weekend in Manila, Asean released a joint communique calling for non-militarisation and self-restraint in the South China Sea, raising concern regarding Beijing’s building of artificial islands in the contested waters. It was more confidently worded than many expected.\nWith four of its members – Philippines, Malaysia, Vietnam and Brunei – claiming maritime territory in the South China Sea, the bloc succeeded in releasing a framework for a code of conduct with China that will facilitate its conclusion on a mutually agreed timeline.\nMoreover, Asean presented a united front in calling for denuclearisation on the Korean peninsula.\nSEE ALSO: Asean adopts South China Sea framework, urges peace in Korean Peninsula\nA Nobel Peace Prize for Asean is “long overdue” thinks Kishore Mahbubani, Dean of the Lee Kuan Yew School of Public Policy of the National University of Singapore.\n“They have taken the most diverse region on planet earth and delivered peace,” he said recently, “at a time when the world is becoming more and more pessimistic.”\nAsean is home to about 250 million Muslims, 150 million Buddhists, 120 million Christians, 7 million Hindus and adherents of other faiths like Confucianism, Taoism and countless indigenous religions.\nIn his book The ASEAN Miracle: A Catalyst for Peace, Mahbubani argues that Asean’s diversity is a strength rather than a weakness, allowing the bloc to bring together the world’s great powers.\nNevertheless, the organisation’s stubborn policy of non-interference risks meaning Asean would be unable to intervene in a major humanitarian crisis, such as a major escalation in violence against the persecuted Rohingya Muslims in Burma.\n“Asean needs to adapt or risk becoming irrelevant in a rapidly evolving global environment,” said Malaysian parliamentarian Charles Santiago, who argued non-interference restricts its “ability to act decisively to address a host of other issues.”\nDevelopment and trade\nAustralia’s shadow spokesperson for foreign affairs Penny Wong last week praised Asean’s “immense contribution to Asia’s rise,” stating that it had “exceeded the expectations of its founders, and become even more critical both economically and in terms of regional security.”\nBouncing back from the 1997 Asian Financial Crisis which caused social and political upheaval across the region, Asean’s economic growth has been steady at 4.6 percent since 2014. By 2030, the Asean Economic Community is projected to become the world’s fourth largest economy.\nA Mackinsey study from 2014 showed that those living in extreme poverty in Asean had declined drastically over the previous decade. In 2000, 14 percent of Asean’s population was earning less than US$1.25 a day, a figure which had dropped to just 3 percent by 2013.\nAsean’s combined GDP, however, remains lower than the United Kingdom, Germany and Japan. Stark income inequalities between the region’s rich and poor poses a threat to long-term social and political stability.\nA 2014 report from the Asean-Canada Research Partnership found Asean’s economy was “characterised by increasing income inequality … increasingly poor governance and institutional quality.”\nSEE ALSO: Malaysian PM thinks Malay should be the language of Asean\nCambodian lawmaker Mu Sochua said last week, “if the majority of people are unable to enjoy the benefits brought by peace and economic growth, then our work is not done.”\n“Asean is home to over 600 million people but it is important to remember that not all of them live in Jakarta, Kuala Lumpur or Bangkok,” said Almuttaqi. “Asean needs to look at itself and ask what are they doing to help benefit these people.”\n“Leaders eager to cast aside human rights concerns as they pursue other priorities, like economic integration and combatting terrorism, are gaining strength from the poor examples they’re setting for one another,” added Teddy Baguilat from the Philippines House of Representatives.\nNevertheless, “it is difficult to see how ASEAN will be able to move away from the principle of non-interference as it is such a cornerstone of member-states’ interaction with one another,” said Almuttaqi.\nHuman rights\nIn praise of Asean’s achievement of peace, security and prosperity, Mahbubani points to the cooperation of Singapore’s Lee Kuan Yew, Indonesia’s Suharto, and Malaysia’s Mahathir Mohamad.\nIndeed, LKY oversaw the incredible transformation of Singapore from an uneducated nation with mass unemployment and no natural resources to one of the richest countries on the planet; while Suharto and Mahathir, for better or worse, shaped the modern incarnation of their nations.\nBut these three leaders have something in common: all are widely considered dictators who quashed any criticism and imposed an anti-democratic nation building agenda upon their countries.\nFamously, LKY rejected western criticism of repressive Singapore, claiming that professedly universal human rights principles were in fact liberal, Judeo-Christian constructs contradictory to “Asian values.”\nThis strongman tradition of dismissing human rights and international law continues today: not least through leaders like Rodrigo Duterte of the Philippines and the Thai junta’s Prayut Chan-o-cha.\nWhile the foreign affairs minister of the Philippines declared this week among Asean leaders that there could be “no compromise” on human rights, Duterte has famously threatened to kill human rights defenders and has said that Islamic State fighters can “forget human rights” protection.\nSEE ALSO: Philippines seeks to promote its war on drugs to Asean\nHe runs a government which by January 2017 had presided over the deaths of 7,000 Filipinos in a chaotic, lawless war on drugs. Duterte has declared martial law in the Mindanao region – a decision reminiscent of the Philippines’ pre-democratic past.\nWorryingly, Duterte’s brutal methods appear to be spreading to Indonesia. Just weeks ago, Jokowi ordered Indonesian police to shoot foreign drug traffickers on sight if they resisted arrest.\nDespite high hopes for the Indonesian president when he was elected in 2014, many have begun to fear a return to Suharto-era crackdowns on civil and political rights. The unprecedented banning of fundamentalist Islamic group Hizbut Tahrir under Jokowi is evidence of this.\n“Asean governments must embrace the universality of human rights and quit hiding behind so-called ‘Asian values’ as an excuse to avoid addressing difficult questions,” said Santiago.\nLong live Asean\nChallenges abound for Asean, which is wedged between China and India. For starters, its combined population in 2015 was the third largest in the world after these two regional hegemons.\nToday, the region is home to around 625 million people – almost ten percent of the world’s population – who all need to be fed, educated and put into work.\nThe next fifty years will be a test of whether Asean can continue to preserve peace in the region, lift its peoples out of poverty, and meet its professed commitment to “continue to promote and protect human rights and fundamental freedoms.”\nChina is aggressively pursuing influence in individual Southeast Asian states via its Belt and Road initiative while under Trump, the United States’ short-lived pivot to Asia has all but come to an end.\nVolatile and at times violent ethno-religious tensions threaten progress in both Indonesia and the fledgling democracy of Burma. Singapore and Malaysia’s illiberal, undemocratic polities cannot last forever, irrespective of material progress. The rule of law is gravely at risk in the Philippines.\nExecutive Director of La Trobe Asia Professor Nick Bisley wrote that “the organisation is famous for its love of process, with more than 1,000 meetings held every year – often with little to show for it.”\nBut in spite of the organisation’s enduring shortcomings, Almuttaqi remains optimistic that Asean will continue to “see the political, security, economic and socio-cultural aspirations of the region determined by the peoples of Southeast Asian themselves.”",
    "source_domain": "asiancorrespondent.com",
    "title": "Asean at 50: Region marches towards peace and development, away from human rights",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/08/asean-50-region-marches-towards-peace-development-away-human-rights/"
}