{
    "authors": [],
    "date_download": "2017-12-11 15:46:54+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 04:09:42",
    "description": "SEX is a primary need that every human being has, whether it is the straight and heterosexual kind or the queer kind, and because of that, sex work is considered one of the oldest professions on the planet.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F12%2Fsex-malaysia-legal-prostitution%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/12/shutterstock_770928235.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "24 Social Buzz\nSEX is a primary need that every human being has, whether it is the straight and heterosexual kind or the queer kind, and because of that, sex work is considered one of the oldest professions on the planet.\nRecently, the Malaysian Immigration Department uncovered cash of up almost RM15 million (US$3.6 million) in a house and a hotel in Kota Kinabalu, Sabah. It is believed the money is related to one of the country’s largest prostitution syndicates and also involves human trafficking.\nSoutheast Asia is infamous for its sex trade, mainly in countries such as Thailand, where it is tolerated by the government because of the revenue that it rakes in. Singapore is another country in the region that is related to the sex trade because it is actually legal.\nSEE ALSO: Malaysia’s underground student prostitution industry\nHowever, Malaysia is not a country that people around the world would associate with prostitution. Nevertheless, it would seem that Malaysia is fast rising as one of the main destinations for sex tourism in Southeast Asia.\nProstitution in Malaysia is illegal, but if you were to walk the streets of Kuala Lumpur, you will notice it is a thriving business with transactions happening on a very regular basis. In fact, aside from the major cities like Johor Bahru and Georgetown, Kota Bahru and Ipoh are also seeing a rise in these activities.\nThe problem with the sex trade in Malaysia, if we observe investigations by the authorities is the fact that it is involved in layers of illegal activities such as organised crime, human trafficking, money laundering and even violent crimes.\nBecause sex work is illegal in Malaysia, it is pushed underground. This makes the trade vulnerable to being exploited. Legalising it would guard those who are vulnerable to exploitation and abuse themselves: sex workers.\nI recently had a lengthy discussion with Sheril A. Bustaman, a volunteer with PT Foundation – a Malaysian NGO that works closely regarding issues of sexual health and sex workers. She argued prostitution is a legitimate industry if owned and controlled by sex workers themselves.\nIf prostitution was legal, it would solve a whole lot of problems. Take Singapore for example. When the government legalised prostitution, the industry became regulated and this meant the authorities created standard operating procedures that would ensure the well-being of the industry.\nBrothels and their workers had to be registered and be given permits to operate. This meant that the pimps had to ensure a fair and comfortable working environment for their staff. Sex workers are required to follow specific health procedures and are to be tested for sexually-transmitted diseases regularly.\nWhen the whole industry is regulated, it eliminates so many other actual undesirable crimes such as human trafficking. Money laundering would also be dealt with. The industry could also be taxed – meaning the government can collect revenue from it.\nNow back to the issue of agency of the prostitutes themselves as mentioned earlier. It would be fair trade only if the prostitute had full control of his or her decisions in providing sexual acts for money. He or she should never have to be forced into it – only then it would be a fair trade.\nSEE ALSO: Why Kuala Lumpur could be on its way to becoming the sex capital of Asia\nAs it is, with the advent of technology and the Internet, some sex workers are already bypassing the organised crime system. These are the ones considered “freelance” and they use social media to connect with clients, avoiding exploitation from middlemen.\nI understand what I am proposing is something extremely radical for a conservative country like Malaysia, where speaking about sex itself is considered highly taboo. I am more than certain the legalisation of prostitution will never happen in my lifetime, and maybe not even in my children’s lifetime.\nBut I still strongly believe it is a worthy discussion. Think about it. We Malaysians don’t even have the decency to talk about sex education for our young people. Does it mean if we don’t acknowledge prostitution, then it actually doesn’t happen in the country? We need to wise up.",
    "source_domain": "asiancorrespondent.com",
    "title": "Why sex work should be legalised in Malaysia",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/12/sex-malaysia-legal-prostitution/"
}