{
    "authors": [],
    "date_download": "2018-04-25 02:09:00+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 09:00:26",
    "description": "THERE has been a sudden rise in the number of Twitter accounts in Southeast and East Asia. Many news outlets have reported on the phenomenon after Maya Gilliss-Chapman, a Silicon Valley based Cambodian tech noticed something odd with her account earlier this month.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F04%2Fbotmaggedon-hits-se-asian-twitter-ahead-of-regional-elections%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/04/shutterstock_154181867.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "THERE has been a sudden rise in the number of Twitter accounts in Southeast and East Asia. Many news outlets have reported on the phenomenon after Maya Gilliss-Chapman, a Silicon Valley based Cambodian tech noticed something odd with her account earlier this month.\nChapman said she gained 1,000 new followers since March – which prompted her to review the accounts. She found that they were new accounts, all of them, with barely any personal characteristics like a photo or a real name, and little to no activity on the platform.\nHer fears were soon echoed by other prominent Twitter users in other parts of the region, in Thailand, Vietnam, Burma (Myanmar), Taiwan, Hong Kong, Sri Lanka – and even Indonesia. The phenomenon is now being referred to as “botmageddon”.\nSEE ALSO: Zuckerberg says Facebook will work harder to block hate speech in Burma\nSince elections are due in Cambodia, Malaysia, Thailand and Indonesia over the next two years, many are alarmed.\nThe parasite Twitterbot army is multiplying. pic.twitter.com/FbOL8jeDxD — Ben Paviour (@BPaves) April 10, 2018\nIs there really a hidden agenda?\nTo Twitter, the issue of fake users is extremely sensitive. The company’s main selling point is its number of active users, roughly 330 million – of which, in 2014, the company said only up to 8.5 percent are bots in a report to the US Securities and Exchange Commission.\nIn response to questions raised by users about the recent rise of bots in the area, the company told local media houses that engineers were looking into the accounts in question and will take action against any account found to be in violation of the Twitter Rules.\nHowever, its spokespersons insist that the new users are organic.\nAll said and done, there is enough proof that activity on Twitter seems to be rising and more people are convinced that there’s a hidden agenda – a political one no less.\nWith the 14th general election in Malaysia approaching (polling day falls on May 9), its citizens demand action. Reports of how fake accounts are tweeting in support of candidates in the country are surfacing as well.\nSEE ALSO: ‘Irregularities’ in electoral process deprive Malaysians of free and fair elections\nHowever, the Malaysian Communications and Multimedia Commission (MCMC) has said that it will look into the activity of these accounts.\nSocial media experts are convinced that “action” by anyone other than Twitter authorities won’t make much of a difference, and that the company needs to be made accountable for the activity on their platform – the creation, management, and authentication of users included.\nIf regulators in the region fail to get them to take appropriate action, maybe a US congressional hearing will.\nAccording to a recent article on Bloomberg, US Senate Judiciary Chairman Chuck Grassley – who originally sought to schedule all three major social media company CEOs before Zuckerberg became the focus of the inquiries – said this week he may seek testimony from Pichai and Twitter Inc.’s Jack Dorsey.\nHe sent them letters the day of the Zuckerberg hearing asking about their data privacy practices and actions to counter foreign interference in US elections. He told them he wanted answers by April 25. The bottom line is, the fears of netizens in Southeast and East Asia aren’t baseless.\nSEE ALSO: 3 world conflicts Facebook has been blamed for this year",
    "source_domain": "asiancorrespondent.com",
    "title": "#Botmaggedon hits SE Asian Twitter ahead of regional elections",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/04/botmaggedon-hits-se-asian-twitter-ahead-of-regional-elections/"
}