{
    "authors": [],
    "date_download": "2017-12-11 15:46:57+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 01:00:25",
    "description": "MALAYSIA’s defence minister has announced the Muslim-majority Southeast Asian nation is “ready” to respond if required in regards to US President Donald Trump’s decision to recognise Jerusalem as the capital city of Israel.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F12%2Fjerusalem-malaysia-army-ready%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/12/shutterstock_581814427.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "108 Social Buzz\nMALAYSIA’s defence minister has announced the Muslim-majority Southeast Asian nation is “ready” to respond if required in regards to US President Donald Trump’s decision to recognise Jerusalem as the capital city of Israel.\n“As the defence minister, I am confident that we will carry out any order from the supreme commander of the Malaysian Armed Forces,” Hishammuddin Hussein was quoted as saying on Saturday by state news agency Bernama.\nTrump’s announcement last week that the US would be moving its embassy to Jerusalem was a “slap in the face for the entire Muslim world,” Hishammuddin said and added Malaysia “should be prepared to face any actuality”.\n“Armed Forces chief and the [Malaysian Armed Forces] are definitely ready,” he said at the final day of the ruling United Malays National Organisation’s (Umno) General Assembly.\nSEE ALSO: Protests erupt in Indonesia, Malaysia over Trump’s Jerusalem plan\nThousands of protesters took to the streets of Kuala Lumpur on Friday over the Trump administration’s decision. A statement from Malaysia’s Foreign Ministry said the country was “extremely concerned” with the announcement, which it said would increase the risk of terrorism.\nRecognising Jerusalem as the capital of Israel was “aggression not only against the Arab and Islamic Ummah, but are also infringements on the rights of Muslims and Christians alike,” it said.\nIn neighbouring Indonesia – the world’s largest Muslim-majority country – thousands again protested outside the US embassy in Jakarta on Sunday.\n“Let us pray that this dispute would not lead to chaos,” Hishammuddin said.",
    "source_domain": "asiancorrespondent.com",
    "title": "Malaysia says military ‘ready’ over Jerusalem issue",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/12/jerusalem-malaysia-army-ready/"
}