{
    "authors": [],
    "date_download": "2018-03-20 07:45:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "A British man arrested in Cambodia for producing pornography after photographing a party game was found guilty on Tuesday and sentenced to one year in jail.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F03%2Fcambodia-briton-jailed-for-pornographic-images-of-party-game%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/03/2018-03-20T074037Z_1416913090_RC196A8BEDD0_RTRMADP_3_CAMBODIA-UK-CRIME.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "British Daniel Richard Leeming Jones is escorted by the police during his trial, after he was found guilty of producing pornography, at the Siem Reap provincial Court, Cambodia March 20, 2018. Source: Reuters/Stringer\n22 Social Buzz\nA British man arrested in Cambodia for producing pornography after photographing a party game was found guilty on Tuesday and sentenced to one year in jail.\nJudge Um Chan Thol suspended ten months of the one-year sentence, ordering Daniel Jones to serve just one month and 22 days as his act of producing pornography “unintentional.”\n“The accused said he unintentionally produced pornography that affects Khmer culture,” the judge said while reading his verdict, referring to Cambodia.\nSEE ALSO: Tourists arrested in Cambodia for ‘pornographic’ dancing\nJones was arrested along with nine other foreigners on Jan 25 after police raided a social event for backpackers in Siem Reap, home to the ruins of famed Angkor Wat temple. The event was called “Pub Crawl or Let’s Get Wet.”\nOnly Jones, who has had denied producing pornography, faced trial as the charges against the other nine foreigners were dropped and they were deported.\n“There was no evidence against my client,” said his lawyer, Ouch Sopheaktra. “As a lawyer, I am not happy with this decision.”\nAuthorities said the group danced provocatively at a pool party and posted pictures of themselves dancing on social media.\nSEE ALSO: Asian locations dominate top spots on Unesco sites ranking\nFollowing the raid, Cambodian police released images online that appeared to show clothed and laughing tourists imitating sexual positions.\nCambodia is a conservative Buddhist country and has been clamping down on visitors posting revealing images of themselves at temple sites. Tourists showing cleavage or wearing skimpy clothes have been banned from the Angkor temple complex since August 2016.\nIn 2015, several tourists were arrested for taking naked photographs at the complex. They received suspended sentences and were expelled from Cambodia.\nAdditional reporting by Reuters",
    "source_domain": "asiancorrespondent.com",
    "title": "Briton jailed for 'pornographic' images of party game",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/03/cambodia-briton-jailed-for-pornographic-images-of-party-game/"
}