{
    "authors": [],
    "date_download": "2017-10-06 14:40:01+00:00",
    "date_modify": null,
    "date_publish": "2017-08-20 00:00:00",
    "description": "SECURITY and illegal drugs problem are hampering the southern Philippine island of Mindanao from leading the country to achieve food security, President Rodrigo Duterte said.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F10%2Fmindanao-duterte%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/08/2017-07-20T130909Z_1025027596_RC1EE0C21680_RTRMADP_3_PHILIPPINES-MILITANTS-DUTERTE.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Duterte inspects firearms together with Armed Forces of the Philippines Chief of Staff Eduardo Ano during his visit at the military camp in Marawi city, on July 20, 2017. Source: Malacanang Presidential Palace via Reuters\n17 Social Buzz\nSECURITY and illegal drugs problem are hampering the southern Philippine island of Mindanao from leading the country to achieve food security, President Rodrigo Duterte said.\nSpeaking yesterday at the opening ceremony of the 2017 AgriLink, FoodLink, and AquaLink Exhibitions 2017 at the World Trade Center in Metro Manila, the firebrand leader from Mindanao vowed to continue cracking the whip on terrorists and drug syndicates to realise Mindanao’s potential as the country’s “Land of Promise.”\nFertile lands, great climate and rich aquatic resources are Mindanao’s key attributes that would lead the Philippines towards food security, Duterte said.\n“The greatest promise of food security would really be Mindanao. (We are seldom hit) by typhoons there,” said Duterte, a long-time mayor of Davao City, one of the key urban centres in Mindanao, before he became the president in 2016.\nHowever, Duterte stressed the need to address the region’s decades-old problems on security, particularly terrorism, to fully develop the area’s agriculture potential.\nSEE ALSO: Philippines: US extends aid for Marawi recovery, deploys another plane to Mindanao\nVarious iterations of the Moro rebellion have wreaked havoc on the island with their protracted war waged against the government that claimed over 100,000 lives since the 1970s. Fighting for Muslim self-determination in Mindanao, the two key Muslim groups – the Moro National Liberation Front (MNLF) and the Moro Islamic Liberation Front (MILF) – have separately forged peace agreements with the government in 1996 and 2016, respectively. The MILF is a splinter of the MNLF.\nThe Abu Sayyaf Group has also long been a thorn in the government’s effort to develop Mindanao as a prosperous island. From a separatist group, the Abu Sayyaf has morphed into a criminal group engaged in kidnap-for-ransom to fund its operation. It has abducted and beheaded local and foreign nationals who allegedly failed to pay ransom money.\nMindanao in the past several decades has also seen the growth of the New People’s Army, the armed wing of the Communist Party of the Philippines. The communist rebels thrived in areas in Mindanao with mining and agribusiness operations.\nJust lately, Islamic State-inspired groups have reared their ugly heads in Mindanao, paramount being the Maute Group that laid siege on Marawi on May 23 that prompted Duterte to put the entire Mindanao island under martial law.\nSEE ALSO: Women and children fighting alongside Islamic State militants in Marawi\nHundreds of thousands of civilians have been displaced by the war in Marawi that continues to rage four months after the first gunfight between government forces and the Maute Group erupted.\nThe Maute Group resisted the military’s effort to arrest Abu Sayyaf leader Isnilon Hapilon, the designated Islamic State emir in Southeast Asia, which triggered the conflict.\nAt least 150 state forces have been killed in the clashes in Marawi and over 700 on the side of the terrorist gunmen, government data showed.\nDuterte vowed to rehabilitate Marawi, a good part of which is now in shambles owing to the exchange of gunfire and the aerial bombings and artillery strikes launched by the military.\nMarawi – the Philippines’ only Islamic city – hosts Lake Lanao, the biggest lake in Mindanao and the second largest lake in the country\n“Lake Lanao, if properly developed and utilised, would feed the nation,” Duterte said.\n“We have serious security problems (in Mindanao). And for as long as there is trouble, we cannot initiate programmes that would guarantee a good production for the year. There [are] so much terrorism and a lot of extortion going around.”\nThe Chief Executive also lamented that Mindanao has become a “hotbed of shabu” (methamphetamine) in the country, with some local politicians and terrorists getting involved in the illegal drug business.\nHe stressed illegal drugs fueled the ongoing rebellion in Marawi City.\nDuterte assured the people that the government’s war against the Maute terrorists “is nearing its end”, with the military claiming the main battle zone has been reduced to an area “the size of two football fields.”\n“Marawi is winding up. I hope that in the fullness of God’s time, Allah’s time, we’d be able to really talk peace. I’m willing to pour everything there. I promised them rehabilitation. They should not support the terrorists there,” he said.\nDuterte warned criminals, terrorists, and drug personalities anew not to threaten the future of young Filipinos, otherwise he would exhaust all efforts to go after them.\n“Do not do that to my country. I will never allow people to destroy my country, period,” he said.\nI am building my country. Do not make it hard for us.”\nMindanao produces 40 percent of the country’s food requirements and contributes more than 30 percent to the national food trade, the Food and Agriculture Organisation said.\nDuring the annual Mindanao Business Conference last month, Department of Agriculture Undersecretary Bernadette Romulo-Puyat assured the agency is continuously formulating programmes to develop the island’s agriculture and fisheries industry.\n“We have undertaken efforts to enrich the agriculture sector by extending production support, product development and marketing initiatives,” she said.\nDuterte guaranteed that the government would spearhead more programmes that would promote the welfare of the country’s agricultural workers not just in Mindanao but the rest of the country.\nSEE ALSO: Abducted Philippines ex-soldier beheaded by Abu Sayyaf\nTo increase yield in agriculture, the president said the government is providing climate resilient seed varieties and introducing better production and post-harvest technologies.\nDuterte stressed that better programmes should be enforced so the country would not depend so much on neighbouring nations for food sources.\nA net rice exporter more than two decades ago, the Philippines has been importing the commodity from neighbouring Asian countries to feed its rice-eating population owing to dwindling production.",
    "source_domain": "asiancorrespondent.com",
    "title": "Security, drug woes in Mindanao impede Philippine bid for food security - Duterte",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/10/mindanao-duterte/"
}