{
    "authors": [],
    "date_download": "2017-06-15 10:01:57+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "INDONESIA's economic spirits are rising judging by the line of women outside a packed Furla bag shop for a traditional midnight Ramadan sale at a Jakarta mall.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Flate-night-ramadan-shopping-shows-indonesias-economic-spirits-brightening%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-05-28T120154Z_1014255247_RC1B76AFAA50_RTRMADP_3_RELIGION-RAMADAN-INDONESIA.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "INDONESIA’s economic spirits are rising judging by the line of women outside a packed Furla bag shop for a traditional midnight Ramadan sale at a Jakarta mall.\nThe Muslim holy month, due to end in late June, is half over, and how much shopping Indonesians do during Ramadan is regarded as a reliable sign of the mood in an economy where private consumption accounts for 57 percent of gross domestic product.\n“I will be shopping more this year because I’ve just got a job,” said 24-year-old Dwi Kurnia Putri, before entering the shop at the Gandaria City Mall, in the south of the capital.\n“In the future, it looks like everything will turn out better … but it will depend on how well I manage my money,” joked Putri, who now works for an electricity company.\nThe central bank will hope that her optimism is infectious, as policymakers think consumer spending could lift economic growth closer to 5.3 percent this year, having dawdled at 5 percent or below in recent years.\n“We are confident … the next leg of economic growth will come from consumption,” Dody Budi Waluyo, head of the economic and monetary policy department at Bank Indonesia, told Reuters.\nLooking up\nThere are several signs that the outlook is brightening for Asia’s third largest consumer market and the world’s largest Muslim population.\nA survey by Bank Indonesia showed consumer confidence in May was at its highest since 2000.\nPrices for commodities vital to the Indonesian economy, have stabilised, as has the rupiah currency.\nLoan growth has topped 9 percent, and unemployment has fallen steadily. Export growth is expected to surpass 15 percent in May, boding well for the large workforce employed by that sector.\nSEE ALSO: 1 in 10 Indonesians supports an Islamic caliphate – survey\nCentral bank surveys also show companies have begun hiring more, and increasing their marketing budgets, while a sovereign credit rating upgrade awarded by Standard & Poor’s last month has encouraged firms to raise more debt.\nThe political mood in the capital, which accounts for a fifth of the archipelago nation’s economy, has also recovered, after a religiously-charged election campaign for the Jakarta governorship that saw a hardline Islamist movement lead mass protests against an incumbent Christian governor who went on to lose the vote.\nThe feel-good factor is evident in places far beyond the capital as well, with the BI survey showing the outlook among consumers has improved particularly in commodity-reliant regions such as Sumatra and Sulawesi, probably reflecting a recovery in prices for palm oil and coal.\n“The commodity crisis is kind of done … and the economy is showing a smart recovery, so I would expect that the growth rate in consumption to rise in the second half,” said Ali Potia, international consulting firm McKinsey’s Singapore-based leader for consumer practices in Southeast Asia.\n“The expectation in the retail sector is that this (Ramadan) is going to be busier than they’ve seen in a very long time.”\nBuying new clothes during Ramadan, and eating out to break fast with friends and family are part of Indonesian culture.\nWorkers in the big cities look forward to returning to their kampungs, or villages, laden with bags full of gifts for the family. If they go home with few presents for the Eid festival at the end of the fasting month, it would be a sign of hard times.\nVat revenues improving\nJakarta’s malls organise their sales on different weekends from each other, recognising that the city’s notoriously awful traffic makes it difficult for shoppers to get around.\nAnd, Stefanus Ridwan, the president director of PT Pakuwon Jati Tbk, a property company that operates Gandaria City mall, said the results of last Saturday’s midnight sale were “good” and the shopping centre was “more crowded”, compared to last year.\nSEE ALSO: 50 years on: Indonesia to host Asean literary festival in August\nPrivate consumption growth on a year-on-year basis has been 5 percent or less for every quarter during the past two years, lagging economic growth, and was only 4.9 percent in the first quarter of this year.\nBut, motorbike sales in May were up 15 percent, the highest growth since 2014, while April car sales showed growth running at 6 percent.\nCertainly, revenues from value-added tax have improved, Suahasil Nazara, head of the finance ministry’s fiscal policy office, told Reuters.\n“The other day I talked to retailers … and they feel that they started to sense the pick up began in May,” he said.\nWithout getting carried away, retailers reckon a recovery has begun.\nFetty Kwartati, corporate secretary of PT Mitra Adiperkasa , which oversees brands such as Zara and Starbucks, expects the company to show 13 percent sales growth this year, but she is “cautious” about the outlook.\n“The worst is over,” Kwartati said. – Reuters",
    "source_domain": "asiancorrespondent.com",
    "title": "Late night Ramadan shopping shows Indonesia's economic spirits brightening",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/late-night-ramadan-shopping-shows-indonesias-economic-spirits-brightening/"
}