{
    "authors": [],
    "date_download": "2018-04-24 19:18:53+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 00:00:00",
    "description": "AVIOPHOBIA is a common fear of flying experienced by over 20 million people, according to the National Institute of Mental Health. However, flying is statistically proven to be the safest mode of transport as there is only a one in 9,821 chance of dying from an air and space transport accident. But this doesn’t mean",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F04%2Fthe-5-most-dangerous-airports-in-the-asia-pacific%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/04/24340310861_10a52f7838_k.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "AVIOPHOBIA is a common fear of flying experienced by over 20 million people, according to the National Institute of Mental Health.\nHowever, flying is statistically proven to be the safest mode of transport as there is only a one in 9,821 chance of dying from an air and space transport accident.\nBut this doesn’t mean flying comes without its risks, especially if you’re heading into one of Asia’s most dangerous airports.\nSEE ALSO: 12-year-old Australian uses mum’s credit card to fly to Bali\nNepal: Lukla Airport\nIf you’re visiting Mount Everest, then you’ll probably be flying into this tiddly airport nestled between two mountains.\nLukla serves as one of the world’s highest airports and most treacherous, due to unpredictable weather conditions.\nThe airport doesn’t have runway lights or air traffic controllers, so pilots must put all their training into landing on this extra small strip.\nBuilt in 1964 under the supervision of Sir Edmund Hillary, the first man to stand atop of Mount Everest in 1953, the airport is patrolled by the Nepalese army and is in continuous use.\nAlthough this well-used airport has daily flights between Lukla and Katmandu, don’t expect to pick up your duty-free souvenirs here.\nBhutan: Paro Airport\nSitting high in the Himalayan mountains, this runway has such a dangerous reputation – only eight pilots worldwide are qualified to land on it.\nThe tiny village of Paro lies 2.4 kilometres above sea level between jutting mountain peaks, some as high as 18,000 feet.\nOne wrong move could mean clipping the roof of one of the many houses scattered on the mountainside as the plane descends.\nAs this is Bhutan’s only international airport, it’s estimated 30,000 people fly in and out of it every year for holidays in the “greenest nation on Earth”.\nThe runway is just 6,499-feet long, a lot shorter than the average needed to land a large commercial plane.\nThis challenge, coupled with the high winds ripping through the valley and often low visibility, make it possibly the most dangerous airport in the world.\nAntarctica\nTourism to Antarctica has increased by 10,000 visits over the past decade with most visitors coming from the US, China, and Australia.\nWhile many tourists travel via environmentally-unfriendly cruise ships, scientific expeditions often land on the continent via air travel.\nBut given the low demand for snazzy airports, there’s a serious lack of infrastructure for aircraft to land safely.\nMost “airports” are attached to research stations and spend most of their time covered in snow.\nEven Antarctica’s best international airport, Wilkins Aerodrome, must be significantly checked and safety-tested immediately before any aircraft land.\nHowever, you’ll be happy to know you can park your sled here for free, unlike other extorting airport carparks.\nJapan: MCAS Futenma\nOn the spectacularly beautiful southern Japanese island of Okinawa, hides the Marine Corps Air Station (MCAS) in Futenma.\nWe say “hides” because it’s surrounded by a high density of houses which all feel the full effects of US aircraft coming onto land.\nPowerful aircraft such as F/A-18 Hornets and V-22 Osprey are continuously landing at this airport.\nWhile the landing strip isn’t particularly short, the constant worry of clipping homes on landing or facing engine failure on take-off have earned MCAS the reputation of world’s most dangerous airport among the US armed forces.\nJapan: Chubu Centrair International Airport\nSurrounded by water on every side, there is no room for a botched landing or take-off attempt here.\nThis airport acts as the main airport for access to Japan’s central region and is one of five airstrips built on manmade islands in the archipelago nation.\nSEE ALSO: Facial recognition becoming commonplace at China’s airports\nHowever, the airport has a clean safety record and is classified as first-class in terms of facilities and operations.\nCommercial pilots face some of the toughest training in the world, so even if you’ve got a trip planned to Mount Everest, Antarctica or Bhutan, you’re in safe hands.\nThis article was originally published on our sister website Travel Wire Asia.",
    "source_domain": "asiancorrespondent.com",
    "title": "The 5 most dangerous airports in the Asia Pacific",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/04/the-5-most-dangerous-airports-in-the-asia-pacific/"
}