{
    "authors": [],
    "date_download": "2018-03-20 03:59:42+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "A TEAM of Microsoft researchers announced on Wednesday a “historic milestone” – the development of the first machine translation system that apparently has the same quality and accuracy as a person when translating Chinese news articles to English.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F03%2Fmicrosoft-bot-can-now-translate-chinese-to-english-as-well-as-a-human%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/03/2018-03-13T030940Z_1999854284_RC1EBFDF7150_RTRMADP_3_MICROSOFT-WOMEN.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An advertisement is played on a set of large screens at the Microsoft office in Cambridge, Massachusetts, U.S., on January 25, 2017. Source: Reuters/Brian Snyder\n7 Social Buzz\nA TEAM of Microsoft researchers announced last week a “historic milestone” – the development of the first machine translation system that apparently has the same quality and accuracy as a person when translating Chinese news articles to English.\nAfter testing a sample set which included around 2,000 sentences from various online newspapers, researchers from Microsoft’s Asia and US labs announced in a company blog post that their bot system had achieved “human parity”. Microsoft even hired external bilingual human evaluators to verify the machine’s translation accuracy.\nThe leveraging of artificial intelligence (AI)-powered bots in the newsrooms is a growing trend across the globe. Many publishers are experimenting with different AI services to enhance and streamline a variety of processes to deliver faster news and expand coverage. Such efforts are to help journalists focus on more valuable tasks.\nSEE ALSO: Chinese police now using sunglasses with facial recognition\nRobots have been shown to have out-performed humans on a range of complex strategy games and have developed human skills such as driving, creating music, and even writing poetry. But reaching the levels of humans in the skill of translation is seen as one of the most challenging tasks for machines to master.\n“Hitting human parity in a machine translation task is a dream that all of us have had,” said Xuedong Huang, a US-based technical fellow in charge of Microsoft’s speech, natural language and machine translation efforts. “We just didn’t realise we’d be able to hit it so soon,” he said in the blog post.\nIn order to reach this AI-powered translation milestone, three research teams in Microsoft’s Beijing, Redmond, and Washington labs worked together. The teams used a variety of training methods to train its AI systems, including deep neural networks. This meant that the translations were more likened to human capability.\nThe visions of China’s central government in building a US$150 billion AI industry by 2030 is seeing the adoption of bots in journalism gain speeding momentum.\nThe country has already seen developments in this field. In 2015, China’s largest internet company, Tencent Holdings, developed “Dreamwriter”, a bot which could create an almost flawless 1000 word, basic financial news stories in Chinese – in an impressive 60 seconds.\nFurthermore, in 2016, Toutiao, one of the country’s most widely used news apps, developed Xiaomingbot. This impressive journo-bot churned out stories (mostly sports news) which gained as much engagement as stories written by human reporters.\nSEE ALSO: Communist China is leading the electric vehicle revolution\nBut what does this advancement from Microsoft mean for the thousands of reporters in China? Could their translating days be numbered and snatched away from them by AI-powered bots?\nAccording to Yang Yang, a features writer for one of the largest English Language newspapers in China, it would take years before robots could do her job.\n“It is not just language skills. Being a good reporter, you need to experience, feel and even smell. Good [journalism] work is a combination of your memory and creation. It would be difficult for robots to achieve,” Yang told the South China Morning Post.",
    "source_domain": "asiancorrespondent.com",
    "title": "Microsoft bot can now translate Chinese to English as well as a human",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/03/microsoft-bot-can-now-translate-chinese-to-english-as-well-as-a-human/"
}