{
    "authors": [
        "Hans Nicholas Jong"
    ],
    "date_download": "2018-07-04 08:09:38+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 08:35:46",
    "description": "BANNING palm oil in favour of other vegetable oils deemed less destructive to the environment could lead to greater biodiversity losses, a new report says.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F07%2Fwhats-worse-than-palm-oil-for-the-environment-other-vegetable-oils%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/07/shutterstock_176639798.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "BANNING palm oil in favour of other vegetable oils deemed less destructive to the environment could lead to greater biodiversity losses, a new report says.\nThe report by the International Union for the Conservation of Nature (IUCN) comes amid mounting debate about the use of palm oil, with the European Union seeking to phase out the use of the ubiquitous commodity in biofuels by 2030, citing environmental and human rights violations in the production of the commodity.\nBut existing vegetable oils that could theoretically replace palm oil would be far more damaging to the environment because they would need more land, according to the IUCN report, titled “Palm Oil and Biodiversity.”\nSEE ALSO: UK supermarket ban on palm oil angers producers in Indonesia, Malaysia\nThe production of palm oil is characterised by its high yield relative to other vegetable oils, meaning more of it can be produced from a given area of farmland than other oil crops. The latter require up to nine times more land than oil palms to produce the same amount of oil.\nPalm oil is currently produced from just 10 percent of all farmland dedicated to growing oil crops, yet accounts for 35 percent of the global volume of all vegetable oils.\n“Half of the world’s population uses palm oil in food, and if we ban or boycott it, other, more land-hungry oils will likely take its place,” IUCN director general Inger Andersen said in a press release.\nIndonesia and Malaysia are the world’s biggest producers of palm oil, accounting for a combined 90 percent of global supply. However, the expansion of oil palm estates, particularly in Indonesia, has long been criticised for driving deforestation across much of the islands of Sumatra and Borneo, as well as stoking social conflicts over land and other resources with forest and indigenous communities.\nFeeding global demand for vegetable oils with other crops would only shift the damage elsewhere, to ecosystems such as the tropical forests and savannas of South America, the IUCN report said. One such oil crop widely cultivated in South America is soy, which has already had a massive negative impact on biodiversity in the region.\nStudies have linked the cultivation of soy to lower bird diversity in Brazil and Argentina. Much of Brazil’s soy production takes place in the Cerrado, a vast tropical savanna that’s home to rare and threatened species found nowhere else.\nSEE ALSO: Southeast Asia’s vanishing sand bans are destroying the region\nA recent report by the global environmental campaign NGO Mighty Earth found that 30,000 acres of forest, or about 12,100 hectares, were being cleared to plant new soy fields in northern Argentina, which supply some of the companies producing soy-based biodiesel for export to the US.\n“When we look at soybean use of production there, we [sent] a team to Argentina, and we found tremendous damage to the forest,” Henry Waxman, chairman of Mighty Earth, said at a panel discussion at the Oslo Tropical Forest Forum in Norway on June 28.\nThe IUCN report emphasised that even though palm oil was the most efficient oil crop, it needed to be deforestation-free to halt the destruction of biodiversity in Southeast Asia and other regions where it’s produced. The current practice of producing palm oil remains highly destructive, leading to the decimation of tropical rainforests and the species that depend on them, the report said.\nOrangutans, gibbons and tigers are among the 193 threatened species on the IUCN’s Red List that would be affected by the continued expansion of oil palm plantations into forest areas — a menagerie of biodiversity representing half of the world’s threatened mammals and almost two-thirds of threatened birds.\n“Palm oil is decimating Southeast Asia’s rich diversity of species as it eats into swathes of tropical forest,” said Erik Meijaard, the report’s lead author and chair of IUCN’s oil palm task force. “But if it is replaced by much larger areas of rapeseed, soy or sunflower fields, different natural ecosystems and species may suffer.”\nWhat’s next?\nThe report found that by far the biggest gains for biodiversity in an oil palm context are through avoiding further deforestation, which can be achieved through improved planning of new plantations and better management of forest patches left untouched in plantations.\nThe report also recommended stakeholders push for greater demand for sustainably produced palm oil, thereby putting pressure on producers to improve their practices.\n“With most palm oil being supplied to India, China, and Indonesia, consumer awareness in these countries needs to be raised to ensure that this demand will materialise,” the report read.\nAdrian Suharto, the head of stakeholder engagement at Finland-based biodiesel supplier Neste Corporation, agreed with the report’s recommendations.\n“The most important thing is that what you buy is sustainable and you educate people and help support the local government in Indonesia and Malaysia, Thailand, Colombia, and everywhere else to understand the importance of having sustainable production [of palm oil],” he said at the Oslo Tropical Forest Forum.\nThe European Federation for Transport and Environment, an umbrella for NGOs working in the field of transport and the environment, said the best solution would be to completely remove biofuel mandates and incentives for crop-based biofuels that force people to use biofuel.\nIt cited as a case in point the EU’s 2009 policy requiring every EU member state to have 10 percent renewable fuels by 2020.\nSEE ALSO: When palm oil meets politics, Indonesian farmers pay the price\nThe EU is now revising its renewable energy policy, which will remove the incentives for crop-based fuels starting from 2020. It will also phase out the use of palm oil in biodiesel, which Laura Buffet, the manager for clean fuels at the transport and environment federation, said was a move in the right direction.\n“I agree that if you keep the same drivers and the same high target, and you just remove one feedstock from the equation, it’ll be likely to be filled by something else,” she said at the Oslo forum. If those alternatives are soy or rapeseed oil, she added, “you will also look at indirect impact and deforestation, so it’s not going to solve entirely the issue.”\n“That’s why we’re asking for reducing or completely removing the mandate, and that’s going to be the best solution.”\nThis article originally appeared on Mongabay.",
    "source_domain": "asiancorrespondent.com",
    "title": "What’s worse than palm oil for the environment? Other vegetable oils",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/07/whats-worse-than-palm-oil-for-the-environment-other-vegetable-oils/"
}