{
    "authors": [],
    "date_download": "2017-06-15 10:01:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "CAMBODIAN Prime Minister Hun Sen on Wednesday lifted an order barring exiled former opposition leader Sam Rainsy from re-rentering the country after the latter challenged the premier to be \"brave enough\" to face him in next years general election.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fcambodia-pm-hun-sen-lifts-ban%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-06-04T034615Z_36933910_RC16A8F5F110_RTRMADP_3_CAMBODIA-ELECTION.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Cambodia's Prime Minister and president of Cambodian People's Party (CPP) Hun Sen looks at the ballot box after casting his vote during local elections in Kandal province, Cambodia June 4, 2017. Source: Reuters/Samrang Pring\n20 Social Buzz\nCAMBODIAN Prime Minister Hun Sen on Wednesday lifted an order barring exiled former opposition leader Sam Rainsy from re-entering the country after the latter challenged the premier to be “brave enough” to face him in next years general election.\nAccording to The Cambodia Daily, Rainsy is inching closer to returning home after Hun Sen also issued his rival a challenge to deliver his pledge to risk prison or death by coming back and taking the prime minister’s post in the polls.\nA spokesman from the Cambodian People’s Party, Sok Eysan, said the move was “entirely” in response to an interview Rainsy gave to Radio Free Asia on Tuesday in which he mocked Hun Sen’s cowardice in urging for the lifting of the ban, the daily reported.\nSEE ALSO: Cambodia: Sam Rainsy dares PM Hun Sen to allow leadership contest next year\n“We cannot make the right prediction until he arrives at Pochentong (Airport),” the spokesman was quoted as saying.\n“We will wait and see together.”\nIn the interview with Radio Free Asia, Rainsy said in order to have a free and fair election, he must be allowed to be a contender and prime ministerial candidate to compete with Hun Sen.\n“I request that Hun Sen be brave enough not to obstruct me from being able to compete with him,” Rainsy, who resigned from the Cambodia National Rescue Party (CNRP) earlier this year, said.\nRainsy quit as president of CNRP, Cambodia’s leading opposition party, in February, shortly after Hun Sen threatened legal changes that appeared to target him ahead of the polls.\nSEE ALSO: Cambodia: Opposition cries foul over ‘smear campaign’ after vote gains\nThe amendments, which were approved late February, stops anyone convicted of an offence from running for office for five years. The changes effectively bars Rainsy, Hun Sen’s main rival, from contesting in the election.\nCourts that critics say are influenced by Hun Sen have convicted Rainsy of a series of defamation charges, forcing the opposition leader into exile in France.\nIn October last year, the government issued an order banning Rainsy from returning to the country and directed all airlines flying to Cambodia not to allow Rainsy on board their flights.",
    "source_domain": "asiancorrespondent.com",
    "title": "PM Hun Sen lifts ban barring opposition leader's return",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/cambodia-pm-hun-sen-lifts-ban/"
}