{
    "authors": [],
    "date_download": "2017-06-15 10:01:59+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 01:00:05",
    "description": "THEIR dreams for a good life dashed, the parents of Jennifer Dalquez, the Filipina on death row in the United Arab Emirates, are just hoping their daughter returns alive and able to start life anew at their impoverished community in General Santos City, Philippines.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fparents-filipina-uae-death-row-hope-acquittal%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/DSC_0186.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The parents of Jennifer Dalquez holding up a poster calling to save her daughter's life at their house in General Santos City, Philippines. Source: Bong Sarmiento\n33 Social Buzz\nTHEIR dreams for a good life dashed, the parents of Jennifer Dalquez, the Filipina on death row in the United Arab Emirates, are just hoping their daughter returns alive and able to start life anew at their impoverished community in General Santos City, Philippines.\n“All she really wants now is to go back home to be with her children and us her parents,” Rajima, Dalquez’s mother, told Asian Correspondent at their house, located just a stone’s throw away from a mosque where family members and friends often offer prayers for her freedom.\nDalquez left her two children — Mohajid, 8, and Abdurahim, 5 – to seek greener pastures for her family in the Gulf country when they were just two-years-old and seven-months-old, respectively.\nShe hasn’t come home since and the two children were left to the care of her parents. Her father drives a passenger tricycle (motorcycle with a cab) while her mother is a housewife. Her husband is also a tricycle driver.\nDalquez works as a helper at a clinic in Al Ain, an inland oasis city on the eastern border with Oman, her parents said.\nSEE ALSO: Philippines govt bans deployment of workers to Qatar\nIn December 2014, a month before she was due home, she decided to find an extra job to earn some extra bucks. But fate changed things. At her new workplace, her male employer allegedly tried to rape her at knife-point. The 30-year-old woman managed to fight and kill him with a knife in what she claimed in court was an act of self-defence.\nDalquez was jailed and eventually sentenced to death by the United Arab Emirates Court of First Instance in April 2015.\n“Save Jennifer Dalquez’ Life,” a social media group pushing for her acquittal, reported that the deceased employer’s two sons did not attend court hearings to swear in the name of Allah that Dalquez murdered their father.\nOn May 31, Dalquez swore before the court in the name of Allah that she killed her employer in self-defence.\nThe UAE court will decide this June 19 on Dalquez’s appeal for an acquittal.\nDalquez’s parents were able to see her twice in prison with the help of the Philippine government and non-government organisations, including Migrante International.\nHer parents have also sought the help of President Rodrigo Duterte to appeal for her clemency.\nSEE ALSO: Duterte brings home over 100 stranded Filipino workers from Saudi Arabia\nShe’s being treated well inside the prison, her parents said, noting that Dalquez has become closer to Allah while serving time there. They showed Asian Correspondent prizes that Dalquez had won in Quran-reading competitions inside the jail.\n“We are looking forward to see her. We have faith in Allah that she will be acquitted so that she can return home and take care of her children,” Abdulhamid, Dalquez’s father, told Asian Correspondent.\n“It’s no longer important if we will remain poor as long as we can be together again,” he added.\nDalquez is the family’s breadwinner. Before she was jailed, she regularly sent money to her parents for their needs as well as for her children’s. She also extended financial assistance to her siblings, who are all mostly poor. Dalquez is the third in a brood of seven.\nRajima was almost in tears when she recounted what Dalquez’s youngest son told her, which was:\n“I hope to see my mother and for her to bring and fetch me at school like my classmates who have their mothers at their side.”\nDalquez had many dreams for her children, including for her parents who had sacrificed a lot so she could go abroad, before she left the country six years ago. One of her dreams is to buy a house at a subdivision so they could live away from the slums.\n“We had to sell our chickens and ducks in the farm so we can send money while she stayed in Manila while waiting to work abroad,” her mother said.\nHer parents, both 53, no longer till the farm in another province planted with various crops as it was pawned to somebody rich due to their financial necessities.\nWhat awaits Dalquez, should she win the acquittal and gain passage home, is her parents’ small pop-and-mom store in their poor neighborhood, which barely sustains their daily needs.\n“We put everything to Allah’s will,” Abdulhamid said.",
    "source_domain": "asiancorrespondent.com",
    "title": "Parents of Filipina on UAE death row hope for acquittal",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/parents-filipina-uae-death-row-hope-acquittal/"
}