{
    "authors": [],
    "date_download": "2017-10-06 14:39:56+00:00",
    "date_modify": null,
    "date_publish": "2017-10-20 00:00:00",
    "description": "AS America woke to the news of yet another mass shooting on Monday morning, the usual feelings of sadness, despair and powerlessness bubbled up to the surface once again. As an initial reaction, that’s fairly standard.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F10%2Flas-vegas-shooting-muslim%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/10/2017-10-02T082736Z_843361081_RC16CFACF310_RTRMADP_3_USA-LASVEGAS-SHOOTING.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A body is covered with a sheet in the intersection of Tropicana Avenue and Las Vegas Boulevard South after a mass shooting at a music festival on the Las Vegas Strip in Las Vegas, Nevada, U.S. October 1, 2017. Source: Reuters/Las Vegas Sun/Steve Marcus\n25 Social Buzz\nAS America woke to the news of yet another mass shooting on Monday morning, the usual feelings of sadness, despair and powerlessness bubbled up to the surface once again. As an initial reaction, that’s fairly standard.\nBut what swiftly followed, perhaps was not. As news began to emerge of gun fire at the Las Vegas music festival, both myself and my colleague, turned to each other and in unison said, “I hope he’s not Muslim.”\nThis reaction may seem odd to some, but it really shouldn’t.\nAs common place as mass shootings in America have become, so too is the Muslim bashing and drastic policy measures that inevitably follow should a brown man with a beard commit the exact same act.\nSEE ALSO: World leaders react to Las Vegas mass shooting\nBoth myself and my colleague, a Muslim man, are all too aware of the sad truth that the actions of one crazy man – who happens to be Muslim – has exponential repercussions that reach far beyond himself and his family.\nThe brutal actions of one white man will be treated as just that, the actions of one man. There will be the inevitable discussion about his mental health, there will be the predictable arguments between Democrats and Republicans about gun control in the States, the country will come together to mourn. And that will pretty much be the end of it.\nIf, however, it proves to be a Muslim man that carries out these appalling acts, it’s a very different story. One man’s actions then become the responsibility of the whole community. And not only the American Muslim community, but the global Muslim community pays a price.\nTrump’s travel ban, put in place to supposedly protect the country against acts of terror much like those seen on Sunday night, would be extended. The borders would be closed to refugees. The news networks would be endlessly debating the rise of radical Islam and the community’s inability, or reluctance, to report one of their own.\nAnd the Islamophobia that’s become so pervasive among much of Western society would be bolstered.\nSEE ALSO: Trump travel ban raises concerns among Haj pilgrims\nIt wouldn’t matter if the perpetrator was American, born and raised, the outcome would be the same. A nation would look, and all they would see would be Islam. It wouldn’t matter if his motives were unknown – as is the case with the Las Vegas shooter – he would still not be seen as a “lone wolf,” but as a symptom of a larger problem among his demographic.\nNo one has questioned why Stephen Paddock’s family didn’t report him to authorities before the attack, no one has demanded an apology from the wider white male group, and most certainly no one will be calling for tighter restrictions on white males entering the country. When white males are the deadliest threat in America, far surpassing deaths from Islamic terrorism, you have to question the inconsistency in the response.\nWhite men will not be asked to explain Paddock’s actions, and nor should they. We should afford the same courtesy to out Muslim friends.\n** This is the personal opinion of the writer and does not reflect the views of Asian Correspondent",
    "source_domain": "asiancorrespondent.com",
    "title": "It's good the Las Vegas shooter wasn't Muslim",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/10/las-vegas-shooting-muslim/"
}