{
    "authors": [],
    "date_download": "2017-12-12 04:55:00+00:00",
    "date_modify": null,
    "date_publish": "2017-12-12 02:17:15",
    "description": "IN A CITY renowned for its delicious street food, it’s not easy to stand out. But that’s exactly what one 70-year-old street vendor has managed to do, bagging a coveted Michelin star for her generous helpings of seafood noodles.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F12%2Fbangkok-street-vendor-awarded-citys-first-michelin-star%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/12/bkkmichelin.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "\"We do not have a lot of staff because I’m a bit difficult and crazy.\" Source: TripAdvisor\nIN A CITY renowned for its delicious street food, it’s not easy to stand out. But that’s exactly what one 70-year-old street vendor has managed to do, bagging a coveted Michelin star for her generous helpings of seafood noodles.\nJay Fai, or Auntie Fai as she is affectionately known, accepted the award at ceremony at the Grand Hyatt in the capil last week. Dressed in a white chef’s outfit, the eccentric chef looked a world away from her usual cooking attire of beanie hat, black apron, and ski goggles – used to protect her eyes from the hot oil.\n“Before, I knew the Michelin name but I did not know it had to do with cooking,” she told AFP after obtaining the star.\nSEE ALSO: Thailand crowned the friendliest country in Asia for vegetarians\n“I am very proud,” she said, adding that she must be back in the kitchen Thursday. “We do not have a lot of staff because I’m a bit difficult and crazy.”\nFamous for its noodles with prawns and crab, cooked over charcoal fires, Jay Fai’s looks like any other humble Bangkok street food eatery. An open front kitchen, with stools spilling onto the street as the hustle and bustle of city life goes on around diners.\nBut Jay Fai isn’t your ordinary vendor, and her prices reflect this with a typical speciality costing upwards of US$20. One local food blog described it as that place Ferraris and Bentleys park street side to get their fix.\nSEE ALSO: China and Japan are home to a third of the world’s best restaurants\nThe restaurant was one of 17 in the city awarded stars – a highly sought-after accolade awarded after months of secret inspections by the French tire company’s food critics.\nOther recipients are some high-class Thai restaurants, but predominantly consisted of French haute cuisine restaurants, such as Le Normandie, where a jacket is “compulsory for gentlemen during dinner.”\nThis is the first Bangkok guide that Michelin has produced. The Thai capital joins Singapore, Shanghai, Seoul, Hong Kong, Kyoto and Osaka, and Tokyo as Asian food hubs deemed worthy of Michelin’s famed red guide, first released for motorists in 1900.",
    "source_domain": "asiancorrespondent.com",
    "title": "Bangkok street vendor awarded city's first Michelin star",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/12/bangkok-street-vendor-awarded-citys-first-michelin-star/"
}