{
    "authors": [],
    "date_download": "2017-10-06 14:39:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 10:24:53",
    "description": "JEREMY Lin issued one of the most articulate and polite comebacks in the history of sports disagreements after Kenyon Martin accused the American-Asian star of cultural appropriation.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F10%2Fjeremy-lin-responds-kenyon-martin-tells-star-wanna-black%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/10/JeremyLinDreads.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jeremy Lin of Brooklyn Nets drives against Tim Hardaway Jr and Jarrett Jack of New York Knicks in a pre-season game at Madison Square Garden. Source: Noah K. Murray-USA TODAY Sports\n34 Social Buzz\nJEREMY Lin issued one of the most articulate and polite comebacks in the history of sports disagreements after Kenyon Martin accused the American-Asian star of cultural appropriation.\nLin has returned for Brooklyn Nets’ pre-season programme sporting dreads – and addressed the issue at length and detail in a column for The Players’ Tribune.\nFormer NBA star Martin – who, like Lin, played for both the Nets and New York Knicks – took to Instagram to call out Lin over his hairstyle.\nIn a video, he said: “Do I need to remind this damn boy that his last name Lin?\nSEE ALSO: Terrence Romeo blazes a trail for Asian basketball as he unveils signature shoe\n“Like, come on man. Let’s stop this, man, with these people, man. There is no way possible that he would have made it on one of our teams with that bulls— goin’ on on his head.\n“Come on man, somebody need to tell him, like, ‘All right bro, we get it. You wanna be black.’ Like, we get it. But the last name is Lin.”\nLin, who shot to fame and spawned the term ‘Linsanity’ during a hot streak with the Knicks in 2012, offered a measured response on Instagram.\n“Hey man, it’s all good,” he wrote. “You definitely don’t have to like my hair and definitely entitled to your opinion.\n“Actually i legit grateful you sharing it tbh. At the end of the day i appreciate that i have dreads and you have Chinese tattoos bc i think its a sign of respect. And i think as minorities, the more we appreciate each others cultures, the more we influence mainstream society.\n“Thanks for everything you did for the nets and hoops…had your poster up on my wall growin up.”\nJeremy Lin spoke extensively about Kenyon Martin's comments after the game: pic.twitter.com/JaDH1Du8V0 — Anthony Puccio (@APOOCH) October 6, 2017\nMartin posted a second video on Instagram, in which he said his initial comments were a joke and not about race, but the 39-year-old faced a barrage of abuse from Lin’s fans: much of it racist.\nThat prompted Lin to speak again, after scoring 16 points in his team’s pre-season win over Miami Heat, and he delivered an eloquent and respectful assessment of the disagreement.\n“I’d say first I hope that a lot of Asian fans don’t go on his page and say racist things to him,” Lin said.\n“That’s not the right way to go about it. In a lot of ways to pit us against each other – I won versus Kenyon Martin winning – I don’t think that’s the right way to go about it. It’s not really about winning or losing. The whole point is we’re trying to be unified.\n“So I feel like even when some people come at me like, ‘Man, you embarrassed him’, it’s like dude, that’s not what it’s about.\n“That’s not the whole point of this discussion is to pit us into two sides and see who wins. The whole point is we all have to get on the same page. We need to have people stop going on his page saying racist things to him, too. That’s not OK.”",
    "source_domain": "asiancorrespondent.com",
    "title": "'You wanna be black'",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/10/jeremy-lin-responds-kenyon-martin-tells-star-wanna-black/"
}