{
    "authors": [],
    "date_download": "2018-03-20 06:02:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "CURRENT energy cooperation between Australia and Japan is marked by their mutual strengths. Both countries take advantage of domestic energy resources, encourage energy efficiency, and are seeking to introduce energy market reforms.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F03%2Fenergy-cooperation-between-canberra-and-tokyo-could-help-keep-the-lights-on-in-asia%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/03/2018-03-12T060103Z_66098146_RC18A54BAF10_RTRMADP_3_JAPAN-ECONOMY-WAGES.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CURRENT energy cooperation between Australia and Japan is marked by their mutual strengths. Both countries take advantage of domestic energy resources, encourage energy efficiency, and are seeking to introduce energy market reforms.\nJapan and Australia have developed integrated policy frameworks for both energy security and market stability, and have spurred fresh investment into international energy assets. The two nations’ joint initiatives are also progressing in organisations such as the Asia-Pacific Economic Cooperation (APEC) forum and the G20, which support the globalisation of clean energy technologies and enhance the capabilities of emerging Asian economies to implement best practices.\nAustralia and Japan are together playing a critical role in achieving global energy security and mitigating climate change with a wide range of new initiatives.\nSEE ALSO: South Australia and Tesla team up again for world’s largest ‘virtual power plant’\nToday, China, India, and the members of the Association of Southeast Asian Nations (Asean) are among the most dynamic parts of the global economic system and are a rising force in international energy affairs. Their primary energy demand grew by over 70 percent in the last three decades and accounted for more than 60 percent of total global energy demand.\nThese countries are not only the most populous neighbours of Japan and Australia, but also middle-income nations which have already reached an energy-intensive phase of development. As their energy demand has grown, they have become a key part of global energy security and carbon emission mitigation dynamics and efforts.\nThis development poses a number of opportunities and risks for Australia and Japan. As a result, there are three broad areas where Canberra and Tokyo should seek greater energy cooperation.\nThe first area for cooperation relates to the supply of low carbon or intermediate energy resources. To cope with increased energy demand in the region, Australia and Japan aim to diversify their energy mix with the expanded use of Liquefied Natural Gas (LNG). The 2011 Fukushima nuclear accident in Japan and the commitment to Paris Agreement goals by 2030 provide a strong policy imperative for Japan and its neighbours to boost LNG trade.\nFor its part, Australia will soon become the world’s leading LNG exporter. Its annual export capacity is projected to rise from around 40 billion cubic metres in 2015 to over 100 billion cubic metres in 2030. However, other global suppliers such as Qatar will remain strong contenders for LNG market dominance.\nGreater regional trade, increased short-term export potential and greater operational flexibility are leading to a convergence of gas prices at the regional level. The governments of Australia and Japan must jointly make big decisions on LNG pricing, production and distribution infrastructure and export policies.\nSEE ALSO: Japan’s nuclear dilemma: The search for energy security post-Fukushima\nThe second area for cooperation is reducing the energy intensity of the transport sector, which will be the cause of most of the global carbon emissions in future. Japan has made hydrogen a symbol of its ability to pioneer new energy carriers, and wants to build an international hydrogen supply chain that extends from production to transportation and consumption. But transporting hydrogen to Japan and other parts of Asia is challenging.\nWith the advent of new technologies that can refine pure streams of hydrogen from renewables and coalmines, Australia can be the forerunner as a major exporter of hydrogen energy – beyond coal and gas. Australia’s government needs to consider how a portfolio of local innovations can complement Japan’s vision for a global hydrogen society.\nThe third area of cooperation is grid connectivity. Australia and Japan should pursue joint strategies to help reduce the impact of power supply disruptions and bring stability to clean energy integration into grids. The Asia Super Grid (ASG) is a multilateral energy trade strategy aiming to integrate the grids of Japan, Korea, China, Mongolia, ASEAN countries and India. Mongolia has major ambitions to mobilise its wind and solar resources to become the ASG’s energy hub and export up to 100 GW of renewable energy by 2030.\nWith the plunging costs of renewable energy production, Australia could become a contributor to the ASG, making it more attractive by mobilising its vast reservoir of desert solar and wind energy via a Subsea High-Voltage Direct Current. Having Australia on board will make an ASG based on 100 per cent renewable energy more attainable.\nAcross these three areas, Australia and Japan share much in common. The future of their energy cooperation will be characterised not only by their domestic needs and aspirations, but also by the growing energy demand of their Asian neighbours, the need to reduce the cost of supply, and the need to manage carbon emissions.\nSEE ALSO: Burma govt’s energy projects stalling peace efforts, groups claim\nThe emerging Asian countries will likely remain the main engine of economic growth and the centre of gravity for energy security in the coming decades. Cooperation between Australia and Japan therefore needs to ensure effective policy frameworks for LNG trade, support timely innovations in hydrogen infrastructure, and enhance the attractiveness of the Asia Super Grid.\nChina, India and Asean nations also face challenging energy policy choices. There is an imperative for the Asian countries to adjust their energy policies in line with the goals of the Paris Agreement.\nIn an era of changing energy demands and growing carbon constraints, Australia and Japan must work together effectively to reduce emissions in the region and enhance global energy security.\nBy Dr Anbumozhi Venkatachalam, Senior Economist at the Economic Research Institute for Asean and East Asia (ERIA), Indonesia. This article originally appeared on PolicyForum.net.",
    "source_domain": "asiancorrespondent.com",
    "title": "Energy cooperation between Canberra and Tokyo could help keep the lights on in Asia",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/03/energy-cooperation-between-canberra-and-tokyo-could-help-keep-the-lights-on-in-asia/"
}