{
    "authors": [],
    "date_download": "2017-08-14 10:07:57+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 09:17:35",
    "description": "CHOT Reyes had a word of warning for his Philippines players, even as they celebrated with 2,000 Filipino fans in Lebanon.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F08%2Fchot-reyes-word-warning-philippines-bask-fans-adulation-fiba-asia-cup%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/08/PhiCelebrations.jpeg",
    "language": "en",
    "localpath": null,
    "maintext": "Philippines players celebrated with around 2,000 of their Lebanon-based fans after Sunday's win against Qatar. Source: FIBA\n6 Social Buzz\nCHOT Reyes had a word of warning for his Philippines players, even as they celebrated with 2,000 Filipino fans in Lebanon.\nGilas players were able to celebrate with around 2,000 of their Lebanon-based supporters after they beat Qatar 80-74 to complete a sweep of Group B at the FIBA Asia Cup.\nBut head coach Reyes knows there is plenty of hard work ahead – and that his team must improve in the quarter-finals.\nPhilippines will meet Japan or South Korea in the last eight on Wednesday, with the winners of that game likely to meet Iran in the semi-finals.\nSEE ALSO: FIBA Asia Cup day six: Philippines top group and book quarter-final spot, but China face play-off\nBut despite sweeping their group, and doing so after a far from smooth preparation for the tournament, Reyes is not getting carried away with his team’s winning start.\n“You all know that if we had played Korea or Japan tonight, we would have been heading home,” Reyes told his players after the victory over Qatar.\nAgainst the Qatari team, Gilas went 28-for-71 from the field, turned the ball over 17 times, and had little answer to Mansour Elhadary, who scored 23 points.\n“No way we’ll win like that,” said Reyes, as reported by SPIN.ph.\n“Seventeen turnovers. We shot less than 40 percent from the field. We couldn’t stop Mansour Elhadary.”\nFor everything that has gone against them in the past few weeks, with Andray Blatche opting against travelling to Lebanon and Reyes struggling to get his entire squad together for meaningful practices before they departed Manila, they are looking good.\nSo it is unsurprising that Reyes wants to keep his players firmly grounded before Wednesday’s quarter-final.\nChristian Standhardinger, who missed Sunday’s win with stiffness in his neck, is determined to return against Japan or Korea, but the prognosis on Calvin Abueva’s foot injury is less clear.",
    "source_domain": "asiancorrespondent.com",
    "title": "Chot Reyes' word of warning for Philippines as they bask in fans' adulation at FIBA Asia Cup",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/08/chot-reyes-word-warning-philippines-bask-fans-adulation-fiba-asia-cup/"
}