{
    "authors": [],
    "date_download": "2018-03-20 03:59:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:00:00",
    "description": "CHINESE President Xi Jinping and his Russian counterpart Vladimir Putin spoke on the phone on Monday to congratulate each other on respective election wins and pledge to deepen ties between the two countries.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F03%2Fxi-jinping-putin-congratulate-each-other-on-election-victories%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/03/2018-03-18T213552Z_1812569908_RC16C835DB00_RTRMADP_3_RUSSIA-ELECTION-PUTIN-CONCERT.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Russian President and Presidential candidate Vladimir Putin delivers a speech at his election headquarters in Moscow, Russia March 18, 2018. Source: Sergei Chirkov via Reuters\n13 Social Buzz\nCHINESE President Xi Jinping and his Russian counterpart Vladimir Putin spoke on the phone on Monday to congratulate each other on respective election wins and pledge to deepen ties between the two countries.\nAccording to the Chinese Communist Party mouthpiece Xinhua, Xi said that under their respective leadership the two countries had increased their strategic partnership to the “best level” in history and had built a “new type” of international relations based on mutual respect, fairness and justice.\n“I have met with Mr. President many times, and we have jointly led China-Russia ties to withstand the test of the fluctuating international situation and reach the best level in history,” said Xi as quoted by Xinhua.\nSEE ALSO: Xi Jinping movie a box office smash – because people are forced to watch it\nBoth countries were in a “crucial period of national development and rejuvenation,” he said.\nOn Sunday, Putin won his biggest ever election victory with more than 75 percent of the vote. He has led Russia as president or prime minister since 1999.\nHis victory, which comes at a time when his relations with the West are on a hostile trajectory, will extend his political dominance of Russia by six years to 2024. That will make him the longest-serving ruler since Soviet dictator Josef Stalin and has raised Western fears of spiralling confrontation.\nLast week, Xi was unanimously re-elected by the 2,970 deputies of Chinese parliament as President for a second five-year term. Amendments to the constitution have recently removed term limits and inserted Xi’s personal political theory into the constitution, making him the most powerful leader since Mao Zedong.\nXi’s face dominated the front pages of major Sunday newspapers, many carrying the same editorial from the ruling Communist Party’s official People’s Daily using language once more associated with Mao to say he was a “leader loved and respected by the people” and “helmsman of the country”.\nSEE ALSO: China bans letter ‘N’ online to suppress criticism of Xi Jinping\nXinhua reported that Putin again congratulated Xi on Monday, saying that his election by the National People’s Congress proved the President’s “high prestige” and support from “all the Chinese people.”\n“Thanks to your promotion in person, the Russia-China comprehensive strategic cooperative partnership is at the highest level in history,” the Russian President was quoted as saying.\nChinese foreign ministry spokeswoman Hua Chunying was quoted by state-run newspaper the Global Times as saying: “according to the routine of annual exchange visits between leaders of the two countries, Russian president will visit China this year and both sides will closely coordinate this through diplomatic channels.”\nAdditional reporting from Reuters.",
    "source_domain": "asiancorrespondent.com",
    "title": "Xi Jinping, Putin congratulate each other on ‘election victories’",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/03/xi-jinping-putin-congratulate-each-other-on-election-victories/"
}