{
    "authors": [],
    "date_download": "2017-06-15 10:01:53+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "PHILIPPINES security forces on Thursday arrested an alleged bomber from the Maute militant group that has been battling local government troops in Marawi city over the past three weeks.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fphilippine-security-forces-arrest-maute-leader%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-06-14T104646Z_2116023296_RC1214ADCDA0_RTRMADP_3_PHILIPPINES-MILITANTS.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Black smoke comes from a burning building in a commercial area of Osmena street in Marawi city, Philippines June 14, 2017. Pic: Reuters\n51 Social Buzz\nPHILIPPINE security forces on Thursday arrested an alleged bomber and leader from the Maute militant group that has been battling local government troops in Marawi city the past three weeks.\nRegional Police spokesman Supt. Lemuel Gonda said the suspect was nabbed in Santa Cruz, Macasandig, and has been identified as Mohammad Noem Maute aka Abdul Jabid.\nThe Philippine National News Agency quoted Gonda as saying a combined military and police intelligence taskforce called the Martial Law Special Action Group carried out the suspect’s arrest.\nAnother suspect, Abdul Raman, is still at large.\nSEE ALSO: Philippines: US troops on ground near besieged Marawi City – army\nThe Department of National Defence had earlier issued an arrest order on the two suspects who Gonda said were bomb experts from the Islamic State-linked Maute group.\nGonda said the police regional command is currently interrogating the suspect.\nThe suspect’s two brothers, Omarkhayam and Abdullah, are said to be leading the Maute gang.\nMarawi is about 100km (60 miles) south of Cagayan de Oro, the checkpoint where Abdul Jabid was nabbed, but it is not clear if he had been heading in from the besieged city.\nMost of the other seven Maute brothers, including Omarkhayam and Abdullah, are believed to be in Marawi. Last week, their parents were taken into custody in separate cities.\nSEE ALSO: Philippines: Muslim leaders to fight terrorism with education, spiritual intervention\nThe Marawi clashes began on May 23 when Philippine forces staged a raid to arrest Isnilon Hapilon, a wanted leader of IS-linked Maute and the Abu Sayyaf terror network, following tip-offs on his hideout.\nThe military told Reuters that 290 people have been killed so far, including 206 militants, 58 soldiers and 26 civilians. The conflict has entered its 23rd day.\nAuthorities also said 100 militants remain in the besieged area, down from the 400 to 500 estimated number of fighters during the peak of the siege. An estimated 300 to 600 civilians are also said to be trapped or being held hostage in the city.",
    "source_domain": "asiancorrespondent.com",
    "title": "Philippine security forces arrest Maute leader",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/philippine-security-forces-arrest-maute-leader/"
}