{
    "authors": [],
    "date_download": "2017-08-15 07:43:58+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 05:21:06",
    "description": "PHOTOGRAPHS showing tourists reportedly abusing sensitive marine creatures in Thailand's resort island of Phuket have drawn local outrage.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F08%2Fthailand-tourists-abusing-marine-life-phuket-draw-local-outrage%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/08/star-fish.png",
    "language": "en",
    "localpath": null,
    "maintext": "PHOTOGRAPHS showing tourists reportedly abusing sensitive marine creatures in Thailand’s resort island of Phuket have drawn local outrage.\nOn Saturday, Facebook user Khanchit Klingklip, took to the social networking website to post pictures of the yet-to-be-identified tourists handling various creatures, including starfish, off the island of Racha Yai.\nHis post read: “again, destroying the property. Who caught it? Who is taking responsibility? (sic)”.\nIn wake of the post, local authorities launched a probe into the incident.\nThe Nation quoted the director of Marine Resources Conservation, Suchart Ratanruangsri, as saying that staff have been assigned to investigate the claims.\nSEE ALSO: Clean up beaches or risk losing visitors, Spanish tourist tells Thailand\nSuchart said the authorities were currently searching for the operator of the speedboat seen in the photographs.\nWhile the markings on the speedboat make it clearly identifiable, officials said the vessel did not appear to be a regular at the jetty Chalong, the main departure-point for such boats heading to Racha Yai.\nThe director said authorities have constantly reminded tour operators and tourists about regulations over the handling of sea creatures or coral.\nDespite the incident, Suchart said most tour companies have abided by the rules as they understood the importance of ensuring that the coral around Phuket remained untouched.\nSEE ALSO: Two tourists killed and 34 injured after speedboat collision off Phuket\nSuchart added tourists who took any illegal “souvenirs” while on their boat trips could be charged under laws that protect marine life.\nEarlier this month, Khancit, who is a tour guide and conservationist, posted camera footage of an alleged illegal tour guide feeding coral fish during a diving trip with two Korean women.\n“It is a recurring problem. I have had problems with this group of Korean guides before about feeding fish, and I once caught them diving down and sitting on and touching the coral,” he said, as quoted by The Phuket News.\n“That time, it didn’t make the news because I only complained to the company I was working for”.",
    "source_domain": "asiancorrespondent.com",
    "title": "Tourists 'abusing' marine life in Phuket draw local outrage",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/08/thailand-tourists-abusing-marine-life-phuket-draw-local-outrage/"
}