{
    "authors": [],
    "date_download": "2017-06-15 10:02:02+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "NORTH KOREA said on Thursday it had released American citizen Otto Warmbier \"on humanitarian grounds\" after he had been held prisoner for 17 months.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fn-korea-released-us-student-humanitarian-grounds%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-06-13T142253Z_831337738_RC1440695A90_RTRMADP_3_USA-NORTHKOREA-DETAINEE-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Otto Frederick Warmbier (C), a University of Virginia student who was detained in North Korea since early January, is taken to North Korea's top court in Pyongyang, North Korea, in this photo released by Kyodo March 16, 2016. Pic: Reuters\nNORTH KOREA said on Thursday it had released American citizen Otto Warmbier “on humanitarian grounds” after he had been held prisoner for 17 months.\nWarmbier, 22, a University of Virginia student from suburban Cincinnati, was medically evacuated to the United States on Wednesday. His family said he arrived in a state of coma.\nThe North‘s KCNA news agency said in a one-sentence dispatch that Warmbier’s release followed a court decision on Tuesday. It did not provide other details.\nSEE ALSO: N.Korea frees student in coma after high-level US visit\n“Under a decision by the DPRK Central Court of June 13, American citizen Otto Warmbier who was serving a sentence of labour was returned on June 13 on humanitarian grounds,” KCNA said. DPRK is short for the North‘s formal name, the Democratic People’s Republic of Korea.\nHis release came after Joseph Yun, the U.S. State Department’s special envoy on North Korea, traveled to Pyongyang and demanded Warmbier’s release on “humanitarian grounds,” capping a flurry of secret diplomatic contacts, a U.S. official said.\nWarmbier’s parents, Fred and Cindy, confirmed their son was on a medevac flight.\nWarmbier was detained in January 2016 and sentenced to 15 years of hard labor in March last year for trying to steal an item with a propaganda slogan, according to North Korean media.\nSEE ALSO: NKorea sentences US student to 15 years hard labor for trying to steal banner\nWarmbier’s family said they were told by North Korean officials, through contacts with American envoys, that Warmbier fell ill from botulism some time after his March 2016 trial and lapsed into a coma after taking a sleeping pill, the Washington Post reported.\nThe New York Times quoted a senior U.S. official as saying Washington recently received intelligence reports that Warmbier had been repeatedly beaten in custody.\nWarmbier’s release came as former U.S. basketball star Dennis Rodman arrived in North Koreaon Tuesday, returning to the nuclear-armed country where he met leader Kim Jong Un on previous visits. Reuters",
    "source_domain": "asiancorrespondent.com",
    "title": "N.Korea says released US student 'on humanitarian grounds'",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/n-korea-released-us-student-humanitarian-grounds/"
}