{
    "authors": [],
    "date_download": "2017-06-15 10:01:50+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "CHINA has been pressuring the United Arab Emirates and four other countries to ask Taiwan to rename its representative offices in another sign of diplomatic pressure on the self-ruled island, Taiwan's foreign ministry said on Thursday.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Ftaiwan-china-moving-soften-taipeis-representation-5-countries%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-06-14T220308Z_200381344_RC1AF0A482D0_RTRMADP_3_PANAMA-CHINA.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An official of Taiwan's embassy addresses people on a terrace of the embassy in Panama City, Panama June 14, 2017. Pic: Reuters\n15 Social Buzz\nCHINA has been pressuring the United Arab Emirates and four other countries to ask Taiwan to rename its representative offices in another sign of diplomatic pressure on the self-ruled island, Taiwan‘s foreign ministry said on Thursday.\nThe pressure from Beijing on the UAE, Bahrain, Ecuador, Jordan, and Nigeria follows Panama’s decision earlier this week to cut diplomatic ties with Taiwan and instead recognise China and its “One China” policy.\nTaiwan‘s foreign ministry said in a statement China wanted the five countries to ask Taiwan to use names, such as “Taipei Trade Office”, that do not suggest Taiwanese sovereignty.\n“China is acting to suppress us in an impertinent way that has seriously offended the sensibilities of Taiwan‘s people,” the statement said.\nSEE ALSO: In a win for Beijing, Panama ‘levels up’ ties with China, ditches Taiwan\nChina’s foreign ministry did not respond immediately to a request for comment.\nTaiwan‘s office in Jordan is currently called the “Commercial Office of the Republic of China”.\nThe Republic of China is Taiwan‘s official name and dates back to the ROC government’s control of mainland China before it fled to the island at the end of China’s civil war.\nChina regards Taiwan as a renegade province to be brought back under its sovereignty by force, if necessary.\nTaiwan and China have tried to poach each other’s diplomatic allies ever since Taiwan‘s expulsion from the United Nations in 1971 to allow formal recognition of China.\nSEE ALSO: China rejects Taiwan’s offer to support democracy, says president has caused chaos\nThe cross-strait rivals have often engaged in “dollar diplomacy”, dangling generous aid packages in front of developing nations, although Taiwan has struggled to compete with an increasingly powerful China.\nPanama became the second country to switch its recognition to Beijing since Taiwan President Tsai Ing-wen took office last year, following Sao Tome and Principe last December, reducing the number Taiwan‘s diplomatic allies to 20.\nTaiwan had as many as 30 diplomatic allies in the mid-1990s. Its remaining formal ties are with mostly smaller and poorer nations in Latin America and the Pacific. – Reuters",
    "source_domain": "asiancorrespondent.com",
    "title": "China is moving to soften Taipei's representation in 5 countries",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/taiwan-china-moving-soften-taipeis-representation-5-countries/"
}