{
    "authors": [],
    "date_download": "2017-06-15 10:01:44+00:00",
    "date_modify": null,
    "date_publish": "2017-06-15 07:29:50",
    "description": "AN Australian journalist covering the conflict in Marawi City had a close brush with death when he was shot in the neck, Australian media reported on Thursday.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fphilippines-aussie-reporter-survives-bullet-neck-besieged-marawi%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/bullet.png",
    "language": "en",
    "localpath": null,
    "maintext": "An x-ray image of Adam Harvey's head shows a bullet lodged in his neck. Image via Twitter\n14 Social Buzz\nAN Australian journalist covering the conflict in Marawi City had a close brush with death when he was shot in the neck, Australian media reported on Thursday.\nAccording to broadcaster SBS, Adam Harvey, who is the Southeast Asia correspondent for the ABC was covering the Philippine military’s recovery operation in the besieged city when a bullet hit him.\nOver the last few days, Harvey had been reporting on the sweep up operations of Philippines’ military on positions held by Islamic State-linked Maute rebels.\nPhilippine Scout Rangers celebrate after taking an enemy position in Marawi. Four soldiers KIA pic.twitter.com/4pI4Mdiwmv — Adam Harvey (@adharves) June 14, 2017\n“I’m fine, I’m just going to get an X-ray to get it checked out,” the SBS quoted him as saying.\n“I just felt like something (inaudible) in the side of the neck, a piece of shrapnel.”\nSEE ALSO: Philippine security forces arrest Maute leader\nFootage on social media showed the helmet-wearing Harvey receiving medical attention with a neck brace.\nHarvey’s sister who is also a journalist, Claire Harvey, said her brother was doing ‘okay’.\nThanks everyone – I'm okay. Bullet is still in my neck, but it missed everything important. pic.twitter.com/PBYfdrTTa6 — Adam Harvey (@adharves) June 15, 2017\n“We thought it was shrapnel but it was a bullet that got him in the neck,” she told a local radio station.\n“There’s some suggestion it’s still in his neck.”\nThe Marawi clashes began on May 23 when Philippine forces staged a raid to arrest Isnilon Hapilon, a wanted leader of IS-linked Maute and the Abu Sayyaf terror network, following tip-offs on his hideout.\nSEE ALSO: Philippines: US troops on ground near besieged Marawi City – army\n290 people have been killed so far, including 206 militants, 58 soldiers and 26 civilians. The conflict has entered its 23rd day.\nAuthorities earlier said 100 militants remain in the besieged area, down from the 400 to 500 estimated number of fighters during the peak of the siege. An estimated 300 to 600 civilians are also said to be trapped or being held hostage in the city.",
    "source_domain": "asiancorrespondent.com",
    "title": "Philippines: Aussie reporter survives bullet to the neck in besieged Marawi",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/philippines-aussie-reporter-survives-bullet-neck-besieged-marawi/"
}