{
    "authors": [],
    "date_download": "2017-08-14 14:45:52+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 11:59:19",
    "description": "OVERREACTING to results and performances is part of being a football fan – and there is nothing quite like the overreaction to the opening weekend of Premier League games.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F08%2Fpremier-league-week-one-overreactions-manchester-united-bring-back-glory-days-chelsea-slip-crisis%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/08/LukakuManchester.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Romelu Lukaku celebrates the second of his two goals against West Ham United at Old Trafford on Sunday. Source: Andrew Yates\nOVERREACTING to results and performances is part of being a football fan – and there is nothing quite like the overreaction to the opening weekend of Premier League games.\nHaving waited all summer for the action to resume, too much can be read into the first round of matches, with conclusions swiftly being drawn about how a team’s entire season will pan out.\nWith 37 games to play, and two transfer deadlines still to come, plenty can – and will – change between now and May.\nSEE ALSO: Premier League preview: Can Pep Guardiola or Jose Mourinho bring the title back to Manchester?\nBut let’s allow ourselves to get carried away by what we saw at the weekend.\nLet’s completely and deliberately overreact to the first games of the season, as if they hold some greater long-term significance than merely being the first games of the season.\nThe glory days are back Manchester United\nAfter four seasons of relative poverty, in which United won five trophies but only once finished in the top four, Jose Mourinho has restored the glory days to Old Trafford.\nAnd, ever the miracle worker, he only had to spend around US$407 million (£314 million) in transfer fees to do it.\nSunday’s swaggering 4-0 win over West Ham United, in which Romelu Lukaku scored twice, underlined just how Mourinho has got United back to their best.\nWith title number 21 now within touching distance, it is merely a question of how Europe’s elite will be able to stop resurgent United this season.\n1 down 37 to go… pic.twitter.com/PZSnOaWTFX — Premier League (@premierleague) August 14, 2017\nLiverpool need a new defence – or they will miss out on the top four\nWhile Liverpool continue to resist Barcelona’s overtures for Philippe Coutinho, their problems remain at the other end of the field, where they conceded three goals against Watford.\nLiverpool’s potent front three of Sadio Mane, Roberto Firmino and Mohamed Salah all scored in a 3-3 draw at Vicarage Road, but the Reds defended corners as if they had first been introduced to the concept during the warm-up.\nIf they end up selling Coutinho, rather than seeking a like-for-like replacement who probably doesn’t exist anyway, they should buy a new defence, or they will not return to the Champions League next season.\nHuddersfield Town are the new Stoke City/Swansea City/Bournemouth\nDavid Wagner’s team have made a seamless transition to life in the Premier League, thrashing Crystal Palace 3-0 despite Selhurst Park being, to use football parlance, “a difficult place to go”.\nThe unglamorous promoted side demonstrated in 90 minutes at the weekend that they are ready to emulate the achievements of Stoke, Swansea and Bournemouth before them.\nThat means they will not only survive in the top division for multiple seasons, but carve out their own niche, despite being written off in pre-season.\nSEE ALSO: Football: Ranking the 25 greatest players to have graced the Premier League\nThe champions are in crisis\nAntonio Conte inherited a struggling Chelsea team and turned them into champions, and has now turned the champions into strugglers again.\nThe way in which Chelsea fell 3-0 down at home against Burnley was calamitous, and even the two goals they pulled back could not mask their glaring deficiencies.\nStarting 20-year-old Ivorian Jeremie Boga over US$78 million summer recruit Alvaro Morata was a peculiar move, but we didn’t even really get to assess Boga, as he was hauled off on 18 minutes following Gary Cahill’s red card.\nAt least four of Chelsea’s substitutes are not even household names in their own households, and the club’s lack of depth is startling.\nArsenal can’t defend – but that doesn’t matter\nWenger in. Wenger out. Wenger out (with additional fury). Wenger in. Wenger out (with even greater fury). Wenger in. Yes, definitely Wenger in.\nAnd so it went. And so it goes on.\nUntil Arsene Wenger delivers a fourth Premier League or maiden European title, every Arsenal game will provoke the same tired debate about the manager.\nFor now, though, Arsenal are off and running – and with Alexandre Lacazette hitting the ground running, with a goal within two minutes of his Premier League debut in the 4-3 win over Leicester City, their defensive frailties are largely inconsequential.\nWayne Rooney’s Everton homecoming is a glorious triumph\nEverton’s decision to bring Evertonian Rooney back to Goodison Park was vindicated as an enormous triumph as his 45th-minute goal was enough to beat Stoke.\nThe former Manchester United forward timed his run into the box to perfection, before heading past Jack Butland to prove Everton’s reasons for re-signing the 31-year-old were not merely sentimental.",
    "source_domain": "asiancorrespondent.com",
    "title": "Premier League week one overreactions: Manchester United bring back glory days as Chelsea slip into crisis",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/08/premier-league-week-one-overreactions-manchester-united-bring-back-glory-days-chelsea-slip-crisis/"
}