{
    "authors": [],
    "date_download": "2018-03-20 03:59:37+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 10:59:30",
    "description": "BARACK Obama has proved to be a hit while meeting with young leaders, entrepreneurs and the prime minister during his whistle-stop tour of Singapore on Monday.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F03%2Fsingapore-obama-woos-starstruck-crowds-on-asian-pacific-tour%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/03/Singapore-Obama-Lee.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Former US President Barack Obama met with Singapore Prime Minister Lee Hsien Loong as part of his Asia Pacific tour. March 19, 2018. Source: Facebook - Lee Hsien Loong\n9 Social Buzz\nBARACK Obama has proved to be a hit while meeting with young leaders, entrepreneurs and the prime minister during his whistle-stop tour of Singapore on Monday.\nThe stop was part of a weeklong tour that will also see the former US president stop in New Zealand, Australia and Japan.\nOn Monday, he attended an Obama Foundation discussion with young adults representing Southeast Asian nations. He then went on to give a speech, commissioned by the Bank of Singapore, as part of the Thought Leadership Series where he proved popular with the 1,000-member crowd of the private bank’s clients and guests from all around the world.\nIn Singapore with young people who are advocating for education, empowering young women, and getting involved all over Southeast Asia with a profoundly optimistic commitment to building the world they want to see. https://t.co/so4Uqouu8M — Barack Obama (@BarackObama) March 19, 2018\n“It’s, like, 10 times better than seeing a Korean pop star,” entrepreneur Delane Lim told the Straits Times.\n“The one thing I took away most was how he said we should have hope and how we should take action to make things happen,” trainee teacher Wong Zi Heng said after receiving a special invite to watch Obama speak.\nEarlier today, young leaders from across Southeast Asia joined President @BarackObama for a conversation on making a positive impact in their communities. Get to know the young leaders and their work to change the world: https://t.co/YImPUZZ9xb pic.twitter.com/MK6QlI1eJZ — The Obama Foundation (@ObamaFoundation) March 19, 2018\nEarlier in the day, he met with young leaders from across Southeast Asia to hear about the work they are doing in their communities, and to discuss how the Obama Foundation can support them to take their work to the next level.\nParticipants included Burmese MP Zin Mar Aung, education activists Kimsru Duth from Cambodia, Teach for the Philippines co-founder Clarissa Isabelle Delgado, and Malaysian environmental and poverty activist Ganesh Murrurti, who said on Twitter that he was “starstrucked” by the discussion with Obama.\nHeading out to enjoy the evening after being starstrucked by a discussion that was chaired by President @BarackObama himself. @ObamaFoundation is here to make waves. pic.twitter.com/HbZkHWbfA4 — Ganesh muren (@ganeshmuren) March 19, 2018\nThe president also met with Prime Minister Lee Hsien Loong, their first meeting since 2016.\nIn a Facebook post on Monday evening, Lee said it was “a pleasure catching up” and gave an insight into Obama’s life after the White House.\n“A lot has happened since we last met at APEC 2016 in Lima, so we had much to talk about. Happy to hear that he is busy working with his foundation and other charities,” the post read. “The best part about life after the presidency – more time with family and friends!”\nAccording to AP, Obama will spend Wednesday to Friday in New Zealand where he’ll meet with Prime Minister Jacinda Ardern and participate in separate moderated conversations hosted by the New Zealand-United States Council and his foundation.\nHe will then drop in to Sydney on Friday and Saturday to meet with Prime Minister Malcolm Turnbull.\nHe ends his trip in Tokyo on Sunday.",
    "source_domain": "asiancorrespondent.com",
    "title": "Obama woos 'starstruck' crowds on Asia Pacific tour",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/03/singapore-obama-woos-starstruck-crowds-on-asian-pacific-tour/"
}