{
    "authors": [],
    "date_download": "2017-06-15 10:01:55+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "JAPAN'S ruling bloc enacted a law targeting conspiracies to commit terrorism and other serious crimes on Thursday, pushing it through parliament's upper house despite concerns over civil liberties.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fjapan-govt-passes-anti-conspiracy-bill-despite-privacy-concerns%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-06-15T001306Z_860471496_RC19C25402D0_RTRMADP_3_JAPAN-POLITICS-CONSPIRACY.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Japan's Justice Minister Katsutoshi Kaneda (C) speaks to media after the conspiracy bill was passed at the upper house of parliament in Tokyo, Japan June 15, 2017. Pic: Kyodo via Reuters\n15 Social Buzz\nJAPAN’S ruling bloc enacted a law targeting conspiracies to commit terrorism and other serious crimes on Thursday, pushing it through parliament’s upper house despite concerns over civil liberties.\nThe vote followed opposition party delaying tactics, protests and concerns raised by a United Nations expert – who called the legislation “defective” – and came days before the current session of parliament was set to end on June 18.\nThe result of the vote on the bill, which has divided the public, was shown live on public broadcaster NHK.\nJapanese governments had tried three times previously to pass similar legislation, which officials say is needed to ratify a U.N. treaty aimed at global organised crime as well as to prevent terrorism as Tokyo prepares to host the 2020 Olympics.\nSEE ALSO: Japan: Parliament passes Bill allowing emperor’s abdication\nThe legislation would criminalise plotting and preparing to commit 277 “serious crimes” that critics such as the Japan Federation of Bar Associations note include acts with no obvious connection to terrorism or organised crime, such as sit-ins to protest construction of apartment buildings or copying music.\nOpponents see the legislation as part of a broader agenda by Prime Minister Shinzo Abe to increase state powers and fear ordinary citizens could be targeted, despite government assurances to the contrary.\nCombined with a widening of legal wiretapping and the reluctance of courts to limit police surveillance powers, the changes could deter grassroots opposition to government policies, critics say.\nTo try to speed up passage of the law, the ruling bloc took the rare, contentious step of skipping a vote in an upper house committee and moving directly to a vote in the full upper house.\nThe U.N. special rapporteur on the right to privacy, Joseph Cannataci, wrote to Abe last month asking him to address the risk that the changes could “lead to undue restrictions to the rights to privacy and to freedom of expression”.\nSEE ALSO: Japan’s PM Abe eyes legacy with proposed change to pacifist constitution\nIn an email to Reuters, Cannataci said the Japanese government had used “the psychology of fear” to push through “defective legislation”.\n“Japan needs to improve its safeguards for privacy, now even more so that this supsicious piece of legislation has been put on the statute books,” he said in the email.\nCritics say gathering information on possible plots would require expanded police surveillance, and the legislation has been compared to Japan‘s “thought police”, who before and during World War Two had broad powers to investigate political groups seen as a threat to public order.\nA Kyodo news agency survey last month showed voters are split over the bill, with support at 39.9 percent and opposition at 41.4 percent. – Reuters",
    "source_domain": "asiancorrespondent.com",
    "title": "Japan: Govt passes anti-conspiracy bill despite privacy concerns",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/japan-govt-passes-anti-conspiracy-bill-despite-privacy-concerns/"
}