{
    "authors": [],
    "date_download": "2017-10-06 14:40:03+00:00",
    "date_modify": null,
    "date_publish": "2017-09-20 00:00:00",
    "description": "THE Cambodia government filed a lawsuit to the Supreme Court on Friday demanding the opposition party be dissolved ahead of next year’s crucial national elections.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F10%2Fcambodia-opposition-party%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/09/2017-09-11T030803Z_907670524_RC1C80869430_RTRMADP_3_CAMBODIA-POLITICS-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hun Sen attends a ceremony to mark the 65th anniversary of the establishment of the party in Phnom Penh, on June 28, 2016. Source: Reuters/Samrang Pring\n33 Social Buzz\nTHE Cambodia government filed a lawsuit to the Supreme Court on Friday demanding the opposition party be dissolved ahead of next year’s crucial national elections.\nAccording to the Phnom Penh Post, Interior Ministry spokesman Khieu Sopheak confirmed that a party lawyer had taken the next step towards putting an end to the Cambodia National Rescue Party (CNRP), the country’s main opposition party.\n“Lawyer Ky Tech has filed the complaints to the Supreme Court and the complaints are to dissolve the CNRP,” he said.\nLawyers for the government said the opposition had conspired with foreigners to topple the government, citing a 2013 video clip that shows CNRP leader Kem Sokha talking about a plan to take power with the help of Americans. Kem Sokha has since been arrested and has been in detention for over a month on charges of treason.\nSEE ALSO: 5 signs of Cambodia’s ‘descent into outright dictatorship’\nSopheak claimed the ministry completed a thorough investigation into these accusations against the CNRP, leading them to take action.\n“Ky Tech and the other five lawyers have enough documents, and what I know is that they have at least 21 pieces of evidence,” he said.\n“The Ministry of Interior has done an investigation and has all the documents and gave them to the lawyer to take action, complying with the procedure.”\nDissolution of the CNRP is possible due tp controversial amendments to the Law on Political Parties, that prohibit people with criminal convictions from holding leadership positions within the party, forbid parties from conspiring with criminals, or from undermining national security – a vague term whose scope legal analysts have said is problematic.\nSEE ALSO: Cambodian opposition calls for sanctions against Hun Sen government\nIt is this same law that forced former CNRP leader Sam Rainsy to step down in February. He has since gone into exile in France fearing arrest on outstanding charges of defamation towards the government.\nFriday’s action to dissolve the CNRP is the latest in a long line of moves to quash the opposition before next year’s election.\nThe CNRP vice-president Mu Sochua, who fled the country this week in fear of arrest, called on Western donors to impose targeted sanctions on Prime Minister Hun Sen’s government in the interests of saving democracy in the increasingly authoritarian country.\n“The time for statements has passed. It’s time for sanctions, targeted sanctions. Also, suspension of technical aid to the government of Cambodia,” she said. “Time is up for democracy. How long can the international community wait?”\nThe government has repeatedly threatened opposition members with arrest, and Hun Sen has warned of civil war if his Cambodia People’s Party (CPP) lose an election.",
    "source_domain": "asiancorrespondent.com",
    "title": "Cambodian government files lawsuit to dissolve main opposition party",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/10/cambodia-opposition-party/"
}