{
    "authors": [],
    "date_download": "2018-07-04 14:53:52+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 10:37:40",
    "description": "US President Donald Trump has lashed out at critics of his diplomatic efforts with North Korea claiming he is responsible for averting war, despite reports that Pyongyang has increased nuclear production since their agreement to denuclearise.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F07%2Fif-not-for-me-wed-be-at-war-trump-lashes-out-at-critics-of-north-korea-talks%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/07/2018-07-04T004527Z_1364105279_RC1BA0884DA0_RTRMADP_3_USA-TRUMP.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "U.S. President Donald Trump delivers remarks at a \"Salute to Service\" dinner held in honor of the nation's military at The Greenbrier in White Sulphur Springs, West Virginia, U.S., July 3, 2018. Source: Reuters/Leah Millis\nUS President Donald Trump has lashed out at critics of his diplomatic efforts with North Korea claiming he is responsible for averting war, despite reports that Pyongyang has increased nuclear production since their agreement to denuclearise.\nTrump took to Twitter to claim Tuesday that talks with North Korea were progressing “well,” citing the lack of weapons tests as a sign of the talk’s success.\n“Many good conversations with North Korea-it is going well!” he tweeted. “In the meantime, no Rocket Launches or Nuclear Testing in 8 months.\n“All of Asia is thrilled. Only the Opposition Party, which includes the Fake News, is complaining. If not for me, we would now be at War with North Korea!”\nMany good conversations with North Korea-it is going well! In the meantime, no Rocket Launches or Nuclear Testing in 8 months. All of Asia is thrilled. Only the Opposition Party, which includes the Fake News, is complaining. If not for me, we would now be at War with North Korea! — Donald J. Trump (@realDonaldTrump) July 3, 2018\nHis remarks come three days after US intelligence agencies told NBC they believe North Korea has increased its production of fuel for nuclear weapons at multiple secret sites in recent months. They also claim North Korean leader Kim Jong Un may try to hide those facilities as he seeks more concessions in nuclear talks with the Trump administration.\nThe contact between the two former enemies follows on from a vague agreement reached following the historic Singapore summit in June.\nCentral to the agreement was a commitment to “complete denuclearisation” of the Korean peninsula. The pledge did not, however, include any indication of timeline or how and if denuclearisation would be verified.\nSEE ALSO: North Korea continues upgrade of nuclear reactor despite summit pledges\nThe job of hashing out the details of the arrangement have been left to Trump’s team, including Secretary of State Mike Pompeo who is due to arrive in North Korea on Thursday.\nTrump has boasted that the agreement has ended the decades-long feud and ensured North Korea is “no longer a Nuclear Threat” despite his own administration acknowledging “an unusual and extraordinary threat” from Pyongyang’s nuclear arsenal to extend decade-long sanctions.\nJust landed – a long trip, but everybody can now feel much safer than the day I took office. There is no longer a Nuclear Threat from North Korea. Meeting with Kim Jong Un was an interesting and very positive experience. North Korea has great potential for the future! — Donald J. Trump (@realDonaldTrump) June 13, 2018\nOn top of evidence from US intelligence agencies, North Korea monitoring group 38 North found Pyongyang is pushing forward with improvements to the only known nuclear reactor used to fuel its weapons programme.\nSatellite imagery taken nine days after the Singapore summit show the rapid pace of improvements being made to the Yongbyon Nuclear Scientific Research Centre.\nDespite the continued activity, 38 North stress this shouU.S. President Donald Trump delivers remarks at a “Salute to Service” dinner held in honor of the nation’s military at The Greenbrier in White Sulphur Springs, West Virginia, U.S., July 3, 2018. REUTERS/Leah Millisld not be given as an indication of leader Kim Jong Un’s willingness to denuclearise.\nSEE ALSO: Hotline Kim: Trump says he has given a direct phone line to North Korea\n“The North’s nuclear cadre can be expected to proceed with business as usual until specific orders are issued from Pyongyang,” the report said.\nBut former CIA analyst and North Korea expert at the Heritage Foundation, Bruce Klingner, disagrees and sees the continued expansion as inconsistent with the North’s promises.\n“The observed activity appears inconsistent with a North Korean intent to abandon its nuclear weapons programs,” he told NBC.\n“There seems little reason to continue expansion plans if the regime intended to dismantle them as would be required under a denuclearisation agreement.”",
    "source_domain": "asiancorrespondent.com",
    "title": "‘If not for me, we’d be at war’: Trump lashes out at critics of North Korea talks",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/07/if-not-for-me-wed-be-at-war-trump-lashes-out-at-critics-of-north-korea-talks/"
}