{
    "authors": [],
    "date_download": "2018-04-25 02:08:59+00:00",
    "date_modify": null,
    "date_publish": "2018-04-20 00:00:00",
    "description": "ENGLISH Championship soccer team Leeds United will visit Burma for their post-season tour next month despite an army crackdown and accusations of \"ethnic cleansing\" occurring in some areas of the country.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F04%2Fleeds-united-to-tour-burma-despite-military-crackdown%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/04/2018-04-21T143950Z_2113854401_RC193EB628E0_RTRMADP_3_SOCCER-ENGLAND-LEE-BRS.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Leeds United's Tom Pearce celebrates scoring their first goal with team mates against Barnsley on April 21, 2018. Source: Action Images/Craig Brough\nENGLISH Championship soccer team Leeds United will visit Burma (Myanmar) for their post-season tour next month despite an army crackdown and accusations of “ethnic cleansing” occurring in some areas of the country.\nFormer English champions Leeds are scheduled to play the Burma national team on May 9 and will take on the National League’s all-stars in a second friendly two days later.\nThe British government has advised citizens against “all but essential travel” to affected areas in the states of Rakhine, Chin, Shan, and Kachin, but the Foreign Office has not stopped travel to the rest of the country.\nLast week we supported @AmnestyUK over refugee contribution to football. Now a proposed tour to a country involved in ethnic cleansing and mass refugees. My club #LUFC needs to get a grip! — Michael David Rix (@RixyieOrganiser) April 24, 2018\nThe second-tier side will also conduct football clinics with Myanmar Football Federation academies in Yangon and Mandalay and visit cultural sites including Shwedagon Pagoda and the Maha Myat Muni Pagoda, the Yorkshire club said in a statement.\n“Myanmar is one of the fastest-growing nations in southeast Asia and is passionate about English football,” said Leeds managing director Angus Kinnear.\n“They have ambitious goals for grass-roots and elite football development that we’re delighted to be able to support. This tour gives us an opportunity to meet new fans who will hopefully support our journey back to the Premier League.”\nSEE ALSO: In photos: Pulitzer Prize winner documents exodus of Rohingya refugees\nA statement from the Leeds United Supporters’ Trust said the tour was “a strange and controversial choice, given the dangerous political climate Myanmar currently finds itself in”, but welcomed reassurances from the club about the safety of travelling fans.\n🇲🇲 | Leeds United are delighted to announce the #AYABankTour18, featuring two friendly matches in Myanmar More info ➡️ https://t.co/lmCtLZrk2X pic.twitter.com/FTQRJGYqp7 — Leeds United (@LUFC) April 24, 2018\nThe United Nations and rights groups say nearly 700,000 Rohingya Muslims have fled to Bangladesh since a military operation in Rakhine state began in August. The military continues to deny allegations of genocide and ethnic cleansing, claiming it is staging a legitimate crackdown against terrorist groups.\nA statement from Amnesty International UK director Kate Allen said: “Far too often sporting events have been used as a cheap PR tool to ‘sportswash’ the stain of a country’s human rights record.”\nStopping short of telling the team not to go, Allen said they should use the visit “to call for an end to the crackdown and raise with the Burmese authorities the plight of the hundreds of thousands of families who have been brutalised and forced to flee their homes.”\nI’ve written to @LUFC expressing my anger at their decision to hold a post-season tour in Myanmar. No UK club or organisation should promote a country which carries out state sponsored mass murder. They must rethink it, history will judge them to be on the wrong side of this. pic.twitter.com/BXzsxvpEjR — Dr Rosena Allin-Khan (@DrRosena) April 24, 2018\nBritain’s opposition Labour Party’s Shadow Minister for Sport, Rosena Allin-Khan, said on her official Twitter account that she had written to Leeds urging the club to cancel the planned tour.\n“It is morally corrupt for a football team to partake in a post-season tour to promote a country which carries out state-sponsored mass murder,” she wrote in the letter.",
    "source_domain": "asiancorrespondent.com",
    "title": "Leeds United to tour Burma despite military crackdown",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/04/leeds-united-to-tour-burma-despite-military-crackdown/"
}