{
    "authors": [],
    "date_download": "2018-04-25 02:09:02+00:00",
    "date_modify": null,
    "date_publish": "2018-04-20 00:00:00",
    "description": "AHEAD of a summit slated for May or June, US President Donald Trump has praised North Korea’s leader Kim Jong Un as “very honourable” and said discussions about a meeting were going well.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2018%2F04%2Ftrump-calls-north-koreas-kim-very-honourable%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2018/04/2018-04-25T012427Z_1415234234_RC19F2AC50B0_RTRMADP_3_USA-FRANCE.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "US President Donald Trump toasts French President Emmanuel Macron (not pictured) during a State Dinner at the White House in Washington, US April 24, 2018. Source: Reuters/Carlos Barria\nAHEAD of a summit slated for May or June, US President Donald Trump has praised North Korea’s leader Kim Jong Un as “very honourable” and said discussions about a meeting were going well.\nTrump told reporters during a meeting with French President Emmanuel Macron at the White House that North Korea had said it wanted to hold the summit “as soon as possible”. “We’re having very good discussions,” he said as quoted by Bloomberg, adding that the talks were likely to take place “very soon”.\n“Kim Jong Un — he really has been very open and I think very honourable from everything we’re seeing.” Nevertheless, the “campaign of maximum pressure” would continue, Trump said.\nThe comments mark a change in tone from the US President, who has previously mocked Kim as “Little Rocket Man” and warned that the North Korean regime will meet with “fire and fury” if it continues to threaten the United States.\nSEE ALSO: The Trump-Kim summit is no certainty: Will they or won’t they?\nOn Tuesday, Trump said he hoped dealings with North Korea would be positive, but he wanted to see the country’s complete denuclearisation. Asked at a news conference, what he meant by this, he replied: “It means they get rid of their nukes. Very simple … it would be very easy for me to make a simple deal and claim victory. I don’t want to do that. I want them to get rid of their nukes.”\nUS officials recently said that incumbent Secretary of State Mike Pompeo, who was then-Director of the powerful Central Intelligence Agency (CIA), at Easter time made a top secret visit to North Korea to meet with Kim in order to discuss the potential of a summit.\nSouth Korean President Moon Jae-in, who is due to meet Kim in a summit on Thursday, said last week that North Korea had expressed a commitment to “complete denuclearisation” of the Korean peninsula, and Pyongyang said on Saturday it would immediately suspend nuclear and missile tests.\nMany experts have, however, expressed doubt that Kim will be willing to abandon a weapons program he sees as essential to the survival of his ruling family dynasty.\nAdditional reporting from Reuters.",
    "source_domain": "asiancorrespondent.com",
    "title": "Trump calls North Korea’s Kim ‘very honourable’",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2018/04/trump-calls-north-koreas-kim-very-honourable/"
}