{
    "authors": [],
    "date_download": "2017-06-15 10:01:51+00:00",
    "date_modify": null,
    "date_publish": "2017-06-20 00:00:00",
    "description": "PRIME MINISTER Nawaz Sharif appeared before a panel investigating his family's wealth on Thursday, the first time a Pakistani prime minister has been grilled by an investigative agency.",
    "filename": "https%3A%2F%2Fasiancorrespondent.com%2F2017%2F06%2Fpakistan-pm-appears-panel-probing-familys-wealth%2F.json",
    "image_url": "https://cdn.asiancorrespondent.com/wp-content/uploads/2017/06/2017-06-12T091920Z_131842918_RC1151E6A8F0_RTRMADP_3_PAKISTAN-POLITICS.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pakistani Prime Minister Nawaz Sharif looks out the window of his plane after attending a ceremony to inaugurate the M9 motorway between Karachi and Hyderabad, Pakistan February 3, 2017. Pic: Reuters\nPRIME MINISTER Nawaz Sharif appeared before a panel investigating his family’s wealth on Thursday, the first time a Pakistani prime minister has been grilled by an investigative agency.\nThe scrutiny of Sharif has gripped Pakistan, but the investigation – ordered by the Supreme Court – has become increasingly politicised.\nSharif arrived at the Joint Investigation Team (JIT) in Islamabad clad in traditional shalwar kameez tunic and baggy trousers, but did not speak to media.\nIt was not clear how long the hearing, which had been scheduled to begin at 11 a.m. (0600 GMT), would last.\nSEE ALSO: US says China may park future military base in Pakistan\nThe prime minister and his children deny any wrongdoing.\nThe Supreme Court ruled in April there was insufficient evidence to remove Sharif from office over corruption allegations levelled by the opposition, but it ordered further investigations.\nThe Supreme Court agreed last year to investigate the Sharif family’s offshore wealth after the opposition threatened protests after the leaking of the “Panama Papers”.\nDocuments leaked from the Panama-based Mossack Fonseca law firm appeared to show that Sharif’s daughter and two sons owned offshore holding companies registered in the British Virgin Islands and used them to buy properties in London.\nSharif, whose father was a prominent industrialist, has said his family wealth was acquired legally.\nA three-time prime minister, Sharif was ousted twice in the 1990s, including in a 1999 military coup. He later lived in exile, mostly in Saudi Arabia.\nHe swept back to power in an election in 2013.\nHis spokesman did not respond to requests for comment.\nPakistan has been plagued by corruption for decades, with politicians often accusing rivals of graft.\nThe Supreme Court has given the panel two months to investigate the family and then deliver its findings.\nThe six-man panel, made up of members of civilian investigative agencies and military intelligence officers, are examining three generations of Sharif family wealth.\nSEE ALSO: Pakistan signs nearly $500m in China deals at Silk Road summit\nThe team has accused government departments of tampering with old records, but Finance Minister Ishaq Dar on Wednesday rejected such allegations, adding that the team’s claims meant the process was becoming “suspicious”, media reported.\nSharif’s camp has sought to remove two members of the investigation team and his rulingPakistan Muslim League-Nawaz (PML-N) party voiced outrage over a leaked photograph taken from security camera footage showing Sharif’s son, Hussain, appearing before the panel.\nOpinion polls suggest Sharif’s party is likely to win the next election, due next year.\nA senior PML-N official told Reuters the party was unlikely to call an early election if Sharif was ousted by a Supreme Court ruling, and would select a new prime minister to take over until the general election. – Reuters",
    "source_domain": "asiancorrespondent.com",
    "title": "PM appears before panel probing family's wealth",
    "title_page": null,
    "title_rss": null,
    "url": "https://asiancorrespondent.com/2017/06/pakistan-pm-appears-panel-probing-familys-wealth/"
}