{
    "authors": [
        "Rika Christensen"
    ],
    "date_download": "2017-08-14 23:10:03+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 17:29:50",
    "description": "Finally, someone said it!",
    "filename": "http%3A%2F%2Faddictinginfo.com%2F2017%2F08%2F14%2Fcnn-reporter-just-asked-trump-the-one-question-weve-all-wanted-to-hear-video%2F.json",
    "image_url": "http://addictinginfo.addictinginfoent.netdna-cdn.com/wp-content/uploads/2017/08/Trump-Presser.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CNN’s Jim Acosta is not especially well-liked by the White House. He tells it like it is in harsh, blunt terms, and of course, they don’t like that. The growing feud continued today when Trump gave a supposed press conference after a full weekend of promising a big press conference. But at a true press conference, reporters are able to ask questions. Donald Trump wouldn’t allow questions at this “press conference.” Acosta wanted to ask him about his responses to Charlottesville, because Trump’s initial response to it was weak and pathetic, and one in which he wouldn’t condemn the Nazis and other white supremacists, and puffed himself up rather than saying something heartfelt and inspirational like a real president would have.\nGetting no answer to that, Acosta asked him about the lack of a proper presser. Trump said that they’d just had one. Apparently, in Trumpland, an egotistical speech that barely touches on anything and doesn’t allow for questions from reporters qualifies as a press conference simply because the press is there. Trump’s reply to Acosta?\n“It doesn’t bother me at all, but I like real news, not fake news. You’re fake news.”\nIt’s absolutely amazing that Trump calls anyone “fake news” when he’s essentially the liar of liars who’s spread more than his fair share of fake news. Acosta knows this, and threw a question at Trump that we’ve all wanted to hear in response to the latest “fake news” accusation. Watch below:\nCNN’s @Acosta to Trump: Can we ask you more questions?\nTrump: “I like real news, not fake news. You’re fake news.” https://t.co/m4KiTC6lrK — CNN (@CNN) August 14, 2017\nTrump went into full toddler mode and took his ball and went home without another word.\nIt’s all part of a pattern with him – if it’s good, he claims credit for it and hypes it up, even if he couldn’t possibly have had anything to do with it. If it’s bad, it’s “fake news,” “fake polls,” etc., and it’s high time someone confronted him about it.\nSometimes, it seems as if Acosta is the only one willing to do so. But our illegitimate president doesn’t like looking bad, let alone doing the right thing.\nFeatured image via video screen capture",
    "source_domain": "addictinginfo.com",
    "title": "CNN Reporter Just Asked Trump The One Question We’ve All Wanted To Hear (VIDEO)",
    "title_page": null,
    "title_rss": null,
    "url": "http://addictinginfo.com/2017/08/14/cnn-reporter-just-asked-trump-the-one-question-weve-all-wanted-to-hear-video/"
}