{
    "authors": [
        "Lizzy Buczak"
    ],
    "date_download": "2017-02-15 16:30:33+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "He comes with his own drum-set!",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F02%2F15%2Fmeet-logan-american-girls-very-first-boy-doll%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/02/screen-shot-2017-02-15-at-9-50-51-am.png?w=420",
    "language": "en",
    "localpath": null,
    "maintext": "It’s a boy!\nAmerican Girl just announced their first male doll – a first in the brands 31-year-history.\nThe boy is named Logan Everett and rocks brown hair, a hipster tee and dark jeans.\nHe also plays drums in a band for another new doll, Nashville songwriter Tenney Grant.\n“A boy character has been a top request from our fans for decades,” Julie Parks, a spokesperson for American Girl, told ABC News. “We do an enormous amount of research with girls and their parents, and the one thing we’ve heard loud and clear is a desire for more — specifically more characters and stories from today — with more experiences, more diversity, and more interests.”\nMany customers shared their frustration over the addition of a boy doll and criticized the brand for losing what made the dolls original – the historically accurate clothing and backstory.\nMattel said they will continue offering historical character but felt a huge need to include a doll of a different gender.\nOther dolls being added in 2017 include Gabriela McBride, an African-American who loves spoken poetry because it helps her overcome a stutter, Z Yang a Korean-American filmmaker, an historical Hawaiian character Nanea.\nWhat are your thoughts on the latest addition? Are you Team Logan?\nHere’s a quick look at Twitter’s thoughts:\nAMERICAN GIRL JUST CAME OUT WITH A BOY DOLL THIS IS SO CUTE I LOVE BREAKING GENDER STEREOTYPES pic.twitter.com/VzLQRPVu6h — tess (@commonIove) February 14, 2017\nThe new American Girl boy doll looks like he would say \"I'm really into rap,\" but the only rapper he actually listens to is G-Eazy. pic.twitter.com/EBzQQkg3Zc — Trevor Jones (@jonestm97) February 15, 2017",
    "source_domain": "b96.cbslocal.com",
    "title": "Meet Logan, American Girl’s Very First Boy Doll!",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/02/15/meet-logan-american-girls-very-first-boy-doll/"
}