{
    "authors": [],
    "date_download": "2017-02-15 00:10:43+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 00:00:00",
    "description": "It's an authorized documentary so getting music rights and cooperation from Biggie's estate won't be too challenging for producers.",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F02%2F14%2Fauthorized-notorious-b-i-g-documentary%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/02/biggie1.jpg?w=770",
    "language": "en",
    "localpath": null,
    "maintext": "By Hayden Wright\nThe mid-’90s East Coast-West Coast hip-hop battles have been the source of a number of films and documentaries. This year, there’s All Eyez On Me, the forthcoming Tupac biopic. Johnny Depp is attached to Labyrinth, a movie about The Notorious B.I.G. and Tupac’s murder investigations. Biggie got his own movie, Notorious, in 2009, and a new documentary is in development: Notorious B.I.G.: One More Chance will be produced by Submarine and ByStorm Films, and will stick closely to his music and its impact around the world.\nRelated: Stream Two New Duets from the Notorious B.I.G. and Faith Evans Album\nNotorious B.I.G.: One More Chance was announced yesterday at the Berlin Film Festival, and it’s an authorized documentary so getting music rights and cooperation from Biggie’s estate won’t be too challenging for producers. The rapper’s mother Voletta Wallace expressed her excitement about the project.\n“It brings so much joy to my heart that my son Christopher’s music has made such an impact on the music community and his stories have positively inspired so many young men and women over the years, and still influencing the youth all over the world today,” Wallace said.",
    "source_domain": "b96.cbslocal.com",
    "title": "Authorized Notorious B.I.G. Documentary is in Development",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/02/14/authorized-notorious-b-i-g-documentary/"
}