{
    "authors": [],
    "date_download": "2017-04-17 16:27:14+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "\"The most offensive place I have ever stayed at in my life with staff who pick and choose who they are going to accommodate based on racial profiling.\"",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F04%2F17%2Fdrake-coachella-madison-club-racial-profiling%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/04/drake-coachella-yellow-jacket.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Annie Reuter\nUpdate: Drake has deleted his Instagram post.\nDrake surprised the crowd at Coachella this past weekend when he joined Future for a three-song performance of “Jumpman,” “Gyalchester” and “Fake Love” and while he looked like he had a blast on stage, the rapper revealed that he had a much less enjoyable experience when he was racially profiled during his stay at the Madison Club.\nRelated: Drake, Migos Joins Future on Stage at Coachella\nWhile the club is described as “the most exclusive private residential community in La Quinta, California offering the finest golf and club facilities in an intimate and sophisticated setting,” it seems that Drizzy didn’t enjoy all of the amenities the joint has to offer. After his visit to the establishment, Drake slammed the Madison Club on social media.\n“The most offensive place I have ever stayed at in my life with staff who pick and choose who they are going to accommodate based on racial profiling,” he captions an image of the club.\nDrake’s fans had his back and quickly began posting one-star ratings to the Madison Club on Yelp. If the country club didn’t know who Drake was while he was staying there, they do now.",
    "source_domain": "b96.cbslocal.com",
    "title": "Drake Blasts Coachella’s ‘Madison’ Country Club for Racial Profiling",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/04/17/drake-coachella-madison-club-racial-profiling/"
}