{
    "authors": [
        "Lizzy Buczak"
    ],
    "date_download": "2017-02-15 16:30:06+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "Starbucks - your one stop shop for coffee, breakfast sandwiches and ice cream!",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F02%2F15%2Fomg-starbucks-will-start-serving-ice-cream-coffee-concoction%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/02/roastery_ice_cream_affogato-2.jpg?w=1500",
    "language": "en",
    "localpath": null,
    "maintext": "How is this not a thing yet?\nStarbucks announced that it will be bringing ice cream to over 100 stores in Chicago, Boston, Los Angeles, Maryland and Washington, D.C starting February 15.\nAnd we’re not just talking a scoop of vanilla that you’d get at Dunkin Donuts.\nThe chain is going the extra mile and serving up ice cream based affogatos, cold-brew malts and cold-brew floats.\nFor those who aren’t familiar with the Italian dessert, an affogato is hot espresso poured over vanilla ice cream, which melts the ice-cream, marrying the creamy and coffee flavors into one delicious treat.\nThe ice cream will come from a small-batch, artisan ice-cream maker, Mora Iced Creamery.\nTODAY reports that the treat will cost you somewhere between $5.25 and $6.\nHere’s a bit more detail on each delicious coffee/ice cream mashup.\n• Classic Affogato (5.5 ounces, $6): Two shots of our Reserve small-lot espresso poured over vanilla ice cream\n• House Affogato (6 ounces, $6.50): Two shots of our Reserve small-lot espresso with a touch of demerara syrup poured over vanilla ice cream and dusted with cinnamon\n• Cold Brew Float (12 or 16 ounces, $7.50 or $8): Our Reserve small-lot cold brew with a generous scoop of vanilla ice cream. With nitro, $8.50 or $9\n• Cold Brew Malt (12 ounces, $8.50): An ultra-thick spindle-blended malted milkshake with our Reserve small-lot cold brew, vanilla ice cream and chocolate bitters",
    "source_domain": "b96.cbslocal.com",
    "title": "OMG! Starbucks Will Start Serving Ice Cream & Coffee Concoction",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/02/15/omg-starbucks-will-start-serving-ice-cream-coffee-concoction/"
}