{
    "authors": [
        "Rebecca Ortiz"
    ],
    "date_download": "2017-01-02 17:51:58+00:00",
    "date_modify": null,
    "date_publish": "2017-01-01 00:00:00",
    "description": "By now most people have seen Mariah Carey's performance mishap from New Year's Rockin Eve ~ but Mimi's camp is calling sabotage! Find out why here!",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F01%2F02%2Fmariahs-team-screams-sabotage-over-nye-debacle%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/01/0101-mariah-carey-new-years-eve-getty-4.jpg?w=718",
    "language": "en",
    "localpath": null,
    "maintext": "By now, most of you have seen Mariah Carey’s New Year’s Rockin Eve mess ~ but her team is calling sabotage!\nSay what?\nYES! MC’s camp said that Mariah’s ear piece was having issues in rehearsal/sound check and that they told the Dick Clark Production team about it several times and they assured them it would be fixed for the big show – and clearly it wasn’t! They say they did it on purpose (didn’t fix her ear piece) to ‘sabotage her’ to get ratings!\nDCP claps back admitting to the ear piece problems but saying to accuse them of intentionally trying to set Mimi up is “defamatory” (anyone smell a lawsuit?)! They do say that she should’ve “pushed thru” the performance. Live TV = Wing it.\nA source close to Mariah said that DCP BEGGED her to perform and she did it as a favor (as in she wasn’t paid). They say:\nWe could be in Aspen right now having the best time instead of being in dog s*** Times Square that smelled like a f****** sewer.\nYikes!\nI mean let’s be honest, however it happened it did and the more rocks that get thrown the more it will not go away.\nI think it’s safe to say we know where Mariah WON’T be next year LOL",
    "source_domain": "b96.cbslocal.com",
    "title": "Mariah’s Team Screams “SABOTAGE” Over NYE Debacle",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/01/02/mariahs-team-screams-sabotage-over-nye-debacle/"
}