{
    "authors": [],
    "date_download": "2017-04-18 00:23:33+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Brown has yet to publicly comment on the incident.",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F04%2F17%2Fchris-brown-accused-of-punching-club-photographer%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/04/chris-brown-rainbow-hair.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Radio.com Staff\nChris Brown has been accused of punching a photographer during an incident at the Tampa nightclub AJA Channelside early this morning.\nRelated: Chris Brown Responds to Addiction and Anger Issues Claims\nThe Tampa Police Department provided the following statement regarding the incident:\nDuring an after party event, Mr. Brown and his crew came into the club for a ‘showing’ for which he was paid. Mr. [Benny] Vines is a photographer for Club Aja. As he was taking photos, Vines reported Mr. Brown ‘sucker punched’ him for allegedly taking photos. By the time officers were contacted and arrived, Mr. Brown left the scene. Mr. Vines wishes to prosecute for a minor laceration to his lip. Medical attention was refused. Investigation continues.\nA statement posted to AJA Channelside’s official Facebook page reads:\nIncidents like the ones caused by Chris Brown and his team are very sad to see. As everyone witnessed he showed up to the club at around 1:30am. After only a few minutes of being there, Chris Brown himself and his team assaulted our club photographer and proceeded to walk out of the venue. AJA Channelside and our employees apologize for the inconvenience. Assault charges were pressed and we are dealing with the proper authorities accordingly. We appreciate your constant support!\nBrown has yet to respond publicly to the allegations.",
    "source_domain": "b96.cbslocal.com",
    "title": "Chris Brown Accused of Punching Club Photographer",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/04/17/chris-brown-accused-of-punching-club-photographer/"
}