{
    "authors": [],
    "date_download": "2017-04-17 16:27:22+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "Sheeran spoke to his dying fan Triona Priestly for a moment and said that he heard her favorite song was \"Little Bird.\" Then he played the tune in its entirety for her.",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F04%2F17%2Fed-sheeran-plays-dying-teen-little-bird%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/04/ed-sheeran-phil-walter-getty-946.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Annie Reuter\nEd Sheeran is well known for his chart-topping hits but the singer/songwriter also has a heart of gold. During a recent episode of Ireland’s The Ray D’Arcy Show, one young man told a story about how the singer granted his sister her dying wish.\nRelated: Ed Sheeran Shoots ‘Galway Girl’ Music Video in Galway\nSheeran fan Triona Priestly lost a long battle with cystic fibrosis in 2014 and her brother, Aiden, recently recounted her final moments and the happiness Sheeran brought her.\n“We were in this small little ICU room,” he recalled. “Triona in this huge bed covered in tubes and machines. My brother left the room. He returned then and said, ‘I’m just going to put you on loud speaker,’ and he clicks it, then Ed Sheeran comes on and saying, ‘Hi Triona. I hear you’re a big fan.’”\nSheeran spoke to Triona for a moment and said that he heard her favorite song was “Little Bird.” Then he played the tune in its entirety for her.\n“Then we hang up on him, probably a bit rude at the time, and the doctor lifts the stethoscope to tell us her heart had stopped. And we take the mask off because she’d been on a machine to breathe—and in that moment, I remember, a burst of light comes from the window and she smiled,” he added.\nSheeran first learned about Triona’s struggle when fans launched a Twitter campaign #SongForTri. When he heard she had died Sheeran paid tribute to Triona.\nAidan Priestley on @edsheeran's amazing act of kindness to his late sister Triona in her last moments. #RayDarcy https://t.co/RWh3ggQYl6 —\nThe Ray D'Arcy Show (@RTERayDarcyShow) April 15, 2017",
    "source_domain": "b96.cbslocal.com",
    "title": "Ed Sheeran’s Voice is Last Thing Dying Teen Hears",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/04/17/ed-sheeran-plays-dying-teen-little-bird/"
}