{
    "authors": [],
    "date_download": "2017-06-14 19:32:37+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "This video is VERY cute.",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F06%2F14%2Ftoddler-learns-about-breast-feeding%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/06/toddler.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "Introducing a toddler to their new baby sibling isn’t always easy, but in this case, it was hilarious.\nAva, 22 months, came into the room while her mom Ali Lukitsch, a teacher from Trenton, Mich., was feeding her new baby sister Hannah. The tot wasn’t quite sure what was going on. First, she told little sister “no biting,” and Mom had to explain what she was doing and that she was getting milk.\nThat’s when Ava wanted to know “where the chocolate milk” at!”\nFrom the mouths of babes…\nThe video, shot by Ali’s sister Stephanie Legut, has been shared thousands of times on social media and new mom Ali — who just gave birth to Hannah on Sunday — says she can hardly believe the reaction. “My husband was just asking how I feel about so many people seeing me and I’m just so focused on Ava … That’s just her, in a nutshell, every day, Ali told 98.7 AMP Radio. “We could pop out a million more videos like that. I’m glad that people can see her personality.”\nAva is a regular ‘little Mama’ who wants to do everything for the new baby, including helping to feed her, getting her dressed, and playing with her all the time. “It’s just like her little live baby doll,” mom Ali said.\nSo, did she get her chocolate milk?\n“She loves chocolate milk, yes she does,” Ali said, laughing. “She asked me again this morning, ‘Is she getting chocolate milk? I had to say ‘No, she’s not getting chocolate milk!”",
    "source_domain": "b96.cbslocal.com",
    "title": "Adorable Toddler Learns about Breast Feeding, Requests Chocolate Milk",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/06/14/toddler-learns-about-breast-feeding/"
}