{
    "authors": [],
    "date_download": "2017-10-06 21:54:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "\"Sonically, we're reaching for taller, wider, and more vast, more epic sounds.\"",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F10%2F06%2Fwalk-the-moon-what-if-nothing-interview%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/10/walk-the-moon-courtesy-mick.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Scott T. Sterling\nWith the band’s third album, What If Nothing, on the horizon, Ohio rock band Walk the Moon has opened up about the process behind its creation.\nRelated: Walk The Moon Debut ‘One Foot’ Video\n“The approach was just making noise, getting back to our roots of being a rock & roll band and just playing our instruments and letting the sound bounce off the walls,” singer Nicholas Petricca explained to Rolling Stone\n“Sonically, we’re reaching for taller, wider, and more vast, more epic sounds,” he said. “But the lyrics are kind of the opposite. They’re much more personal and are very close to the heart, very raw.”\nDespite the “chaos” that went into the new full-length, including the band canceling a tour last summer when Petricca’s father fell ill, the singer is pleased with how What If Nothing ultimately turned out.\n“There’s this feeling where everything is like a bad haircut, and everything feels unfinished,” he revealed. “That moment of getting the record beyond the point of discomfort, until the record is to the point of, ‘Oh. What a relief. This feels amazing,’ is a major lesson in trust – you really are just faced with having to trust yourself and your collaborators and the producer that this deformed laboratory monster is going to, eventually, grow wings and become something really beautiful.”",
    "source_domain": "b96.cbslocal.com",
    "title": "Walk the Moon Detail the Making of New Album ‘What If Nothing’",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/10/06/walk-the-moon-what-if-nothing-interview/"
}