{
    "authors": [],
    "date_download": "2017-08-14 15:34:54+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 01:14:02",
    "description": "\"I am beyond bummed I couldn't make it to the show as I had every intention of being there,\" she writes.",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F08%2F14%2Fmiley-cyrus-teen-choice-apology%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/08/miley-cyrus-red-getty-946.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Annie Reuter\nThe 2017 Teen Choice Awards were held on Sunday evening (Aug. 13) and one major name was missing: Miley Cyrus. The singer and actress shared her apologies with fans on Instagram that evening, explaining that while she had every intention of attending the awards show to accept her trophy for The Ultimate Choice Award, her schedule simply wouldn’t allow her.\nRelated: Miley Cyrus Announces Title, Release Date of New Album\n“To my dearest fans & all of those watching @teenchoicefox ! I want to say thank you from the very bottom of my heart for presenting me with #TheUltimateChoiceAward!” Cyrus writes. “I am beyond bummed I couldn’t make it to the show as I had every intention of being there to accept and celebrate this honor! I created an unrealistic schedule for myself which leads me to this announcement!”\nThen, with the grace of a veteran politician, Miley spun her apology into an act of self-promotion. “I’ve been tryin to keep the secret but I can’t hide it any longer! My new single / music video #YoungerNow will be dropping this Friday, Aug 18th & I am sooooooo EXCITED to share it with all of you! I hope to always make people smile and shine light thru my work! I look forward to making music for the rest of my life and I’m thankful everyday for those who listen! I am sending so much love and peace into the world right now because THATS what we need most! Love Love & more LOVE!”\nCyrus wasn’t the only celebrity who couldn’t make it to the show. Bruno Mars accepted his Visionary Award from afar with a special video message.",
    "source_domain": "b96.cbslocal.com",
    "title": "Miley Cyrus Apologizes For Absence From 2017 Teen Choice Awards",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/08/14/miley-cyrus-teen-choice-apology/"
}