{
    "authors": [],
    "date_download": "2017-10-06 21:54:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Seriously, as if you weren't obsessed with them already, here are some facts about Taylor Swift, Backstreet Boys, Fifth Harmony, Khalid, Logic and Sabrina Carpenter!",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F10%2F06%2Ffun-facts-about-your-b96-pepsi-jinglebash-artists%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/10/slide8.jpg?w=1500",
    "language": "en",
    "localpath": null,
    "maintext": "Taylor Swift, Backstreet Boys, Fifth Harmony, Khalid, Logic and Sabrina Carpenter are performing at the B96 Pepsi #JingleBash.\nI think it’s safe to say, this is one of our BIGGEST shows!\nHere are some fun facts about this year’s lineup… in case you don’t know some of them!\nTaylor Swift\nShe is terrified of snakes and spiders, which is quite funny considering people like to call her a “snake” in the industry and she brought that nickname to life with real snakes in the “Look What You Made Me Do” music video.\nShe’s the first country singer to win an MTV Video Music Award. Her video “You Belong with Me” won the Best Female Video award in 2009.\nShe’s obsessed with “Disney everything.” She even had a cameo in the Hannah Montana movie.\nFollowing the release of her new single “Look What You Made Me Do” on Friday (Aug. 25), Swift has broken three records for most streams in a 24 hour period.\nBackstreet Boys\nHowie is the best dancer and studied dance professionally. But you wouldn’t even tell cause they’ve all got it down after all these years.\nIn 1992, AJ Mclean lived in the same building as Britney Spears, Justin Timberlake and Ryan Gosling. In fact, he used to shoot hoops with Ryan on the basketball court, and one day during a game he asked him to join his new band – which turned out to be the Backstreet Boys. What was Ryan’s response? He simply nodded.\nThe Backstreet Boys, who gained fame in Europe first, didn’t make a penny during the start of their career thanks to their late manager, Lou Perlman. He was jailed for 25 years for illegal ponzi schemes.\nBefore joining the group, Kevin was Aladdin at Disney World. And a Versace model!\nFifth Harmony\nDie-hards know Fifth Harmony used to be made up of 5 members who were put into a group after auditioning as solo acts during X-Factor. This year, they lost Camila Cabello, who decided to pursue a singing career.\nOriginally, the group’s name was “LYLAS” (acronym for Love You Like a Sister), but another group called “The Lylas,” who are Bruno Mars’ sister, stole the name and they were forced to become 5H.\nWhile on tour the girls could only take 5 minute showers in a scheduled order. (I could not handle that!)\nKhalid\nHis very first single, ‘Location’, was released in August 2016 when he was just 18, hit no.2 in the US R&B charts.\nKhalid was nominated for the Best New Artist at the 2017 BET awards but lost out to Chance the Rapper, which I guess isn’t really a loss. He did win Best New Artist at the MTV VMAs though!\nHe’s actually really close friends with Fifth Harmony’s Normani and she appears in his music video for “Young, Dumb and Broke.”\nLogic\nLogic avoids smoking weed because he considers it a gateway drug and he’s also stopped smoking cigs since his 2014 album Under Pressure.\nHe’s been making music since 2011 but he recently blew up because of his single “”1-800-273-8255″ ft. Khalid and Alessia Cara. The song has become an anthem for suicide prevention.\nHe proposed to his wife while on the beach inside of a photo booth. (And yes, they are goals.)\nSabrina Carpenter",
    "source_domain": "b96.cbslocal.com",
    "title": "Fun Facts About Your B96 Pepsi #JingleBash Artists…",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/10/06/fun-facts-about-your-b96-pepsi-jinglebash-artists/"
}