{
    "authors": [],
    "date_download": "2017-06-14 19:33:02+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "Sources are reporting a significant security presence at a L.A. hospital.",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F06%2F14%2Fbeyonce-labor-rumors%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/06/beyonce-staples-center.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Abby Hassler\nTwitter is currently ablaze with fan theories that Beyoncé in currently in labor. While most fans know that Queen Bey and Jay Z should be expecting their twins any day now, The Shade Room shared an anonymous tip alleging the couple was spotted at a Los Angeles Hospital yesterday (June 13).\nRelated: Beyoncé Looks Magnificent at African-Themed Baby Shower\n“Beyonce’s security was seen leaving her Beverly Hills home this morning carrying two baby seats to a hospital in West LA,” the insider confirmed to Hollywood Life . “Bey and Jay’s large security team, including three well-staffed Escalades, are now waiting outside the hospital for the arrival of the twins.”\nSince yesterday, multiple sources have confirmed to Us Weekly that there is significant security presence at a L.A. hospital, which further solidifies the labor rumors.\nWhether or not she actually is in labor, her supporters are certainly having fun speculating about the possibility.\nCheck out the fantastic BeyHive responses to the labor rumors below.\nReports are surfacing that @Beyonce could be in labor right now 😭 https://t.co/GteJxtSuI5 —\nJuan Hustle (@JuanHustle) June 14, 2017\nppl are saying bey is in labor!!! god bless!!! #BeyHiveSupportsBeyonce https://t.co/bTGECl3p1e —\nwill see h! (@onairstyles) June 13, 2017\nBeyoncé is in labor. the twins are on their way. https://t.co/mmLUfGeKaH —\njustin lewis (@justinleewis) June 13, 2017\nBeyoncé is in labor which means I'm in labor too sorry I can't study today I gotta lay in bed all day https://t.co/aPvqTzHX8A —\nLuke (@LucaIdek) June 13, 2017",
    "source_domain": "b96.cbslocal.com",
    "title": "Beyoncé in Labor?",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/06/14/beyonce-labor-rumors/"
}