{
    "authors": [
        "Lizzy Buczak"
    ],
    "date_download": "2017-10-06 15:41:11+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Hannah's Bretzel is offering deals that will provide nutritional benefits during the race. Check them out!",
    "filename": "http%3A%2F%2Fb96.cbslocal.com%2F2017%2F10%2F06%2Ffreebies-and-deals-for-this-sundays-chicago-marathon-runners%2F.json",
    "image_url": "https://cbsb96radio.files.wordpress.com/2017/10/marathon-free-coffe-with-breakfast-sandwich-e1507303481463.jpg?w=1500",
    "language": "en",
    "localpath": null,
    "maintext": "The Chicago Marathon is this Sunday (10/8)!\nIt’s pertinent that runners consume foods and beverages that will provide nutritional benefits during the race.\nA few restaurants near the Marathon path want to help you out with that.\nHannah’s Bretzel (400 N. LaSalle location) will be offering a special deal this Sunday. Customer can get a FREE coffee with the purchase of any egg breakfast sandwich or protein bowl/ or with the purchase of the restaurant’s sliced seasonal apple bread.\nAccording to Runner’s World, consuming two to three cups of brew can reduce levels of perceived exertion in athletes and actually increase endurance performance by an average of 24%, giving runners an extra push when they need it. Plus, Hannah’s freshly baked organic breakfast rolls will help runner’s carb-up before the big race while also providing them with added protein (and energy) from Hannah’s organic, free-range eggs, vegetables and natural meats.\nOther Freebies/Deals for runners:\nMercadito – Show your Marathon bib and receive a FREE Botana.\nThe Florentine – They will be providing a three-day Marathon Menu to help you fuel up for the race. Runners can also score specials and free Two Brothers. Dishes for the specials include spaghetti and meatballs ( pork, veal, beef ), rigatoni bolognese ( spaghetti squash, zucchini, red onion ) and arugula salad, among other items.\nThe Joy District – After the Marathon, enjoy a 26.2% discount for the entire group. Runners must show their runner ID number to receive the discount.\nRoanoke – Executive Chef Ryan Kikkert has created a special carbo-load menu that will be available October 6-8! Items include pumpkin ravioli ( $16 ), chicken penne pasta ( $18 ), Marathon Pizza ( $13 ) and tagliatelle pasta ( $18 ). Oct. 8 brunch will feature brown butter French Toast ( $11 ), braised oxtail taquitos huevos ( $12.50 ), porchetta eggs Benedict ( $14 ), ribeye hash skillet ( $12 ) and more.\nSo get out there, run and enjoy the freebies after!",
    "source_domain": "b96.cbslocal.com",
    "title": "Freebies and Deals for This Sunday’s Chicago Marathon Runners!",
    "title_page": null,
    "title_rss": null,
    "url": "http://b96.cbslocal.com/2017/10/06/freebies-and-deals-for-this-sundays-chicago-marathon-runners/"
}