{
    "authors": [
        "Luis Martinez"
    ],
    "date_download": "2018-03-20 03:38:57+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 02:49:28",
    "description": "The U.S. and South Korea delayed exercises until after the Olympics.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fus-south-korea-announce-annual-military-exercises-to-begin-on-april-1%2F3236322%2F.json",
    "image_url": "http://a.abcnews.com/images/International/foal-eagle-03-ht-jef-180104_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The United States and South Korea have announced that their annual large-scale military exercises will begin on April 1.U.S. officials had said previously that the anticipated meeting between President Donald Trump and North Korea's Kim Jong Un would not impact the timing of the Foal Eagle and Key Resolve exercises.\"Secretary of Defense James N. Mattis and the Republic of Korea Minister of National Defense Song Young-moo have agreed to resume the annual combined exercises including Foal Eagle and Key Resolve, which were deconflicted with the schedule of the Olympic Games,\" the Pentagon said in a statement Monday. \"The exercises are expected to resume April 1, 2018, at a scale similar to that of the previous years.\"\"The United Nations Command has notified the Korean People's Army on the schedule as well as the defensive nature of the annual exercises,\" the statement added. The Korean People's Army is the official name of North Korea's army.The U.S. and South Korea previously agreed to delay the exercises until after the conclusion of the Winter Olympics and Paralympic Games held in South Korea. The Paralympic Games concluded on Sunday.The tactical exercises that make up Foal Eagle will involve about 11,500 U.S. forces and approximately 290,000 S. Korean military personnel.The computer simulated headquarters exercise known as Key Resolve will involve 12,000 U.S. forces and 10,000 South Korean personnel.\"The exercises include all services and are of the same scale, scope, and duration as previous years,\" said Lt. Col. Christopher Logan, a Pentagon spokesman.\"Our combined exercises are defense-oriented and there is no reason for North Korea to view them as a provocation,\" Logan added. \"While we will not discuss specifics, the defensive nature of these combined exercises has been clear for many decades and has not changed.\"In the past, North Korea has often condemned the Foal Eagle exercise and used it as an excuse for its provocative missile and nuclear tests.But that appeared to have changed in the lead up to Kim's offer to meet with Trump.Kim \"understands that the routine joint military exercises between the Republic of Korea and the United States must continue,\" South Korean national security adviser Chung Eui-yong told reporters on March 8 as he announced that Trump had agreed to meet with Kim.North Korea has not publicly responded to Trump's decision and no date has been scheduled for a meeting between the two leaders.",
    "source_domain": "abc7news.com",
    "title": "US, South Korea announce annual military exercises to begin on April 1",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/us-south-korea-announce-annual-military-exercises-to-begin-on-april-1/3236322/"
}