{
    "authors": [
        "Michael Finney"
    ],
    "date_download": "2017-02-15 04:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 01:53:34",
    "description": "A Bay Area woman bought some pricey theater tickets only to find she wouldn't be able to use them.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fentertainment%2F7-on-your-side-helps-bay-area-woman-replace-useless-theater-tickets%2F1755181%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755265_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "When you buy theater tickets, you might wonder if you'll have a good view of the stage. However, for those with disabilities, other factors are far more important.Aileen Weissblum saw Disney's 'The Lion King' when it first opened on Broadway 20 years ago. She was thrilled when the show came to San Francisco. However, she bought expensive seats from an authorized seller only to find out she couldn't possibly use them.Aileen wanted to take her granddaughter, an aspiring dancer to see the show.\"This would be a wonderful show for her to explore the possibilities of dance and theater,\"Aileen got a friend to help her buy tickets. He found three for sale on vividseats.com, but with all the service fees they cost more than $600 and even worse, Aileen realized she could never use them.\"I'm 92 years old and my ability to walk that far was impossible.\"The seats were located way up in the balcony. Aileen uses a walker, cannot climb that many stairs, and the Orpheum Theater has no elevator.\"They said there's nothing we can do about it, we've already collected the money from your credit card,\" Aileen said.\"The fine print basically says we don't refund under any circumstances,\" Aileen's daughter Lynn Smith said.Smith, who lives in Washington State tried to help but says Vivid would not exchange the seats or refund her mom's money.She contacted the theater directly, and Aileen contacted 7 On Your Side.\"I felt I had a legitimate complaint,\" Aileen said.SHN which operates the theater did come through, exchanging the balcony seats for three seats in the orchestra section.SHN tells us it does provide accessible seating as required under the Americans with Disabilities Act.Online seating charts identify wheelchair accessible seats. The company also provides discounted orchestra seats for those with limited mobility, like Aileen.Vivid does let you check for wheelchair access by hovering a mouse over the seat selection. It did not say why it did not exchange the seats when she requested it, saying \"we were able to secure ADA seating for Ms. Weissblum and we always take care of our customers.\"So, in a circle of life happy ending, Aileen, her daughter, and granddaughter headed to the big show, and they say it was spectacular.We found the best way to ensure accessible seating is to book directly with the theater. SHN also stages special performances for the hearing impaired. We should also note that the Lion King is a production of Disney which owns ABC 7.",
    "source_domain": "abc7news.com",
    "title": "7 On Your Side helps Bay Area woman replace useless theater tickets",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/entertainment/7-on-your-side-helps-bay-area-woman-replace-useless-theater-tickets/1755181/"
}