{
    "authors": [
        "Wayne Freedman"
    ],
    "date_download": "2018-04-25 04:23:20+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 22:52:02",
    "description": "A San Francisco State University professor is warning people who spend time outdoors to check themselves for ticks because they are on the rise this season, which may put you at risk for Lyme Disease.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3387776%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3387775_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "SF State study says Lyme-carrying ticks may proliferate in medium-sized NorCal regional parks, with fewer predators and more rodents. Yes, Rodents. They carry the disease. Not deer. Expect more ticks this year, says Dr. Andrea Swei. #abc7now pic.twitter.com/a3gsYhJyxX — Wayne Freedman (@WayneFreedman) April 24, 2018\nAs you have certainly noticed, it's spring and Northern California is peaking in green. A liability comes along with that -- increased chances of bites from ticks infected with Lyme Disease.A new study from San Francisco State University calls for awareness by the Bay Area Lyme Foundation.If you have never heard the sound of many, many pills landing on a wooden kitchen table consider yourself fortunate. They have become a part of Kirsten Stein's life. For most among us, they would be too many pills to count unless we needed to. \"I think I am at 30 pills day and there used to be many more,\" she said.Even after eight years, she remains surprised by how the disease changed her formerly outdoorsy, energetic lifestyle. \"I have a lot of bone pain, muscle pain, memory issues,\" Stein said.It hit her, not out of the blue, but the green of grass. \"I didn't see the tick and I didn't see the rash.\"It is the he same kind of tick that a small group of scientists from San Francisco State University went looking for. \"It is called the western black legged tick. Scientific name, Ixodes Pacificus,\" Andrea Swei, M.D., said. She specializes in ticks and Lyme Disease. We found her hard at work, even as she published new findings revealing that Northern Californians will be most at risk of encountering Lyme Disease in medium-sized regional parks where rodents and lizards proliferate due to a lack of predators. Those small creatures carry Lyme and pass it on to the ticks, who may then give it us.Worry, not about big fat ticks, but smaller ones. \"They're poppy-seed sized. Black or transparent,\" Swei said.She notes that tick populations rise or fall based in climate. Swei predicts an up-tick in ticks, this season, if you pardon the pun. Consider this a fair warning.Groups like the Bay Area Lyme Foundation urge you to check yourself carefully after spending some time outdoors. As Stein knows too well, that's much easier than taking pills for the rest of your life.",
    "source_domain": "abc7news.com",
    "title": "SFSU study predicts rise in ticks this season",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3387776/"
}