{
    "authors": [
        "M.L. Nestel"
    ],
    "date_download": "2018-07-04 14:25:13+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:09:40",
    "description": "Here are some incredible rescues that defied the odds.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fmiraculous-rescues-in-recent-history%2F3700253%2F.json",
    "image_url": "http://a.abcnews.com/images/International/thailand-cave-kids3-ht-ps-180702_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Gramat, France -- 1999\nKamchatka Peninsula, Russia -- 2005\nCopiapo, Chile -- 2010\nIca, Peru -- 2012\nUntersberg, Germany -- 2014\nAnxieties are high as discussions abound over how to extract the recently found Thailand soccer team, 12 boys and their coach, from a flooded, maze-like cave.It may take weeks or even months to save them, officials have said.Here are some other incredible rescues that similarly defied the odds.Seven men were stuck in a cave system for 10 days after heavy storms caused unforeseen flooding. To free them, rescuers drilled shafts into the rock to pinpoint their whereabouts and squeeze them out in a coordinated effort.A mini-submarine entangled in marine debris was caught underwater with limited oxygen for three days before a British undersea robot cut the vessel free.A partial tunnel collapse trapped 33 miners more than 2,000 feet deep underground for 10 weeks -- the longest time to elapse before a successful rescue.\"What started as a tragedy is ending as a real blessing,\" Chilean President Sebastian Pinera told ABC News' Diane Sawyer at the time. \"I think that the miners have given us an example of unity, of teamwork, of faith. Their families, they never lost faith.\"Nine miners spent a week in a tunnel after a rockfall caused an underground cave-in. Rescuers dug through rock and soil more than 800 feet underground to free them.It took 11 days and 700 people to airlift explorer Johann Westhauser from Germany's Riesending Cave Complex after he suffered a head wound.The 52-year-old was able to be brought to safety when rescuers navigated 3,200 feet and braved freezing temperatures, treacherous tunnels, chambers and underground waterfalls.",
    "source_domain": "abc7news.com",
    "title": "Miraculous rescues in recent history",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/miraculous-rescues-in-recent-history/3700253/"
}