{
    "authors": [
        "Bay City News"
    ],
    "date_download": "2018-03-20 03:58:51+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 20:55:24",
    "description": "The Sonoma County Sheriff's Office announced Monday the arrest of an eighth suspect in three home invasion robberies in Petaluma last week.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235176%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3235312_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Sonoma County Sheriff's Office announced Monday the arrest of an eighth suspect in three home invasion robberies in Petaluma last week.Jade Lafay Johnson, 19, of Winston-Salem, North Carolina, was taken into custody Thursday by Winston-Salem police during a traffic stop in Winston Salem.Sonoma County sheriff's detectives flew to North Carolina over the weekend to interview Johnson, who is being held under $1 million bail and will be extradited to Sonoma County to face trial, sheriff's Sgt. Spencer Crum said.All eight suspects in the three Petaluma home invasion robberies on March 12 were from the East Coast, primarily from Richmond, Virginia, and Winston-Salem, Crum said.The suspects were looking for marijuana when they broke into three homes in the 100 and 200 blocks of Eugenia Drive around 3 a.m., tied up the occupants and pistol-whipped one occupant. There was no marijuana at any of the homes, Crum said.Four men were arrested after a subsequent pursuit into Novato, and three men were arrested around 7:30 p.m. that day when they tried to board a plane to the East Coast from San Francisco International Airport, Crum said.The seven suspects were booked into Sonoma County Jail on suspicion of robbery of an inhabited dwelling, burglary, false imprisonment, kidnapping and conspiracy. Six of the men are being held under $1 million bail and one is on no-bail status.",
    "source_domain": "abc7news.com",
    "title": "Eighth suspect in series of Petaluma home invasion robberies arrested",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235176/"
}