{
    "authors": [
        "Carolyn Tyler"
    ],
    "date_download": "2017-02-15 04:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 03:45:28",
    "description": "San Francisco police are searching for three young men accused of beating an 18-year-old teenager with his own skateboard.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fteen-boy-viciously-attacked-with-skateboard-in-san-francisco%2F1755311%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755310_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "San Francisco police are searching for three young men accused of beating an 18-year-old teenager with his own skateboard.The assault happened near the eastern entrance to Golden Gate Park at Haight and Stanyan streets near a busy bike rental stand.The teen is in critical condition. \"The medics were on scene and found the victim on the ground, unconscious, unable to speak and he was bleeding profusely from his head,\" San Francisco Police Department Ofc. Grace Gatpandan said.It's the latest incident in the area. Last June, a homeless couple was charged with torturing a man whose body was found in the park's Alvord Lake and there have been several stabbings, and shootings over the last couple of years at Haight and Stanyan streets.Billy Martins just moved to the neighborhood and says he knows to be careful. \"You don't know who's next to you, you don't know who is walking around, what kind of problems people have,\" he said.Since Saturday afternoon's attack on the skateboarder, police have interviewed witnesses and say they now have more officers patrolling this trouble spot. \"We have a patrol bureau task force, those officers can be undercover, there are officers who can be doing passing calls, even officers on bikes that you may not see,\" Gatpandan said.\"It's well policed, that's not the problem,\" Skates owner Carol Sloan said. Skates is across the street from the park. \"That particular entrance to the park is a place where people hang out, sell drugs, and are violent, so it doesn't surprise me something happened there,\" Sloan said.Investigators believe there may be more witnesses and are asking them to call police.",
    "source_domain": "abc7news.com",
    "title": "Three men accused of viciously attacking teen with skateboard at San Francisco's Golden Gate Park",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/teen-boy-viciously-attacked-with-skateboard-in-san-francisco/1755311/"
}