{
    "authors": [
        "Tara Fowler"
    ],
    "date_download": "2018-03-20 03:37:30+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 23:53:27",
    "description": "Zachary Cruz, 18, was arrested Monday afternoon.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fparkland-shooting-suspects-brother-arrested-for-alleged-trespassing-at-school%2F3235805%2F.json",
    "image_url": "http://a.abcnews.com/images/US/cruz-brother-ht-er-180319_hpMain_v4x3_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The brother of Parkland school shooting suspect Nikolas Cruz has been arrested for allegedly trespassing on the school grounds of Marjory Stoneman Douglas High School.Zachary Cruz, 18, who was arrested at 4:30 p.m. Monday afternoon, allegedly rode his skateboard through school grounds, according to the Broward Sheriff's Office. According to the arrest report, he told deputies he wanted to \"reflect on the school shooting and soak it in.\"His brother, Nikolas Cruz, 19, is accused of killing 17 people in the Valentine's Day massacre at the high school.Nikolas Cruz was formally arraigned last Wednesday on a 34-count indictment related to last month's mass shooting at a South Florida high school, for which the 19-year-old is now facing the death penalty. A plea of not guilty was entered on his behalf, though defense attorney Melisa McNeill emphasized that Nikolas Cruz is willing \"at any time\" to plead guilty \"in exchange for a waiver of the death sentence\" and instead spend the rest of his life behind bars.Deputies said Zachary Cruz had been warned to stay away from the school campus previously, according to the arrest report. The alleged trespassing was captured on CCTV, the report states.Zachary Cruz was booked into the Broward Sheriff's Office jail and his bond was set at $25.",
    "source_domain": "abc7news.com",
    "title": "Parkland shooting suspect's brother arrested for alleged trespassing at school",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/parkland-shooting-suspects-brother-arrested-for-alleged-trespassing-at-school/3235805/"
}