{
    "authors": [
        "Lyanne Melendez",
        "Amy Hollyfield"
    ],
    "date_download": "2018-04-25 01:39:25+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 13:21:08",
    "description": "At least 6,000 people, mostly women, attended the sold-out Professional BusinessWomen of California Conference in San Francisco today for career inspiration and networking opportunities.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fbusiness%2Fpbwc-conference-in-san-francisco-lifts-up-thousands-of-women%2F3386020%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3388138_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos The 29th Annual Professional BusinessWomen of California Conference is taking place at Moscone Center on Tuesday, and ABC7 is again a proud sponsor.\nEMBED >More News Videos This edition of Beyond the Headlines focuses on a long standing organization called the Professional BusinessWomen of California, or PBWC.\nActress Ashley Judd talking about the #MeToo movement at the #PBWC. pic.twitter.com/ItSfNVEe8V — Amy Hollyfield (@amyhollyfield) April 24, 2018\nLoved meeting Benita Mays from Bank of the West. Such a treat to talk to viewers face to face instead of through a camera! #PBWC #standupliftup pic.twitter.com/XNbXJ2JWOw — Amy Hollyfield (@amyhollyfield) April 24, 2018\nLove meeting ABC7 News viewers! This is Janet Portley and she says she watches us every morning! #PBWC #standupliftup pic.twitter.com/ZJ71syiZ3j — Amy Hollyfield (@amyhollyfield) April 24, 2018\nWe are here at the ABC7 news booth. Come say hi! #PBWC #standupliftup pic.twitter.com/HTVs6ySc3C — Amy Hollyfield (@amyhollyfield) April 24, 2018\nAt least 6,000 people, mostly women, attended the sold-out Professional BusinessWomen of California Conference in San Francisco today for career inspiration and networking opportunities.Jane Fonda, Lily Tomlin, Ashley Judd and Maria Shriver are among the speakers and panelists at the conference, which focuses on empowering women and making improvements in the workplace.ABC 7's Cheryl Jennings is serving as emcee and introducing an impressive list of speakers.Kaiser CEO Bernard Tyson talked about his ancestors who were slaves and how he now leads a major American company. \"Nobody should own your dreams no matter how high or far you want to go, you can own that,\" he said.\"So far, it is more inspirational than expected. I thought it might be a little boring, but the speakers have been great,\" attendee Jacqui Bellini-Murray said.The 29th Annual Professional BusinessWomen of California Conference is taking place at Moscone Center, and ABC7 is again a proud sponsor.Judd is one of the many dynamic women who are bringing their passion to the conference. Judd is appearing on a panel focusing on the Me Too and Times Up movements.Bay Area Congresswoman Jackie Speier appeared with ABC7's Cheryl Jennings and talked about the conference and how this Me Too discussion is timely and important.Speier and Judd later addressed those at the conference in a discussion about keeping the movement alive. \"It's a milestone that we are crossing and we have to do it for our kids and our grandkids and all those women who come after us,\" said the congresswoman who said one of her greatest fears is that people will forget.Judd urged the women in the audience to set and maintain boundaries and when a problem arises, never go at it alone. \"It takes guts to speak up but make sure you cultivate strong female alliances because they make the experience less lonely and more empowering,\" expressed Judd.This year's theme is \"Stand Up, Lift Up.\" Speier founded the group in 1989. She recently appeared on ABC7's \"Beyond the Headlines with Cheryl Jennings\" and said this discussion is timely and important. \"We are truly changing the culture at work for all time, so that our daughters and granddaughters are never going to have to deal with frankly what we had to deal with,\" Speier said.Later in the day, keynote speakers Jane Fonda and Lily Tomlin brought laughs, love, and the importance of female friendships to the stage. They made audiences laugh and get inspired as well.Fonda and Tomlin currently star on the Netflix series, \"Grace and Frankie\" but have worked their whole lives to create more opportunities for women in the acting world. They also have been activists and currently crusade for all kinds of causes that touch their hearts.The key is to take the energy, lessons and connections out into the business world.Members of the ABC7 News team are leading panels designed to help women gain career confidence, media skills and more.But PBWC goes well beyond this one-day conference. Throughout the year, the organization works with its corporate partners to offer workshops, socials and mentorships - all designed to empower women in the workplace and in their lives.Jane Fonda and Lily Tomlin speak on women in the entertainment industry and their long-lasting friendship:Journalist, activist, and former First Lady of California Maria Shriver speaks on the importance of caring for yourself first, and giving back to others:ABC7 News' Natasha Zouves and Reggie Aqui talk about telling and selling your story:Adama Iwu and Rep. Jackie Speier talk the #MeToo movement and harassment in the workplace:",
    "source_domain": "abc7news.com",
    "title": "Professional BusinessWomen of California Conference in San Francisco 'lifts up' thousands of women",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/business/pbwc-conference-in-san-francisco-lifts-up-thousands-of-women/3386020/"
}