{
    "authors": [
        "Katie Utehs"
    ],
    "date_download": "2017-10-07 04:58:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 04:13:32",
    "description": "Petaluma's Animal Control officer took a strange call Thursday night and what he found at the other end of that call was extremely unexpected.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpets-animals%2Fstrange-call-leads-petaluma-animal-control-to-alligator-in-backyard%2F2502286%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2502334_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Petaluma's Animal Control officer took a strange call Thursday night and what he found at the other end of that call was extremely unexpected.\"I wasn't going to tell him there's an alligator in the backyard, because who would believe that,\" said Karen Davis-Brown of Petaluma, who spotted the four-foot reptile.\"So he was right here and he was just sitting here with his mouth open and he looked real but it was just too weird,\" Davis-Brown told ABC7 News. \"Quite a few cops showed up wondering if we were crazy people.\"Animal Control Officer Mark Scott caught the gator with his net. \"This is my first. Five years -- first one.\"After untangling its mouth, Scott duct taped it and put a towel over the animal's eyes to calm it. \"It's pretty nimble actually -- I thought it would be slower, but they're pretty fast.\"It also may have been hungry. \"The Browns have a koi pond in their backyard and you can see they have about a half dozen fish and no joke -- the concrete alligator has been in there as well for about 15 years,\" Scott added.After the Petaluma animal shelter named the creature \"Darth Gator\" a woman with a reptile rescue came forward. \"You have to get a permit from fish and game, and she has one from them that's current,\" said Scott. \"She was in the middle of relocating them to another better facility and it was able to get away.\"\"We lived in Florida for a year and never had an alligator in our backyard in Florida -- but in Petaluma? We have an alligator in our backyard.",
    "source_domain": "abc7news.com",
    "title": "Strange call leads Petaluma animal control to alligator in backyard",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/pets-animals/strange-call-leads-petaluma-animal-control-to-alligator-in-backyard/2502286/"
}