{
    "authors": [
        "Bay City News"
    ],
    "date_download": "2017-08-14 21:38:33+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 20:56:21",
    "description": "Concord woman dies in hit-and-run Sunday in Mendocino Co.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fconcord-woman-dies-in-hit-and-run-sunday-in-mendocino-co%2F2307525%2F.json",
    "image_url": "http://cdn.abclocal.go.com/assets/news/kgo/images/logos/default_800x450.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Concord woman died in a hit-and-run collision Sunday afternoon in Laytonville in unincorporated Mendocino County, California Highway Patrol officials said.The 54-year-old woman was in a 1965 Ford Falcon traveling south on U.S. Highway 101 at 12:28 p.m. when a 2011 Ford Explorer Sport Trac traveling north veered into the southbound lanes, according to the CHP.CHP officials said the front of the Ford Falcon collided with the right side of the Ford Explorer, killing the Concord woman.The driver of the Ford Falcon, a 46-year-old Concord man, suffered major injuries and was taken first to Howard Memorial Hospital in Willits and then flown to Santa Rosa Memorial Hospital.According to the CHP, the driver of the Ford Explorer fled from the scene and is still at large. He is described as a Hispanic man in his 30s who is 5 feet 10 inches tall and 215 pounds with a stocky build and short black hair and brown eyes.He was wearing a dark-colored shirt and camouflage shorts. CHP officials said that right after the collision, he was last seen walking north on Highway 101.The collision remains under investigation. The name of the woman who died was not immediately available from the Mendocino County coroner's office.Anyone with information about the driver or his whereabouts is asked to call the CHP 24 hours a day at (707) 268-2000 or during business hours at (707) 923-2155.",
    "source_domain": "abc7news.com",
    "title": "Concord woman dies in hit-and-run Sunday in Mendocino Co.",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/concord-woman-dies-in-hit-and-run-sunday-in-mendocino-co/2307525/"
}