{
    "authors": [
        "Paul Pradier"
    ],
    "date_download": "2018-04-24 17:07:11+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:04:12",
    "description": "A novice in foreign policy, the French president has deployed all his energy to put France at the center of the international stage.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ffrench-president-sweeps-into-dc-with-more-articulated-credible-foreign-policy-%2F3386447%2F.json",
    "image_url": "http://a.abcnews.com/images/International/macron2-ap-ml-180423_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "French President Emmanuel Macron has been notably active on the national scene since his election last year, launching initiatives aimed at modernizing France. He has also applied the same energy to foreign policy, with a global strategy dubbed \"France is back.\"\"Since his election a year ago, Emmanuel Macron has improved France's image around the world and re-established mutual trust with foreign countries,\" deputy director Bruno Tertrais of the Paris-based Foundation for Strategic Research said.A novice on foreign affairs, the French president, amid a state visit this week to the United States, has thrown himself into putting France at the center of the international stage. \"Emmanuel Macron's foreign policy is realistic but not cynical,\" Tertrais said, \"and he has a good understanding of the worldwide balance of power.\"Others share that sentiment.\"When comparing Emmanuel Macron's foreign policy with his two predecessors -- Nicolas Sarkozy and Franois Hollande -- there is a contrast,\" Thomas Gomart, director of the French Institute for International Relations, said. \"He wants to enhance the stature of the French president by giving more significance to his addresses and his behavior.\"At home, the 40-year-old Frenchman has taken advantage of British Prime Minister Theresa May 's struggles with Brexit and German Chancellor Angela Merkel 's national political turmoil to become the main voice of the European Union. He is pushing for E.U. reforms and advocating deeper cooperation and integration among the 28 member states.On the military front, Macron has committed to promoting the G5 Sahel, an African regional security bloc comprising Chad, Mali Burkina Faso and Niger fighting terrorism in northern Africa. The French president mobilized the international community to help finance the G5 anti-terror military force.In Syria, the French president proved his capacity to coordinate with his U.S. and British counterparts earlier this month during a joint military operation targeting the Syrian regime's chemical facilities.On climate change , Macron declared last year that he wanted to \"make our planet great again\" after President Donald Trump decided to pull out of the Paris Climate Accord. He has since taken the lead on the issue by mobilizing public and private funding in the fight against global warming. During the One Planet Summit in Paris in December, banks and companies announced billions of dollars of intended divestment from coal, oil and gas.Finally, Macron has also played the role of mediator on the international stage by personally helping to resolve a political crisis between Lebanon and Saudi Arabia in November 2017.\"We have to assess foreign policy on the long term,\" Gomart, of the French Institute for International Relations, said. \"But, undeniably, France's foreign policy is now more articulated, credible and serious.\"Despite all his efforts, however, the French president failed to persuade Trump to stay in the Paris Climate Accord. The U.S. president also threatened to pull out of the Iran nuclear deal , an agreement supported by France.On both issues, Macron's diplomatic skills will be tested more than ever in efforts to reverse Trump's positions.",
    "source_domain": "abc7news.com",
    "title": "French president sweeps into DC with 'more articulated, credible' foreign policy",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/french-president-sweeps-into-dc-with-more-articulated-credible-foreign-policy-/3386447/"
}