{
    "authors": [
        "James W Jakobs"
    ],
    "date_download": "2018-03-20 03:39:24+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 21:40:33",
    "description": "The seats have been off all winter and the wheel will be removed next week -- the 60-year-old iconic Ferris Wheel at the Santa Cruz Beach Boardwalk is being retired.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fsanta-cruz-beach-boardwalk-closes-ferris-wheel-after-nearly-60-years-of-thrills%2F3235318%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kfsn/images/cms/3235093_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The seats have been off all winter and the wheel will be removed next week -- the 60-year-old iconic Ferris Wheel at the Santa Cruz Beach Boardwalk is being retired.In a Facebook post, the Boardwalk announced that its last day of operation was last fall. The Ferris Wheel was down during the winter for routine maintenance. It was during that time the park decided not to bring it back.In a response to a patron on Facebook, the park writes, \"We would have given guests an opportunity for one last ride! We're sorry we weren't able to give everyone a last chance to ride the Ferris Wheel! We're looking at all options for a replacement (including another ferris wheel..)\"To give people a sense of how many times the wheel turned over the years, the park offered this statistic, \"Our Ferris Wheel had more than 4 million riders since 1986 alone! (We didn't track its ridership before that.) That's a lot of memories!\"The Boardwalk says they may put a food cart or a game there temporarily over the summer while they make a decision on a replacement ride.Many people were asking if the Ferris Wheel seats would be available for purchase but the park has not yet made a decision saying, \"We will let people know here on Facebook if we decide to sell the seats.\"",
    "source_domain": "abc7news.com",
    "title": "Santa Cruz Beach Boardwalk closes Ferris Wheel after nearly 60 years of thrills",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/santa-cruz-beach-boardwalk-closes-ferris-wheel-after-nearly-60-years-of-thrills/3235318/"
}