{
    "authors": [],
    "date_download": "2017-08-15 00:39:24+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 23:34:10",
    "description": "Israel Kristal, the world's oldest man who lived through both World Wars and survived the Auschwitz concentration camp has passed away just a month short of his 114th birthday, his family said Saturday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fworlds-oldest-man-a-holocaust-survivor-dies-at-age-113%2F2308072%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308073_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Israel Kristal, the world's oldest man who lived through both World Wars and survived the Auschwitz concentration camp has passed away just a month short of his 114th birthday, his family said Saturday.Oren Kristal, a grandson, said he died Friday. \"He managed to accomplish a lot. Every year he lived was like a few years for somebody else,\" Oren told The Associated Press.Last year Guinness World Records awarded Kristal a certificate as the world's oldest man.Kristal was born to an Orthodox Jewish family near the town of Zarnow in Poland in 1903.\"When he was a child during World War I in Poland he was a helper for a booze smuggler, he used to run barefoot in the snow through the night many kilometers with a heavy package on his back at about 12 years old, smuggling alcohol between the lines of the war,\" Oren, his grandson said.\"He used to walk very fast until he was very old, faster than me, and he used to tell me that when he was my age if you didn't walk fast enough your feet would stick to the frozen ground,\" Oren recalled his grandfather telling him.Kristal was orphaned shortly after World War I and moved to Lodz to work in the family confectionary business in 1920.During the Nazi occupation of Poland Kristal was confined to the ghetto there and later sent to Auschwitz and other concentration camps. His first wife and two children were killed in the Holocaust. Six million Jews were systematically murdered by German Nazis and their collaborators during WWII.\"He used to tell us whenever we were mourning someone that we should consider that they are being buried in the land of Israel, most of the people he knew did not get to be buried in a grave when they died,\" Oren said.Kristal survived World War II weighing only 37 kilograms (about 81 pounds) - the only survivor of his large family.He later married another Holocaust survivor and moved with her to Israel in 1950 where he built a new family and a successful confectionary business.\"He was a very hard working man, a lot of energy always running from one place to another doing something,\" Oren, his grandson said.He said his grandfather participated in one of his grandsons bar mitzvah just a few weeks ago.An observant Jew, Kristal himself only celebrated his bar mitzvah last year, a hundred years later than usual. He missed his bar mitzvah - the Jewish coming-of-age ceremony celebrated when a boy turns 13 - because of World War I.Oren said his grandfather gave no explanation to the secret for his incredible longevity.He is survived by two children and numerous grandchildren and great-grandchildren, media reported.",
    "source_domain": "abc7news.com",
    "title": "World's oldest man, a Holocaust survivor, dies at age 113",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/worlds-oldest-man-a-holocaust-survivor-dies-at-age-113/2308072/"
}