{
    "authors": [],
    "date_download": "2018-04-24 23:36:15+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 20:55:54",
    "description": "Livermore police said a standoff with a home invasion robbery suspect hiding inside his residence is over after the man was taken into custody.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3387323%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3387423_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "#Livermore police trying to get armed robbery suspect out of his home on Coronado Way. Suspect is man between 20-30 years old. Say he robbed neighbor at gunpoint, ran home. Holed up inside. pic.twitter.com/bNZ2LdnRUK — Elissa Harrington (@ElissaABC7) April 24, 2018\nIt is 2pm and we are continuing to negotiate for a peaceful resolution. — Livermore PD (@LivermorePolice) April 24, 2018\nLivermore PD investigating home invasion robbery. Suspect possibly hiding inside a residence. Officers working on peaceful resolution. — Livermore PD (@LivermorePolice) April 24, 2018\nLivermore PD is currently working an incident in the area of Wagoner Dr and Coronado Way. Please avoid the area. We will provide updates as we can. pic.twitter.com/Xc8XLUlWKH — Livermore PD (@LivermorePolice) April 24, 2018\nLivermore police said a standoff with a home invasion robbery suspect hiding inside his residence is over after the man was taken into custody.Police said the suspect was believed to be 20 to 30 years old and added that he robbed his neighbor at gunpoint before running back home.Police asked people to avoid the area of Wagoner Drive and Coronado Way at about 12:30 p.m.Livermore police wrote on Twitter at 2:30 p.m. that the SWAT team has been on scene for an hour and they are \"still working toward a peacefulresolution.\"Sources told ABC7 News they believed the suspect was armed and were using drones to gather information at the scene.Police said at least 10 people have been evacuated from homes in the area as a precaution.No injuries have been reported.",
    "source_domain": "abc7news.com",
    "title": "Livermore police standoff ends with home invasion suspect in custody",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3387323/"
}