{
    "authors": [
        "David Louie"
    ],
    "date_download": "2018-03-20 03:37:36+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 23:29:39",
    "description": "Stewards of a wildlife and native plant sanctuary in San Jose are in shock over damage done by a volunteer maintenance worker.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fexclusive-sj-wildlife-plant-sanctuary-damaged-by-overzealous-volunteer%2F3235735%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3235758_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sadness over damage done to a #SanJose native species & wildlife reserve by an “over-zealous” volunteer. Santa Clara Valley @audubonsociety advocate (in photo) explains impact. At 4:40pm Only on @abc7newsbayarea #abc7now pic.twitter.com/qO4jtY490S — David Louie (@abc7david) March 19, 2018\nStewards of a wildlife and native plant sanctuary in San Jose are in shock over damage done by a volunteer maintenance worker.It's feared that nesting birds have been displaced after their habitat was destroyed.There is a fenced in area at Overfelt Gardens Park that is special.It's a wildlife sanctuary and native plant area highly prized by volunteers, who have been nurturing it for years. However, two weekends ago, an \"over-zealous \"volunteer came through with a power saw and hatchet, leaving behind a mountain of cuttings from Toyon bushes and at least five oak trees.Volunteers are shocked at the damage after many have worked so hard to protect it as a habitat for birds, wild animals, insects, and plants. This is where people can see willow flycatchers and the bollas spider.\"I'm sure this person thought he was doing a good thing,\" said Shani Kleinhaus, an environmental advocate with the Santa Clara Valley Audubon Society. \"Apparently he told one of our volunteers that he wanted to plant a butterfly garden. Well, this was a butterfly garden.\"San Jose's recreation and parks department relies on 600 volunteers to help with maintenance with its limited budget.The cut oak trunks show evidence a power saw was used, even though power tools are banned in the city's public parks. The volunteer was supposed to work within walkways, cutting down only dead, low-hanging tree branches, but the destruction extends deep into the sanctuary.\"There's only one volunteer manager-coordinator, and there are over 200 parks in the city with volunteers all over,\" said Jean Dresden, coordinator for San Jose Parks Advocates. \"How can they all be supervised closely?\"The city has asked the state to investigate if any wildlife has been harmed. A survey by volunteers last fall identified the garden as home to 193 species, including 91 birds that nest here in springtime.\"Those birds will come back, and their home is gone,\" said Dr. Kleinhaus. \"This is a home gone for a lot of birds, and it's a very tough time of year for them. They'll look for another place. They'll build another nest, but this had value.\"A spokesperson for the city's recreation and parks department said the volunteer responsible for what happened will be given a second chance. However, if he fails to follow instructions again, he will be banned from future clean-ups. The volunteer's name has not been released.",
    "source_domain": "abc7news.com",
    "title": "EXCLUSIVE: SJ wildlife, plant sanctuary damaged by 'overzealous' volunteer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/exclusive-sj-wildlife-plant-sanctuary-damaged-by-overzealous-volunteer/3235735/"
}