{
    "authors": [
        "Laura Anthony"
    ],
    "date_download": "2017-02-15 08:49:14+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 06:24:35",
    "description": "Though clearly grateful to be back home and eager to return to some sense of normalcy, some Oroville evacuees told ABC7 News they're already thinking about how to be better prepared if there is a next time.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Foroville-evacuees-return-home-worry-about-future%2F1755465%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755503_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The 200,000 people forced to evacuate their homes in Oroville have been told they can go back home.They were instructed to flee Sunday because a damaged spillway threatened to collapse and send water flowing into the valley north of Sacramento. Now, water levels at Lake Orville are dropping and it is expected to be low enough to handle an incoming storm.Work continues nonstop at the dam itself Tuesday night. The reprieve from mother nature has reduced the danger to surrounding communities, enough so that officials felt comfortable letting people return to their homes.\"We have concluded that it is safe to reduce the immediate evacuation order, currently in place to an evacuation warning,\" said Sheriff Kory Honea.Word came from the White House that Oroville and surrounding communities would be eligible for federal disaster relief.\"This situation is a textbook example of why we need to pursue a major infrastructure package in Congress,\" said White House Press Secretary Sean Spicer.By nightfall, the thousands of people who had left in such a hurry Sunday night were flowing back into downtown Oroville. Many businesses did not immediately open but prepared to Wednesday.Though clearly grateful to be back home and eager to return to some sense of normalcy, some here told ABC7 News they're already thinking about how to be better prepared if there is a next time.\"We're not sure if we're to keep our vehicles,\" said resident Chuck S. \"Not quite sure about that one yet.\"\"I'm still a little weary,\" said another resident Gail McElroy. \"Still got everything packed up.\"",
    "source_domain": "abc7news.com",
    "title": "Oroville evacuees return home, worry about future",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/oroville-evacuees-return-home-worry-about-future/1755465/"
}