{
    "authors": [
        "Allison Pecorin"
    ],
    "date_download": "2018-07-04 08:57:25+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 08:15:09",
    "description": "Special counsel Robert Mueller has focused much of its attention on key figures in President Trump's world. Here's where they stand in their legal battles.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fwhere-things-stand-for-some-key-trump-orbit-figures-in-muellers-universe-%2F3702325%2F.json",
    "image_url": "https://s.abcnews.com/images/Politics/manafort-gty-er-180702_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Since special counsel Robert Mueller was tasked with investigating potential ties between Russia and the Trump campaign over a year ago his team has issued more than 100 charges against at least 20 people and companies. The Mueller probe has led to additional investigations, including an ongoing probe by the U.S. Attorney for the Southern District of New York But as the summer months roll on, calls from the president and Republicans on Capitol Hill to wrap the investigations grow louder.Mueller's team has focused much of its attention on key figures in President Trump's world. Here are a few of those figures, and a look at where they stand in their legal battles.In an exclusive interview with ABC News Chief Anchor George Stephanopoulos Monday, the president's former fixer said his family and the country are his \"first loyalty,\" signaling a potential willingness to cooperate with the federal prosecutors. The special counsel's team has referred some potential legal issues related to Cohen's personal finances and businesses to federal prosecutors in New York's Southern District. Federal agents working that investigation launched an early morning raid in April at Cohen's home, office and the Manhattan hotel room where he was then staying, seizing millions of pages of documents, records and electronic devices.Cohen and his lawyers have been reviewing whether any of the records seized violate attorney-client privilege with the president as part of a joint defense agreement with the president and the Trump Organization. Sources have told ABC News they expect that agreement to end in the coming days.Cohen once said he would take a bullet for the president, but his recent statements show a rare glimpse of daylight between the man labeled \"Donald Trump's pitbull and his longtime boss\" as Cohen faces ongoing investigations into possible bank fraud. Cohen told the New York Times he paid adult actress Stormy Daniels $130,000 out of his personal account to keep her from revealing details about her alleged affair with the president just days before the 2016 election. In the search warrant executed against Cohen was a section related to the Daniels payment.Meanwhile, sources who have met with Mueller's team, have previously told ABC News they were asked about Cohen during their interviews. Cohen has not been charged with any crimes. Cohen told Stephanopoulos that once he understands what charges, if any, might be filed against him, he'd defer to his new counsel about how to respond. He has repeatedly denied any wrongdoing.\"I will not be a punching bag as part of anyone's defense strategy,\" Cohen said when asked by Stephanopoulos how he would respond if the president's legal team came after him. \"I am not a villain of this story, and I will not allow others to try to depict me that way.\"Michael Flynn served as President Donald Trump 's national security adviser for just 24 days before the president dismissed him amid growing controversy over his communications with a Russian ambassador in December 2016. In the following months, Flynn would be charged for lying to the FBI by Mueller's team, and would ultimately take a plea deal and agree to cooperate with the special counsel.A joint filing from Flynn's legal team and the special counsel's office Friday indicates that Mueller's team may not be finished with the president's former national security adviser. A status report on Flynn's sentencing was due Friday, but the joint filing said that the legal teams \"do not believe that this matter is ready to be scheduled for a sentencing hearing\" due to \"the status of the Special Counsel's Investigation.\"Flynn came under fire last year when it was reported that he had misled Vice President Mike Pence about communications he had with the Russian ambassador to the U.S. He was dismissed by the president in February 2017 and took a plea bargain to cooperate with the special counsel in December.Flynn has remained relatively out of the public eye but made an appearance in March on the campaign trail for Omar Navarro, a GOP Congressional candidate running against Democrat Maxine Waters. Flynn will have to appear in DC District Court for a status hearing on July 10, according to a new court filing. This will be his first court appearance since he agreed to cooperate.The president's former campaign chairman is currently behind bars as he awaits two upcoming trials in Virginia and D.C. on numerous counts including conspiracy against the United States, money laundering, tax evasion, bank fraud, failing to register as a foreign agent, and lying to the FBI among other charges. Many of the charges are related to Manafort's dealings with Ukraine, and none of the charges come from Manafort's time serving on the Trump campaign.Manafort has maintained his innocence since he was first charged in October 2017, but his former long-time business partner, Rick Gates, pleaded guilty to lying to the FBI in February and has since been cooperating with the special counsel's team. Gates had served as Manafort's deputy on the Trump campaign.A judge in the D.C. case revoked Manafort's bail on June 15 after allegations that he and Konstantin Kilimnik, a political consultant who prosecutors believe has ties with Russian intelligence officials, had been contacting potential witnesses. Manafort is scheduled to begin trial in Virginia later this month. He'll stand trial in Washington D.C. in September.Despite not being a household name, Papadopoulos was the first former Trump campaign adviser to plead guilty and cooperate with the special counsel's probe.After his plea, the president and advisers downplayed the significance of Papadopoulos' former role as a member of his campaign's foreign advisory council, calling Papadopoulos a \"low-level volunteer\". Ex-campaign adviser Michael Caputo described Papadopoulos as nothing more than a \"coffee boy\", a claim Papadopoulos' wife fiercely denied.The special counsel, however, thought Papadopoulos significant enough to charge him last year with lying to the FBI about communications he had with a foreign professor who allegedly told him that Russian officials were in possession of potentially incriminating Hillary Clinton emails. Papadopolous later pleaded guilty to the charge and has been cooperating with the special counsel since then.The Mueller team requested in late May that a pre-sentence investigation report be prepared for Papadopoulos, who has been free on bond since his guilty plea in October 2017. A judge last week set a sentencing date for Papadopoulos in September.Since he pleaded guilty last year, Papadopoulos' wife has said publicly that her husband had nothing to do with Russia during multiple interviews.Other individuals in the president's orbit have also been brought into focus as the investigation rolls on.Erik Prince, a Trump ally and founder of the private security firm Blackwater, recently acknowledged that he had cooperated with Mueller's investigation. Prince met with a Russian official during a trip to Seychelles but testified before Congress that the meeting was a chance encounter \"over a beer\". Sources told ABC News that the Mueller team is now probing Prince'scommunication records, potentially to determine whether there were inconsistencies in his testimony.Roger Stone, the president's long-time confidant and political adviser, has also been an ongoing subject of interest. The special counsel's grand jury interviewed Stone's social media aide in early June. Several of Stone's associates, including Sam Nunberg, Michael Captuo and Ted Malloch, have told ABC News that they were asked about Stone during their interviews with Mueller's team.",
    "source_domain": "abc7news.com",
    "title": "Where things stand for some key Trump orbit figures in Mueller's universe",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/where-things-stand-for-some-key-trump-orbit-figures-in-muellers-universe-/3702325/"
}