{
    "authors": [],
    "date_download": "2017-08-14 18:36:24+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 17:20:43",
    "description": "Lamonte Mims and Fantasy Decuir both pleaded not guilty today in the murder of a San Francisco photographer named Edward French.",
    "filename": "http%3A%2F%2Fabc7news.com%2F2-suspects-plead-not-guilty-to-san-francisco-twin-peaks-murder%2F2306906%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2287630_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lamonte Mims and Fantasy Decuir both plead not guilty in the July murder of San Francisco photographer Ed French on Twin Peaks — Kate Larsen (@KateABC7) August 14, 2017\nEd French's sister, Lorrie, partly blames the Judge who released Mims days before the shooting on a gun charge, based on a risk assessment — Kate Larsen (@KateABC7) August 14, 2017\nLamonte Mims, 19, and Fantasy Decuir, 20, both pleaded not guilty Monday in the murder of a San Francisco photographer named Edward French.Officials said the 71-year-old victim was shot on Twin Peaks in San Francisco in July.In court last Tuesday, it was revealed that Decuir allegedly shot French in order to steal his camera. Mims is also facing a murder charge for aiding and abetting.Family and friends of the former film location manager were in court on Tuesday. They told ABC7 News French was up on Twin Peaks taking pictures of the sunrise just before the shooting.In July 2016, Mims had been convicted of a burglary in San Mateo. While on felony probation, he was arrested on July 7 of this year for possessing a firearm. On July 11 he was arraigned in court, but released by a judge while waiting for his next hearing. Five days later, on July 16, police say both Mims and Decuir committed the crime.\"The final arbiter and decider of custodial status is the judge,\" said Alex Bastian with the San Francisco District Attorney's Office.",
    "source_domain": "abc7news.com",
    "title": "Two suspects plead not guilty to Twin Peaks murder of San Francisco photographer",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/2-suspects-plead-not-guilty-to-san-francisco-twin-peaks-murder/2306906/"
}