{
    "authors": [
        "Lyanne Melendez"
    ],
    "date_download": "2018-03-20 03:56:27+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 22:22:27",
    "description": "The three-story building on Union Street in North Beach has been red-tagged. Barricades have been set up to keep pedestrians away.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235499%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3235701_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The three-story building on Union Street in North Beach has been red-tagged and barricades have been set up to keep pedestrians away after a 4-alarm fire broke out Saturday night.The Building Department issued a notice of violation requesting that the owner provide an engineer's report within 24 hours and to brace the exterior brick walls as necessary under the direction of that engineer.Neighbors say firefighters responded quickly. We found Steve Lego who took this picture at 7:29 p.m. shortly after the first truck arrived.\"The way they attacked it, they were there, they were doing something, they seemed to know exactly what was going on. No one got hurt, my building didn't burn. Seems like a win to me,\" said Lego.But at least one city official has questioned the response of firefighters. Supervisor Aaron Peskin Saturday night said it took too long to put water on the fire.\"They completely, totally failed to address this working fire in a quick, efficient way,\" expressed Peskin while watching the fire.The President of the firefighters union explained what was happening when Supervisor Peskin arrived.\"He got there when we were going from an interior attack to an exterior attack, so it may have looked like we weren't putting water on the fire, but we were evacuating all of our members and setting up ladder-pipes. So to the untrained eye it may look like we weren't doing anything, but it's actually a very critical transition in the fire fight,\" said O'Conner.\" I think it was irresponsible for an elected official to try to tell them how to do their job and call for the resignation of the fire chief,\" said San Francisco Mayor Mark Farrell.Fire Chief Joanne Hayes-White was unavailable Monday and Peskin left a voice message on his cellphone saying he was out of town.",
    "source_domain": "abc7news.com",
    "title": "Building burned in San Francisco North Beach fire may need shoring up",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235499/"
}