{
    "authors": [
        "Amy Hollyfield"
    ],
    "date_download": "2018-03-20 03:40:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 13:52:59",
    "description": "A \"Celebration of Life\" memorial will take place tonight for three women killed at a veterans facility in Yountville. The victims were mental health workers in a program at the Veterans Home of California.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpublic-memorial-to-honor-victims-of-yountville-shooting%2F3233873%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3233906_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A \"Celebration of Life\" memorial will take place tonight for three women killed at a veterans facility in Yountville. The victims were mental health workers in a program at the Veterans Home of California.Doctor Jennifer Golick was a therapist, wife and mother to a 7-year-old daughter. Doctor Jennifer Gonzales Sushereba was nearly seven months pregnant. Her husband said she \"will always be remembered for her unconditional love and incredibly giving heart.\" Christine Loeber dedicated her life to helping veterans heal.The women were shot and killed by Army Veteran Albert Wong on March 9 before he took his own life.This evening's memorial will be held at the Napa Valley Performing Arts Center at Lincoln Theater. It is open to the public.They are expecting quite a turn out tonight and are planning for overflow seating. Families of at least two of the victims have said they will be there. Speakers will include the Mayor of Yountville, Congressman Mike Thompson and an alum of the Pathway Home which is where the three victims worked.There will also be some four-legged friends willing to offer some comfort.\"Beta and myself, as well as several other service dogs and their companions and handlers will be here at the services Monday night, just in case people need an extra little hug,\" said Linda Powers, comfort dog handler.The theater holds 1,200 people and is expected to reach capacity. Doors will open at 4:30 p.m. and seating will be on a first-come, first-serve basis. They have made arrangements to show the ceremony live at a few different locations on the property of the veterans home for those who can't get into the theater. They will also be showing it downtown at the Yountville Community Center. The local radio station will be playing it.Safeway has donated drinks and snacks for the crowd to enjoy after the ceremony.",
    "source_domain": "abc7news.com",
    "title": "Public memorial to honor victims of Yountville shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/public-memorial-to-honor-victims-of-yountville-shooting/3233873/"
}