{
    "authors": [
        "Meena Venkataramanan"
    ],
    "date_download": "2018-07-04 14:25:00+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 13:10:46",
    "description": "A July 2 report from the National Partnership for New Americans found a \"shocking\" 88 percent increase in citizenship application processing backlog since 2015.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fa-shocking-increase-in-citizenship-application-backlog-new-report-finds%2F3703467%2F.json",
    "image_url": "https://s.abcnews.com/images/Politics/naturalization-gty-er-180703_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A July 2 report from the National Partnership for New Americans found a \"shocking\" 88 percent increase in citizenship application processing backlog since 2015.The report, presented at a news conference with House members Zoe Lofgren, D-Calif., and Luis Gutierrez, D-Ill., found that the backlog of roughly 390,000 naturalization applications has \"skyrocketed\" to nearly 730,000 over the past two years, during the Trump administration and the end of the Obama administration.\"There's been a shocking increase in the backlog. Nearly three-quarters of a million legal permanent residents eligible for citizenship are awaiting processing of their naturalization applications,\" Joshua Hoyt, executive director of the National Partnership for New Americans, a coalition of immigrant rights groups, told ABC News.U.S. Citizenship and Immigration Services, the government agency that oversees the naturalization process, rejected claims made by the report.\"The truth is that the total number of people the U.S. naturalizes each year has remained virtually unchanged. What we're looking at is a dishonest and desperate attempt by open borders advocates to undermine the work of Homeland Security officials, law enforcement and the administration to protect the integrity of our immigration system and uphold the rule of law,\" U.S.C.I.S. spokesperson Michael Bars said in a statement.The report found that after applicants have submitted a 21-page naturalization application, paid a $730 application fee, and provided fingerprints for a background check, they could wait as long as 20 months for their applications to be processed.\"This backlog is either a consequence of bad, inefficient government that's not accountable to the people, or malevolent voter suppression that's part of the Trump administration's aggressive agenda toward immigrants,\" said Diego Iniguez-Lopez, the organization's policy and communication associate who authored the report.The Federation for American Immigration Reform, a conservative-leaning immigration reform group, attributed the backlog to the admission of large numbers of immigrants.\"It's possible that we are admitting immigrants faster than we can process them, and that suggests that perhaps we are admitting too many immigrants. Most Americans support lower levels of immigration, which would certainly help address this problem,\" Dave Ray, FAIR's communications director, told ABC News. \"The enormous backlog is likely due to increased vetting, something that was likely not happening under the Obama administration.\"Ray added that a \"one year-wait\" for naturalization is \"not in any way unreasonable.\"\"In 1996, the wait was four to six years for a decision on the N-400 application and another 1-2 years for an oath ceremony,\" he said.Meanwhile, Hoyt said that naturalization ceremonies are fully-funded by application fees paid by new citizens.\"The U.S. spends billions of dollars in taxpayer money to pay for a literal army of immigration enforcement and border security agents. But not a dime of taxpayer money is spent to fund oath ceremonies,\" he said. \"Those are fully paid for by people hoping to become citizens. And the government is slow-walking the process.\"Iniguez-Lopez said according to the report, while the number of naturalization applications has decreased in the last quarter, U.S. Citizenship and Immigration Services has also decreased its rate of processing them and increased its denial of these applications in a manner that is \"arbitrary\" and \"lacks geographic uniformity.\"\"They are arbitrarily targeting people who have a constitutional right to citizenship and preventing them from becoming citizens and using their voting power,\" he said of the agency, which is part of the U.S. Department of Homeland Security.But Bars said the \"current pending workload does not equate to a backlog.\"\"It's a statistic used in the USCIS report to include every application for naturalization filed including those filed in recent days and weeks-and is being inaccurately portrayed as evidence of delays. Many of these cases, which can remain pending from one quarter to the next, are well within the processing time goal established by the agency with variances being a direct result of geography and capacity,\" Bars said in a statement.Hoyt added that during the Trump presidency, the agency's focus has \"changed\" from one of \"customer service\" to a mission of \"preventing fraud.\"\"(U.S. Citizenship and Immigration Services) created a brand new unit, which is basically a witch-hunt to find fraud in naturalization applications and denaturalize people,\" he said.Bars said that combating instances of \"fraud, abuse and other nefarious activities\" is a \"critical part\" of the agency's mission.\"Those who obtained the great privilege of citizenship through deliberate and intentional acts of fraud have committed crimes against the American people and the U.S. government, and as such, this privilege should be revoked. Those who have cheated the system in order to undermine legitimate, law-abiding applicants seeking greater opportunity, prosperity, and security will be rightfully referred to the Department of Justice,\" Bars said.\"Nobody who obtained U.S. citizenship by deliberately assuming a false identity will be surprised to learn they are being referred to the Justice Department for denaturalization proceedings. USCIS screens for deliberate acts of fraud relating to forgery or the use of false identities, and we go to great lengths to ensure individuals aren't susceptible to instances of error, misunderstanding, or special circumstances,\" he said.Ray added that the agency \"shouldn't be judged based on how many applications they process, but rather on how many applications they process right.\"\"This report is written to make it sound like immigrants are being denied a right. Immigrants don't have a right to citizenship. They can apply and will be granted if they qualify. Those who don't qualify may be denied, even if eligible to submit an application,\" he said. \"Citizenship fraud has long been a problem and it's high time the issue was addressed.\"Meanwhile, Hoyt outlined five steps the National Partnership for New Americans is taking to address the findings of the group's report.\"First, we released the report to show that there's a likelihood that the government is intentionally slow-walking the [naturalization] process. Then, we informed Lofgren and Gutierrez, who released a sign-on letter to petition U.S.C.I.S. to invest resources to return processing times to an average of six months or less,\" he said.Hoyt added that the group has additionally informed \"mayors all over the country\" of the report, who are \"circulating a sign-on letter\" to U.S.C.I.S. to address the concerns highlighted in the document.\"We've also told immigrant advocacy organizations all over the country about the report. And fifth, we're filing a Freedom of Information Act request asking for the internal communications of U.S.C.I.S. to find out if they're targeting specific religions, such as Muslims, and nationalities, such as Mexicans. We want to know if these groups are being disproportionately affected by the backlog,\" he said.Both Iniguez-Lopez and Hoyt added that the backlog could leave an impact on the upcoming November midterm elections.\"(U.S. Citizenship and Immigration Services) increased the backlogs in at least 19 states and territories,\" Iniguez-Lopez said, pointing to states with large immigrant populations including Texas, Maryland, and Arizona.Hoyt said that these states, plus the states with the largest overall backlogs - including California, New York, and Florida, are areas in which \"elections could move either way.\"\"In high immigrant-receiving states, new citizens can help change the state's politics,\" he said, pointing to toss-up elections in Arizona, Florida, and Colorado where he believes the votes of new citizens could be crucial.He provided the example of Florida, where there are open seats for governor and U.S. senator, but where \"88,000 people have submitted citizenship applications that are still being processed.\"But even if these applications are not processed in time for the upcoming midterms, the National Partnership for New Americans is hoping that they will be ready in time for the 2020 presidential election.\"We're encouraging people to apply for citizenship as soon as possible,\" Hoyt said. \"Their votes are going to be politically impactful.\"",
    "source_domain": "abc7news.com",
    "title": "A 'shocking increase' in citizenship application backlog, new report finds",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/a-shocking-increase-in-citizenship-application-backlog-new-report-finds/3703467/"
}