{
    "authors": [
        "Wayne Freedman"
    ],
    "date_download": "2017-08-15 02:10:30+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 01:00:41",
    "description": "If the sound of hard wheels rolling across bricks doesn't give it away, then the sight of bins filled with bedding and microwaves, will. Or else, all of those parents having awkward goodbyes with their kids.",
    "filename": "http%3A%2F%2Fabc7news.com%2Feducation%2Fsaying-goodbye-to-your-freshman-move-in-day-at-uc-berkeley%2F2308385%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308393_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "If Reese Gullenheimer looks a bit overwhelmed, there's a good reason. #UCBerkeley #abc7now He's moving in for Freshman year. pic.twitter.com/PoCPsRumkr — Wayne Freedman (@WayneFreedman) August 14, 2017\nIts a madhouse outside the #UCBerkeley dorms today. Traffic jams. Parents. #abc7now Freshmen moving in. pic.twitter.com/K06VAE4vWc — Wayne Freedman (@WayneFreedman) August 14, 2017\nWhether #UCBerkeley or any college/university, this is a lifetime experience. 2nd maybe to 1st day of school. Rough on parents. #ABC7now pic.twitter.com/vxhomY5lZs — Wayne Freedman (@WayneFreedman) August 14, 2017\nI have done this day with my own daughter. Was an emotional wreck. #abc7now pic.twitter.com/qSG4ywq6Xo — Wayne Freedman (@WayneFreedman) August 14, 2017\nReese going 6500 new freshmen from all 50 states, 54 countries. 69 percent of #UCBerkeley frosh from California. Average GPA. 3.88. #abc7now pic.twitter.com/Y1EI1tofgF — Wayne Freedman (@WayneFreedman) August 14, 2017\nAverage #UCBerkely tuition and board for Cal residents will be $34,400. #abc7now pic.twitter.com/q4A7aSI8RK — Wayne Freedman (@WayneFreedman) August 14, 2017\nThe first night without your kid under your roof is the toughest, Dad. #UCBerkeley #abc7now pic.twitter.com/itI8oDvRtV — Wayne Freedman (@WayneFreedman) August 14, 2017\nIf the sound of hard wheels rolling across bricks doesn't give it away, then the sight of bins filled with bedding and microwaves, will. Or else, all of those parents having awkward goodbyes with their kids.\"I'm going to cry later,\" said Carl Gullenheimer, a single father, as he dropped off his first-born son Reese for freshman year at UC Berkeley.\"What were you thinking those last few days with him at home?\" I asked.\"I would like him to pack, maybe?\"Carl and Reese would be one story among six-thousand, five-hundred new freshmen making their way through heavy Berkeley traffic to dorm rooms, this year. This is a universal story, repeated anywhere with a dorm and young students leaving home.For the kids, this is the day that marks the beginnings of their adult lives. For their parents, well, if you have been through this experience, then you know the mixture of emotions.\"When he got into UC Berkeley his head popped off,\" said Carl of Reese, a computer science major with a 4.66 GPA -- good enough to make the waiting list at Cal Berkeley, and eventually, to be admitted. It's tough competition.Fifty-three percent of this year's freshmen are female. Sixty-nine percent are California residents. Others come from all fifty states, territories, and fifty-four countries.Reese and his Dad hail from Scotts Valley. \"What will you miss about home?\" I asked Reese.\"My bed,\" he said.\"You know this is tougher on your dad than on you?\"\"I do,\" he said.\"I remember the first time he got a bloody lip,\" reminisced Carl. \"I don't know how 18 years went by so fast.\" At that point, he began choking up. We turned off the camera.\"You'll be alright,\" I told him. Having gone through this with my daughter, I know from experience that the first separation will get easier after that first night.",
    "source_domain": "abc7news.com",
    "title": "Saying goodbye to your freshman: Move in day at UC Berkeley",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/education/saying-goodbye-to-your-freshman-move-in-day-at-uc-berkeley/2308385/"
}