{
    "authors": [
        "Melanie Woodrow"
    ],
    "date_download": "2017-02-15 02:47:08+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:15:09",
    "description": "California Highway Patrol officers say they've determined the cause of dozens of cracked windshields on State Route 24 and Interstate 680. Victims thought someone was throwing rocks off the overpass.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fchp-says-damage-to-cars-on-680-from-road-debris-not-thrown-objects%2F1755005%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755234_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CHP says it's not someone but rather something responsible for 55 shattered windshields at 24 & 680 since Dec. -- 4pm @abc7newsbayarea pic.twitter.com/1ky6CYE5v0 — Melanie Woodrow (@MelanieWoodrow) February 14, 2017\nCalifornia Highway Patrol officers say they've determined the cause of dozens of cracked windshields on State Route 24 and Interstate 680.Victims thought someone was throwing rocks from the overpass.Part of this investigations involved the CHP actually staking out multiple spots for long periods of time over several weeks.A spokesperson says they found absolutely no evidence of anyone throwing anything onto the freeway, but when they looked down they found something else--shattered windows and broken glass.\"It was just such a scary moment,\" said Alamo resident Sereta Church. \"And I can still hear the sound. It was so awful.\"It has happened dozens of times since December.\"To date, we've had about 55 reports to CHP,\" said Brandon Correia of the Contra Costa CHP.Often where I-680 meets Hwy 24 is near an overpass. Now CHP says it's not someone whose responsible. It's something.\"Investigation with our allied partners points to the roadway and debris on the roadway falling apart and being kicked up by motorists,\" Correia told ABC7 News.\"I have a really hard time believing that a truck or other vehicle kicked a 10-15 pound rock 20 feet in the air,\" said San Mateo resident Alex Green.Caltrans says it has submitted contracts for emergency projects. The work will be for approximately 5 miles of I-680 Southbound and one mile of SR-24.\"We've had four months, five months of really heavy rain, inclement weather that further deteriorates the roadway,\" Correia added.Caltrans says maintenance crews have conducted sweeping operations in the area approximately 10 times since late December to mitigate any loose materials on the roadway which the agency says is safe to travel.",
    "source_domain": "abc7news.com",
    "title": "CHP says damage to cars on 680 from road debris, not thrown objects",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/chp-says-damage-to-cars-on-680-from-road-debris-not-thrown-objects/1755005/"
}