{
    "authors": [],
    "date_download": "2018-04-24 17:07:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:00:04",
    "description": "As Meghan Markle and Prince Harry prepare to walk down the aisle on May 19, they are released details about the music for their royal wedding.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fprince-harry-and-meghan-markles-royal-wedding-music%2F3386436%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/automation/vod/3246612_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Both Prince Harry and Ms. Markle have taken a great deal of interest and care in choosing the music for their Service, which will include a number of well-known hymns and choral works.⁰⁰\nFind out more here: https://t.co/cy4c3rjDUi — Kensington Palace (@KensingtonRoyal) April 24, 2018\nAs Meghan Markle and Prince Harry prepare to walk down the aisle on May 19, Kensington Palace has shared details about the music for their royal wedding service at St. George's Chapel.James Vivian, Director of Music for the chapel, will serve as the music director for the wedding. Vivian will conduct the Choir of St. George's Chapel, which is comprised of up to 23 boys from St. George's School and 12 Lay Clerks singing alto, tenor and bass.Cellist Sheku Kanneh-Mason, 19-year-old winner of the BBC Young Musician 2016, was personally called by Markle to perform at the wedding. The Kingdom Choir, founded and directed by Karen Gibson, will also perform at the wedding.The orchestra, conducted by Christopher Warren-Green, will be comprised of musicians from the BBC National Orchestra of Wales, the English Chamber Orchestra and the Philharmonia. Soprano Elin Manahan Thomas and trumpet player David Blackadder will join the orchestra.Luke Bond will play organ for the wedding, and the State Trumpeters will provide ceremonial support during the service.",
    "source_domain": "abc7news.com",
    "title": "Prince Harry and Meghan Markle's royal wedding music",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/prince-harry-and-meghan-markles-royal-wedding-music/3386436/"
}