{
    "authors": [
        "Julia Macfarlane"
    ],
    "date_download": "2018-03-20 03:41:54+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 14:09:19",
    "description": "They will study the substance at the military research facility Porton Down.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fchemical-weapons-inspectors-arrive-in-uk-for-tests-on-nerve-agent%2F3233915%2F.json",
    "image_url": "http://a.abcnews.com/images/International/salisbury-crime-scene3-rt-mem-180319_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Inspectors from the Organization for the Prohibition of Chemical Weapons (OPCW) are arriving in the U.K. to assess samples of the nerve agent used in the attack against former Russian double-agent Sergei Skripal and his daughter earlier this month.The OPCW team will study the substance at the military research facility Porton Down, which is located just outside the city of Salisbury, where the attack took place.The team will also meet with detectives leading the investigation into the poisoning attack.The British government invited the delegation from the Hague, where the monitoring body is based, to carry out an independent study to identify the substance used in the attack.U.K. officials believe the Skripals were exposed to a military-grade, Soviet-era nerve agent developed by the Russians.On Sunday ABC News revealed that intelligence officials believe the substance is a \"dusty\" organophosphate akin to the Novichok chemicals, and may have been administered through the car's ventilation system.The intelligence officials told ABC News up to 38 individuals in Salisbury were affected by the nerve agent but the full impact is still being assessed and more victims sickened by the agent are expected to be identified.It will be weeks before the OPCW announces the results of its tests.U.K. Foreign Secretary Boris Johnson has accused Russia of stockpiling the nerve agent over the last decade. Johnson also dismissed a suggestion from Russia's ambassador to the E.U. that the agent may have come from a U.K. laboratory in Porton Down.The British government announced sanctions against Russia last week, expelling 23 diplomats they have identified as undercover spies, as well as announcing new measures to sanction individuals, bolster counterterrorism efforts and increase funding to Porton Down.The Kremlin, which has condemned the British accusations as \"nonsense,\" retaliated by expelling the same number of British officials based in Russia.E.U. foreign ministers in Brussels asserted their solidarity with the U.K. over the incident. A statement from the bloc called on Russia to \"address urgently the questions raised by the UK and the international community and to provide immediate, full and complete disclosure of its Novichok programme to the Organisation for the Prohibition of Chemical Weapons .\"The statement did not explicitly accuse Russia of responsibility, dampening British hopes of a more muscular E.U. response to the crisis.Russian President Vladimir Putin , who on Sunday was re-elected to another term, said \"it's complete nonsense to imagine that anyone in Russia could resort to such tricks ahead of the presidential elections and World Cup.\"",
    "source_domain": "abc7news.com",
    "title": "Chemical weapons inspectors arrive in UK for tests on nerve agent",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/chemical-weapons-inspectors-arrive-in-uk-for-tests-on-nerve-agent/3233915/"
}