{
    "authors": [
        "Bill Hutchinson"
    ],
    "date_download": "2018-03-20 03:57:57+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 19:36:18",
    "description": "While missing Pennsylvania teenager Amy Yu was found safe over the weekend in Mexico with 45-year-old Kevin Esterly, whom she was allegedly having a romantic relationship with, the case stretches back farther than the 13 days she was missing.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3234922%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/wpvi/images/cms/3230594_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos Teen and man who often got her out of school located in Mexico, authorities said.\nEMBED >More News Videos Mexican authorities have issued an Amber Alert for a missing Allentown teen and a 45-year-old man who signed her out of school, saying the pair is believed to be traveling through the country.\nWhile missing Pennsylvania teenager Amy Yu was found safe over the weekend in Mexico with 45-year-old Kevin Esterly, whom she was allegedly having a romantic relationship with, the case stretches back farther than the 13 days she was missing.From interviews with family, friends, police, attorneys in the case, as well as court affidavits, here's what we know:--Yu and her mother, Miu Luu, meet Esterly, a construction contractor, at a church in Lowhill Township, Pennsylvania. Amy is about 7 or 8 years old.--Yu signs documents at Lehigh Valley Academy Charter School in Hanover Township, Pennsylvania, describing Esterly as her stepfather, which allows him to check her out of school.--Yu's mother goes to pick up her daughter at Lehigh Valley Academy Charter and learns that Esterly had already picked her up and that Yu had listed him on school documents as her stepfather. The mother also discovers that Esterly had signed out her daughter from school at least 10 times. Luu confronts Esterly that same day over why he had been secretly picking up her daughter at school.--Allentown police investigators visit Esterly and his wife, Stacey, at their Allentown home and advises them both to stay away from Yu and that the girl's mother didn't want them to have any further contact with her.--Luu drops Yu off at her bus stop, but the teenager doesn't take it to school. On the same day, Esterly withdrew $4,000 from his wife's bank account. Luu reports her daughter missing to the Allentown Police Department.--Allentown police issue a missing person alert for Yu and obtain a warrant for Esterly's arrest.--Police discover that Yu and Esterly boarded a one-way flight from Philadelphia to Cancun, Mexico, which briefly stopped in Dallas.--Luu speaks to ABC News, saying, she was \"waiting and waiting and praying, and I don't know if they can catch him [Esterly] or not.\" She also says Esterly's daughter \"is a friend and just one year younger than Amy. I never thought he would act like that.\"--: Authorities in Mexico issue an Amber Alert for Yu.--Esterly's wife, Stacey, issues a statement through her attorney, saying she and her husband fought over his relationship with Yu and she pleaded with the teenager to come home.--Authorities in Mexico find Yu and Esterly at a Puerto Moreles resort near Cancun and arrest Esterly on suspicion of child custody interference. Both Esterly and Yu are flown back to Miami , where he was awaiting extradition to Pennsylvania.",
    "source_domain": "abc7news.com",
    "title": "Timeline of Pennsylvania teen's journey to Mexico and back",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3234922/"
}