{
    "authors": [],
    "date_download": "2018-03-20 03:58:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 18:49:59",
    "description": "Two women spoke out publicly on Monday, accusing actor Steven Seagal of sexually assaulting them when they were in their teens.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3234783%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kabc/images/cms/3234173_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two women spoke out publicly on Monday, accusing actor Steven Seagal of sexually assaulting them when they were in their teens.The two women, Regina Simons and Faviola Dadis, gave their accounts of the alleged incidents during a news conference alongside their attorney, Lisa Bloom.Simons said she was cast as an extra on Seagal's 1994 thriller \"On Deadly Ground.\" When the film was completed, she said the actor invited her to a wrap party at his house. She soon noticed she was the only one there.When she asked where everyone was, Seagal told her everyone left the party. It was then that he took her hand and led her into a room, she said.\"He closed the door and approached me from behind. He started kissing my neck and taking off my clothes. I was in shock,\" she said. \"Seagal was more than twice my size and twice my age. I was not sexually active or had ever been naked in front of a man before.\"She said he had sex with her while tears ran down her face.\"There was nothing consensual about this,\" she said.She said when he was done, he asked her if she needed any money. She told him \"no\" and ran for the door.Simons said he tried to contact her after the incident, but she did not speak with him or come forward with her story. She said she was too depressed and traumatized and has come forward now as an attempt to heal.\"I pray that my abuser can also heal. I want him to be aware...and apologize,\" Simons said.Dadis said she was 17 years old when she was sexually assaulted in 2002. As a model and vocalist at the time, she was introduced to Seagal for a recording project.Following two auditions, she said they were friends who spoke by text. Soon after, Dadis was invited to another audition for Seagal to \"evaluate\" her figure to see if she would be suitable for the role.\"He asked me to book a room myself at the W in Beverly Hills, and I explained that I did not have the funds to do so, and I did not feel comfortable doing this, and I suggested he should book the hotel himself, and he did,\" Dadis said.Seagal's assistant asked her to wear a bikini or bra and panties underneath her clothes and said it's standard procedure, so Dadis agreed.Once in the elevator, the assistant allegedly said, \"Steven's word is as good as gold,\" and then left the two alone. Dadis said she was surprised but did not comment.While inside the room, Seagal asked Dadis to take off her clothes and do a catwalk across the room.\"I did so and Steven approached me and said that he would like to act out a romantic scene to get a sense of our chemistry. I felt uncomfortable, and I shyly expressed this,\" she said.Dadis detailed that Seagal ignored her wishes and slipped his hands inside her bikini and on private areas.\"Steven sat there calmly as if nothing had happened while I was visibly upset,\" Dadis said.She said his security guard blocked the doorway and only moved when Seagal signaled him to do so.Dadis said Seagal attempted to reach out to her after that night, but she did not respond. She said she didn't tell anyone about the incident for a month because she felt it was her fault.\"After many years, I've finally reported this incident to the LAPD in hopes that my statement will provide support for other women,\" Dadis said.The Los Angeles Police Department confirms it has opened a criminal investigation into an alleged sexual assault by Seagal.Multiple actresses have accused Seagal of sexually harassing them. He has not commented on the accusations.",
    "source_domain": "abc7news.com",
    "title": "2 women claim Steven Seagal sexually assaulted them in their teens",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3234783/"
}