{
    "authors": [
        "Melanie Woodrow"
    ],
    "date_download": "2018-07-04 16:07:36+00:00",
    "date_modify": null,
    "date_publish": "2018-07-03 18:19:12",
    "description": "The family of Jahi McMath spoke out after Jahi passed away in New Jersey following a recent surgery.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ffamily%2Fjahi-mcmaths-family-speaks-out-following-her-death%2F3698377%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/542287_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos The mother of Jahi McMath, the Oakland girl at the center of the medical and religious debate over brain death, held a press conference in San Francisco.\nJahi's mother describes her daughter's passing pic.twitter.com/b4789Eu5or — Melanie Woodrow (@MelanieWoodrow) July 3, 2018\n\"Stop pulling the plug on your people.\" \"Do not let the hospital bully you.\" pic.twitter.com/JZJyULzCZZ — Melanie Woodrow (@MelanieWoodrow) July 3, 2018\n\"She was always alive,\" says McMath's mother. She says she believes she would have lived longer in CA. Commends NJ for their compassion. pic.twitter.com/46Ff8q7WBh — Melanie Woodrow (@MelanieWoodrow) July 3, 2018\n\"I wish I could paint her nails.\" Mom says she doesn't know what to do now without Jahi. pic.twitter.com/N9SVYBrJzj — Melanie Woodrow (@MelanieWoodrow) July 3, 2018\nThere are new details Tuesday on the death of Jahi McMath. California doctors declared McMath brain dead in 2013 following complications from tonsil surgery.A life or death battle ensued between McMath's family, the hospital and the state. On Tuesday, her family spoke out after Jahi passed away in New Jersey following a recent surgery.McMath's mother, Nailah Winkfield, described how her daughter had the whole world \"stirred up\" without saying a word.\"They really didn't want Jahi to live, they didn't want her to beat the odds, but that little black girl from Oakland made history and I'm so proud of her,\" said Winkfield.For four and a half years, McMath survived on life support.\"The only regret I ever had was bringing her to the hospital to get her tonsils removed,\" said Winkfield.The family says they gave up everything to move to Jahi to New Jersey.\"We had to leave everything behind,\" said Marvin Winkfield.\"Shame on California and thank God for states like New Jersey who have religious exemptions,\" said Jahi's uncle, Omari Sealey.On June 22 of this year, following a surgery, Nailah says Jahi's heart stopped beating and she coded.\"My child was never dead, she was always alive and I thank God that the state of New Jersey realized that and that's why she has a whole other death certificate with a whole other cause of death,\" said Winkfield.Jahi's funeral will be Friday in Oakland. For a time Tuesday, her attorney said he wasn't sure the funeral could proceed, but during the press conference the Alameda County Coroner's Office said it had no hold on the case.Winkfield says she wants to be an advocate for other families.\"I just have to tell everybody stop pulling the plug on your people, stop, I don't care what color you are. I don't care what race you are. Stop letting the doctors tell you to prematurely disconnect your family members,\" said Winkfield.She also says she wants to help lawmakers pass legislation so that no other family has to endure what hers did.There are two lawsuits currently underway; one regarding the Alameda County death certificate the family's attorney says is invalid and another one claiming that Jahi received too many surgeries on the same day and bled to death.The funeral is open to the public per McMath's family. It is Friday at 11 a.m. at Acts Full Gospel Church in Oakland.",
    "source_domain": "abc7news.com",
    "title": "Family of Oakland teen who ignited debate on brain death, Jahi McMath, speaks out following her death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/family/jahi-mcmaths-family-speaks-out-following-her-death/3698377/"
}