{
    "authors": [
        "Laura Anthony"
    ],
    "date_download": "2017-08-15 00:39:26+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 21:16:40",
    "description": "Health care workers in Oakland held a rally in support of a nurse who's being deported.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ffamily%2Fhealthcare-workers-rally-around-oakland-nurse-facing-deportation%2F2307582%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2294736_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "#BREAKING #Oakland nurse Maria Mendoza Sanchez, about to be deported after 20 yrs in country. Message to @POTUS pic.twitter.com/aVFmQlanCM — Laura Anthony (@LauraAnthony7) August 14, 2017\nWith just one day to go before Maria Mendoza Sanchez and husband Eusebio must leave the country, the Highland Hospital cancer nurse made a direct appeal to President Donald Trump , one parent to another.\"One of the things I admire about him s that he is a loving father, \" said Sanchez, standing amid supporters in front of Highland. \"He loves his kids very much and his grandchildren too. I just him to realize how would he feel if all of a sudden something would happen to Ivanka.\"The Sanchez' were surrounded by other healthcare workers and supporters at a rally demanding the couple be allowed to stay in the United States. \"We have to show the world and this country that there's no such thing as an illegal human,\" said Josie Camacho with the Alameda Labor Council. \"We have families here, we have mothers... we have nurses.\"Last Thursday, U.S. Senator Dianne Feinstein met with the Sanchez family at their East Oakland home.Feinstein and U.S. Senator Kamala Harris are both working behind the scenes to try to persuade ICE, Immigration, and Customs Enforcement, to stop deportation proceedings.The government first began trying to deport them in 2002, but since they had jobs, paid taxes and stayed out of legal trouble, the Obama Administration let them stay on a year to year basis. The Trump administration has put a stop to that. They have four children, three of them U.S. citizens.Last week, ICE issued the following statement: \"The courts consistently held that neither of these individuals has a legal basis to remain in the U.S. While ICE continues to prioritize its enforcement resources to focus on individuals who pose a threat to national security, public safety and border security, ICE will not exempt classes or categories of removable aliens from potential enforcement.\"\"There are a lot of good people out there,\" said Maria Mendoza-Sanchez. \"They're good people. They deserve the chance to be given the opportunity to be here and make a difference for this country.\"As it is now, the couple is set to fly to Mexico Tuesday afternoon with their 12-year-old son. Three older daughters will stay behind in the Bay Area.",
    "source_domain": "abc7news.com",
    "title": "Healthcare workers rally around Oakland nurse facing deportation",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/family/healthcare-workers-rally-around-oakland-nurse-facing-deportation/2307582/"
}