{
    "authors": [
        "Benjamin Siegel"
    ],
    "date_download": "2018-04-24 15:24:11+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 12:04:45",
    "description": "After a run of negative headlines, Environmental Protection Agency Administrator Scott Pruitt is headed to Capitol Hill.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fscott-pruitt-expected-to-face-ethics-questions-in-front-of-congress%2F3385817%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/AP-pruitt-02-as-170118_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "After a run of negative headlines, Environmental Protection Agency Administrator Scott Pruitt is headed to Capitol Hill this week for two congressional hearings, where his performance under tough questioning from Democrats and Republicans could play a role in his future in the administration.The hearings are about the EPA's budget, but they also offer lawmakers an opportunity to ask about other concerns including allegations that the agency has been misusing taxpayer dollars.The renewed wave of criticism directed at Pruitt followed a report by ABC News that he'd been living in a condo owned by the wife of a prominent lobbyist. Pressure grew after media reports showed Pruitt circumvented the White House to grant pay raises to several staffers. And there have been new questions about his spending on travel and an around-the-clock security detail.\"It's an important hearing for him particularly under the various clouds he's under at the moment,\" said Myron Ebell, the director of the Competitive Energy Institute's Center for Energy and the Environment, who led the Trump EPA transition team.Pruitt is also facing new headlines this week about a previously undisclosed meeting with the lobbyist, J. Steven Hart, in July of 2017 when he was living in a condo co-owned by Hart's wife, who's also a lobbyist, raising questions about previous statements both Hart and Pruitt have made about their dealings.The embattled agency chief, the former attorney general of Oklahoma, has denied wrongdoing.His spending and possible ethics violations are the subjects of 10 separate investigations, after the EPA's inspector general informed Congress last week that it would review his use of agency security for personal trips. In recent weeks, roughly 170 Democrats have called for his resignation, and he drew sharp comments from some Republicans, including four who joined in calls for his dismissal.Ahead of the hearings, Democrats have raised fresh questions about the agency's decision to spend more than $43,000 to install a \"secure phone booth\" and conduct a sweep for listening devices in Pruitt's office, claiming that EPA documents indicate that the sweep and booth did not meet government security standards.\"He's very articulate, he knows what his agenda is, so I don't think the questions about policy will be particularly challenging for him,\" Ebell said. \"The questions about his personal conduct will be something Democrats will focus on.\"If there are more accusations that come out, he is vulnerable.\"Throughout, Pruitt has maintained public support from President Donald Trump . But the White House has launched its own review of his actions on granting raises to several top aides who moved with him from Oklahoma. Press secretary Sarah Sanders deflected several questions about Pruitt on Monday, and credited the agency chief's success in walking back regulations.\"We're reviewing some of those allegations,\" Sanders said. \"However, Administrator Pruitt has done a good job of implementing the president's policies, particularly on deregulation, making the United States less energy-dependent, and becoming more energy-independent. Those are good things.\"Pruitt's travel has been a particularly sore spot with some in the White House. He made repeated trips to his home state of Oklahoma in his first few months as administrator. After the EPA's internal watchdog agreed to look into those trips in August and the president fired former Health and Human Services Secretary Tom Price for the cost of his travel the next month, questions about Pruitt's travel attracted even more attention.The EPA inspector general is also expected to release reports about Pruitt's official travel for all of 2017 and his security detail, which the agency says was increased to 24-7 protection in response to increased threats against Pruitt. Those inquiries are expected to look at Pruitt's frequent use of first-class flights recommended by his security detail and whether the agency followed all proper procedures.There are signs the lingering questions about his spending are wearing on Republicans.Rep. Trey Gowdy, R-S.C., chairman of the House Oversight Committee, has asked for documents and records regarding Pruitt's travel and security costs, and for interviews with at least five of Pruitt's top aides. That request came not long after top Democrats on the committee said they have reviewed internal EPA documents that question whether Pruitt's security detail exaggerated the threats against him to justify expenses like the first-class flights.In a recent interview with Fox News, Gowdy was skeptical of the EPA argument that Pruitt has flown first class on work trips because of security threats.Pruitt told reporters he would direct his staff to book him on more coach flights.\"The notion that I've got to fly first class because I don't want people to be mean to me, you need to go into another line of work if you don't want people to be mean to you. Like maybe a monk, where you don't come in contact with anyone,\" he said.Republican staff on the House Energy and Commerce Committee have also been in contact with the EPA regarding Pruitt's controversial spending.\"I certainly think he has a responsibility to answer significant questions that have been raised and I do not think he has done so,\" Rep. Leonard Lance, R-N.J., said.Kevin Chmielewski, Pruitt's former deputy chief of staff, has met with congressional investigators in the House and Senate, after claiming Pruitt retaliated against him for questioning his travel spending.On Friday, law firm Williams & Jensen indicated in a new filing that Hart lobbied the EPA in early 2018 on behalf of Smithfield Foods. Ryan Williams, a spokesman for Hart, said the lobbyist, along with former Smithfield vice president Dennis Treacy, met earlier with Pruitt -- in 2017 -- in a personal capacity.Hart and Smithfield Foods denied that any lobbying took place.\"I assisted a friend who served on the Chesapeake Bay Commission, and this is inaccurately being tied to Smithfield Foods. I was not paid for this assistance and any suggestion that I lobbied for Smithfield Foods is inaccurate,\" Hart said in a statement.A spokesman for Williams & Jensen said an \"independent review of the firm's lobbying activity in advance of the quarterly filing deadline concluded that Mr. Hart had lobbying contact with the Environmental Protection Agency in the first quarter of 2018. The firm has filed the requisite disclosure forms required by law accordingly.\"The firm is in the process of reviewing its 2017 lobbying disclosures.",
    "source_domain": "abc7news.com",
    "title": "Scott Pruitt expected to face ethics questions in front of Congress",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/scott-pruitt-expected-to-face-ethics-questions-in-front-of-congress/3385817/"
}