{
    "authors": [
        "Amy Hollyfield"
    ],
    "date_download": "2018-04-24 15:24:20+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 13:21:08",
    "description": "Thousands of women will come together in San Francisco on Tuesday for networking opportunities and career inspiration.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fbusiness%2Fprofessional-businesswomen-of-california-conference-kicking-off-in-sf%2F3386020%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1257787_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos This edition of Beyond the Headlines focuses on a long standing organization called the Professional BusinessWomen of California, or PBWC.\nJane Fonda, Lily Tomlin, Ashley Judd and Maria Shriver will be among the speakers and panelists gathering in San Francisco today for a conference that will empower women.The 29th Annual Professional BusinessWomen of California Conference is taking place at Moscone Center, and ABC7 is again a proud sponsor.Ashley Judd is one dynamic woman who will bring her passion to the conference. She will appear on a panel focusing on the Me Too and Times Up movements.Bay Area Congresswoman Jackie Speier appeared with ABC7's Cheryl Jennings and talked about the conference and how this Me Too discussion is timely and important.This year's theme is \"Stand Up, Lift Up\" and Judd will be part of a panel focusing on the Me Too and Time's Up movements, along with Bay Area congresswoman Jackie Speier.Speier founded the group in 1989. She recently appeared on ABC7's \"Beyond the Headlines with Cheryl Jennings\" and said this discussion is timely and important.\"We are truly changing the culture at work for all time so that our daughters and granddaughters are never going to have to deal with frankly what we had to deal with,\" Speier said.The key is to take the energy and lessons and connections from today out into the business world tomorrow and beyond.This organization is doing that, throughout the year it hosts workshops and fosters mentorships to empower women in their work lives.Members of the ABC7 News team will lead panels designed to help women gain career confidence, media skills and more.But PBWC goes well beyond this one-day conference.Throughout the year, the organization works with its corporate partners to offer workshops, socials and mentorships - all designed to empower women in the workplace and in their lives.",
    "source_domain": "abc7news.com",
    "title": "Professional BusinessWomen of California Conference kicking off in San Francisco",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/business/professional-businesswomen-of-california-conference-kicking-off-in-sf/3386020/"
}