{
    "authors": [
        "John Santucci"
    ],
    "date_download": "2018-04-24 22:14:18+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 18:14:07",
    "description": "Pruitt is scheduled to face congressional questions Thursday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fpruitt-declined-white-house-offer-to-help-prep-for-congressional-questions%2F3386774%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/scott-pruitt-hearing-rt-ps-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Environment Protection Agency chief Scott Pruitt declined an offer from the White House to help him prepare for what could be a marathon day of testimony before Congress Thursday, electing instead to prepare with a team of the loyal advisors he brought to Washington from Oklahoma, sources tell ABC News.Pruitt's congressional appearances this week could mark the second formal time the Oklahoma native will be confronted with pointed questions about recent reports regarding ethics concerns. Three weeks ago he appeared on Fox News against advice from White House media specialists, the sources said.During that interview, Pruitt appeared to be on the defensive over a range of issues, including when he was asked about ABC News reports that he rented a $50-a-night condo from the wife of a top Washington lobbyist. \"Is draining the swamp renting an apartment from the wife of a Washington lobbyist?\" Fox News correspondent Ed Henry asked.\"I don't think that that's even remotely fair to ask that question,\" Pruitt responded.The EPA did not respond to a request for comment on Pruitt's preparations for this week's hearing.Pruitt has been the focus of a raft of media reports over the past several weeks. Those reports described efforts to secure raises for several of his top aides, despite objections from the White House; costly travel expenses and questionable changes to his office, all done under the guise of boosting security for Pruitt.But sources familiar with Pruitt's prep sessions for two congressional hearings scheduled for Thursday say the group sessions have focused almost exclusively on policy matters, and not on the multiple looming controversies. His chief of staff, Oklahoma City native Ryan Jackson, has been quarterbacking the sessions. Earlier this month, it was Jackson who took responsibility for securing raises for several of Pruitt's top aides - something Pruitt said had occurred without his knowledge.Ahead of the hearings, Pruitt has continued to push the pro-industry agenda that has won him favor with President Trump . This week, Pruitt announced two new directives supported by Congressional Republicans On Tuesday, Pruitt unveiled a new rule for how the EPA would limit the use of scientific materials to only research that makes the underlying raw data publicly available. Pruitt says the change will allow for more transparency. Critics, including former EPA administrator Gina McCarthy, say it could disqualify some of the research that forms the basis of regulations intended to protect public health.A similar change was pushed in legislation by Rep. Lamar Smith , R-Texas, the chairman of the House Science Committee, who appeared at Tuesday's announcement at EPA - which was not open to reporters.Earlier in the week Pruitt was in Georgia where he announced that as part of the president's existing executive orders to promote American energy independence and roll back regulations the EPA will now consider burning trees and other materials to be a carbon neutral activity, even though the EPA policy document also states that there is scientific disagreement among its scientific advisors over that issue. Both Democrats and Republicans have supported policies opening up investment in this kind of energy, including Sen. Susan Collins , R-Maine, who has been critical of Pruitt in recent weeks.Ahead of his expecting grilling on Capitol Hill, Pruitt still has the support of conservative leaders outside of Congress, who co-signed a letter earlier this month thanking Trump for standing by Pruitt.\"He's one of the strongest members of the Cabinet in achieving President Trump's agenda of draining the swamp,\" Jenny Beth Martin, the chairman of the Tea Party Patriots Citizen Fund, said in an interview.\"The grassroots across this country like what Scott Pruitt is doing,\" she said, adding that her group would likely encourage members to support Pruitt later this week.Conservatives outside the administration have remained in contact with the White House, and have expressed support for Pruitt, sources familiar with the conversations tell ABC News.",
    "source_domain": "abc7news.com",
    "title": "Pruitt declined White House offer to help prep for congressional qu..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/pruitt-declined-white-house-offer-to-help-prep-for-congressional-questions/3386774/"
}