{
    "authors": [
        "Janine De La Vega"
    ],
    "date_download": "2018-03-20 03:37:33+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 20:10:30",
    "description": "Facebook stock took a plunge Monday. It was its worst loss in four years. The drop is a result of concerns that a data mining firm that worked for the Trump campaign improperly obtained data from tens of millions of Facebook users.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Ffacebook-stock-plunges-after-trump-affiliated-firm-obtained-user-data%2F3235030%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3191062_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Facebook stock took a plunge Monday. It was its worst loss in four years. The drop is a result of concerns that a data mining firm that worked for the Trump campaign improperly obtained data from tens of millions of Facebook users. That company is now banned from using Facebook.Jessica Iriarte guesses she checks her Facebook account at least 10 times a day and admits sometimes she takes those personality quizzes.\"I don't know who is collecting all that information, it's kinda fun and I don't know what they're doing with the information,\" said Iriarte.In some cases, it's more than you think. University of Cambridge Psychology Professor Aleksandr Kogan received permission from Facebook to use his personality quiz app. It collected information about profiles, likes, and users' friends. Facebook claims the professor broke the rules and gave the data to Cambridge Analytica, a political consulting company hired by the Trump campaign. All that data was extremely valuable.\"It will give me an indication on your political views, information about your financial status all of these things. They took these things and created a psychological profile,\" explained Ahmed Banafa, a cyber-security expert and professor at San Jose State University's School of Engineering.Roughly 50 million Facebook profiles were affected. Facebook admits it knew about the violation in 2015, but did not disclose it publicly. Facebook demanded Cambridge Analytica destroy all the data. The firm claims it did. In a statement, Facebook says \"We are moving aggressively to determine the accuracy of these claims. We remain committed to vigorously enforcing our policies to protect people's information.\" Complete statement is hereFacebook has banned Cambridge Analytica from using its platform and has hired a forensics firm to complete an audit. Cyber security experts warn users to think twice when using third party apps on Facebook. Click here to read the statement from Facebook.\"There will be some kind of steps to be taken from Facebook or by the regulators to stop something like this. You cannot share the information of people without their own permission. That will be the silver lining in this whole process,\" said Banafa.That's the hope that many Facebook users have.",
    "source_domain": "abc7news.com",
    "title": "Facebook stock plunges with Trump-affiliated firm under fire for obtaining user data",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/facebook-stock-plunges-after-trump-affiliated-firm-obtained-user-data/3235030/"
}