{
    "authors": [
        "Steve Campion"
    ],
    "date_download": "2017-10-06 19:54:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 18:29:10",
    "description": "Eyewitness News learned more today about a viral video taken inside a Baytown restaurant. The footage was first posted on Reddit showing a heated exchange between a man and woman. She can be seen swinging her fists at the man as he holds a beer and a carr",
    "filename": "http%3A%2F%2Fabc7news.com%2Fcouples-fight-at-texas-restaurant-goes-viral%2F2500034%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/ktrk/images/cms/automation/vod/2495420_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Eyewitness News has learned more about a viral video taken inside a Baytown restaurant.The footage was first posted on Reddit showing a heated exchange between a man and woman. She can be seen swinging her fists at the man as he holds a beer and a carryout container. He eventually threw the carryout food in her face.Baytown police officers said the people in the video are a couple. They identified them as Garett Wilder, 26, and his girlfriend, Brittany Farber, 24. They charged them both with misdemeanors for public intoxication.Wilder talked to ABC13 about the incident after we tracked him down. He admitted alcohol played a factor. He expressed remorse about the altercation.\"I've got nothing to say about it really,\" said Wilder. \"I really don't want to talk about. She was a little embarrassed by it, but now she's kind of embraced it that everyone has seen it.\"Wilder said Farber was at work Thursday afternoon. He said the two are back together and haven't had any alcohol since the incident.Bayou City Wings said they suspended three employees are a result of the video being posted online.",
    "source_domain": "abc7news.com",
    "title": "Caught on camera: Couple's fight at Texas restaurant goes viral",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/couples-fight-at-texas-restaurant-goes-viral/2500034/"
}