{
    "authors": [
        "Cheryl Jennings"
    ],
    "date_download": "2017-02-15 02:47:06+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 23:36:29",
    "description": "Do you have some extra weight around your waist that you're having trouble getting rid of? Imagine treating that fat over your lunch hour.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fhealth%2Fnew-device-promises-to-dissolve-fat-without-surgery%2F1754935%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1754934_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Do you have some extra weight around your waist that you're having trouble getting rid of? Imagine treating that fat over your lunch hour.A new device promises to do just that in about 25 minutes.Jennifer loves to hike the trails around her Marin County home. \"I usually do like 5 to 7 miles, three times a week,\" she said.But even with all that exercise, Jennifer said she's frustrated with bulges that won't go away. \"Around my belly and the sides of my waist. And finding that my clothes don't fit as well as they used to,\" she said.Now she's turning to Doctor Keith Denkler and a new treatment called SculpSure , which promises to dissolve away areas of fat without surgery.\"It's not strictly a melting. It's actually you're damaging the fat with heat, light energy. It's light energy,\" Denkler said.First, Denkler's team places brackets around Jennifer's waist. Then they'll attack multiple applicators that will deliver laser light. He said they're designed to heat the fat cells beneath the skin while keeping the surface cooler to minimize pain.According to the manufacturer, the heat destroys roughly a quarter of the fat cells in under half an hour, as seen in a company animation.\"And the fat cell dies. Then the body goes and metabolizes the site which is the cell and it takes away the fat,\" Denkler said.The manufacturer said patients typically see results at somewhere between 6 to 12 weeks. Before and after photos show Jennifer's results after a little more than a month.\"It's very suitable for people who have diet-resistant fat pads. These are thinner people that may have some love handles or lower abdominal areas that they can't get rid of,\" he said.Jennifer said she isn't expecting the treatment to reshape her body but simply tighten up her waist.\"I'm just looking forward to having my jeans fit really well, really well,' she said.Denkler said a small percentage of patients may have trouble tolerating the heat and he said the treatment is meant for patients with healthy skin.",
    "source_domain": "abc7news.com",
    "title": "New device promises to dissolve fat without surgery",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/health/new-device-promises-to-dissolve-fat-without-surgery/1754935/"
}