{
    "authors": [],
    "date_download": "2018-04-24 23:57:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 22:05:55",
    "description": "Looking for a new rental in town? Check out these five listings that are currently on the market.",
    "filename": "http%3A%2F%2Fabc7news.com%2Frealestate%2Fwhat-will-%242600-rent-you-in-san-francisco-right-now%2F3387609%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3387608_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "1633 California St., #204 (Polk)\n5810 Mission St. (Outer Mission)\n3459 Divisadero St. (Marina)\n443 8th Ave., #2 (Inner Richmond)\n1040 Sutter St., #22 (Lower Nob Hill)\nCurious just how far your dollar goes in San Francisco?We've rounded up the latest rental listings via rental site Zumper to get a sense of what to expect when it comes to finding an apartment in San Francisco with a budget of $2,600 / month.Take a look at the listings, below. (Note: prices and availability are subject to change.)---Here's a one-bedroom, one-bathroom apartment at 1633 California St. that's going for $2,600 / month.In the unit, you'll get hardwood floors, a walk-in closet, a stove, French doors, large windows and plenty of cabinet space. Animals are not welcome. Building amenities include on-site management and secured entry.Walk Score indicates that the surrounding area has excellent walkability, is quite bikeable and has excellent transit.(Check out the complete listing here .)Next, check out this 965-square-foot one-bedroom, one-bathroom residence that's located at 5810 Mission St. It's also listed for $2,600 / month.In the unit, you'll get hardwood floors, a dishwasher, a balcony, bay windows, stainless steel appliances and granite countertops. Building amenities include an elevator, assigned parking, on-site management and additional storage space. Pets are not permitted.According to Walk Score's assessment, the surrounding area is very walkable, is relatively bikeable and has good transit options.(See the complete listing here .)Located at 3459 Divisadero St., here's a studio apartment that's listed for $2,600/ month.In the unit, you can expect hardwood floors, a walk-in closet, floor-to-ceiling windows, a stove and built-in bookshelves. When it comes to building amenities, expect on-site laundry, garage parking and on-site management. Neither cats nor dogs are welcome.Per Walk Score ratings, this location is a \"walker's paradise,\" is very bikeable and is a haven for transit riders.(See the complete listing here .)Here's a one-bedroom, one-bathroom apartment at 443 8th Ave. that's going for $2,595 / month.The apartment features carpeting, plenty of closet space, an oven and wooden cabinetry. Garage parking is available as a building amenity. Animals are not permitted.According to Walk Score, this location has excellent walkability, is a \"biker's paradise\" and is a haven for transit riders.(See the full listing here .)Located at 1040 Sutter St., here's a one-bedroom, one-bathroom apartment that's also listed for $2,595 / month.In the apartment, you'll find hardwood floors, a dishwasher, stainless steel appliances and ample natural light. If you've got a pet, you'll be happy to learn that cats and dogs are allowed. Building amenities include on-site laundry.Per Walk Score ratings, the surrounding area is extremely walkable, is convenient for biking and is a haven for transit riders.(Take a gander at the complete listing here .)",
    "source_domain": "abc7news.com",
    "title": "What will $2,600 rent you in San Francisco, right now?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/realestate/what-will-$2600-rent-you-in-san-francisco-right-now/3387609/"
}