{
    "authors": [],
    "date_download": "2018-04-24 18:49:38+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:14:37",
    "description": "A group of scientists published a study that about the gases found in Uranus' atmosphere.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fscience%2Fscientific-study-uranus-smells-like-rotten-eggs%2F3386477%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/3386552_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Scientists finally confirm that Uranus is surrounded by fart clouds https://t.co/JPTvZdC9md via @PopSci pic.twitter.com/vXisIjJ7au — Rachel “The Yellow Dart” Feltman (@RachelFeltman) April 23, 2018\nThe scientists have spoken: Uranus stinks.A new study looked at the gases found in the planet's atmosphere and found that it's full of the notoriously foul-smelling hydrogen sulfide.The study, published in the journal Nature Astronomy , is authored by scientists from California Institute of Technology, the University of Oxford and the University of Leicester.The example of a hydrogen sulfide-emitting substance that the study gave is rotten eggs. Many social media users, however, have pointed out that hydrogen sulfide can be found elsewhere, namely in raw sewage and in human flatulence.But even if you hypothetically could get near enough to smell it, the smell would be the least of your concerns. Patrick Irwin, a Professor of Planetary Physics at Oxford and one of the study's authors, explained.\"If an unfortunate human were ever to descend through Uranus's clouds, they would be met with very unpleasant and odiferous conditions,\" he said. \"Suffocation and exposure in the negative 200 degrees Celsius atmosphere made of mostly hydrogen, helium, and methane would take its toll long before the smell.\"The study said that the presence of hydrogen sulfide in the planet's atmosphere has long been studied, but this is the best proof yet. The gas was found in the planet's cloud tops by dissecting light from Uranus captured by the Gemini North telescope.Scientists say this discovery sheds light on how and when Uranus was formed.",
    "source_domain": "abc7news.com",
    "title": "Scientific study: Uranus smells like rotten eggs, sewage",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/science/scientific-study-uranus-smells-like-rotten-eggs/3386477/"
}