{
    "authors": [
        "Chris Francescani"
    ],
    "date_download": "2018-04-24 18:49:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 21:04:03",
    "description": "Closing arguments are expected to begin Tuesday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fdefense-rests-in-bill-cosbys-retrial%2F3383161%2F.json",
    "image_url": "http://a.abcnews.com/images/US/cosby-hearing-01-ap-jef-180423_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The defense team in Bill Cosby 's sexual assault retrial in Montgomery County, Pennsylvania, rested its case on Monday, paving the way for key closing arguments Tuesday.\"You now have all the evidence,\" Judge Steven T. O'Neill told the 12 primary and six alternate jurors, before advising they \"rest up\" in anticipation of closing arguments.Seven men and five women, two African-Americans among them, will likely begin deliberations late Tuesday or on Wednesday morning.The hard-fought, high-profile case was marked by colorful witnesses, devastating cross-examinations and heartbreaking claims of abuse.Surprising new developments unfolded inside and outside of the courtroom, often on the same day.Earlier on Monday, the comedian informed the judge that he would exercise his right not to testify in his own defense, the same choice he made at last summer's trial, which ended in a hung jury and a mistrial.Cosby is charged with three counts of aggravated indecent assault for allegedly drugging and molesting Andrea Costand, the former director of operations for the women's basketball team at Temple University, where for years Cosby was a trustee and major financial donor.He has pleaded not guilty and has denied ever drugging or assaulting anyone.Of dozens of women who have come forward in recent years to accuse the entertainer of similar assaults stretching back to the 1960s, only Constand's allegations fall within the statute of limitations.During Monday morning's court session, the defense called two final witnesses to support their contention that Cosby wasn't at his Philadelphia estate in January 2004, the month during which Constand said she was assaulted.Prosecutors pointed out that records of performances and flight logs from his private jet did not necessarily mean he wasn't in the Philadelphia area -- just that he hadn't performed or flown there.This time around, the same prosecution team faced off against an entirely new defense team, led by celebrity attorney Tom Mesereau, who mounted a far more aggressive strategy in defending Cosby than the previous team by focusing on attacking the credibility of Constand.It remains to be seen whether that more muscular strategy will pay off or backfire.The primary difference between Cosby's first trial and his second was that at last summer's trial the judge in the case, O'Neill, allowed only one additional accuser to testify and support Constand's account, based on the prosecution's argument that it needed to show a common scheme or pattern to Cosby's alleged assault of Constand.This time around, the judge allowed five such women to take the stand.Another new element in this year's trial was O'Neill's decision to allow the testimony of Marguerite \"Margo\" Jackson, a former colleague of Constand's at Temple, who testified that Constand once mused about framing a celebrity. The judge had rejected her testimony in the first trial as hearsay. Constand has denied Jackson's claims.Unlike last summer, when a parade of Cosby accusers turned up inside and outside the courthouse, just three steadfast accusers -- Victoria Valentino, Therese Serignese and Lili Bernard -- sat quietly in the back of the court for virtually every moment of the lengthy pre-trial motions process, the jury selection and the trial.Cosby faces up to 10 years in prison for each count, if convicted.",
    "source_domain": "abc7news.com",
    "title": "Defense rests in Bill Cosby's retrial",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/defense-rests-in-bill-cosbys-retrial/3383161/"
}