{
    "authors": [
        "Jordyn Phelps"
    ],
    "date_download": "2018-04-24 17:07:14+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:04:14",
    "description": "The White House will be hosting the French president on Tuesday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fwhats-for-dinner-details-of-the-first-trump-state-dinner%2F3386449%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/french-state-dinner-ap-mo-20180424_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pomp and circumstance arrive at the White House in grand style Tuesday for the first state dinner of the Donald Trump presidency in honor of French President Emanuel Macron.First lady Melania Trump has personally overseen planning for the dinner, which has been decorated in a crme and gold color scheme and draws from American and French influences.There will be 1,200 branches of cherry blossom, 2,500 stems of white sweet peas and nearly 1,000 stems of white lilac adorning the White House, while the Washington National Opera will set the tone for the musical entertainment of the evening.Dinner will be served in the formal State Dining Room on settings of Clinton and Bush china, as well as silver from the White House collection, from Tiffany & Co. and S. Kirk & Sons.The menu has been planned to \"showcase of the best of America's cuisines and traditions, with nuances of French influences,\" according to the White House, and will be prepared by White House Executive Chef Christeta Comerford.The first course is a salad of greens from the White House kitchen garden and will feature a goat cheese gateau, tomato jam and biscuit crumbles. The main course will be a rack of lamb and jambalaya. For desert, there's a nectarine tart and ice cream.Though Trump does not personally drink alcohol, wines have also been carefully selected for the evening to both \"complement the menu and embody the historic friendship between the United States and France.\"Joining the main guests of honor, Macron and his wife Brigitte, is an exclusive guest list that has been kept secret by the White House and will only be released upon the arrival of the final guest at Tuesday's dinner.The dinner is just one part of a larger itinerary of ceremonial events in Macron's honor. Having arrived Monday, Macron and his wife planted a gifted tree on the South Lawn of the White House and had a private dinner with the president and first lady at George Washington's historic Mount Vernon, Virginia, home.And on Tuesday morning, Macron and his wife are set to be welcomed to the White House with a traditional military arrival ceremony, with nearly 500 members of the military and all five branches represented.",
    "source_domain": "abc7news.com",
    "title": "What's for dinner? Details of the first Trump state dinner",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/whats-for-dinner-details-of-the-first-trump-state-dinner/3386449/"
}