{
    "authors": [],
    "date_download": "2017-01-02 14:41:32+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 13:10:50",
    "description": "Instead of trying to lose 100 pounds or become fluent in French, stick with these achievable New Year's resolutions instead.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fpractical-tips-to-achieving-your-new-years-resolutions%2F1682342%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/1682350_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "If you want to stick to your New Year's resolutions in 2017, don't dream big, dream reasonable.Instead of trying to lose 100 pounds or become fluent in French in 365 days, having manageable goals and a firm but flexible timeline will help keep your resolutions alive for 2017. Here are reasonable and achievable New Year's resolutions.Perhaps you've been dying to see the Eiffel Tower glowing at night or have always wanted to trek along the Great Wall of China. International travel fantasies are fun to picture but hard to turn into reality with pricey plane fares and hotels rates.Instead of trying to trot the entire globe, take a road trip to a nearby hotspot or fly to a fun, new destination in the U.S. to satisfy your New Year travel bug. You'll be able to explore somewhere new and exciting without significantly impacting your schedule or wallet.Learning a new language can be of great benefit to your personal and professional life but also requires a lot of time and dedication. Lifehacker suggests that people trying to learn a foreign language should set specific priorities and a timeline for their language goals, like knowing how to speak basic phrases at the end of a month. Online tools like Duolingo and Memrise can also keep language learners on track with their goals.It's hard not to watch a cooking show on TV and have dreams of becoming a world class chef. But with consumers spending more money at restaurants than they do at grocery stores, according to Bloomberg , fewer people are strengthening their cooking skills at home.Treat yourself to a new cookbook and then commit to trying out new recipes on a daily or weekly basis. You can also sign up for cooking classes at a community center to learn about food in a group setting.The most popular New Year's resolution in 2016 was staying fit and healthy according to Nielsen , and 2017 is almost certain to shape up the same way. Set realistic goals and commit to a regular fitness activity that you enjoy . Find a workout buddy to help motivate you and keep you on track and reward yourself when you hit milestone achievements.People love to read, with nearly eight in 10 Americans having read a book in the past year, according to the Pew Research Center . But with so many book options available in digital and print, tackling all of the year's great literary offerings can be a difficult and time-consuming task.If you want to increase your literary diet in 2017, try finishing a new book every month. If you're feeling ambitious, you can try to read a book every week.Who wouldn't like to play piano as good as Billy Joel or the electric guitar as wild as Jimi Hendrix? While learning to play a musical instrument has positive health benefits for people of all ages , it still took these master musicians countless hours to perfect their craft.Focusing on learning the basic skills of an instrument and setting specific goals will help keep your musical abilities on track. Many free instructional videos can be found on YouTube for musicians of all levels. If you prefer a group environment over self-teaching, consider seeking group lessons at a music store or through a private instructor in your area. But keeping your goals reasonable will help make your 2017 a very musical year.",
    "source_domain": "abc7news.com",
    "title": "Practical tips to achieving your New Year's resolutions in 2017",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/practical-tips-to-achieving-your-new-years-resolutions/1682342/"
}