{
    "authors": [
        "Reggie Aqui"
    ],
    "date_download": "2017-10-07 03:28:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 20:25:06",
    "description": "The Mountain View Teen Wellness Conference hopes to end mental health stigma through conferences and a texting app that links teen to counselors who can offer them help when they feel helpless.",
    "filename": "http%3A%2F%2Fabc7news.com%2Feducation%2Fteen-wellness-conference-hopes-to-end-mental-health-stigma-%2F2500461%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/2501884_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "October is National Bullying Prevention Month and ABC7 News is proud to support our parent company Disney in their annual campaign to encourage everyone to \"choose kindness.\"ABC7 News met some ambitious Bay Area teenagers choosing kindness by working to end the stigma of mental illness.At the Teen Wellness Conference in Mountain View, more than 220 students chose to spend their Saturday learning about mental health.\"We need to let young people know that there are resources out there and they are not alone,\" said Nadia Ghaffari, a teen in the program.The conference was organized by teens - for teens.\"I came to learn more about myself and what I want to achieve in life,\" said Geffen Dagai, a 15-year-old in the program.\"How to deal with stress, anxiety, like all sorts of mental illness,\" said Georgia Ball, 15-year-old in the program.\"It's important because I really want kids to feel like they are loved,\" said Stephen Morris-Podzamsky, 14-year-old, in the program.Students from 80 Bay Area schools are here for a wide range of workshops on topics that are often hard to talk about.\"There's definitely - yes - a stigma attached to mental health issues and also, I would say there's a stigma, maybe even more of a stigma, to seeking help for mental health issues,\" said Nadia Ghaffar, the coordinator for the conference.Ghaffari is a 17-year-old from Los Altos who organized the conference - creating a safe place for teenagers learning to help themselves and others.\"It's normal to feel anxious or depressed at times, but if it gets to a point where it's really changing the way you live your life, that's, then it's time to get help - and its okay,\" said Ghaffari.Ghaffari and her team are getting support from a range of mental health organizations eager to reach out to young people.\"Teens in the U.S. are experiencing higher levels of stress than ever before. And about 50-percent of mental health disorders emerge by the age of 14, and about 75% emerge by the age of 25,\" said Erika Roach, with the Stanford Center for Youth Mental Health.Sometimes early intervention is critical - just like with other types of illness.\"We miss the fact that this is actually a disease, it's a brain disease,\" said Meredith Ackley, from Bring Change to MindFor 17 year-old Darrow Hornik, a simple text helped turn around her moment of crisis.\"This amazing resource that is available to anybody, anytime, anywhere,\" said Hornik.They've created a Crisis Text Line and it is free and confidential. You just text the word \"Bay\" to 741741 and a trained counselor texts back.\"Because it's texting, it is not as terrifying as opposed to when you are calling in,\" said Hornik.Now Hornik is volunteering at the wellness conference to spread the word about the text line.\"This is a huge issue for teens. One in three adolescents will experience violence in a relationship at some point,\" said Sarah Bigler, from the Onelove Foundation.Another group is focusing on the role of media in mental health. Some experts are especially concerned about a Netflix show called \"13 Reasons Why\" that some say makes suicide seem like the only answer.\"Almost every teen that we talked to was watching the show. CHC saw a huge influx of teens coming to get support services as a result of the show. Searches for suicide went way up after the show on Google,\" said Liza Bennigson, from Children's Health Council.Netflix says the show is bringing awareness to sensitive issues but Livermore father John Herndon believes it triggered his 15-year-old daughter Bella's death by suicide.\"Don't let kids watch this alone, the assault on the emotions is hostile,\" said Herndon.Herndon says he hoped Netflix would drop the show. Instead it's shooting a second season.\"Individuals like me need to help take actions - and I see a future where there won't be stigma around mental health,\" said Colin Raab, a peer counselor.",
    "source_domain": "abc7news.com",
    "title": "Mountain View Teen Wellness Conference hopes to end mental health stigma",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/education/teen-wellness-conference-hopes-to-end-mental-health-stigma-/2500461/"
}