{
    "authors": [],
    "date_download": "2017-08-14 14:05:22+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 10:58:57",
    "description": "At least three people have died in relation to the violence in Charlottesville, Virginia over the weekend. Here is a timeline of events.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fa-timeline-of-events-in-charlottesville-virginia%2F2305769%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/2306292_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The plaque before the Robert E. Lee statue celebrating “Lost Cause” and “Confederate Heroes” is GONE, as of today. https://t.co/n2V18XnxAH — Mike Signer (@MikeSigner) July 6, 2017\nWe voted 5-0 to rename Robert E. Lee & Stonewall Jackson Parks Emancipation & Justice Parks tonight, respectively. #changethenarrative! — Mike Signer (@MikeSigner) June 6, 2017\nBelow is Governor McAuliffe's statement on the planned rally in Charlottesville, VA on Saturday, August 12th: pic.twitter.com/0TbGoCEP3w — Terry McAuliffe (@GovernorVA) August 11, 2017\nParticipants for today's rally at Emancipation Park in Charlottesville begin to arrive. #cvilleaug12 pic.twitter.com/EoDhC5QKpZ — VA State Police (@VSPPIO) August 12, 2017\nUPDATE: 2 people injured in altercation at Charlottesville rally. Injuries serious but not life-threatening #cvilleaug12 pic.twitter.com/CVPnjXQnQ0 — VA State Police (@VSPPIO) August 12, 2017\nALERT: Unlawful assembly declared for rally at Emancipation Park #cvilleaug12 pic.twitter.com/2OcchnDNFS — Charlottesville City (@CvilleCityHall) August 12, 2017\nGovernor McAuliffe has declared a state of emergency to aid state response to violence at Alt-Right rally in Charlottesville — Terry McAuliffe (@GovernorVA) August 12, 2017\nWe ALL must be united & condemn all that hate stands for. There is no place for this kind of violence in America. Lets come together as one! — Donald J. Trump (@realDonaldTrump) August 12, 2017\nCPD & VSP respond to 3-vehicle crash at Water & 4th streets. Several pedestrians struck. Multiple injuries. 1/2 #cvilleaug12 pic.twitter.com/DdHYdL0Uvu — VA State Police (@VSPPIO) August 12, 2017\nWe will continue to follow developments in Charlottesville, and will provide whatever assistance is needed. We are ready, willing and able. pic.twitter.com/mCTYBgUePi — Donald J. Trump (@realDonaldTrump) August 12, 2017\nVery important for the nation to hear @potus describe events in #Charlottesville for what they are, a terror attack by #whitesupremacists — Marco Rubio (@marcorubio) August 12, 2017\nVirginia State Police identify two officers killed in helicopter crash near Charlottesville. https://t.co/9k3oqvhte6 pic.twitter.com/g5jh2NVwF8 — ABC News (@ABC) August 13, 2017\nCharlottesville Police announce arrest of James Alex Fields, Jr. pic.twitter.com/NIANjfPGwV — ABC 13 News - WSET (@ABC13News) August 13, 2017\nAt least three people have died in relation to the demonstrations in Charlottesville, Virginia over the weekend. Here is a timeline of events leading up to and surrounding the violence.The Charlottesville City Council votes to remove a statue of Confederate war hero Robert E. Lee.Several groups and individuals filed a lawsuit against the Charlottesville City Council. They said that the removal would violate the terms of the statue's donor and that it would go against laws surrounding war statues.A group protesting the removal of the statue gathered, carrying torches, in what was then called Robert E. Lee Park, where the statue is located. They were met by counter-protesters A plaque is removed from in front of the Robert E. Lee statue.Robert E. Lee Park is renamed Emancipation Park, the city's mayor announced.Virginia Governor Terry McAuliffe released a statement about planned security for the \"Unite the Right\" white nationalist rally, which was planned in part to protest the removal of the statue. He said that participants had the right to exercise their freedom of speech, but that he found their views \"abhorrent.\" He urged demonstrators of every view point to make alternative plans.After the city of Charlottesville had lobbied for a change in venue due to the size of the event, a judge ruled that the event could remain in Emancipation Park as planned.Hundreds of white nationalists, some wielding torches, gathered at the University of Virginia ahead of Saturday's larger rally. Their chants included phrases such as \"white lives matter,\" \"you will not replace us,\" and the Nazi-associated phrase \"blood and soil.\" The mayor of Charlottesville called it a \"cowardly parade of hatred, bigotry, racism, and intolerance.\"Demonstrators begin gathering at least three and a half hours before the event is scheduled to start.Violence breaks out between protesters and counter-protestors. Virginia Police say there are two people who have injuries that are \"serious but not life-threatening.\"The event is declared an unlawful assembly by law enforcement.After the violence pours out into the streets of Charlottesville, Gov. McAuliffe declares a state of emergency.President Trump tweets, calling for unity.A car plows into a crowd of people. One counter-protester, 32-year-old Heather Heyer, is killed. At least 19 other people were sent to the hospital.President Trump addressed the nation, condemning the violence \"on many sides\" and saying \"We must love each other, respect each other and cherish our history and our future together.\"The president's remarks were met with criticism from both sides, with many calling for Trump to call out and condemn the white nationalists groups by name.Two policemen were killed when their helicopter crashed as they were responding to the day's events. They were identified as Lt. H. Jay Cullen and Trooper-Pilot Berke M.M. Bates.Police announce an arrest in the car-ramming incident, 20-year-old James Alex Fields, Jr. from Ohio. He was charged with second-degree murder.A White House spokesperson released a statement saying that the president condemns white nationalists groups.\"The president said very strongly in his statement yesterday that he condemns all forms of violence, bigotry and hatred,\" the statement reads, \"and of course that includes white supremacists, KKK, neo-Nazi and all extremist groups. He called for national unity and bringing all Americans together.\"Solidarity events took place around the country on Sunday, and more are planned for Monday. Democratic group Indivisible told Vox that nearly 700 such events have already been planned.",
    "source_domain": "abc7news.com",
    "title": "A timeline of the deadly weekend in Charlottesville, Virginia",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/a-timeline-of-events-in-charlottesville-virginia/2305769/"
}