{
    "authors": [],
    "date_download": "2018-04-24 17:07:37+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:08:20",
    "description": "President George H.W. Bush has been hospitalized for an infection just after his wife Barbara's burial, but he is said to be getting better.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Fgeorge-hw-bush-responding-and-recovering-from-blood-infection%2F3386459%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/ktrk/images/cms/automation/vod/3385421_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For media planning purposes, the Office of @GeorgeHWBush will issue updates on #41 when we have something to update. Those updates would come through this Twitter feed first. Happily, our previous statement still stands: \"responding and recovering.\" — Jim McGrath (@jgm41) April 24, 2018\nStatement by the Office of @GeorgeHWBush on President Bush's health. pic.twitter.com/8UkB53JHqD — Jim McGrath (@jgm41) April 23, 2018\nSending healing thoughts of strength, along with prayers, for President George HW Bush tonight. — Melania Trump (@FLOTUS) April 24, 2018\nPresident George H.W. Bush has been hospitalized for an infection just after his wife Barbara's burial, but he is said to be getting better.A statement released Monday from Bush's office stated the former sitting president was admitted to Houston Methodist Hospital on Sunday morning \"after contracting an infection that spread to his blood.\"On Tuesday, Bush's spokesperson added that the former president is \"responding and recovering.\" He added that updates will only be issued if something changes, and for now, the previous statement still stands.The 93-year-old Bush was present for the public viewing Friday of his wife Barbara Bush at St. Martin's Episcopal Church. Barbara Bush passed away last Tuesday at 92.The couple had been married for 73 years.The following is the statement in full, released Monday by Bush chief of staff, Jim McGrath:Later Monday night, McGrath added that the former president has a goal to work toward:First Lady Melania Trump, who attended Barbara Bush's memorial services in Houston, offered her best wishes for a speedy recovery to President Bush:George H.W. Bush has faced varying medical issues in recent years, requiring stays of multiple days in the hospital. His recent stay was in April 2017 when he spent two weeks for pneumonia and chronic bronchitis.",
    "source_domain": "abc7news.com",
    "title": "George H.W. Bush 'responding and recovering' while hospitalized for blood infection",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/george-hw-bush-responding-and-recovering-from-blood-infection/3386459/"
}