{
    "authors": [
        "Michael Finney"
    ],
    "date_download": "2018-04-24 22:14:38+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 20:23:50",
    "description": "A new study attempts to put to rest the age-old question about exactly when to buy your flight, plus that bottle of wine may be getting pricier! What you need to know for Tuesday, April 17, 2018.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fbusiness%2Fconsumer-catch-up-best-time-to-buy-flights-wine-prices-rising%2F3387178%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/ktrk/images/cms/1595635_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A new study attempts to put to rest one of the most common questions we hear in 7 On Your Side - what is the best time to buy a plane ticket?CheapAir.com crunched the numbers , based on 917 million airfares.They found there is no real difference in airfare when youthe flight, so you can find a deal any day of the week. However, there is a difference inyou fly.The cheapest flights can be found by traveling on a Tuesday or Wednesday. By contrast, Sunday is the most expensive day to fly.CheapAir found that opting for a Wednesday over a Sunday flight will save you, on average, $76 a ticket.The website also found that prices change about 62 times per trip - which is roughly every five days.In 2017, the bestto buy was about 70 days in advance.Global wine production in 2017 hit a historic low, which means the price you pay at the store may go up.The International Organisation of Vine and Wine report found production especially dropped in countries like Italy, France, Germany, and Spain, because of poor weather conditions last year.Demand for wine kept growing last year, with the U.S. coming in at number one for wine consumption.Experts told CNN the impact will most be felt by winemakers who charge less per bottle - because they have a lower profit margin and can't absorb changes in supply and demand as easily.Automaker Audi announced a massive international recall of cars and SUVs, because of problems with the electric coolant pumps. The pumps can overheat and potentially catch fire.The recall impacts 390,000 vehicles in the U.S. and Canada. It includes the following models, all with two-Liter turbocharged engines:2013 - 2016 Audi A42013 - 2017 Audi A52012 - 2015 Audi A62013 - 2017 Audi Q5 SUVIn government documents, Audi says the pumps can become blocked with cooling system debris, or moisture could cause an electrical short.Dealers will provide pump replacements at no charge. The redesigned pumps won't be available until November. In the meantime, dealers will install a new version of the current pump.",
    "source_domain": "abc7news.com",
    "title": "Consumer Catch-up: Best time to buy flights, wine prices rising, Audi recall",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/business/consumer-catch-up-best-time-to-buy-flights-wine-prices-rising/3387178/"
}