{
    "authors": [
        "Katie Marzullo"
    ],
    "date_download": "2018-03-20 03:35:32+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 01:14:50",
    "description": "It was a scary few hours in an unincorporated San Jose neighborhood after a homeowner discovered grenades in the basement of her house.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fgrenades-found-at-estate-sale-detonated-in-sj%2F3236068%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3236313_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "At Gordon/Greenside: @SCCoSheriff got report of #grenades found at estate sale. 10 homes evacuated. Bomb squad working on safe disposal. pic.twitter.com/dQglq8dH30 — Katie Marzullo (@KatieABC7) March 20, 2018\nIt was a scary few hours in an unincorporated San Jose neighborhood after a homeowner discovered grenades in the basement of her house.The woman lives on the 300 block of Gordon Avenue, near Greenside Drive.The Santa Clara County Sheriff's Office received a call about the devices little after 4 p.m. The homeowner discovered the grenades while preparing for an estate sale.The woman organizing the sale told ABC7 News they found five grenades. She said two of them were smoke grenades and three of them were live. The women actually moved the devices before calling authorities-fortunately without incident.Sheriff's deputies blocked off streets and evacuated 10 homes while the bomb squad worked to safely detonate the devices.A loud explosion was heard shortly after 7 p.m. and deputies cleared the scene shortly after that.The estate sale representative said the homeowner had no idea how the devices ended up in her basement. The home has been vacant for two years.A spokesperson for the sheriff's office said the incident is under investigation.",
    "source_domain": "abc7news.com",
    "title": "Grenades found at estate sale detonated in San Jose",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/grenades-found-at-estate-sale-detonated-in-sj/3236068/"
}