{
    "authors": [
        "Cornell Barnard"
    ],
    "date_download": "2017-08-15 06:41:28+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 04:59:04",
    "description": "Just days after the deadly violence in Charlottesville, VA, San Francisco is preparing for a possible clash at Crissy Field between right-wing protesters, and counter protesters.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fplanned-right-wing-rally-stirs-controversy-counter-protest-in-sf%2F2309007%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2309040_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Bay Area beach is set to be the scene for a right wing demonstration this weekend.Just days after the deadly violence in Charlottesville, VA, San Francisco is preparing for a possible clash at Crissy Field between right-wing protesters, and counter protesters.Police and protesters clashed in Seattle Sunday. It happened during a right-wing rally organized by a pro-Donald Trump group called Patriot Prayer.\"There were 1,000 protesters so close to the stage -- ready to riot,\" said Patriot Prayer founder Joey Gibson.Gibson told ABC7 News from Vancouver, Washington that he is planning a similar rally on Aug. 27 at Crissy Field. \"Talk about bringing this country together,\" he said.He said he wants the rally to be peaceful but predicts counter-protesters could change that.\"People need to be careful,\" Gibson told ABC7 News. \"If they say things out of ignorance, they are stoking the flames increasing the chance of violence.\"Counter protests are being planned. We found this post on Facebook:This page calls Patriot Prayer Nazi thugs.Gibson denounced the violence in Virginia and denies his group is about hate. \"Let's say we are a hate group. You can't shut us down because of that.\"Some say Crissy Field is the wrong place for the rally.\"Instead of being open and discussing this in a safe forum -- they choose a forum that's violent and confrontational,\" said San Francisco resident Peter Szymanski.Representatives from the Golden Gate Recreation Area would not go on camera but said Patriot Prayer applied for a first amendment permit for the event.Others say free speech can't be denied. \"We do need space for all stripes to be able to have their opinions,\" said tourist Susan Friesen.",
    "source_domain": "abc7news.com",
    "title": "Planned right-wing rally stirs controversy, counter protest in San Francisco",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/planned-right-wing-rally-stirs-controversy-counter-protest-in-sf/2309007/"
}