{
    "authors": [
        "Wil Cruz"
    ],
    "date_download": "2018-03-20 03:41:00+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 02:59:34",
    "description": "The explosion was the fourth incident this month in Austin.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fsuspect-in-austin-explosions-a-serial-bomber-authorities-say-%2F3232367%2F.json",
    "image_url": "http://a.abcnews.com/images/US/austin-bomb-expolsion-roku-pol-mem-180319_hpMain_3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Another explosion rocked Austin overnight, injuring two young men and heightening anxiety in the Texas capital for residents and investigators alike.Last night's detonation came hours after Austin Police Chief Brian Manley urged the suspect or suspects in the string of bombings to turn themselves into authorities. He confirmed that the blast was triggered by a sophisticated tripwire.At a news conference today, Manley said the latest bombing occurred when the two victims either stepped on or kicked a tripwire as they were walking on a sidewalk in the Travis Country neighborhood of Austin. The tripwire set off the explosive device that was placed near a fence at 8:32 p.m. Sunday, police said.Manley said the victims, ages 22 and 23, were in stable condition at a hospital with \"significant injuries.\" Authorities did not release the names of the victims.\"Based on the preliminary review, we have seen similarities in the device that exploded last night and the three others\" that were detonated earlier this month that killed two people and injured two, Manley said.He described the attacks as the work of a \"serial bomber.\"Authorities have increased the reward for information leading to an arrest to $115,000.The chief said law enforcement officers found no other devices in the neighborhood after conducting a sweep, but added the area will remain on lockdown until 2 p.m. local time.Manley said the use of a tripwire to detonate the device is different than the package bombs used in the other attacks that occurred on March 2 and March 12, and signals that whomever is responsible has \"a higher level of sophistication, a higher level of skills\" than previously suspected.Fred Kolanowski, the agent in charge of the Alcohol, Tobacco, Firearms and Explosives office in Austin, said the terrifying aspect of using a tripwire is that it could have been triggered by anyone, including children in the residential area. He said the wire could be either a filament or fishing line that is hard to spot.Christopher Combs, the FBI agent in charge of the Austin office, pleaded with the suspected bomber or bombers to contact law enforcement to discuss the motive behind the attack.\"We need this to stop,\" Combs said at the news conference.The Austin-Travis Country EMS tweeted Sunday night that there was a \"critical incident\" at Dawn Song Drive in Austin and medics were on their way to treat two males with serious injuries.According to St. David's South Austin Medical Center, the two victims were taken there for treatment and are in good condition.In an interview earlier today on ABC News' \"Good Morning America,\" Manley said victims in Sunday night's bombing were both white, while the previous blast victims were black or Hispanic. Race could still be a factor in the bombings, he added.\"We've said from the beginning that we're not willing to rule anything out just because when you rule something out you limit your focus,\" Manley told \"ABC World News Tonight\" anchor David Muir. \"So this does change the concerns that we had initially although we have still not ruled it out until we understand what the ideology and motive is behind the suspect or suspects.\"The three prior bombs were left as packages on doorsteps, while Manley said Sunday's device was different: It was placed on the side of the road.The Austin Police Department on Sunday responded to a so-called \"Bomb Hotshot,\" according to a tweet. It urged anyone in the \"4800 block of Dawn Song Dr.\" to avoid the area.Manley issued a \"safety alert\" in the wake of the bombing, urging people located within a half-mile radius of where the incident occurred to stay indoors until 10 a.m. local time.\"Stay inside your home until we have had a chance to deem this neighborhood safe,\" Manley said at a news briefing Sunday.Police also said school buses would not be able to access the Travis Country neighborhood where the explosion took place and said \"any tardies or absences due to this situation will be excused.\"In the \"GMA\" interview, Manley said more than 500 investigators, including 350 FBI agents, continue to chase down every lead, but \"at this point we don't have specifics leading us to one suspect.\"\"That's why we're pushing the message out there that we need every tip, every piece of information however inconsequential you may think it is,\" Manley said.\"We want to put out the message that we've been putting out and that is, not only do not touch any packages or anything that looks like a package, do not even go near it at this time,\" he said.Austin Mayor Steve Adler said it was too early to suggest the timing of last night's bombing was influenced by the announcement that the reward in the case was being doubled.\"I tell you, at this point there's not enough data to know that,\" Adler said on \"GMA\" this morning. \"We're one of the safest cities in the country now dealing with some pretty horrific events and I think the important message right now is just to tell people if you see anything that is in anyway suspicious just don't go near it and call 911.\"He said investigators will not rest until the individuals behind the attacks are brought to justice.\"These are some pretty horrific events that we're dealing with right now and I know that our community is pretty anxious at this point, but we have some of the best law enforcement folks around dealing with this,\" Adler said. \"There is an army of federal agents, we have state resources, so we are putting every resource available, this is the highest priority. We're going to find out who is responsible for this and we're going to stop it.\"Manley said the three previous package bombings \"were meant to send a message.\"Law enforcement members from all over have taken notice, Manley added.He then said he wanted to tap into the psyche of the bomber or bombers.\"We want to understand what brought you to this point,\" he said. \"And we want to listen to you.\"The victims of the earlier bombings include Draylen Mason, 17, an orchestral musician and notable essay winner, and Anthony Stephan House, a 39-year-old father.Since the explosions occurred, Manley said the Austin Police Department has gotten 735 reports of suspicious packages, and investigators have logged 236 interviews, and checked out 435 leads.",
    "source_domain": "abc7news.com",
    "title": "Suspect in Austin explosions a 'serial bomber,' authorities say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/suspect-in-austin-explosions-a-serial-bomber-authorities-say-/3232367/"
}