{
    "authors": [
        "Leslie Brinkley"
    ],
    "date_download": "2017-08-15 02:10:28+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 11:18:45",
    "description": "Police are searching for a suspect accused of shooting a driver in the head on southbound I-880 in San Leandro early Monday morning.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftraffic%2Fanother-freeway-shooting-in-san-leandro-leaves-driver-in-critical-condition%2F2305802%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/2307432_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "As many as five bullets were fired into a car traveling southbound on Interstate 880 overnight. The young driver was struck in the head and is now hospitalized.It happened at 2:30 a.m. on the overpass at the Lewelling Blvd exit.CHP shut down I-880 for six hours including rush hour, which led to up to four hours commute for some.Investigators created a 3-D laser scan of the shooting scene.It all happened in an active construction zone.\"We had a call of shots fired, and our units arrived on scene. At the time we got here, there was a vehicle located in the fast lane, the number one lane, with four occupants and one of them was critically injured. The other three were not,\" said CHP Officer Joseph Fowler.CHP says a white sedan pulled along side a black Mitsubishi and someone opened fire.Bullets shattered the front passenger window, one of them hitting the driver in the head. There were three other passengers who were not injured.All young males are between 18 and 25 years old. The car came to stop by the center divide and did not crash. The suspect vehicle escaped.CHP says there do not appear to be surveillance cameras along this stretch of freeway, but they are reaching out to nearby businesses.\"We've had a lot of shootings in the last year and we're taking this as a high priority,\" explained Off. Fowler.CHP says they'll be comparing details about this shooting to other freeway shootings, which now totals 91 in the Bay Area in the last year and a half.They are considering the possibility of road rage or a gang connection.",
    "source_domain": "abc7news.com",
    "title": "Another freeway shooting in San Leandro leaves driver in critical condition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/traffic/another-freeway-shooting-in-san-leandro-leaves-driver-in-critical-condition/2305802/"
}