{
    "authors": [],
    "date_download": "2018-07-04 21:15:18+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 18:54:50",
    "description": "NASA shared an image of a collection of red, white and blue stars to celebrate America's birthday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fscience%2Fhappy-4th-nasa-shares-image-of-celestial-fireworks%2F3705077%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/3705177_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Happy #FourthOfJuly! 🇺🇸 LED lights display an American Flag pattern on the International Space Station in the Advanced Plant Habitat, designed to record data from 180 sensors to test which growth conditions plants prefer in space. Get a closer look: https://t.co/4PNysEwvcg pic.twitter.com/KUHfr4MJ6o — NASA (@NASA) July 4, 2018\nNASA found an out-of-this-world way to celebrate America's birthday: with a very patriotic-looking collection of stars.\"Celestial Fireworks!\" NASA wrote on Twitter . \"Like a #4thOfJuly2018 fireworks display, this glittering collection of stars located 20,000 light-years away from Earth looks like a red, white & blue aerial burst.\"The image was taken by the Hubble Space Telescope in August and December of 2009. The collection of stars can be found in the constellation Carina, according to NASA . The stars are surrounded by the materials needed to form more stars: clouds of interstellar gas and dust.Though the environment in that constellation may appear peaceful in a still image, it's actually quite turbulent.\"These huge stars live fast and die young, burning through their hydrogen fuel quickly and ultimately ending their lives in supernova explosions,\" NASA wrote.The space agency also celebrated the day with an American flag made of LED lights aboard the International Space Station.",
    "source_domain": "abc7news.com",
    "title": "Happy Fourth from space: NASA shares image of patriotic-looking stars in honor of Independence Day",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/science/happy-4th-nasa-shares-image-of-celestial-fireworks/3705077/"
}