{
    "authors": [],
    "date_download": "2018-07-04 17:50:34+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 16:02:02",
    "description": "Deputies say the woman hid two handguns in her robe, confronted her son in his room and shot him twice.",
    "filename": "http%3A%2F%2Fabc7news.com%2F92-year-old-woman-allegedly-kills-son-to-avoid-nursing-home%2F3704265%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/ktrk/images/cms/automation/vod/3703380_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A 92-year-old woman is charged with murder after deputies say she fatally shot her own son because she thought he wanted to move her to an assisted living facility.The Maricopa County Sheriff's Office says Anna Mae Blessing had lived with her 72-year-old son Thomas and his girlfriend at the girlfriend's condo for the last six months.Court records show she believed her son and his girlfriend were talking about putting her in the facility because she had become 'difficult to deal with.'According to detectives, Blessing hid two handguns in the pockets of her robe and confronted her son in his room Monday morning.She allegedly shot him twice, then pointed the gun at his girlfriend.\"They struggled over the handgun. She was able to dislodge the handgun out of her hands and Blessing was able to pull out a secondary handgun, and they struggled over that handgun as well,\" Maricopa County Sgt. Bryant Vanegas told KPHO The girlfriend called 911.When deputies arrived, Blessing was sitting in her recliner.\"This is definitely an odd one. You know, there's a lot of circumstances surrounding it of course, but it's definitely something you don't see every day, and it's very unfortunate that this took place,\" said Vanegas.Blessing appeared before a judge in a wheelchair.She has been charged with first degree murder, aggravated assault and kidnapping.",
    "source_domain": "abc7news.com",
    "title": "92-year-old woman accused of fatally shooting son over plans to put her in assisted living facility",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/92-year-old-woman-allegedly-kills-son-to-avoid-nursing-home/3704265/"
}