{
    "authors": [],
    "date_download": "2017-10-06 21:25:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:18:12",
    "description": "Undersheriff Kevin C. McMahill provided an update on the investigation Friday. He says authorities have looked at gunman Stephen Paddock's personal life, political affiliation, economic situation and any potential radicalization",
    "filename": "http%3A%2F%2Fabc7news.com%2Fauthorities-still-searching-for-motive-behind-las-vegas-mass-shooting-%2F2499191%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2499194_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Authorities say they still don't have a clear motive for the Las Vegas shooting rampage.Undersheriff Kevin C. McMahill provided an update on the investigation Friday. He says authorities have looked at gunman Stephen Paddock's personal life, political affiliation, economic situation and any potential radicalization.He says authorities are aware the Islamic State group has claimed responsibility for the attack, but so far there is no evidence that it had a role.He says authorities will continue to investigate those areas as well as look into leads and tips that come in.Paddock unleased gunfire Sunday from the 32nd floor of the Mandalay Bay hotel casino on the Las Vegas Strip, killing dozens and injuring nearly 500 people. He killed himself as police closed in.Massachusetts could be moving quickly to outlaw so-called \"bump stock\" devices used by the Las Vegas shooter.Democratic and Republican lawmakers have both filed bills to ban the devices. Republican Gov. Charlie Baker said he supports a ban.The devices fit over the stock and grip of a semi-automatic rifle and allow the weapon to fire continuously, some 400 to 800 rounds in a single minute.State Rep. David Linsky, a Natick Democrat, has filed legislation that would outlaw any devices that increase the rate of discharge of a weapon and ban the sale of large capacity-feeding devices.Republican Senate Leader Bruce Tarr of Gloucester has sponsored a bill that would prohibit devices that effectively turn rifles and shotguns into weapons with firing capabilities similar to machine guns.Scott Armstrong, a Reno, Nevada, car dealer, said Paddock confided in him about relationship troubles when the would-be gunman stopped in looking to buy a car about two months ago.\"Somehow or another we ended up talking about bad relationships, and he confided that he was depressed and his life was miserable,\" Armstrong said. \"It just struck me as really odd that somebody would say that.\"Paddock, unshaven and dressed casually but not disheveled, didn't elaborate on his relationship troubles, and Armstrong didn't pry. He didn't smile, and he \"wasn't very pleasant to talk to,\" he said.\"I could tell he was really down or something,\" Armstrong said. \"I just told him, I said, 'Hey I've been in some bad relationships myself. It'll get better. Tomorrow will be a better day than today.' \"Armstrong said he's talked with FBI agents about his recollection.Others who have interacted with Paddock have described him as a quiet and confident man who did not engage in deep conversations. Armstrong said he's baffled by why he was so open with a stranger, but \"my job is to put people with ease and try to help them buy a car.\"How is he so certain Paddock is the downtrodden man who visited him?\"When's the last time somebody told you their life was miserable? It sticks with you,\" he said.",
    "source_domain": "abc7news.com",
    "title": "Authorities still searching for motive behind Las Vegas mass shooting",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/authorities-still-searching-for-motive-behind-las-vegas-mass-shooting-/2499191/"
}