{
    "authors": [],
    "date_download": "2017-08-15 00:39:32+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 22:10:54",
    "description": "Officials with the Lake County Sheriff's Department say a man who shot at CHP officers and Caltrans workers on Monday morning has been captured.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fman-who-allegedly-shot-at-chp-in-lake-county-captured%2F2307776%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308032_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lake Co manhunt for Kelseyville man Joshua Caleb Brown. Allegedly shot at @CHP & @CaltransHQ workers. #abc7now via @romn8tr pic.twitter.com/DhFDDcmGyR — Katie Utehs (@KatieUtehs) August 14, 2017\nPotential suspect seen moving up a hill to a residence just north of incident. Grey shirt with backpack. #lakecountyshooter — Rev. Dave Thompson (@revdavethompson) August 14, 2017\nOfficials with the Lake County Sheriff's Department say a man who shot at CHP officers and Caltrans workers on Monday morning has been captured.According to officials, employees with Caltrans were in the area between Cruickshank Road and Cole Creek Road on Hwy 29 in Kelseyville conducting road work around 10:30 a.m. Units with the CHP were also in the area assisting Caltrans when they noticed a man walk out of his house and approach them.Deputies say 43-year-old Joshua Brown, known as \"Buck Brown,\" fired two shots in the direction of the officers and workers. They note that he fired additional shots at a State Parks Officer and then fled on foot.A perimeter was established and additional assistance from allied agencies was requested. Officers from the California Highway Patrol, Lakeport Police Department, Clearlake Police Department, Lake County D.A.'s Office, Mendocino County Sheriff's Office, and Sonoma County Sheriff's Office responded to assist. California Highway Patrol and Sonoma County Sheriff's Office assisted with air support.While the search for Brown was underway, officials closed Highway 29 remains to all traffic between Live Oak Drive and Bottle Rock Road. Live Oak Drive was also closed between Cruickshank Road and Cole Creek Road.Officials say Brown is known in the area to dislike law enforcement. They believe he retreated into his residence after the shooting.Authorities announced that he was captured around 5:15 p.m. but have not disclosed any further details.No injuries were reported in the shooting.",
    "source_domain": "abc7news.com",
    "title": "Man who allegedly shot at CHP in Lake County captured",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/man-who-allegedly-shot-at-chp-in-lake-county-captured/2307776/"
}