{
    "authors": [
        "Jonathan Bloom"
    ],
    "date_download": "2018-03-20 03:55:54+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:25:34",
    "description": "The fatal crash of an Uber autonomous vehicle on a street in Tempe, Arizona, has sent shockwaves through the world of self-driving cars -- leading some experts to say it's time to hit the brakes.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235916%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3236295_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The fatal crash of an Uber autonomous vehicle on a street in Tempe, Arizona, has sent shock waves through the world of self-driving cars -- leading some experts to say it's time to hit the brakes.It's also elicited a broad range of reactions from people who work near San Francisco's Financial District, where several companies test their autonomous vehicles every day on the narrow, crowded streets.\"I think they're better drivers than most people in this town,\" said Adrian Heieis. \"So I really don't mind it.\"But Darrell Hamilton disagreed. \"I don't think they should be testing self-driving cars where people could actually be hit,\" he said.And on a street in Arizona, that's exactly what happened. Temple police say Uber's Volvo SUV appeared to have been driving at 40 miles per hour, and didn't show any signs of trying to slow down, before it struck and killed a pedestrian who was walking her bike in the dark.\"This was the nightmare that I've dreaded for quite some time,\" said Carnegie Mellon professor Raj Rajkumar, who's studied self-driving cars since 2004. \"I did not expect to see this happen so soon.\"Rajkumar says any number of technical glitches could've been to blame for the car's failure to see the pedestrian -- but his first questions are for the human safety driver who was seated behind the wheel while the car drove itself.\"That operator should've stepped in, taken over control immediately,\" he said.The National Transportation Safety Board has dispatched a team to investigate the cause of the accident. They'll be examining video recordings from cameras both inside and outside the vehicle, in part to determine why the human didn't take over, or why attempts at manual override may have failed.Uber CEO Dara Khosrowshahi tweeted, \"Some incredibly sad news out of Arizona. We're thinking of the victim's family as we work with local law enforcement to understand what happened.\"Uber's self-driving car division had barely finished licking its wounds from a $245 million settlement in the court battle with rival Waymo. CNET News reporter Dara Kerr covered the trial.\"I think this (fatal crash) affects a lot more than just Uber. I think it's gonna have a ripple effect across the entire self-driving industry,\" Kerr said. \"It seems these companies are in really tight competition with one another, and they're all racing to get their cars to the public first.\"The public, though, could now be more wary than ever.\"Makes me a bit nervous,\" Kristen Gauthier said of the cars roaming the neighborhood where she works. \"But then again, I'm nervous about people behind the wheel as well.\"Srijon Das, who also works in the neighborhood, had a different view.\"Eventually, people accept technologies and move ahead with it,\" Das said.While that may be true, accepting machines that do a job once reserved for humans can certainly take awhile. Autonomous elevators were invented in 1900 -- but it took Americans almost 50 years to get used to the idea.\"Consumers' trust is a big, big deal,\" Kerr said.If companies want to earn that trust, Rajkumar said they should slow down.\"Take a deep breath, be cautious, train our people well,\" he said.Though Arizona doesn't require it, California still mandates a human safety driver during all autonomous car testing. The driver can be in the car, or -- starting in April -- can supervise the car's driving from a remote location.The California DMV said in s statement that it's aware of the crash in Arizona, and plans to follow up with Uber. In the meantime, Uber said it has suspended its self-driving operations in Tempe, Pittsburgh, San Francisco and Toronto.",
    "source_domain": "abc7news.com",
    "title": "Fatal self-driving Uber crash could send waves through a nascent industry",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235916/"
}