{
    "authors": [],
    "date_download": "2018-03-20 04:00:00+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 18:03:38",
    "description": "The food delivery service operates out of vegan wine bar Encuentro in Jack London Square.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3234638%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3234637_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Bay Area's newest addition to the crowded food-delivery scene is taking sustainability to the next level; Planted Table is an all vegan, zero-waste food meal service based out of Jack London Square.Launched in January by sisters Megan Scott and Lauren Mahlke, Planted Table operates out of vegan wine bar Encuentro . Like other services, the company offers plans suitable for individuals and families, but where it distinguishes itself is in its menu concept and delivery methods.\"We thought the idea of a vegan meal delivery service would be so great, but couldn't live with ourselves if we were adding such a considerable amount of waste/plastic to the environment,\" said Scott via email.Instead, meals are delivered in glass containers inside insulated packaging which the company then collects to clean and reuse. It would be cheaper and easier to deliver in plastic, Scott said, \"but we are committed to zero waste and willing to face the challenge head on.\"Planted Table extends this practice to food, she added. \"We order exactly what we need for the week from local farms, and nothing goes to waste. \"The menu features dishes like beet and citrus arugula salad with pistachio and citrus maple dressing for lunch and sweet potato chickpea curry with basmati cauliflower rice for dinner. Meals are sold in multiples; a six-meal bundle for one person costs $106/week, while a three-day plan for four people with 18 meals is $192/week.To ensure that all meals are balanced, Planted Table employs a nutritionist, who's also available to answer customer concerns.The service currently delivers to Alameda and Contra Costa counties on Wednesdays, but people outside those areas can stop by the kitchen to pick up orders in person. For more information, email plantedtable@gmail.com or call/text 562-221-6782.",
    "source_domain": "abc7news.com",
    "title": "'Planted Table' Delivers Vegan, No-Waste, Plastic-Free Meals",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3234638/"
}