{
    "authors": [],
    "date_download": "2018-03-20 03:37:24+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:03:42",
    "description": "Looking for an affordable rental in Oakland?",
    "filename": "http%3A%2F%2Fabc7news.com%2Frealestate%2Foaklands-cheapest-apartments-right-now%2F3235849%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3235848_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "1241 81st Ave.\n8656 MacArthur Blvd.\n1929 26th Ave.\n4220 Aberfoil Ave.\n1921 26th Ave., #24\nAccording to rental site Zumper , the median cost of a 1-bedroom in Oakland is around $2,100/month--but what does the low-end pricing on a rental actually look like?We searched listings for studios and 1-bedroom apartments to find the cheapest listings available right now, but these prices and availability are subject to change.Listed at $1,000/month, this 180-square-foot studio apartment at 1241 81st Ave. in Fitchburg is 39.4 percent less than the median rent for a studio in Oakland, currently estimated at around $1,650/month.This studio features tile flooring, wooden cabinets and granite countertops, but pets are not allowed.Per Walk Score ratings, this location is friendly for those on foot, is fairly bikeable and has good transit options.(See the complete listing here .)Here's a 1-bedroom, 1-bathroom apartment at 8656 MacArthur Blvd. in Toler Heights that's going for $1,625/month.Amenities on the building include on-site laundry, assigned parking and storage space. The apartment features hardwood floors, granite countertops and plenty of cabinet space, but pets are not permitted.According to Walk Score, the surrounding area is car-dependent, has minimal bike infrastructure and has solid transit options.(See the full listing here .)Then there's this 450-square-foot apartment with one bedroom and one bathroom at 1929 26th Ave. in Reservoir Hill/Meadow Brook that's listed at $1,649/month.Building amenities include on-site laundry and secured entry, but pets are not allowed. The unit features hardwood floors, custom cabinets, stainless steel appliances and a ceiling fan.Walk Score indicates that the surrounding area is quite walkable, has some bike infrastructure and offers many nearby public transportation options.(See the listing here .)Listed at $1,725/month, this 700-square-foot, 1-bedroom, 1-bathroom apartment is located at 4220 Aberfoil Ave. in Chabot Park.In the unit, the listing promises hardwood floors, in-unit laundry, stainless steel appliances, a swimming pool and a large backyard. Good news for pet guardians: cats and dogs are permitted.Per Walk Score ratings, the surrounding area requires a car for most errands, isn't particularly bikeable and offers limited transit options.(Here's the listing .)This 1-bedroom, 1-bathroom apartment, situated at 1921 26th Ave. in Reservoir Hill/ Meadow Brook, is listed for $1,749/month for its 550-square-feet of space.Amenities offered in the unit include hardwood floors, custom cabinets, stainless steel appliances, in-unit laundry and secured entry, but animals are not permitted.Per Walk Score ratings, the surrounding area is friendly for those on foot, is bikeable and offers many nearby public transportation options.(See the listing here .)---",
    "source_domain": "abc7news.com",
    "title": "Oakland's Cheapest Apartments, Right Now",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/realestate/oaklands-cheapest-apartments-right-now/3235849/"
}