{
    "authors": [],
    "date_download": "2017-08-14 23:09:27+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 22:10:54",
    "description": "Law enforcement officials, including Lake County Sheriff's Department, have issued a shelter-in-place in the area south of Kelseyville.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsearch-on-for-gunman-who-shot-at-chp-sheriffs-deputies-in-lake-county%2F2307776%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2307844_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Potential suspect seen moving up a hill to a residence just north of incident. Grey shirt with backpack. #lakecountyshooter — Rev. Dave Thompson (@revdavethompson) August 14, 2017\nOn Monday around 10:30 a.m. employees with Caltrans were in the area between Cruickshank Road and Cole Creek Road on Hwy 29 in Kelseyville conducting road work.Units with the CHP were also in the area assisting Caltrans. The CHP officers and Caltrans workers were confronted by a male subject from a residence in the area.The male suspect fired two shots in the direction of the CHP officers and Caltrans workers.Lake County Sheriff's units responded to assist along with a sheriff's unit. The subject then fired another shot towards the officer's direction. He then fired two additional shots at a State Parks officer. The suspect then fled on foot.A perimeter was established and additional assistance from allied agencies was requested. Officers from the California Highway Patrol, Lakeport Police Department, Clearlake Police Department, Lake County D.A.'s Office, Mendocino County Sheriff's Office, and Sonoma County Sheriff's Office responded to assist. California Highway Patrol and Sonoma County Sheriff's Office assisted with air support.The suspect has been identified as Joshua Caleb Brown, 43, of Kelseyville. The search for Brown is continuing. Brown is considered armed and dangerous and should not be contacted.If you see someone you believe to be Brown avoid contact and immediately call 911.Highway 29 remains closed to all traffic between Live Oak Drive and Bottle Rock Road. An alternate route of Soda Bay Road to Highway 29 can be used. Live Oak Drive is also closed between Cruickshank Road and Cole Creek Road.",
    "source_domain": "abc7news.com",
    "title": "Search on for gunman who shot at CHP, Sheriff's deputies in Lake County",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/search-on-for-gunman-who-shot-at-chp-sheriffs-deputies-in-lake-county/2307776/"
}