{
    "authors": [],
    "date_download": "2018-04-25 04:23:53+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 17:16:46",
    "description": "Drinking alcohol can give you more than bad breath. A new study finds people who routinely drink one or more alcoholic beverages a day may have an overabundance of bad bacteria in their mouth.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3386626%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3386625_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Drinking alcohol can give you more than bad breath. A new study finds it can change the bacteria in your mouth and not for the better.Researchers say people who routinely drink one or more alcoholic beverages a day may have an overabundance of bad bacteria in their mouth, compared to nondrinkers. It can lead to lead to gum disease, heart problems and even some cancers.\"Our study offers clear evidence that drinking is bad for maintaining a healthy balance of microbes in the mouth and could help explain why drinking, like smoking, leads to bacterial changes already tied to cancer and chronic disease,\" says study senior investigator and epidemiologist Jiyoung Ahn, PhD.Possible explanations for drinking-related microbiome imbalances, Ahn says, could be that acids in alcoholic beverages make the oral environment hostile for certain bacteria to grow. Another reason, she says, could be the buildup of harmful byproducts from alcohol's breakdown, including chemicals called acetaldehydes, which along with the harmful toxins in the mouth from tobacco smoke, are produced by certain bacteria, such as Neisseria.The study was published in the journal Microbiome online April 23 and led by NYU School of Medicine researchers.",
    "source_domain": "abc7news.com",
    "title": "Study: Drinkers' mouths have more bad bacteria",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3386626/"
}