{
    "authors": [],
    "date_download": "2017-10-06 13:50:58+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 10:59:32",
    "description": "This year's Nobel Peace Prize goes to International Campaign to Abolish Nuclear Weapons, the committee announced Friday morning. Here's what to know about the newest winners.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Fwhat-is-ican-this-years-nobel-peace-prize-winner%2F2498186%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/2498490_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This year's Nobel Peace Prize goes to International Campaign to Abolish Nuclear Weapons, the committee announced Friday morning. Here's what to know about the newest winners.ICAN is a large group of NGOs (non-governmental organizations) from 100 countries that have come together in an effort to promote and generate public support for an international nuclear weapons ban treaty. There are 25 organizations in the United States that are a part of ICAN.ICAN was instrumental in the adoption of the United Nations Treaty on the Prohibition of Nuclear Weapons, the first treaty of its kind according to the Norwegian Nobel Committee . Signing began on Sept. 20, and the treaty will not enter into force until it is ratified by at least 50 states.In adopting the treaty in July, 122 nations committed to prohibit \"a full range of nuclear-weapon-related activities, such as undertaking to develop, test, produce, manufacture, acquire, possess or stockpile nuclear weapons or other nuclear explosive devices, as well as the use or threat of use of these weapons,\" according to the U.N.The treaty is not without opponents, however. The United States, France and the United Kingdom released a statement that they \"have not taken part in the negotiation of the treaty... and do not intend to sign, ratify or ever become party to it.\"In addition to the treaty, ICAN has convinced more than 100 nations to make a commitment to cooperate and work together to \"stigmatize, prohibit and eliminate nuclear weapons,\" known as the Humanitarian Pledge The Nobel committee mentioned both the pledge and the treaty as major reasons that ICAN is deserving of the prize.Nuclear weapons are \"the only weapons of mass destruction not yet explicitly prohibited under international law,\" according to ICAN and the Nobel committee.The Nobel Prize announcement points out that, with the recent tensions with North Korea, this has become an urgent international concern.\"Some states are modernizing their nuclear arsenals, and there is a real danger that more countries will try to procure nuclear weapons, as exemplified by North Korea. Nuclear weapons pose a constant threat to humanity and all life on earth,\" the committee wrote.ICAN's work, such as the pledge and the treaty, has given direction and vigor to efforts to create a nuclear weapons-free world, according to the committee.ICAN's executive director, Beatrice Fihn, was called to receive the good news shortly before it was announced. She was overjoyed, saying her initial reaction was one of \"shock.\" The organization released a statement after the announcement, saying \"This prize is a tribute to the tireless efforts of many millions of campaigners and concerned citizens worldwide who, ever since the dawn of the atomic age, have loudly protested nuclear weapons.\"The Nobel committee acknowledged that, as important as ICAN's work is, the problem of nuclear weapons is far from solved. It is calling upon nations that have developed nuclear weapons, which includes the U.S., to lead the way in taking steps toward eliminating those weapons.\"The Committee wishes to emphasize that the next steps towards attaining a world free of nuclear weapons must involve the nuclear-armed states,\" the committee wrote. \"This year's Peace Prize is therefore also a call upon these states to initiate serious negotiations with a view to the gradual, balanced and carefully monitored elimination of the almost 15,000 nuclear weapons in the world.\"",
    "source_domain": "abc7news.com",
    "title": "What to know about ICAN, the 2017 Nobel Peace Prize winner",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/what-is-ican-this-years-nobel-peace-prize-winner/2498186/"
}