{
    "authors": [],
    "date_download": "2018-03-20 03:37:03+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 01:03:47",
    "description": "The folks behind Daly City's popular Koi Palace are planning to open a new eatery in the former Waxman's Restaurant.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ffood%2Fpalette-dim-sum-restaurant-coming-to-ghirardelli-square%2F3236022%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3236021_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Tipster extraordinaire Al M. reports that a new restaurant from the folks behind Koi Palace , Daly City's extremely popular dim sum eatery, is poised to take over the former Waxman's Restaurant which closed after just over a year in operation.Waxman's later introduced a pop-up chicken joint in the space called JBird that shuttered shortly thereafter.The new spot, called Palette, is still in its early stages, said Al, with \"just a yellow department of Alcoholic Beverages Control notice of a title transfer on the window.\" Public records indicate the Type 47 license application, which allows for beer and wine sales, has been approved.Public records also indicate that several building permit applications are in \"triage\" status to determine compliance, including demolition and work to include the installation of partitions, fixtures, finishes and other equipment.While Koi Place currently has three Bay Area locations , including outposts in Milpitas and Dublin, the restaurant group has expanded its operations with the addition of Richmond District dim sum and hot pot spot, Dragon Beaux in 2015.Dragon Beaux general manager Dennis Leung--who is overseeing operations at Palette--confirmed to theearlier this month that the restaurant is still a long way off, as construction has yet to begin.There's work to be done to better integrate the bar with the dining room, Leung said, and large tanks will be installed to showcase the restaurant's selection of fresh seafood as well.As for the yet-to-be-determined menu, dim sum will still be the highlight, Leung said, but expect to see wok and barbecue stations joining the mix with dishes like wok-fired mussels and clams, along with grilled lobsters on the half-shell and a variety of skewers. A grab-and-go dim sum take-out component may be in the works, too.Thanks as always for the tip, Al!Have you come across a new (or closing) restaurant? Text your tip and a photo to 415-200-3233, or email tips@hoodline.com. If we use your info in a story, we'll give you credit.",
    "source_domain": "abc7news.com",
    "title": "'Palette' Dim Sum Restaurant Coming To Ghirardelli Square",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/food/palette-dim-sum-restaurant-coming-to-ghirardelli-square/3236022/"
}