{
    "authors": [
        "Katie Utehs"
    ],
    "date_download": "2018-07-04 19:32:45+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 17:00:00",
    "description": "A block party in San Francisco is far from your normal Fourth of July celebration -- protesters are vowing to \"Block ICE.\"",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Factivists-hold-block-ice-protest-on-4th-of-july-in-sf%2F3704568%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3704976_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos A woman takes the oath of naturalization at a citizenship ceremony in San Jose, California on January 25, 2018.\nEMBED >More News Videos Cameras were rolling when Congressman Jeff Denham rang the bell at a shelter for immigrant children in Pleasant Hill. Nobody opened the door, but someone from the facility let Rep. Denham know he would not be able to go inside.\nSan Francisco's Occupy ICE encampment has doubled since Tuesday as protesters have now taken over the sidewalk and one lane of Washington Street. The San Francisco Police Department has officers at the end of the block, but there's been no interaction just observation.Dozens camped in front of the U.S. Immigration & Customs Enforcement building in the city's Financial District. They've blocked entrances on both Washington and Jackson streets.Instead of celebrating the Fourth of July in the traditional sense, they're holding a \"Block ICE\" block party. Organizers call it a celebration of resistance.Protesters have encamped at ICE buildings across the country, following a weekend of marches in reaction to the administration's family separation policy.San Francisco's encampment started Monday with a rally held Tuesday afternoon.\"We are united under the banner of the destruction of ICE, wholesale, and the humane treatment of people who are trying to come into this country whether or not they have documentation or not,\" said Zoe Samudzi at Tuesday's rally.The protest has not interrupted or changed court operations so far, according to a court spokesman.He says many of the people appearing don't physically come to the courthouse.\"They appear via video link between our court and that detention center, so protesters outside aren't going to keep them from getting to the courtroom,\" said Ken Gardner, Public Information Officer (Western States) for the Executive Office for Immigration Review.Federal offices are closed for the Fourth of July holiday.President Donald Trump had this to say about ICE on Tuesday, \"We're not abandoning ICE and we're not abandoning our law enforcement.\"The Block ICE block party begins at 12 p.m. Organizers are asking for supplies and for supporters to join them.",
    "source_domain": "abc7news.com",
    "title": "Activists hold 'Block ICE' block party protest on 4th of July in San Francisco",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/activists-hold-block-ice-protest-on-4th-of-july-in-sf/3704568/"
}