{
    "authors": [],
    "date_download": "2018-04-24 20:32:12+00:00",
    "date_modify": null,
    "date_publish": "2018-01-10 02:05:48",
    "description": "Here's a complete look at the eight candidates who are running for San Francisco mayor.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Fcomplete-list-of-candidates-running-for-sf-mayor%2F2920793%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2931419_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Angela Alioto\nLondon Breed\nMichelle Bravo\nRichie Greenberg\nJane Kim\nMark Leno\nAmy Farah Weiss\nEllen Lee Zhou\nEight candidates are running for San Francisco mayor. They each met the Tuesday, Jan. 9 deadline at 5 p.m. to file paperwork for the June 5 election.One of the candidates will replace the late Ed Lee , who passed away in December.Here is a brief look at the candidates (Information is gathered from their campaign website. If applicable, we included links to their site):A Democratic politician and attorney. Two of her goals are to fight crime and help the homeless.The San Francisco native ran for city mayor in 1991 and 2003. She is also a former supervisor, and a former president of the Board of Supervisors.Alioto graduated from Lone Mountain College. She received her J.D. from the University of San Francisco School of Law, and was admitted to the California State Bar.Her father, Joseph Alioto, served as the mayor of San Francisco from 1968 to 1976. Click here to find out more about Alioto.Currently serving as the acting mayor of San Francisco, following the unexpected death of Mayor Ed Lee. Not only is she a supervisor for District 5 in San Francisco, she is also the current president of the Board of Supervisors.She was born in San Francisco and attended Galileo High School. She received her Bachelor of Arts Degree from U.C. Davis and her Master's Degree from the University of San Francisco. Click here to learn more about London Breed.San Francisco Mayoral CandidateHas over 25 years of business experience. He says he is the \"candidate best capable to address the issues important to all San Francisco citizens, young and old, of all backgrounds, abilities, faiths and cultures.\" According to Greenberg's website, \"he has been instrumental in helping launch hundreds of new companies and over 200 nonprofit organizations in Los Angeles and San Francisco, as well as serving over 1,500 clients with a variety of business needs.\"He was born in New York City and went to college in Los Angeles. He moved to San Francisco in 2001. Click here to learn more about Richie Greenberg.Says she has fought to expand access to affordable housing, protect renters, close the income gap, and improve public schools.She worked on an initiative to make City College of San Francisco the first community college in the nation to offer free classes to all residents regardless of age, income or educational status.Kim was born and raised in New York City. Her parents immigrated from Seoul, South Korea in the early 1970s. She attended Stanford University, where she majored in Political Science and Asian American Studies. She went on to receive her law degree from U.C. Berkeley School of Law. Jane Kim lives in San Francisco. Click here to learn more about Kim.Has served the San Francisco community as a small business owner, supervisor, assemblymember, and state senator. He says he \"will fight on behalf of regular San Franciscans - the tenants, homeowners, small business owners, and immigrants.\"He also says on his website he has fought for better schools and access to higher education, a cleaner and sustainable environment, affordable housing, universal single-payer healthcare, and equal rights for all Californians.Leno attended in the University of Colorado at Boulder, and graduated with a Bachelor of Arts Degree from the American College in Jerusalem. He has lived in Noe Valley for the past 36 years. Click here to learn more about Mark Leno.Became activated in politics in 2011. She founded a public-benefit organization called Neighbors Developing Divisadero to support inclusive, culturally enriching, and sustainable housing policy and economic development.Weiss wants to collaboratively lead the city's departments, budgeting process, and commission appointments in implementing a comprehensive platform for equity.She has a Master's Degree in Organizational Development & Training from San Francisco State University. Click here to learn more about Amy Farrah Weiss.Has been working as a public servant for the city and county of San Francisco since 2004 and a social worker since 1996, according to her website.She wants to tackle drug-abuse problems, homeless issues, and affordable housing for families.Zhou immigrated to San Francisco in 1986. She was born in Taishan, Guangdong, China.She earned her Associate of Science degree in Hotel and Restaurant Management from City College of San Francisco. She received her Bachelor of Social Worker degree and Master of Social Work degree in 2003 from San Francisco State University. Click here to learn more about Zhou.",
    "source_domain": "abc7news.com",
    "title": "Complete list of candidates running for San Francisco mayor",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/complete-list-of-candidates-running-for-sf-mayor/2920793/"
}