{
    "authors": [],
    "date_download": "2017-10-06 16:52:56+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:18:12",
    "description": "Las Vegas gunman Stephen Paddock booked rooms over other music festivals in the months before opening fire on a country music festival, authorities said, while thousands came out to mourn a police officer who was one of the 58 people he killed.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fthousands-mourn-slain-officer-as-las-vegas-probe-goes-on%2F2499191%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2499194_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Las Vegas gunman Stephen Paddock booked rooms over other music festivals in the months before opening fire on a country music festival, authorities said, while thousands came out to mourn a police officer who was one of the 58 people he killed.Paddock booked rooms overlooking the Lollapalooza festival in Chicago in August and the Life Is Beautiful show near the Vegas Strip in late September, according to authorities reconstructing his movements before he undertook the deadliest mass shooting in modern U.S. history.Fenway Park in Boston also came up during the investigation of Paddock, Boston police Lt. Detective Mike McCarthy said Thursday, though he provided no further details.It was not clear if he contemplated massacres at the other sites.The details came to light as investigators struggled to figure out why the 64-year-old high-stakes gambler opened fire on a crowd of 22,000 Sunday night from the 32nd floor of the Mandalay Bay hotel casino. He killed 58 and injured nearly 500 before taking his own life.On Thursday night, thousands raised candles and surrounded the widow and two children of Officer Charleston Hartfield, who was killed in the shooting.Hartfield, a 16-year Army veteran who served in Iraq, was known as \"Charles,\" Chuck\" and \"ChuckyHart,\" but one longtime friend and colleague dubbed him \"Captain America.\"\"Charlie Hartfield was the greatest American I have ever known,\" Sgt. Ryan Fryman told the crowd.His was among the first memorials for the dead, whose identities have now all been released by authorities.The victims killed ranged in ages from 20 to 67. Two of them, 24-year-old Austin Cooper Meyer and 61-year-old Brett Schwanbeck, had not been identified before the Clark County Coroner released a complete list Thursday night.A federal official said authorities are looking into the possibility Paddock planned additional attacks, including a car bombing. The official wasn't authorized to discuss the matter publicly and spoke to The Associated Press on condition of anonymity.Authorities previously disclosed Paddock had 1,600 rounds of ammunition in his car, along with fertilizer that can be used to make explosives and 50 pounds of Tannerite, a substance used in explosive rifle targets.Police announced Thursday that they had found a Hyundai Tucson SUV they had been searching for as part of the probe while executing a search warrant at the home in Reno that Paddock shared with his girlfriend, Marilou Danley. It wasn't immediately clear if the car was found on Thursday or earlier in the week when police searched the home and found several guns and ammunition.Paddock had an arsenal of 23 weapons in his hotel room. A dozen of them included \"bump stocks,\" attachments that can effectively convert semi-automatic rifles into fully automated weapons.In a rare concession on gun control, the National Rifle Association announced its support Thursday for regulating the devices.Danley told FBI agents Wednesday she had not noticed any changes in his mental state or indications he could become violent, the federal official said.Paddock sent Danley on a trip to her native Philippines before the attack, and she was unaware of his plans and devastated when she learned of the carnage while overseas, she said in a statement.Investigators combing through his background for clues remain stumped as to his motive.The profile developed so far is of a \"disturbed and dangerous\" man who acquired an arsenal over decades, Sheriff Joseph Lombardo said. But investigators have been frustrated to find that he lived a \"secret life,\" Lombardo said, \"much of which will never be fully understood.\"A former executive casino host at the Atlantis Casino Resort and Spa in Reno said Paddock had a \"god complex\" and expected quick service without regard to how busy the staff was at the time.\"He liked everybody to think that he was the guy,\" John Weinreich said. \"He didn't boast about anything he had or anything. It was just his demeanor. It was like, 'I'm here. Don't cross me. Don't look at me too long.'The weekend before the massacre, he rented a room through Airbnb at the 21-story Ogden condominiums in downtown Las Vegas and stayed there during a music festival below that included Chance the Rapper, Lorde and Blink-182.Police were reviewing video shot at the high-rise to check Paddock's movements. His renting the condo was curious because, as a high-roller, he could have easily gotten a free room at one of the casino hotels on the Vegas Strip.In early August, Paddock booked a room at Chicago's 21-story Blackstone Hotel that overlooked the park where the Lollapalooza alternative music festival was being held, though there's no evidence he actually stayed there, a law enforcement official said Thursday.The official was not authorized to discuss the case publicly and spoke on condition of anonymity after being briefed on the investigation.The hotel confirmed a Stephen Paddock made a reservation but said he never checked in.Lollapalooza draws hundreds of thousands of music fans every year to Grant Park.",
    "source_domain": "abc7news.com",
    "title": "Thousands mourn slain officer as Las Vegas probe goes on",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/thousands-mourn-slain-officer-as-las-vegas-probe-goes-on/2499191/"
}