{
    "authors": [
        "Matt Keller"
    ],
    "date_download": "2018-04-24 15:24:09+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 08:44:29",
    "description": "A three-alarm fire burning at a huge apartment complex under construction in Concord is now under control. Two people suffering from smoke inhalation have been transported to the hospital, officials said.",
    "filename": "http%3A%2F%2Fabc7news.com%2F250-evacuated-2-injured-in-3-alarm-concord-fire%2F3385224%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3385685_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "About 250 people evacuated from adjacent Renaissance Square Apartments. They are at a nearby park. Firefighters expect many will be allowed to return in a couple of hours. pic.twitter.com/bgYWQWov4I — Matt Keller (@MattKellerABC7) April 24, 2018\nFirefighters say fire is under control at under construction apartment complex on Concord Blvd. and Galindo St. in Concord. 2 people taken to hospital for smoke inhalation. pic.twitter.com/YZtm23tvuY — Matt Keller (@MattKellerABC7) April 24, 2018\nA three-alarm fire burning at a huge apartment complex under construction in Concord is now under control. Two people suffering from smoke inhalation have been transported to the hospital, officials said.About 250 residents of the nearby Renaissance Apartment Building complex have been evacuated. The complex it is located at the intersection of Clayton Road and Galindo Street, about a block and a half from the BART station. Residents were being told to gather in nearby Todos Santos Plaza.Contra Costa County Health officials have issued a health advisory for people with respiratory conditions near the blaze. Residents are being advised to stay inside or stay away within a one mile radius of the fire.Several areas of the building have collapsed. The fire spread quickly because the building was still in stick frame construction, firefighters said.First reports of the fire came in at 1 a.m. At least 70 firefighters have been on scene. The structure spreads for an entire city blockGalindo Street is closed at Clayton Road and Salvio Street. In addition, Willow Pass Road, Concord Boulevard and Clayton Road are all closed at Galindo and Sutter streets.",
    "source_domain": "abc7news.com",
    "title": "250 evacuated, 2 injured in 3-alarm Concord fire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/250-evacuated-2-injured-in-3-alarm-concord-fire/3385224/"
}