{
    "authors": [
        "Leslie Brinkley"
    ],
    "date_download": "2018-04-25 03:21:58+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:46:24",
    "description": "A massive fire at an apartment building under construction destroyed a two-block area near Todos Santos Plaza in Concord and ATF is investigating into whether or not it was arson.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fcould-fire-at-concord-building-under-construction-be-arson%2F3388188%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3388262_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos A massive fire destroyed a huge apartment complex under construction in Concord. Two people are injured and hundreds of people living next door have been evacuated.\nEMBED >More News Videos A ferocious early morning fire devoured an Oakland apartment complex that was under construction and forced hundreds to evacuate while crews battled the four-alarm blaze.\nResidents allowed in to get \"essentials\"- cats, medicine, cars from evacuated apts by concord fire #abc7news pic.twitter.com/rJY27CZBIT — Leslie Brinkley (@lrbrinkley) April 24, 2018\nThese concord residents got \"waffle\" out. But cat is still in apt after scary evacuation. Waiting to get in #abc7news pic.twitter.com/hFb95b9NwR — Leslie Brinkley (@lrbrinkley) April 24, 2018\nWhat's left of apartments under construction in Concord after overnight fire. #abc7news pic.twitter.com/vMmusm2Vwp — Leslie Brinkley (@lrbrinkley) April 24, 2018\nJust now, a huge portion of this burning construction site in Concord collapsed. Lots of smoke #abc7news pic.twitter.com/MDHbCwzjKw — Leslie Brinkley (@lrbrinkley) April 24, 2018\nA massive apartment construction fire early Tuesday morning destroyed a two-block area near Todos Santos Plaza in Concord and ATF is joining the investigation into whether or not arson could be involved.Dispatchers were inundated with calls at 1 a.m., with one person describing an explosion followed by a massive fire erupting at a construction site near downtown Concord. Assistant Chief Terrence Carey, the incident commander, said fire crews arrived to find a large fire at a five-story apartment complex under construction with wood framing engulfed in flames.At least 70 fire fighters converged at Galindo and Concord boulevards to fight the blaze, while 250 residents of the apartment complex across the street were told to evacuate. \" I looked out the window and all I could see was a wall of flame and fire. Unfortunately, I couldn't get the cat and the apartment started to smell like smoke and we had to get out. The dog was next to me and I grabbed her,\" Emily Scheffler said.Three people were taken to hospitals for smokes inhalation, but no other injuries were reported.ATF investigators are joining local fire officials to pinpoint the cause just as they did in three other construction site fires in the East Bay over the last two years. Two blazes at an Emeryville construction site and another on Valdez st in Oakland last summer were deemed suspicious. \"It's way too early to know if this is accidental or intentional. Also, it's too early to know if this is connected to other fires across the Bay Area,\" Jill Snyder with ATF said.Ash and debris rained down on nearby streets as the health department issued a warning. \"Residents should avoid washing or sweeping ash and debris into storm drains as this could contribute to pollution accumulating in nearby creeks,\" according to Maria Duazo with Contra Costa Health Services.Evacuated residents had 10 minutes to retrieve medicine, clothes and pets from their apartments late Tuesday afternoon. One man said, \"I am alive, everyone's alive, at least we made it out OK.\"",
    "source_domain": "abc7news.com",
    "title": "Could fire at Concord building under construction be arson?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/could-fire-at-concord-building-under-construction-be-arson/3388188/"
}