{
    "authors": [
        "Matt Keller"
    ],
    "date_download": "2018-04-25 04:23:44+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 08:44:29",
    "description": "A massive fire destroyed a huge apartment complex under construction in Concord. Two people are injured and hundreds of people living next door are evacuated. The investigation into the cause is under way.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3385224%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3386403_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "About 250 people evacuated from adjacent Renaissance Square Apartments. They are at a nearby park. Firefighters expect many will be allowed to return in a couple of hours. pic.twitter.com/bgYWQWov4I — Matt Keller (@MattKellerABC7) April 24, 2018\nFirefighters say fire is under control at under construction apartment complex on Concord Blvd. and Galindo St. in Concord. 2 people taken to hospital for smoke inhalation. pic.twitter.com/YZtm23tvuY — Matt Keller (@MattKellerABC7) April 24, 2018\nA massive fire destroyed a huge apartment complex under construction in Concord. Two people are injured and hundreds of people living next door have been evacuated. The investigation into the cause is under way.A lot of work still needs to be done to stabilize the structure. Because of that, fire investigators and a team from the ATF will have to wait a day or two before going in to begin their search for the cause of this fire.There were two injuries from smoke inhalation. A health advisory for the smoke has been lifted.The fire consumed practically an entire block of Clayton Road and Galindo Street. Little remains of the complex under construction.The flames at the under construction apartment complex in Concord were huge. Firefighters got the call just before 1 a.m. They worked defensively, aiming water from above on to the 260,000 square foot structure.The 3-alarm fire threatened the adjacent Renaissance Square apartments on Concord Boulevard at Galindo Street. About 250 residents were immediately evacuated from the building around 1 a.m.A couple dozen of them ended up at Vinnie's Bar and Grill after an early morning invitation.\"If you all need to get out of the cold and away from this flying debris then come over there and you've got some shelter,\" said Tarric Jones, evacuee.The Red Cross eventually opened up a shelter of its own at the First Presbyterian Church in Downtown Concord offering up food and cots.It took firefighters several hours to get the flames under control but they kept them from spreading to any nearby buildings. The damage is estimated at $55 million.Contra Costa County Fire Marshal Robert Marshall just returned from the International Code Council meeting in Ohio where fires like this one was a big topic.\"A lot of people think it's a problem in the Bay Area because we had the fires in Oakland and San Francisco and now here but really it is a national problem,\" said Marshall.The East Bay has seen similar fires over the past two years; two in Emeryville and one in Oakland. Marshall says changes to building requirements are on the table, including when fire supression and fire walls are put in during construction.\"Kind of look at all those things and figure out where the balance is, providing the highest level of safety but also not requiring too much that makes them so the cost of construction goes way, way up,\" said Marshall.There is no timeline for getting residents back in to the Renaissance Square Apartments next door. The big issue is the scaffolding leaning on the side of the building; firefighters will work on getting that stabilized.",
    "source_domain": "abc7news.com",
    "title": "250 evacuated, 2 injured in 3-alarm Concord fire",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3385224/"
}