{
    "authors": [
        "Lilian Kim"
    ],
    "date_download": "2017-08-15 06:41:26+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 05:03:53",
    "description": "Police say a Los Gatos mother and her 8-year-old son are dead after falling through ice and into a frozen pond in Kansas while on a trip to visit relatives.",
    "filename": "http%3A%2F%2Fabc7news.com%2Frealestate%2Fafter-losing-wife-young-son-in-tragic-accident-los-gatos-man-may-lose-home%2F2309009%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2309072_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A South Bay man who endured a horrific tragedy just months ago is facing a new setback.Gary Classen's wife Polly and son Trent were killed in a tragic accident in March.Now, he may lose the home he shared with his family.\"We've had bonfires out here. We've roasted smores -- it was a place we would dream of retiring,\" Classen told ABC7 News.He moved into his Los Gatos home two years ago, but he may be forced to say goodbye to the house that holds so many precious memories of his late wife and son.The county got wind of a rental unit on the bottom floor -- apparently built without permits decades ago. This means Gary will likely be prohibited from renting it out. This is a loss of income that covers most of his mortgage.\"I would need to sell. I'd have to move out and I'd have to leave the home that my family, my wife, and my son loved and that I love,\" Classen added.Classen, his wife, and his 8-year-old son were playing on a frozen pond when they fell through the thin ice. He says what's helped him cope has been the serenity of his mountain home and the emotional support from his tenants -- who are now busy packing in case they have to move.\"I think we kind of know the pain he's been through the most I mean we're right here and I worry about him being alone,\" said tenant and friend Christina Temple.It's unclear how the county learned about the property. Usually, it's someone from the public who calls it in.If so, Classen says he harbors no resentment.He's waiting to hear from the county about what his options are -- in the mean time, Classen is relying on his faith. \"I know there will be a future and that I'm in good hands. I'll be okay.\"",
    "source_domain": "abc7news.com",
    "title": "After losing wife, young son in tragic accident Los Gatos man may lose home",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/realestate/after-losing-wife-young-son-in-tragic-accident-los-gatos-man-may-lose-home/2309009/"
}