{
    "authors": [
        "Dan Noyes"
    ],
    "date_download": "2017-08-15 02:10:35+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 18:22:56",
    "description": "A Los Gatos couple will spend a long time in state prison after pleading no contest to molesting their adopted son from Russia.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fafter-pleading-no-contest-to-child-sex-abuse-charges-los-gatos-millionaire-denies-all-allegations-in-civil-suit-deposition%2F2307087%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308543_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For the first time ever, we're hearing from convicted child molester Ralph Melvin Flynn.Not long ago the former millionaire marketing executive was living in a Los Gatos mansion with his wife Carolyn, a tech company exec.The couple had a Rolls Royce in their garage and what appeared to be a charmed life.But just two weeks ago the couple pled \"no contest\" to child sex abuse allegations-charges they molested their adopted son. Still, in response to a lawsuit filed by the victim, Ralph Flynn denies abusing the boy.Neither Ralph nor Carolyn Flynn has ever spoken publically about the charges. Now, the ABC7 I-Team has obtained a videotaped deposition you will only see here.I-Team Reporter Dan Noyes broke the story last year revealing details of a damaging confession Ralph Flynn made to Santa Clara County Sheriff deputies.Flynn and his wife Carolyn have since pled no contest and agreed to spend many years in prison. When their guilty pleas are accepted and they are sentenced later this year, they will forfeit any rights to appeal.Flynn denied any wrongdoing for more than 5 hours in the deposition taken for the personal injury lawsuit filed by Denis Flynn, his adopted son.Denis Flynn's Attorney Nina Shapirshteyn asked Ralph Flynn, \"Are you a pedophile?\"Flynn responded, \"Absolutely not.\"\"I think he's a textbook pedophile. He's very manipulative,\" Shapirshteyn told Dan Noyes.She says Ralph Flynn did not answer questions the way a typical parent would.In an incredible coincidence, before the Flynns because of Denis Flynn's parents. They were interviewed by ABC7 17 years ago at an adoption event for couples and Russian children.\"We became very interested in the possibility of adoption,\" Ralph Flynn told us with his wife Carolyn sitting next to him.\"There is just no comparison to what their life is like there compared to the children of Silicon Valley,\" Ralph Flynn bragged to the camera.A short time later, the Flynns adopted an orphaned Denis Flynn-he was 9 years old.Denis Flynn sat down with ABC7 Investigative Reporter Dan Noyes to talk about how he survived years of abuse and why he is suing his adoptive parents.He said the ten years he spent with the Flynns in their Los Gatos home were terrifying.And he says he can't understand why Ralph Flynn would accept that long prison sentence but continue to claim he did nothing wrong.Ralph Flynn pled \"no contest\" to three counts of \"lewd act(s) on a child.\"Carolyn Flynn pled \"no contest\" to two counts of \"rape\" accepting 12-years in prison.Recalling the abuse at the hands of his adoptive parents, Denis Flynn said, \"It got to a point where any time I would see him, my whole body would freeze up and it was always the uncertainty of what's coming next.\"He says fighting the Flynns in civil court is very tough on him-especially when he heard what Ralph Flynn said during a videotaped deposition taken in jail for the civil case.Flynn said, \"I deny doing all of that, any of that.\"Denis Flynn's lawyer asked him, \"So Denis is lying?\"And Flynn responded, \"I don't know if he is lying, but I know that he is not telling the truth.\"Shapirshteyn asked Ralph Flynn, \"Have you showed pornography to Denis?\"He answered, \"Not that I recall.\"She press him asking, \"You might have shown it. You just don't recall?\"And Flynn said, \"I do not recall showing anything. I don't believe I did.\"Shapirshteyn told Dan Noyes she believes Flynn did not answer questions the way a typical parent would.\"First of all, that is not something you would forget that you had done as a parent and second of all, you'd be outraged by a question like that.\"Shapirshteyn says Ralph Flynn professed his innocence for more than 5 hours in the videotaped deposition for the personal injury lawsuit filed by Denis.\"I think he's a textbook pedophile,\" she said, he's very manipulative.\"She says Flynn deflected blame even when confronted with evidence from the criminal case.Shapirsteyn: \"You told that woman investigator that you touched Denis sexually, correct?\"Flynn: \"I don't remember saying that to her.\"Shapirsteyn: \"If Denis says that you watched on multiple times while he had sex with Carolyn--\"Flynn: \"I don't remember. That doesn't make any sense to me. I don't remember that.\"Denis Flynn has watched the deposition video.He told Dan Noyes, \"Just seeing and hearing his deposition it just rattles-- boils my blood.\"Denis says now, more than ever, he looks forward to taking the stand and confronting the Flynns in court. After that-he says he'll be able to move on.\"Now actually, I am looking forward to where can I go from here, how can I apply myself to life and constantly live,\" said Denis Flynn.His lawsuit isn't the only one facing Ralph Flynn.He is also being sued by a second adopted son who says Flynn and his first wife sexually abused him.In both lawsuits, Flynn and his two wives have filed court papers denying any abuse.On the criminal side-Ralph and Carolyn Flynn will be in court again to be sentenced in November.",
    "source_domain": "abc7news.com",
    "title": "After pleading no contest to child sex abuse charges, Los Gatos millionaire denies all allegations in civil suit deposition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/after-pleading-no-contest-to-child-sex-abuse-charges-los-gatos-millionaire-denies-all-allegations-in-civil-suit-deposition/2307087/"
}