{
    "authors": [],
    "date_download": "2018-07-04 16:07:31+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 14:09:50",
    "description": "The County Fire burning near Lake Berryessa has grown to 82,700 acres and is now threatening over 1,000 structures. So far, the fire is 25 percent contained.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ffire-burning-near-lake-berryessa-scorches-over-80000-acres%2F3703755%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3703917_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "#CountyFire [update] east of Lake Berryessa (Yolo and Napa Counties) is now 82,700 acres and 25% contained. Evacuations in effect. https://t.co/z2FpwZ89SK pic.twitter.com/uSaipjp6g2 — CAL FIRE (@CAL_FIRE) July 4, 2018\n#CountyFire [update] Due to the potential threat posed by the County Fire, the Napa County Sheriff’s Office has issued an Evacuation Advisory for the Berryessa Highlands, Markley Cove, and Pleasure Cove Resorts. pic.twitter.com/4zwz6xFpQb — CAL FIRE (@CAL_FIRE) July 3, 2018\nThe County Fire burning near Lake Berryessa has grown to 82,700 acres and is now threatening over 1,000 structures. So far, the fire is 25 percent contained.Over 1,000 firefighters are still battling the blaze that nearly doubled in size on Monday.The massive blaze was choking skies with ash and smoke, prompting some officials to cancel Fourth of July fireworks shows and urge people to stay indoors to protect themselves from the unhealthy air.At least 2,500 people have been told to evacuate as the so-called County Fire continues to spread, said Anthony Brown, a spokesman with the California Department of Forestry and Fire Protection.Brown said the blaze started Saturday and is surging through rugged terrain northwest of Sacramento amid hot and dry weather. \"The weather is better than what we had last weekend. But it's still hampering our efforts and it's an area of concern,\" he said.So far this year, wildfires have burned 4,200 square miles in the United States, according to the fire center. That's a bit below last year's acreage to date - which included the beginning of California's devastating fire season - but above the 10-year average of 3,600 square miles.Because of the Independence Day holiday, authorities are also concerned about the possibility of campfires or fireworks starting new fires because of the dry, hot conditions.Cal Fire officials say their goal is to have full containment of this fire by next Tuesday, July 10, 2018.Residences served by Highway 128, between Monticello Dam and Pleasant Valley Road.West of State Highway 16, to Berryessa Knoxville Road, South of Old County Road 40, and North of County Road 53North of Highway 128South of County Road 23East of Berryessa Knoxville RoadWest of County Road 89, South of the community of Esparto, however agricultural equipment will be permittedNorth of Quail Canyon RoadSouth of Highway 128East of the Blue Ridge mountainsWest of Pleasant Valley RoadEast of Capell Valley RoadNorth of State Highway 128 from Capell Valley Road, East to the Napa County lineNorth of State Highway 128 in Yolo County, not including the City of WintersSouth of County Road 23East of Berryessa Knoxville RodWest of County Road 89, South of the community of Esparto, however agricultural equipment will be permittedFor questions regarding Yolo County evacuations or advisories, please dial 2-1-1 For questions regarding Solano County evacuations or advisories please dial (707) 398-8261Evacuation center: Guinda Grange Hall in the Community of Guinda 16487 Forest Ave. Guinda, CA 95637Northbound County Road 87 from Highway 128, Berryessa Knoxville Road, from the Pope Creek Bridge to the Napa/Lake County line, Eastbound Highway 128 at Markley Resort, Westbound Highway 128 at Pleasant Valley Road, Pleasant Valley Road, South from Highway 128 remains open to serve traffic into Solano CountyCalifornia Department of Corrections and Rehabilitation, Cal OES, California Highway Patrol, California Conservation Corps, Yolo County OES, Yolo County Sheriff, Solano County Sheriff, Napa County Sheriff, PG&E, Bureau of Indian Affairs, Yocha Dehe Wintun Nation, Bureau of Land Management, United States Forest Service, and California National Guard.The fire sent smoke across the Bay Area , as far west as Petaluma and as far south as San Francisco and Redwood City, according to the National Weather Service in San Francisco.The Associated Press contributed to this story.",
    "source_domain": "abc7news.com",
    "title": "Fire burning near Lake Berryessa scorches over 80,000 acres",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/fire-burning-near-lake-berryessa-scorches-over-80000-acres/3703755/"
}