{
    "authors": [],
    "date_download": "2017-08-14 17:06:20+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 16:32:16",
    "description": "President Trump condemned hate groups, including white supremacists, two days after a car drove into a crowd of people in the midst of violent clashes over a white nationalist rally in Charlottesville, Virginia.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftrump-condemns-repugnant-hate-groups-including-kkk-neo-nazis%2F2306757%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2251517_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump condemned hate groups including white supremacists in remarks from the White House Monday, two days after a car drove into a crowd of people in the midst of violent clashes over a white nationalist rally in Charlottesville, Virginia.\"Racism is evil,\" said Trump. \"And those who cause violence in its name are criminals and thugs, including the (Ku Klux Klan), neo-Nazis, white supremacists and other hate groups that are repugnant to everything we hold dear as Americans.\"Trump received bipartisan criticism over the weekend for his immediate response to the violence in Charlottesville, which did not label the incident as an act of terrorism, nor include a denunciation of white supremacy. During remarks addressing the rally and subsequent clashes from his golf club in New Jersey, the president condemned the \"egregious display of hatred, bigotry and violence on many sides.\"A White House official later elaborated on Trump's comments, indicating that the president was opposed to the \"hatred, bigotry and violence from all sources and all sides\" and noting that \"there was violence between protesters and counter-protesters.\"On Monday morning, Attorney General Jeff Sessions defended Trump's response, telling ABC News that \"he explicitly condemned the kind of ideology behind these movements of Naziism, white supremacy, the (Ku Klux Klan).\"\"That is his unequivocal position,\" said Sessions.The attorney general further said Monday that the attack met \"the definition of domestic terrorism.\" On Saturday night, Sessions announced that the Department of Justice was opening a federal investigation into the incident.for more stories, photos, and video on President Donald Trump.",
    "source_domain": "abc7news.com",
    "title": "Trump condemns 'repugnant' hate groups, including KKK, neo-Nazis",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/trump-condemns-repugnant-hate-groups-including-kkk-neo-nazis/2306757/"
}