{
    "authors": [
        "Lyanne Melendez"
    ],
    "date_download": "2017-08-15 03:41:27+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 02:41:35",
    "description": "San Francisco has joined forces with the State of California in a lawsuit against the Trump administration where millions of dollars are at stake.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Fca-sf-sue-doj-over-sanctuary-city-grants-worth-millions%2F2308672%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308722_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "San Francisco has joined forces with the State of California in a lawsuit against the Trump administration where millions of dollars are at stake. The federal government says the city and the state must comply with a new set of conditions when it comes to immigration or risk losing millions in law enforcement grants.It's the first time a state and a city have come together against the trump administration to stop the latest attack on their sanctuary statuses.\"We're intent on stopping anyone who will try to deny us the dollars that we have earned, the dollars that we have paid for to provide the resource to the men and women who wear the badge,\" said California Attorney General Xavier Becerra.\"Our police and deputies are focused on fighting crime not breaking up hard working families,\" explained San Francisco City Attorney Dennis Herrera.Chicago filed a similar suit last week, arguing that the Trump administration's bid to withhold public safety grants from so-called sanctuary cities is illegal.Attorney General Jeff Sessions has said the Trump administration \"will not simply give away grant dollars to city governments that proudly violate the rule of law and protect criminal aliens.\"",
    "source_domain": "abc7news.com",
    "title": "California, San Francisco sue DOJ over sanctuary city grants",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/ca-sf-sue-doj-over-sanctuary-city-grants-worth-millions/2308672/"
}