{
    "authors": [
        "Wayne Freedman"
    ],
    "date_download": "2018-03-20 03:57:24+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 22:35:00",
    "description": "This last day of winter looks more like the first of spring in Yountville, Napa County. Despite blue skies, green grass, bud breaking grapes, and bright yellow blooming mustard grass, it has the feeling of a wake.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235529%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3235594_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This last day of winter looks more like the first of spring in Yountville, Napa County. Despite blue skies, green grass, bud breaking grapes, and bright yellow blooming mustard grass, it has the feeling of a wake.Instead, they will be calling it a 'Celebration of Life\" inside the Lincoln Theater at the Veterans Home of California. A memorial begins at 6pm tonight for Dr. Jennifer Golick, Dr. Jennifer Gonzales Sushereba, and Christine Lober.All three worked with PTSD veterans at Pathway Home on campus. They died March 9th when Army Veteran and former patient Albert Wong entered the facility, shot them, and then turned the weapon on himself.\"We've been in a fog ever since,\" said Jim Looney, an army veteran who lives in a building fifty yards away from where the shootings took place. He and his fellow residents spent all of March 9th watching through a window. Looney knew the victims by sight, not name, but describes the loss as being profound. \"We're still numb. It's hard to believe, even now. This is our home, after all.\"Tonight's memorial will be open to the public. The auditorium holds 12-hundred people. Organizers expect an overflow crowd. They have set up secondary viewing locations that include the Yountville Community Center.Larry Kamer's wife was inside Pathway Home. She was fortunate because Wong allowed her to leave. Today, Kamer helped organize the memorial. \"Hopefully people will walk away with a sense of what special women these three were. I hope they will have a special appreciation for mental health, and those who work with vets.\"",
    "source_domain": "abc7news.com",
    "title": "Yountville community prepares for memorial",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235529/"
}