{
    "authors": [],
    "date_download": "2018-03-20 04:00:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 20:03:33",
    "description": "Thinking about moving downtown? Take a look at the apartments that are on the market today.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235018%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3235017_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "1390 Saddle Rack St.\n20 S 2nd St., #238\n411 Park Ave., #327\nCurious just how far your dollar goes in Downtown?We've rounded up the latest rental offerings via rental site Zumper to get a sense of what to expect when it comes to locating an apartment in this San Jose neighborhood if you're on a budget of $2,400 / month. (Note: prices and availability are subject to change.)Read on for the listings.Listed at $2,395 / month, this 917-square-foot 1-bedroom, 1-bathroom apartment is located at 1390 Saddle Rack St.In the unit, you can expect both air conditioning and central heating, a dishwasher, in-unit laundry, a walk-in closet and a balcony. The building offers garage parking, a swimming pool and a fitness center. One small dog is allowed in the unit.(Check out the complete listing here .)Next, there's this 1-bedroom, 1-bathroom single-family home situated at 20 S 2nd St. It's also listed for $2,395 / month for its 887-square-feet of space.When it comes to building amenities, anticipate garage parking, a business center, outdoor space and a fitness center. In the unit, there are high ceilings, a dishwasher, hardwood floors, in-unit laundry, a balcony and stainless steel appliances. Cats and dogs aren't welcome.(Take a gander at the complete listing here .)Here's a 1-bedroom, 1-bathroom apartment at 411 Park Ave. that's going for $2,395 / month.In the unit, you'll get carpeting, a dishwasher, central heating, a balcony and ample cabinet space. When it comes to building amenities, anticipate on-site laundry, garage parking, a fitness center, an elevator and secured entry. Both cats and dogs are welcome.(Check out the complete listing here .)---",
    "source_domain": "abc7news.com",
    "title": "What Does $2,400 Rent You In Downtown, Today?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235018/"
}