{
    "authors": [
        "M.L. Nestel"
    ],
    "date_download": "2018-04-24 17:07:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 15:43:02",
    "description": "Cruz is accused of killing 17 people on Feb. 14.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fstoneman-douglas-shooting-suspect-found-to-be-indigent-officials-say%2F3386388%2F.json",
    "image_url": "http://cdn.abclocal.go.com/assets/news/kgo/images/logos/default_800x450.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Judge Elizabeth Scherer has determined that Florida shooting suspect Nikolas Cruz is indigent and the 19-year-old will keep his public defender, the State Attorney's Office told ABC News today.A total of 17 students and teachers of Marjory Stoneman Douglas High School in Parkland, Florida, were shot deadafter Cruz, armed with an AR-15-style rifle, allegedly unleashed his attack on Feb. 14.Cruz has been charged with 17 counts of premeditated murder and is being held at the Broward County Jail without bond. He has pleaded not guilty but his lawyers said he would change his plea to guilty in exchange for life in prison without the possibility of parole.Scherer came to a decision in her chambers and did not make a formal ruling in the courtroom.A status hearing in Cruz's case is slated for Friday, but it's unclear if Cruz will appear.Cruz's lawyers have said previously that he wished to donate any inheritance due to him from his late mother's estate to the victims' families or an organization that will help the community heal.Cruz stands to collect up to $800,000 from his late mother's estate and various other financial accounts in his name.His mother, Lynda Cruz, died Nov. 1, 2017, after contracting the flu, leaving an Allstate Life Insurance policy to Cruz, according to one of his lawyers.The decision to funnel his fortune to the victims or charities came as more information surfaced that Cruz was set to inherit a windfall.\"Just so the court is aware, Mr. Cruz does not want those funds,\" his attorney, Melissa McNeill of the public defender's office, told Scherer during an April 11 hearing. \"He would like that money donated to an organization that the victims' families believe would be able to facilitate the healing in our community.\"There are already numerous lawsuits that are attempting to recover some of Cruz's inheritance. =One lawsuit was filed by one of Cruz's alleged victims, Anthony Borges, in March.The 15-year-old was shot in the gut and the legs while attempting to shield other students from the bullets.Borges' attorney alerted Broward County officials that a grievance against the school district for alleged lapses in preventing the school shooting and protecting the students from harm would be filed.\"The failure of Broward County Public Schools, and of the principal and school resource officer to adequately protect students, and in particular our client, from life-threatening harm, were unreasonable, callous and negligent,\" lawyer Alex Arreaza wrote in a letter.A Broward County Public Schools spokeswoman at the time refused to comment citing \"potential, pending, or open litigation.\"",
    "source_domain": "abc7news.com",
    "title": "Stoneman Douglas shooting suspect found to be indigent, officials say",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/stoneman-douglas-shooting-suspect-found-to-be-indigent-officials-say/3386388/"
}