{
    "authors": [
        "Tiffany Wilson"
    ],
    "date_download": "2017-10-06 13:50:55+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 13:17:40",
    "description": "Festivities will be in full force today for San Francisco Fleet Week, with the Parade of Ships sailing under the Golden Gate Bridge and the Blue Angels roaring and soaring in the skies above.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fentertainment%2Fsan-francisco-fleet-week-to-kick-off-today%2F2498722%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1544443_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos Every year, Fleet Week comes to San Francisco. It's a celebration of naval tradition that honors the men and women serving in our armed forces.\nFestivities will be in full force today for San Francisco Fleet Week, with the Parade of Ships sailing under the Golden Gate Bridge and the Blue Angels roaring and soaring in the skies above.The annual parade of ships kicks off at 11 a.m. when the first ship sails under the Golden Gate Bridge and along the waterfront. The parade will last about an hour. Then the air show will begin with the headliners -- the Blue Angels roaring and soaring in the skies above. They'll take off from the Oakland Airport then defy gravity and perform heart stopping precision maneuvers.This year, three of the six pilots are from the Bay Area, including Fremont native, Navy Lieutenant Damon Cruz.\"To do it as part of this incredible team, to inspire the next generation, I'm taking some great pride in that,\" said Cruz.Police anticipate big crowds this weekend and they're stepping up deployment. There are no known threats to the city or Fleet Week, but they're reminding everyone: if you see something say something.If you can't watch the air show in person today --- we've got you covered. We'll be live streaming the show from noon until four on our website and app.",
    "source_domain": "abc7news.com",
    "title": "San Francisco Fleet Week to kick off today",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/entertainment/san-francisco-fleet-week-to-kick-off-today/2498722/"
}