{
    "authors": [
        "Katie Utehs"
    ],
    "date_download": "2017-08-15 05:11:25+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 04:21:33",
    "description": "An East Bay community is putting out a warning to drivers Monday night as dozens of tires have been destroyed by nails in Concord.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fconcord-neighbors-concerned-about-nail-thrower%2F2308918%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308943_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An East Bay community is putting out a warning to drivers Monday night as dozens of tires have been destroyed by nails in Concord.Neighbors along San Miguel road say they believe someone is dropping them on purpose.A water bottle holds nails collected by the manager of Concord's Towne and Country mobile home park.Residents will attest to the proliferation of tire popping objects in the area of San Miguel Road.\"They've been roofing nails. They've been screws. They've been regular nails. They've been thumbtacks,\" said Concord resident Darren Valtr. \"Just a whole lot of anything that will make you tires pop.\"Valtr says the problem started a couple of years ago.He's spent $480 to repair tires.\"They've filed police reports. They've tried putting cameras up and we just can't figure out who is doing it,\" said Valtr.Someone posted a warning on the local blog Claycord.com saying the nail thrower is back The park's manager confirms three recent flat tire complaints. He documented around 50 incidents in 2015.\"Yeah I got a couple flats right here and up the hill there a bit,\" said Concord resident Nina Wolfgramm.She says her tires were gouged last year but she didn't report it. Later, she learned someone who lives nearby may be responsible.\"The person probably thinks it's funny at least that's what I heard,\" Wolfgramm added. \"But it's not. It's going into other people's money, other people's wallets. it's not coming out of their pocket.\"Police say they haven't received any recent complaints about nails in the roadway.",
    "source_domain": "abc7news.com",
    "title": "Concord neighbors concerned about 'nail thrower' causing punctured tires",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/concord-neighbors-concerned-about-nail-thrower/2308918/"
}