{
    "authors": [
        "Sydney Brandt"
    ],
    "date_download": "2018-07-04 16:07:35+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 14:56:25",
    "description": "Fireworks and sparkle can reach temperatures of nearly 2,000 and 1,200 degrees, respectively. To put that into perspective, water's boiling point is only 212 degrees.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fhalf-of-july-4-fires-caused-by-fireworks-trade-group%2F3704004%2F.json",
    "image_url": "https://s.abcnews.com/images/Politics/national-mall-fireworks-gty-hb-180627_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "At 5 years old, Joseph Livingston faced a brutal third-degree burn. The cause: consumer fireworks.He was celebrating Labor Day in Columbia, Md., with his neighbors back in 2016.One of the neighbors was playing with fireworks when a sparkler went off, striking Joseph. He suffered first-, second- and third-degree burns on his legs.Now, at 7 years old, Joseph is still receiving treatments at Johns Hopkins' Pediatric Trauma and Burn Unit after suffering the consequences of consumer firework dangers.The National Fire Protection Association, a trade organization that advocates for fire safety, found that 12,900 people were treated at U.S. hospital emergency rooms for firework-related injuries last year. Children under the age of 15 accounted for more than a third of those injuries.Fireworks can reach temperatures nearly 2,000 degrees and sparklers can reach 1,200, according to the organization.To put that into perspective, water's boiling point is 212 degrees.More fires are reported on July 4 than any other day of the year and 50 percent of those are caused by fireworks, the organization found.It urges people to not use consumer fireworks.",
    "source_domain": "abc7news.com",
    "title": "Half of July 4 fires caused by fireworks: Trade group",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/half-of-july-4-fires-caused-by-fireworks-trade-group/3704004/"
}