{
    "authors": [],
    "date_download": "2018-07-04 19:32:40+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 18:07:42",
    "description": "Weather conditions like humidity and wind can impact how fireworks displays look on the Fourth of July and other holidays, according to AccuWeather.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fscience%2Fhow-weather-impacts-fireworks-shows%2F3704898%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/3704941_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's not the Fourth of July without fireworks, but did you know that weather can impact the dazzling display of light in the sky?Clear skies, light winds and low humidity create the optimal conditions for a fireworks show, according to AccuWeather . As humidity increases, the color from the fireworks could appear less vibrant.Wind speed is also closely monitored; if there's too little wind, the smoke from the fireworks might not dissipate quickly enough and could obstruct the view from the ground. If there's too much wind, smoke and hot embers could move into areas full of spectators.Drought conditions can also cause problems for fireworks shows. The fallout from fireworks could be enough to start a fire in a matter of seconds. In some desert areas, drone shows are replacing fireworks -- in addition to being safer in drier areas, the drone shows are more inclusive for those with sensitives to the sound of firework explosions Rain, though, poses little risk to fireworks as long as the fireworks are kept in waterproof bags. Downpours and thunderstorms can cause a fireworks show to be canceled or delayed, especially if there's lightning.",
    "source_domain": "abc7news.com",
    "title": "Fourth of July: How different weather conditions impact fireworks shows",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/science/how-weather-impacts-fireworks-shows/3704898/"
}