{
    "authors": [
        "Janine De La Vega"
    ],
    "date_download": "2017-08-15 00:39:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 23:45:52",
    "description": "A Bay Area woman who witnessed some of the violence that erupted Saturday in Charlottesville is speaking out about her experience.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fbay-area-woman-describes-violence-at-virginia-rally%2F2308110%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308095_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Bay Area woman who witnessed some of the violence that erupted Saturday in Charlottesville is speaking out about her experience.\"It was honestly a hard decision to be there,\" San Jose resident Kristin Savini said.Savini is still in disbelief over what she witnessed this weekend in Charlottesville, Virginia. She was visiting her daughter at medical school at the University of Virginia and knew about the protests, but was shocked when she came face to face with what she called hatred.It was difficult for Savini to distinguish white nationalists who came to rally from militia men who were heavily armed.Savini says the counter protesters outnumbered the white nationalists, but it was still scary to see the racist and anti-Semitic messages. \"That was really disturbing, so surreal to see people actually burning torches,\" she said.At one point, she saw a car accelerate and head into a group of counter protesters.\"All of a sudden they just hit the gas and tore out into the group of people and they did hit one of the counter protestors that was close. He fell and popped right back up,\" Savini said.Fortunately, the one man who fell was not hurt. That incident happened a block away from the other car that rammed into protestors on Saturday, killing one woman and injuring more than a dozen others.Sivini says she returns home grateful that for the most part the Bay Area is a place where diversity and acceptance are celebrated.",
    "source_domain": "abc7news.com",
    "title": "Bay Area woman visiting daughter in Virginia describes violence that erupted at Virginia white nationalist rally",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/bay-area-woman-describes-violence-at-virginia-rally/2308110/"
}