{
    "authors": [
        "Jonah Kaplan"
    ],
    "date_download": "2017-08-15 02:10:26+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 01:21:32",
    "description": "Protesters in Durham, North Carolina toppled a Confederate statue outside the courthouse on Monday evening.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fpolitics%2Fnc-protesters-topple-confederate-statue-outside-courthouse%2F2308447%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2308457_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "MORE: Protestors rip down statue of Confederate soldier. Monument has stood since in @DurhamCounty since 1924. @ABC11_WTVD pic.twitter.com/4MjFXsxS18 — Jonah Kaplan (@KaplanABC11) August 14, 2017\nProtestors now moving down Main Street en route to @DurhamPoliceNC headquarters. Currently blocking traffic on Roxboro St. @ABC11_WTVD pic.twitter.com/EsTkRX1WNo — Jonah Kaplan (@KaplanABC11) August 14, 2017\nEMBED >More News Videos Durham protest started off small but vocal and grew as the evening went on.\nProtesters in Durham, North Carolina toppled a Confederate statue outside the courthouse on Monday evening.The monument of a Confederate soldier holding a rifle was erected in 1924. The statue's inscription read: \"In memory of the boys who wore the gray.\"The crowd was small in numbers, but steadily grew to more than 100.As the crowd became more animated, several protesters approached the monument and threw some sort of nylon rope around it, eventually pulling the statue of the soldier to the ground.After the statue fell, many of the protesters kicked and stomped it.Protesters then moved and blocked an intersection.The protesters later marched to the site of the new Durham Police headquarters, which is under construction.Durham Police remained close by, but kept their distance from the protesters.",
    "source_domain": "abc7news.com",
    "title": "Durham, North Carolina protesters topple Confederate statue outside courthouse",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/politics/nc-protesters-topple-confederate-statue-outside-courthouse/2308447/"
}