{
    "authors": [
        "Amy Powell"
    ],
    "date_download": "2017-01-02 14:41:27+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 14:17:33",
    "description": "A female Lyft driver was violently attacked by a man over a parking spot in Santa Ana and the onslaught was captured on camera.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fvideo-female-lyft-driver-violently-attacked-over-parking-spot%2F1682387%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kabc/images/cms/1682164_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A female Lyft driver was violently attacked over a parking spot in Santa Ana and the onslaught was captured on camera.The confrontation happened at the Arco gas station near the intersection of Main Street and MacArthur Boulevard at about 11 a.m. on Friday.Santa Ana police said the incident started over an argument about a parking space.According to the victim, who Eyewitness News has only identified as Terri, she was confronted by a man who complained about how she parked at the gas station.\"I accidentally parked a little crooked and I didn't realize it at the time that I was parked so crooked and this man came up to the front of my car, to the front hood and started yelling,\" Terri recalled.Terri, who was driving for Lyft at the time and had a passenger with her, said she apologized and moved her car. But she said the man continued to yelling and her passenger went into the gas station to get help.That's when Terri said she started recording video on her cellphone.In the video, the suspect was seen reversing a red two-door Honda into the parking space next to the woman.\"This guy is really starting problems,\" Terri could be heard saying in the recording.\"You want to tape me,\" the suspect is heard stating as he aggressively walked toward Terri. \"Are you videoing me?\"In the video, the man can be seen punching Terri and throwing her to the ground as she pleads for the suspect to stop.Terri said she was punched several times and that the suspect even knocked out one of her teeth.She said she had no idea why the man became so violent and attacked her.\"I've never even seen this guy before,\" Terri said. \"It was really scary.\"Detectives stated they were investigating the attack and were looking into surveillance video from the gas station.",
    "source_domain": "abc7news.com",
    "title": "VIDEO: Female Lyft driver violently attacked over parking spot in Santa Ana",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/video-female-lyft-driver-violently-attacked-over-parking-spot/1682387/"
}