{
    "authors": [
        "Kristen Sze"
    ],
    "date_download": "2017-02-15 01:16:07+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 23:59:56",
    "description": "It was a year ago when the Bay Area fell in love with a baby horse that had to be rescued from the bottom of an East Bay ravine. There's now new video of Valentine, the colt that stole our hearts.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fcolt-thriving-one-year-after-being-rescued-from-east-bay-ravine%2F1754984%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1755028_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Happy 1 yr birthday!! Remember #Valentine, the colt @FremontFire rescued from ravine when he was days old? New VIDEO shows he's so big now! pic.twitter.com/PI5momcvx9 — Kristen Sze (@abc7kristensze) February 14, 2017\nIt was a year ago when the Bay Area fell in love with a baby horse that had to be rescued from the bottom of an East Bay ravine . There's now new video of Valentine, the colt that stole our hearts.Valentine, only days old at the time, was stranded in a ravine, alone an injured.Fremont firefighters rescued him and named him Valentine, since he was found on Valentine's Day.It was touch and go for a while, with a broken pelvis one misstep could have killed the colt.But now Valentine appears graceful and strong in new video posted by Cindy Bailey, the breeder who adopted him.They live in Orland, 100 miles north of Sacramento.Bailey said Valentine won't be used for breeding. Instead, he'll be trained as a trail horse.Despite his early injuries, Valentine doesn't even have a limo, just a gait that's the tiniest bit off.This is great news for his many fans, who went as far as launching a petition drive for the city of Fremont to change its mascot to Valentine.That did not happen, but Valentine did make a remarkable recovery compared to a year ago, when he was barely able to move.It's a big difference!",
    "source_domain": "abc7news.com",
    "title": "Colt thriving one year after being rescued from East Bay ravine",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/colt-thriving-one-year-after-being-rescued-from-east-bay-ravine/1754984/"
}