{
    "authors": [
        "Leslie Brinkley"
    ],
    "date_download": "2017-10-07 01:57:04+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 22:23:15",
    "description": "Doctors in the East Bay say they are seeing the effects that fear is having on the health of their immigrant patients. They say sometimes those patients are even scared to go to the doctor.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fhealth%2Fbay-area-physicians-say-immigrant-families-fearful-of-trips-to-the-doctor%2F2500997%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2501229_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Immigrant families are scared to seek health care say local doctors-- afraid of being \"on the record\" #abc7news pic.twitter.com/7Qug0cw48r — Leslie Brinkley (@lrbrinkley) October 6, 2017\nDoctors in the East Bay say they are seeing the effects that fear is having on the health of their immigrant patients. They say sometimes those patients are even scared to go to the doctor.Dr. Jyothi Marbin is the Director of Pediatric Research for the underserved residency program at UCSF and she says she has seen people un-enrolling from programs like food stamps and she has even seen families afraid to come into clinics or the doctor's office.Marbin says it's because of concerns that they might be put on the record in some way and they might be putting themselves or their families at risk of deportation.Marbin decided to organize an immigrant healthcare symposium tomorrow in Oakland, bringing together over 200 providers, clinicians, and politicians.Pediatrician Dr. Noemi Spinazzi is on the front lines seeing kids with stomachaches and headaches as she says they succumb to stress over fears of the family members deportation. Or they don't go to the doctor if they are sick.Spinazzi says she also sees families who are afraid to report domestic violence for fear of repercussions from the government.Starting a dialogue on all of this is a way for Dr. Marbin to start creating a supportive environment she says, so immigrants can feel like they can see a doctor without fear despite their immigration status.",
    "source_domain": "abc7news.com",
    "title": "Bay Area physicians say immigrant families fearful of trips to the doctor's office",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/health/bay-area-physicians-say-immigrant-families-fearful-of-trips-to-the-doctor/2500997/"
}