{
    "authors": [
        "Cornell Barnard"
    ],
    "date_download": "2017-02-15 08:49:12+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 06:44:12",
    "description": "ABC7 News has learned the Coast Guard will be issuing a warning Wednesday to anyone on or near the San Francisco Bay. So much debris from recent storms is still making its way into the bay creating big hazards.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fcoast-guard-to-issue-debris-warning-for-san-francisco-bay%2F1755471%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755495_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Incoming Debris! The Bay is loaded w/ garbage & plants from winter storms floating from Delta. pic.twitter.com/6kf1vIiByK — Cbarnard (@CornellBarnard) February 15, 2017\nABC7 News has learned the Coast Guard will be issuing a warning Wednesday to anyone on or near the San Francisco Bay--beware of debris.So much debris from recent storms is still making its way into the bay creating big hazards.A giant floating blob of debris washed up on the water at Pier 27 in San Francisco. It's all over the Berkeley Marina too. There are reeds at every boat launch.It looked like a big mess Tuesday morning.The Coast Guard says debris is floating down through the San Pablo Bay from the Sacramento Delta after big storms and high water. It looks like an endless train of garbage from the Richmond-San Rafael bridge.It's also choking a boat launch on Mare Island.The navigational buoy near Antioch looks more like an island surrounded by plant matter.\"Very unusual,\" said Cat Schaaf, a Berkeley boat owner who has been navigating her sailboat around hazards in the water. \"Logs in the water, even pieces of wood from a dwelling maybe.\"Recently, a Bay Ferry had its propeller damaged when it struck a submerged log.\"Be on the lookout,\" said Lt. Megan Merear of the U.S. Coast Guard. \"Know that when you go out. These hazards exist.\"The Coast Guard hopes boaters will let them know when they spot floating hazards on the bay.",
    "source_domain": "abc7news.com",
    "title": "Coast Guard to issue debris warning for San Francisco Bay",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/coast-guard-to-issue-debris-warning-for-san-francisco-bay/1755471/"
}