{
    "authors": [
        "Jonathan Bloom"
    ],
    "date_download": "2018-04-25 04:23:17+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 01:55:39",
    "description": "It was supposed to be almost done by now, but the sprawling construction project along San Francisco's Van Ness corridor just hit another 5-month delay.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3388355%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3388453_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It was supposed to be almost done by now, but the sprawling construction project along San Francisco's Van Ness corridor just hit another 5-month delay.\"Van Ness is a very old street,\" explained San Francisco transportation director Ed Reiskin. \"Unfortunately, we're finding a lot of things we didn't know were there. And when we do find things, we have to stop.\"In this case, Reiskin said workers uncovered utility lines. No one knows who they belong to, or if they're still being used.\"We don't know if it's safe to remove them, we don't know if there's live gas or live electric,\" Reiskin said.It means workers have to dig around the utility lines by hand -- which takes more time. And that doesn't sit well with merchants who've already suffered a loss of customers.\"As soon as they closed down the streets on Van Ness, our business dropped,\" said Eddie Martin, general manager of lunchtime staple Tommy's Joynt. \"The biggest complaint people said is they can't park here. They love Tommy's Joynt, they want to come, they want to come more often, but they don't do it anymore.\"Patience is even running thin in a spot you wouldn't expect: another construction site. It turns out all the digging has been a major headache for the crew working to build a new hospital at Van Ness and Geary.'We get a delivery, we can't accept or get our deliveries,\" said sheet metal worker David Ysaguirre.He's hardly thrilled the city now says the work will continue until the fall of 2020.Reiskin said the city is working with businesses to soften the impact.\"It'll be a much more pleasant and safer environment for everybody, and people who are on transit will get up and down the corridor much, much faster,\" when the project is complete, Reiskin said.In short, the city promises the new Van Ness will be worth the wait.",
    "source_domain": "abc7news.com",
    "title": "Mess on Van Ness hits another construction delay in SF",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3388355/"
}