{
    "authors": [
        "Meghan Keneally"
    ],
    "date_download": "2018-07-04 21:15:06+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 19:51:40",
    "description": "The parade is less than a week after five Gazette staffers were shot and killed.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fcapital-gazette-staffers-to-march-in-annapolis-independence-day-parade%2F3705335%2F.json",
    "image_url": "http://a.abcnews.com/images/US/memorial-capital-gazette-ap-jpo-180703_hpMain_2_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Surviving members of the Capital Gazette's staff will participate in a Fourth of July parade in Annapolis, six days after a gunman killed five of the newspaper's employees during a rampage in the newsroom.The decision to participate in this year's parade rather than simply cover it like the paper normally does was announced in an opinion piece published Wednesday.\"You'll recognize us from our vaguely lost expressions. We don't think we have a banner or T-shirts, although we're looking around. We might have a few hats. It will be unusual for us to walk together in the same rough direction if we're being totally honest here,\" the article stated.\"The news staff of The Capital feels out of place being part of the event rather than on the sidelines taking notes or producing video,\" the article added.The article goes on to say that the surviving staff members are a symbol for the community, even though \"we're hurting.\"\"We'll be on West Street and Main Street because we want our readers and our community to see that we believe things will, eventually, be OK again. Eventually,\" the article states.This isn't the first appeal the staff has made to the public. They wrote a letter on Sunday, three days after the attack, thanking people for the \"outpouring of sympathy\" they received.In that letter, the paper's staff wrote that they will \"never forget\" their five slain colleagues: Rob Hiaasen, Gerald Fischman, Wendi Winters, John McNamara and Rebecca Smith.They also noted that there were some more sinister messages following the attack that they will not be forgetting, either.\"Here's what else we won't forget: Death threats and emails from people we don't know celebrating our loss, or the people who called for one of our reporters to get fired because she got angry and cursed on national television after witnessing her friends getting shot,\" the letter reads.The letter also said they \"won't forget being called an enemy of the people,\" which was an apparent dig at President Donald Trump, who has used that phrase in statements directed at the media.Trump ordered federal flags lowered to half staff on Tuesday July 3 to honor the victims of the shooting.",
    "source_domain": "abc7news.com",
    "title": "Capital Gazette staffers to march in Annapolis Independence Day parade",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/capital-gazette-staffers-to-march-in-annapolis-independence-day-parade/3705335/"
}