{
    "authors": [
        "Carolyn Tyler"
    ],
    "date_download": "2018-03-20 03:56:57+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 20:36:12",
    "description": "Berkeley and West Hollywood already have laws and now San Francisco is poised to become the first major American city to ban the sale of fur.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235125%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3235092_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Berkeley and West Hollywood already have laws, now San Francisco is poised to become the first major American city to ban the sale of fur. Supervisors will vote tomorrow despite criticism from retailers who say it will cost them millions in lost revenue each year.It's estimated somewhere between 30 and 50 retailers in San Francisco sell fur. The big ones in Union Square include Macy's, Neiman Marcus and Saks Fifth Avenue.For decades they've been the target of demonstrations by animal rights activists but soon there may be nothing left to protest. Fur sales in stores and online will be banned under a measure sponsored by city Supervisor Katy Tang.Tang is a long time animal rights advocate, who doesn't eat meat. She says, \"I believe its necessary to pass this legislation because around the world there are 50 million, maybe even upwards of 100 million animals slaughtered each year solely for the purpose of providing us fur.\"The City estimates the ban will cost retailers about $10,000,000 a year in lost sales. Retailers peg it much higher at 45 million annually and say outlawing fur will also tarnish the brand of Union Square as an international shopping destination. Karin Flood is head of the Union Square Business Improvement District.She believes customers will simply go elsewhere to shop, like Las Vegas or Los Angeles. Flood says, \"this is certainly an ethical issue and San Francisco has values, but the question is should these values be imposed on individuals and their right to choose what they do and how they shop.\"Anti-fur activists recently rallied on the steps of city hall. Matthew Dempsky was one of the protestors with a group called Direct Action Everywhere. He's hoping San Francisco will set a trend by passing the legislation.Dempsky says. \" pretty soon it'll go nationwide and people will then really have to go out of their way if they want to continue buying fur.\"Flood represents 30 stores in Union Square that sell fur and says her clients worry what other regulations could be down the line. \"We wonder what's next...will it be leather. Will it be cashmere.\"If the law passes, it would take effect January 2019. There are rumblings retailers may sue.",
    "source_domain": "abc7news.com",
    "title": "San Francisco poised to become first major U.S. city to ban sale of furs in stores and online",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235125/"
}