{
    "authors": [
        "Vic Lee"
    ],
    "date_download": "2017-02-15 02:47:16+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 01:21:44",
    "description": "San Francisco's city attorney filed a lawsuit against a massage parlor Tuesday. Dennis Herrera says Queen's Health Center on Kearny Street in the Financial District has been operating a brothel.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fsf-city-attorney-files-lawsuit-against-alleged-brothel%2F1755133%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755158_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "San Francisco's City Attorney Dennis Herrera filed a lawsuit against a massage parlor Tuesday. He says Queen's Health Center on Kearny Street in the Financial District has been operating a brothel.The establishment is near the busy Pine Street with popular lunchtime eateries.When people go to a massage parlor they expect to get a massage. According to Herrera that's not what happens at Queen's Health Center.\"They've been flaunting the law for years,\" said city attorney spokesperson John Cote. \"They know what they're doing is illegal.\"The city attorney filed this lawsuit charging that the massage parlor is really a brothel. The suit says for at least six years the city has cited queens health center with multiple fines for violating health codes and other laws.\"They've even had their operating permit revoked for 60 days, and yet they continue to thumb their nose at the laws,\" said Cote.There have also been numerous police undercover operations here.Police investigators found individuals engaging in sex. They interviewed multiple patrons of this business who indicated they were there to pay for sex.Investigators also say they found an elaborate warning system in the parlor in case of raids.\"If inspectors were coming or police were coming lights would be turned on,\" Cote told ABC7 News. \"There were stops behind doors to keep doors from opening.\"While some patrons of the neighboring restaurants were shocked, others weren't. \"Listen, I'm not going to expose my friends but I've heard a few stories yeah,\" said customer Michael Dodd. \"It's a risky business going on up there.\"On top of fines the city hopes to close the business for at least a year.",
    "source_domain": "abc7news.com",
    "title": "San Francisco's city attorney files lawsuit against alleged brothel",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/sf-city-attorney-files-lawsuit-against-alleged-brothel/1755133/"
}