{
    "authors": [],
    "date_download": "2018-03-20 03:36:30+00:00",
    "date_modify": null,
    "date_publish": "2018-03-17 00:21:41",
    "description": "The three women who died when a gunman stormed a veterans center in Yountville, Calif. were remembered Wednesday night at a \"Celebration of Life\" memorial service.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fmemorial-for-yountville-shooting-victims%2F3225610%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3236270_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Full schedule for the memorial:\nRELATED STORIES\nThe three women who died when a gunman stormed a veterans center in Yountville, Calif. were remembered Wednesday night at a \"Celebration of Life\" memorial service.ABC7 brought you live coverage of the memorial service on TV, online and on the ABC7 News app Organizers said the event for Dr. Jennifer Gray Golick, Christine Loeber and Dr. Jennifer Gonzales Shushereba \"will be a solemn and respectful honoring of the lives and contributions of the three brave women who lost their lives at The Pathway Home; an opportunity for family members, friends, and community to grieve together; and a moment to thank all of those who support our nation's veterans, especially in the area of mental health.\"The event was open to the public and was held at the Performing Arts Center at Lincoln Theater, 100 California Drive, on the campus of the Veterans Home of California. The theater holds 1,200 people and is expected to reach capacity. Doors opened at 4:30 p.m. and seating was on a first-come, first-serve basis.6:00 p.m. Welcome Attendees by John Dunbar, Mayor, Town of Yountville (5 min)- CHP Color Guard to Present the Colors6:05 p.m. National Anthem by Kellie Fuller (2 min)6:07 p.m. Invocation by Veterans Home Chaplain Ira Book (3 min)6:10 p.m. Dignitaries Remarks (10 min)- Congressman Mike Thompson (5 min)- Dr. Vito Imbasciani, Secretary, CA Department of Veterans Affairs (5 min)6:20 p.m. The Pathway Home (15 min)- Dorothy Salmon, Chair, Board of Directors, The Pathway Home- Zach Skiles, Graduate, The Pathway Home6:35 p.m. Travis Air Force Base, Band of the Golden West (10 min)6:45 p.m. Veterans Administration (20 min)- Dr. Carolyn Clancy, Executive in Charge, Veterans Health Administration- Keith Armstrong, Director, VITAL and Student Affairs Health Program San Francisco Veterans Affairs Health Care System7:05 p.m. Closing Remarks by John Dunbar, Mayor, Town of Yountville (2 min)",
    "source_domain": "abc7news.com",
    "title": "Celebration of Life: Memorial for Yountville shooting victims",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/memorial-for-yountville-shooting-victims/3225610/"
}