{
    "authors": [
        "Ama Daetz"
    ],
    "date_download": "2017-02-15 04:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 23:17:09",
    "description": "Engineers in San Francisco are growing diamonds, just like the ones that come out of the mines deep in the ground.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftechnology%2Fsf-engineers-coin-high-tech-diamond-growing-%2F1754907%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755272_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "In South San Francisco right now, engineers are growing diamonds. We are not talking cubic zirconia - these are real diamonds. The manmade gems are virtually identical to diamonds mined from deep in the earth.High tech is now transforming high-end jewelry and a number of bay area businesses are early adopters.Husband and wife team Lindsay Reinsmith and Jason Payne started learning about manmade diamonds when they got engaged five years ago.Reinsmith did not want a traditional diamond because of the difficulty of tracking its origin. She wanted to be sure no environmental damage or human rights issues were associated with the gemstones in her engagement ring.Eventually, she and Payne settled on man-made diamonds, but they were hard to find - so the couple decided to start their own business.A few months ago they launched Ada Diamonds , an on-line business based in Sunnyvale. They sell custom jewelry using man-made diamonds.Sophisticated equipment can now grow gem quality diamonds in just a few weeks. \"It's a paragon of human achievement that we can recreate the conditions with which carbon becomes diamond\" according to Payne.Ada Diamonds sells diamonds grown in several different laboratories. Advances in technology now allow labs to grow diamonds in a wide range of colors and sizes.But is a diamond grown in a lab real? Brenda Harwick with the Gemological Institute of America says yes. Lab diamonds \"have the same physical, chemical and optical properties as a natural diamond that's grown in the earth over billions of years\" according to Harwick.Prices for manmade diamonds are generally 20 to 40 percent less than mined diamonds. But Martin Roscheisen of the Diamond Foundry in South San Francisco says it actually costs more to grow a diamond in a lab than to dig it out of the ground. Roscheisen says growing diamonds is extremely difficult which is why companies like his keep the exact details secret. Brilliant Earth in San Francisco sells both diamonds that are certified as \"ethically mined\" and lab grown diamonds. The lab diamonds are still just a tiny slice of the business, but interest is growing.Kathryn Money with Brilliant Earth says manmade gems are \"are resonating particularly well with millennials because they are beautiful, responsible and affordable.Lab-grown diamonds still have the same type of imperfections as mined diamonds. So if you are thinking of buying one, experts say you should get the same kind of independent certification that's available for natural diamonds.",
    "source_domain": "abc7news.com",
    "title": "San Francisco engineers are growing diamonds, transforming high-end jewelry",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/technology/sf-engineers-coin-high-tech-diamond-growing-/1754907/"
}