{
    "authors": [],
    "date_download": "2018-03-20 03:40:57+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 19:03:31",
    "description": "Median rents for a 1-bedroom in the Embarcadero are hovering around $3,295.",
    "filename": "http%3A%2F%2Fabc7news.com%2Frealestate%2Fa-look-inside-the-embarcaderos-least-expensive-apartments%2F3234828%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3234827_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "101 Lombard St.\n111 Chestnut St., #7th Floor\n220 Lombard St., #Apt 422\nAccording to rental site Zumper , median rents for a 1-bedroom in the Embarcadero are hovering around $3,295 (compared to a $3,300 average for San Francisco).But what does the low-end pricing on a waterfront rental look these days--and what might you get for the price?We looked at listings for studios and 1-bedroom apartments to see what price-conscious apartment seekers can expect to find, but these prices and availability are subject to change.Listed at $2,700/month, this 789-square-foot, 1-bedroom, 1-bathroom condo is 18.1 percent less than the $3,295/month median rent for a 1-bedroom in the Embarcadero.The building offers garage parking, a swimming pool, a roof deck, storage space and a doorman. In the unit, expect both air conditioning and central heating, hardwood flooring, a balcony, a walk-in closet, in-unit laundry and a dishwasher. Sadly for pet guardians, animals are not permitted.(See the complete listing here .)This 1-bedroom, 1-bathroom apartment at 111 Chestnut St., is listed for $3,200/month.In the unit, the listing promises a mix of hardwood floors and carpeting, a dishwasher and in-unit laundry. Amenities offered in the building include assigned parking, a fitness center, secured entry, an elevator, a doorman and a residents lounge, but neither cats nor dogs are welcome.(See the complete listing here .)Here's a studio apartment at 220 Lombard St., that's also going for $3,200 / month.The building offers assigned parking, a business center, a fitness center and storage space. Apartment amenities in the furnished unit include hardwood floors, high ceilings, stainless steel appliances and ample natural light. Small pets are permitted.(See the full listing here .)---",
    "source_domain": "abc7news.com",
    "title": "A Look Inside The Embarcadero's Least Expensive Apartments",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/realestate/a-look-inside-the-embarcaderos-least-expensive-apartments/3234828/"
}