{
    "authors": [
        "Amy Hollyfield"
    ],
    "date_download": "2017-08-14 21:38:27+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 11:18:45",
    "description": "Police are searching for a suspect accused of shooting a driver in the head on southbound I-880 in San Leandro early Monday morning.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftraffic%2Fpolice-investigate-i-880-shooting-in-san-leandro-that-left-1-in-critical%2F2305802%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/2307432_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "San Leandro section of Southbound 880 is clear.... opening NOW. pic.twitter.com/Jys5Mgrnb6 — Amy Hollyfield (@amyhollyfield) August 14, 2017\nPolice say southbound I-880 in San Leandro reopened after a shooting left one person in critical condition early Monday morning.The lanes were closed at 2:44 a.m. and reopened at 8:45 a.m. Monday morning commuters who use the freeway made a slow crawl to work.Officers said a person was shot in the head overnight after someone in a white car pulled up to a dark car and fired into that vehicle. \"We had a call of shots fired, and our units arrived on scene. At the time we got here, there was a vehicle located in the fast lane, the number one lane, with four occupants and one of them was critically injured. The other three were not,\" California Highway Patrol Ofc. Joseph Fowler said.The victim was taken to a nearby hospital, and is currently in critical condition.Officials said there were passengers inside the car, but they are all OK.This is the 91st freeway shooting in the Bay Area in the last year and a half.The CHP spokesperson said Monday morning's investigation led to a five-hour-long highway closure because they are very motivated to make arrests and bring an end to these shootings. \"It is frustrating. There is quite a few highway shootings and that's why we are taking such precaution at this point and we're trying to handle it as through as we can,\" Fowler said.Police are still searching for the shooting suspect.",
    "source_domain": "abc7news.com",
    "title": "Police investigate southbound I-880 shooting in San Leandro that left one in critical condition",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/traffic/police-investigate-i-880-shooting-in-san-leandro-that-left-1-in-critical/2305802/"
}