{
    "authors": [
        "Michael Finney"
    ],
    "date_download": "2018-04-25 03:21:40+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:52:09",
    "description": "What's worse: Having your internet go down, or taking a day off work to wait for a technician?",
    "filename": "http%3A%2F%2Fabc7news.com%2Fbusiness%2Fman-waits-all-day-comcast-doesnt-show-up%2F3388196%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1734817_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "What's worse: Having your internet go down, or taking a day off work to wait for a technician?Peninsula contractor Matt Schmeeckle says he endured the aggravation of both when his internet suddenly disconnected, and Comcast said it would take a week to get a technician out to fix it.\"I was obviously very disappointed,'' Schmeekle said. \"To go a week without internet when you run a business from home, it's nearly impossible.\"But he says he had no choice. He says he waited a whole week for the technician, doing business out of a Starbucks and his dad's house where he could get internet access. And when the appointment day arrived, he cleared his calendar.\"And I'm there, waiting for this person, canceled all appointments, no work, no projects and at the end of the day, they never show up. I'm like hey where's the Comcast guy?\"He says he called Comcast to find out what happened.The guy on the phone starts looking it up and then he's like, 'oh, we screwed up.'\"Schmeeckle asked when the technician would get there. \"I'm like in a day, two days? He's like no it'll be another week. They wanted to send someone a week from that time.\"He asked to talk to a supervisor.\"I mean, I've already been a week without internet. 'How do I know you're going to show up a week from now?\"Schmeeckle said it wasn't fair that he was paying for internet that didn't work, and would be without it for two weeks.Comcast pointed out he was under contract. Canceling would incur a $200 early termination fee.\"They said, 'you're under contract, you can't cancel' and I said, 'you're not providing my service.' And they said you, 'have to give us an opportunity to fix it.' I said I gave you the opportunity.\"Schmeeckle did cancel, and thought the whole thing was over -- until six months later.\"All of a sudden I get a credit alert -- you have a collections notice.\"Comcast had charged an early termination fee and sent it to collections. He asked Comcast to take it off his credit report.\"They said, 'nope you wouldn't let a technician come out.'\"He contacted ABC7, and the 7 On Your Side team contacted Comcast. They said there had been confusion over when that technician was actually scheduled. However, the company waived the cancellation fee and took the collections action off his credit report.\"Comcast is on a mission to reinvent how we interact with customers and deliver exceptional service. In cases where that does not happen for any reason, we strive to work with our customers to correct the situation promptly and resolve issues to the customer's complete satisfaction. We have earnestly sought to do that in this particular case. It was our understanding that we took the necessary steps to respond to and fully resolve the concerns that were raised,\" the company told ABC7.And it did. Comcast came back out, reconnected his internet, and Schmeeckle is back in business.\"You guys got it done and I'm happy,'' he said.",
    "source_domain": "abc7news.com",
    "title": "Man waits all day, Comcast doesn't show up",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/business/man-waits-all-day-comcast-doesnt-show-up/3388196/"
}