{
    "authors": [
        "Vic Lee"
    ],
    "date_download": "2018-04-24 23:36:21+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 19:45:59",
    "description": "One person died in a multi-vehicle collision on Lakeville Highway in Petaluma Tuesday morning, a REDCOM fire and emergency center dispatcher said.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3387050%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3387629_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Multivehicle accident in Petaluma on Lakeville Hwy one person dead four others injured. Police say cause may be distracted driver who crossed double yellow line. pic.twitter.com/Oq1MUVqudP — Vic Lee (@vicleeabc7) April 24, 2018\nOne person died in a multi-vehicle collision on Lakeville Highway in Petaluma Tuesday morning, a REDCOM fire and emergency center dispatcher said.A pickup truck collided with two cars on Lakeville Highway near South McDowell Blvd. in Petaluma.Petaluma police say the accident happened shortly after 7 a.m. when a Chevrolet Silvarado Pickup travelling westbound crossed a double yellow line, colliding with an oncoming Honda and a Toyota Prius.The woman driver of the Prius suffered fatal injuries.Two men in the truck and the driver of the Honda were taken to the hospital with serious to moderate injuries, according to Lt. Ron Klein of the Petaluma Police.ABC7 News spoke with Cesar Pomajulca an employee of Labcon Co. which has offices next to the Highway. He was one of the first to rush over to the accident site to help the crash victims.Pomajulca holds a medical degree from his native Peru.He ran to the Prius which had major damages and saw the driver still in her seat.\"When I got there, the woman was unconscious with fractures on both arms and she had a weak pulse. She was in a bad situation. I looked in her eyes and there were signs of brain damage.\"Pomajulca also helped extricate the two men inside the truck. He helped treat their injuries until paramedics arrived.He and others ABC7news spoke with say this stretch of the Lakeville Highway is dangerous, with drivers ignoring the 45 miles an hour speed limit.Lt. Klein says speed has yet to be determined as a cause of the accident but that the preliminary investigation shows the driver of the pickup truck may have been distracted.",
    "source_domain": "abc7news.com",
    "title": "Person killed in multi-vehicle crash in Petaluma",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3387050/"
}