{
    "authors": [],
    "date_download": "2018-07-04 17:50:23+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 17:01:32",
    "description": "Joey Chestnut has scored his 11th Nathan's Famous Hot Dog Eating Contest win by swallowing 74 hot dogs in 10 minutes.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsports%2Fsan-joses-joey-chestnut-scores-11th-hot-dog-contest-win%2F3704574%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3704653_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The counter missed a plate. They are now saying 74 is official for Chestnut, which is the all-time record. A shame it came in this way. — Darren Rovell (@darrenrovell) July 4, 2018\nNutrition Data on Joey Chestnut’s record 74 hot dogs and buns in 10 minutes. pic.twitter.com/vsuhaHH0ah — Darren Rovell (@darrenrovell) July 4, 2018\nJOEY CHESTNUT HAS DONE IT AGAIN! pic.twitter.com/YcEgw5VGo8 — ESPN (@espn) July 4, 2018\n10 minutes + 37 hot dogs = 5th title for @OMGitsMIKI 🏆🌭 pic.twitter.com/MGGeeYUHW9 — ESPN (@espn) July 4, 2018\nJoey \"Jaws\" Chestnut has scored his 11th Nathan's Famous Hot Dog Eating Contest win by swallowing 74 hot dogs in 10 minutes, which is an all-time record.It was originally reported that the San Jose native gobbled 64 hot dogs. But it appears as though a counter missed a plate.In case you're wondering, in eating 74 hot dogs, Chestnut chowed down on 22,200 calories.The 216 pound eating machine says he cut off solid foods on Tuesday to prepare for the contest.Last month, at Vallejo's Six Flags Discovery Kingdom, Chestnut almost broke his own eating record. He ate 72 hot dogs in 10 minutes, just short of his record of 73-and-a-half.For the fifth year in a row, Las Vegas super eater Miki Sudo took top prize at the Nathan's Famous July Fourth hot dog eating contest, downing 37 franks and buns in 10 minutes amid stifling humidity at the annual seaside competition.Sudo fell short of the 41 hot dogs she consumed last year but still beat out second-place finisher Mischelle Lesco of Tuscon, Arizona, who chowed down 28 wieners and buns.Sudo, 32, was a fan favorite, drawing big cheers from the crowd during her performance, which was slightly delayed after she requested new water to soak her buns.George Shea, the longtime host of the annual Brooklyn eat-off, quipped that Sudo was particular about the temperature and amount of water she uses while competing.Thousands of attendees, many donning mustard-colored hot dog caps, braved 83-degree temperatures and a heat index of 91 degrees to witness the annual July Fourth competition on the Coney Island boardwalk. The outlandish tradition dates to 1972, though the company has long promoted what a former president acknowledged was a legendary start date of 1916.Fan Martha Pleasant, 41, of Franklin, New Jersey, said she was attending the competitive eating competition to support her husband Dwight, who \"loves wieners.\"\"We are trying to knock something off my hubby's bucket list,\" she said.",
    "source_domain": "abc7news.com",
    "title": "San Jose's Joey Chestnut scores 11th hot dog contest win",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/sports/san-joses-joey-chestnut-scores-11th-hot-dog-contest-win/3704574/"
}