{
    "authors": [
        "John Santucci"
    ],
    "date_download": "2018-07-04 08:57:31+00:00",
    "date_modify": null,
    "date_publish": "2018-07-03 01:44:12",
    "description": "The president met",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Ftrump-meets-with-7-supreme-court-candidates-predicts-hell-hit-a-home-run%2F3694354%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/supreme-court-building-ap-jc-180514_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The list of interviewees for the opening on the Supreme Court continues to grow. White House spokesman Raj Shah said President Donald Trump spoke with three candidates on Tuesday.Trump has met with seven potential Supreme Court nominees.The four potential nominees who met with Trump on Monday, one of whom may fill the seat soon vacated by Justice Anthony Kennedy, were: Brett Kavanaugh, Amy Coney Barrett, Raymond Kethledge and Amul Thapar, sources told ABC News.ABC News also learned on Tuesday that Trump spoke with current Utah Sen. Mike Lee on Monday.Trump was expected to meet with Justice Joan Larsen of the 6th Circuit, the second woman he's interviewed, sources familiar with the president's meetings told ABC News on Monday. The seventh person interviewed is believed to be Thomas Hardiman, circuit judge of the U.S. Court of Appeals for the 3rd Circuit.Trump appeared at a Salute to Service dinner on Tuesday night in West Virginia where he spoke briefly about the interview process.\"I've spent the last three days interviewing and thinking about Supreme Court justices. Such an important decision,\" he said.\"And we're going to give you a great one. We're going to announce it on Monday,\" he continued. \"And I think you'll be very impressed. These are very talented people, brilliant people and I think you're going to really love it, like Justice [Neil] Gorsuch. We hit a home run there, and we're going to hit a home run here. And step by step, we are making America great again.\"White House press secretary Sarah Sanders said on Tuesday morning they would not reveal any of the names Trump spoke to, but said they were \"excited.\"\"Once again, we're not going to comment on the names,\" she said. \"And we're excited about who he's going to pick.\"News of the first four candidates' meeting with Trump was first reported by The Washington Post.",
    "source_domain": "abc7news.com",
    "title": "Trump meets with 7 Supreme Court candidates, predicts he'll 'hit a ..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/trump-meets-with-7-supreme-court-candidates-predicts-hell-hit-a-home-run/3694354/"
}