{
    "authors": [
        "Eyewitness News"
    ],
    "date_download": "2018-07-04 21:15:06+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 20:12:35",
    "description": "U.S. Parks Police have evacuated Liberty Island of tourists after a woman climbed to the base of the Statue of Liberty.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fwatch-live-woman-climbs-statue-of-liberty-in-nyc%2F3705457%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/wabc/images/cms/3705487_1280x720.JPG",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos Jim Dolan reports on the person climbing the Statue of Liberty.\nU.S. Parks Police have evacuated Liberty Island of tourists after a woman climbed to the base of the Statue of Liberty.Live images from our sister station Eyewitness News showed the woman lying at the base of statue.She appeared to be moving occasionally and waving a t-shirt at times.It was not immediately clear if she was protesting anything in particular.The view from another Eyewitness News camera located on another side of the statue showed police scaling the base with a ladder.They appeared to be talking with the woman.Meantime, visitors were being taken off the island via ferry.\"We've had two unusual events occur back-to-back,\" National Park Service spokesman Jerry Willis told Eyewitness News. \"So for the safety and security of our visitors, we decided to evacuate for the day.\"\"It's our busiest week of the year, historically,\" Willis continued. \"The island at this time of the day is mostly near capacity, at 4,000 to 4,500 people. All boats have been tasked will moving people off the island. We have an evacation plan. Given the heat of the day, the visitors complied with no issues.\"Reports of a person scaling the statue started coming in around 3 p.m. Friday, shortly after a protest group calling itself Rise and Resist dropped a banner that read \"Abolish ICE\" from the base of the statue.That demonstration was organized to protest the Trump administration's immigration policy, the group said in a press release.The group said the woman who climbed to the base of the statue was not involved in the \"Abolish ICE\" protest.",
    "source_domain": "abc7news.com",
    "title": "WATCH LIVE: Woman climbs Statue of Liberty in NYC",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/watch-live-woman-climbs-statue-of-liberty-in-nyc/3705457/"
}