{
    "authors": [
        "Mike Levine"
    ],
    "date_download": "2018-04-24 18:49:35+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 17:10:02",
    "description": "The chief cyber official at DHS, Jeanette Manfra, testified Tuesday to Congress.",
    "filename": "http%3A%2F%2Fabc7news.com%2Frussia-likely-targeted-all-50-states-in-2016-but-has-yet-to-try-again-dhs%2F3386619%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/jeanette-manfra-ap-jef-180424_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Current and former U.S. officials have repeatedly warned Americans to brace for another onslaught of Russian cyber-attacks against the 2018 midterm elections , but even with the campaign season underway the U.S. government has yet to detect any new cyber activity from Russia targeting election systems, according to the Department of Homeland Security 's top cyber official.Nevertheless, Assistant Secretary Jeanette Manfra said it's likely every single U.S. state was targeted by Russian hackers during the 2016 presidential election - far more states potentially impacted than the public may have realized.\"Two years ago the Russian government launched a brazen, multi-faceted influence campaign aimed at undermining public faith in our democratic process, generally and our election specifically,\" Manfra told lawmakers Tuesday. \"That campaign involved cyber espionage, public disclosure of stolen data, cyber intrusions at the state and local voter registration systems, online propaganda, and more. We cannot let it happen again.\"Just last month, DHS Secretary Kirstjen Nielsen told lawmakers the threat to state election systems \"remains high,\" with \"potential vulnerabilities\" embedded in voter databases and vote tabulation systems.\"We think vigilance is important, and we think there is a lot that we all need to do at all levels of government before we have the midterm elections,\" Nielsen told lawmakers.On Tuesday, during a hearing of the Senate Homeland Security Committee, Sen. Margaret Hassan, D-N.H., noted to Manfra that six states have already held primaries for the 2018 season and dozens more primaries will be held in the coming weeks.\"Has DHS detected any cyber activity targeting election infrastructure by Russia or any other actors during this election season?\" Hassan asked Manfra.\"We have not at this time,\" Manfra responded.Manfra was not asked whether the U.S. intelligence community has detected any of the other measures that Russia deployed during the 2016 presidential election, particularly the use of social media like Facebook to spread false information and inflame tensions across the United States.\"There should be no doubt that Russia perceives its past operations as successful and views the 2018 U.S. midterm elections as a potential target for Russian influence operations,\" the nation's top intelligence official, Director of National Intelligence Dan Coats , recently told Congress.Protecting state election systems from overseas hackers has become a focal point for lawmakers and U.S. officials looking to prevent foreign meddling in America's elections - a cornerstone of American democracy.Even before the 2016 presidential election, DHS began warning the public that Russian hackers had launched a broad cyber-campaign against U.S. states, looking for ways to break into their voter-related systems.However, on Tuesday, the top Democrat on the committee, Sen. Claire McCaskill , D-Missouri, accused DHS of misleading lawmakers and the public about the scope of that campaign.DHS officials have repeatedly said they detected \"scanning\" - when hackers scan a target for security gaps -- in 21 states.But McCaskill noted that in the run-up the 2016 election, only about half of states had the tools needed to detect such scanning, and DHS was only publicly cited the number of states where that scanning was detected.\"The impression that was given at the time is that we had knowledge that 21 states were [targeted] and the assumption was that the remaining states were not,\" McCaskill said. \"But in fact that is an incorrect assumption.\"\"We really don't have an idea how many states that Russia tried to hack,\" McCaskill insisted.In response, Manfra acknowledged Russian hackers likely tried to hack into all 50 states. \"We can absolutely make the assumption that more would have been targeted,\" she said.Manfra, however, disputed McCaskill's assertion that the public had been \"misled.\"\"We only had the visibility that we had, and I believe I've been clear about that as I've discussed it,\" Manfra said. \"How the media reports it I cannot control.\"In fact, Manfra told the Senate Intelligence Committee last year, \"As of right now, we have evidence of election-related systems in 21 states that were targeted.\" And last month, she told the same panel that authorities are \"confident\" the \"21 number is accurate\" based on \"the visibility that we had at the time.\"Hackers successfully breached voter-related systems tied to four states.On Tuesday, Manfra said DHS is \"increasing our visibility\" for future elections.DHS is now providing \"voluntary assistance\" to states and sharing certain U.S. intelligence with states about the threat facing their systems, Manfra said.",
    "source_domain": "abc7news.com",
    "title": "Russia likely targeted all 50 states in 2016, but has yet to try again: DHS",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/russia-likely-targeted-all-50-states-in-2016-but-has-yet-to-try-again-dhs/3386619/"
}