{
    "authors": [
        "Elissa Harrington"
    ],
    "date_download": "2017-10-07 00:27:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 21:19:17",
    "description": "A 24-year-old Oakland woman broke several bones and suffered a spinal injury after she says a road rage driver chased her for seven miles, eventually forcing her car to fly off the side of Highway 24. It's a story you'll see only on ABC7.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fexclusive-bay-area-woman-almost-killed-in-alleged-road-rage-crash%2F2500658%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2501424_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "#GoFundMe for #Oakland woman Maddison Holland. In terrifying car crash - says angry driver forced her off highway. https://t.co/3pUGIzRatt — Elissa Harrington (@ElissaABC7) October 6, 2017\n\"He was just relentless.\" #Oakland woman says \"road rage\" driver forced her off hwy after she honked horn. Broke bones, injured spine. pic.twitter.com/sCtCFbe92H — Elissa Harrington (@ElissaABC7) October 6, 2017\nThe hunt is on for an alleged road rage driver who reportedly forced a young woman off the road in Lafayette. Her car flew off the side of a highway, took out a tree and a fence, and landed upside down.It's a story you'll see only on ABC7 News.\"I keep seeing myself turning and crashing,\" said Maddison Holland. \"And I can't stop thinking about it,\"The 24-year-old Oakland resident is recovering at the hospital after a terrifying crash sent her car flying over the side of Highway 24 on Wednesday afternoon. She says she was forced off the road by an angry driver.Holland says it all started when a man in a maroon truck cut her off in the Caldecott Tunnel. She honked her horn and flashed her lights, which she says sent the driver into a rage.\"He kept following me to each lane I would get into and I was just trying to get away from him. And he was just like relentless and it was scary. It was so scary. And he just thought it was some joke, like it was so funny to be harassing someone,\" she said through tears.The chase lasted for seven miles.Holland's car ended upside down at the dead-end of 2nd Street in Lafayette.Neighbor Robin Pizza heard the crash.\"I will never forget it,\" she said. \"It was like a boom and then a horrible crunching sound.\"She called 911 while her twin teenage boys ran to the car and dragged Holland out.\"We were just trying to do what was right, you know? Try to get her help,\" said Lafayette resident Antonio Soto. \"Because we didn't know what was going on with the car, (we were) trying to get her out as quick as possible.\"Since the crash, family and friends keep returning to the site to search for Holland's cellphone.\"We're looking for her phone,\" said stepmother Deb Burton. \"She did get a video of the guy that was chasing her.\"Holland broke several bones and suffered a spinal injury.The case is currently being investigated by the CHP. Officers are trying to track down witnesses and find the driver.",
    "source_domain": "abc7news.com",
    "title": "ONLY ON ABC7NEWS.COM: Woman almost killed in alleged road rage crash in Lafayette",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/exclusive-bay-area-woman-almost-killed-in-alleged-road-rage-crash/2500658/"
}