{
    "authors": [],
    "date_download": "2018-04-25 01:39:39+00:00",
    "date_modify": null,
    "date_publish": "2018-04-25 00:06:06",
    "description": "Three of the listings that are included in our roundup are pet-friendly.",
    "filename": "http%3A%2F%2Fabc7news.com%2Frealestate%2Frenting-in-oakland-what-will-%242000-get-you%2F3388026%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3388023_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "1733 Foothill Blvd., #A (Rancho San Antonio)\n400 Montclair Ave., #1 (Cleveland Heights)\n2300 Fruitvale Ave. (Patten)\n3875 Ruby St., #305 (Mosswood)\nCurious just how far your dollar goes in Oakland?We've rounded up the latest rental offerings via rental site Zumper to get a sense of what to expect when it comes to scoring an apartment in Oakland if you're on a budget of $2,000 / month.Take a peek at what rentals the city has to offer, below. (Note: prices and availability are subject to change.)Listed at $2,000 / month, this studio apartment is located at 1733 Foothill Blvd.The apartment features tile flooring, high ceilings, a dishwasher and an electric stove. Assigned parking is offered as a building amenity. Both cats and dogs are permitted.According to Walk Score's assessment, the surrounding area is friendly for those on foot, is convenient for biking and offers many nearby public transportation options.(Take a look at the complete listing here .)Next, there's this one-bedroom, one-bathroom apartment located at 400 Montclair Ave. It's also listed for $2,000 / month for its 850-square-feet of space.The building features outdoor space. In the unit, there are hardwood floors, high ceilings, a walk-in closet, a decorative fireplace, French doors and ample closet space. Pets are not welcome.According to Walk Score, the area around this address is quite walkable, is fairly bikeable and offers many nearby public transportation options.(See the complete listing here .)Here's an 800-square-foot one-bedroom, one-bathroom apartment at 2300 Fruitvale Ave. that's going for $1,995 / month.In the apartment, you'll get in-unit laundry, central heating, hardwood flooring, a dishwasher, stainless steel appliances, a walk-in closet and granite countertops. Secured entry and assigned parking are offered as building amenities. Two feline companions are permitted.Per Walk Score ratings, the surrounding area has excellent walkability, has some bike infrastructure and offers many nearby public transportation options.(Check out the complete listing here .)Next, check out this 650-square-foot one-bedroom, one-bathroom apartment that's located at 3875 Ruby St. It's listed for $1,975 / month.In the unit, you'll get hardwood floors, high ceilings, a dishwasher, a walk-in closet, garden access, a ceiling fan and granite countertops. When it comes to building amenities, anticipate on-site laundry, outdoor space, on-site management and a bike room. Feline companions are welcome.Per Walk Score ratings, the area around this address has excellent walkability, is great for biking and has excellent transit.(Take a look at the complete listing here .)---",
    "source_domain": "abc7news.com",
    "title": "Renting in Oakland: What will $2,000 get you?",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/realestate/renting-in-oakland-what-will-$2000-get-you/3388026/"
}