{
    "authors": [],
    "date_download": "2018-03-20 03:59:36+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 23:03:47",
    "description": "The new restaurant serving traditional Nepalese specialties and pizza.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235631%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3235630_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Himalayan Pizza and Momo, a new restaurant by the family behind Saffron Grill in Hayes Valley, opens today in the Tenderloin.The Nepalese eatery at 288 Golden Gate Ave. (at Hyde) serves a wide variety of options, including pizzas, sandwiches, pasta, and salads.But its specialties are traditional Nepalese dishes like samosas, chicken and vegetarian masalas, and momo--steamed dumplings filled with meat and/or vegetables.The menu also offers several gluten-free and vegan entrees as well as lunch combos.As we reported last year , the restaurant's general manager, Santosh Gurung, lives in the Tenderloin and has long wanted to bring Nepalese flavors to the neighborhood.Gurung made many improvements to the space, including adding a new sign and awning. Taj Pizza was the last restaurant to occupy the location.The restaurant's head chef, Nab Raj Dhakal, owned and managed Kathmandu Pizza House in Nepal before coming to the Bay Area in 2011. Prior to joining Himalayan Pizza and Momo, he worked for six years at Chico's Pizza.Dhakal will be joined in the kitchen by Saffron Grill cook Ranjit Gurung, who will be the tandoori chef.Himalayan Pizza and Momo is open today from 11am until 10pm. The restaurant will initially be open seven days a week, but hours may change over time. Its food is also available for delivery through DoorDash.",
    "source_domain": "abc7news.com",
    "title": "'Himalayan Pizza & Momo' Opens Today In The Tenderloin",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235631/"
}