{
    "authors": [
        "Melanie Woodrow"
    ],
    "date_download": "2017-08-14 06:31:16+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 05:28:42",
    "description": "A popular Berkeley restaurant says it does not support the actions of those in Charlottesville. Top Dog posted a sign with its views after a flurry of social media posts suggesting a man at the rally worked at Top Dog.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fberkeley-restaurant-takes-stand-on-charlottesville%2F2305144%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2305170_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A popular Berkeley restaurant says it does not support the actions of those in Charlottesville. Top Dog posted a sign with its views after a flurry of social media posts suggesting a man at the rally worked at Top Dog.Employees at Top Dog on Durant Avenue said they had no comment about a now former employee who may have been in Charlottesville.\"Different people were releasing the people's names and looking at their faces and trying to see okay where are they from and everything and someone said, 'Oh, he works here in Berkeley,'\" said U.C. Berkeley student Kendall O.A sign on the restaurant's door says \"Effective Saturday 12th August, Cole White no longer works at Top Dog. The actions of those in Charlottesville are not supported by Top Dog. We believe in individual freedom and voluntary association for everyone.\"Several U.C. Berkeley students stopped by the restaurant to take pictures of the sign.\"I feel that it's good that Top Dog is taking a stand against this kind of stuff,\" said U.C. Berkley student Ansel Deng.Many were horrified by the violence in Charlottesville.\"It's crazy it's 2017 and we still have people who are just so backwards who just can't seem to wrap their heads around inclusivity,\" said Deng.\"It's horrific, it's just really horrific,\" said U.C. Berkeley Alumna Havah Loehrer.But, Loehrer questioned the response on social media as people attempt to identify those in the crowd.\"It's a reaction that's just full of hate and anger and that just begets more hate and anger,\" said Loehrer.",
    "source_domain": "abc7news.com",
    "title": "Berkeley restaurant takes stand on Charlottesville",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/berkeley-restaurant-takes-stand-on-charlottesville/2305144/"
}