{
    "authors": [
        "Matt Keller",
        "Dion Lim"
    ],
    "date_download": "2018-03-20 03:35:31+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 18:23:47",
    "description": "The Posey Tube from Alameda to Oakland will be closed to traffic from Monday until midnight Tuesday while crews work to repair a sinkhole.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftraffic%2Falameda-to-oakland-posey-tube-remains-closed-for-repairs%2F3234701%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3236355_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Posey tube from Alameda to Oakland is closed. Work on sinkhole at Oakland exit has begun. 1 lane expected to be open by midnight and officials hope both lanes open by the end of the week. pic.twitter.com/QYrFOqujUD — Matt Keller (@MattKellerABC7) March 19, 2018\nEMBED >More News Videos The Posey Tube from Alameda to Oakland will be closed to traffic from Monday until midnight Tuesday while crews work to repair a sinkhole.\nPosey Tube backed up on Webster Street all the way to Willie Stargell Avenue in Alameda. Sinkhole on exit side in Oakland caused 1 lane to be closed. Both lanes from Alameda to Oakland scheduled to close from 10am-midnight. pic.twitter.com/kqbcY5oAu6 — Matt Keller (@MattKellerABC7) March 19, 2018\nThe Posey Tube from Alameda to Oakland will be closed to traffic from Monday until midnight Tuesday while crews work to repair a sinkhole.Repairs are progressing as scheduled to fix the sinkhole that formed over the weekend at the Oakland exit due to an underground storm drain failure.They are hoping to have one lane of the tube back open by midnight on Monday and the other lane will likely be closed through the end of the week while repairs continue. Rain could play a factor in when that second lane opens.Drivers faced a big back up in Alameda during the Monday morning commute.Traffic inched its way up as Webster Street and Constitution Way merged together.Alameda police blocked off the one lane, but once you got into the tube traffic moved well.For people heading into Alameda in the morning, getting home to Oakland could take a lot longer, especially if you commute by bike like Oakland resident Ernesto Montenero. \"If they close the tunnel, we may not be able to ride through it as well, so we'd have to go around about an eight-mile detour,\" he said.The Posey Tube is one of the main arteries off Alameda, but there are options like the Park Street, Fruitvale and High Street bridges as well as state route 61, and the Bay Farm Island Bridge.You can also ditch the car and take the ferry. AC Transit has created several detours for affected bus lines.The Posey Tube from Oakland to Alameda remains unaffected and drivers we spoke with said delays weren't that bad because many of their colleagues and neighbors took alternate transportation or used bridges to get off the island.",
    "source_domain": "abc7news.com",
    "title": "Posey Tube from Alameda to Oakland remains closed for sinkhole repair",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/traffic/alameda-to-oakland-posey-tube-remains-closed-for-repairs/3234701/"
}