{
    "authors": [
        "Conor Finnegan"
    ],
    "date_download": "2018-04-24 17:07:08+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:04:10",
    "description": "The warning comes as Trump confers on the Iran deal with the French president.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Ftrump-warns-iran-of-much-bigger-problems-if-it-restarts-nuclear-program%2F3386445%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/macron-trump-11-gty-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump threatened Iran with \"much bigger problems than they have ever had before\" if the country restarts its nuclear program The warning comes as the clock ticks down toward Trump's May 12 deadline on whether he will keep U.S. commitments to the nuclear deal and sign waivers for Iran sanctions - or let them snap back into place and possibly destroy the deal.Trump made the comments in the Oval Office alongside French President Emmanuel Macron who is in town for a three-day state visit. Macron and other European allies are in an all-out effort to persuade Trump to stay in the agreement that he bashed again Tuesday as \"a terrible deal.\"\"It's insane, it's ridiculous, it should've never been made - but we will be talking about it,\" Trump said, sitting next to Macron.For his part, Macron tried to downplay the two leaders' differences on the issue: \"Iran deal is an important issue. We will discuss that. But we have to take it as a part of a broader picture, which is security in the region.\"\"What we want to do is to contain the Iranian presence in the region, and the JCPOA is part of this broader picture,\" the French leader added.Trump waived sanctions once again in January, but he warned it was for the last time, calling on European allies to make three fixes to what he sees as the deal's flaws: sanctioning Iran's ballistic missile program, ramping up inspections of Iranian sites, and eliminating expiration dates for the limits on Iran's enrichment levels.Since then, French, German, and British diplomats have been meeting with a State Department team to negotiate a side agreement, although they still have not reached a solution.Iranian President Hassan Rouhani delivered his own threat Tuesday, urging Trump to stay in the deal or face \"severe consequences.\"\"I am telling those in the White House that if they do not live up to their commitments, the Iranian government will firmly react,\" Rouhani said in a speech broadcast live on state television.Trump blasted Iran for destabilizing the region, saying, \"Wherever there is trouble... Iran is behind it.\"\"What kind of a deal is it where you're allowed to test missiles all over the place? What kind of a deal is it when you don't talk about Yemen and you don't talk about all of the other problems with respect to Iran?\" he added.",
    "source_domain": "abc7news.com",
    "title": "Trump warns Iran of 'much bigger problems' if it restarts nuclear p..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/trump-warns-iran-of-much-bigger-problems-if-it-restarts-nuclear-program/3386445/"
}