{
    "authors": [
        "Michael Finney"
    ],
    "date_download": "2018-04-25 02:20:14+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 03:45:53",
    "description": "With stories of widespread hackings and websites selling your data, we all want to know how to keep our digital lives private and secure. One easy way is to use a VPN -- or virtual private network -- on your computer and smartphone.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3384568%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/wabc/images/cms/1777600_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "With stories of widespread hackings and websites selling your data, we all want to know how to keep our digital lives private and secure. One easy way is to use a VPN -- or virtual private network -- on your computer and smartphone.But, how do you know which one is right for you? In a partnership with Consumer Reports, 7 On Your Side's Michael Finney offers some guidelines.When Sara and Corey Meyer launched their chocolate company, Little Bird Kitchen, they knew they would have to travel all over the country to help it take wing. \"In order to stay connected to our inventory, we needed a way to do it securely and we needed a VPN,\" said Sara Meyer, Owner of Little Bird Kitchen.Think of it as the server in the middle. In order for data to travel between your computer and another server, like a website, app, or the cloud, it has to pass through the VPN first, making your digital footprint harder to follow. \"Most good VPNs also will have encryption,\" said Bree Fowler, Consumer Reports Tech Editor. \"That will secure your data going back and forth.\"And it is not just for businesses. Fowler says anyone who uses public WiFi like at a coffee shop or airport would be wise to use a VPN.Choosing a service can be complicated. Sara Meyer's first two tries soured quickly. \"We had to keep logging in, and it was so frustrating being in Ohio in a hotel room, and trying to get into our inventory system and we couldn't,\" she said.Her current VPN allows her to log-in with one click. \"If you have to add in codes or put in a password, it may not get used, and a VPN that isn't used is not going to protect you,\" Fowler said.Another thing to look for is whether the company keeps a log of your activity.\"Some VPNs make no bones about the fact that they are collecting and selling your data, which is kind of antithetical to the idea of a VPN in the first place,\" Fowler adds. This is more common among free VPN's, but if you're willing to pay for privacy, a typical service for consumers will run you about five to ten bucks a month. Businesses will likely pay more.But Meyer says, the peace of mind really sweetens the deal. \"I can be sitting anywhere where there is WiFi, and know that we are protected,\" she said.And this is not just for people who use public WiFi. Consumer Reports says you can also use it in your own home, so that your internet service provider cannot keep track of what you are looking at or shopping for because they can collect your data, too.",
    "source_domain": "abc7news.com",
    "title": "How a VPN might keep your digital lives private and secure",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3384568/"
}