{
    "authors": [
        "Julia Jacobo"
    ],
    "date_download": "2018-04-25 01:39:12+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 22:35:33",
    "description": "The officers were critically wounded, the Dallas Police Department wrote on Twitter after the shooting.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fmanhunt-underway-for-person-of-interest-in-shooting-of-2-police-officers-civilian%2F3387712%2F.json",
    "image_url": "http://a.abcnews.com/images/US/dallas-6-ht-er-180424_hpMain_v4x3_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A manhunt is underway for a person of interest in the North Dallas shooting that injured two police officers and a civilian at a Home Depot, authorities said.911 dispatchers received a call to go to the Home Depot shortly after 4:12 p.m., Dallas Police Chief Renee Hall said in a press conference Tuesday night. After the responding officers arrived, a subsequent call for assistance was made after the shooting began.Two Dallas Police officers were critically wounded, the Dallas Police Department posted on Twitter shortly after the shooting. A civilian who is a loss prevention officer for Home Depot was also shot, Hall said. His or her condition is unknown at this time, police said.Police were actively searching for the person of interest in a nearby wooded area on Tuesday afternoon. Authorities identified him as 29-year-old Armando Juarez, who possibly left the location in a white pickup truck.Juarez is to be considered and dangerous, Hall said, adding that it is unclear \"how he was able to get a gun and shoot all three of the victims.\"Hall asked the community to contact police if they see Juarez or have any information on who and where he is.The officers were transported by the Dallas Fire-Rescue Department to the Texas Health Presbyterian Hospital in Dallas, where they are getting the \"best possible care,\" Hall said.Hall did not release their names or an update on their conditions when speaking to the media out of respect for the families, she said.Dallas Mayor Mike Rawlings described the aftermath of the shooting as a \"two-front battle,\" referring to the victims' battles for their lives at the hospital as well as \"the battle out in the community\" to find the person of interest.The police department asked for prayers for the victims and their families.\"I want to ask each and every one of you for your prayers ... for our officers, for their families and for our entire DPD family, because we need you right now,\" Hall said. \"Our hearts are very heavy.\"State, local and federal law enforcement agencies responded to the scene.In 2016, five Dallas law enforcement officers were shot and killed and seven more injured after they were ambushed by 25-year-old former Army reservist Micah Xavier Johnson . Johnson later died in a standoff with police.Former Dallas Police Chief and ABC News contributor David Brown said the most recent shooting on two Dallas police officers is \"too much to bear for one department in such a short time frame.\"\"Once again, it sobers us to realize what officers walk into day in and day out, how quickly they can become victims,\" Rawlings said.",
    "source_domain": "abc7news.com",
    "title": "Manhunt underway for person of interest in shooting of 2 police off..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/manhunt-underway-for-person-of-interest-in-shooting-of-2-police-officers-civilian/3387712/"
}