{
    "authors": [
        "Devin Dwyer"
    ],
    "date_download": "2018-04-24 20:31:58+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 18:28:26",
    "description": "Dr. Ronny Jackson's confirmation hearing Wednesday has been postponed.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Ftrump-suggests-ronny-jackson-withdraw-va-nomination-amid-allegations-of-misconduct%2F3386823%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/ronny-jackson-nc-thg-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump Tuesday suggested that his own nominee to head the Department of Veterans Affairs, Rear. Adm. Ronny Jackson, withdraw his name from consideration in a stunning turn of events that could likely end all hope that he becomes the next VA secretary.\"I wouldn't -- if I were him, actually in many ways I'd love to be him, but the fact is I wouldn't do it. I wouldn't do it,\" Trump said in the East Room of the White House during a joint press conference with French President Emmanuel Macron \"What does he need it for? To be abused by a bunch of politicians that aren't thinking nicely about our country? I really don't think personally he should do it, but it's totally his. I would stand behind him. Totally his decision,\" Trump said.The Senate Veterans Affairs Committee is reviewing what it calls \"serious allegations\" surrounding Jackson that include claims he created a hostile work environment and improperly dispensed medication as a White House physician, congressional and administration sources tell ABC News.The sources said the medication in question is the prescription sleep aid Ambien.Committee leaders announced Tuesday that they had postponed Wednesday's confirmation hearing while they reviewed the allegations.Moments before the president made his remarks, ABC News spotted Jackson on Capitol Hill meeting with lawmakers about his nomination. He ignored questions about the allegations and said, \"I'm looking forward to re-scheduling the hearing and getting the process moving.\"Asked whether the hearing would be rescheduled he said, \"That's going to be up to the committee.\"President Trump praised Jackson as \"a fine man\" and a \"great doctor, great everything,\" but said wouldn't want Jackson to go through a politically damaging nomination process.\"I don't want to put a man through who's not a political person. I don't want to put a man through a process like this,\" Trump said. \"It's too ugly and too disgusting. So we'll see what happens. He'll make a decision.\"Trump also addressed concerns that Jackson, who is currently the president's personal White House physician, lacks the overall management qualifications to head the second largest agency in the federal government, saying simply \"there's an experience problem.\"In a letter to Trump, the top Republican and Democrat on the committee ask the White House to turn over \"any and all allegations and documents, including those developed during the course of an investigation\" related to Jackson's service in the White House Medical Unit.The Defense Department inspector general would not comment on the existence of any possible investigations into Jackson's conduct and referred all questions to the White House.Democratic Sen. Richard Blumenthal , a member of the Veterans Affairs Committee, would not discuss details of the allegations but told ABC News \"they go to his integrity and his management ability and his credibility to manage that department.\"Committee chairman Republican Sen. Johnny Isakson shared concerns about the allegations but cautioned to ABC News \"not everything you read in the news is true.\"The White House was standing by the nomination of Jackson earlier Tuesday, but senior aides concede privately that there is a chance the nomination goes down.Deputy secretary Hogan Gidley released a statement Tuesday morning on Jackson after news of the allegations broke, saying \"He's served as the physician to three Presidents-Republican and Democrat-and been praised by them all.\"Admiral Jackson's record of strong, decisive leadership is exactly what's needed at the VA to ensure our veterans receive the benefits they deserve,\" the statement said.Jackson has spoken publicly about prescribing Ambien during White House international trips, a common practice for overcoming jet lag. \"When we travel from one time zone to another time zone on the other side of the planet, I recommend that everyone on the plane take a sleep aid at certain times so that we can try our best to get on the schedule of our destination,\" Jackson said at a press briefing earlier this year.Several lawmakers said the White House should be held responsible for the delayed nomination because of a failure to properly vet the nominee.\"It is really frustrating to me that this administration continues to not vet or sloppily send over a nominee that leaves us having to really vet them and look at serious questions, which this Senate is now doing, and that's the right step,\" Sen. Patty Murray , D-Wash., told ABC News.Asked if he should withdraw his nomination, she said, \"that is up to the White House.\"\"But I will assure you that every one of us as members of the committee are looking at every allegation and we have a responsibility to do so,\" she said.President Trump nominated Jackson last month after he fired his first VA secretary, David Shulkin, amid allegations Shulkin misused taxpayer funds and faced growing tension with other senior Trump staff.",
    "source_domain": "abc7news.com",
    "title": "Trump suggests Ronny Jackson withdraw VA nomination amid allegation..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/trump-suggests-ronny-jackson-withdraw-va-nomination-amid-allegations-of-misconduct/3386823/"
}