{
    "authors": [],
    "date_download": "2018-04-24 22:14:41+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 21:05:55",
    "description": "Costumes on Haight is consolidating operations and cutting back hours to reduce costs.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fbusiness%2Fin-reversal-lower-haight-costume-shop-hopes-to-remain-open%2F3387374%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3387373_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Two months after announcing plans to close, Costumes on Haight (735 Haight St. near Pierce) has restructured its operations to make the shop more sustainable. According to manager Austin Efurd, the 28-year-old shop \"is still alive and kicking and hopeful to stay open with the support of the community.\"As we reported in February, the Lower Haight costume shop was set to close due to rising costs, changing demographics and its business model, which had trouble keeping pace with online retailers that sell lower-quality costumes.In a press release, Efurd said new management policies, consolidating operations and more community support are keeping the company going.\"When I stepped into leadership, I thought it would be about closing accounts, encouraging the creative artists on our team to find new sources of income, and supporting the community as it lost another unique SF gem,\" Efurd said. \"I didn't expect to find this glimmer of hope.\"To cut costs in half, Eford said the store has reduced its storage space and hours of operation.\"While not a solve-all solution, this consolidation has kept us open and offers the SF community a chance to vote with their dollars to keep a part of quirky and queer San Francisco alive,\" he said.Going forward, he said the store also hopes to support local artists. \"If we are able raise enough capital to pay off old debt, Costumes on Haight will become even more of a hot spot for connecting the community with local artists who craft magical and affordable wearable art.\"Costumes on Haight is hosting another liquidation sale this weekend; all items will be 50 percent off, and rental costumes will be sold at rental prices.",
    "source_domain": "abc7news.com",
    "title": "In reversal, Lower Haight costume shop hopes to remain open",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/business/in-reversal-lower-haight-costume-shop-hopes-to-remain-open/3387374/"
}