{
    "authors": [
        "Kristen Sze"
    ],
    "date_download": "2018-03-20 03:56:21+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 00:27:39",
    "description": "A new effort is under way to raise $250 million to shore up San Francisco's aging seawall.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235921%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3235931_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A new effort is under way to raise $250 million to shore up San Francisco's aging seawall.Some political leaders say without it AT&T Park, new condo developments and Fisherman's Wharf would all be at risk.The San Francisco Seawall runs from Fisherman's Wharf down to Mission Creek and offers three miles of flood protection.It's served the city well and allowed the waterfront to grow and thrive. But now it's over 100 years old and showing its age.Cracks can be seen all along seawall on the Embarcadero.The fear is with the threat of a major quake and rising sea waters the wall won't be able to withstand nature's pounding and protect the waterfront, which now includes old favorite likes the Ferry Building, and new favorites like the Giants' ballpark and the new Warriors' arena under construction.\"Despite climate deniers, we know that the estimates of sea level rise by the end of this century are anywhere from 4 to 6 feet. We need to fix this seawall,\" Assemblyman David Chiu said.Chiu and State Senator Scott Wiener were surrounded by city leaders Monday as they introduced a new bill.Measure AB 25-78 would create a special tax district to divert state tax dollars to seawall improvement. and allow the city to sell bonds against future tax revenue.It's expected to raise $250 million adding to the $500 million they hope to raise with a bond measure on the November ballot.That's still just a drop in the bucket.The full seawall improvement cost is estimated at $5 billion.But consider that San Francisco's waterfront is home to $100 billion in assets and economic activity.",
    "source_domain": "abc7news.com",
    "title": "New effort to raise $250M to shore up San Francisco's cracking seawall",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235921/"
}