{
    "authors": [],
    "date_download": "2017-08-15 00:39:34+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 23:18:59",
    "description": "The university said no on-campus organization agreed to sponsor the event, which was required after a policy change in 2016.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Ftexas-a-m-cancels-planned-white-nationalist-rally%2F2308013%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/images/2308031_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Officials at Texas A&M Unversity have canceled a white nationalist rally scheduled for Sept. 11 over safety concerns.The university said no on-campus organization agreed to sponsor the event, which was required after a policy change in 2016.\"With no university facilities afforded him, he chose instead to plan his event outdoors for September 11 at Rudder Plaza, in the middle of campus, during a school day, with a notification to the media under the headline 'Today Charlottesville, Tomorrow Texas A&M,\" the school said in a statement.\"Linking the tragedy of Charlottesville with the Texas A&M event creates a major security risk on our campus. Additionally, the daylong event would provide disruption to our class schedules and to student, faculty and staff movement (both bus system and pedestrian),\" the statement continued.The school reiterated its support for first amendment rights.Organizer Preston Wiginton said he was \"highly disappointed\" by the cancellation.\"Free speech means nothing in America right now. If you're white, you cannot express yourself,\" he said.Wiginton said the event will protest the \"the liberal agenda of white guilt and white genocide that is taught at most all universities in America.\"Wiginton was responsible for an event last December featuring controversial speaker Richard Spencer, who is scheduled to return again for September's event.",
    "source_domain": "abc7news.com",
    "title": "Texas A&M cancels planned white nationalist rally",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/texas-a-m-cancels-planned-white-nationalist-rally/2308013/"
}