{
    "authors": [
        "Elissa Harrington"
    ],
    "date_download": "2017-10-06 22:56:05+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 21:19:17",
    "description": "A 24-year-old Oakland woman is recovering from surgery for a broken pelvis and other bone after she says a road rage driver forced her off the road in Lafayette.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fbay-area-woman-suffers-broken-bones-in-alleged-road-rage-crash%2F2500658%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2500723_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "This undated image shows Maddison Holland. The 24-year-old says a road rage driver forced her off the road in Lafayette, Calif. on Wednesday, Oct. 4, 2017.\n\"He was just relentless.\" #Oakland woman says \"road rage\" driver forced her off hwy after she honked horn. Broke bones, injured spine. pic.twitter.com/sCtCFbe92H — Elissa Harrington (@ElissaABC7) October 6, 2017\nA 24-year-old Oakland woman is recovering at the hospital after she says a road rage driver forced her off the road.Maddison Holland just had surgery for a broken pelvis and several broken bones. She says she was driving to work Wednesday when a man in a maroon truck cut her off exiting the Caldecott tunnel. They were traveling eastbound on Highway 24.According to Holland, she honked her horn and flashed her lights, which she says sent the driver into a rage.She says he chased her for seven miles until he eventually forced her off the side of the freeway in Lafayette.Her car landed upside down at the dead end of 2nd Street. Neighbors who heard the crash dragged her out of the car and called 911.Family members are searching the crash site for her cellphone because they say she says she recorded video of the driver.The case is currently being investigated by the CHP.",
    "source_domain": "abc7news.com",
    "title": "Woman suffers broken bones in alleged road rage crash in Lafayette",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/bay-area-woman-suffers-broken-bones-in-alleged-road-rage-crash/2500658/"
}