{
    "authors": [
        "Jonathan Bloom"
    ],
    "date_download": "2017-02-15 14:52:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 13:22:38",
    "description": "Life is resuming today in Oroville as some of the 180,000 evacuees wake up in their own beds again. With more rain on the way, not everyone is so sure they should unpack.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fevacuees-return-home-to-oroville-more-rain-on-the-way-%2F1755739%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1755753_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "More than 180,000 evacuees are returning home after officials lifted evacuation orders triggered by the Oroville Dam emergency spillway. With more rain on the way, not everyone is so sure they should unpack.The return to normal started yesterday afternoon when officials lifted the mandatory evacuation order allowing the evacuees to begin returning home after they were ordered to leave on Sunday.Many were staying at temporary shelters or hotels more than an hour away and though they couldn't wait to get home, some say they're worried that with the next rainstorm, they could have to leave again.\"We're not sure. We're going to keep our vehicles packed up and ready to go or go ahead and completely unpack. You know, I'm just not quite sure about that one yet,\" said Chuck S.\"We're still a little weary on it because we don't know with the rain coming and everything if we're going to go back into evacuation or what's going to happen, so we got everything still packed up,\" said Oroville resident Gail McElroy.Meanwhile, work continues to shore up the Oroville Dam's crumbling emergency spillway ahead of the rain expected late Wednesday night. The last update, 125 construction crews, 40 trucks per hour, carrying big rocks, sandbags and concrete down to the damaged emergency spillway, that dirt hillside, while water continues cascading down the concrete main spillway, which also has a hole in it.Water managers say they had just enough of a chance to inspect that main spillway, and they're confident it'll hold as they empty water out of the lake to prevent the emergency spillway from being needed again and they're making good progress.The lake level is currently down about 22 feet from its highest point on Sunday that's nearly halfway to the state water department's goal of 50 feet.Of course, the permanent fix for the spillways will be a long and expensive one and ABC7 News learned late Tuesday that the federal government has approved Governor Brown's request for money to speed that along.",
    "source_domain": "abc7news.com",
    "title": "Evacuees return home to Oroville, more rain on the way",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/evacuees-return-home-to-oroville-more-rain-on-the-way-/1755739/"
}