{
    "authors": [],
    "date_download": "2018-07-04 14:25:12+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 13:43:07",
    "description": "New and disturbing details have been released of the alleged abuse that led to the death of a 10-year-old boy in Lancaster.",
    "filename": "http%3A%2F%2Fabc7news.com%2Flancaster-boy-allegedly-tortured-abused-for-days-before-death%2F3703652%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kabc/images/cms/automation/vod/3676010_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "New and disturbing details have been released of the alleged abuse that led to the death of a 10-year-old boy in Lancaster.Prosecutors say Anthony Avalos suffered at least five days of sustained torture before his death on June 21, according to new court papers.Prosecutors add Anthony's mother, Heather Barron, and her boyfriend, Kareem Leiva are responsible for that torture.The torture included slamming the boy onto the bedroom floor, whipping him with a belt and cord, pouring hot sauce into his mouth and forbidding him to use the bathroom, according to the documents.Eight siblings witnessed and were forced to take part in some of the abuse, which according to the documents included making the other children fight Anthony and forcing the children keep watch \"so Anthony would remain standing or kneeling.\"Sheriff's deputies were called to Anthony's home a day before he died at a hospital. His mother said the boy had fallen down stairs.Anthony also had reddened eyes and numerous bruises, cuts and scrapes on his forehead, nose, mouth, cheek, neck, legs, shoulder, hips, back, buttocks, stomach, ankle, legs and foot.Since 2013, DCFS reported receiving at least a dozen referrals for possible physical, emotional and sexual abuse of the boy. No such reports had been made in the last two years. Authorities are reviewing the agency's response to those reports.Authorities said Avalos' sexuality may have been a motivating factor in his death.If convicted of the charges against her, Barron faces a possible maximum sentence of 22 years to life in state prison. Leiva faces 32 years to life if convicted.",
    "source_domain": "abc7news.com",
    "title": "Lancaster boy allegedly tortured, abused for at least 5 days before death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/lancaster-boy-allegedly-tortured-abused-for-days-before-death/3703652/"
}