{
    "authors": [],
    "date_download": "2017-10-06 15:21:58+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 12:49:14",
    "description": "In a single being called the '''We are the World' of this moment,'' celebrities including Lin-Manuel Miranda, Jennifer Lopez and Luis Fonsi came together to raise money for hurricane victims in Puerto Rico.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fcelebs-come-together-in-new-song-for-puerto-rico%2F2498589%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/creativecontent/images/cms/2498658_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "WATCH: @Lin_Manuel Miranda talks raising money for Puerto Rico, new passion project being called the \"'We are the World' of this moment.\" pic.twitter.com/diuXFPLzrA — Good Morning America (@GMA) October 6, 2017\nEveryone on the track pic.twitter.com/oCKcWUax5R — Lin-Manuel Miranda (@Lin_Manuel) October 6, 2017\nIn a single being called the '''We are the World' of this moment,'' celebrities including Lin-Manuel Miranda, Jennifer Lopez and Luis Fonsi are coming together to raise money for hurricane victims in Puerto Rico.After Hurricane Maria devastated the island late last month, only 7 percent of Puerto Rico has power back as of this week, ABC News reports , and less than half have regained access to water.Miranda, the creator and originator of the title role ofon Broadway, knows firsthand how people with family in Puerto Rico felt after the hurricane hit.\"There was this terrible silence while we all waited to hear from our families,\" he told, \"and my social media, my Facebook, my Twitter, was filled with, my friends and my family: 'Has anyone heard from Isabela? Has anyone heard from San Juan?'\"Those social media posts inspired Miranda to write a song that included the names of all the towns and cities on the island. In \"Almost Like Praying,\" he also employs lyrics from the musical, which features Puerto Rican characters.In two weeks, the Emmy, Grammy and Tony-winning artist wrote the song, coordinated with the artists, and recorded the track, which was released late Thursday. A prolific Twitter user, Miranda said that he tweeted at artists he wanted to include whose phone numbers he didn't have.He gave a shout-out to all the artists included in the song on Twitter, including Jennifer Lopez, Luis Fonsi of \"Despacito\" fame, Rita Moreno and Camila Cabello.With so many stars involved, putting the song together required \"everyone moving mountains,\" Miranda said. Puerto Rican rapper PJ Sin Suela was first able to reply to Miranda less than a week ago when he regained power, and he was unable to send his recording. Fortunately, Gloria Estefan, who is also involved, had plans to travel to Puerto Rico.\"I go, 'Can I get you a memory stick?'\" Miranda recalled. \"That night I get an email, it's a picture of Gloria Estefan and Emilio Estefan holding the memory stick. And he [Sin Suela] is on the track.\"Miranda said 100 percent of proceeds will go to the Hispanic Federation, a group of Latino nonprofits in the United States, which is currently raising money for Hurricane Maria victims.",
    "source_domain": "abc7news.com",
    "title": "Lin-Manuel Miranda's 'Almost Like Praying' Puerto Rico fundraiser single includes Jennifer Lopez, Luis Fonsi",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/celebs-come-together-in-new-song-for-puerto-rico/2498589/"
}