{
    "authors": [
        "Max Golembo"
    ],
    "date_download": "2018-07-04 16:07:38+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 14:35:14",
    "description": "Wildfires in the West continue to be fed by warm, dry conditions.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fdangerously-hot-weather-in-place-for-much-of-country-on-fourth-of-july%2F3703910%2F.json",
    "image_url": "https://s.abcnews.com/images/US/west-fires-cali-ap-mo-20180704_hpMain_16x9_608.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "It's a hot holiday week for most of the nation -- with dangerous fire conditions in the West and a seemingly never-ending heat wave in the Northeast.There are 63 large wildfires burning across the nation with most of them in the Western states from Texas to California There is further bad news for the West, with some of the hottest temperatures of the year expected.Numerous heat watches and fire warnings have been issued in the West. Gusty winds up to 40 mph and relative humidity down to 5 percent is forecast for parts of the West for Wednesday and Thursday.As we head into Friday, temperatures will soar into the 100s even in Los Angeles.In the eastern U.S., especially for Midwest, the peak of the heat wave will be today.The heat index -- or what the temperature feels like -- from Kansas to Massachusetts on Wednesday will be blistering. It will be nearly 100 degrees in Minneapolis and over 100 in Cincinnati, where both cities are under excessive heat warnings.Humidity will make it feel like mid to upper 90s along the I-95 corridor. Washington, D.C., could be near 100 degrees again as they celebrate the nation's birth.But there is good news -- some much cooler and drier air is on the way for the eastern U.S.By Friday, Chicago will be down into the 70s and by Saturday that cool air will reach New York City, where temperatures will also slip into the 70s.",
    "source_domain": "abc7news.com",
    "title": "Dangerously hot weather in place for much of country on Fourth of July",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/dangerously-hot-weather-in-place-for-much-of-country-on-fourth-of-july/3703910/"
}