{
    "authors": [
        "Tara Fowler"
    ],
    "date_download": "2018-04-24 20:31:36+00:00",
    "date_modify": null,
    "date_publish": "2018-04-23 18:14:33",
    "description": "The 25-year-old Canadian man accused of mowing down pedestrians with a van in northern Toronto on Monday has been charged with first-degree murder and attempted murder.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fsuspect-in-deadly-toronto-van-attack-once-cited-2014-massacre-on-facebook%2F3382564%2F.json",
    "image_url": "http://a.abcnews.com/images/International/toronto-van-scene-01A-gty-jef-180423_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The 25-year-old Canadian man accused of mowing down pedestrians with a van in northern Toronto Monday had a limited presence on social media, including a single post on his Facebook account, which was taken down soon after Monday's attack.Alek Minassian's post referenced the 2014 rampage in Isla Vista, California , in which Elliot Rodger, 22, killed six people and wounded others near the University of California, Santa Barbara, before killing himself in his car.He has been charged with 10 counts of first-degree murder and 13 counts of attempted murder, and a 14th attempted murder charge is imminent, Toronto Police Service Homicide Det. Sgt. Graham Gibson said in a news conference this afternoon.Minassian, with a stone-faced expression and clad in a white jail jumpsuit, appeared in court this morning in Toronto, the capital city of the province of Ontario. He is scheduled to appear in court again May 10 via video link.Minassian was arrested and taken into custody Monday as the suspected driver in the van attack, which killed 10 people and injured 14 others, according to the Toronto Police Service. The victims are not expected to be identified for \"a number of days,\" Dr. Dirk Huyer, chief coroner for Ontario, said today, calling that task the \"number one priority.\"Some of the injured have left the hospital, but it is unclear how many, officials said.The Canadian Armed Forces (CAF) confirmed in a statement to ABC News that Minassian was a member for about two months last year, from Aug. 23 to Oct. 25. He didn't complete his recruit training and requested to be voluntarily released from the forces after 16 days of the training, according to the CAF.Neighbors of Minassian, who lived in the Toronto suburb of Richmond Hills, described him as very quiet and odd. They told ABC News they saw him in the neighborhood -- including one neighbor who said he regularly saw him jogging -- but had never spoken to him.At a news conference in Canada's capital this morning, Canadian Prime Minister Justin Trudeau provided no suspected motive for the attack but said investigators still \"have no reason to suspect that there is any national security element to this attack.\"\"Obviously, all Canadians continue and will continue to have questions about why this happened, what could possibly be the motives behind it,\" Trudeau told reporters in Ottawa. \"As was indicated last night by our public security minister, at this time we have no reason to suspect that there is any national security element to this attack, but obviously the investigations continue.\"Monday's attack began at Yonge Street and Finch Avenue in Toronto's bustling North York neighborhood, police said. The suspect then drove the white Ryder van south for nearly 1 1/2 miles, ramming into more pedestrians at Yonge Street and Sheppard Avenue. The battered vehicle finally stopped on Poyntz Avenue, just off Yonge Street.Minassian allegedly rented the truck on Monday morning from a Ryder truck rental facility just north of Toronto, Gibson said.Witness Ali Shaker saw the van jump the sidewalk and said people walking were \"crumbled up,\" he told Canada's CTV News \"He's just hitting people one by one, going down,\" Shaker said. \"It was a nightmare.\"Visibly frightened by what he saw, Shaker could barely recount the horror he witnessed. He said he was driving when the incident occurred.\"I'm so shaky -- I can't believe this is happening,\" he said. \"This is so unbelievable.\"Shaker initially assumed the driver was experiencing some kind of medical emergency, he said, and even attempted to try to stop the driver from causing more carnage.\"I thought he had a heart attack or something so I was trying to chase him on the way, almost trying to catch up,\" he told CTV News, adding that the driver was moving fast.\"He hit everybody on the sidewalk; anybody in his way he would hit,\" Shaker added. \"The bus stop -- all shattered. There was a lady in there I saw and I stopped and I looked and I went after and all I see is just crumbling one by one.\"Phil Zullo, who also witnessed the attack, told CTV News he saw \"shoes and hats flown everywhere.\"Another witness said he stopped outside of a building for a smoke break and saw a middle-aged man get struck as he was crossing the street.\"As I lit up my cigarette I saw a man walking in the middle of the intersection and a van plowed right into him,\" the witness, who went by Steve, told CTV News. \"I saw the guy go flying. ... It was just clear as day, just saw the guy get hit by the van and pieces of the van fell off.\"Afterward, Steve said he rushed into the middle of the street to tend to the injured man \"to make sure no other cars struck him.\"The victim, he said, was around 50, was unconscious \"and could barely move.\"The van kept driving and hit others, Steven added, leaving behind pools of blood.\"I saw three or four [people] on the ground around me,\" he said. \"Other people were getting CPR.\"He's convinced that stopping for the cigarette break saved him, Steve said.\"I had just stopped to light the cigarette and if I hadn't done that I would have been killed as well,\" he said. \"I would have been right there with that guy.\"Sunnybrook Health Sciences Centre in Toronto confirmed in a statement that it had received a total of 10 patients from Monday's incident. Two of them were pronounced dead upon arrival. Five others were in critical condition and three were in serious condition, the hospital said.Anne-Marie D'Amico was among those killed. Tennis Canada, the sport's governing body within Canada, confirmed that D'Amico had volunteered at its Rogers Cup professional tennis tournament since she was 12.D'Amico started out as a ball girl and was most recently serving as committee head of stadium control, in addition to her full-time job at U.S.-based investment management firm Invesco, according to a statement from Tennis Canada. She was voted Tennis Canada's volunteer of the year in 2016.\"Our thoughts and prayers are with Anne-Marie's family and with all those impacted by this tragic event,\" Gavin Ziv, vice president of professional events at Tennis Canada, said in a statement today. \"Anne-Marie lived for working at Rogers Cup and seeing her fellow volunteers each summer. The tournament was such a large part of her life and we were so lucky to have her on our team each summer. Her passion for Rogers Cup was contagious and we are honored to let the world know what an amazing person she was and the great things she did for others.\"Invesco did not immediately respond to ABC News' request for comment today.Images from the scene of Monday's attack showed multiple victims on the ground, while video showed the moment a single police officer confronted the suspect on the street.In the video, taken by an onlooker, the officer draws his firearm and stands off against the suspect, who appears to be pointing an object. The two exchange words, and the suspect eventually yields to the repeated calls to \"get down,\" allowing the officer to handcuff him.So far, there's no indication that Minassian was armed with a gun, police said. It's not clear what object he was holding.During this morning's press conference, Trudeau called the incident \"a senseless attack and a horrific tragedy.\" He told reporters he spoke with Ontario's premier and Toronto's mayor Monday night.Trudeau will go to Toronto \"as soon as it makes sense to do so,\" he said, but doesn't want to distract from the investigation for now.Toronto Mayor John Tory told reporters Monday afternoon that his \"thoughts are with those affected by this incident.\" He said the beautiful weather meant many people were out on the street.\"There were a lot of pedestrians out,\" Tory said, \"enjoying the sunny afternoon.\"Canadian Minister of Public Safety and Emergency Preparedness Ralph Goodale called the incident an attack but said he didn't want to speculate when asked whether the terrorism was to blame.\"We cannot come to any firm conclusions at this stage,\" Goodale told reporters Monday. \"The police are conducting their thorough investigation into what happened and why it happened.\"U.S. Secretary of Homeland Security Kirstjen Nielsen is in Toronto as part of the G-7 Security Ministerial, which is set to conclude today. A senior official with the U.S. Department of State told ABC News the U.S. delegation is safe.The White House released its first comment on the attack late-Monday night, saying, \"The United States stands with the Canadian people in the aftermath of today's tragic event in Toronto, where a van drove into a crowd of people killing several and injuring many more.\"\"Our thoughts and prayers go out to the families of those affected, and we wish a full recovery to those injured,\" the statement continued. \"The United States Government pledges to provide any support Canada may need.\"Ryder, the brand of rental truck involved in the incident, said in a statement it was saddened by \"this tragic event\" and extended its \"deepest sympathies\" to those impacted.The company also stated that it is \"cooperating fully with authorities.\"",
    "source_domain": "abc7news.com",
    "title": "Suspect in deadly Toronto van attack once cited 2014 massacre on Fa..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/suspect-in-deadly-toronto-van-attack-once-cited-2014-massacre-on-facebook/3382564/"
}