{
    "authors": [
        "Tiffany Wilson",
        "Cornell Barnard"
    ],
    "date_download": "2017-10-06 22:56:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 13:17:40",
    "description": "Festivities are in full force today for San Francisco Fleet Week with the Parade of Ships sailing under the Golden Gate Bridge and the Blue Angels roaring and soaring in the skies above.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fentertainment%2Fblue-angels-soar-above-sf-for-fleet-week%2F2498722%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2501083_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos Festivities are in full force today for San Francisco Fleet Week, with the Parade of Ships sailing under the Golden Gate Bridge.\nEMBED >More News Videos The Parade of Ships crossed the San Francisco Bay on Friday morning to kick off Fleet Week in San Francisco. Here's a look at some of the best moments\nEMBED >More News Videos Every year, Fleet Week comes to San Francisco. It's a celebration of naval tradition that honors the men and women serving in our armed forces.\nFleet Week activities are underway around San Francisco.The annual Parade of Ships set sail at 11 a.m. with a procession under the Golden Gate Bridge and along the waterfront. The air show, featuring the Blue Angels, takes place from noon until 4 p.m.Friday morning, 3-year-old Everette Wertman and his family visited the Humanitarian Village at Marina Green. The village showcases what the military can do in a disaster situation.Everette was excited to see the \"Army guys\" and planes overhead. His mom, Cristin, said, \"We think it's awesome, very cool, very patriotic and the kids love it.\" The village is free and open to the public all weekend long.It features a field hospital the public can tour and other displays that show the military's disaster relief capabilities. Lieutenant Rob Parker for the U.S. Navy said it's exciting to show off his work space.\"People are blown away.\" New this year, the village includes a STEM education center to showcase the engineering side of the military.John McKnight is in charge of the village. He expects 10,000 people to visit Friday and 30,000 to 50,000 more people to visit the village this weekend. He said they've increased security in light of the Las Vegas shooting. \"Nothing the public will notice, but just be assured we are keeping an eye out.\"",
    "source_domain": "abc7news.com",
    "title": "Blue Angels soar above SF for Fleet Week",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/entertainment/blue-angels-soar-above-sf-for-fleet-week/2498722/"
}