{
    "authors": [
        "David Louie"
    ],
    "date_download": "2017-10-07 01:57:06+00:00",
    "date_modify": null,
    "date_publish": "2017-10-07 01:29:04",
    "description": "Many of us assume that U.S. manufacturing is dead as companies shift production overseas. But in San Jose alone, there are 1,500 companies engaged in manufacturing, and they employ 65,000 people. However, there's a worker shortage.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fcareers%2Fsilicon-valley-manufacturing-jobs-hoping-to-recruit-younger-generations-%2F2501769%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/2501778_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "100’s of #SanJose students touring plants today to kindle interest in manufacturing jobs. @Jabil says there’s a worker shortage. #MFGDay17 pic.twitter.com/KR0AFk5NaG — David Louie (@abc7david) October 6, 2017\nMany of us assume that U.S. manufacturing is dead as companies shift production overseas. But in San Jose alone, there are 1,500 companies engaged in manufacturing, and they employ 65,000 people. However, there's a worker shortage.Plants across Silicon Valley invited students in to get them to consider manufacturing for a career.High tech manufacturing is no longer manual labor. 3D printing and robotics have increased speed and precision but not the need for workers.There is a deficit of workers to fill manufacturing jobs.\"That's largely attributable to folks that are starting to leave the workforce as they start to age out. We have a lot of baby boomers that are still in manufacturing here,\" said Donovan Lazaro, with the San Jose Economic Development office.Students were invited into Jabil's Blue Sky Innovation Center this week to kindle their interest in manufacturing.The group consists of 8th graders in the Adventure STEM program at Herman Intermediate School in San Jose. A total of 850 students visited 14 companies.Many are still years from entering the workforce, but employers say Silicon Valley is moving away from using off-shore manufacturing.\"With digital manufacturing technologies, manufacturing's going to be producing things in markets where customers are consuming it, rather than today where it's manufactured in one part of the world and shipped all the way across the world to customers,\" said John Dulchinos, The Vice President of Jabil Digital Manufacturing.The students learned about the supply chain and how much work goes into the sourcing of raw materials, design, and logistics.\"I've learned that manufacturing has many steps that they've gone through like from planning out what they want to do, then they do it. If there's anything wrong, they modify it,\" said Victor Nguyen, a student in the Adventure STEM program.\"For engineering, there is one major process that everyone uses, but there are multiple ways to determine it, so multiple people see the same thing in different eyes,\" said Ashley Brotherston, a student in the Adventure STEM program.If they do choose manufacturing, some will be able to learn the skills with a high school education while others will need a degree.",
    "source_domain": "abc7news.com",
    "title": "Silicon Valley manufacturing jobs hoping to recruit younger generations",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/careers/silicon-valley-manufacturing-jobs-hoping-to-recruit-younger-generations-/2501769/"
}