{
    "authors": [
        "Bay City News"
    ],
    "date_download": "2017-08-14 21:38:37+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 20:42:00",
    "description": "A Top Dog restaurant employee who allegedly attended a white nationalist rally Friday in Charlottesville, Virginia, resigned from the restaurant Saturday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Ftop-dog-employee-resigns-after-apparently-participating-in-white-nationalist-rally%2F2307478%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2307545_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "JUST IN: Man called out on social media for involvement in Charlottesville rally resigned, was not fired per Top Dog pic.twitter.com/TFrJIbHlko — Melanie Woodrow (@MelanieWoodrow) August 14, 2017\nA Berkeley restaurant employee who allegedly attended a white nationalist rally Friday in Charlottesville, Virginia, resigned from the restaurant Saturday, restaurant officials said.Cole White resigned from Top Dog, a business with two locations in Berkeley and one in Oakland, after social media posts from the Twitter account YesYoureRacist and others identified him as a participant of the \"Unite the Right\" rally.Following the resignation, Berkeley police received information about a credible threat made against the business, Sgt. Andrew Frankel said.Police kept their eye on Top Dog's three locations overnight and officers will be making extra patrols Monday when they can, Frankel said.Top Dog, which has been in business since 1966, said in a statement that on Saturday \"we spoke with Cole White. During that conversation Cole chose to voluntarily resign his employment with Top Dog and we accepted his resignation.\"The company said, \"There have been reports that he was terminated. Those reports are false. There have been reports that Top Dog knowingly employs racists and promotes racist theology. That too is false.\"\"We pride ourselves on embracing and respecting all our differences and every individual's choice to do as that person wishes within the boundaries of the law,\" Top Dog officials said. \"We do respect our employees' right to their opinions. They are free to make their own choices but must accept the responsibilities of those choices.\"\"Individual freedom and voluntary exchange are core to the philosophy of Top Dog,\" the company said. \"We look forward to cooking the same great food for at least another 50 years.\"",
    "source_domain": "abc7news.com",
    "title": "Top Dog employee resigns after apparently participating in white nationalist rally in Charlottesville",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/top-dog-employee-resigns-after-apparently-participating-in-white-nationalist-rally/2307478/"
}