{
    "authors": [
        "Lisa Amin Gulezian"
    ],
    "date_download": "2017-02-15 08:49:10+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 06:44:36",
    "description": "Police are calling Wardell Taliaferro a victim of road rage after he was gunned down in front of his family. They remember him fondly in the wake of the tragedy.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fhe-was-a-big-old-teddy-bear-family-of-road-rage-victim-speaks-out%2F1755472%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755491_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A father was gunned down right in front of his family. Police are calling him a victim of road rage. Police have very few leads, so the victim's family is making an emotional plea.\"He was a big old teddy bear,\" said Leilani Millard of her husband Wardell Taliaferro. She only has a few pictures of him. They were focused on growing their family. Their son Luke is just three months old.\"As for a husband, provider, family, brother, definitely it--he loved everybody,\" Millard said.On Sunday the couple, their baby and five-year-old were driving to a friend's house along Marina Boulevard near Verna Court when something happened between Taliaferro and another driver.\"As they were driving they were swerving out of each other's lanes,\" said Wardell's brother Joe Toro. \"Exchanging words and when came to a stop, before you know it they pulled out a gun.\"The 45-year-old was shot in the head. His wife jumped into the driver's seat and drove the car to a nearby Kaiser, but Wardell was already dead.\"I couldn't believe it,\" said friend Rose Thompson. \"It's surreal.\"No one can believe it. Taliaferro's family is one that sees one another daily.While their mother kept them all connected, Taliaferro kept them smiling.\"He always made sure we always laughed,\" said his niece Carla Bonds. \"He always made light of any situation.\"This situation, however; is one no one ever expected.",
    "source_domain": "abc7news.com",
    "title": "'He was a big old teddy bear,' family of road rage victim speaks out",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/he-was-a-big-old-teddy-bear-family-of-road-rage-victim-speaks-out/1755472/"
}