{
    "authors": [
        "Carolyn Tyler"
    ],
    "date_download": "2017-08-15 02:10:24+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 01:32:32",
    "description": "The San Francisco Fire Department said a final farewell to one of their own on Monday in a memorial services held today for 90-year-old Earl Gage. He was the city's first African-American firefighter.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fsffd-honors-passing-of-citys-first-african-american-firefighter%2F2308501%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/2308129_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos The San Francisco Fire Department said a final farewell to one of their own on Monday in a memorial services held today for 90-year-old Earl Gage. He was the city's first African-American firefighter.\nThe San Francisco Fire Department said a final farewell to one of their own on Monday in a memorial services held today for 90-year-old Earl Gage. He was the city's first African-American firefighter.Gage became the first African-American firefighter in 1955 when he was 28 years old.The department is said to be the most diverse in the nation, but Gage was the only black person for 12 years, enduring death threats and racism.\"Not only do you have to fight the fire, but you have to fight the people that you're with. I can only imagine going to as many fires as they did back then and feeling that way all the time,\" explained SFFD Captain Sherman Tillman.Fire Chief Joanne Hayes-White says she benefited from the road paved by Gage. He integrated the formerly all-male and all-white department, and later, as the director of community services, pushed hard to open the doors for others to follow.\"As diverse as San Francisco is, when you have someone responding to an emergency that can speak your language or looks like you, and provides that much more of a calming presence, it's very important to reflect the community we're serving,\" she said.Gage was described as dedicated to his job and a devoted family man.\"He was very much a proud man, proud of where he came from and wanted to make sure he left a lasting impact,\" said Gage's daughter.",
    "source_domain": "abc7news.com",
    "title": "SFFD honors passing of city's first African American firefighter",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/sffd-honors-passing-of-citys-first-african-american-firefighter/2308501/"
}