{
    "authors": [
        "David Louie"
    ],
    "date_download": "2018-04-24 22:14:38+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 20:57:19",
    "description": "Jennifer Malandra has eight years' active service in the Navy and a Naval Academy education. Grant Keaton separated from the Air Force two weeks ago after nine years of active service and four years studying at the Air Force Academy. Both are in search",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftechnology%2Fspecial-program-targets-vets-for-ai-drone-jobs%2F3387325%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/3387519_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Jennifer Malandra has eight years' active service in the Navy and a Naval Academy education. Grant Keaton separated from the Air Force two weeks ago after nine years of active service and four years studying at the Air Force Academy. Both are in search of civilian jobs in the highly competitive tech industry. They and 23 others are wrapping up a 10-day program run by BreakLine, an educational program sponsored by a who's who of Silicon Valley companies in search of bright candidates.The focus today was artificial intelligence and drones. Both specialties are creating jobs as a result of automation and robotics. The group was visiting Kespry, a Menlo Park drone company that has hired six veterans from the BreakLine program with service in the Army, Marines and Navy. Its drones operate autonomously for specialized applications in the mining, construction and insurance industries.Garrett Smith, a former Marine intelligence officer, demonstrated one of the Kespry drones to the BreakLine veterans on this sunny Tuesday. He says the military has been experimenting with and using drones for decades, so veterans have valuable skills that transfer well to civilian drone and AI jobs. BreakLine says the majority of its program participants get hired in the tech sector with starting pay around $140,000, which is comparable to starting salaries for recent MBA graduates.The BreakLine program has teaches organizational and leadership skills needed to excel in the tech sector. Smith, Kespry's head of business development, said veterans come with a mission-oriented background, know it takes hustle and a 24/7 commitment to get the job done, and understand the nature and value of teamwork.",
    "source_domain": "abc7news.com",
    "title": "Special program targeting vets for artificial intelligence, drone operator jobs",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/technology/special-program-targets-vets-for-ai-drone-jobs/3387325/"
}