{
    "authors": [
        "Jordyn Phelps"
    ],
    "date_download": "2018-04-25 01:39:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 16:04:14",
    "description": "The White House will be hosting the French president on Tuesday.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fpresident-trump-first-lady-host-1st-state-dinner-%2F3386449%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/state-dinner-2-sh-er-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump and first lady Melania Trump hosted their first state dinner Tuesday evening in honor of French President Emmanuel Macron.The first couple greeted Macron and his wife on the steps of the White House North Portico, with the couples exchanging a round of cheek kisses before posing for photos. While President Trump wore a tuxedo, first lady Melania Trump donned a full-length black Chantilly lace Chanel Haute Couture gown, hand painted with silver and embroidered with crystal and sequins, according to her spokeswoman.Joining the main guests of honor, Macron and his wife, Brigitte Macron, is an exclusive list of 130 guests, who will be seated across 13 candlelit tables of 10 in the State Dining Room. Among the attendees are Apple CEO Tim Cook, who brought as his guest former Obama EPA Administrator Lisa Jackson, statesman Henry Kissinger, Chief Justice John Roberts, media mogul Rubert Murdoch, managing director of the IMF Christine Lagarde, two Olympic gold medalists, Bernard Arnault, chairman of LVMH group which owns Louis Vuitton, Fendi and Dior, and the president's daughter and son-in-law Ivanka Trump and Jared Kushner.Presidents Trump and Macron toasted to their friendship and the broader alliance between France and U.S. at the dinner.\"May our friendship grow even deeper, may our kinship grow even stronger, and may our sacred liberty never die,\" said President Trump, who declared the evening a celebration \"of the nearly two-and-a-half centuries of friendship between two countries.\"President Macron, in turn, echoed the warm sentiment expressed by President Trump and made a joke at Great Britain's expense in noting the deep ties between the U.S. and France.\"This White House so full of history, that the British burned down in 1815, and I say this in the most amicable way, and that James Monroe then had the brilliant idea of decorating in French furniture, a man of taste, in fact, he was a former ambassador to Paris,\" President Macron said. Melania Trump has personally overseen the planning for the evening, which has been decorated in a crme and gold color scheme and draws from American and French influences. Twelve hundred branches of cherry blossom, 2,500 stems of white sweet peas and nearly 1,000 stems of white lilac adorn the White House, while the Washington National Opera is providing musical entertainment for the evening. Dinner will be served in the formal State Dining Room on settings of Clinton and Bush china, as well as silver from the White House collection, from Tiffany & Co., and S. Kirk & Sons.The menu has been planned to \"showcase of the best of America's cuisines and traditions, with nuances of French influences,\" according to the White House, and will be prepared by White House executive chef Christeta Comerford.The first course is a salad of greens from the White House kitchen garden and will feature a goat cheese gateau, tomato jam and biscuit crumbles. The main course will be a rack of lamb and jambalaya. For dessert, there's a nectarine tart and ice cream.Wines for the evening were carefully selected for the evening to both \"complement the menu and embody the historic friendship between the United States and France.\"The dinner capped a larger itinerary of ceremonial events in Macron's honor on Tuesday. Macron was welcomed to the White House this morning with a traditional military arrival ceremony involving 500 members of the military, and complete with a 21-gun salute, cannon-firings and patriotic music.",
    "source_domain": "abc7news.com",
    "title": "President Trump, first lady host 1st state dinner",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/president-trump-first-lady-host-1st-state-dinner-/3386449/"
}