{
    "authors": [
        "Bill Hutchinson"
    ],
    "date_download": "2018-07-04 12:42:37+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 00:09:38",
    "description": "Experts in cave diving say a plan floated to extract 12 boys and their soccer coach from a cave in Thailand by teaching them to scuba dive may not be the best option.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fexperts-cast-doubt-on-plan-to-have-trapped-soccer-team-scuba-dive-out-of-cave%2F3700251%2F.json",
    "image_url": "http://a.abcnews.com/images/Video/thai-rescue-cave2-roku-gty-mem-180628_hpMain_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Experts in cave diving say a plan floated to extract 12 boys and their soccer coach from a cave in Thailand by teaching them on the fly to scuba dive through treacherous floodwaters may not be the best option.\"Cave diving is a very technical skill and it's extremely dangerous, especially for an untrained diver,\" Anmar Mirza, coordinator of the U.S. National Cave Rescue Commission, told ABC News. \"So they may end up being better off trying to supply them in the cave until they can be gotten out by other means.\"The British divers who found the boys and their coach on Monday described extremely challenging hazards in the cave -- even to them.\"They are cave divers with experience of diving in very flooded caves all over the world and some rescue operations as well,\" Bill Whitehouse, the vice chairman of the British Cave Rescue Council, told ABC News of the divers who found the boys, John Volanthen and Richard Stanton. \"They had skills to go in through the flooded passages and lay a guideline for others to follow and clear obstructions to allow people to get through. So, they were the pathfinders.\"Volanthen and Stanton, who are members of the British Cave Council, described passageways so narrow they had to squirm through them. They also described to colleagues long stretches of flooded areas in the cave. One flooded area they said was about 5,000 feet long and half of it had no airspace to emerge to if something went wrong underwater.\"It's not like open water diving where you can just surface if something goes wrong,\" Whitehouse said. \"If you have gone 200 meters down a flooded cave passing if anything wrong you have to come out that 200 meters before you can put your head up above water.\"Divers also had to pull themselves along with rope against powerful currents in the cave's water. The visibility was so poor that one rescuer described it as swimming through coffee.The boys, ranging in age from 11 to 16, and their 25-year-old coach got lost in the Tham Luang cave in northern Thailand after they entered for an excursion on June 23 and became trapped when monsoon rains flooded the cave and cut off their exit route, officials said.The group forged ahead about 2 miles into the cave before finding the raised, dry chamber where they were found after a massive 10-day search by rescuers.While they were in relatively good shape, some of them complained of being weak from stress and lack of food while others suffered from minor injuries.None of them have experience in scuba diving let alone cave diving.\"The risks to those children coming out is that they don't have that experience and I gather that some of them, if not all of them, aren't even swimmers,\" Whitehouse told ABC News.A rainstorm forecast for Wednesday in northern Thailand could add to the challenges of getting the boys out of the cave quickly.\"When the weather deteriorates, the cave might flood again to the extent that diving might not be possible and they could be cut off for a considerable length of time,\" Whitehouse said.Officials cautioned Tuesday that the rescue could take \"weeks or months\" before the once-wayward group is removed from the cave.Whitehouse said there is a chance that areas rescue divers found dry before may not be if the cave floods again.\"The choice is to try and take the risk that the cave won't fill completely and give them supplies to sit it out where they were until the water drains out for them to be able to walk out in two or three months,\" Whitestone said.",
    "source_domain": "abc7news.com",
    "title": "Experts cast doubt on plan to have trapped soccer team scuba dive o..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/experts-cast-doubt-on-plan-to-have-trapped-soccer-team-scuba-dive-out-of-cave/3700251/"
}