{
    "authors": [],
    "date_download": "2017-01-02 22:16:29+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 21:43:09",
    "description": "At least 60 inmates died during a prison riot in the northern state of Amazonas, including several who were beheaded or dismembered, in the biggest killing at a Brazilian prison since 1992.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fbrazil-prison-riot-leaves-at-least-60-dead%2F1682759%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/wls/images/cms/automation/images/1682660_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "At least 60 inmates died during a prison riot in the northern state of Amazonas, including several who were beheaded or dismembered, in the biggest killing at a Brazilian prison since 1992.Amazonas State Public Security Secretary Sergio Fontes said that in addition to the deaths, some inmates escaped, but he did not say how many. He added that 40 had been recaptured.Twelve prison guards were held hostage by the inmates, though none was wounded.\"This is the biggest prison massacre in our state's history,\" Fontes said during a press conference. The riot at the Anisio Jobim Penitentiary Complex began Sunday afternoon and lasted until Monday morning.It was the largest death toll during a Brazilian prison riot since the killing of 111 inmates by police officers in the Carandiru Penitentiary in Sao Paulo in 1992. Police said they acted in self-defense then.Fontes confirmed that many of the dead had been beheaded and Judge Luis Carlos Valois, who negotiated the end of the riot with inmates, said he saw many bodies that were quartered.\"I never saw anything like that in my life. All those bodies, the blood,\" Valois wrote on Facebook.Authorities said the riot apparently grew out of a fight between two of the country's biggest crime gangs of the country over control of several prisons. Fontes said the inmates made few demands to end the riot, which hints at a killing spree organized by members of a local gang, the Family of the North, against those of the First Command of the Capital that is based in Sao Paulo.The secretary said that officers found a hole in a prison wall through which weapons entered the building. Several firearms were found in the post-riot search by police.The First Command, nationally known as PCC, is the most powerful drug and prison gang in Brazil and it has been trying to extend its reach to northern prisons dominated by the Family of the North.Valois said that during the negotiations, inmates only asked \"that we did not transfer them, made sure they were not attacked and kept their visitation.\"The riot ended after the inmates freed the last of the 12 prison staffers they had held hostage, Valois said.In another prison in Amazonas, 87 inmates escaped in the first hours of Monday, Fonte said.One of the inmates posted a picture on Facebook as he left the prison.Amazonas police are investigating whether there is a link between the riot and the escape.",
    "source_domain": "abc7news.com",
    "title": "Brazil's Anisio Jobim Penitentiary Complex riot leaves at least 60 dead, many beheaded or dismembered",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/brazil-prison-riot-leaves-at-least-60-dead/1682759/"
}