{
    "authors": [
        "Laura Anthony"
    ],
    "date_download": "2017-02-15 01:16:15+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:51:08",
    "description": "Residents were returning home after officials lifted evacuation orders near the Oroville Dam Tuesday afternoon.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Foroville-residents-return-home-after-evacuation-order-lifted%2F1755067%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1755066_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos Nearly 200,000 people are still under mandatory evacuation orders Monday night over fear the Oroville Dam emergency spillway could fail.\nResidents were returning home after officials lifted evacuation orders near the Oroville Dam Tuesday afternoon.Water officials say they've drained enough of the lake behind the dam so the emergency spillway would not be needed.That spillway has also been fortified against future erosion. Still, officials say they're remaining vigilant.\"Absolutely constant assessment and reassessment to make sure we're aware and prepared for any potential changes,\"The region, north of Sacramento remains under an evacuation warning in the event the situation changes.Residents of those evacuated areas began heading for home as soon as they heard the order had been lifted.\"It's so good to be back,\" Jenel Wilson said.Wilson and her family were among the first to arrive back home in Oroville after the mandatory evacuation order was lifted.\"It's just been a roller coaster,\" Oroville resident Jolene Wilson said.The extended family of seven and their dogs had stayed in a hotel for two nights, and were trying to find a longer-term solution at the evacuation center in Chico when they learned the order was about to be lifted.So, they packed up and headed out, driving south from the evacuation center trying to get on the road ahead of the crowd.As they arrived home the many cats that live in their mobile home park were there to greet them and enjoy a long-awaited meal.Back at the Silver Dollar Fairgrounds in Chico, hundreds of people had been trying to make the best of a difficult situation.Many locals were there too, doing their best to make the evacuees feel comfortable and welcome, including Mary Clegg who stopped by to hand out valentines to all the children.\"They need to know they're loved,\" Clegg said.",
    "source_domain": "abc7news.com",
    "title": "Oroville residents return home after evacuation orders for dam spillway erosion lifted",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/oroville-residents-return-home-after-evacuation-order-lifted/1755067/"
}