{
    "authors": [],
    "date_download": "2017-02-14 23:46:11+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 19:24:11",
    "description": "From wineries to breweries, Santa Rosa the perfect weekend getaway.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fbay-area-life-plan-the-perfect-getaway-to-santa-rosa%2F1754442%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1754514_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Hand-crafted beer, a wine infused sculpture gallery, a belly full of inspired eats, a Safari adventure fit for any animal lover's dream, and all in one beautiful spot, Welcome to Santa Rosa, California.Santa Rosa is located just 50 miles north of San Francisco, and just a few hours from most Bay Area Locations. It is the perfect weekend getaway to find whatever you're looking for. Santa Rosa offers a variety of accommodation options from luxury hotels to motels, to beautiful bed and breakfasts. Visitors are sure to find the perfect place to fit their needs in Santa Rosa.Once settled in Santa Rosa, this incredible weekend destination provides plenty for visitors to do and see. Santa Rosa is blessed to be home to dozens of gorgeous wineries and breweries. Visitors will find something unique and delicious to quench any thirst. Many of these libation destinations offer guests even more than just delicious food and drinks. There are brewery tours, and wine tasting to be had. At Paradise Ridge Winery guests can enjoy a rotating art collection featuring large scale sculptures throughout the property in addition to their delicious wines. Another local favorite Plow Brewing Company offers visitors beer selections from both brew master Kevin Robinson's Plow brewing collection on tap and some selections from the Divine Brewing Company's collection on a limited basis in bottles as well.In addition to some incredible wine and beer offerings, Santa Rosa offers some serious selections for the foodies delight. From vegan, to Peruvian, to southern food the variety available to Santa Rosa diners is sure to impress. Many restaurants feature locally sourced and organic options, and of course several local wines and beers to pair. Belly Left Coast Kitchen and Taproom features both food and beverage options almost exclusively from the five pacific states. Chef Gray Rollin utilizes these fresh ingredients and his international culinary experience to create a unique and inspired array of menu selections. Even offering happy hour Monday-Friday's.Aside from the multitude of food and beverage options there is more than enough to do throughout Santa Rosa to keep visitors pre-occupied for a weekend getaway and then some. Santa Rosa is centrally located and offers a variety of outdoor activities. Armstrong Redwoods is a beautiful state preserve of 800 acres of coastal redwoods and only a 45 minute drive from Santa Rosa. And beautiful Bodega Bay offers guests Pacific Coast beaches, fresh seafood, and even whale watching excursions. For an incredible adventure right in Santa Rosa visitors can head on a Safari adventure through Safari West. Safari West is a 400 acre wildlife preserve specializing in species native to Africa. Guests can see over 90 different species of both mammals and birds. Safari West offers visitors a unique, once in a lifetime 'African' safari right in beautiful Sonoma County. Guests can even choose to stay overnight in one of their luxury tent accommodations and be lulled to sleep by the sweet sounds of the Savannah. Whatever it is that gets you excited, Santa Rosa is sure to deliver.for more information.3115 Porter Creek RoadSanta Rosa, CA 95404Phone: (800) 616-2695; (707) 579-2551for more information.Since our founding in 1993, Safari West has been one of the premier wildlife destinations in the United States. Between our expansive wildlife collection and the natural beauty of the woods and rolling hills of Sonoma County, Safari West truly is the closest you can come to Africa without going there. Guests visiting Safari West discover a 400-acre wilderness begging to be explored. With over 900 animals representing 90 different species roaming across some of the largest enclosures in the country, there's a lot to see and do- an truly unique opportunity for a great experience.For over twenty years, Safari West has existed as a place for people to meet the wonder of the wild face-to-face. We have introduced animals large and small to generations of visiting guests, all with the goal of igniting wonder, curiosity, and hopefully, compassion. Our mission is to inspire wildlife advocates who will help us protect and preserve these beautiful and often endangered creatures.Safari West welcomes visitors every day in our ongoing pursuit of this mission. Our dedication to conservation, environmental education, stewardship, and individual responsibility shows in our many ongoing projects and programs. We invite you to join us in this worthy pursuit.What you can do at Safari West:Pretend you're in Africa...hear the sounds of the Sonoma SerengetiSpend the night in a luxury 'glamping' safari tentExplore and go on safari in an authentic African safari vehicleWinos and Rhinos - Embark on private VIP and/or wine tasting safaris tailored to your adventure experienceBrews and Buffalo -beer tasting on the Sonoma Serengeti!Private Royal Safaris - Twilight Serengeti; Dinner on Tree Top Aviary and Cheetah and ChardonnayDine out...way out....in our Savannah Grill and taste quality wines and beer of Napa/Sonoma as well as South AfricaEnjoy a private and close-up encounter with animals, possible new babies and behind the scene activities with our keepersLearn about conservation and wildlife preservation featuring the diversity in AfricaObserve animals, enjoy birding and possible nature walks and with Safari West staffIndulge in our Swedish pressure-point massage servicesPhotography - the most photo opportunities short of getting on a plane and flying to Africa3334 Industrial Drive, Santa Rosa, CA, 95403(707) 843-4583Plow Brewing Company is a rustic brewery where simplicity is king and complex flavors rule. They accomplish this by refusing to use extracts, natural flavorings, finings, style guidelines, or any other corporate contrivance. Their tap room is open daily and our beers are available at your favorite Saloon or Eatery.In 1961 Walter Byck married Marijke Hoenselaars in Holland. Little did the newlyweds know that together they would discover and build a wine estate in the heart of the world's finest grape growing region, Russian River Valley, Sonoma County.A deep love of wine combined with an appreciation for the incredible region they now called home, inspired them to cultivate vineyards. In the first year, Sauvignon Blanc was planted followed by Chardonnay. Recognizing the quality of these estate vineyards, the family was encouraged to start their own winery. After five years of planning, the dream of Paradise Ridge became a reality. Opened in May of 1994, Paradise Ridge is a haven where guests bring their friends, savor vineyard-designated wines, and take in magnificent wine country views.Their unique California-style tasting room was designed to complement the beauty of the surrounding nature. Visitors are welcomed by a European styled courtyard and expansive verandas. Guests enjoy breathtaking views of the vineyards, the Russian River Valley, and the two-story High LOVE sculpture from the distinctive indoor-outdoor tasting bar. The serene atmosphere is also the ideal setting to hold celebrations, and for joyful brides and grooms to exchange wedding vows. During summer months, visitors enjoy 'Pizza in Paradise' with handmade Pizza using local ingredients fired in our outdoor pizza oven, to pair perfectly with Paradise Ridge wines.523 4th St, Santa Rosa, CA 9540(707) 526-5787By \"Left Coast\", we are emphasizing our dedication of focusing the menu, and a majority of our beer & wines, towards the five Pacific states: Alaska, Washington, Oregon, California, and Hawaii. We utilize seasonal products to continually rotate specials, in addition to enhancing some of our more regular staples. We resource our product from local purveyors, as much as we are able to, and additionally from resources all along the West Coast.Chef Gray Rollin is renowned for his wide variety of experiences and culinary creativity. Since 2008, he has served as a celebrity Tour Chef for many well-known performers, including Motley Cure, KISS, Black Eyed Peas, Sarah McLachlan, the Rockettes, Katy Perry, Blink 182, Godsmack,and Tori Amos. Since the summer of 2011 Chef Gray has traveled exclusively with Linkin Park to more than 40 countries with tours to Asia, Europe, South America, Africa, Australia, New Zealand, Mexico and more.He attended the California Culinary Academy in San Francisco graduating with an A.O.S. degree in Le Cordon Bleu Culinary Arts. Upon graduation, Chef Gray became Sous Chef at I'O Restaurant in Lahaina, Maui. At I'O he was mentored by Chef James McDonald and learned the art of Pacific-fusion cooking. After three years in Maui, Chef Gray moved to Washington D.C. to open Nage, an \"east-coast\" eatery. There he created seasonal menus often with a strong Pacific-fusion influence. The reviews in D.C. were remarkable, including...\"The chef from Hawaii is magical\"...and... \"'The Crabby Catch' as Chef Gray called it, is a staple from his days in Hawaii and punches up the flavor.\" The Washington Post said...\"Get into the swim before the swells do.\" And, the Georgetowner called his food... \"Shamefully delicious, edible concoctions.\"Chef Gray attended the Chaing Mai Thai Cookery School in Thailand. He is the winner of five local iron chef competitions, including two at the CCA and two at the Maui Iron Chef competition. His food has been featured on the cover of Maui Menu magazine and he participated in a nine-episode TV show in Hawaii. He has volunteered with the D.C. Food Fight Fundraiser in D.C. and with Loaves and Fishes in Richmond, CA.",
    "source_domain": "abc7news.com",
    "title": "Bay Area LIFE: Plan the perfect getaway to Santa Rosa",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/bay-area-life-plan-the-perfect-getaway-to-santa-rosa/1754442/"
}