{
    "authors": [],
    "date_download": "2017-08-14 20:07:22+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 19:18:04",
    "description": "The attorney for a teenage driver accused of causing a fatal crash while livestreaming on Instagram says a mechanical problem may have caused the accident in Central California.",
    "filename": "http%3A%2F%2Fabc7news.com%2Flawyer-of-teen-who-livestreamed-deadly-crash-says-blown-tire-caused-wreck%2F2307261%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kabc/images/cms/2306392_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The attorney for a teenage driver accused of causing a fatal crash while livestreaming on Instagram says a mechanical problem may have caused the accident in Central California.Ramnik Samrao, the court-appointed lawyer for Obdulia Sanchez, told a judge that he has reason to believe wear and tear on a tire caused it to blow.Sanchez was driving a car that veered onto the shoulder on the outskirts of Los Banos in central California on July 21. Authorities said she overcorrected, causing the vehicle to swerve and overturn into a field, ejecting and killing her 14-year-old sister, Jacqueline.Prosecutors said Sanchez was live-streaming on Instagram while driving and that the video, which includes images of the 18-year-old taking her hands from the steering wheel, will be a key piece of evidence in the case.Sanchez also recorded herself standing over her sister's body, saying she was sorry.\"This is the last thing I wanted to happen, OK? ... Rest in peace, sweetie,\" the teen says. \"If you don't survive, I'm so (expletive) sorry.\"Police said medical records from the hospital where the teen was treated show she was legally drunk.",
    "source_domain": "abc7news.com",
    "title": "Lawyer of teen who livestreamed deadly crash says blown tire caused wreck",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/lawyer-of-teen-who-livestreamed-deadly-crash-says-blown-tire-caused-wreck/2307261/"
}