{
    "authors": [],
    "date_download": "2018-03-20 03:59:34+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 23:03:39",
    "description": "The coffee roaster was chosen after conducting a video interview at the tech giant's headquarters.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235629%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3235628_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "For more than three decades, Henry's House of Coffee has been an Outer Sunset staple, with master roaster Henry Kalebjian at the helm, along with his son Hrag, who has managed the space with him for the last five years.In addition to learning the fine art of crafting dark roast and Armenian-style coffee, being designated a San Francisco legacy business and supporting the Children of Armenia Fund , the business was recently tapped to join Facebook's 2018 US Small Business Council The social media giant offers \"resources and education\" to more than 60 small businesses. In return, the entrepreneurs help the platform improve their \"tools and solutions.\"Via phone, Hrag Kalebjian said his invitation to Facebook headquarters in Menlo Park \"was an opportunity to learn about how Facebook works and to meet other small vendors there,\" he said.While on the campus, organizers conducted video interviews with small business representatives and asked them to provide advice for their counterparts who might be struggling to get a small business off the ground.Facebook then selected several winners from the video interviews--including the younger Kalebjian--and invited the group back at a later date to meet with advertising specialists who support small businesses that use Facebook.\"Unbeknownst to me,\" Kalebjian said, \"they were building a small business council with twelve, hand-selected small businesses to be leaders in their communities. They were not only looking at people that run good businesses, but those that are also bridging communities together.\"Part of the goal, he added, is learning how to connect small businesses that use facebook to create real-world communities of independent entrepreneurs.\"I had the rare opportunity to spend a few days at the headquarters and through this program, I will continue to learn from Facebook and they'll be learning from me--all as part of the mission to grow my business,\" he said.The businesses come from all over the country and will provide constructive feedback on some of the social media giant's newest products and initiatives, though Kalebjian said he isn't allowed to speak about them just yet.Now, he has \"some tips and tricks for finding success on Facebook\" that he aims to share with other small business owners.\"I'm now part of an elite group were we share best practices and have access to a lot of Facebook managers and their network. I have the expertise to help people grow so as communities evolve, the whole ecosystem benefits. I wish to share that,\" said Kalebijian. \"I have a platform for that now, especially in San Francisco.\"The Small Business Council meets yearly at Facebook to learn about \"a lot of things that are coming out and in the works, we have calls to head over to play with their product team, and we'll be constantly connected to Facebook to learn how to help others grow their business,\" he added.Kalebjian invited neighbors and other merchants to visit his cafe to try some of its responsibly-sourced coffees and learn more about growing a small business through social media.\"The biggest thing about being in the Sunset, because it's very much a bedroom community, is right off the bat to let people know where we are and what we're doing,\" he said.",
    "source_domain": "abc7news.com",
    "title": "'Henry's House Of Coffee' Named To Facebook's Small Business Council",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235629/"
}