{
    "authors": [],
    "date_download": "2018-03-20 03:38:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 23:03:53",
    "description": "DDG, the developer working to build a mixed-use building on Octavia Boulevard, also aims to make sidewalk improvements and add seating to the neighborhood.",
    "filename": "http%3A%2F%2Fabc7news.com%2Frealestate%2Fhayes-valley-developer-proposes-28-units-sidewalk-improvements%2F3235633%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3235632_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sidewalk improvements may be in the works near a proposed five-story, mixed-use building in Hayes Valley under development on one of the last remaining undeveloped parcels on Octavia Boulevard.The plans currently under consideration would demolish existing sidewalks along Octavia and on Page and Rose streets to add a sidewalk bulb-out that includes a seating on Octavia in front of a proposed residential development.Plans for Parcel T include 28 residential units that will be a mix of studio, one-, and two-bedroom apartments, along with 2,720 square feet of ground-floor retail space, according to the most recent documents filed with SF Planning.As proposed by DDG, the project would not include any off-street parking, other than 28 bicycle parking spots for residents, and four public bike spaces on the Page Street sidewalk.Details on the developer's website suggest it may be considering parking for private vehicles and car-sharing companies, however.Residents would also have access to a 2,160-square-foot roof deck. DDG also developed 8 Octavia just down the street, and 450 Hayes a few blocks away.As we reported last week , parcels R,S, and U on Octavia Boulevard will be developed into affordable housing by the Tenderloin Neighborhood Development Corporation Buildings supported by TNDC will include housing for transitional youth and on-site social services including a child care facility.These proposals to fill in the last empty spaces cleared when the Central Freeway was torn down are still in very early stages of development, but we will keep you posted as the plans get fleshed out.",
    "source_domain": "abc7news.com",
    "title": "Hayes Valley Developer Proposes 28 Units, Sidewalk Improvements",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/realestate/hayes-valley-developer-proposes-28-units-sidewalk-improvements/3235633/"
}