{
    "authors": [
        "Bay City News"
    ],
    "date_download": "2017-08-15 03:41:25+00:00",
    "date_modify": null,
    "date_publish": "2017-08-15 03:03:54",
    "description": "Drops of blood and a surveillance camera video led Sonoma County sheriff's deputies to a suspect of a gas station burglary in Sonoma Valley on Friday, a sheriff's sergeant said.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fblood-drops-surveillance-video-lead-to-burglary-arrest-in-sonoma-co%2F2308721%2F.json",
    "image_url": "http://cdn.abclocal.go.com/assets/news/kgo/images/logos/default_800x450.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Drops of blood and a surveillance camera video led Sonoma County sheriff's deputies to a suspect of a gas station burglary in Sonoma Valley on Friday, a sheriff's sergeant said.Deputies responded around 3 a.m. Friday to the Bonneau's at Grove 76 gas station at 19080 Arnold Drive in Boyes Hot Springs when the manager reported a glass break alarm, Sgt. Spencer Crum said.The manager, who was watching surveillance camera video of the business from his home, said a man in his 30s took a cash register from the gas station, Crum said.As deputies responded, the manager told the sheriff's dispatch center the suspect re-entered the gas station. Deputies arrived and chased the suspect, who fled from a broken window and ran about 30 feet before he was caught, Crum said.When deputies took the suspect, Maleek Sanchez, 21, of Sonoma, into custody, they noticed he was bleeding from small cuts on his hand and chin, Crum said.Deputies followed the blood drops to a blood-smeared cash register that was propped against a fence near the gas station and Sanchez's bike, Crum said.The manager arrived and showed deputies a video of Sanchez throwing a large cinder block through the gas station window, stealing the cash register, re-entering the store and trying to steal another register before deputies arrived, according to Crum.Sanchez was booked into Sonoma County Jail on suspicion of burglary, and he was released after posting $10,000 bail bond, Crum said.",
    "source_domain": "abc7news.com",
    "title": "Blood drops, surveillance video lead to burglary arrest in Sonoma County",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/blood-drops-surveillance-video-lead-to-burglary-arrest-in-sonoma-co/2308721/"
}