{
    "authors": [
        "Mariam Khan"
    ],
    "date_download": "2018-04-24 15:24:17+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 09:50:50",
    "description": "Ronny Jackson has served as Trump's White House physician.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fconfirmation-hearing-for-trump-va-secretary-nominee-postponed-after-questions-raised%2F3385405%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/admiral-ronny-jackson-rtr-jc-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Senate Veterans Affairs Committee has indefinitely postponed a confirmation hearing for Rear Adm. Ronny Jackson, President Donald Trump's nominee to be Veterans Affairs Secretary after questions were raised about his professional conduct as a military doctor.Jackson was scheduled to have a confirmation hearing Wednesday but the new concerns about his conduct threaten to delay, or possibly derail, his nomination to be secretary of the Department of Veterans Affairs, sources on Capitol Hill and at the White House tell ABC News.Chairman Sen. Johnny Isakson, a Georgia Republican, and ranking member Sen. Jon Tester, a Montana Democrat, issued a joint statement saying the postponement comes \"in light of new information presented to the committee. We take very seriously our constitutional duty to thoroughly and carefully vet each nominee sent to the Senate for confirmation. We will continue looking into these serious allegations and have requested additional information from the White House to enable the committee to conduct a full review.\"Isakson and Tester said they have sent a letter to President Trump requesting all information regarding any improper conduct pertaining to Rear Admiral Jackson's service in the White House Medical Unit and as physician to the president.When Tester was asked whether the White House should have informed the committee of the allegations before or when it submitted Jackson's name, he responded, \"I don't know what process they go through under vetting but it's our job to vet these candidates. We are doing that, once we come to a conclusion, whether he's fit to serve or not, then we'll move forward with the hearing.\"Jackson, who is currently President Donald Trump 's personal White House physician, has also faced questions about his limited management experience and overall qualification to head the second-largest agency in the federal government.Despite the new concerns, the White House publicly backed Jackson Wednesday morning.Deputy press secretary Hogan Gidley said in a statement, \"Admiral Jackson has been on the front lines of deadly combat and saved the lives of many others in service to this country. He's served as the physician to three Presidents-Republican and Democrat-and been praised by them all.\"Admiral Jackson's record of strong, decisive leadership is exactly what's needed at the VA to ensure our veterans receive the benefits they deserve,\" the statement said.\"I've been in leadership school for 23 years now, and I've been able to rise to the level of an admiral, a flag officer in the Navy. I didn't just stumble into that,\" Jackson said this month in an interview with his hometown newspaper, the Lubbock (Texas) Avalanche-Journal. \"I think I've got what it takes, and you know, I don't buy into that argument at all.\"Trump nominated Jackson last month after he fired his first VA secretary, David Shulkin, amid allegations Shulkin misused taxpayer funds and faced growing tension with other senior Trump staff.Veterans groups last month were cautious in their judgment after Jackson was nominated by Trump. The Veterans of Foreign Wars were just one group which was critical of the nomination and said it was unsure of Jackson's qualifications.\"The VFW will be closely monitoring the Senate confirmation process, because what Dr. Jackson's bio does not reflect is any experience working with the VA or with veterans, or managing any organization of size, much less one as multifaceted as the Department of Veterans Affairs,\" VFW Director of Communications Joe Davis said in a statement.The conservative group Concerned Veterans for America expressed more optimism, saying in a statement, \"We are hopeful that this change will end the recent distractions at the VA and put the focus back on advancing policy.\"",
    "source_domain": "abc7news.com",
    "title": "Confirmation hearing for Trump VA secretary nominee postponed after..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/confirmation-hearing-for-trump-va-secretary-nominee-postponed-after-questions-raised/3385405/"
}