{
    "authors": [
        "David Louie"
    ],
    "date_download": "2017-02-15 04:17:17+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 01:50:19",
    "description": "Crews are building a new dam at the Calaveras Reservoir in the event of a catastrophic failure since it sits right next to the Calaveras Fault.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fcrews-build-new-dam-at-calaveras-reservoir-%2F1755176%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/1755262_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A new dam is under construction in the East Bay with a different kind of spillway that will reduce the need for a major evacuation in the event of a catastrophic failure.The dam at Calaveras Reservoir near Sunol straddles Alameda and Santa Clara counties.There is no question that the Calaveras Reservoir is a beautiful sight, but it sits right next to the Calaveras Fault, which experts say could produce a 7.5-magnitude earthquake, that's why they're building new dam there and why they've already completed a new spillway, using modern techniques to avert disaster.Sky7 was over the spillway at the Calaveras Dam, which showed it looks much different right now. It's made of concrete, not Earth and rock like the one at Oroville Dam.The next phase of the $810 million project is a new dam for the Calaveras Reservoir, replacing the original Earth and rockfill dam, built 92 years ago.The San Francisco Public Utilities Commission owns the facility and says downstream residents shouldn't be too concerned by releases. \"Our spillway at Calaveras has operated on average about once every seven years, and there has not been downstream flooding as a result of those releases, nor would we expect downstream flooding in almost any release that's foreseeable,\" Capital Projects Director Dan Wade said.Calaveras Reservoir is part of the city's Hetch Hetchy system that captures water in the Sierra, delivering it to 2.6 million Bay Area customers.Thousands of Fremont residents would be in the path of a catastrophic breach. The water would flow into Calaveras Creek, then Alameda Creek, collecting additional runoff along the way.The creek passes through Fremont and drains into San Francisco Bay.If the water level ever exceeds capacity, there is one priority. \"The goal at that point is to save the dam and not to have the dam over topped, so the spillway is essentially there to protect the dam at that point,\" Wade said.A bottom drain is already at work, releasing rainfall from recent storms.The reservoir is being kept below 40 percent during construction. Calaveras stores about half of the Bay Area's Hetch Hetchy water supply, so its structural integrity is critical.The new dam will be finished in two years.",
    "source_domain": "abc7news.com",
    "title": "Crews build new dam at Calaveras Reservoir",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/crews-build-new-dam-at-calaveras-reservoir-/1755176/"
}