{
    "authors": [],
    "date_download": "2018-07-04 17:50:12+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 17:20:39",
    "description": "Police announced that 10 people have now been arrested in the deadly machete stabbing of an innocent teenager in the Bronx.",
    "filename": "http%3A%2F%2Fabc7news.com%2F2-more-arrests-in-bronx-attack-that-killed-innocent-teen-junior%2F3704667%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/wabc/images/cms/automation/vod/3701381_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "EMBED >More News Videos 15-year-old viciously murdered at Bronx bodega (1 of 3) Commissioner James O'Neill said he does not see any wrongdoing by two officers\nEMBED >More News Videos Joe Torres reports on the funeral services for Bronx teen Lesandro Guzman-Feliz.\nEMBED >More News Videos Josh Einiger reports on the latest arrests in the murder of a Bronx teen.\nEMBED >More News Videos 15-year-old viciously murdered at Bronx bodega (1 of 3) Commissioner James O'Neill said he does not see any wrongdoing by two officers\nPolice arrested two more suspects Tuesday in the deadly machete stabbing of an innocent teenager in the Bronx, bringing the total to ten.29-year-old Diego Suero of the Bronx, was charged with murder, manslaughter, gang assault, conspiracy, and criminal possession of a weapon in connection with the death of Lesandro Guzman-Feliz, affectionately known as Junior.Suero is also believed to be a member of the Trinitarios gang,The 10th suspect was arrested Tuesday night. 26-year-old Gabriel Ramirez Concepcion is charged with murder, manslaughter, gang assault and criminal possession of a weapon.The attack happened outside a bodega on East 183rd Street and Bathgate Avenue in the Tremont section just after 11:30 p.m. on June 20, in what authorities believe was a case of mistaken identity that left the entire community outraged.Guzman-Feliz was dragged outside and slashed and stabbed with a machete after police say the group of gang members mistook him for a rival. The teen, who had hopes of becoming an NYPD detective, tried to run to St. Barnabas Hospital a block away but collapsed on the sidewalk.Seven of the other eight suspects appeared in court Monday. Here are the identities of each suspect and the charges they are facing:--Kevin Alvarez, 19: Second-degree murder, manslaughter, gang assault and assault--Jose Muniz, 21, of Paterson: First- and second-degree murder, manslaughter, gang assault and assault with intent to cause serious injury with a weapon--Jose Taverez, 21, of the Bronx: Second-degree murder, manslaughter, gang assault and assault with intent to cause serious injury with a weapon--Manuel Rivera, 18, of the Bronx: Second-degree murder, manslaughter, gang assault and assault with intent to cause serious injury with a weapon, and criminal possession of a weapon--Daniel Fernandez, 21, of the Bronx: Second-degree murder, manslaughter, gang assault and assault with intent to cause serious injury with a weapon--Jonaiki Martinez-Estrella, 24, of Freeport: First- and second-degree murder, manslaughter, gang assault and assault with intent to cause serious injury with a weapon--Antonio Santiago-Hernandez, 24, of the Bronx: First- and second-degree murder, manslaughter, gang assault and assault with intent to cause serious injury with a weapon--Elvin Garcia, 23: First- and second-degree murder, manslaughter and criminal possession of weaponSources tell Eyewitness News that three of the eight men already charged in the murder have been placed in isolation at Rikers Island to protect them from the other inmates.Authorities identified Martinez-Estrella, who has a prior arrest for robbing and beating a 14-year-old with a golf club in 2016, as the one who sliced the victim's neck.\"This investigation is not over,\" NYPD Chief of Detectives Dermot Shea said. \"The brutal nature of this crime, we will leave literally no stone unturned.\"Authorities say the men are all members of the Trinitarios gang, which is also believed to be involved in the stabbing of a 14-year-old on the Bronx River Parkway last month.The NYPD is now cracking down on that gang \"Pick up a gun, pick up a machete, rob an elderly victim walking home from the train is a one-way ticket to prison,\" Shea said.The NYPD said they added extra staff to the CrimeStoppers tip line because they received a \"torrent of tips\" related to the case. The public is urged to continue to provide information, and anyone with information should call 1800-577-TIPS.",
    "source_domain": "abc7news.com",
    "title": "Justice for Junior: 2 more arrests in innocent Bronx teen's death",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/2-more-arrests-in-bronx-attack-that-killed-innocent-teen-junior/3704667/"
}