{
    "authors": [],
    "date_download": "2018-03-20 03:58:54+00:00",
    "date_modify": null,
    "date_publish": "2018-03-20 01:03:55",
    "description": "The addition would add 165,000 square feet and bring the building's height to 240 feet.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3236027%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3236023_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "If the city moves forward with an ambitious plan to guide office and housing development in Central SoMa, Pinterest hopes to add a vertical 11-story addition to its headquarters at 505 Brannan St.A proposal filed by TMG Partners , one of the original six-story building developers, includes an 11-story addition that would add 165,000 square feet to the site and bring its height to 240 feet.The current building offers 129,450 square feet in office space and is 85 feet tall, but the site is permitted for a structure 250 feet tall, according to SF Planning documents.The addition is anticipated to cost $38 million.The project will contribute to the city's affordable housing development efforts by paying \"substantial fees to the Jobs-Housing Linkage Program ,\" as well as complying with other Central SoMa neighborhood requirements, according to documents TMG filed with SF Planning.According to the city, the current Jobs-Linkage Housing fee for office space is about $26.95/gross square foot, which could add up to more than $4 million for the proposed 165,000-square-foot addition.The project would also generate about $3.4 million in fees to support public transportation, and 1 percent of the project cost would go toward public art on site or elsewhere.The Central SoMa plan , as formally introduced by Acting Mayor Mark Ferrell and District 6 Supervisor and mayoral candidate Jane Kim last month, intends to add 40,000 new jobs and 7,000 associated housing units in the area South of Market and North of Townsend between 2nd and 6th streets.The plan has been crafted over the past six years \"to take advantage of the $1.57 billion Central Subway,\" reports the. At least 33 percent of the housing will be permanently affordable and the new development in the neighborhood is expected to generate nearly half a billion dollars in funding for local and regional transit improvements, according to SF Planning.The housing stock in Eastern SoMa is currently 25 percent single-room occupancy hotels, catering to the lowest income residents in the city.According to the ordinance to be considered by the SF Planning Commission later this month, the plan aims to retain SRO hotels, which primarily serve \"elderly, disabled, and single-person households.\"SF Planning's Historic Preservation Committee is slated to consider legislation adopting the Central SoMa plan on Wednesday, March 21st, and the Planning Commission will get a briefing on the legislative package the following day.The Planning Commission cannot take formal action on the plan until the environmental review is complete. The environmental impact report could be certified at the commission's April 12th meeting, according to a notice sent to stakeholders last week.Once the plan is adopted, the city's review of TMG Partner's proposed addition to 505 Brannan can move forward.",
    "source_domain": "abc7news.com",
    "title": "Central SoMa Plan Could Add 11 Stories To Pinterest's HQ",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3236027/"
}