{
    "authors": [
        "Bay City News"
    ],
    "date_download": "2018-03-20 03:57:51+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 20:05:02",
    "description": "A memorial will be held Friday for a Marin County Sheriff's Deputy named Ryan Zirkle who died in a crash on Highway 1 north of Point Reyes Station.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3235020%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3235114_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A memorial service will be held for a Marin County sheriff's deputy who died in a solo-vehicle crash in the west part of the county, sheriff's officials said.A service for 24-year-old Ryan Zirkle of Petaluma is scheduled for 11 a.m. Friday at the Marin Center at 10 Avenue of the Flags in San Rafael.Zirkle lost control of his vehicle on a left turn on state Highway 1 just north of Point Reyes Station Road shortly after midnight last Thursday, California Highway Patrol spokesman Andrew Barclay said.The vehicle went off an embankment on the right side of the road and struck a tree.Zirkle was hired as a deputy in December 2015. He was assigned to the Point Reyes substation.Marin County Sheriff Robert Doyle said someone called 911 to report signs of a traffic accident and then hung up.Doyle said Zirkle had not been heard from for several minutes so his partner was dispatched to investigate and discovered the crash.First-responders needed 35 minutes to remove Zirkle from his vehicle. He was flown to Petaluma Valley Hospital where he died.Doyle said Zirkle grew up and attended schools in Novato and attended Sacramento State University.He was described as a happy, enthusiastic, positive man who wanted to serve the community.Zirkle's fiancée was out of town at the time of the crash and her father returned her to Marin County. Zirkle recently bought her a home in Petaluma, Doyle said.",
    "source_domain": "abc7news.com",
    "title": "Memorial to be held for Marin County sheriff's deputy killed in Highway 1 crash",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3235020/"
}