{
    "authors": [
        "Wayne Freedman"
    ],
    "date_download": "2017-02-15 08:49:08+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 03:07:49",
    "description": "There was a mess Tuesday night in San Francisco--feathers everywhere in Justin Herman Plaza after a primal show of affection and force in honor of Valentine's Day.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fpillow-talk-not-quite-in-san-francisco-on-valentines-night%2F1755277%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1755388_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pillow# fight time in Justin Herman Plaza. A spontaneous event?.strangers expressing love for each other. #abc7now pic.twitter.com/xAlZeOsfVA — Wayne Freedman (@WayneFreedman) February 15, 2017\nThere was a mess Tuesday night in San Francisco--feathers everywhere in Justin Herman Plaza.Those feathers were mostly cleaned up after 11 p.m., but weren't a product of any natural migration. Though predictable, what we witnessed was either a horrible spectacle or else something very primal.In the rush to get home a bell tolls for Saint Valentine's night in San Francisco. Lovers are bearing flowers. Happy couples stroll hand in hand and in some cases, bold imitations of future pillow talk.What kind of pillow talk is this?Who said what? How did it go so horribly wrong?It's time and again for the most distressing of San Francisco traditions--the Valentine's Night spontaneous pillow fight. It's clearly so sad, so sad that people have to resort to this.\"I just love the feeling of being hit with everyone and hitting,\" said Rob Singh.\"This is my husband and we are fighting each other, yeah yeah,\" said his wife Neha. It would appear they were self-counseling.\"I can take out all my aggression right now,\" Singh continued.\"It's an arranged marriage,\" said Neha. Apparently, the pillow fighting is what came of it.Maybe it's best to leave them alone. Even the authorities kept their distance. Pillow talk, after all, should be a private matter.",
    "source_domain": "abc7news.com",
    "title": "Pillow talk: Not quite in San Francisco on Valentine's Night",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/pillow-talk-not-quite-in-san-francisco-on-valentines-night/1755277/"
}