{
    "authors": [
        "Amy Hollyfield"
    ],
    "date_download": "2017-01-02 16:12:30+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 14:36:06",
    "description": "San Francisco 49ers Chief Executive Officer Jed York is expected to talk this morning about firing head coach Chip Kelly and general manager Trent Baalke.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsports%2F49ers-ceo-jed-york-to-speak-on-coach-and-general-manager-firings%2F1682400%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1504241_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Classic #49ers move by Jed. Leak firings, confirm nothing, ensure awkward finale, wait for reporters to leave, issue release on firings 1/2 — Larry Beil (@LarryBeilABC7) January 2, 2017\n2/2 and you wonder why #49ers have become a last place team. It starts at the top. #noscapegoatsleft — Larry Beil (@LarryBeilABC7) January 2, 2017\nSan Francisco 49ers Chief Executive Officer Jed York is expected to talk this morning about firing head coach Chip Kelly and general manager Trent Baalke.Sacramento Bee 49ers reporter Matt Barrows is tweeting that the team has interviews lined up this weekend with Patriots offensive coordinator Josh McDaniels, and Chris Ballard who's in the Chiefs front office.As for the firings, Baalke says he found out on Friday that he won't be returning. Kelly found out after yesterday's loss.This year's 49ers team ranks dead last in franchise history, matching their worst record ever at 2-14. Kelly had to deal with some big injuries this season, he was asked before being fired, if he would be surprised if the team let him go.\"I don't think anything surprises me. I live my life in vision not circumstances; I control what I can control. What we control is how we coach our players and what we do with them, if that's good enough that's good enough. If it's not good enough, so be it,\" said Kelly.Baalke is being blamed for depleting the team's roster, mainly because of poor drafting. A lot of fans feel, Baalke's firing was a long-time coming. Many of them still aren't happy with CEO Jed York.to read more stories about the 49ers.",
    "source_domain": "abc7news.com",
    "title": "49ers CEO Jed York to speak this morning on coach and general manager firings",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/sports/49ers-ceo-jed-york-to-speak-on-coach-and-general-manager-firings/1682400/"
}