{
    "authors": [
        "Jordyn Phelps"
    ],
    "date_download": "2018-04-24 20:31:40+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 18:21:21",
    "description": "The two leaders still differ on what to do about the Iran deal.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Fpresidents-trump-macron-entertain-new-deal-to-block-irans-nuclear-ambitions%2F3386802%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/macron-trump-ap-1-180424_hpMain_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump entertained the idea of negotiating a new deal to block Iran from obtaining nuclear weapons Tuesday during a joint press conference with French President Emanuel Macron.\"There is a chance, and nobody what's I'm going to do on the 12th, although Mr. President, you have a pretty good idea, but we'll see,\" President Trump said, apparently teasing forward to an upcoming deadline as it relates to the United States' continued participation in the deal. \"But we'll see also if I do what some people expect, whether or not it will be possible to do a new deal with solid foundations, because this is a deal with decayed foundations.\"The president further reiterated his belief that the current Iran nuclear deal , negotiated during the Obama administration, is a \"bad deal\" that is \"falling down\" and should have \"never have been made.\"Trump also issued a direct warning against Iran: \"If Iran threatens us if any way, they will pay a price like few countries have ever paid.\"But even as the president suggested an openness to exploring a new Iran deal, he also hedged that such a deal may not come to fruition.\"I think we will have a shot to be a much bigger deal, maybe not deal, but we'll know fairly soon,\" Trump said.While President Trump stopped short of directly committing to the possibility of pursuing a new deal, President Macron made clear that he desires to pursue a new agreement, which Macron agreed is not sufficient to restraining Iran long term.\"It's not a mystery, we did not have the same starting positions,\" said Macron. \"I can say that we've had very frank discussion on that, just the two of us. You consider that the Iranian deal, the JCPOA, the one negotiated in 2015 with Iran is a bad deal. For a number of months I've been saying that this was not a sufficient deal but that it enabled us at least until 2025 to have some control over their nuclear activities. We, therefore, wish to work on a new deal with Iran.\"Macron outlined his main interests in continuing to block Iran's nuclear development through 2025, something the current deal already does, while working to ensure that objectives are carried out long-term, and also end ballistic activities in the region.\"France is not naive when it comes to Iran,\" said Macron. \"But we do not repeat the mistakes of the past.\"",
    "source_domain": "abc7news.com",
    "title": "Presidents Trump, Macron entertain new deal to block Iran's nuclear..",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/presidents-trump-macron-entertain-new-deal-to-block-irans-nuclear-ambitions/3386802/"
}