{
    "authors": [
        "Bay City News"
    ],
    "date_download": "2017-02-14 23:46:04+00:00",
    "date_modify": null,
    "date_publish": "2017-02-14 22:27:49",
    "description": "A free-for-all involving hundreds of participants armed with pillows is set to take place this evening in San Francisco as part of an annual Valentine's Day tradition.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fsociety%2Fhundreds-to-flock-to-annual-valentines-day-pillow-fight-in-sf%2F1754809%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/1754841_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A free-for-all involving hundreds of participants armed with pillows is set to take place this evening in San Francisco as part of an annual Valentine's Day tradition.The Great San Francisco Valentine's Day Pillow Fight will commence at 6 p.m. at Justin Herman Plaza, where crowds of strangers wukk playfully smack each other with pillows.Participants are expected to arrive at 5:50 p.m. at the plaza to take their positions.According to a flyer for the event, participants are being asked to only hit others armed with pillows, unless of course they ask to be hit.Organizers have also asked pillow-fighters to consider bringing synthetic pillows, since pillows containing feathers are less durable and create more of a mess.The San Francisco Department of Public Works, working with the city's Recreation and Park Department, is responsible for cleaning up the mess left by the unsanctioned event.\"Public works will have a crew to clean the feathery mess after the fight,\" DPW spokeswoman Rachel Gordon said.Crews will begin cleaning up at 9 p.m. and go into the overnight hours, if necessary. The crews will then return in the morning to check if more cleaning up is needed, according to Gordon.However, event goers are being encouraged to not ruffle any feathers and to try to clean up after themselves.Because it's Valentine's Day, \"one thing we ask is for people to remember to love San Francisco and to not trash it,\" Gordon said.Cleanup costs for the event are normally as much as $5,000, according to Gordon.",
    "source_domain": "abc7news.com",
    "title": "Hundreds expected to flock to annual Valentine's Day pillow fight in San Francisco",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/society/hundreds-to-flock-to-annual-valentines-day-pillow-fight-in-sf/1754809/"
}