{
    "authors": [
        "Brandi Hitt"
    ],
    "date_download": "2018-03-20 03:59:06+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 18:17:34",
    "description": "The siblings rescued from their Perris home where their parents allegedly held them captive are enjoying their newfound freedom, an attorney said.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3234653%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kabc/images/cms/automation/vod/2967493_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The 13 siblings who were rescued from their Perris home where their parents allegedly held them captive are enjoying their newfound freedom, their attorney said in an ABC News exclusive interview.\"I think the favorite new experience for them is moving into new bedrooms, where they have been able to pick out their own bedding, have closets with their clothes in them, be able to have a bathroom right handy that they can use, and probably most of all just to go outside,\" attorney Jack Osborn said.The oldest siblings were released from Corona Regional Medical Center on Thursday and are now sharing one home under state care. The younger six have been split up into two additional homes.The older siblings are experiencing many firsts -- like learning to cook and trying Mexican food. They're also caring for the family dogs.\"They are joyful, they are warm, they are considerate...I give them a lot of credit for helping each other, relying on each other. I think they've learned how to bring out the best in each other over the years,\" Osborn said.Their parents, David and Louise Turpin, remain behind bars on dozens of charges including torture and child endangerment.The attorney for the adult siblings says they've communicated with their younger brothers and sisters through Skype, and they all hope to have a reunion soon.",
    "source_domain": "abc7news.com",
    "title": "Perris torture case: Turpin siblings enjoying newfound freedom",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3234653/"
}