{
    "authors": [
        "Alexander Mallin"
    ],
    "date_download": "2018-03-20 03:40:29+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 13:06:02",
    "description": "President Trump will unveil his new opioid plan Monday in New Hampshire.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2Ftrump-to-call-for-death-penalty-in-newly-announced-opioid-attack-plan%2F3233704%2F.json",
    "image_url": "http://a.abcnews.com/images/Politics/opioids-crisis-oxycontin-ap-jt-180126_16x9_992.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "President Donald Trump will visit New Hampshire on Monday to unveil a series of new steps aimed at combating the opioid crisis in what the administration is billing as his \"initiative to Stop Opioid Abuse and Reduce Drug Supply and Demand.\"Among the steps announced in the initiative is a call for the Department of Justice to \"seek the death penalty against drug traffickers, where appropriate under current law.\"However, a previous draft proposal of the initiative obtained by ABC News seemed to take a harder line on what the administration might pursue regarding use of the death penalty against drug traffickers.\"The death penalty should be sought for certain cases where opioid, including Fentanyl-related, drug dealing and trafficking are directly responsible for death,\" the previous draft read.The administration could not provide information about when it would currently be appropriate to seek the death penalty under current law for trafficking drugs.Trump has previously suggested dealers face the death penalty. At an opioid summit earlier this month, Trump said dealers should face \"the ultimate penalty\" for their roles in drug-related deaths.\"You know, if you shoot one person, they give you life, they give you the death penalty,\" Trump said. \"These people can kill 2,000, 3,000 people and nothing happens to them. Some countries have a very, very tough penalty -- the ultimate penalty. And, by the way, they have much less of a drug problem than we do.\"Trump's announcement Monday comes more than four months after he declared the opioid crisis a public health emergency, though the decision faced criticism as it stopped short of a national emergency declaration that would have made an additional surge of federal funds available to address treatment and recovery efforts.Other proposals in the plan include many recommendations previously put forward by the president's opioid commission last November, including the launch of a nationwide public awareness campaign to educate on the dangers of prescription and opioid abuse; the implementation of a \"safer prescribing plan\" aimed at cutting nationwide opioid prescription fills by a third over the next three years; calling on Congress to pass legislation that reduces the threshold amount of drugs needed to invoke mandatory minimum sentences for drug traffickers who knowingly distribute certain illicit opioids that are lethal in trace amounts; and working to ensure first responders are supplied with naloxone, a lifesaving medication used to reverse overdoses.The Centers for Disease Control (CDC) has labeled the country's opioid problems an \"epidemic.\" There were over 42,000 deaths from opioid use, including fentanyl , heroin and prescription drugs , in 2016, according to the CDC. Deaths were five times higher than they were just 17 years earlier, the CDC reported.In New Hampshire, 39 people per 100,000 died of opioid drug overdoses in 2016 -- the third-highest rate in the country. Only West Virginia and Ohio reported worse rates in 2016, according to the CDC.",
    "source_domain": "abc7news.com",
    "title": "Trump to call for death penalty in newly announced opioid attack plan",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/trump-to-call-for-death-penalty-in-newly-announced-opioid-attack-plan/3233704/"
}