{
    "authors": [
        "Melanie Woodrow"
    ],
    "date_download": "2018-04-25 04:23:27+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 22:12:05",
    "description": "There's great news for anyone who parks in San Francisco as officials announced Tuesday that car break-ins are down 83-percent at the Sutter-Stockton garage in Union Square and improvements are expected elsewhere as well.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3387623%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/2921671_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Public parking garage break-ins down in San Francisco @abc7newsbayarea pic.twitter.com/RBV6fmdoBY — Melanie Woodrow (@MelanieWoodrow) April 24, 2018\nSafety reforms coming to ALL city owned parking garages pic.twitter.com/FEZrcCaQET — Melanie Woodrow (@MelanieWoodrow) April 24, 2018\nThere's great news for anyone who parks in San Francisco as officials announced Tuesday that car break-ins are down 83-percent at the Sutter-Stockton garage in Union Square and improvements are expected elsewhere as well.Steven Shepherd and Cathrina Serrano are in San Francisco from San Diego. They parked their vehicle in the Sutter-Stockton garage for two days while they've been sight seeing.\"I saw the signs warning and we kind of thought we should check out the car before we go,\" said Shepherd.\"We didn't know,\" said Serrano.While families vacation, others are staking out their vehicles.\"I call it criminal tourism and it actually must stop,\" said District 2 Supervisor Catherine Stefani.\"This is a team effort,\" said SFPD Chief William Scott.Improvements include fencing, lighting, signage, high definition cameras and a dedicated foot patrol officer.Thieves aren't just stealing stuff.Last year, someone broke into Julia Wilkinson's rental car at the Fisherman's Wharf garage and stole her father's ashes. Wilkinson was visiting from North Carolina to spread them in her father's favorite city. A fews days later, someone turned her father's ashes in to an undercover officer.Earlier this year, a known criminal targeting cars in the Sutter-Stockton garage, threw a five year old chihuahua off the 7th floor during a car break-in.\"The only way the police were able to identify the perpetrator was because of a private dashboard camera that captured the entire crime,\" said Supervisor Stefani.Officials say they're not declaring victory yet.\"You see a park smart sign behind us not a mission accomplished sign,\" said SFMTA Director of Transportation Ed Reiskin.Still the future looks promising, reforms will be implemented at all 22 city owned garages by the end of next year or early 2020.",
    "source_domain": "abc7news.com",
    "title": "San Francisco officials announce significant reduction in car break-ins at Sutter-Stockton garage",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3387623/"
}