{
    "authors": [],
    "date_download": "2018-03-20 03:38:54+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 22:03:28",
    "description": "After 19 years, Hamburger Mary's has reactivated the former Patio Cafe on 18th Street.",
    "filename": "http%3A%2F%2Fabc7news.com%2Ffood%2Fsf-eats-new-truly-mediterranean-opens-soma-taqueria-closes-more%2F3235426%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3235425_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Openings\nClosures\nIn this edition, a popular Mediterranean eatery expands, a meatball joint prepares to open in Hayes Valley, a taqueria quietly closes for renovations, and what may be the Castro's most controversial restaurant in decades is finally open.(900 16th St.)Man about town and Hoodline tipster Al M. reports that popular Mission District eatery Truly Mediterranean has opened its second San Francisco outpost in Potrero Hill.Open from 9am to 8pm, Al said the new location offers longer hours than its Mission District counterpart to accommodate customers coming from UCSF's nearby Mission Bay campus.There's plenty of seating in the new space as well, a luxury not afforded at the Mission locale, which only has a few counter seats lining one wall.The new menu is currently not up on the restaurant's website, but if it's anything like its flagship, expect to see hand-made falafel and Mediterranean combo plates with hummus, baba ghanoush and tabbouleh; lamb shawarma with broiled tomatoes, parsley and seasoned onions; and a chicken kebob wrap with cucumbers, onions and tomatoes.(602 Hayes St.)Over in Hayes Valley, Al said The Meatball Bar 's second location is \"progressing along with their build and is about 70 percent complete.\" When he was in the neighborhood, a crew was installing a new awning with signage, along with the last finishing touches.The new space will also include the addition of outdoor seating.The restaurant--which has its FiDi flagship at 126 Sutter St.--is owned by Gianni Chiloiro and Angelo Sannino, proprietors of the South Bay's two Doppio Zero pizzeria locations. The new spot will offer a variety of traditional and fusion-influenced meatball selections.One of the owners on site told Al he'd be sure to reach out with advanced notice, but the business' website indicates a March 28th opening date.On the menu, expect to see variations like an Italian classic, turkey, lamb, vegetarian and more with sauce options like tomato, truffle fondue and Korean-style(fermented red chili paste). There's a variety of sides to pair with the meatballs on offer, too, like risotto, creamy mashed potatoes and spaghetti.Rounding things out are beer and wine, along with kombucha specialty drinks on draught. (You can check out the full menu for the FiDi location here .)(531 Castro St.)In the Castro, Hamburger Mary's has finally opened, according to Hoodline tipster Tom B.On his visit, Tom spoke to a staff member who said, \"they're only open at 4pm for now\" but eventually plan to open for lunch, and then add brunch offerings once things are up and running. The business' Yelp page , however, indicates the eatery is open daily 11am-2am.As we reported previously, the space was dormant since The Patio Cafe closed in 1999, and neighbors have been anxiously awaiting the return of the drag-themed eatery for several years now.On the menu, look for appetizers like breaded mac 'n' cheese fritters with barbecue dipping sauce, deep-fried pickles and \"Nacho Mary Nachos\" topped with melted cheese and meat chili.As for burgers, there's variations like the Black & Bleu Boy with bleu cheese crumbles and apple bacon, the Queen Mary with cheddar and jack cheeses and grilled onions, and a Sloppy Mary open-face burger topped with no-bean chili and melted cheese.Rounding things out is a selection of signature cocktails, martinis and beer and wine.Lastly, tipster Al told us that El Capitan Taqueria in SoMa has closed.\"The windows are covered and renovations have begun,\" he said. Notices posted to its windows indicate that the restaurant will be back under new management, but it's not clear if it will be under the same name or offer a similar menu.While its Yelp page hasn't indicated a closure, a visit to the restaurant's website revealed that its Squarespace account has expired. A search of public records also do not state any current building permit applications associated with the address at this time.Al added that he'll report back as soon as he learns more about the closure.High-fives all around for tipsters Al M. and Tom B.!If you've seen something new in the neighborhood, text tips and photos to 415-200-3233, or email tips@hoodline.com. If we use your info in a story, we'll give you credit.",
    "source_domain": "abc7news.com",
    "title": "SF Eats: New 'Truly Mediterranean' Opens, SoMa Taqueria Closes, More",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/food/sf-eats-new-truly-mediterranean-opens-soma-taqueria-closes-more/3235426/"
}