{
    "authors": [],
    "date_download": "2018-03-20 03:39:36+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 00:18:07",
    "description": "Discover fun in the sun at the Aulani Resort in Hawaii!",
    "filename": "http%3A%2F%2Fabc7news.com%2Ftravel%2Fbay-area-life-fun-in-the-sun-at-aulani-resort-in-hawaii%2F3231956%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/vod/3232573_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Experience white sand beaches, balmy air, and beach activities galore at the Aulani Resort! Have fun boogie-boarding, paddle-boarding, snorkeling, and exploring Oahu by canoe, or relax by the sparkling water on the sand. Guests can also create incredible sandcastles, learn sculpture techniques from the resort staff, and play several complimentary beach games. Delicious food and refreshments are conveniently located on the beach to keep you and your family nourished as you splash, swim, and play.Aunty's Beach House is the perfect place for your child to experience Hawaiian culture, art, and music with a dash of Disney magic. This 5,200-square foot kids club offers a plethora of activities and amenities including, interactive game tables, a movie room, Hawaiian arts and crafts, a play structure, and more. Hidden Disney surprises abound with enchanted fireplaces, magical portals, and visits from Disney characters! Supervised by childcare professionals, known as Disney Youth Counselors, children embark on a journey into the imagination and parents are rest assured that their children are playing in a safe environment.Aulani, A Disney Resort and Spa92-1185 Ali'inui Dr, Kapolei, HI 96707(866) 443-4763for more information.",
    "source_domain": "abc7news.com",
    "title": "Bay Area LIFE: Fun in the sun at Aulani Resort in Hawaii",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/travel/bay-area-life-fun-in-the-sun-at-aulani-resort-in-hawaii/3231956/"
}