{
    "authors": [],
    "date_download": "2018-04-24 23:36:24+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 21:06:09",
    "description": "Mobility is adding 250 e-bikes to its citywide fleet that have a max speed of 18 mph.",
    "filename": "http%3A%2F%2Fabc7news.com%2Fnews%2F3387378%2F.json",
    "image_url": "http://cdn.abclocal.go.com/content/kgo/images/cms/automation/hoodline/3387377_1280x720.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Bike-rental commuters and enthusiasts alike will now have a speedier option to choose from at San Francisco Ford GoBike stations.Today, Motivate , the company that operates the ubiquitous blue, Ford-branded bicycles, announced the addition of 250 new FordGo Bike Plus pedal-assist e-bikes, built to \"power up hills and ride for longer distances,\" according to a spokesperson.The bikes can be unlocked via a Clipper card or the Ford GoBike app, and can be docked at any Ford GoBike station in San Francisco. According to the company, it will be the first bike rental system in North America to incorporate pedal-assist bikes into its fleet of traditional bicycles.\"We are thrilled to introduce this innovative new mobility option into the Ford GoBike fleet,\" said Jay Walder, CEO of Motivate in a statement.\"Riders of all ages and fitness levels can now boost their natural pedal power to summit the notorious San Francisco hills and more fully enjoy the benefits of bike share.\"To celebrate the launch, Motivate staff, including Walder, Vish Palekar, CEO of GenZe--whose company designed the custom-made, zero-emission bicycles--along with government and community partners involved in the project, hosted a group bike ride through Hayes Valley.\"We're thrilled to add GenZe ebikes to the Ford GoBike Program,\" said Palekar. \"Now more people of all ages and fitness levels can bike as a reliable means of transport, and ride further, for longer--sweat and hassle free.\"Each e-bike features a 345 Wh Li-ion battery and boasts a maximum speed of 18mph. From an LCD display, riders are able to track speed and battery charge level, and the vehicles are permitted anywhere its legal to operate traditional bicycles.\"Shared electric bikes can be the next step in San Francisco's mobility future, creating a gateway to get even more people on two wheels,\" said Ed Reiskin, the SFMTA's Director of Transportation. \"As a convenient and safe way to get around town, shared electric bikes will make our hilly neighborhoods more accessible and longer bike rides less daunting for everyone.\"For a limited time, Ford GoBike is offering a special price of $2 per 30-minute single ride for interested parties to test out the new technology. Unlimited e-bike usage is included in an annual membership, which is $149 for the year and $10 for a 24-hour access pass. Qualifying Bike Share for All members can use the e-bikes at the discounted rate of $5 for their initial year for rides up to 60 minutes.\"These electric bikes will benefit not just San Francisco residents, but everyone who comes to the city for any purpose,\" said Jake Mackenzie, chair of the Metropolitan Transportation Commission (MTC), which oversees the Ford GoBike program in the Bay Area.",
    "source_domain": "abc7news.com",
    "title": "Motivate deploys 250 Ford GoBike Plus e-bikes",
    "title_page": null,
    "title_rss": null,
    "url": "http://abc7news.com/news/3387378/"
}