{
    "authors": [
        "Oregon Coast Beach Connection"
    ],
    "date_download": "2017-08-15 04:52:50+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Eclipse Travel Warnings for Oregon Coast, Inland, Washington: Gonna Get Ugly - ODOT has plenty of warnings and advice for those heading down for the solar eclipse",
    "filename": "http%3A%2F%2Fbeachconnection.net%2Fnews%2Feclip081417_517.php.json",
    "image_url": "http://www.beachconnection.net/news/waldport_bridgemoon.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Eclipse Travel Warnings for Oregon Coast, Inland, Washington: Gonna Get Ugly\nPublished 08/14/2017 at 5:23 PM PDT\nBy Oregon Coast Beach Connection staff\n(Oregon Coast) – ODOT and its Washington equivolent have plenty of warnings and advice for those heading down for the solar eclipse - not just those going to the central Oregon coast but throughout all of Oregon, and even those traveling through Washington. The total solar eclipse that morning will likely be the busiest traffic event in Oregon history. Eclipse fans must be in place well beforehand or risk getting stuck in traffic.\nIf you're a last-minute traveler that leaves in the wee hours of August 21, you're likely going to miss it, the agency said.\nAfter the eclipse will be even more problematic, ODOT said. Hundreds of thousands of vehicles are expected to hit the roads at the same time, and coming home will be the most difficult part. The agency is adamant about the issues and hazards.\n“Arrive early, stay put and leave late,” ODOT said. “This is NOT a game day: Please treat the 3-hour eclipse as a 3-DAY event.”\nODOT said that travelers have to share the responsibility for their own safety as well as that of others.\nOn some highways, ODOT will have crews and trucks to respond to emergencies set as little as five miles apart.\nIn Oregon and along the Oregon coast, there are a host of rumors that ODOT is getting frustrated with. They addressed the following:\n- ODOT will not close any highways, and no highways will be turned into one-way roads.\n- Big-rig traffic will not be prohibited in any form, but over-width loads will not be allowed. Rest areas will be open, but camping there will not be allowed. Where to stay for this event - Where to eat - Map and Virtual Tour\nSome eclipse do's and don'ts:\nDon’t wear eclipse glasses while driving. If the glasses do what they’re supposed to, you won’t be able to see anything but the sun.\nDo not try driving and looking at the eclipse. This should go without saying, but you know someone will try it.\nDo not camp out at rest stops. These are designated for travelers who are not staying longer than eight hours.\nDo not park your car on the road shoulder. This will block emergency vehicles as well as cause other traffic issues or even accidents. Heat from your car could also start a brush fire.\nMake sure your car is in good working order. Also have enough supplies for a few days in case you get stranded.\nTransportation officials in Washington are weighing in as well, noting the horrendous hotspots that will be imminent. WSDOT is also adamant about its warnings of intense traffic problems along its highways.\nOne major point of advice is that if you're in Seattle and thinking about simply waking up extra early to get there, you likely won't make it.\nFor those coming from the north, expect possible serious issues (maybe near-standstill conditions) at the following Washington and Washington coast routes:\n- Interstate 5 from Vancouver to Eugene\n- Interstate 82 at Benton County\n- US 97 at Klickitat County\n- State Route 14 at Columbia River Gorge\n- US 197 at Dallesport\n- Interstate 205 from Clark County to Portland\n- State Route 433 at The Lewis and Clark Bridge in Longview\n- Washington Coast: State Route 4 at Longview to Naselle\n- Washington Coast: State Route 401 from Naselle to Dismal Nitch\n- Washington Coast: US 101 from Ilwaco to Astoria\nMore About Oregon Coast hotels, lodging.....\nMore About Oregon Coast Restaurants, Dining.....\nCoastal Spotlight\nLATEST Related Oregon Coast Articles\nBack to Oregon Coast\nContact Advertise on BeachConnection.net\nAll Content, unless otherwise attributed, copyright BeachConnection.net Unauthorized use or publication is not permitted",
    "source_domain": "beachconnection.net",
    "title": "Eclipse Travel Warnings for Oregon Coast, Inland, Washington: Gonna Get Ugly",
    "title_page": null,
    "title_rss": null,
    "url": "http://beachconnection.net/news/eclip081417_517.php"
}