{
    "authors": [
        "Oregon Coast Beach Connection"
    ],
    "date_download": "2017-12-11 10:10:08+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Lincoln City's Holidays and Frivolities: December Highlights for Central Oregon Coast",
    "filename": "http%3A%2F%2Fbeachconnection.net%2Fnews%2Flcdechol120817_644.php.json",
    "image_url": "http://beachconnection.net/news/lcity_rock_surf.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Lincoln City's Holidays and Frivolities: December Highlights for Central Oregon Coast\nPublished 12/08/2017 at 6:45 PM PDT\nBy Oregon Coast Beach Connection staff\n(Lincoln City, Oregon) – The land of Glass Float Drops and seven miles of smiles is making plenty of waves for December. Lincoln City, on the central Oregon coast, is providing plenty to partake in when it comes to events, and not just the holidays. There's food happenings, a robust music scene, a special glass float drop around New Year's Eve (on top of the usual weekend drops), whale watch week and some big fun for New Year's celebrations.\nHere's a hefty lineup of things going on for the month.\nDecember 9. Siletz Bay Music Festival presents an afternoon with pianist Cary Lewis and violinist Sarah Kwak. Performance at 3 p.m. and $30 includes light refreshments. Tickets may be purchased at SiletzBayMusic.org or by calling 541-992-1131. Lincoln City, Oregon.\nDecember 14. Holiday Dive-In Movie. Bring your favorite air mattress, inner tube or deck chair, then sit back and relax in the pool or on the deck while you watch Frozen on the Jumbotron. That's right: in the pool at the Community Center. 6:30 - 8:30 p.m. Cost: $5 per person. 541-994-2131. Lincoln City, Oregon.\nDecember 15 – 16. 5th Annual North Pole Express. Take a magical ride on a virtual journey to the North Pole! There will be hot cocoa, cookies, and Santa will be there with a special gift for each child, ages 3 – 11. On Friday, the North Pole Express “departs” at 5:45 p.m. and “arrives” at 8 p.m. On Saturday, it “departs” at 12:45 p.m. and “arrives” at 3 p.m. Ticket price $17.95. Chinook Winds Play Palace. Lincoln City, Oregon. 541-996-5790.\nDecember 16. 5th Annual Jingle Bell 5K Jog/Walk. Open to runners, joggers, walkers, baby strollers and pets. Costumes are recommended but optional, and bells will be provided. 9:30 a.m. To register, visit www.lincolncity.org or call 541-994-2131. Lincoln City Community Center. Lincoln City, Oregon.\nDecember 16. Outbound Traveler live. Upbeat campfire music on banjo, guitar, fiddle, flute and bouzouki will keep your feet moving along with vocal harmonies that will melt your heart. $15 in advance. 7 p.m. Lincoln City Cultural Center. Highway 101. Lincoln City, Oregon. 541-994-9994. Website.\nDecember 16. Hands-On Tamales. Come and learn how to make delicious tamales right at home. $75 per person includes meal and beverage. 11 a.m. - 2 p.m. Lincoln City Culinary Center. Highway 101. Lincoln City, Oregon. 541-557-1125 Website.\nDecember 21. Lincoln Pops Big Band. Dance or just listen to the sounds of the 40’s, 50’s and 60’s. Adults $6 and Students $3, children under 6 are free. 7:30 p.m. Gleneden Beach Community Club, 110 Azalea Street, Gleneden Beach, Oregon (just south of Lincoln City). 541-563-5067. Website.\nDecember 21. Chicago-Style Deep Dish Pizza Demo. Learn the secrets to authentic Chicago-style pizza. 6 p.m. Lincoln City Culinary Center. Highway 101. Lincoln City, Oregon. 541-557-1125 Website.\nDecember 22 – 23. 5th Annual North Pole Express. Take a magical ride on a virtual journey to the North Pole! There will be hot cocoa, cookies, and Santa will be there with a special gift for each child, ages 3 – 11. On Friday, the North Pole Express “departs” at 5:45 p.m. and “arrives” at 8 p.m. On Saturday, it “departs” at 12:45 p.m. and “arrives” at 3 p.m. Ticket price $17.95. Chinook Winds Play Palace. Lincoln City, Oregon. 541-996-5790.\nDecember 24. Christmas Eve Concert with Kids Sing Out (KSO). A free concert of sacred and secular music on Christmas Eve. 7 p.m. Admission is free. Lincoln City, Oregon. 541-996-4045. Website.\nDecember 27 – 31. Winter Whale Watch Week on the Oregon Coast. Watch as majestic gray whales migrate south to Baja, Mexico, where they give birth to their calves. In Lincoln City: top floor of Inn at Spanish Head. 541-765-3304 or visit oregonstateparks.org.\nDecember 30 – January 1. 100 glass art pieces will be hidden along the 7-1/2 miles of public beach in Lincoln City, from the Roads End area to Siletz Bay. Lincoln City, Oregon. 541-996-1274 or Website.\nDecember 31. New Year’s Eve Bash with the Lincoln Pops Orchestra. Celebrate in style with the Pops. Tickets include light hors d’oeuvres and a champagne (or sparkling cider) toast at midnight (beer and wine sold separately). $45 per person/$80 per couple. 8:30 p.m. Lincoln City Cultural Center. Lincoln City, Oregon. 541-994-9994. Website. --- Where to stay for these events - Where to eat - Map and Virtual Tour. More Lincoln City below:\nMore About Oregon Coast hotels, lodging.....\nMore About Oregon Coast Restaurants, Dining.....\nCoastal Spotlight\nLATEST Related Oregon Coast Articles\nBack to Oregon Coast\nContact Advertise on BeachConnection.net\nAll Content, unless otherwise attributed, copyright BeachConnection.net Unauthorized use or publication is not permitted",
    "source_domain": "beachconnection.net",
    "title": "December Highlights for Central Oregon Coast",
    "title_page": null,
    "title_rss": null,
    "url": "http://beachconnection.net/news/lcdechol120817_644.php"
}