{
    "authors": [
        "Oregon Coast Beach Connection"
    ],
    "date_download": "2017-12-11 10:10:06+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Central Oregon Coast's Yachats and Florence in December, January - Music, food, the holidays, a good helping of whales and even a festival of gems and minerals",
    "filename": "http%3A%2F%2Fbeachconnection.net%2Fnews%2Fyachflodec121017_130.php.json",
    "image_url": "http://beachconnection.net/news/yach_neptune2.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Central Oregon Coast's Yachats and Florence in December, January\nPublished 12/10/2017 at 1:35 AM PDT\nBy Oregon Coast Beach Connection staff\n(Yachats, Oregon) – Music, food, the holidays, a good helping of whales and even a festival of gems and minerals: this is what's in store for this particular chunk of central Oregon coast around Yachats and Florence. The two towns keep kicking out the jams with a variety of events.\nTake a look at the winter lineup of fun for December and January. It begins with Yachats listings and ends with Florence happenings.\nDecember 15. Families Together Ornament Night The Yachats Youth & Family Activities Program. Holiday meal, storytime, ornament making, tree decorating and lots of holiday cheer to ring in the season. Santa Hat Santa is sure to make an appearance. This event is free. Children must be accompanied by an adult. 6 p.m. Yachats Community Presbyterian Church. 360 W 7th St. 541-547-4599.\nCentral Coast Chorale - Wishes and Candles Holiday Concert. 50-voice choir and special guests Women of Note. $10 Suggested Donation. 7 p.m. Yachats Commons, 441 Hwy 101 at W 4th St. Yachats, Oregon.\nDecember 16 – 17. 22nd annual Victorian Christmas Open House, Heceta Light Keepers' House. The Queen Ann style Keeper's House will be decorated with Victorian flourishes inside and out. Enjoy warm drinks and treats and performances by local musicians. Santa Hat Santa Claus will be there, and Oregon State Parks volunteers will offer historic tours of the lighthouse. There will be a holiday raffle with great prizes from local businesses. Shuttle service will be offered from Heceta Head Lightstation State Scenic Area parking lot to the front door. Or bring warm, rainproof clothing and a flashlight and enjoy a beautiful walk up from the parking lot/beach. The parking fee is $5 or present your Oregon Coast Passport. 4 - 7 p.m. 14 miles south of Yachats. (541) 547-3696.\nDecember 21. Winter Solstice Bonfire Party. Live music, hot drinks, sweet treats, and a warm welcome. Guests are invited to bring a percussion instrument as well as a piece of firewood to add to the bonfire. Held at the picnic shelter at Yachats Commons.\nDecember 27 – 31. Winter Whale Watch Week. 10 a.m. to 1 p.m. Cape Perpetua Visitors' Center and Cook's Chasm. Just south of Yachats, Oregon. Whalespoken.org.\nJanuary 1. Yachats New Year's Day Peace Hike. 6-mile round trip hike from the Yachats Commons to the Amanda Trail Grotto where the traditional silent procession and fire ceremony will be held. Check-in for the hike begins at the Commons at 9:30 a.m. (Note that due to traffic safety concerns, no parking or shuttle service will be available at the Kittel driveway along Hwy. 101 this year.) As an alternative, for those not participating in the hike, a candlelight vigil will also be held in the Yachats Little Log Church from 9:30 a.m. - 1:00 p.m. Members of the Confederated Tribes of Coos, Lower Umpqua and Siuslaw Indians will begin the vigil with the Story of Amanda, for whom the Amanda Trail is named. Yachats, Oregon. yachats.org.\nJanuary 13 and 14. Yachats Agate Festival and Gem-Mineral-Fossil Show. Spectacular displays as well as family friendly learning opportunities for all ages. There will be special guest speakers and the Oregon Coast Agate Club will also be joining in with demonstrations and club displays. 10 a.m. Yachats Commons, Hwy 101 & W 4th. Yachats, Oregon.\nDecember 13. Jazz Kings “An Old Fashioned Christmas.” Shirley Andress and company with the songs and stories tied to our Christmas tradition, featuring the Great American Songbook with its familiar cadences of Christmas verse and jubilant sound of traditional and sacred holiday carols. Tickets online or at the Florence Events Center $30. 7:30 p.m. Florence Events Center. 715 Quince Street. Florence, Oregon. www.eventcenter.org.\nDecember 18. Oregon Brass Society Christmas Concert. Nothing gets you in the holiday spirit more than holiday music and the Oregon Brass Society is willing to dish up this holiday treat. 7 p.m. Florence Events Center. 715 Quince Street. Florence, Oregon. www.eventcenter.org.\nDecember 19. Eugene Ballet - “The Nutcracker.” Joyful magic at every performance as hundreds of aspiring young dancers join the Company on stage, while the Sugar Plum Fairy transports all to the Snow Kingdom and the Land of the Sweets. 7 p.m. Adults $35, Youth 18 and under $15. Florence Events Center. 715 Quince Street. Florence, Oregon. www.eventcenter.org.\nJanuary 12 – 14. Florence Winter Music Festival. A variety of international touring talent and world class artisans, along with a wealth of locally sourced cuisine and fine libations. On Saturday evening, January 13 at “The Main Event,” the legendary Brit folk rocker Al Stewart performs his multi-platinum “Year of The Cat” hits, ably supported by Oregon’s favorite young story telling troubadour, John Craigie. Also: Jeff Scroggins & Colorado, Castletown, Pretty Gritty, Calaveras and more. See website for ticket info. Florence Events Center. 715 Quince St, Florence, Oregon. 541-997-1994 or visit wintermusicfestival.org. - Where to stay for these events - Where to eat - Map and Virtual Tour\nMore About Yachats Lodging.....\nMore About Oregon Coast Restaurants, Dining.....\nCoastal Spotlight\nLATEST Related Oregon Coast Articles\nBack to Oregon Coast\nContact Advertise on BeachConnection.net\nAll Content, unless otherwise attributed, copyright BeachConnection.net Unauthorized use or publication is not permitted",
    "source_domain": "beachconnection.net",
    "title": "Central Oregon Coast's Yachats and Florence in December, January",
    "title_page": null,
    "title_rss": null,
    "url": "http://beachconnection.net/news/yachflodec121017_130.php"
}