{
    "authors": [],
    "date_download": "2018-05-31 00:58:23+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 14:50:00",
    "description": "The city hosted one of the world's first diagonal crosswalks, and engineers are considering it again.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fshould-vancouver-bring-back-scramble-pedestrian-crossings-1.3952405.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3952412.1527716792!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThere's a call to bring back a type of pedestrian crossing designed to reduce risk and increase traffic flow, but is the system right for Vancouver?\nIntersections such as Broadway and Cambie Street, which see steady streams of buses, cars and pedestrians, are being scrutinized by city engineers.\nThe combination of vehicles turning left and right onto the major streets and pedestrians racing to catch the SkyTrain or bus make it a dangerous area. The answer to make it safer may lie a 30-minute drive away.\nPart one in our pedestrian series: Walking into crosswalks while the hand signal is flashing could cost you\nSteveston is home to a scramble crosswalk – a system where pedestrians can cross in either direction or walk diagonally through the centre of the intersection. Similar crossings exist in cities around the world including Toronto, Calgary, New York, Tokyo and London.\nAlso known as \"X Crossing,\" \"diagonal crossing\" and “the Barnes Dance\" – after late U.S. traffic engineer Henry Barnes – one of the first scramble crossings in the world was built in Vancouver in the 1950s.\nVancouver engineers recognize their value. If no vehicles are turning, the chance of someone getting hit is reduced significantly.\nIn the case of Broadway and Cambie, some buses drop people off and pick them up diagonally from the SkyTrain station. A direct route through the intersection would be fastest for anyone rushing to catch public transit.\nBut the downsides include that red lights would last even longer.\n\"We're looking at the trade-offs in terms of the congestion impact, the queuing, the impact to transit,\" said Winston Chou with the city's traffic and data management department.\n\"What we saw in our analysis was that the impact was just too great.\"\nAnalysts review intersections periodically.\nYears ago, a similar system was planned for Robson Street, but it was scrapped a year later when advocates for the blind suggested the set-up could be dangerous and confusing for some.\nWith a report from CTV Vancouver's St. John Alexander",
    "source_domain": "bc.ctvnews.ca",
    "title": "Should Vancouver bring back 'scramble' pedestrian crossings?",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/should-vancouver-bring-back-scramble-pedestrian-crossings-1.3952405"
}