{
    "authors": [],
    "date_download": "2017-04-18 04:16:00+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 17:31:00",
    "description": "The incident took place two weeks after founder Ryan LaForge was arrested over a violent confrontation.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fmembers-of-surrey-creep-catchers-use-force-during-another-sting-1.3372611.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372621.1492475428!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nTwo weeks after the founder of Surrey Creep Catchers was arrested over a violent confrontation with a target, members of the vigilante group have once again used force during a sting.\nThe latest incident happened Monday afternoon at Central City Shopping Centre in Surrey, where the vigilantes confronted a man they accused of trying to meet a 13-year-old girl.\nFacebook video of the sting shows leader Ryan LaForge and another member manhandling the target, pulling him through the mall by the jacket and then cornering him against a wall outside.\n\"Seriously dude, let go of me,\" the man says in the video.\n\"This is a citizen's arrest,\" LaForge tells him. \"You resist any more I'm going to knock you the f--- out.\"\nCreep Catchers members called the RCMP to the mall to apprehend the target. The officers who responded spoke with the man and with LaForge, who was briefly taken into a cruiser.\nIt's unclear whether the target, whose name hasn't been confirmed, was arrested.\nEarlier this month, LaForge was taken into custody after a sting at the same mall turned violent. LaForge was recorded pushing a man, who had allegedly tried to solicit sex with a six-year-old, against a wall and screaming obscenities at him.\nLaForge later posted a video claiming he had been charged with assault, but there is no record of the charge on B.C.'s online court database.\nDuring Monday's sting, LaForge was noticeably calmer when confronting the target, who allegedly offered to expose himself to a young teenager during a text conversation.\nLaForge gave the man a chance to explain himself, leading him to eventually claim he wouldn't have gone through with it.\n\"I probably wouldn't have done a f---ing thing. I would have just – I would have chickened out,\" the target says in the video.\nThe RCMP has repeatedly condemned online vigilantism, warning that the efforts of groups like Creep Catchers can actually jeopardize its investigations.\nMounties also said if someone is believed to be a danger to children, people should report the suspect to law enforcement immediately – rather than delaying the report in order to try and shame them on social media first.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Members of Surrey Creep Catchers use force during another sting",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/members-of-surrey-creep-catchers-use-force-during-another-sting-1.3372611"
}