{
    "authors": [
        "Dario Balca"
    ],
    "date_download": "2017-12-12 07:05:32+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 18:26:00",
    "description": "Workers were painting and cleaning the greenhouses at Windset Farms when they were exposed to carbon monoxide.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fcarbon-monoxide-at-delta-farm-highlights-importance-of-safety-training-union-1.3717309.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3717313.1513045429!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Work safety advocates say proper training and preparedness may have stopped a health and safety scare at a Delta B.C. farm over the weekend from turning into a tragedy.\nOn Saturday, more than 40 migrant workers were painting and cleaning the greenhouses at Windset Farms when they were exposed to carbon monoxide.\nPoor ventilation likely caused the harmful buildup of fumes. Six of the employees tested positive for carbon monoxide poisoning.\n\"Our senior management…called 911 to make sure we could triage them in various hospitals and make sure they'd be safe and sound,\" said Windset CEO John Newell when describing the farm's response.\nThree fire crews, a hazmat team and paramedics were dispatched to the scene.\nAt the time, BC Emergency Health Services said that 10 people were in serious or critical condition and 32 others were in stable condition.\nMost of the employees have since been given a clean bill of health.\n\"We're just thankful that everyone safe,\" Newell said.\nWindset is a member of AgSafe, an organization that provides training in a bid to create safer work environments for employees in B.C.'s agricultural sector and related industries.\nNow, the Canadian Farmworkers' Union says the incident should serve as a reminder to other companies that proper safety training can be a matter of life and death.\n\"They knew what they were doing…They were trained how to do it,\" said union president Charan Gill.\n\"Other people should become members of AgSafe and make sure they do the right thing when these kinds of accidents happen.\"\nGill said health and safety concerns are far too common and often go unreported, especially among foreign workers who are concerned about job safety.\n\"It's quite a big concern,\" he said. \"Workers don't report because they're afraid of losing their jobs.\"\nGill said the union has submitted recommendations to the province on how to improve safety standards and record keeping when it comes to health and safety incidents. He hopes B.C.'s recently elected NDP government will adopt the measures.\nCarbon monoxide causes health problems and eventual death because it limits the body's ability to carry oxygen in the blood. The gas is especially dangerous because it has no colour, odour or taste.\nWorkSafeBC is still investigating Saturday's incident in Delta.\nWith files from CTV Vancouver's Scott Hurst and The Canadian Press",
    "source_domain": "bc.ctvnews.ca",
    "title": "Carbon monoxide at Delta farm highlights importance of safety training: union",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/carbon-monoxide-at-delta-farm-highlights-importance-of-safety-training-union-1.3717309"
}