{
    "authors": [],
    "date_download": "2017-06-15 04:41:25+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 14:18:00",
    "description": "Crystal Smith said she's received three eviction notices since her landlord noticed her smudging in March.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fwoman-evicted-over-smudging-ceremonies-files-human-rights-complaint-1.3459544.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3459557.1497474629!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "An aboriginal woman who claims her landlord tried to evict her for performing traditional smudging ceremonies in her Burnaby, B.C. home has filed a human rights complaint.\nCrystal Smith of the Tsimshian and Haisla First Nations said she's had problems with her landlord, Parminder Mohan, ever since he noticed her smudging at home with her children in March.\nThe ceremony involves burning herbs to cleanse the body and spirit; to perform it inside, Smith burns sage in a shell and uses a feather to waft the smoke.\n\"My landlord happened to be in the upstairs unit and he smelled it,\" Smith said. \"I got a text message maybe 10 minutes after we'd finished smudging saying that 'I smelled marijuana.'\"\nSmith, who told CTV News she doesn't smoke drugs or even cigarettes, assured Mohan that wasn't the case, and even offered to demonstrate how smudging works. The landlord wasn’t satisfied, and allegedly told her to stop.\nSmith said she has since been served three eviction notices, and faces continued pressure to leave despite a Residential Tenancy Branch ruling in her favour.\n\"Basically I'm being forced to move because my landlord doesn't allow me to practice my spiritual ceremonies and practices,\" she said.\nFor Smith, smudging is a crucial part of keeping her son and daughter in tune with their heritage.\nHaving lost her grandparents when she was a young teenager, Smith said she missed out on learning about aspects of her culture at a young age, and she doesn't want her children to be deprived in the same way.\n\"I need my children to grow up in culture so they could love who they are, so that they can grow up and be proud,\" Smith said.\nShe's given up on remaining in their Burnaby home, however. She intends to move out this week, though she's disappointed at having to upend her family again so soon.\nThey have only been living in the apartment for a few months, and previously had a brief stay at a safe house where they moved after she left an abusive relationship.\n\"It's frustrating,\" Smith said. \"We were supposed to be in this home until December at least, and I was even hoping to stay a little longer because me and my children have been through so much.\"\nMohan sees things differently. He spoke to CTV News by phone Wednesday, and said he's actually an accommodating landlord who has become the victim of an unappreciative tenant.\nMohan said he reduced Smith's rent and gave her a dishwasher when she moved in, but he's concerned about how smudging might impact the property and her neighbours.\nHe claims the smudging ceremony he witnessed in March sent smoke wafting in the upstairs suite.\n\"I almost passed out. I actually had to stumble out,\" he said. \"I had fans running 24/7 trying to get rid of the smell, the smell doesn't go away.\"\nSmith said the ceremony does create a smell, but it fades after a day or two. When their dispute was heard by the Residential Tenancy Branch, the arbitrator ruled Mohan hadn't provided sufficient evidence the smudging had disturbed or adversely affected other tenants.\nMost importantly, though, Smith feels smudging is a religious right that shouldn't open up aboriginal people to evictions or any other form of pressure at home, which is why she has filed a complaint with the B.C. Human Rights Tribunal.\n\"The reason I'm fighting, the reason why I'm pushing this forward is so that my children, my great grandchildren, will not have to do this,\" she said.\nWith files from CTV Vancouver's Shannon Paterson",
    "source_domain": "bc.ctvnews.ca",
    "title": "Woman evicted over smudging ceremonies files human rights complaint",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/woman-evicted-over-smudging-ceremonies-files-human-rights-complaint-1.3459544"
}