{
    "authors": [],
    "date_download": "2018-02-02 23:08:29+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 13:48:00",
    "description": "Phat Bar and Lounge used to go through about 10,000 plastic straws every month.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fdowntown-vancouver-sports-bar-goes-straw-free-1.3787522.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3787300.1517598208!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA downtown Vancouver sports bar is doing its part to help the environment by no longer using plastic straws.\nPhat Bar and Lounge used to go through about 10,000 plastic straws every month. Now, staff at the Yaletown bar serve drinks without them.\nCustomers who insist of having a straw in their drink are given a biodegradable one.\nOwner Jessica Price says the compostable straws are \"better for the environment and hopefully not going to end up in a landfill or in the ocean.\"\nAmericans discard about 180 billion plastic straws a year. Many of those that don't make it into landfills wind up in rivers, lakes and oceans.\nThere few official statistics about Canada’s straw use, but assuming a similar rate of consumption per capita would mean those north of the border throw out more than 50 million straws a day.\n\"There's lots of animals that are washing up dead on beaches and when you cut them open, they're just completely full of plastic, including straws,\" said Dr. Elaine Leung of Sea Smart, a Metro Vancouver-based organization that aims to educate youth about ocean issues.\nAccording to strawfree.org, straws are one of the top 10 pieces of garbage polluting oceans. The online campaign estimates that a million sea birds, 100,000 marine mammals and \"countless\" fish are killed by plastic pollution each year.\nGraphic video of a group of boaters removing a 12-centimetre straw blocking a sea turtle's nostril began circulating on social media in 2015, highlighting the severity of plastic pollution and its potentially deadly consequences for wildlife.\nLeung praised businesses that are switching to biodegradable straws, but says not using them at all would be even more beneficial for the planet.\n\"Biodegradable alternatives are a step in the right direction, but a better choice is not using the straws at all. Think, how often do you use straws at home? You don't, so why do you need a straw when you go out?\" she said.\nIn 2016, voters in California approved a ban on plastic bags. Now, some lawmakers in the state want to regulate the use of plastic straws, forcing restaurants to only hand them on request.\nThere are currently no such efforts to legislate the use of plastic straws in British Columbia.\nSome customers at Phat, however, say it would be an easy adjustment.\n\"A lot of people use their straw just to stir their drink and then they toss it away,\" said patron Jennifer Leenhouts.\nGoing straw-free also helps the business save money, while doing its part to help wildlife and the environment.\nWith files from CTV Vancouver's Ben Miljure",
    "source_domain": "bc.ctvnews.ca",
    "title": "Downtown Vancouver sports bar goes straw-free",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/downtown-vancouver-sports-bar-goes-straw-free-1.3787522"
}