{
    "authors": [
        "Sandra Hermiston",
        "Ross Mclaughlin"
    ],
    "date_download": "2018-02-02 23:08:00+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 06:00:00",
    "description": "Getting the best picture to watch sports on your television may mean avoiding the \"sports mode\" setting.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fgetting-your-tv-in-picture-perfect-shape-for-the-big-game-1.3785808.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3785822.1517523795!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sandra Hermiston and Ross McLaughlin, CTV Vancouver\nIt's Super Bowl weekend and whether you're watching the big game or tuning into the Olympics next week, you want the best picture possible for sports action. And, believe it or not, experts say that means avoiding the “sports mode” setting.\n“It tends to artificially boost contrast, brightness and colours. And that makes the picture look unnatural,” explained Jim Willcox, Consumer Reports electronics editor.\nInstead, use either the movie or cinema mode, which will give you the most natural-looking picture.\nAnother factory preset mode to avoid if your TV has it: dynamic or vivid.\n“The vivid mode works a lot like the sports mode where it overly brightens the image,” said Willcox.\nAnother trick? Turn off noise reduction and motion smoothing. Noise reduction can reduce detail and fine texture in your picture. Motion smoothing is sometimes called the soap opera effect and can make video look like a daytime TV program.\nIf you’re looking to adjust your set beyond the factory preset modes, Consumer Reports says take it easy with the sharpness by keeping it near zero. Turning it up too much can make the picture detail look less natural.\nAnd for colour temperature as well as colour and tint?\n“Typically you should choose the low or warm setting so that whites don’t look too blue. And with tint what you’re really trying to do is get the most natural-looking flesh tones,” advised Willcox.\nIf you think it’s time for a new TV set, you can take a look at Consumer Reports TV ratings here.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Getting your TV in picture perfect shape for the big game",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/getting-your-tv-in-picture-perfect-shape-for-the-big-game-1.3785808"
}