{
    "authors": [
        "Camille Bains"
    ],
    "date_download": "2018-05-30 19:21:56+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 08:02:00",
    "description": "Environmentalist Tzeporah Berman says the government \"made a very big mistake\" buying the project.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fpipeline-betrayal-could-trigger-unprecedented-protests-activist-1.3951639.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3951645.1527692266!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "Camille Bains, The Canadian Press\nVANCOUVER - Outrage over the federal government's announcement about buying the Trans Mountain pipeline to ensure it gets built could fuel unprecedented protests, says a prominent environmentalist who was at the forefront of British Columbia's so-called War in the Woods in the 1990s.\nTzeporah Berman said the fight against the pipeline expansion is even bigger than those over logging in Clayoquot Sound.\nCanadians are angry the government is shelling out $4.5 billion to purchase the Trans Mountain pipeline rather than investing in clean energy after Prime Minister Justin Trudeau's climate-change promises during the 2015 election and his later commitment to the Paris climate accord, she said.\n“My experience is that people are motivated by betrayal, they're motivated by a lack of fairness, they're motivated by a sense of shared common purpose and outrage. In this case we have all of that,” said Berman, who was cleared of aiding and abetting protesters at the Clayoquot blockade and is now an adjunct professor of environmental studies at York University in Toronto.\nBerman said the Liberal government “made a very big mistake” by backing Kinder Morgan's project and alienating voters to create “a perfect storm” that would prompt people to take action.\n“I think a lot of us who knocked on doors for the Trudeau government really believed them when they said they were going to bring evidence-based analysis and science and democratic process back to pipeline reviews.”\nBerman is a director of Stand.earth, one of the groups that organized an anti-pipeline protest in Vancouver on Tuesday after Finance Minister Bill Morneau announced the government's plans for the pipeline between Edmonton and Burnaby, B.C. Another protest is planned in Victoria on Thursday.\n“My expectation is that the outrage is going to grow and we're not just going it see it here in British Columbia but we're going to see it nationally and internationally,” she said, adding social media makes it possible for activists to connect in ways that didn't exist at the height of anti-logging protests in 1993.\n“We didn't have email, we didn't have cellphones. It was a remote location that took most people five to seven hours to get through. This is a pipeline project that runs through urban centres,” she said of Trans Mountain.\nKhelsilem, a Squamish Nation council member who goes by his first name, said the federal government's decision to pursue completion of the pipeline expansion threatens Indigenous communities if there was a spill of bitumen from increased tanker traffic in B.C. waters.\n“Trudeau had promised during the election that he would create a new environmental process that would protect Indigenous rights and that the Kinder Morgan project would be included and sent back to be done through the new process, and on both those counts he's failed completely,” he said.\nAlong with multiple legal challenges involving the pipeline, the Squamish Nation and five other First Nations are involved in a Federal Court of Appeal case that targets Ottawa's approval of the project.\n“The protesters and the opposition, and the civil disobedience is probably going to increase,” Khelsilem said.\n“Our mandate from our people is to continue to defend our rights as a people and to protect our territory, not just for us but for future generations. We're going to continue to stand with our allies that support our Indigenous rights and change the story of Canada, that Canada is no longer a country that disregards Indigenous rights.”",
    "source_domain": "bc.ctvnews.ca",
    "title": "Pipeline 'betrayal' could trigger unprecedented protests: activist",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/pipeline-betrayal-could-trigger-unprecedented-protests-activist-1.3951639"
}