{
    "authors": [],
    "date_download": "2018-02-02 23:08:15+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 08:26:00",
    "description": "About a dozen had to be rescued from their balconies at the building on George Ferguson Way.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fseveral-rescued-from-fire-at-abbotsford-apartment-1.3786894.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3786911.1517588764!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nAround a dozen people had to be rescued from an apartment building in Abbotsford Friday when a fire broke out early in the morning.\nAbout 30 firefighters were called to a 35-suite building at George Ferguson Way and Gladwin Road shortly after 2:30 a.m.\nThe fire started in the elevator lobby on the third floor. Some and flames blocked the hallways, so residents on the top floor could not escape. Approximately a dozen people had to be rescued from their balconies.\nEveryone got out safely, including seniors and families with pets.\nOne resident, who escaped from the second floor with her dog, said she'd woken up to the fire alarm ringing.\n\"I thought it was just an alarm, so I went back to bed,\" Olivia Knight said.\n\"I looked out the window and someone told me it was a real fire. So I grab my dog and by the time we got out the windows already burst and there was glass all over the ground and pretty big flames.\"\nAnother resident said the building has seen plenty of false alarms in the past, but that this time, she saw flames coming from the roof.\n\"I was praying that no one was killed, because they could have been, and I am grateful that no one was killed,\" Judith Eade said.\nFortunately, there were no major injuries reported. A few were treated for minor smoke inhalation and one injured his shoulder while coming down the ladder, Assistant Fire Chief Jeff Adams said.\n\"Crews did an outstanding job, command did a great job at getting people tasked out. We got the people off the balconies and we got the fire knocked down very quickly,\" Adams said.\nFirefighters were working to clear smoke from the building before allowing residents to return home.\nThose who live on the first two floors were let back in Friday morning, but there is severe damage to the third. Charred walls had to be ripped away, and investigators spent hours combing through ash and taking photos.\nPolice and fire officials are investigating the cause, but said so far it does not appear to be suspicious.\nWith a report from CTV Vancouver's Nafeesa Karim",
    "source_domain": "bc.ctvnews.ca",
    "title": "Several rescued from fire at Abbotsford apartment",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/several-rescued-from-fire-at-abbotsford-apartment-1.3786894"
}