{
    "authors": [
        "Dario Balca"
    ],
    "date_download": "2018-05-31 00:58:29+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 13:17:00",
    "description": "The Ladner Creek Trestle Bridge caught fire on Sunday and flames quickly spread to the forest below.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Ffire-on-historic-b-c-trestle-bridge-human-caused-officials-1.3952220.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3952226.1527718326!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A small but stubborn blaze that broke out on a historic trestle bridge near Hope, B.C. was likely human-caused, wildfire officials say.\nThe century-old Ladner Creek Trestle Bridge caught fire on Sunday, Donna MacPherson of the BC Wildfire Service's Coastal Fire Centre told CTV News Wednesday.\nWithin hours, the flames spread to the forest below via burning wooden ties falling off the bridge and into the canyon.\nCrews responded \"aggressively\" to stop the fire from spreading amid the warm and dry conditions, she said. Initial firefighting efforts included a helicopter with a rappel team. An air tanker also dropped retardant on either side of Ladner Creek.\n\"We wanted to make sure that the fire, if it started to move, wouldn't move sideways and it didn't,\" MacPherson said.\nCrews were still working to get the 2,000-square-metre blaze under control on Wednesday, but that afternoon, MacPherson said the service had pulled most firefighters from the scene.\nAccording to the information officer, the fire is \"being held,\" which means it is neither under control nor out of control. MacPherson said officials are closely monitoring the situation for any signs of the fire flaring up again.\nThe province's website lists the suspected cause of the blaze as human activity, but doesn't give any details on how it might have been ignited.\n\"We don't believe it was lightning so that means it was human-caused of some kind,\" MacPherson said. \"There is an investigation that's ongoing that the RCMP are involved in.\"\nAn Instagram user, however, posted saying someone had tossed a cigarette on the decommissioned stretch of railway.\n\"Last Sunday a friend and I went out to the Ladner creek trestle for the first time to see it with our own eyes, only to find out minutes before someone tossed a cigarette butt on to the historic railroad bridge which ended up catching on fire and spreading to the forest below,\" Dylan Heringa wrote.\nFire investigators are on scene trying to confirm the cause.\nA three-member fire suppression crew remains at the bridge, but officials say the steep terrain is making firefighting efforts difficult.\n\"The fire has posed a challenge to our crews to be able to get down into that inaccessible area, but they are making pretty good progress,\" MacPherson said.\nShe added that burning wooden ties can still be seen falling off the trestle, but officials have otherwise given few details about the extent of the damage to the bridge.\nThe blaze comes as one of the driest Mays on record sparks concerns of a long and severe wildfire season on the South Coast.\n\"It's certainly not uncommon to see fires this time of year. What has been unusual is how aggressive these fires have been, particularly over the last few weeks,\" said Kevin Skrepnek, B.C.'s chief fire information officer.\n\"The fire behaviour we're seeing out there is more reflective of what we typically see in June or July, not this early in the spring.\"\nDistrict of North Vancouver fire officials said the district has seen 16 small grass fires in the past week alone, and the majority appear to have been \"caused by people not properly discarding their smoking materials, such as cigarettes.\"\nWest Vancouver has seen five small fires in the past month, including three in the last seven days.\nSkrepnek said this kind of fire activity \"has everything to do\" with weather conditions.\n\"The last month has been unseasonably hot and dry in many parts of the province and that's definitely driven the level of activity we're seeing right now,\" he said.\nBut the weather in June, he said, could significantly alter the outlook for the upcoming wildfire season.\n\"June is a real critical month,\" he said, adding that despite a wet spring last year, a dry June set the stage for the most destructive wildfire season in the province's history.\n\"The amount of rain we get between now and the Canada Day long weekend is absolutely crucial for how the fire season is going to play out.\"\nWith files from CTV Vancouver's Shannon Paterson",
    "source_domain": "bc.ctvnews.ca",
    "title": "Fire on historic B.C. trestle bridge human-caused: officials",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/fire-on-historic-b-c-trestle-bridge-human-caused-officials-1.3952220"
}