{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-07-04 22:32:45+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 11:38:00",
    "description": "Many of the dogs showed signs of psychological distress, the SPCA said, but most have since been adopted.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fb-c-man-charged-under-criminal-code-after-46-dogs-puppies-seized-1.3999837.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3999839.1530729204!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A man has been charged with animal cruelty months after nearly four dozen neglected dogs were seized from a rural property in B.C.'s Central Interior.\nThe BC SPCA seized 46 adult dogs and puppies, including American Eskimo, border collie, husky and Samoyed breeds from an area north of Williams Lake in February.\nFollowing an investigation, Terry Baker has been charged with two counts of animal cruelty under the Criminal Code of Canada.\n\"The dogs were seized because of lack of shelter, poor sanitation and inadequate veterinary care but the biggest issue once they were in our care was that they were terrified of human contact,\" Marcie Moriarty said in a statement Wednesday.\nThe BC SPCA's chief prevention and enforcement officer said staff worked around the clock to help the dogs learn to handle everyday sights and sounds, and faced several challenges when it came to treatment.\n\"One of the complications was that several of the dogs were pregnant and gave birth shortly after coming into SPCA care, but were too frightened to let staff near them or their puppies,\" Moriarty said.\nShe said many of the dogs showed signs of serious psychological distress, and helping them is a long-term and complicated process.\nFortunately, many of the dogs learned to live with humans, and of the 46 taken in, only eight are still in SPCA care. The others have been adopted and are living in new homes, something Moriarty said is \"quite incredible.\"\nBaker could face five years in jail if convicted of the charges. He could also be ordered to pay a fine up to $10,000, and be given a lifetime ban on owning animals.",
    "source_domain": "bc.ctvnews.ca",
    "title": "B.C. man charged under Criminal Code after 46 dogs, puppies seized",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/b-c-man-charged-under-criminal-code-after-46-dogs-puppies-seized-1.3999837"
}