{
    "authors": [],
    "date_download": "2017-06-15 04:41:21+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 18:46:00",
    "description": "Harry Peters said the wooden work of art was stolen from the back porch of his Burnaby home last week.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fit-means-the-world-man-reunited-with-sculpture-honouring-late-wife-1.3460049.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3457849.1497393018!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "A Vancouver man has been reunited with a stolen sculpture he carved for his late wife thanks to the kindness strangers.\nHarry Peters said the wooden work of art was stolen from the back porch of his Burnaby home last week.\n“To me, it’s a headstone and you don’t fool with that stuff,” he told CTV Vancouver.\nPeters spent thousands of hours carving a wooden orca whale for his wife, Laurie, who died of a stroke in 2006.\n“I wanted to honour her as best I could because I loved her so much,” the widower said.\nWhen the whale went missing, Peters’ friends launched a social media campaign asking for the public’s help in locating the sculpture.\nPeople quickly reported seeing the carving all over town. First, a bus driver said he saw two men taking it for a ride on Hastings Street. Someone then reported saw the sculpture for sale on the Downtown Eastside.\nPeters’ beloved carving was finally located at The Unique Antique, an antiques store on Main Street near East 2nd Avenue.\nStore owner Randy Sowinski said he bought the piece for $250, but gave it back to Peters free of charge once he heard his story.\n“I’m just really happy that they got it back,” Sowinski said.\nPeters said he is thankful for Sowinski and everyone else who helped track the sculpture down.\n“It means the world to me,” he said.\nFor Peters, the emotional journey has made the piece that much more valuable.\n“Sometimes when you lose something and get it back, it’s better than never losing it at all,” he said. “It gives you a heightened appreciation.”\nFrom now on, Peters said he’ll keep the sculpture indoors.\nWith a report from CTV Vancouver’s St. John Alexander",
    "source_domain": "bc.ctvnews.ca",
    "title": "'It means the world': Man reunited with sculpture honouring late wife",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/it-means-the-world-man-reunited-with-sculpture-honouring-late-wife-1.3460049"
}