{
    "authors": [],
    "date_download": "2017-10-07 04:28:06+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 13:59:00",
    "description": "The former transportation minister is poised to enter the leadership race as the eighth candidate.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Ftodd-stone-expected-to-throw-hat-into-liberal-leadership-race-1.3622871.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.2284873.1426635969!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nVICTORIA - British Columbia's Liberal leadership race is expected to expand to eight candidates, with former transportation minister Todd Stone poised to enter the contest.\nThe Kamloops-South Thompson member of the legislature has scheduled three campaign-style events Tuesday stopping in Surrey, Victoria and finishing the day with an event at Thompson Rivers University in his hometown of Kamloops.\nAn email from former Liberal cabinet minister Peter Fassbender says B.C. needs a fresh vision to keep the province on track and Stone will make a special announcement about the Liberals party's future.\nStone released a YouTube video in September saying he was considering whether to run, then added that if he were to be leader, the B.C. Liberal Party would not accept the taxpayer subsidies that are being proposed by the minority New Democrats.\nFormer Surrey mayor Dianne Watts announced her intentions for the party's top job last month, along with 38-year-old Terrace businesswoman Lucy Sager and five current provincial Liberal politicians, Sam Sullivan, Mike Bernier, Andrew Wilkinson, Mike de Jong and Michael Lee.\nThe first of six candidate debates is set for Oct. 15 in Surrey, with party members electing a new leader to replace former premier Christy Clark in early February.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Todd Stone expected to throw hat into Liberal leadership race",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/todd-stone-expected-to-throw-hat-into-liberal-leadership-race-1.3622871"
}