{
    "authors": [],
    "date_download": "2018-07-04 22:33:09+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 11:28:00",
    "description": "Karin and Catherine Adams were convicted of animal cruelty in 2015 and given a ban on owning animals.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2F16-distressed-dogs-seized-from-former-puppy-mill-operators-spca-1.3999829.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3999844.1530729317!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThe BC SPCA has seized more than a dozen distressed dogs from a pair of former puppy mill operators who were banned from owning animals just three years ago.\nThe dogs were found on a property in Quesnel, B.C., where they were being kept in undersized cages that were soaked with urine and feces, according to the animal welfare agency.\nThe SPCA said the area was poorly ventilated as well, and the dogs had little or no access to water.\nChief prevention and enforcement officer Marcie Moriarty said the animals were in the care of Karin and Catherine Adams, a mother-daughter duo who were convicted of animal cruelty in 2015.\n“It is extremely frustrating when we deal with repeat offenders, particularly those who breach the terms of their sentencing,” Moriarty said in a news release. “However, we are pleased that these dogs are now safe and are getting the attention and care they need.”\nThe Adamses' sentence included a 20-year ban on owning animals.\nThe SPCA said it will be recommending fresh cruelty charges against the pair, and that they should face additional charges for violating the conditions of their original sentence.\nThe seized dogs, which included poodles, Portugese water dogs, corgi-border collie crosses and miniature pinschers, are being taken care of at various SPCA shelters in the region.",
    "source_domain": "bc.ctvnews.ca",
    "title": "16 distressed dogs seized from former puppy mill operators: SPCA",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/16-distressed-dogs-seized-from-former-puppy-mill-operators-spca-1.3999829"
}