{
    "authors": [
        "St. John Alexander",
        "Kendra Mangione"
    ],
    "date_download": "2017-02-15 01:58:00+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Major retailers hit hard by shoplifting are fighting back using technology and techniques to catch thieves in the act.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fto-catch-a-thief-metro-vancouver-stores-reveal-how-they-catch-shoplifters-1.3285783.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3285799.1487119230!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Shoplifting costs Canadian businesses billions of dollars, and no store is immune. Major retailers hit hard by the crime are fighting back using technology and techniques to catch thieves in the act.\nIn Part Two of a CTV News investigation, St. John Alexander visited a London Drugs loss prevention office in the Vancouver neighbourhood of Kitsilano.\nLearn more about fencing operations in Part One of the investigation: Hidden cameras reveal shoplifting schemes preying on the vulnerable\nTheir Vine Street location has 49 high-tech cameras, able to zoom from wide-angle shots all the way in to the fine print on products.\n\"This camera system is actually very sophisticated. I like to think it's one of the best in the industry,\" loss prevention manager Dave Tor told CTV News.\nThe cameras allow those in the control room to monitor every corner of the store. Video can be scrutinized in the office or in London Drugs' central command centre.\n\"We're just looking for any type of suspicious behaviour,\" Tor said, demonstrating how the cameras work.\nThese kinds of monitors have captured shoplifters grabbing items like boxes of skin cream and nail polish.\nStephen O'Keefe, a theft prevention consultant with the Retail Council of Canada, says some camera systems are so savvy they can spot items missing from shelves and reveal who was the last person in the area.\n\"The CCTV system takes over and initiates the investigation,\" O'Keefe says.\nSome systems are able to track so-called \"wardrobe shoppers,\" those who buy items of clothing, wear them and return them the next day.\nThieves strike large stores approximately 15 to 20 times a day, and have a larger impact than some may realize.\nO'Keefe said shoplifting was one of the reasons Canadian department store chain Eaton's folded.\nLondon Drugs has its own crime department, a loss prevention army of almost 100 people. While staff members monitor video feeds from back offices, some stores also use security guards posing as customers to keep an eye out on the floor.\nThey're trained to watch for signals and indicators of crime, but it's tricky work when thieves range from children to the elderly.\nOther staff members are taught the concept of aggressive hospitality, greeting and helping as many customers as possible.\n\"Bad guys want to be anonymous. They don't want anybody to notice that they're there,\" said Tony Hunt, London Drugs' loss prevention general manager.\nBut even with measures in place at most stores to combat the shoplifting problem, Canadian retailers estimate that 13 million thefts go undetected each year.\nThe most likely items to be stolen are those that are easy to sell, like cosmetics, teeth whiteners, batteries and razors.\nMany of these items are then purchased for 10 cents on the dollar, and resold on the streets, online, out of condos and basements suites or overseas.\nWith a report from CTV Vancouver's St. John Alexander",
    "source_domain": "bc.ctvnews.ca",
    "title": "To catch a thief: Metro Vancouver stores reveal how they catch shoplifters",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/to-catch-a-thief-metro-vancouver-stores-reveal-how-they-catch-shoplifters-1.3285783"
}