{
    "authors": [],
    "date_download": "2018-02-04 02:02:41+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 16:11:00",
    "description": "Two police vehicles collided with the suspects' on Clark Drive near East 1st Avenue.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fpolice-arrest-2-people-after-east-van-bank-robberies-1.3788567.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3788629.1517703425!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nVancouver police arrested two people at the intersection of Clark Drive and East 1st Avenue Saturday afternoon, after reports of two bank robberies in the area within a half-hour of each other.\nNumerous police vehicles responded to the intersection shortly after 2 p.m., when the suspect vehicle - a stolen Porsche Cayenne - crashed into several other vehicles.\nTwo police vehicles were nearby and were able to block the Cayenne and prevent the suspects inside from escaping, police said.\nPolice arrested a man and a woman who were inside the suspect vehicle.\nRyland Chernomaz was on Clark Drive at the time of the incident. He said he saw the police vehicles do U-turns and hit the Cayenne, then saw officers get out with their guns drawn.\n“He’s on the ground, there’s another girl with him, crying,” Chernomaz said of the moment of the arrest. “I’ve never seen anything like it. Crazy stuff.”\nThe robberies took place on Commercial Drive and on East Broadway at Commercial.\nFour ambulances could be seen at the scene, and police said four people were transported to hospital with minor injuries.\nA total of four civilian vehicles were involved in the incident.\nClark Drive was closed for more than an hour as officers from VPD’s Major Crime and Collision Investigation Unit investigated.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Police arrest 2 people after East Van bank robberies",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/police-arrest-2-people-after-east-van-bank-robberies-1.3788567"
}