{
    "authors": [],
    "date_download": "2018-05-30 20:48:23+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 13:17:00",
    "description": "The Ladner Creek Trestle Bridge caught fire on Sunday and flames quickly spread to the forest below.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Ffire-on-historic-b-c-trestle-bridge-likely-human-caused-officials-1.3952220.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3952226.1527711353!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA small but stubborn blaze continues to burn on and under a historic trestle bridge near Hope, B.C.\nJeanne Larsen of the BC Wildfire Service told The Canadian Press the century-old Ladner Creek Trestle Bridge caught fire on Sunday. Within hours, the flames spread to the forest below, and crews were still working to get the 2,000-square-metre blaze under control on Wednesday.\nThe province's website lists the suspected cause of the fire as human activity, but doesn't give any details on how the blaze might have been ignited.\nAn Instagram user, however, posted saying someone had tossed a cigarette on the decommissioned stretch of railway.\n\"Last Sunday a friend and I went out to the Ladner creek trestle for the first time to see it with our own eyes, only to find out minutes before someone tossed a cigarette butt on to the historic railroad bridge which ended up catching on fire and spreading to the forest below,\" Dylan Heringa wrote.\nFire investigators are on scene trying to confirm the cause.\nA helicopter is helping the three-member fire suppression crew, but officials say the steep terrain is making firefighting efforts difficult.\nAccording to the service, the fire is \"being held,\" which means it is neither under control nor out of control.\nLarsen gave few details about the extent of the damage caused to the bridge.\nWith files from The Canadian Press",
    "source_domain": "bc.ctvnews.ca",
    "title": "Fire on historic B.C. trestle bridge likely human-caused: officials",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/fire-on-historic-b-c-trestle-bridge-likely-human-caused-officials-1.3952220"
}