{
    "authors": [],
    "date_download": "2018-02-02 23:08:16+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 07:46:00",
    "description": "The Williams Lake Indian Band argued the pre-Confederation colony of B.C. failed to protect its territory.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fsupreme-court-sides-with-b-c-first-nation-in-ancestral-land-dispute-1.3786826.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.2223758.1474654408!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nOTTAWA -- The Supreme Court of Canada has sided with a British Columbia First Nation in a dispute over its traditional lands.\nIn a split decision released Friday, the high court restored a tribunal ruling in favour of the Williams Lake Indian Band, which had argued the pre-Confederation colony of British Columbia failed to protect its territory from encroaching settlers.\nThe band also said Canada neglected to adequately remedy the wrong following B.C.'s entry into Confederation in 1871.\nInstead of reclaiming the band's ancestral village lands, Canada set aside different, nearby territory for the First Nation.\nThe band is one of 17 communities of the Shuswap Nation, which traditionally occupied lands around Williams Lake. The municipality, 550 kilometres north of Vancouver, now has a population of 11,000.\nSeven years ago, the band brought a claim related to about 1,000 acres at the foot of Williams Lake, including the present city's downtown.\nIn 2014, the federal Specific Claims Tribunal upheld the band's arguments concerning the original lands, finding that both the colony and Canada had breached their duties.\nThe Federal Court of Appeal overturned the tribunal's decision two years ago, concluding that Canada's post-Confederation actions were sufficient.\nA majority of the Supreme Court agreed that the band had a specific interest in the lands at issue and that both pre-Confederation British Columbia and Canada had breached their obligations in failing to respect this interest.\nThe court's decision now clears the way for the tribunal to consider compensation.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Supreme Court sides with B.C. First Nation in ancestral land dispute",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/supreme-court-sides-with-b-c-first-nation-in-ancestral-land-dispute-1.3786826"
}