{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2017-06-15 04:41:14+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 18:57:00",
    "description": "Elite Farm Services said all footage will be reviewed at the end of the day, then saved for 30 days.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fstaff-to-wear-body-cameras-after-video-shows-abuse-at-chicken-farms-1.3460055.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3456545.1497316155!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A farm labour company at the centre of animal abuse allegations has launched a new policy that some staff will wear body cameras inside its barns.\nIn a statement released Wednesday, Elite Farm Services Ltd. said it will be mandatory for one supervisor and two staff members to wear cameras on their safety vests. The statement said all footage will be reviewed at the end of the day, then saved for 30 days.\nThe video system will be put in place within two weeks, Elite Services said, and cameras are currently being tested.\nThe move was part of an \"organization-wide refresh and retraining\" that began Tuesday, the day after video was released showing shocking abuse of chickens at farms operated by the company. Elite Services works directly for Sofina Foods Inc., which sells much of its chicken under the Lilydale brand in major grocery stores including Safeway and Loblaws.\nThe footage was shot by a Mercy for Animals whistleblower working undercover at several farms in the British Columbia.\nMercy for Animals said the footage showed workers committing \"sadistic\" acts against the birds, including ripping legs off live animals, slamming chickens against crates and mimicking sex acts. Other parts of the video showed chickens being thrown, kicked, punched and run over by forklifts.\nThe video, which was obtained by CTV News, was recorded over the month of May by someone hired as a chicken catcher – an employee responsible for catching the birds and loading them into crates so they can be processed. The incidents are being investigated by both the BC SPCA and the Canadian Food Inspection Agency. A complaint has also been filed with the RCMP.\nOn Wednesday, Elite Services called the events caught on camera \"horrific,\" adding that they are \"in no way representative of the practices or policies of our company.\"\nThe company also admitted that key details were left out of a statement on Tuesday when it promised to take action. Company president Dwayne Dueck said a crew supervisor and five other employees had been fired for not adhering to its \"strict\" animal care guidelines.\nBut on Wednesday, Dueck said \"timelines were confused,\" at the time of the statement, and that two of the employees had actually been dismissed prior to the release of the video. He added that one more had been dismissed following that statement, bringing the total to seven.\nDueck has refused requests from CTV News for interview. The company has hired a crisis communications consultant to speak on its behalf.\nRepresentatives of the company would not comment on accusations made by a fired supervisor and the whistleblower that management knew about the abuse before the video.\nThe scandal has increased calls for industry-wide changes. Industry insiders including Ian Duncan, Canada's foremost expert on poultry welfare, said that part of the problem is that chicken catching happens inside darkened barns and enclosed sheds where there are few witnesses.\n\"I've never seen anything as obviously cruel as that before,\" Duncan said after viewing the footage. \"I think we've got to somehow make the whole process more visible.\"\nThe allegations came at a time when the industry was already working to improve its image, launching ads created to convince consumers that Canadian chicken is ethical.\n\"There are codes of practice we have in place at our farms. We monitor and we manage. If you've got staff, they sign off on how they're going to act and behave,\" said Ray Nickel of Chicken Farmers of Canada.\nBut some aren't sure if that's enough.\n\"I would say that these codes of practice are not helping to improve the welfare of animals right now,\" animal law lawyer Rebeka Breder said.\nFor more information on Mercy for Animals' probe, visit its website.\nWith reports from CTV News' Melanie Nagy and CTV Vancouver's Scott Roberts",
    "source_domain": "bc.ctvnews.ca",
    "title": "Staff to wear body cameras after video shows abuse at chicken farms",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/staff-to-wear-body-cameras-after-video-shows-abuse-at-chicken-farms-1.3460055"
}