{
    "authors": [],
    "date_download": "2018-07-04 22:32:51+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 12:31:00",
    "description": "The driver of the grey Dodge Nitro is described as a South Asian male with a heavy build and a shaved head.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fburnaby-hit-and-run-sends-rcmp-officer-to-hospital-1.3999916.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3999939.1530732566!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nMounties in Burnaby are looking for a suspect vehicle and its driver after a hit-and-run that sent an officer to hospital Wednesday.\nThe officer, who was on foot at the time, was trying to stop a driver who was allegedly using an electronic device behind the wheel at around 10 a.m., the RCMP said in a statement.\nAccording to investigators, \"the police officer signalled for the driver to pull over, the driver failed to do so and struck the officer with his vehicle,\" police said.\nThe suspect was last seen driving south on Willingdon.\nThe Mountie, who has not been identified, suffered a broken arm and remains in hospital.\n\"Incidents like this show the danger our officers face each and every day as they perform their duties in the City of Burnaby,\" Supt. Chuck McDonald said in the release.\n\"What started as a traffic stop has left one of our members injured, we’d ask that the driver of the vehicle that struck this officer to do the right thing and contact police.\"\nThe suspect vehicle is believed to be a grey Dodge Nitro SUV.\nThe driver is described as a South Asian male with a heavy build, a shaved head and a tattoo on his left arm. He was wearing a white T-shirt and grey sweatpants at time of the incident.\nAnyone with information is asked to contact investigators at 604-646-9999.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Burnaby hit-and-run sends RCMP officer to hospital",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/burnaby-hit-and-run-sends-rcmp-officer-to-hospital-1.3999916"
}