{
    "authors": [],
    "date_download": "2017-01-02 08:54:00+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "North Shore Rescue says the pair was returning from Mount Seymour’s first peak when they got lost.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fi-know-better-2-skiers-rescued-after-spending-nye-on-mountain-1.3223928.json",
    "image_url": "http://bc.ctvnews.ca/polopoly_fs/1.3223934.1483308173!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nTwo skiers were airlifted off a North Shore mountain on Sunday morning by North Shore Rescue crews after spending their New Year’s Eve in the wilderness.\nNorth Shore Rescue says the pair was on their way back from Mount Seymour’s first peak when they got lost around 6 p.m., and ended up wandering down Suicide Gully.\nRescued skier David Lavallee said he and his friend Kristy Jones took a turn in search of fresh powder, realizing they were lost as it started to get dark.\n“At a certain moment you hit the panic button and it’s kind of panic mode,” he said, noting he’s a backcountry skier with two decades of experience. “We’re probably not the first people to make that mistake.”\nCrews managed to make cell phone contact with the skiers, and directed them to an emergency cache to spend the night.\n“When they reported that they were lost the terrain actually funneled them into that gully and to our rescue cache,” said North Shore Rescue’s Simon Jackson, noting there was food, blankets and a radio at the cache.\n“They had not filed a trip plan, so if we had not been able to get cell contact, this would have been a very, very different rescue.”\nThe duo wanted to continue down the gully, but rescue crews told them to stay put given the steep terrain and high avalanche risk.\nAfter spending a chilly night on the mountain, the skiers were airlifted out of Suicide Gully early Sunday morning.\nLavallee says the next time he skis, he plans to bring the right equipment..\n“If it happened to me, it can happen to anyone,” said Lavallee. “After you’ve been doing this for a while you sort of let your guard down… It’s been very humbling, mortifying, and incredibly embarrassing. I know better than this.”\nWith files from CTV Vancouver’s David Molko",
    "source_domain": "bc.ctvnews.ca",
    "title": "‘I know better’: 2 skiers rescued after spending NYE on mountain",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/i-know-better-2-skiers-rescued-after-spending-nye-on-mountain-1.3223928"
}