{
    "authors": [],
    "date_download": "2018-03-20 04:13:44+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 18:32:00",
    "description": "Mounties responded to calls about a \"distraught male\" in the area of 10 Avenue and 161A Street.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fman-dead-after-interaction-with-police-in-south-surrey-1.3849997.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3850002.1521509492!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nBritish Columbia's police watchdog says it is investigating after a man died following an interaction with police in South Surrey Monday.\nMounties and paramedics responded to calls about a \"distraught male\" who was screaming in the intersection of 10 Avenue and 161A Street shortly after 1:30 p.m.\nThe officers' arrival led to a \"physical struggle,\" the Independent Investigations Office said. The man went into cardiac arrest and died at the scene at around 3 p.m., despite efforts to resuscitate him, according to the IIO.\n\"He was lying on the road crawling around…just freaking out, just spazzing out,\" said Brian Roffey, who lives in the usually quiet residential area. \"The next thing I heard was that he had passed away on my neighbour's front lawn.\"\nRoffey said the man was saying there were people after him and lights coming toward him. Several civilians in the area tried to calm him down before police got there, Roffey added, but no one touched him because he was too violent.\nIn a separate release, Surrey RCMP said officers had tried speak with the man before trying to take him into custody.\nThe IIO was notified after he was pronounced dead and began investigating.\nAuthorities temporarily closed the area to traffic. The BC Coroners Service was also called in.\nAnyone who witnessed the incident is asked to contact investigators at 1-855-446-8477.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Man dead after interaction with police in South Surrey",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/man-dead-after-interaction-with-police-in-south-surrey-1.3849997"
}