{
    "authors": [
        "Dirk Meissner"
    ],
    "date_download": "2018-02-02 23:08:22+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 09:58:00",
    "description": "The prime minister faced criticism over the Kinder Morgan's pipeline expansion, but is not backing down.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fpipeline-critics-greet-trudeau-with-jeers-at-nanaimo-town-hall-1.3787133.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3787474.1517604910!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dirk Meissner, The Canadian Press\nNANAIMO, B.C. - Prime Minister Justin Trudeau spoke over jeers Friday at a rowdy town hall meeting in Nanaimo, B.C., as he defended his government's decision to support the expansion of the Trans Mountain pipeline through the province.\nTrudeau said the pipeline is a key component of the federal government's approach to cutting greenhouse gas emissions, which means Ottawa had to get a national agreement on carbon pricing that will allow Canada to meet its international commitments on climate change.\n“But in order to do that, part of moving forward is approving the Kinder Morgan pipeline, which will be able to get our resources responsibly and safely to new markets across the Pacific,” he said, adding the government's ocean protection plan will better protect the coastline from oil spills at the same time.\n“It is in the national interest to move forward with the Kinder Morgan pipeline, and we will be moving forward with the Kinder Morgan pipeline.”\nThe town hall was often raucous.\nThe prime minister faced a mix of cheers and boos on his arrival. When he spoke about the pipeline, he was repeatedly interrupted, causing him to show his frustration at one point by exclaiming: “Come on! Come on! Really?”\n“If you can't respect the people in this room, you need to leave,” he said before asking the police to remove those who were disrupting the event.\nPolice physically removed a man and a woman as someone else shouted: “Shame on you Trudeau.”\nTrudeau spoke to an overflow crowd in the gymnasium at Vancouver Island University, while dozens of protesters carried anti-pipeline placards outside.\nThe final town hall of his cross-country tour started almost an hour late because of travel delays caused by weather, officials said. So many people wanted to attend the event that organizers were shifting seating in the gym at the last minute to make room.\nB.C. announced proposals earlier this week that would ban increased shipments of diluted bitumen off its coast until it can determine that shippers are prepared and able to properly clean up a spill.\nAlberta Premier Rachel Notley has called that an unconstitutional attempt to get around federal approval of the Kinder Morgan project, which would triple the capacity of the pipeline and increase the number of tankers in Georgia Strait from five to 34 per month.\nNotley promised to suspend electricity talks with the province in its first step to fight against the B.C. government's proposal. Up to $500 million annually for B.C.'s coffers hangs in the balance, Notley said.\nB.C. Premier John Horgan said earlier this week his government consulted Alberta and Ottawa about his province's intentions, which includes appointing a scientific advisory panel to study the issue.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Pipeline critics greet Trudeau with jeers at Nanaimo town hall",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/pipeline-critics-greet-trudeau-with-jeers-at-nanaimo-town-hall-1.3787133"
}