{
    "authors": [],
    "date_download": "2018-03-20 04:13:47+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 17:42:00",
    "description": "Markle played FBI agent Amy Jessup in the sci-fi show Fringe and officer Leah Montoya on CSI: Miami.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fphotos-show-meghan-markle-training-to-use-gun-at-lower-mainland-range-1.3849904.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3849923.1521506427!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nJust two months before she's set to become the newest member of the British royal family, photos have emerged of Meghan Markle showing off her less regal side at gun range in B.C.'s Lower Mainland.\nThe images from 2009, obtained by a British tabloid, show the soon-to-be duchess pointing a semi-automatic Glock pistol at the Thompson Mountain Sportsmen Association in Pitt Meadows.\nMarkle was likely training for one of two television shows in which she played a gun-toting police officer.\n\"We do get a lot of actors out here that are brought up…to train to get the feel of the firearm,\" said Dave Ruttan, the president of the association, adding that it's \"pretty cool\" to have had someone at the range who later went on to become royalty.\nAccording to Ruttan, actors often have to learn to shoot real guns so they can mimic the recoil of the firearm when firing blanks on set.\nHe wasn't there when Markle received her training, but said the 36-year-old \"looked like a natural,\" based on the photos.\n\"I'm sure that the guy or whoever's training her put her in the right position as to how it's supposed to be done,\" he said.\nThe royal bride-to-be has had more than one opportunity to show off her skills during her acting career, portraying FBI agent Amy Jessup in the sci-fi show Fringe and police officer Leah Montoya on CSI: Miami.\nMarkle is set to marry Prince Harry on May 19.\nWith files from CTV Vancouver's Sarah MacDonald",
    "source_domain": "bc.ctvnews.ca",
    "title": "Photos show Meghan Markle training to use gun at Lower Mainland range",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/photos-show-meghan-markle-training-to-use-gun-at-lower-mainland-range-1.3849904"
}