{
    "authors": [],
    "date_download": "2018-02-04 01:01:39+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 11:49:00",
    "description": "A sometimes bruising leadership campaign ends Saturday in Vancouver.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fbc-liberals-to-elect-new-leader-saturday-1.3788371.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3788268.1517677151!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nVANCOUVER -- A sometimes bruising leadership campaign ends today in Vancouver for British Columbia's Liberals as they elect a new leader who will be tasked with returning the party to power after a 16 year term in office that ended last summer.\nAn estimated 60,000 party members were eligible to vote online and by phone to replace Christy Clark, who resigned after the New Democrats formed a minority government with the support of the Green party following a non-confidence vote that brought down the Liberals.\nThe field of six candidates includes three veterans with deep cabinet experience, two former big city mayors and a first-time member of the legislature from Metro Vancouver.\nMike de Jong, Andrew Wilkinson and Todd Stone were longtime members of Clark's cabinet.\nSam Sullivan, a former Vancouver mayor, was appointed to cabinet in the dying days of Clark's government last summer.\nThe field also includes Michael Lee, a Vancouver lawyer who was elected to the legislature last spring, and Dianne Watts, a former Conservative MP and one-time mayor of Surrey.\nThe B.C. Liberal Party is not affiliated with the federal Liberals. It describes itself as \"a made-in-B.C. free enterprise coalition\" that includes members of the federal Conservative and Liberal parties.\nGetting the party back to power after a lacklustre election campaign last May has been a focus of the leadership campaign.\nThere has been finger-pointing in debates over who was to blame for the Liberal downfall, despite B.C. boasting the strongest economy in Canada.\nSome candidates criticized the party's old guard for failing to address transportation, housing and social policy issues that led to losses in seat-rich Metro Vancouver, once a Liberal stronghold.\nDe Jong, the former finance minister, set himself apart from the field, defending the Liberal record as he took heat for his tight-fisted control of the province's purse strings that meant programs aimed at easing financial pressures for people never made it off the drawing board.\nStone, his former cabinet colleague, acknowledged the Liberals were strong economic managers as he argued the party could have done a better job of sharing the wealth, including raising welfare rates.",
    "source_domain": "bc.ctvnews.ca",
    "title": "BC Liberals to elect new leader Saturday",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/bc-liberals-to-elect-new-leader-saturday-1.3788371"
}