{
    "authors": [],
    "date_download": "2017-06-14 20:31:12+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 08:26:00",
    "description": "A stranger forced his way into James Goertzen's home Tuesday afternoon, but Goertzen fought back.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fabbotsford-man-fights-off-home-invasion-suspect-with-baseball-bat-1.3458881.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3458889.1497453869!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA terrifying home invasion attempt in B.C.'s Fraser Valley was thwarted late Tuesday afternoon thanks to a determined resident with a baseball bat.\nJames Goertzen was home with his wife when someone started knocking on the door of their Bevan Avenue residence around 6:30 p.m.\nBelieving it was company, Goertzen opened the door, only to find a stranger who immediately forced his way inside – but Goertzen fought back.\n\"I have a baseball bat by the door, and I hit him in the sternum with it and he bent over a little bit,\" Goertzen said.\nA scuffle ensued, during which Goertzen said he put the intruder \"in a death-lock and held him until the cops came.\"\nPolice were called to the property and found the two men in a struggle when they arrived. Sgt. Patrick Dyck said the homeowner was unscathed, but the suspect was injured.\n\"As a result of the struggle with the homeowner, the suspect received minor injuries and was subsequently taken to Abbotsford hospital for assessment,\" Dyck said.\nGoertzen's wife was also checked over by ambulance paramedics as a precaution.\nPolice are still investigating the home invasion attempt, but said it appears the couple's home was targeted completely at random.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Abbotsford man fights off home invasion suspect with baseball bat",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/abbotsford-man-fights-off-home-invasion-suspect-with-baseball-bat-1.3458881"
}