{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-07-04 22:32:48+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 14:47:00",
    "description": "Those who passed through the airport Saturday, June 23 should watch for symptoms of the virus.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fyvr-passengers-may-have-been-exposed-to-measles-bccdc-1.4000110.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.2217040.1422899916!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Public health officials are warning passengers who recently flew from India to Vancouver or passed through the local airport that they may have been exposed to measles.\nAn infectious individual is known to have taken two flights last month, first from New Delhi to Guangzhou, from Guangzhou on to Vancouver.\nThose who took China Southern flights CZ 3028, which departed June 23 at 11:55 a.m., or CZ 377, which departed June 24 at 12:50 a.m., may have come in contact with the virus.\nIn addition, BC Centre for Disease Control said anyone who was at the Vancouver International Airport on Saturday, June 23 after 9:30 p.m. should be wary.\nAs some of the passengers and flight crew may have travelled on to other destinations in Canada, the BCCDC is also warning Canadian and Pacific Northwest public health officials of the case.\nTravellers are asked to check their immunization status. The majority will be immune, but those including infants and people who haven't been given the vaccine are at risk.\nMeasles is highly infectious, and can be passed on when a person with the virus breathes, coughs or sneezes. The virus can live in closed areas such as bathrooms for as long as two hours after an infected person has left, health officials say.\nSymptoms can show up between a week and three weeks after exposure – in this case by about July 15.\nThose symptoms include fever, cough, runny nose, red eyes and a rash that starts in the centre of the body and face and spreads to limbs. The rash lasts at least three days.\nAnyone who may have been exposed and develops the above symptoms is asked to contact their doctor and inform them they may have measles. Doctors will arrange to see patients in a way that avoids potentially spreading the virus to others at the facility.\nThose who are concerned but don't have symptoms can call 811 and speak to a nurse.\nAnyone born after 1970 should have received two doses of the measles vaccine, which is often given as a combined measles, mumps, rubella vaccine (MMR). Canadians born after 1970 and before 1994 may have only received one dose, and should get a second.\nThose born prior to the '70s are likely to be immune due to prior infection, and those who have had both doses should also be protected.\nThe BCCDC also advised those planning to travel abroad to review their immunization records before leaving. There has been a resurgence of measles in the last several years, including in Western Europe.",
    "source_domain": "bc.ctvnews.ca",
    "title": "YVR passengers may have been exposed to measles: BCCDC",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/yvr-passengers-may-have-been-exposed-to-measles-bccdc-1.4000110"
}