{
    "authors": [
        "Andrew Weichel",
        "Maria Weisgarber"
    ],
    "date_download": "2018-07-04 22:32:36+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 13:39:00",
    "description": "Police have begun the process of removing activists from underneath the Ironworkers Memorial Bridge, where they have been blocking oil tanker traffic since early Tuesday morning.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fpolice-moving-in-to-remove-tanker-blockade-from-ironworkers-bridge-1.3999990.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.4000009.1530736653!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "Update: Police have begun the process of removing activists from underneath the Ironworkers Memorial Bridge, where they have been blocking oil tanker traffic since early Tuesday morning.\nVideo from CTV's Chopper 9 helicopter shows a handful of officers gathered on the catwalk, where five of the Greenpeace protesters were staying.\nIt's unclear how police plan to extract the seven other activists who are dangling below the bridge in climbing harnesses.\nMore to come…\nPrevious story: The activists who are suspended in air below a busy Metro Vancouver bridge to block oil tanker traffic say they are feeling energized and determined on the second day of their protest.\nA group of 12 pipeline opponents from Greenpeace Canada climbed onto the Ironworkers Memorial Bridge early Tuesday morning before dawn to launch the blockade, cutting off tanker access to Kinder Morgan's Westridge Marine Terminal.\nSeven of them remain dangling in climbing harnesses underneath the crossing, while the other five are providing support from the catwalk. On Wednesday morning, as the blockade was nearing its 29th hour, protester Emma Jackson said their spirits remain high.\n\"Overall we're feeling pretty good,\" Jackson said in a Facebook video. \"We have no plans on leaving any time soon. We have lots of food up here, water, comfy, warm clothes…. I think we're all doing OK.\"\nGreenpeace said the dramatic aerial blockade is part of an ongoing response to the federal government's highly controversial $4.5-billion purchase of Kinder Morgan's Trans Mountain pipeline expansion project.\n\"It doesn't matter that Justin Trudeau has decided to make taxpayers into the shareholders of this project, it still will not go forward,\" Jackson said. \"This resistance movement, if anything, is stronger than ever because of this recent decision.\"\nOn Wednesday afternoon, Kinder Morgan finally confirmed that one oil tanker, the Serene Sea, was indeed trapped inside Burrard Inlet and unable to leave. In the early hours of the blockade, the company would only say there had been \"no impacts to (its) operations.\"\n\"A vessel loaded with crude oil departed our Westridge Marine Terminal and is now waiting for suitable conditions at its Port of Vancouver designated mooring location,\" a spokesperson for Trans Mountain told CTV News in an email.\n\"We respect the right to peacefully demonstrate and there are many ways to express opinions in a safe and lawful manner. It is unfortunate that the actions of these individuals have caused disruptions to vessels and individuals that transit to and from the waters east of the Ironworkers Memorial Bridge, including customers from our terminal and the other marine cargo terminals.\"\nA spokesperson for Port of Vancouver said deep sea vessels and some other boats, such as sail boats with high masts, have been unable to cross underneath the Ironworkers bridge because of the protesters and their banners.\nShorter vessels such as tugboats, barges and small commercial vessels are still able to go back and forth.\n\"We are closely monitoring the situation and any changes that may impact the safe movement of marine traffic,\" Danielle Jang said in an email.\nSome on social media have questioned how the activists are able to urinate and otherwise relieve themselves while hanging below the bridge. Greenpeace confirmed a system is in place, but did not provide further details.\nThe Vancouver Police Department monitored the first day of the blockade from land and sea, taking a hands-off approach that focused on ensuring the safety of both activists and officers.\nThe department has since handed the file off to North Vancouver RCMP, which has so far taken a similar approach.\nMounties said the activists could face mischief charges after they return to solid ground, however. They could also be charged with impeding the safe movement of a vessel under Sec. 121 of the Canada Shipping Act, an offence that carries a maximum penalty of 18 months in prison and a $1-million fine.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Police moving in to remove tanker blockade from Ironworkers bridge",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/police-moving-in-to-remove-tanker-blockade-from-ironworkers-bridge-1.3999990"
}