{
    "authors": [],
    "date_download": "2017-10-07 04:28:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 13:47:00",
    "description": "Sixteen games are priced at under $50, including Tuesday’s game against the Ottawa Senators.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fcanucks-offer-prizes-cheap-tickets-amid-low-season-expectations-1.3622860.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3622870.1507322829!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "That’s how the Vancouver Canucks are hoping to attract fans to the Rogers Arena amid low expectations for the upcoming season.\nAll fans will be met with a free Budweiser beer or non-alcohol drink when they show up for the team’s season opener against the Edmonton Oilers Saturday night.\nA pre-game party on the Toyota and South plazas will also feature face-painting, poster-making and a barbeque alongside Canucks alumni Kirk McLean, Jyrki Lumme and Harold Snepsts.\n“If (fans) come and have a great time here at Rogers Arena, if they’re entertained as well while they’re watching the hockey game, I think they’ll be coming back more often,” said Canucks’ chief operating officer, Jeff Stipec. “I think there’s a lot of enthusiasm.”\nA kiosk will sell all things bacon and offer 25-cent lemonade for children.\nFans can also enter to win a basket of meat worth $500. The contest will help raise money for the Canucks For Kids Fund. Tickets will be on sale at the concourse throughout Saturday night’s game.\nPucks will be hidden throughout the arena. Those who find one can take it to the team store to claim a mystery prize.\nBut Canucks fan Joe English said the tactics are unlikely to renew enthusiasm for the team in the long term.\n“I don’t know how that fits in with the Canucks logo or anything. It seems like a little bit of a reach,” he said, adding that what fans really want to see is “more evidence of a commitment to a rebuild.”\nThe Canucks haven’t made the playoffs since the 2014-15 season, when they lost in the first round to the Calgary Flames.\nSince then, the team has been adding new faces and youthful energy to the roster with the likes of Brock Boeser and Jake Virtanen.\nBut even English, a self-proclaimed super-fan, doesn’t think those changes will earn the Canucks a playoff spot just yet, despite the team doing “a lot of the right things.”\n“The odds of making the playoffs are something like 15 per cent. I don’t think we’re going to make it,” he said. “I think we might finish just outside.”\nThe two-year drought has led to apathy among many hockey enthusiasts in the city.\n“I’m pretty sure they’re going to fight Vegas for last,” Vancouverite Brett Cove told CTV Vancouver Friday.\nEven Canucks jersey sales are suffering, said John Czvelka, the owner of Vancity Sports, a merchandise store in the city’s downtown core.\nCzvelka said he hasn’t sold any of the team’s 2017-18 jerseys ahead this year, but has sold a whole shipment of Edmonton Oilers jerseys.\n“I’ve never had it this bad with the Canucks merchandise,” he said.\n“It’s hard to invest this kind of money into a name and number jersey when you’re not sure if they player is going to be here this year or is going to be sent down to minors. We just don’t know.”\nThe team itself, however, is telling a different story.\n“I see so much optimism right now,” Stipec said, citing positive sentiment online and healthy ticket sales.\n“I think there’s great anticipation for (Saturday) night and we’ll be sold out come puck drop.”\nAnd if, like English, the snacks and suds won’t get you to show up, the Canucks are hoping this year’s rock-bottom ticket prices will.\n“That’s part of the strategy. We want to make it affordable,” Stipec said. “It’s a way for fans that may not historically have had a chance to come to the game to come on in and experience it.”\nTickets for Saturday’s game are still available at around the $100 mark.\nSixteen regular season games are priced at under $50, including Tuesday’s game against the Ottawa Senators which are selling for as little as $43 and games against a host of American teams, including the Detroit Red Wings, Los Angeles Kings, and New York Rangers.\nAnother 19 games are priced between $60 and $80.\nThere are exceptions to the low prices, however.\nIf you want to see the Canucks take on Connor McDavid and the Oilers for a second time in March, those tickets will cost you at least $105. When reigning NHL champions--the Pittsburg Penguins--visit Vancouver next month, seats will sell for no less than $137.\nTickets to see Canadian teams that a are only playing at the Rogers Arena once this season, such as the Toronto Maple Leafs and Montreal Canadiens, are also going for more than $100.\nWith files from CTV’s Christina Heydanus and David Molko",
    "source_domain": "bc.ctvnews.ca",
    "title": "Canucks offer prizes, cheap tickets amid low season expectations",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/canucks-offer-prizes-cheap-tickets-amid-low-season-expectations-1.3622860"
}