{
    "authors": [
        "Ross Mclaughlin",
        "Sandra Hermiston"
    ],
    "date_download": "2018-04-24 14:59:09+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 06:00:00",
    "description": "What are your rights and what protections are in place to help you when the airline loses your luggage?",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Flost-airline-luggage-what-are-your-rights-when-your-bags-go-missing-1.3898391.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3898396.1524516835!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ross McLaughlin and Sandra Hermiston, CTV Vancouver\nYou get off a long flight, you're tired and you're waiting at the baggage carousel for your bag to drop, but it doesn't show up. What are your rights and what protections are in place to help you when the airline loses your luggage?\nLadan Hassan was on an Air Canada flight from Washington, D.C. through Montreal and then on to Vancouver in February. But one of her bags didn't make it to YVR with her.\n\"I had to wait two hours in line to report it to [Air Canada] because there was a lineup of other people with their stuff missing,\" said Hassan. “I was told it was stopped in Montreal for security purposes and it would arrive in the morning.”\nBut weeks later, there was still no sign of her luggage.\n“We get a lot of complaints about luggage,” said Bruce Cran with the Consumers’ Association of Canada.\nFortunately, air passengers do have rights.\nWhen you fly, you enter into a contract where the airline has to make things right, but Air Canada has limits.\nIf you’re travelling within Canada you can get up to $1,500 with Air Canada. West Jet offers up to $2,000 on lost domestic luggage, but only after being ordered to do so in a ruling by the Canadian Transportation Authority. You could receive more if you’re travelling internationally, but the airline can take as long as it wants to give you your compensation.\nHassan had been waiting more than a month. So Ross McLaughlin contacted the airline and, five days later she received notice that she'd be getting $1,700. It could take another four weeks for her to get the money.\n“They’re finally listening now, but they still have no idea where my belongings are,” she said.\nThat’s why you should never put personal things you can’t bear to part with in checked luggage and always declare luggage valued at more than $1,000.\nIf your bags are delayed, you could be entitled to interim compensation because when you’re away, there are essentials you’ll need.\nAir Canada says it needs time to investigate lost bags but it's also no secret in the industry that the airlines pay more attention to business travellers and frequent fliers to make sure they're looked after. Hassan feels everyone should be treated the same and there should be set a time limit to either find the bags or write a cheque.\nThe federal government is currently working on standardizing the rules with the Transportation Modernization Act (Bill C-49).\nThe good news is, by June, the International Air Transport Association will require its members to implement digital tracking on all bags from start to finish. That would cover most of airlines, or about 83 percent of passenger traffic.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Lost airline luggage: What are your rights when your bags go missing?",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/lost-airline-luggage-what-are-your-rights-when-your-bags-go-missing-1.3898391"
}