{
    "authors": [],
    "date_download": "2018-04-25 02:45:53+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 19:24:00",
    "description": "The warning comes a day after 25-year-old Alek Minassian allegedly drove a rented van over a curb and into numerous pedestrians in Toronto's north end.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fvancouver-police-issue-public-warning-after-toronto-van-attack-1.3900843.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3900851.1524622928!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nPolice in Vancouver are urging residents to be aware of their surroundings in the wake of a van attack that left 10 people dead in Toronto Monday.\n“If you're walking by yourself on the street, don't have your head down, be aware of where you are and what you're doing,” Sgt. Jason Robillard told The Canadian Press Tuesday.\nThe warning comes a day after 25-year-old Alek Minassian allegedly drove a rented van over a curb and into numerous pedestrians in Toronto's north end. Fifteen people remain in hospital as a result of the incident.\nThe Vancouver Police Department said it does not yet have enough information about the attack to determine if or how it will change its security measures.\nAnd while the force does have protocol in place in case of a similar incident, Robillard told CP it can't predict when a driver might target a public space.\nA close look at public locations in downtown Vancouver such as Robson Square reveals how substantial concrete seating areas and heavy planters are designed in part to provide some measure of safety in case of a similar attack.\nIn the wake of other attacks, Vancouver police have steadily escalated security around special events where thousands of people make a soft target, including placing \"heavy barriers\" such as garbage trucks used at Canada Day gathering and the Celebration of Light.\nIf and how cities in Canada and around the world adjust their safety measures in response to Monday's attack will likely depend on the results of the Toronto police's investigation into what led to the incident.\n\"There's no doubt it was a planned, very methodical attempt to kill a pile of people—and a successful one,\" public safety analyst Chris Lewis told CTV News Monday.\n\"We can say we're going to ban large magazines and a pile of things around firearms, but how do you stop driving vehicles—4,000-pound missiles—from jumping up on a curb and hitting and immediate number of people or driving up the sidewalk?\"\nThe City of Vancouver's former chief planner pointed out barricades and even plain concrete block have started appearing across cities in Europe and Australia to defend against malicious acts in the future, but warned about the effect of these measure on everyday life.\n\"There's the great risk we will try to turn our streets into bunkers, not only to feel safe but to look safe, like the street is impregnable,\" Brent Toderian said. \"The problem is that wrecks it as a place for civic, or can greatly damage it as a place for civic life.\"\nMinassian now faces 10 charges of first-degree murder and 13 counts of attempted murder. He was not known to police and does not have a criminal record.\nAnd as cities around the world scramble to figure out how they can protect residents from future attacks on soft targets, experts warn vehicle weaponization remains one of the simplest, yet most challenging forms of violence to defend against.\n\"It's such an easy way to hurt people and kill people and there's no real way to defend against it,\" Lewis said. \"Tragically, it's really destroyed one of the safest cities in all of North America.\"\nWith files from CTV Vancouver's Penny Daflos and The Canadian Press",
    "source_domain": "bc.ctvnews.ca",
    "title": "Vancouver police issue public warning after Toronto van attack",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/vancouver-police-issue-public-warning-after-toronto-van-attack-1.3900843"
}