{
    "authors": [],
    "date_download": "2017-01-02 08:53:54+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "From the crazy housing market to a daring waterfall rescue, here are some top picks for 2016.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fbest-of-2016-ctv-vancouver-reporters-pick-favourite-stories-1.3224175.json",
    "image_url": "http://bc.ctvnews.ca/polopoly_fs/1.3186255.1480649035!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Working in the media is never dull, and 2016 was no exception.\nFrom the Lower Mainland’s crazy housing market to a daring waterfall rescue, from house flipping to B.C.’s fentanyl crisis, CTV Vancouver reporters were kept on their toes covering stories across the province.\nWe asked some of our reporters what their favourite stories of the year were, and this is what they picked.\nIllegal safe injection site in DTES alley saving lives, volunteers say\nReporter: Michele Brunoro\n“The fentanyl story that showed the young man overdosing in an alley and the volunteers bringing him back to life was one of my top picks of the year. It was pretty raw to see, and had a lot of feedback on it. Not the biggest story - but certainly an important one.”\nDaring rescue: Woman saved after crashing SUV beside waterfall\nReporter: Scott Hurst\n“This is one of the most memorable stories that I worked on all year. Just the fact that the driver survived this frightening ordeal is incredible, not to mention the heroic effort by all first responders to rescue her.”\nHouse-flipping concerns as 368 Vancouver homes sold at least twice since 2014\nReporter: Mi-Jung Lee\n“I thought it was strange when the sold sign came down and a day later another for sale went up. I called the realtor and she said the new owner was flipping the house. That was early 2016.\nThat for sale sign prompted several stories into just how common house flipping was during the height of the market. The angst over housing prices grew until the provincial government couldn't ignore it anymore. Now with the market cooling, everyone's wondering what 2017 will bring. Housing was definitely one of the most fascinating stories of 2016.”\nWould you return found money? The Vancouver honest test\nReporter: Ross McLaughlin\n“We dropped money to see how honest folks would be. They were honest when being watched- but when no one was around the story changed.”\nBuilding boom has crane industry nearing capacity\nReporter: Penny Daflos\n“I've spent hundreds of hours in Chopper 9 in the past three years and this year I was really struck by how many cranes I saw sprouting from the skyline in so many communities. I did a bunch of research and found the industry was essentially at capacity in the spring, with all trained crane operators working full-time and more to try and meet demand. I wanted to see what the job is like, so I climbed a 200 foot crane to interview the operator at the top. It's one of the craziest things I've ever done, but gave me a real appreciation for the death-defying work they do.”\nAbove the clouds: Nafeesa’s Snowbirds tour\nReporter: Nafeesa Karim\n“It's probably the highlight of my career so far, being able to do something that so few civilians have been afforded the privilege to do. I am most proud of not vomiting. The pilot I flew with was also very special, being from Metro Vancouver and growing up watching the snowbirds, this was his first time in front of a hometown crowd at the Abbotsford airshow.”\n'All hell is going to break loose in Vancouver': Ex-trader's real estate forecast\nReporter: Sarah MacDonald\n“My favourite news topic of 2016 was the collective coverage of Metro Vancouver's housing market. It was journalism that exposed many of the loopholes and vulnerabilities in our real estate market—and ultimately journalism that inspired legislative change, both provincially and federally.”",
    "source_domain": "bc.ctvnews.ca",
    "title": "Best of 2016: CTV Vancouver reporters pick favourite stories",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/best-of-2016-ctv-vancouver-reporters-pick-favourite-stories-1.3224175"
}