{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-05-31 00:58:26+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 17:40:00",
    "description": "67 per cent said they'd felt the negative effects personally, and many said they've already started changing their habits.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Frecord-high-gas-prices-taking-serious-toll-on-many-b-c-families-poll-1.3952777.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3952782.1527726668!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "More than two-thirds of B.C. residents say the province's record-high prices are having a negative impact on their lives, a newly released poll suggests.\nIn a survey of 810 British Columbians, 67 per cent said they'd felt the effects personally. Thirty per cent said the impact has been \"very negative.\"\nAnd nearly nine-in-10 called the increase at the pumps a serious problem, Insights West said Wednesday, but only three per cent said they'd reached out to an MLA or MP to complain.\nWhen asked whether they thought the high prices – which broke records several days in a row in Metro Vancouver this spring – were here to stay, 43 per cent said they thought the change was permanent, while about one-third said they think they'll drop again.\nRegardless, the majority thought they'd continue to increase over the next month, and many felt they'd be higher still six months from now.\nRespondents were asked exactly how high they thought prices will rise in the summer, a time of year often associated with increased prices as members of the public look to get away for vacations and long weekends.\nNearly six-in-10 said they'll be above the current average in Metro Vancouver of $1.59 per litre. Seventeen per cent predicted prices will pass $1.85, while 26 per cent guessed somewhere between $1.56 and $1.65.\nNearly half cutting back on vehicle use\nInsights West asked their sample how they were adapting to increased prices, if they'd taken any action at all. Nearly half of respondents said they're using their vehicles less, while about two-in-five said they're not driving as far.\nAbout a third said they've cut down on spending in other areas to balance their budgets, while a quarter said they're buying less gas at a time.\nMany also said they'd gone across the border to fill up, changed their vacation plans and/or thought about trading in their vehicle for a hybrid or electric car.\n\"British Columbians are really feeling the impact of rising gas prices and they don’t seem to believe things are going to change any time soon, which has resulted in changing behaviour around driving,\" Insights West president Steve Mossop said in a statement.\nOthers said they've been leaving their vehicle at home more often, opting instead to take transit. Insights West said about 15 per cent of respondents said it was a measure they'd taken.\nTransLink said it has noticed an increase in ridership in recent years, though it's difficult to say exactly how much of that increase is tied to the price of gas.\nIn a statement, senior media relations officer Chris Bryan said ridership increases are generally due to a combination of rising prices, increased transit service and employment growth.\nBryan said use of weekday transit was up 5.1 per cent in April when compared to the same month last year. Ridership in 2017 was up 5.7 per cent from the year before, and use of transit in 2016 was up 4.5 per cent from 2015.\nRidership is growing in Metro Vancouver faster than anywhere else in Canada and the U.S., TransLink said.\nWhen it came to those who responded to Insights West, the majority of people who said they'd changed their habits already live outside of the Lower Mainland, and were below the age of 55.\nWhat's to blame for increased prices?\nInsights West also asked respondents what they thought were the reasons behind the price escalation. Of the options given to those polled, government taxes, profit-seeking oil companies and a lack of large refineries in B.C. took the most blame.\nFingers were also pointed at the low dollar, uncertainty over the Trans Mountain pipeline expansion and low Canadian dollar.\nThe option that took the least heat was a shortage of gas supply globally.\nThe poll was conducted by Insights West online between May 18 and 23. The data was statistically weighted and comes with a margin of error of +/-3.4 per cent.\nWith files from CTV Vancouver's David Molko",
    "source_domain": "bc.ctvnews.ca",
    "title": "Record-high gas prices taking serious toll on many B.C. families: poll",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/record-high-gas-prices-taking-serious-toll-on-many-b-c-families-poll-1.3952777"
}