{
    "authors": [
        "Alyse Kotyk"
    ],
    "date_download": "2017-10-07 04:28:08+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 19:45:00",
    "description": "The training program, called Resilient Minds, was developed by the BC Professional Firefighters’ Association.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fnorth-shore-rescue-members-receive-training-to-face-trauma-1.3623422.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3623372.1507340194!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Alyse Kotyk, CTV Vancouver\nNorth Shore Rescue members became the first SAR team in British Colubmia to undergo resiliency training this week in an effort to help them cope with the often traumatic situations they encounter in the field.\n“This is something that we need to talk about more regularly. We need to watch out for each other and we need to understand that it’s normal to have these feelings and to talk about them,” said NSR team leader, Mike Danks, calling the program “a huge eye-opener.”\nWhile the North Shore’s mountains, canyons and coast offer countless adventures for outdoor enthusiasts, these environments can quickly become deadly when things go wrong. In 2016 alone, NSR responded to about 130 calls.\nMade up of volunteers from a variety of professions, team members might not always be equipped to deal with the psychological toll of what they see while on duty.\nOn Tuesday, NSR addressed this by participating in a specialized resiliency training program called Resilient Minds developed by the BC Professional Firefighters’ Association.\n“I’ve been to a lot of calls in the past and you kind of just shake it off and you move forward but, as of recently, everyone’s got a really busy life, you’ve got a lot on your plate and you go to a call that maybe involves someone that you can relate to your family and that’s when it really hits you hard,” Danks said.\nDanks recalled a recent call he responded to when a seven-year-old girl died in Lions Bay. He said his team tried everything they could to save her, but was unsuccessful.\n“I went home to my family and I broke down. I had a seven-year-old at the time,” he said. “I was trying to process why this beautiful, young little girl was out hiking with her family, doing a wonderful thing and all of a sudden her life is taken away.”\nNow, Danks said NSR members are better-equipped to recognize the signs of stress and trauma in their colleagues.\n“This course is about being aware of those indicators and not shying away from someone that may potentially need help,” he said.\nDanks also said that family members and significant others can be crucial support systems for anyone who might be experiencing trauma, especially because those are the people who will notice a change in behaviour first.\nNow that his team has benefited from the training, Danks hopes other SAR teams will participate as well.\n“It worked very well for our team. It was very well-received,” he said. “We believe in it and we really hope this will spread amongst all the other SAR teams in the province because it’s made a big difference for us.”\nWith files from CTV Vancouver’s Scott Hurst",
    "source_domain": "bc.ctvnews.ca",
    "title": "North Shore Rescue members receive training to face trauma",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/north-shore-rescue-members-receive-training-to-face-trauma-1.3623422"
}