{
    "authors": [
        "Darcy Matheson"
    ],
    "date_download": "2017-02-15 01:58:09+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Mounties issued a Valentine's Day warning in hopes of catching the man accused of stealing hearts – and bank cards.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fcharming-romance-fraudster-preying-on-b-c-women-1.3285404.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3285424.1487106820!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "A \"charming\" suiter that drained a woman's bank account after meeting through online dating may be responsible for similar romance frauds across the region.\nB.C. Mounties issued a public bulletin on Valentine's Day in hopes of catching the man suspected of stealing hearts – and bank cards.\nIn the latest incident, the suspected scammer started staying at the home of a Coquitlam woman after answering her personal ad online on New Year's Day.\nTheir romance blossomed quickly but there were several troubling red flags, says Cpl. Michael McLaughlin.\n\"The victim found herself spending all her time with the suspect but she never went to the suspect’s residence and never saw his vehicle,” he said.\nSix days after meeting online, the man walked out of the woman's home, never to be seen again. Also gone were her house keys and bank cards, and a sum of money from her account.\n\"It happened fast. Really fast,\" said McLaughlin.\nEfforts to reach him were unsuccessful: his phone number had been changed, his email address led to nowhere and he never lived at the address he claimed, said McLaughlin.\n\"All his personal information was a lie,\" he said.\nPolice have linked the case to three similar frauds in Metro Vancouver, and think there's a strong chance other women will be targeted, if they haven't already.\nThe suspect is around 45 years old, 6'3 with a stocky build and round face. He may be wearing a ponytail.\nHe has used several aliases on multiple dating sites, including “Richard Harvey Silver,” “Jack Harvey,” “Dan Whelan” and “James Whelan.”\nAround 750 victims lost more than $17 million in romance scams last year alone, according to the Canadian Anti-Fraud Centre.\nRCMP Sgt. Guy Paul Larocque says the real number is actually much higher because many people are too embarrassed to talk to police about their ordeal.\n\"It's probably just the tip of the iceberg,\" he told CTV News Channel Tuesday. The victims are largely in their mid-40s to late 50s, and aren’t limited\nIn many cases, scammers create fake online dating profiles in order to defraud those looking for love.\nAfter wooing their victim and gaining their trust using photos and well-concocted stories, the fraudster will then hit them in the pocketbook.\nHigh-pressure tactics are common to separate victims from their money, says Larocque, adding that some may be forced to declare bankruptcy.\nOften times it is a family member that comes forward to authorities after noticing a chance in the victim’s demeanor, or financial circumstance.\nFeelings of love can leave victims blind to the fact they are being scammed by someone who doesn't have their best interest at heart – what might be the most heartbreaking aspect of the scam.\n\"That emotion invested… is what makes it successful,\" said Larocque.\n\"Good, trusting people\" are the most vulnerable to romance fraudsters, but there are signs to watch out for to protect yourself, added McLaughlin.\n\"Whether online or otherwise, be careful of people who want to get too close, too quickly and who always want you to pay,\" he said.",
    "source_domain": "bc.ctvnews.ca",
    "title": "'Charming' romance fraudster preying on B.C. women",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/charming-romance-fraudster-preying-on-b-c-women-1.3285404"
}