{
    "authors": [],
    "date_download": "2017-08-14 23:07:36+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 10:46:00",
    "description": "A 49-year-old pedestrian was killed and two others were injured near Canada Place Sunday.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fpolice-seek-witnesses-in-tour-bus-crash-that-killed-tourist-1.3545165.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3544040.1502649358!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nInvestigators with the Vancouver police are appealing for witnesses as they try to piece together a deadly tour bus crash near Canada Place.\nA 49-year-old pedestrian was killed and two others were injured after a bus owned by The Vancouver Trolley Company struck them and a parked SUV near the downtown Vancouver waterfront Sunday morning.\nPolice have confirmed all three victims were tourists from Massachusetts and were all related. An elderly man remains in serious condition.\n“We are co-operating with the Vancouver Police Department’s Collision Investigation Unit, who are leading the investigation into this incident,” VTC general manager Stuart Coventry said Monday. “We are hoping for more answers to this tragic incident.”\nCoventry said the bus driver has been with the company for seven years and “has an excellent service and driving record,” confirming the driver is still employed by VTC, but is taking time off.\n“He and all of the staff at Vancouver Trolley are devastated by this very difficult situation,” Coventry said.\nPolice said the bus, a free shuttle to the Capilano Suspension Bridge, struck a group of pedestrians and an SUV on Canada Place Way near Burrard Street shortly before 10 a.m.\nThe victims appeared to be either loading or unloading luggage into the SUV when they were struck, according to witnesses.\nThey were left trapped underneath the bus after the collision. First responders were able to pull the 49-year-old out and perform CPR at the scene, but he couldn't be saved.\nThe other victims, an elderly man who was seriously hurt and a 15-year-old girl who suffered minor injuries, were also transported to hospital for treatment.\nVTC also offered its condolences to the families of those affected, adding that the company is trying to contact those injured through the Vancouver Police Department.\n\"We are shocked and saddened and our focus right now is on the people who were injured and the families of those injured and deceased,\" Coventry said.\nPolice are asking anyone who witnessed the crash to contact investigators at 604-506-2024.\nWith files from CTV Vancouver’s Breanna Karstens-Smith",
    "source_domain": "bc.ctvnews.ca",
    "title": "Police seek witnesses in tour bus crash that killed tourist",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/police-seek-witnesses-in-tour-bus-crash-that-killed-tourist-1.3545165"
}