{
    "authors": [],
    "date_download": "2018-03-19 23:09:41+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 12:37:00",
    "description": "Toronto-area police believe at least one of the men has some connection to the west coast.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fsuspects-in-brutal-assault-on-ont-man-could-be-from-b-c-police-1.3849389.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3849403.1521488158!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nToronto-area police are looking for three suspects, possibly from B.C., who are believed to have been involved in an attack on a man with autism.\nThe attack occurred last Tuesday night at a bus terminal outside a mall in Mississauga, Ont., Peel Regional Police said.\nA 29-year-old man was sitting on a set of stairs at the terminal at Square One when he was approached by three males. The men surrounded the victim and punched and kicked him several times before fleeing the area.\nThe victim was taken to hospital with serious but non-life-threatening injuries.\nOn Monday, Peel police told CTV News that they believe at least one of the suspects involved in the \"brutal assault\" might be from B.C., or have some connection to the province. They're asking residents of the west coast to look at the video police released last week and contact them with more information on the suspects.\nWarning: The video police have released shows the attack. Viewer discretion is advised.\n\"We saw the video and we decided to release that video to the public, and by doing that, we generated a lot of information,\" Const. Harinder Sohi told CTV News Monday.\n\"Our information is that all three parties that are responsible for this assault are from British Columbia, the Lower Mainland area.\"\nSohi would not say what the information was or how it came to police, but said that they'd verified it and it looked to be credible.\nPeel police have been working with local departments and RCMP detachments located in the Lower Mainland, but said they also received a lot of assistance from the public.\n\"I think this really shows the power of social media. Once we released that video, it was amazing to see not only the tips we received but also the response from the community for the victim himself – all the well-wishes and people wanting to reach out to the victim,\" Sohi said.\n\"I can tell you that the victim is with his family and is getting a lot of support.\"\nThe males have been described as South Asian and about 5-10.\nThe first has a light complexion, thin build, short, dark beard and straight black hair. He was wearing a black T-shirt with a red and white Air Jordan logo, black track pants and black shoes.\nThe second suspect also has a light complexion and thin build but is clean shaven. He was wearing a black jacket with a grey stripe across the chest and another grey stripe on the hood. He also had on black track pants and black shoes.\nThe third is described as having a medium complexion and medium build. He was unshaven at the time, and was wearing a black Nike hoodie with white lettering on the sleeves, black track pants and black shoes.\nAnyone with more information is asked to contact investigators at (905) 453-2121, ext. 1233. Tips can also be left anonymously though Crime Stoppers at 1-800-222-8477 (TIPS) or online.\nWith files from CTV Vancouver's Sheila Scott and Scott Roberts",
    "source_domain": "bc.ctvnews.ca",
    "title": "Suspects in 'brutal assault' on Ont. man could be from B.C.: police",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/suspects-in-brutal-assault-on-ont-man-could-be-from-b-c-police-1.3849389"
}