{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-07-04 22:33:06+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 11:29:00",
    "description": "The 50-year-old man was arrested and received an immediate roadside driving prohibition.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fboater-with-3-coolers-of-illegally-caught-crabs-was-also-impaired-rcmp-1.3999826.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3999830.1530728747!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "Police are investigating after a 50-year-old B.C. man was allegedly found to have nearly 90 illegally caught crabs in his coolers.\nThe man's truck and boat were searched after members of the Shiprider Program noticed what Mounties described as a \"suspicious vessel\" being removed from the water at a Surrey, B.C. marina.\nShiprider is a joint Canadian-U.S. law enforcement initiative made up of armed officers allowed to pass over the border as they watch for smuggling, trafficking and threats to national security.\nThe RCMP has not said what was suspicious about the incident, but a search allegedly uncovered three coolers full of crab. A compartment in the vessel's bow contained more of the crustaceans.\nThe suspect was taken into custody for illegal possession, and the Department of Fisheries and Oceans will investigate whether he violated the Fisheries Act.\nMounties also believed the man was intoxicated at the time. They conducted an impaired driving investigation and he was given a three-day immediate roadside prohibition. His truck, 21-foot Bayliner and boat trailer were seized and multiple charges are pending, the RCMP said in a statement.\nEighty-nine crabs were seized and put back in the ocean.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Boater with 3 coolers of illegally caught crabs was also impaired: RCMP",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/boater-with-3-coolers-of-illegally-caught-crabs-was-also-impaired-rcmp-1.3999826"
}