{
    "authors": [],
    "date_download": "2017-06-15 04:41:16+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 16:01:00",
    "description": "The car was travelling at 130 km/h in an 80 km/h zone of South Fraser Perimeter Road",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fdelta-cops-stop-speeding-car-covered-in-fishing-accessories-1.3459794.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3459812.1497480984!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Police in Delta shared photos of an unusual traffic stop on Wednesday involving a speeding vehicle that appeared better equipped for the sea than the road.\nThe car was travelling at 130 km/h in an 80 km/h zone of South Fraser Perimeter Road – a full 30 knots over the speed limit, Delta police joked. It was covered in buoys, rope, cages and even a small boat motor mounted on the back.The captain of the nautically-inspired vessel was handed a fine for the excessive speed and the vehicle was impounded after officers deemed it “clearly unsafe to other drivers on the road.”\nPolice shared a photo of the vehicle on social media on Wednesday afternoon with the caption: “Check out the Delta Police #Catchof theDay. This driver ‘reeled’ in a $368 ticket.”\nThe Facebook post has since been liked and shared hundreds of times.\nDespite the light-hearted nature of the post, police are using the incident as a reminder about road safety.\n“In all seriousness, due to the speed at which this vehicle was travelling and its condition, issuing a ticket and towing the vehicle was warranted and appropriate,” police said in the post. “This 'catch of the day' serves as a reminder to all drivers to obey the posted speed limit on all roads and highways.”\nThe car will have to go through a full inspection in order to regain its road-faring status.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Delta cops stop speeding car covered in fishing accessories",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/delta-cops-stop-speeding-car-covered-in-fishing-accessories-1.3459794"
}