{
    "authors": [],
    "date_download": "2018-04-24 19:48:09+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 12:03:00",
    "description": "Yihao Wang left North Vancouver provincial court with a black surgical mask covering his face.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fferrari-driver-clocked-going-150-km-h-over-the-limit-pleads-guilty-1.3900128.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3900164.1524596547!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA Ferrari driver allegedly caught zooming across the Lions Gate Bridge at 150 km/h over the speed limit has pleaded guilty to excessive speeding.\nYihao Wang appeared in North Vancouver provincial court Tuesday but spoke only once, answering \"yes\" when the judge asked if he understood the plea.\nBefore he left the building, Wang put on a black surgical mask, black sunglasses and a black baseball cap, almost completely obscuring his face. He did not answer questions from reporters outside court.\nPolice clocked Wang going over the crossing at 210 km/h, more than tripling the posted speed limit of 60 km/h. He was behind the wheel of a white 2015 Ferrari 458, which was impounded for 60 days.\nRather than just hand the driver a ticket, the officer who pulled Wang over decided to press for a trial, which could mean a higher fine and stricter penalties.\nWang, who was charged under the Motor Vehicle Act, is scheduled to be sentenced in May.\nAt the time of the incident, police said the driver was already known to them, and had been pulled over for excessive speeding on the same bridge just months earlier, in April 2017.\nPolice said Wang's driving history could be considered during sentencing, and court records show several driving and speed-related charges against a man with the same name and birth year.\nIn the meantime, Wang remains under a 16-month driving ban.\nWith files from CTV Vancouver's David Molko",
    "source_domain": "bc.ctvnews.ca",
    "title": "Ferrari driver clocked going 150 km/h over the limit pleads guilty",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/ferrari-driver-clocked-going-150-km-h-over-the-limit-pleads-guilty-1.3900128"
}