{
    "authors": [
        "Megan Devlin"
    ],
    "date_download": "2017-12-11 12:27:24+00:00",
    "date_modify": null,
    "date_publish": "2017-12-10 20:45:00",
    "description": "Jewish activists are crying foul, but pro-Palestine organizers say opposing Israel is not akin to being anti-Jewish.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Flikeness-of-israeli-flag-burned-at-vancouver-demonstration-1.3715743.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3715754.1512967481!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Pro-Israel Jewish activists are crying foul after a likeness of an Israeli flag was lit on fire in Vancouver Saturday at a pro-Palestinian demonstration, but rally organizers say it was an expression of legitimate anger toward Israel.\nThe display of disrespect to the Israeli state is a common sight in the Middle East, but a spokesperson for a national Jewish advocacy organization said he was shocked to see such a display in Canada.\n\"It is extremely, extremely concerning. Not something we expect to see in Canada,\" said Aidan Fishman, spokesperson for B'nai Brith.\nThe incident occurred around 3:30 p.m., when a 17-year-old UBC student walked past the pro-Palestinian rally outside the Vancouver Art Gallery.\nThe student's parents did not want him to be identified because they feared for his safety after the emotional display.\nThe student told CTV News he wasn't planning on demonstrating until he noticed a cardboard sign depicting the Israeli flag with a red X drawn across it.\n\"I made a decision that I had to speak up,\" he said.\nHe unfurled an Israeli flag he had in his backpack from a pro-Israel counter-protest the day before. He said he stood calmly across the street and the pro-Palestinian demonstrators initially left him alone.\nBut then he said a man grabbed the cardboard Israeli flag, approached him and lit it on fire. Video from the scene shows a man holding the burning piece of painted cardboard.\nFishman called the video \"disturbing\" and said he viewed it as a threat to members of the Jewish community in Vancouver.\n\"These events… become fronts for people to express their anger and hatred at Israel or at Jews,\" he said. \"These anti-Israel protest can sort of morph into anti-Semitism.\"\nSara Sagaii, one of the rally's organizers, says calling Israel flag burning anti-Semitic deflects the conversation away how Israel treats Palestinian people.\n\"Palestinian activists expressing anger towards Israel is not an ethnic anger. It's anger toward the state of Israel. Because the state of Israel is a settler colony,\" she said.\nShe said flag burning is a form of free speech and not intended to be aggressive toward Jews.\n\"There's a very clear divide between Jewish people and the state of Israel. And the flag is the flag of the state. It is not the flag of every Jewish person around the world,\" she said.\nJason Doucette, a spokesperson for the Vancouver Police Department, said that weekend on-call media relations officers are only made aware of investigations where public safety may be at risk and that he didn't have any details to share on this incident.\nThe pro-Palestinian rally on Saturday was one of two this weekend that were organized in response to U.S. President Donald Trump proclaiming that Jerusalem is the capital of Israel. The Palestinian demonstrators told CTV that Jerusalem should be the capital of future independent Palestinian state.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Likeness of Israeli flag burned at Vancouver demonstration",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/likeness-of-israeli-flag-burned-at-vancouver-demonstration-1.3715743"
}