{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2017-12-11 19:45:26+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 09:19:00",
    "description": "A recent review said the project – which employs 2,000 – is over budget and behind schedule.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fsite-c-megaproject-to-go-ahead-at-increased-cost-of-10-7b-1.3716356.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3659164.1509561442!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The province has decided to continue construction on a multi-billion-dollar hydroelectric dam, despite the project being over budget and behind schedule.\nB.C. Premier John Horgan announced Monday that the government is opting to continue construction on the Site C dam, rather than cancel or delay it.\nThe dam was initially estimated to cost $8.3 billion, but Horgan announced that the latest estimate puts the total at $10.7 billion.\nThis is a developing news story and will be updated shortly. Original article follows.\nPremier John Horgan is expected to announce whether his government will continue or cancel construction on the partially built Site C dam on Monday.\nConstruction began two years ago on the multi-billion-dollar megaproject first initiated by the Liberal government.\nThe hydroelectric dam, which will cost an estimated $8.3 billion if completed, has been the subject of protests and court challenges. Ministers were in meetings last week wrestling with the decision that will affect more than 2,000 workers.\nWhile terminating the project would cost the province $1.8 billion, in addition to the $4 billion already spent, a recent report suggested continuing construction could cost more than $10 billion. Suspending the project then restarting it in 2024 would cost at least $3.6 billion more than the original price tag.\nThe B.C. Utilities Commission review said the dam is over budget and behind schedule, and said it believes focusing on viable alternative sources like wind and geothermal energy would provide similar benefits at an equal or lower cost.\nThe NDP campaigned on having the project reviewed, a practice that was once standard in B.C. before the Liberals' clean energy laws allowed some projects to bypass review.\nHorgan is expected to make an announcement on his government's decision at 11:30 a.m. in Victoria.\nWith files from The Canadian Press",
    "source_domain": "bc.ctvnews.ca",
    "title": "Site C megaproject to go ahead at increased cost of $10.7B",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/site-c-megaproject-to-go-ahead-at-increased-cost-of-10-7b-1.3716356"
}