{
    "authors": [],
    "date_download": "2018-04-24 19:48:19+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 11:15:00",
    "description": "Firefighters still managed to extinguish the barn blaze before it spread to a nearby home.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fpassing-train-power-lines-hamper-firefighting-effort-in-pitt-meadows-1.3899839.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3900046.1524593320!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA passing train and live power lines hampered efforts to battle a barn fire in Pitt Meadows early Tuesday morning, but crews were still able to douse the flames before they spread to a nearby home.\nThe blaze broke out at a rural property on Kennedy Road just before 3 a.m., engulfing a barn and a car that was parked close by.\nUnfortunately, firefighters were briefly delayed reaching the scene after they became trapped behind a passing train at a railway crossing. Fire Chief Don Jolley said power lines beside the barn also presented a challenge for crews.\n\"We had to fight it from a distance until we were sure hydro had the power out,\" Jolley said.\nBut they still managed to extinguish the blaze within about half an hour, and all the residents living at a home on the property escaped unharmed.\nThere were also no animals in the barn when it caught fire, Jolley said.\nThe cause of the blaze hasn't been confirmed, but early indications are that it was accidental.\n\"There's some evidence to suggest it may have been electrical,\" Jolley told CTV News.\nWitnesses reported hearing a loud popping sound, almost like gunshots, during the fire. Crews said that could have been a number of things, but was likely the car's tires bursting.\n\"It's quite a loud bang and there can be three or four of them as the tires go,\" Jolley said.\nThe barn and car were destroyed by the flames, and a few trees on the property were scorched as well.\nJolley said the people living at the home were renters, and that authorities would be speaking with the owners after they finish investigating the scene.\nWith files from CTV Vancouver's Nafeesa Karim",
    "source_domain": "bc.ctvnews.ca",
    "title": "Passing train, power lines hamper firefighting effort in Pitt Meadows",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/passing-train-power-lines-hamper-firefighting-effort-in-pitt-meadows-1.3899839"
}