{
    "authors": [],
    "date_download": "2018-05-30 19:21:36+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 10:23:00",
    "description": "British Columbia's attorney general is recommending that voters be asked two questions in a referendum this fall to determine whether they want to switch to proportional representation to elect members of the legislature.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fproposed-ballot-questions-for-b-c-s-voting-reform-referendum-unveiled-1.3951914.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3951921.1527701006!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nVICTORIA - British Columbia's attorney general is recommending that voters be asked two questions in a referendum this fall to determine whether they want to switch to proportional representation to elect members of the legislature.\nDavid Eby is suggesting to cabinet that voters should first be asked if they would want to switch from the current first-past-the-post system.\nThey would then be given three options for proportional representation and be asked to rank them based on which they preferred.\nIf a majority supported making the switch, the option with the highest number of votes would be implemented.\nThe campaign period starts July 1, with voting by mail-in ballot running from Oct. 22 to Nov. 30.\nThe questions were released today by Eby after a period of public consultation that included more than 180,000 visits to a government website.\nThe province's minority NDP government and the Greens have supported proportional representation that determines the number of seats each party gets in the legislature based on its percentage of the popular vote.\nTwo previous referendums on proportional representation have failed in B.C.\nLast year, Premier John Horgan said the province's current system is unfair because in the last five B.C. elections, only one political party formed a government after receiving more than 50 per cent of the votes. In the other elections, parties with less than 50 per cent of the popular vote were able to form a government.\nLast year's election saw the Liberals and NDP each receive slightly more than 40 per cent of the vote. But the New Democrats eventually formed a minority government with the support of the Greens, who won three seats and took almost 17 per cent of the popular vote.\nThe government has said that if a new way to elect members is approved, it will introduce legislation to implement it in time for the next fixed-date election in 2021.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Proposed ballot questions for B.C.'s voting reform referendum unveiled",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/proposed-ballot-questions-for-b-c-s-voting-reform-referendum-unveiled-1.3951914"
}