{
    "authors": [
        "Laura Kane"
    ],
    "date_download": "2017-04-18 04:15:53+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 07:57:00",
    "description": "The NDP says 700,000 people don't have a family doctor but only 200,000 are still looking for one.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fb-c-s-main-parties-campaign-on-family-doctor-shortage-jobs-1.3371499.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372440.1492469084!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Laura Kane, The Canadian Press\nBURNABY, B.C. -- New Democrat Leader John Horgan took aim on Monday at the Liberals' failed pledge to match every British Columbian with a family doctor by promoting his party's strategy to build team-based urgent care centres.\nScroll down or click here for key developments from Day 7 on the campaign trail\nThe centres would be open evenings and weekends and would allow patients to see the care provider that fits their needs, whether it's a doctor, nurse practitioner or counsellor, Horgan said at a campaign stop ahead of the May 9 election.\nHorgan said Christy Clark's Liberals are letting down patients, who are waiting for hours at walk-in clinics or emergency rooms. The NDP said 700,000 people don't have a family doctor, with 200,000 still looking for one.\n\"It's a fundamental right in Canada to access our public health care system. I will defend that to my last breath,\" Horgan said.\nThe NDP leader made the promise in Burnaby, flanked by two local residents who can't find a family doctor. Sky Belt said her friend visited walk-in clinics several times for pain and was told she had anxiety before she was finally diagnosed with cancer.\n\"Those months that she spent not having a family doctor have made her situation very critical,\" Belt said.\nThe Liberals estimated in 2013 that 200,000 British Columbians didn't have a family doctor. They campaigned in 2010 and 2013 on providing a family doctor to every resident who wanted one by 2015, but conceded two years ago they would not meet their target.\nThe website for the \"GP For Me\" program says 178,000 people who did not have a family doctor were able to get one by 2016. But B.C.'s population also grew by 162,600 between 2013 and 2016.\nThe Liberal platform includes $2.7 billion for new hospitals, 500 additional long-term care beds and 5,500 more hip and knee surgeries.\nCampaigning in Campbell River, Clark highlighted her government's record on helping business, such as phasing out the provincial sales tax on electricity that she said would save businesses $160 million a year, including pulp and paper companies on north Vancouver Island.\nVancouver Island has been a stronghold for the NDP but Clark said the island has a successful economic record because of Liberal policies. She said the unemployment rate on the north island is half what it was under the last NDP government.\n\"More people are working and our jobs plan has worked for British Columbia,\" she said.\n\"We've supported the private sector in creating thousands of jobs here and I don't think people, whether in the south island, the mid-island or the north island, want to give up that prosperity. We want to keep this going.\"\nHorgan's promise was short on details, with no specific number of urgent-care centres an NDP government would build or a cost estimate. He said the party would shift priorities to make room in the existing health budget.\n\"We want to assemble those teams in a cost-effective way,\" he said.\nLater, Horgan visited Coquitlam's Riverview Hospital, a shuttered mental-health institution, where he has promised to reopen some residential care facilities. The NDP would also establish a Ministry of Mental Health and Addictions to help people get timely and effective treatment.\nGreen party Leader Andrew Weaver, who is campaigning on a promise to \"do politics differently,\" unveiled his party's platform on democratic reform in Victoria.\nHe said his party would establish a public watchdog to oversee government advertising and communications, block cabinet ministers from engaging in partisan fundraising, ban corporate, union and out-of-province donations, and place limits on individual contributions that would be in line with current federal limits.\nThe Liberals, and to a lesser extent the NDP, have faced intense scrutiny over lavish fundraisers and unlimited donations. The NDP has promised to ban corporate and union donations if elected, while the Liberals would convene a panel to make recommendations. The Greens banned corporate and union donations in September.\nWeaver also promised to introduce proportional representation.\n\"British Columbians have lost trust in their government -- and rightfully so,\" he said in a statement. \"We have a duty to regain that trust and to demonstrate through action that the government is there to serve British Columbians -- not politicians.\"\nKey developments from Day 7\nNDP :\n-- Leader John Horgan promised at a campaign stop in Burnaby to build urgent-care centres to address the province's family doctor shortage and ease pressure on walk-in clinics and emergency rooms.\n-- The centres would be open evenings and weekends and use a team-based approach, meaning patients would access the care provider that fits their needs, whether it's a doctor, nurse practitioner, counsellor or dietician.\n-- But the promise didn't include a proposed number of centres or a cost estimate. Horgan said an NDP government would shift priorities to make room in the existing health budget.\n-- He criticized the B.C. Liberals' \"GP for Me\" program, saying party Leader Christy Clark promised more doctors, then \"finally gave up two years ago when they knew they weren't going to meet their targets.\"\n-- Horgan later stopped in Coquitlam, where he reiterated pledges to re-open facilities at Riverview Hospital to provide residential care to those who need it, as well as create a Ministry of Mental Health and Addictions\nLiberals :\n-- Clark campaigned in Campbell River, highlighting her government's record in helping business and said the Liberals have a plan to phase out provincial sales tax on electricity, saving businesses $160 million a year.\n-- Clark said the Liberal government has a successful economic record on Vancouver Island, which is typically an NDP stronghold.\n-- She said the unemployment rate on the north island is half of what it was under the last NDP government before the Liberals came to power in 2001.\n-- Naomi Yamamoto, the Liberal candidate for North Vancouver-Lonsdale, posted on social media that one of her signs had been defaced with a spray-painted swastika. The NDP candidate in the riding has also posted a photo of her sign with a red swastika painted on it. Candidates on all sides condemned the graffiti.\nGreens :\n-- Leader Andrew Weaver unveiled his party's democratic reform platform, which includes switching to a proportional representation electoral system.\n-- Weaver promised to establish a public watchdog to oversee government advertising and communications; block cabinet ministers from engaging in partisan fundraising; ban corporate, union and out-of-province donations; and place limits on individual contributions.\n-- He reminded voters that his party banned corporate and union donations in September, while the Liberals and NDP still allow them. The New Democrats have promised to ban them if elected while the Liberals would convene a panel to review campaign financing.\n-- Weaver said the Greens would also establish a provincial budget officer to provide independent analysis to the legislature on the state of the province's finances, the government's estimates and economic trends.",
    "source_domain": "bc.ctvnews.ca",
    "title": "B.C.'s main parties campaign on family doctor shortage, jobs",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/b-c-s-main-parties-campaign-on-family-doctor-shortage-jobs-1.3371499"
}