{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-07-04 22:32:42+00:00",
    "date_modify": null,
    "date_publish": "2018-07-04 13:10:00",
    "description": "The Ministry of Children and Family Development has also been advised of the incident, Delta police said.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fdad-may-be-charged-after-young-kids-rescued-from-hot-vehicle-in-mall-parking-lot-1.3999971.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3120599.1530734967!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A father may face charges after police in Delta, B.C. were forced to break a window to get a pair of children out of a hot vehicle on Canada Day.\nPassersby called 911 after seeing the children in the parking lot of Tsawwassen Mills mall shortly before 5 p.m. The vehicle was left in a sunny location with the windows up.\nOfficials said those who noticed the kids had first tried communicating with the older of the two, age five, to get him to unlock the door. When the child couldn't get it open, an officer was called to the scene.\n\"When our officer arrived on scene he discovered the children trapped in the hot vehicle sweating profusely, crying, and with bright red faces,\" Delta police spokesperson Cris Leykauf said in a statement three days later.\nThe younger child, age three, was strapped in a car seat in the full sun.\nThe responding officer instructed the older child to move to the back then smashed the window and helped the kids out.\nThey were given water and brought to a police cruiser to cool off in the air conditioning. The officer was concerned about their health, especially that of the youngest child whose breathing was irregular. Paramedics were called and the kids were brought to hospital for assessment and treatment. Police said both are now doing well.\n\"If not for the observant and caring people who were shopping and working at the mall, this might have ended differently,\" Leykauf said.\nAbout 10 minutes after the rescue, the kids' father arrived at the scene.\nPolice spoke to the dad about the dangers of leaving young children in a vehicle on a warm day, and will be recommending criminal charges. The Ministry of Children and Family Development has also been advised of the incident.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Dad may be charged after young kids rescued from hot vehicle in mall parking lot",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/dad-may-be-charged-after-young-kids-rescued-from-hot-vehicle-in-mall-parking-lot-1.3999971"
}