{
    "authors": [
        "Jon Woodward"
    ],
    "date_download": "2018-04-25 02:45:59+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 19:01:00",
    "description": "In an interview with CTV News, Carlisle admitted having unprotected sex, but said he believed that he wasn’t contagious as he was undergoing treatment.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fcharges-against-man-accused-of-keeping-hiv-status-from-12-women-could-be-dropped-1.3900835.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3900838.1524621529!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Charges against a Fraser Valley man that was the subject of a major police warning when he was accused of failing to disclose his HIV status to a dozen sexual partners appear to be on shaky ground.\nCTV News has learned that multiple women connected to the case have been told legal rules have shifted with advances in HIV treatment, and that Brian Carlisle’s 12 counts of aggravated sexual assault could be doomed.\n“It was utterly terrifying—utterly terrifying,” one woman told CTV News, recalling when she found out Carlisle was HIV-positive, and how she worried she had contracted the disease.\n“I want the public to put themselves in my shoes,” she said. “How would you feel if this happened to you? Would you want them to get away with it? I wouldn’t wish what happened to me on anybody.”\nA spokesperson for Crown prosecutors said the charges against Carlisle had not been stayed, but that lawyers are \"currently in the process of reviewing the available evidence to determine whether our charge assessment standard continues to be met.”\nCarlisle, a marijuana activist who lives in Abbotsford, used the website Plenty of Fish to meet women. One of them found out he was HIV-positive and called police, who put out a public warning last year. A total of 12 women came forward.\nIn an interview with CTV News, Carlisle admitted having unprotected sex, but said he believed that he wasn’t contagious as he was undergoing treatment.\n“There’s no way. My viral load has never been detectable,” he said.\nNone of the disclosure from the Crown has indicated any women actually became infected, Carlisle said. A report by his doctor prepared for the court says he has been taking his medication consistently for years and the chance of transmission is “virtually zero.”\nThat’s a significant finding because prosecutors must prove either there was a transmission or a realistic chance of transmission in order to make their case, said UBC law professor Janine Benedet.\n“There’s no question that being deceived is a terrible place to be in,” Benedet said, “but it may not be that, the way the law stands now, the law of sexual assault is a very good fit for what has been done to them.”\nUnprotected sex with someone who is HIV-positive used to mean a realistic chance of infection. But advances in HIV treatment have shown that someone with an undetectable viral load has virtually no chance of infecting anyone.\n“A person that is adequately treated for his HIV infection does not transmit the virus,” said Dr. Julio Montaner of the BC Centre for Excellence in HIV and AIDS.\nIt’s responsible to disclose your HIV status in most situations, Montaner said. But if someone is being treated and there is no realistic chance of transmission, it shouldn’t be up to the criminal system to punish people who don’t disclose, he said.\n“I welcome disclosure and many things that could inform his willingness or her willingness or their willingness to engage in a sexual act. But if there is no risk this is not a mandatory disclosure,” he said.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Charges against man accused of keeping HIV status from 12 women could be dropped",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/charges-against-man-accused-of-keeping-hiv-status-from-12-women-could-be-dropped-1.3900835"
}