{
    "authors": [],
    "date_download": "2017-02-15 07:48:04+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "The $1 million study would look at where the tracks would go, how much it would cost and how much it would make.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fvancouver-to-seattle-in-an-hour-governor-considering-high-speed-train-1.3285955.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3285958.1487127323!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThe governor of Washington is looking at ways to shorten the trip between the state's largest city and British Columbia's.\nGov. Jay Inslee has proposed a budget of $1 million to study whether a high-speed rail connection between Seattle and Vancouver would be worthwhile.\nThe study will examine whether an express train is technically feasible, said Mark Hallenbeck, director of Washington State Transportation Centre.\n\"In a heartbeat you could build this and would it work? Yes,\" he said.\nThe concept isn't new. It was discussed at a Vancouver conference in the fall, a group based in Portland lobbied its local government in 2015, and then-premier Gordon Campbell mentioned it at a news conference in 2010.\nBut so far, the idea of a high-speed train has never gone beyond talk.\nHallenbeck said there are a number of big issues with such an ambitious project, including where the lines would be located and the costs of building and maintaining the route.\n\"The risk is, does it actually generate enough money to pay for what it cost to build it?\" he said.\n\"That risk is big. No private sector company is standing here waiting to take that on.\"\nStill, Vancouver City Councillor Geoff Meggs said the city will be watching to see what the Washington study comes up with.\n\"I think it will happen because it's the obvious, practical solution to a number of problems we have,\" he said.\n\"It's very exciting and encouraging that it's being given another kick start.\"\nThe provincial government is also interested. Minister of Transportation and Infrastructure Todd Stone said Christy Clark has been in touch with Inslee about the topic.\n\"The premier has made very clear to the governor that we support the work that they're doing. The State of Washington has decided to step forward and take the lead on doing some initial analysis,\" Stone said.\nThe $1 million study is part of a budget proposal put forward by the governor, but if approved, it would look at the cost, expected demand and possible route. The analysis is expected to include the possibility of up to nine stops from Vancouver through to Portland, Ore.\nThe results of the research would be expected in December.\nWith a report from CTV Vancouver's Maria Weisgarber",
    "source_domain": "bc.ctvnews.ca",
    "title": "Vancouver to Seattle in an hour? Governor considering high-speed train",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/vancouver-to-seattle-in-an-hour-governor-considering-high-speed-train-1.3285955"
}