{
    "authors": [],
    "date_download": "2017-12-12 01:53:28+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 17:35:00",
    "description": "While there's nothing to suggest a pending threat anywhere in Canada, transit police stepped up patrols Monday.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fheightened-security-on-vancouver-transit-after-botched-nyc-suicide-bombing-1.3717261.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3715954.1512998695!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA botched suicide bombing committed Monday morning on the New York City subway has prompted heightened security measures on Vancouver's transit system.\nNo one was killed when a man believed to be taking cues from ISIS extremists detonated a crude pipe bomb in the U.S.'s most populous city, and authorities said the worst damage inflicted on innocent bystanders was headaches and ringing ears.\nEven the suspect, a 27-year-old Bangladeshi immigrant, survived the blast, despite suffering burns to his midsection.\nBut the incident was still enough to trigger increased patrols from Transit Police in Metro Vancouver, a response that spokesperson Anne Drennan said was largely designed to reassure potentially anxious riders.\n\"Any time any violence happens on any transit system around the world we go on what's called high visibility,\" Drennan told CTV News. \"So you will see officers today throughout the day and the evening dressed in their high visibility vests over their uniforms, and they will be popping in and out of trains a lot more and making themselves known to passengers.\"\nBomb-detecting dogs have also been sent to do additional sweeps of stations, platforms, trains and buses.\nDrennan stressed that there is no intelligence to suggest a pending threat in Vancouver or even Canada, but urged anyone who sees something suspicious on transit to contact police.\n\"Transit systems are prone to this kind of attack, so we want to reassure people here that we're on the job, on the ball and we're making them as safe possible.\"\nAndre Gerolymatos, a terrorism expert at Simon Fraser University, said Monday's attack was unusual for North America because of the way it was carried out. There have only been a handful of suicide bombers in U.S. history, and of the two committed in the past two decades, only one was linked to terrorism.\n\"We tend to see suicide bombers in the Middle East. Usually they come from very impoverished neighbourhoods,\" Gerolymatos said. \"They're given a deal – you blow yourself up and ISIS or Al Qaeda will take care of your family. That's been part of the modus operandi.\"\nBut since the New York attack was attempted, however unsuccessfully, the terrorism expert said there is a threat of others following in the bomber's footsteps.\n\"The danger here is the copycat effect: somebody sees this and realizes this guy got a lot of media attention – and they love the media, they want to get on the news – only he failed to make a good bomb,\" Gerolymatos said.\nWith files from CTV Vancouver's Shannon Paterson and The Associated Press",
    "source_domain": "bc.ctvnews.ca",
    "title": "Heightened security on Vancouver transit after botched NYC suicide bombing",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/heightened-security-on-vancouver-transit-after-botched-nyc-suicide-bombing-1.3717261"
}