{
    "authors": [
        "Dario Balca"
    ],
    "date_download": "2018-05-31 02:58:54+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 19:09:00",
    "description": "Jacquie Johnston's eldest daughter, Shiloh, was 22 when she was struck on a sidewalk on Canada Way. Her youngest daughter, Keziah, had died of an overdose just 10 days earlier.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fmother-of-burnaby-crash-victim-in-shock-for-years-after-daughter-s-death-1.3952944.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3952951.1527732466!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The mother of a young woman who died after being struck by a teenage driver in Burnaby has broken her silence, three years after the horrific crash that devastated her family.\nJacquie Johnston's eldest daughter, Shiloh, was 22 when she was struck on a sidewalk on Canada Way, just steps away from her workplace.\nThe 2015 collision left several others with injuries, including the young driver, who had collided with another vehicle before Shiloh was hit.\n\"I feel like I was in shock for about two years,\" Jacquie told CTV News in an exclusive interview.\nThe driver pleaded guilty to dangerous driving. His identity is protected by law because he was only 17 years old at the time.\n\"He clipped another vehicle, lost control of his car, injured some other people including himself and killed my daughter,\" the single mother said. \"He has to live with that for the rest of his life.\"\nThe driver was sentenced at a Vancouver Youth Court last June to six months of curfew, 200 hours of community service, two years of probation and a four-year loss of his licence.\nJacquie said the court heard that he'd only been driving for seven months at the time, but had another infraction involving alcohol during that short period.\n\"I really feel for him,\" she said. \"He was very young…Some time to grow up is probably beneficial.\"\nThe young man apologized in court, she said, but spoke only to the judge.\n\"I just feel like if he had addressed us, addressed me, it would have made it easier to forgive him. I mean, I do forgive him. What choice do I have?\"\nJacquie described her late daughter as \"very compassionate and kind to everybody.\"\nShiloh volunteered with seniors and was a youth leader for teenagers at her church, she said.\n\"She was just one of those very positive, very joyful, sweet, loving people,\" Jacquie said.\nBut Shiloh's death was not the only tragedy to strike the Johnston family that year.\nJacquie's youngest daughter, Keziah, died just 10 days before the fatal crash, following a four-year battle with addiction that stemmed from an eating disorder she had developed as a teen. She was 20.\n\"It was ruled an accidental overdose,\" the mother said. \"She tried very hard. She was very determined, very brave.\"\nJacquie said the sisters were always very close and that Shiloh was a \"huge support\" for her sister during her addiction. The two even rented a home together at one time.\n\"She was so devastated when Kez passed away,\" Jacquie said. \"She always was hoping for her recovery and supporting her through her different attempts for recovery…I'm very proud and feel privileged I got to have that time with them as my children because they were amazing people, both of them.\"\nShiloh was planning a memorial service for her sister before the collision that killed her.\nAnd even though they're both gone, Jacquie believes her daughters are still united.\n\"They were very close,\" she said. \"Every single picture I have is of them together. They were always together.\"\nWith files from CTV Vancouver's Maria Weisgarber",
    "source_domain": "bc.ctvnews.ca",
    "title": "Mother of Burnaby crash victim 'in shock' for years after daughter's death",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/mother-of-burnaby-crash-victim-in-shock-for-years-after-daughter-s-death-1.3952944"
}