{
    "authors": [],
    "date_download": "2018-02-03 06:35:01+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 16:42:00",
    "description": "Police say the suspect was wearing navy pants, a navy sweater and white disposable overalls.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Felderly-woman-assaulted-by-man-posing-as-construction-worker-rcmp-1.3787908.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3787918.1517618498!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nMounties in North Vancouver are searching for a suspect after an elderly woman was allegedly assaulted in her apartment Thursday.\nIn a statement, police said the 89-year-old victim was alone in her Lynn Valley apartment when a man dressed as a construction worker came to the door and asked to use the washroom.\nAfter she let him into the unit, the suspect allegedly exposed his genitals and assaulted the woman.\nThe man left the scene following what investigators called \"a short altercation.\"\n\"Given the serious nature of the crime, both the North Vancouver RCMP Serious Crime and Special Victim Units have put their resources into solving this investigation,\" Const. Brett Cunningham said in a statement. \"Fortunately the victim was not seriously injured and remains in good spirits even after being victim to such a disturbing offence.\"\nAccording to police, the man was wearing white disposable overalls with a hood with navy pants and a navy sweater underneath. Police say the suspect is between 20 and 30 years old and stands 5-10 to 6 feet tall. He has a slim build, dark hair, dark eyes and olive skin.\nMounties have also released a composite sketch of the suspect.\nAnyone with information on the man's whereabouts is asked to contact investigators at 604-985-1311 and quote file number 2018-2583.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Elderly woman assaulted by man posing as construction worker: RCMP",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/elderly-woman-assaulted-by-man-posing-as-construction-worker-rcmp-1.3787908"
}