{
    "authors": [
        "Ross Marowits"
    ],
    "date_download": "2018-05-30 19:22:02+00:00",
    "date_modify": null,
    "date_publish": "2018-05-30 10:38:00",
    "description": "A last-minute deal ensured the work stoppage won't affect passenger services that share the tracks.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fcp-rail-strike-that-may-have-impacted-translink-service-ends-1.3951956.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3950510.1527624687!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Ross Marowits, The Canadian Press\nMONTREAL -- A four-year tentative agreement has been reached between Canadian Pacific Railway and the Teamsters Canada Rail Conference to end a strike hours after it began.\nThe parties also reached a five-year deal for the Kootenay Valley Railway.\nFull operations at both railways will resume Thursday morning across Canada, the union said in a news release.\n\"We believe this is a fair contract that our members can feel good about ratifying,\" stated union president Doug Finnson.\n\"I am personally very satisfied with what we have negotiated.\"\nThe agreement is positive for 12,000 CP Rail employees, customers and the entire Canadian economy, railway CEO Keith Creel added in a separate news release.\n\"It is especially meaningful to achieve a four-year tentative agreement with our valued locomotive engineers and conductors, providing long-term stability for all parties involved,\" he said in a statement.\n\"This is a significant step toward a renewed positive relationship growing forward together serving our customers and the Canadian economy.\"\nThe tentative agreements must be ratified by Teamsters members over the coming months.\nDetails of the agreement are being withheld pending ratification.",
    "source_domain": "bc.ctvnews.ca",
    "title": "CP Rail strike that may have impacted TransLink service ends",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/cp-rail-strike-that-may-have-impacted-translink-service-ends-1.3951956"
}