{
    "authors": [],
    "date_download": "2017-02-15 01:58:02+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "The government is expected to release a fifth consecutive balanced budget next week.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fthrone-speech-promises-to-pay-people-back-as-election-nears-1.3284784.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3282853.1486998161!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nVICTORIA -- British Columbia's government is promising financial relief for taxpayers in next week's budget, telling residents who will soon be voting in an election that the province is in position to repay them for past sacrifices.\nLt.-Gov. Judith Guichon said Tuesday in a throne speech that lays out Premier Christy Clark's plans for the upcoming legislative session that the government is now able to ease the financial burdens of British Columbians.\nThe Liberal government is expected to present its fifth consecutive balanced budget on Feb. 21. In November the government projected a surplus of about $2.2 billion for the 2016-17 fiscal year.\nThere were no details in the throne speech on the government's plans.\n\"After years of sacrifice by all of us in British Columbia through challenging times, working together with a plan, your government is now in a position to pay you back, to relieve some financial burdens, and to invest in your household,\" it says.\nThe speech says the government's focus on balanced budgets, spending controls and debt reduction has produced growing surpluses that give the province the ability to do more for taxpayers.\n\"That money belongs to you,\" the speech says. \"And in the coming budget, your government will provide financial relief to taxpayers, while continuing to make investments in the services people rely on.\"\nAlthough B.C. faces risks from weakening global economies and rising protectionism in the United States and Europe, the speech says the province will adhere to its principles of open and fair trade. The province faces challenges on the expired softwood lumber agreement with the United States, it says.\nThe government is also claiming credit for taking the lead on the opioid crisis, which resulted in more than 900 illicit drug overdose deaths in B.C. last year.\n\"Your government has taken action, and is ready to do more,\" the speech says.\nThe provincial election is set for May 9. The Liberals are seeking a fifth consecutive mandate.\nThe Liberals hold 47 seats in the legislature, the NDP 35 and there are three Independents, which includes one seat held by the Green party.\nThrone speech: gov't committed to working in good faith with teachers. BCTF has said $300m in new funding needed to address SCC ruling — CTV Bhinder Sajan (@BhinderSajan) February 14, 2017\nIn throne speech BC government says \"financial relief\" coming. No details on what that means just yet, will be in next week's budget — CTV Bhinder Sajan (@BhinderSajan) February 14, 2017",
    "source_domain": "bc.ctvnews.ca",
    "title": "Throne speech promises to pay people back as election nears",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/throne-speech-promises-to-pay-people-back-as-election-nears-1.3284784"
}