{
    "authors": [],
    "date_download": "2018-02-03 00:03:27+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 15:26:00",
    "description": "Dave Barrett served as B.C.'s 26th premier premier from 1972 to 1975. He was 87.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fb-c-s-first-ndp-premier-dave-barrett-dies-in-victoria-1.3787703.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3787712.1517613764!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThe 26th premier of British Columbia has died after a lengthy struggle with Alzheimer's disease, his family confirmed Friday. He was 87.\nDave Barrett's death was announced in a statement issued by the Office of the Premier, sent by his son, Dan.\nA former social worker, Barrett led the NDP to an election win in 1972, and served as premier until 1975. He was awarded the Order of B.C. in 2012.\n\"He cared deeply about his province and devoted much of his life to trying to make it a better and fairer place to live,\" Dan Barrett said.\n\"His love of the province was surpassed only by his devotion to his family. He will be sorely missed.\"\nBarrett's government initiated several reforms while in power, including lowering the drinking age to 19 and the initiation of the Insurance Corporation of B.C.\nThe NDP also established a labour relations board, halted agricultural land conversion and increased minimum wage. Corporal punishment was banned from schools, changes were made to the welfare system and the province's public sector was expanded.\nBarrett was known for his sense of humour, once referring to himself as \"fat lil’ Dave.\"\nIn a statement posted on Twitter, the BC NDP said it was mourning the loss, and echoed his son's sentiments.\nA year after losing the 1975 election and his seat in Coquitlam, Barrett served as MLA for Vancouver East until 1984. He served as leader of the Opposition, and was once forcibly removed from the Legislature for failing to abide by a Speaker's ruling.\nIn the late '80s to early ‘90s, Barrett served as Member of Parliament representing the riding of Esquimalt-Juan de Fuca. He then chaired inquiries into leaky condos in B.C. before retiring from public life.\nHis death comes just over two years after the death of the premier that defeated him in 1975. Bill Bennett died in 2015 at the age of 83, and had also been suffering from Alzheimer's.",
    "source_domain": "bc.ctvnews.ca",
    "title": "B.C.'s first NDP premier Dave Barrett dies in Victoria",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/b-c-s-first-ndp-premier-dave-barrett-dies-in-victoria-1.3787703"
}