{
    "authors": [],
    "date_download": "2017-08-14 17:40:29+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 10:21:00",
    "description": "The victim, Clarence Crothers, was found dead at an apartment complex early last month.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fman-charged-in-murder-of-62-year-old-abbotsford-resident-1.3545109.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3490403.1499287273!/httpImage/image.jpeg_gen/derivatives/landscape_620/image.jpeg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA suspect has been arrested and charged in the shocking murder of a 62-year-old Abbotsford resident whose body was discovered in an apartment building last month.\nClarence John Crothers, who used a wheelchair because of a spinal injury, was found dead in a property on Braun Avenue the morning of July 4.\nThough few details on his killing have been shared with the public, police said they quickly identified 50-year-old Jeffrey Charles Halicki as a suspect in the case.\n\"While motive for the homicide and evidence collected cannot be spoken to, Mr. Crothers and Mr. Halicki were known to each other and the murder was not believed to be random,\" the Integrated Homicide Investigation Team said in a news release.\nOn Monday, police announced Halicki has been charged with second-degree murder. He was arrested last week and remains in custody pending an appearance in provincial court.\nCrothers was not known to police. His family released a statement describing him as a \"fun-loving and caring father\" to one child.\n\"His heart, smile and personality to speak to anyone and everyone and be one’s advocate was a shining beacon of light that will never leave those that he has touched,\" the Crothers family said.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Man charged in murder of 62-year-old Abbotsford resident",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/man-charged-in-murder-of-62-year-old-abbotsford-resident-1.3545109"
}