{
    "authors": [],
    "date_download": "2017-04-17 23:41:42+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 13:28:00",
    "description": "Three people in hoodies kicked in the front door before bursting inside, says the Burnaby resident.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fman-pepper-sprayed-during-terrifying-home-invasion-1.3372126.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372187.1492463114!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA Burnaby man was hit in the face with pepper spray Sunday night after he says three intruders invaded his family home.\nThe resident, who asked to only be identified as Pav, said he was watching a movie with his sister-in-law on Easter Sunday around 10:45 p.m. when three people dressed in hoodies kicked in the front door. One masked suspect ran upstairs, he said.\nPav told CTV News he ran at the suspect to confront him, and was hit in the face with pepper spray.\nAs Pav lay on the living room floor, the suspects then moved through the house quietly for the next five minutes apparently looking for items to steal.\nHis sister-in-law Mandeep ran out of the back of the home, called 911, and hid in the yard until police arrived. His grandparents were on the first floor of the home while the men were inside.\nThe three suspects ran out of the front door, and were caught on a surveillance camera mounted outside the home.\nPav told CTV News he had no idea why the men targeted his home, and he believes his family was mistakenly hit.\nHe says he regrets confronting the man in his home, and says he wishes he would have run away.\nFirefighters treated the young man outside the home, trying to wash the irritant out of his eyes.\nBurnaby RCMP has not yet publicly commented on the incident.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Man pepper sprayed during terrifying home invasion",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/man-pepper-sprayed-during-terrifying-home-invasion-1.3372126"
}