{
    "authors": [
        "Penny Daflos"
    ],
    "date_download": "2017-04-18 04:16:05+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 19:12:00",
    "description": "Metro Vancouverites are turning their social media presence into full-time careers and even burgeoning media empires.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Flocals-making-lucrative-careers-out-of-influential-social-media-profiles-1.3372723.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372802.1492481359!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "An unassuming warehouse in Cloverdale, a stately home in Fort Langley and a chic Vancouver condo are just some of the settings where Metro Vancouverites are cashing in on the lucrative and booming social media industry.\nIt’s common knowledge that YouTube clips can mean hard cash for videos with millions of views, but now social media platforms like Instagram, Twitter and Facebook can translate into full-time careers and even burgeoning media empires for those with big followings now commonly referred to as “influencers” in the marketing field. CTV News spoke with several local influencers, all of whom started their accounts for fun and out of a passion for their given field, whether it’s technology or beauty or home decor.\nThe reach and impact of these influencers shouldn’t be underestimated.\n“Our catch phrase is ‘influencers are the new celebrity,’” says Jessica Thomas Cooke.\nShe co-founded the INF Influencer Agency with Hillary Chan-Kent in 2014, and says it’s the first company in Canada to represent and manage online influencers alone.\n“They have major followings online, to the point they’re able to sway people’s opinion and even spending habits,” explained Thomas Cooke.\nA blogger on Instagram or Facebook or vlogger on YouTube will start with an organic following as people like what they’re doing, sharing links with friends which then helps that account get featured on the profiles’ homepages. As the following grows as a result, companies take notice and send free products that can range from a few tubes of lipstick to laptops and DSLR cameras for those bloggers to review and broadcast to their followers.\nFor a lucky handful, their success expands their reach and influence to the point they can demand and achieve hundreds and even thousands of dollars from companies in exchange for a single photo or mention. It can grow from there.\n“When a brand wants to start using your image as advertising in a magazine or pre-roll in a YouTube video or even a billboard, that's when you have to start thinking about protecting yourself and being compensated for your time,” says Thomas Cooke.\nThere’s no shortage of local examples of people who’ve made the leap into charging for their content, leveraging their profiles into full-time careers for themselves — some even growing to the point they’ve hired staff to help manage their burgeoning companies.\nSamantha Ravnhdahl, beauty blogger\ncasual bodysuit: @aritzia jeans: @citizensofhumanity belt: @gucci shoes: carpet obtained from your grandmothers basement fashioned into a shoe A post shared by SAMANTHA R A V N D A H L (@ssssamanthaa) on Apr 3, 2017 at 2:19pm PDT\n“This following has far surpassed anything I could’ve imagined,” Ravndahl told CTV News.\nShe has now traveled the world for modelling gigs and was chosen by MAC Cosmetics to be the Canadian face of its Influencer-Driven Collection, crafting her own custom lipstick now on sale across the country.\n\"I don't think I would've started doing this if it wasn't for the fact that I ended up getting fired from my last job at this little boutique makeup store,” she said.\n“I was at about 2,000 [Instagram] followers and I was saying to my parents ‘I feel like people are making money off this. I don't know how, but I want to try and figure it out,’ and that's what I did. I took a month and by the end of that month I was at 10,000 followers and by the end of that year I was at a million.”\nRavndahl didn’t just get that following from being stunningly beautiful with a chameleon-like ability to constantly transforming her look with eyeshadows, pencils and lip colours. The Vancouverite’s useful makeup tips, willingness to appear vulnerable about her skin issues, plus her self-deprecating humour set her apart from many beauty bloggers. But competition is fierce, and Ravndahl considers herself lucky that she launched her profile at a time few beauty bloggers were doing so, allowing her to establish herself with advertisers and followers.\nLinus Sebastian, YouTube tech star\nLinus Sebastian knows exactly how competition can drive an already ambitious team to produce more material with constantly-improving production value. His YouTube channel, Linus Tech Tips, is one of the most-watched Science and Technology channels on the site, with each bombastic and informative video netting hundreds of thousands of views — often reaching a million plus. The energetic host now films his daily technology reviews and podcast from a 6,000 square foot warehouse-studio in Cloverdale, complete with copious professional lighting and pricey Red digital cinema cameras providing crystal-clear images. He says the top-end equipment and hours of writing, research and preparation are necessary to keep ahead of the competition.\n“People think you can just go buy a $50 webcam and you're a vlogger? Cool!” he said.\n“That's what's difficult about this business: absolutely everybody and their dog is constantly nipping at your heels, trying to show they can do it better than you or cheaper than you or faster than you -- and it's exhausting.\"\nThat being said, Sebastian clearly loves what he does, and it shows in his success.\n“if you aren't passionate about it absolutely every day the audience is going to pick up on that right away and they're just not going to care anymore. They won't care if you stop caring,” he insisted.\nSebastian has nearly 4 million subscribers to his fun and quirky YouTube channel, but points out he doesn’t get paid for that following. It’s all about views for the videos he posts daily, a breakneck pace even for someone with a growing staff. But it’s paid off in spades. Linus Tech Tips has amassed a total of more than one billion combined views for all its videos, though Sebastian is cagey about how much money that actually makes him.\n\"You do the math. We're still around. It's been four and a half years and we have 20 people on staff and we aren't losing money.”\nIn fact, Sebastian is expanding, with three staffers dedicated to sales and business development, plus two more focussed on creating an online video-streaming platform. He’s expanding his warehouse-studio by 50 percent to make room for that and other projects.\nQuite simply, the father of two is a local media mogul in the making, albeit one whose internet bill is already $3,000 a month and who now has to increasingly think about how to keep the lights on and the paycheques flowing to his dedicated staff.\nMonika Hibbs, lifestyle guru\nEaster weekend is one of our favourites! And blessing our Easter basket is one of our favourite Polish traditions. Still can't believe I'm taking my kids, seems like not long ago I was going as a little girl. Wesołych Świąt! A post shared by Monika Hibbs (@monikahibbs) on Apr 15, 2017 at 12:01pm PDT\nDriving up to Monika Hibbs’s stately home, complete with perfectly landscaped grounds after seeing the bright and airy photography that characterizes her fashion and decorative style on Instagram, it’s easy to think of her as a local Martha Stewart figure. The bubbly blonde mother of two laughed at the comparison, but then grew serious.\n\"I never told myself I want to be the next Martha Stewart, but if I'm that for some people that's the most amazing compliment. I definitely want to be my own person and create content,” she said during an interview at her Fort Langley home.\nThat content takes much more time than it used to. Hibbs began to blog as an escape from the stresses of a career in medicine, and found herself swept up in the world of lifestyle blogging as her following magnified with each passing month. She now runs a website, Instagram account that’s surpassed 140,000 followers, and is even doing commercials for American Express on Air Canada’s in-flight entertainment system.\n\"Nordstrom, Joe Fresh, Sephora, paint companies, hardwood companies, beauty products —we’ve worked with hundreds of brands now,” says Hibbs.\nShe now has one full-time and two part-time employee crafting everything from photography to custom recipes to assessing proposals from companies vying to be associated with her lifestyle blog.\n\"There's so much coming that we can't really keep up,” admits the 32 year-old.\n“We turn down 19 out of 20 brands that approach us because I wouldn’t use their products. That being said, just because you see a brand on my Instagram doesn’t mean we’ve been paid. I still like to support and promote local, independent companies just getting started and we never accept payment from them.”\nHibbs says once money is involved, it’s a time-consuming and involved process to get the photo just right — meeting her standards and those of the companies seeking her endorsement. It can take hours of staging, lighting, and approvals between both sides before a photo hits her website. Other times, she posts unsponsored images she enjoys of her children and home that reinforce her brand and identity, which make her all the more popular online.\nThe long road to success\nHoppy Easter A post shared by Alanna Durkovich (@xandervintage) on Apr 16, 2017 at 2:27pm PDT\nWhen her son was six months old, Abbbotsford’s Alanna Durkovich started her Instagram account to drum up sales for her online vintage clothing store, helping shoppers visualize what her threads could look like in a contemporary outfit.\n“I would blog about the pieces in the store and eventually it evolved into a personal style blog,” she told CTV News.\nThe clothing store is now history, but Durkovich has amassed more than 160,000 Instagram followers and has started monetizing her online reach and influence just in the past few months. She relies on her talent agency to sort out fees and contracts and is currently the sole photographer for her posts.\n\"I just set up a tripod and I do it all myself,” she says.\nContinuing to set herself apart will be tough. More and more bloggers and vloggers are realizing big-name companies like L’Oreal and Old Navy are investing in influencers who may have a better connection with their target audience than a supermodel or A-list actor.\n“This is someone you can run into at the store,” points out Thomas Cooke.\n\"The influencer is also constantly engaging with their fans, so if someone reaches out to them on a Saturday and says ‘hey, what colour eyeshadow are you wearing?' they have to be on. Because if the engagement falls, that's sort of when you lose that influence.”\nIt’s the biggest downside every influencer noted when speaking to CTV News about their success.\n“There’s no real day off,” Sebastian agreed.\n“And if you aren't actually passionate about it to the point you'd do it if nobody paid you -- don't bother.”\n“Social media is 24/7 so it can very easily become all-consuming if you're not willing to recognize that you need to strike a balance,” adds Ravndahl.\n“I really truly feel it's not natural to have your life under a microscope in this way.”\n“It’s full-time, around the clock,” Hibbs admits, pointing out that her online persona doesn’t always represent reality.\n“People always ask, ‘How real is this? Is this fake? Do you really live in this beautiful home with white everything?’ Look, I’m a mom, I have two young children. Is there always time for perfection? No, of course not, But if I'm going to present something and a brand is paying for it or if I'm producing it, I'm always going to put my best foot forward.”\nThat being said, the key to online social media celebrity and the financial rewards that come with it seem to be based on the creator’s willingness to work hard, take advantage of the opportunities that come to them, and above all be genuine.\n\"You can succeed just by being yourself,” says Ravndahl, “because everybody's looking for someone to relate to and they're always looking for somebody new. They're always looking for somebody to be inspired by.”",
    "source_domain": "bc.ctvnews.ca",
    "title": "Locals making lucrative careers out of influential social media profiles",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/locals-making-lucrative-careers-out-of-influential-social-media-profiles-1.3372723"
}