{
    "authors": [],
    "date_download": "2017-10-07 04:28:02+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 15:52:00",
    "description": "Mayor Gregor Robertson is pushing for a policy that would give locals a leg up on the competition.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fshould-vancouverites-get-first-dibs-on-pre-sale-homes-1.3623073.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3346464.1490824313!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nPre-sale homes in Vancouver's red-hot housing market attract attention from far beyond the city limits, and even overseas – but a new proposal from Mayor Gregor Robertson would give locals a leg up on the competition.\nOn Friday, Robertson announced he's pushing for a policy that would let people who already live in Vancouver get first dibs on new pre-sales.\n\"I regularly hear stories about people who work in Vancouver, but are forced to move elsewhere in the region because they can't find a place to live,\" Robertson said in a news release.\n\"At a time when we are seeing record levels of housing construction, local residents should be able to get the first shot at purchasing a home in new developments.”\nThe details haven't been worked out, but a similar program was implemented in West Vancouver last year. A Westbank condo development was marketed exclusively to locals for 30 days, then opened up to residents from across Metro Vancouver for the following 60 days.\nBuyers also had to sign a declaration promising to live in the unit and not flip it for a profit.\nAccording to the mayor's office, Robertson will be introducing a motion next week directing staff to craft a policy framework for prioritizing pre-sales for Vancouverites.\nThe framework would be due back by the end of November.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Should Vancouverites get first dibs on pre-sale homes?",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/should-vancouverites-get-first-dibs-on-pre-sale-homes-1.3623073"
}