{
    "authors": [],
    "date_download": "2018-02-04 01:00:33+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 13:25:00",
    "description": "Gursimar Bedi had six months to go on his 22-month sentence, but was released last week.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fman-who-was-accessory-to-murder-of-maple-batalia-released-early-1.3788419.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.2803291.1457059617!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nLast year, Gursimar Bedi was sentenced to 22 months in prison - including four months he had already served - for his role in the brutal 2011 murder of Maple Batalia. Today, six months before his sentence’s scheduled end, he is a free man.\nBatalia’s family learned of Bedi’s early release through an email from Victim Services of British Columbia. Her sister Rose Batalia told CTV News she was outraged by the decision.\n“He did not even know her, had nothing to do with her, and he was the last voice of reason that could have prevented this cold-blooded murder from happening,” Batalia said.\nMaple Batalia was 19 years old when her ex-boyfriend Gurjinder Dhaliwhal shot and stabbed her at Simon Fraser University’s Surrey campus in 2011. He pleaded guilty to second-degree murder in 2016, and was sentenced to life in prison, with no possibility of parole for 21 years.\nBedi was charged with being an accessory to the crime, was found guilty, and received his sentence on January 27, 2017.\n“He was Mr. Dhaliwal’s best friend,” Rose Batalia said. “If someone was a great person, they would have talked their friend out of doing something this stupid.”\nWith credit for time served, Bedi’s sentence worked out to 18 months.\n“That 18-month sentence was a slap in my family’s face,” said Rose Batalia. “He had the audacity to stay quiet, even when the sentencing happened. He smirked at our family. He smirked at the people there in a way to imply that, ‘I got away with this.’”\nBedi’s release came roughly a year after his sentencing.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Man who was accessory to murder of Maple Batalia released early",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/man-who-was-accessory-to-murder-of-maple-batalia-released-early-1.3788419"
}