{
    "authors": [
        "Megan Devlin"
    ],
    "date_download": "2017-08-15 03:46:29+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 16:10:00",
    "description": "This year's grizzly trophy hunt will be the province’s last.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fb-c-government-to-end-grizzly-bear-trophy-hunt-1.3545707.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3486232.1499022802!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The B.C. government announced Monday that it will ban grizzly bear trophy hunting throughout the province at the end of November.\nNatural Resource Operations Minister Doug Donaldson said the province is banning the hunt because it's what a majority of British Columbians want.\n\"The trophy hunting of grizzly bears is not a socially acceptable practice in B.C. in 2017,\" he said.\nThe ban will start on Nov. 30, 2017, the same day that the grizzly trophy hunt closes for the season.\nThe province will still allow hunting grizzlies for meat, but hunters will not be allowed to keep the bear's pelt, head or paws—the parts usually used as trophies. Donaldson did not elaborate on how food hunters should get rid of the trophy items.\nThe Great Bear Rainforest is the one exception to food hunting. The province is stopping all grizzly hunting there.\nGreen Party Leader Andrew Weaver issued a statement Thursday supporting the NDP's move to protect bears in the Great Bear Rainforest.\n\"I am encouraged that the BC NDP are respecting the wishes of the Coastal First Nations by placing a moratorium on the hunting of grizzlies in the Great Bear Rainforest,\" said Weaver, who has long advocated for the action.\nBut Weaver was critical of hunters not being able to possess hair, head or hide—saying it would create a system where not all of the animal is harvested.\nIn addition, he critiqued the NDP stance saying foreign hunters could still shoot a grizzly, take a picture and head home without harvesting any of the animal.\n\"What we really need in B.C. is a science-based approach to wildlife management, not a populist approach to species management,\" he said.\nThere are an estimated 15,000 grizzly bears in B.C. Each year, about 250 are killed by hunters. The government could not confirm how many of those 250 were taken due to the trophy hunt.\nDonaldson says the NDP are delivering on a promise made to British Columbians during the election campaign.\nHe says the four-month period between the B.C. election and the NDP forming government delayed enacting the ban. People have already and made plans and purchased limited entry passes for this year's hunting season, he said, and that's why the NDP decided to still allow this year's hunt.\nIn the fall, Donaldson said the government will consult with First Nations and stakeholder groups to determine next steps and mechanisms in ending the trophy hunt. He said the government will also move forward with a consultation process on a renewed wildlife management strategy for the province.",
    "source_domain": "bc.ctvnews.ca",
    "title": "B.C. government to end grizzly bear trophy hunt",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/b-c-government-to-end-grizzly-bear-trophy-hunt-1.3545707"
}