{
    "authors": [
        "Ben Miljure"
    ],
    "date_download": "2017-04-18 04:15:50+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 17:35:00",
    "description": "North Shore Rescue is looking for six to eight new members to join the team this spring.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fsearching-for-rescuers-north-shore-rescue-needs-new-volunteers-1.3372599.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372618.1492475284!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Love the wilderness? Have an extensive knowledge of the local backcountry? Willing to volunteer 300 hours per year for no compensation? North Shore Rescue might have the perfect opportunity for you.\nThe group is looking for six to eight new members to join the team this spring.\nSuccessful applicants will undergo two years of extensive training including wilderness first aid and search and rescue certification.\n\"North Shore Rescue's a big part of this community and I think it's just a rewarding way to volunteer your time,” said team leader Mike Danks.\nQualified volunteers must live near the North Shore and be prepared to set out into the backcountry at a moment’s notice – even with nasty weather rolling in.\n\"We've got some older members that are not as involved in getting out in the field,” said Danks. “And that's what we are really looking for, some newer members that are what we call ground pounders.\"\nThe team is available for callouts 24 hours a day, 365 days a year.\nIn addition to time spent searching for missing and injured hikers and skiers, new recruits can expect to spend a lot of time doing equipment maintenance and inventory and working on educating the public about wilderness preparedness and safety.\nCurrently, women only make up about 10 per cent of the 40 person team which is something members would like to see change with this recruiting drive.\n\"It's a very warm, receptive team to be a part of and we welcome anyone,” said emergency room nurse Kayla Brolly.\nShe joined the team five years ago and says successful rescues make the time commitment worth it.\n\"The recent avalanche on Cypress was very emotional for me in a very positive way because we were able to see this person, get him out safely, and see him return home,” said Brolly.\nThe deadline for applying to the team is April 18 and more information can be found on North Shore Rescue’s website.\nBoth embedded images show Kayla Brolly taking part in a North Shore Rescue operation.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Searching for rescuers: North Shore Rescue needs new volunteers",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/searching-for-rescuers-north-shore-rescue-needs-new-volunteers-1.3372599"
}