{
    "authors": [],
    "date_download": "2018-02-03 06:35:04+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 19:28:00",
    "description": "The government purchased the prominent home, located near Trout Lake, in 2016.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fvacant-city-owned-house-not-subject-to-vancouver-empty-homes-tax-1.3788084.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3788086.1517628386!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nAs Vancouver tries to crack down on property owners who leave their homes unoccupied, the city is facing criticism for doing the same.\nThe local government initially purchased the prominent home, located at 3030 Victoria Dr. near Trout Lake, in February 2016 as part of a move to expand John Hendry Park. That plan, however, fell through.\nIn July 2017, the city said it would rent out the property after conducting repairs “to make the house habitable following water damage that occurred due to leaky pipes.”\nBut that hasn't happened yet and the house has spent the past two years collecting newspapers and junk mail.\n\"Every once in a while, there's a property like that, that's orphaned and there's a different transition with it,\" Mayor Gregor Robertson said.\nNormally, an owner who leaves their property vacant would face costly fines and taxes under the city's Empty Homes Tax program.\nThis property, however, is exempt because it is owned by the city itself, which says keeping it empty was never the intention and that there's no point in city hall taxing itself.\nThis would also be the case for any residential properties owned by the Crown, charities or churches.\nSome residents, however, are accusing the city of hypocrisy.\n\"It is a double standard,\" said Vancouver resident Ana Carrizales. \"I mean, the city needs to make a choice.\"\nOfficials are promising that the home will be rented out once repairs are done.\n\"We have clear objectives with city-owned real estate that we maximize the highest and best use,\" Robertson said.\nVancouver property owners had until Friday to divulge whether their home is their primary residence, a secondary residence, is rented out to tenants or is empty as the city tries to add some of the 250,000 homes that asitting empty to the long-term rental market.\nThose who didn't submit their declaration in time could face a one-per-cent Empty Homes Tax on the assessed value of their property and a $250 fine.\nAccording to the city, officials will begin issuing the taxes and fines Monday.\nWith a report from CTV Vancouver's St John Alexander",
    "source_domain": "bc.ctvnews.ca",
    "title": "Vacant, city-owned house not subject to Vancouver empty homes tax",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/vacant-city-owned-house-not-subject-to-vancouver-empty-homes-tax-1.3788084"
}