{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-02-02 23:07:57+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 12:28:00",
    "description": "The suspect allegedly grabbed a stranger's face and licked her on the Millennium Line on New Year's Day.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fman-licked-stranger-s-lips-on-skytrain-transit-police-1.3787434.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.1462127.1517603188!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Police are searching for a man in his 20s after a woman reported that a stranger licked her lips on a SkyTrain last month.\nMetro Vancouver Transit Police said the incident occurred at approximately 2:30 a.m. on New Year's Day.\nA 21-year-old woman and two friends boarded a Millennium Line SkyTrain at Commercial-Broadway after a night of celebrations. A male suspect and two of his friends boarded at the same time in the same train car.\nDuring the ride, the men attempted to have a conversation with the women \"in a manner that made the women feel uncomfortable,\" officials said in a statement a month after the incident.\nThe women told police they ignored the men until one of them made a comment to the suspect about his choice in hair colour.\nThe suspect stood up, grabbed the woman by the face and licked her lips with his tongue, police said. The victim shoved him away, and the women moved to the opposite end of the train car until the men got off at Lougheed Station.\nPolice praised the victim for her bravery and courage to come forward.\n\"Sexual assaults are a priority for the transit police and every sexual assault will be investigated thoroughly,\" they said.\nThe male suspect has been described as a Middle Eastern man who is around 24 years old. He is about 5-6, with a thin build and dyed, faded blond hair. At the time of the incident, he was wearing earrings, a blue denim jacket and blue jeans.\nThe incident is under investigation, and anyone with information on the witness or what happened is asked to contact transit police at 604-515-8300, and cite the file number 2018-8. Tips can also be texted to 87-77-77.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Man licked stranger's lips on SkyTrain: transit police",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/man-licked-stranger-s-lips-on-skytrain-transit-police-1.3787434"
}