{
    "authors": [
        "Bhinder Sajan",
        "Kendra Mangione"
    ],
    "date_download": "2018-03-19 23:09:44+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 15:04:00",
    "description": "The initiative is meant to reduce the amount parents pay while ensuring staff are still properly compensated.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fparents-hoping-to-see-reduced-daycare-fees-may-have-to-wait-1.3849335.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3393603.1493685564!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The first step in the NDP government's much-hyped billion-dollar child care plan may not roll out exactly as hoped.\nA lack of information has some of B.C.'s child care operators considering opting out or delaying signing up for an initiative that promises to save parents money.\nThe BC Child Care Owners Association says there are major problems with the government's fee reduction plan, including that they haven't been consulted.\nThe non-profit advocacy group said the NDP is \"in the process of dramatically changing the landscape of child care in British Columbia.\"\nAmong those changes is the Child Care Fee Reduction Initiative, under which licensed providers who have opted in will receive funding.\nThe program is optional, but all participating child care providers will be required to reduce their fees once the initiative comes into effect. However, providers may be permitted to increase parent fees by a pre-planned \"reasonable\" amount during the year if the province approves.\nThose facing \"extraordinary circumstances\" can also apply for parent fee increases if the ministry has approved in writing.\nThe province has billed the initiative as a way to keep parents' fees affordable, provide fair salaries to staff and maintain quality of care.\nThe BCCCOA said some of its members feel the program was rushed and \"has caused chaos and confusion\" among those being \"pressured\" to sign up.\nRepresentative Amanda Worms said child care providers were initially excited to hear about the province's major investment, but when the initiative was announced, their excitement turned to confusion.\n\"We would have to freeze our rates if we want to opt in. The problem is that our leases are going up every year and we have staff who are really underpaid,\" Worms told CTV News.\n\"There doesn't need to be any money spent on research. You can ask any owner or operator. There is a staffing crisis.\"\nBCCCOA members take issue with the fact that those working in the industry weren't consulted, and that parents were told first, through the media, about the discounts they'd receive.\nProviders have seen what's been made public, but haven't been told any details from the province. For example, it's unclear to providers whether the program will be tied to inflation, and if there will be caps on fees.\n\"It's not feasible for us. I can't run the risk of not being able to pay my lease and wages,\" Worms said.\nSome only received their contracts Monday morning, but parents have been told already that they can search an online map for providers offering reduced fees.\n\"It's been challenging for us to answer questions to our families,\" Worms told CTV News.\nParents were also told that they could start seeing discounts as early as April 1, meaning child care providers would have only eight days to make a decision.\nHowever, Worms said she's heard most operators are going to wait until there's more information on wages and other details. The BCCCOA said the \"rushed\" deadline prevents child care operators from seeking legal review and advice.\n\"We're expected to reduce rates by April 1. The administrative side of that is massive, and most of us are on spring break,\" Worms said.\nWhile parents were told by the province they could start seeing discounts as early as April 1, many daycares are choosing to wait until at least May to make the decision, Worms said. Once they do, only the province can approve fee hikes.\nA fact sheet issued to providers says those participating will receiving funding depending on type of care and age of children. For example, for every space for group care of infants or toddlers, providers would get $350 per month. For children aged three to five, providers of group daycare would receive $100 per month per space.\nIndividuals do not have to enroll or apply in order to receive the benefit, a fact sheet for parents said. Instead, the savings will be passed down through child care providers that have already opted in to the program.\nThe ministers responsible weren't available for interviews. Staff pointed CTV to the fact sheets online, and parents with questions can call the government hotline.\nWith a report from CTV Vancouver's Bhinder Sajan",
    "source_domain": "bc.ctvnews.ca",
    "title": "Parents hoping to see reduced daycare fees may have to wait",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/parents-hoping-to-see-reduced-daycare-fees-may-have-to-wait-1.3849335"
}