{
    "authors": [],
    "date_download": "2017-02-15 01:58:04+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Inderjit Singh Reyat was transferred to the halfway house from prison one year ago.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fair-india-bomb-maker-released-from-halfway-house-1.3285761.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.2753351.1453854255!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThe only man convicted in the 1985 Air India bombings has been allowed to move out of his halfway house, one year after being released from prison.\nThe decision was made late last month by the Parole Board of Canada, which credited Inderjit Singh Reyat for embracing strong anti-violence views since the notorious terror attacks that killed 331 people – though psychologists have warned those views could disappear under the wrong circumstances.\n\"According to psychological assessments your risk to re-offend is low, however if there were a threat to your Sikh cause, your risk for future… group violence is high,\" the parole board’s Jan. 26 decision reads.\nThere's no information to suggest his cause is currently under threat, it adds.\nReyat has also demonstrated no desire to re-establish contact with his co-accused, against whom he has steadfastly refused to testify, according to the board.\n\"There have been no police concerns since your release, and the High Risk Target Team is supportive of the removal of your [halfway house] condition,\" the board wrote in its decision.\nReyat, who provided bomb parts used in the attacks, is serving a seven-year sentence for perjury for repeatedly lying in the Air India trial.\nHe was granted statutory release into a halfway house in January 2016. The location was never disclosed to the public.\nHe was previously convicted of manslaughter, possession of a restricted weapon, possession of explosives, making an explosive substance with the intent to cause an explosion, and other counts in connections with the bombings, for which he was sentenced to 15 years behind bars.\nDespite his release last month, he remains under several conditions, including that he avoid extremist propanda and people he has reason to believe are involved in extremism, crime or politics.\nHe is also barred from making any contact, direct or indirect, with his victims' families.\nReyat must undergo mental health counselling to address \"violence, empathy and cognitive disorders, and is prohibited from possessing components that could be used to build explosive devices.\nWith files from The Canadian Press",
    "source_domain": "bc.ctvnews.ca",
    "title": "Air India bomb maker released from halfway house",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/air-india-bomb-maker-released-from-halfway-house-1.3285761"
}