{
    "authors": [
        "Dirk Meissner"
    ],
    "date_download": "2018-04-25 02:45:56+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 17:23:00",
    "description": "B.C.'s finance minister said the government will share the data it collects with the CRA to monitor taxes.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fb-c-law-targets-condo-flipping-tax-evasion-rental-home-protection-1.3900685.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3900690.1524615606!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dirk Meissner, The Canadian Press\nVICTORIA - British Columbia's government wants to crack down on tax evasion in the condominium market and gives municipalities more control over rental housing as it looks for ways of easing a housing crunch.\nFinance Minister Carole James said legislation introduced Tuesday would require developers to collect and report buyer information on the purchase and sale of condos before they are built to ensure the proper amount of tax is paid.\nThe prices of so-called presale condominiums are inflated by people who buy and sell the properties without ever living in them or paying capital gains tax, she said.\n“This is a key step to stopping people from using presale condos as a quick, lucrative investment,” James said. “It's also to stop them from driving prices up for British Columbians trying to get into the housing market.”\nShe said the government will share the presale data it collects with the Canada Revenue Agency to monitor taxes.\nThe agency said last fall it was analyzing 2,810 transactions of pre-construction condo flipping in Toronto and may carry out audits to find tax evaders. The agency said real estate deals in the hot housing markets in the Toronto and Vancouver areas have been the subject of greater scrutiny.\nJames said the legislation follows the New Democrats' pledge earlier this year to spend more than $6 billion on affordable housing over the next decade.\nShe said too many people in B.C. cannot afford homes and some, including seniors, are at risk of becoming homeless.\nThe provincial government recently introduced a speculation tax on some vacant homes to encourage rentals, increased the foreign buyers tax on property sales and created a housing hub program to link non-profit and faith groups with property to developers and government to build affordable housing.\n“We're still seeing high prices,” James said. “Vacancy rates are still a challenge. The hope is that will begin to moderate the market.”\nThe Real Estate Board of Greater Vancouver reported last month the average benchmark price for all properties in Metro Vancouver was just below $1.1 million, an increase of 16 per cent since March 2017. The average price for a detached single family home in Metro Vancouver was $1.6 million.\nRental vacancy rates in the areas around Vancouver, Victoria and Kelowna are below one per cent.\nCameron Muir, chief economist at the B.C. Real Estate Association, said the plan to compile data to track presale condominiums is long overdue.\n“It's a data gap that needs to be addressed and I think this is a good move to better understand the presale condo market,” he said, adding the legislation would force the reporting of the condo flips and allow the government to collect the tax.\nHousing Minister Selina Robinson said the government also introduced amending legislation to give municipal governments stronger zoning tools to protect and improve the supply of rental properties.\nThe legislation would allow local governments to ensure existing rental properties cannot be redeveloped for other uses, she said. It would also permit cities to ensure undeveloped land zoned for rental will be used for rental homes, said Robinson.\n“Local governments are on the front lines of this housing crisis,” she said. “With this new authority local governments will be able to preserve existing rental stock and encourage the development of new purpose-built rentals within their communities.”\nThe amendments would require local governments to conduct housing need assessment surveys and prepare data reports every five years, Robinson said.\nMuir said the hot real estate market in Metro Vancouver has deterred developers from embracing the rental construction market.\n“The profit tends to be in the condominium side,” he said. “Any measure to induce increased rental construction activity is probably a good one.”\nVictoria Mayor Lisa Helps said there are 10,000 rental buildings from the 1960s in Victoria that require some form of updating, including seismic work.\n“We're definitely looking at incentives for developers,” she said.",
    "source_domain": "bc.ctvnews.ca",
    "title": "B.C. law targets condo flipping, tax evasion, rental home protection",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/b-c-law-targets-condo-flipping-tax-evasion-rental-home-protection-1.3900685"
}