{
    "authors": [
        "Camille Bains"
    ],
    "date_download": "2018-02-03 06:34:58+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 19:44:00",
    "description": "Todd Stone immediately requested a full investigation to determine what happened.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fliberal-leadership-hopeful-loses-members-over-missing-emails-1.3788094.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3788099.1517629459!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Camille Bains, The Canadian Press\nVANCOUVER -- One of the contenders vying to lead British Columbia's Liberal party won't have the backing of 1,349 prospective members who were disqualified from voting because of incomplete applications.\nA spokesman for Todd Stone's campaign said email addresses were missing on membership applications of people whose first language is not English.\nPeter Fassbender said in a statement on Friday that the issue came to light Jan. 26 when the party contacted Stone's senior campaign team.\nStone, who is one of six people hoping to lead the Liberals, immediately requested a full investigation to determine what happened.\nThe party agreed with Stone that people with incomplete applications should not be allowed to cast a ballot, Fassbender said.\nParty members began voting on Thursday, and the process will continue until Saturday, when the Liberals will announce their next leader.\nLiberal party spokesman David Wasyluk said the cutoff for membership signups was on Dec. 29 and over 14,000 audit calls were made to verify their members' contact information.\nWasyluk could not say how many members each of the campaigns had signed up by the deadline.\nA statement from Geoff Plant, the party's chief returning officer and an attorney general in the former Liberal government, said since taking the job his priority has been ensuring the integrity of the membership database, which included a rigorous inspection of applications.\n\"As a result of this membership verification process, some applications from each of the submitting campaign teams did not meet the party's standards and were not accepted,\" Plant said in a statement issued Friday. \"Each of the leadership campaigns that submitted applications was informed by the party how many of these were not accepted, and for what reasons.\"\nStone is in the race against Mike de Jong and Andrew Wilkinson, both of whom were longtime members of former premier Christy Clark's cabinet. Liberal backbenchers Sam Sullivan and Michael Lee are also aiming to take the helm, as is former Conservative MP Dianne Watts, who was once mayor of Surrey.\nStephen Carter, spokesman for de Jong's campaign, said the party had 63,000 members on Dec. 28 but then wound up with 59,000 members.\nHe said de Jong's campaign, along with those of three others -- Lee, Watts and Wilkinson -- co-signed a letter this week asking the party to make Stone's membership issue public so members could make an informed decision before casting their ballots.\n\"They needed to have the full information and the full story and now in the middle of the voting, the full story has finally come out,\" he said.\nCarter said a social media marketing company called AggregateIQ had contacted de Jong's campaign to try and build memberships but was unsuccessful in securing a contract, though it did work for Stone's campaign.\nIts tactics involved creating domains and email portals to attach email address to new members, he said, adding the loophole is technically not against the Liberal party's rules.\nCarter said 46 per cent of members had yet to vote by Friday.\n\"This whole revelation that happened around Todd Stone shakes the whole race up because people who were going to choose Todd Stone on the first ballot are now essentially free agents.\"\nKaty Merrifield, campaign manager for Wilkinson, said in a statement: \"Today's disclosure of more than 1,000 ineligible Stone campaign memberships is disappointing. I am proud the Wilkinson campaign has been firmly based on integrity and transparency.\"\nLaura Balance, spokeswoman for Watts, said the campaign would not be commenting on the issue. A spokesman from Lee's campaign also declined comment.\nA spokesperson for Sullivan was not immediately available.\nPlant said media reports around the voting process are a reminder that the system works.\n\"Where membership applications did not meet the party's strict criteria, they were not accepted,\" his statement said.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Liberal leadership hopeful loses members over missing emails",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/liberal-leadership-hopeful-loses-members-over-missing-emails-1.3788094"
}