{
    "authors": [],
    "date_download": "2018-04-24 17:08:14+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 08:21:00",
    "description": "IHIT believes the killer may have withdrawn from social activities and missed work after Shen's murder.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fpolice-release-criminal-profile-of-marrisa-shen-s-possible-killer-1.3899516.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3765608.1516307626!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nNine months after the murder of 13-year-old Marrisa Shen, the person responsible remains on the loose – but police are hoping a new criminal profile will help bring her killer to justice.\nOn Tuesday, the Integrated Homicide Investigation Team released a number of behaviours they believe the murderer may have exhibited after Shen's death on July 18, 2017.\nThe killer may have withdrawn from social activities, missed work or scheduled appointments, attempted suicide or displayed suicidal gestures, and shown a keen interest in the media coverage of Shen's murder.\nIt's possible the person increased or decreased their alcohol or drug use as well, according to the profile.\n\"There continues to be a high degree of public interest in the homicide of Miss Shen,\" Cpl. Frank Jang said in a news release.\n\"I strongly urge anyone with information or anyone who may recognize these characteristics and behaviours in someone they know, to please come forward and speak with IHIT.\"\nThe criminal profile, which was developed in consultation with the RCMP's Behavioural Science Group, also suggests the unidentified killer might have lived near Burnaby's Central Park, where Shen's body was found, and uncharacteristically avoided the area after her murder.\nProfilers believe the killer could have even moved away unexpectedly after Shen's death, either permanently or temporarily.\nIn their search for a suspect, investigators have already pored over thousands of hours of video and investigated hundreds of leads. Earlier this year, IHIT indicated it had a \"list of people\" that investigators believe have information on Shen's murder, but did not elaborate.\nAnyone who has information that could help push the probe forward is asked to contact IHIT, or, if they wish to remain anonymous, Crime Stoppers.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Police release criminal profile of Marrisa Shen's possible killer",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/police-release-criminal-profile-of-marrisa-shen-s-possible-killer-1.3899516"
}