{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-03-19 18:10:26+00:00",
    "date_modify": null,
    "date_publish": "2018-03-19 10:14:00",
    "description": "B.C. hospitals will perform 900 more dental surgeries in the coming year, the health ministry said.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fin-effort-to-improve-wait-times-b-c-increasing-number-of-dental-surgeries-1.3849152.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.837220.1339597412!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Staff at B.C.'s hospitals will perform 900 more dental surgeries in the coming year to support vulnerable children and adults, the province announced Monday.\nIn a statement, the health minister said dental surgeons will perform 15 per cent more surgeries in 2018-19 than the previous year.\nThe move is an effort to shorten a growing waitlist of people who require dental procedures that cannot be performed without anesthesia, for reasons including developmental disabilities and complex medical conditions.\n\"The result will be a substantial reduction in wait times for people currently suffering in pain,\" the ministry said.\nThe procedures range from fillings to dental prosthetics, and are typically provided in dental offices under local anesthetic and/or sedation. However, some people require general anesthetic to ensure their safety and comfort, even for teeth cleanings.\n\"I have heard from parents whose sons and daughters are suffering for long periods in pain, in some cases without any understanding of what is happening to them,\" Health Minister Adrian Dix said in the statement.\nFaith Bodnar, executive director of Inclusion BC, said the procedures are essential for quality of life.\n\"Recognizing those with developmental disabilities, such as Down syndrome, cerebral palsy and autism, need more access for dental care that can better accommodate their physical needs is long overdue. More dental surgeries in a timely manner is a step in the right direction.\"\nThe province said nearly one-fifth of people waited more than half a year for dental surgery in 2016-17. The following year, about 15 per cent waited that long.\nIn addition to increasing surgery access, the ministry will be working with the province's dental association to revise wait-time guidelines and protocols. Further improvements are expected in 2019-20, the province said.",
    "source_domain": "bc.ctvnews.ca",
    "title": "In effort to improve wait times, B.C. increasing number of dental surgeries",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/in-effort-to-improve-wait-times-b-c-increasing-number-of-dental-surgeries-1.3849152"
}