{
    "authors": [
        "Dirk Meissner"
    ],
    "date_download": "2017-06-15 04:41:18+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 15:08:00",
    "description": "The NDP and Green leaders say it's not unprecedented for an opposition MLA to serve as Speaker.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fhorgan-weaver-look-to-liberals-for-help-keeping-b-c-legislature-afloat-1.3459590.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3459660.1497478003!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Dirk Meissner, The Canadian Press\nVICTORIA -- The leaders of British Columbia's New Democrats and Greens say it is not unprecedented for an Opposition member to serve as Speaker as they prepare to navigate a potentially tricky political situation in the provincial legislature.\nNDP Leader John Horgan and Green Leader Andrew Weaver are using former Liberal MP Peter Milliken as an example, saying he served as Speaker in the House of Commons during a minority Conservative government.\n\"Peter Milliken, elected Speaker after five ballots under (former prime minister) Jean Chretien back in 2001, served as the Speaker through successive Conservative minority and majority governments,\" Weaver said Wednesday.\nB.C.'s election last month did not produce a clear winner in the 87-seat legislature with Christy Clark's Liberals winning 43 seats, the NDP 41 and the Greens three.\nThe NDP and the Greens have a deal that would see the New Democrats form a minority government if the Liberals are defeated in the legislature.\nClark said when politicians return to the house on June 22 the Liberals will put forward a member to serve as Speaker.\nBut if her minority government is defeated, political tradition dictates a new Speaker be elected and that person normally comes from the government side of the house, which would mean electing a New Democrat to the position.\nIn that scenario, there would be a 43-43 tie in the legislature.\nHorgan suggested the person who becomes Speaker next week, likely a member of Clark's caucus, should remain in the position following the expected defeat of the Liberal government in a confidence vote later this month.\n\"This is how I see it,\" said Horgan. \"The government, current, is going to put forward a Speaker. Good. That Speaker should be in place as a non-partisan for the term of the parliament.\"\nAttorney General Andrew Wilkinson suggested it is up to the NDP and Greens to supply the Speaker if the NDP forms a minority government.\n\"If the Greens and the NDP are purporting to be able to provide a stable government for British Columbians, then they have to do it from within their own resources,\" he said.\nExperts have said an impasse over the Speaker could send voters back to the polls.\nThe Speaker's role is to enforce the rules in the legislature and he or she only votes in the event of a tie, and even then only to maintain the status quo, as per tradition.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Horgan, Weaver look to Liberals for help keeping B.C. legislature afloat",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/horgan-weaver-look-to-liberals-for-help-keeping-b-c-legislature-afloat-1.3459590"
}