{
    "authors": [],
    "date_download": "2017-02-15 07:48:02+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Nearly 10,000 homeowners opted to delay making their tax payment last year, a huge increase over 2015.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fproperty-tax-deferrals-skyrocketed-67-per-cent-last-year-1.3285962.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3248771.1484867464!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThere was a massive jump in the number of people taking advantage of B.C.'s property tax deferrals in 2016, but experts warn the program might be doing more harm than good.\nNearly 10,000 homeowners opted to delay making their tax payment last year, an increase of 67 per cent over 2015.\nThe program was designed to let seniors stay in their homes longer, accumulating taxes in the form of a low-interest loan until the properties are sold, but real estate experts argue the loose rules are benefiting some who don't need the help.\n\"Thousands of people who can afford to pay their property tax are taking advantage of it because it's not means tested, and it should be,\" consultant Michael Geller said.\nThat's because the interest rate for anyone over the age of 55 is just 0.7 per cent. That's too good to pass up for people like Geller, who defers thousands of dollars a year and invests the money instead.\n\"I think next year many more people will take advantage of it. They are fools not to from a financial point of view,\" he said.\nSeniors staying in their large houses longer also means less supply and higher prices for families desperate to find a place to live, Geller added.\nHe believes the government should be encouraging seniors to downsize rather than trying to keep them where they are.\nYounger families with children can also defer their property taxes, but the interest rate is higher, at 2.7 per cent.\nBut if anyone should be getting a preferential rate, it's them, according to researcher Paul Kershaw of Generation Squeeze.\n\"If we're going to have more generous interest rates, it needs to be for younger people. They're the ones being especially harmed by high house prices,\" Kershaw said.\nThe B.C. government said it has no plans to change the program, which it is promoting, along with its down-payment loans, in ads leading into the May election.\nWith a report from CTV Vancouver's Mi-Jung Lee",
    "source_domain": "bc.ctvnews.ca",
    "title": "Property tax deferrals skyrocketed 67 per cent last year",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/property-tax-deferrals-skyrocketed-67-per-cent-last-year-1.3285962"
}