{
    "authors": [
        "Geordon Omand"
    ],
    "date_download": "2017-06-14 22:32:10+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 07:54:00",
    "description": "The Transportation Safety Board has made three recommendations aimed at preventing another tragedy.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Flarge-wave-overturned-leviathan-ii-whale-watching-vessel-tsb-report-1.3458819.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3437669.1496253608!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Geordon Omand, The Canadian Press\nVANCOUVER -- It took 45 minutes before search-and-rescue crews learned that 27 people had been dumped into the frigid waters off Vancouver Island after their whale-watching boat capsized in October 2015, the Transportation Safety Board says.\nIt was only by chance that a crew member spotted a flare floating in the wreckage and used it to alert nearby fishing boats, said Kathy Fox, head of the federal agency.\nThe safety board released its investigation of the capsizing on Wednesday, concluding that a large, breaking wave flipped the Leviathan II on October 23, 2015, killing five Britons and one Australian near the resort community of Tofino.\nFewer lives might have been lost had the federal government acted on safety recommendations that were made before the deadly accident, said Fox.\n\"None of the passengers were wearing life-jackets and, as they struggled to keep their heads and mouths above water in heavy swells, some passengers ingested sea water, oil and fuel,\" she said.\n\"When people find themselves immersed in cold water, every second counts, even more so in a rapid capsizing situation like this one.\n\"Disoriented, separated from loved ones and without any flotation aid, some of them panicked, were struck by debris or simply couldn't swim.\"\nFox said some of the fatalities might have been prevented had passengers been wearing life-jackets.\nThe report makes three recommendations, including that all commercial passenger vessels operating beyond sheltered waters carry emergency radio beacons that activate automatically to transmit a boat's position.\nThe board also recommends that passenger vessels across Canada adopt risk-management processes that identify hazards, such as areas known to have large, breaking waves.\nIn the days after the capsizing, the board said many passengers were standing on the top deck on one side of the ship when a large wave hit the opposite side, rolling the boat and sending the passengers and crew into the water.\nThe board's investigation determined that neither the structure of the boat nor the location of the passengers when the wave struck contributed to its capsizing.\nClinton Rebeiro, the investigator in charge for the board, said offshore waves travelling over a rising ocean floor and meeting opposing tides can cause waves to become higher or steeper, but determining when that will happen \"is almost impossible to predict.\"\n\"The nature of sea and the process that combine to form breaking waves in shallow areas are complex,\" he told a news conference in Vancouver.\nIn the case of the Leviathan II, the wave was about the height of the top of the bridge, Rebeiro said.\nTransport Canada said in an emailed statement it is reviewing the report and will respond within the required 90-day period.\n\"The safety and security of Canadians and those visiting our country are a top priority for the government of Canada,\" it says.\nCourt documents filed last year by Jamie's Whaling Station, the vessel's owner, in response to a civil lawsuit by several passengers describe the event as an \"act of God\" that could not have been reasonably predicted.\nSurvivors described being thrown into the ocean without life-jackets, grabbing hold of a single life-ring that floated in the waves.\nIn a statement, Jamie's Whaling Station said that following the capsizing it has equipped its boats with manually inflatable personal flotation devices to be worn by passengers on outer decks, in addition to the life-jackets that are required by Transport Canada.\nIt has also reinstated the use of the radio beacons that were recommended by the board, improved radio call-in procedures between its offices and tour vessels, and made it easier to launch life-rafts by installing cradles that do not require lifting by the crew.\nSpokesman Ryan Teremy said the company is relieved the report is out and noted that it aligns with crew reports about a large and unexpected wave.\n\"We're going to take all the recommendations very, very seriously,\" Teremy said. \"Wherever we can advance safety, we will.\"\nThe role of the safety board is to investigate marine, pipeline, rail and aviation incidents but it does not assign fault or determine civil or criminal liability.\nThe RCMP are also investigating the incident and Cpl. Tammy Douglas said Tuesday the file remained open pending the report.\nHIGHLIGHTS FROM THE TSB REPORT\nKey findings of the Transportation Safety Board on causes and contributing factors in the capsizing of the Leviathan II, along with some recommendations made by the board:\n-- Conditions were favourable for the formation of breaking waves and moments before the wave that capsized the boat struck, the master became aware of it and attempted to realign the vessel to minimize its impact, but there was not enough time for his actions to be effective.\n-- The vessel maintained position on the weather side of a reef that was exposed to the incoming swell to allow passengers to view wildlife. As the vessel was leaving the area, a large wave approached from the starboard quarter.\n-- It took about 45 minutes before search-and-rescue authorities became aware of the capsizing because the crew did not have time to transmit a distress call, nor did the vessel have a means to automatically send one.\n-- Crew members were able to discharge a parachute rocket, which alerted a nearby Ahousaht First Nation fishing vessel that was instrumental in saving the lives of a number of survivors.\n-- If companies that operate passenger vessels do not implement risk management processes for environmental hazards there is a risk of a similar capsizing and loss of life.\n-- The life-raft deployed after the capsizing was fitted with an emergency pack that did not contain devices effective for signalling distress, such as a parachute rocket or buoyant smoke float.\n-- Transport Canada should consider whether requirements for the use of digital emergency beacons should be applied to additional classes of boats and airplanes.\n-- Operators of commercial passenger vessels on the west coast of Vancouver Island should be required to identify areas and conditions conducive to the formation of hazardous waves and adopt strategies to reduce the chances of passenger vessels encountering those conditions.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Large wave overturned Leviathan II whale-watching vessel: TSB report",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/large-wave-overturned-leviathan-ii-whale-watching-vessel-tsb-report-1.3458819"
}