{
    "authors": [
        "Dario Balca"
    ],
    "date_download": "2018-02-03 06:35:08+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 18:17:00",
    "description": "The Mobility Pricing Independent Commission is expected to deliver a more extensive report in April.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fmobility-pricing-maps-show-where-and-how-drivers-could-be-charged-1.3788028.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3788032.1517624153!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "An independent commission tasked with studying mobility pricing in Metro Vancouver has released a series of maps that show where and how drivers could be charged.\n\"We've just thrown out some examples just to try and understand what the impacts of this could be,\" Daniel Firth, the commission's executive director, told CTV News.\nThree of the seven maps provide examples of distance-based pricing models, including a one-zone model for all of Metro Vancouver where prices would depend on time and location as well as a multi-zone strategy targeting high-traffic areas across municipalities. The commission also offered a two-zone map where drivers would be charged more in Vancouver, Burnaby and New Westminster than the rest of the region.\nThe four other illustrations suggest busy bridges, tunnels and intersections where tolls could be implemented as part of a strategy the commission calls “congestion point charges.”\n\"Because we adjust the number of people driving a little bit, that makes it work faster and work better for everybody else,\" Firth said. \"We can get more people through because there's not as much traffic.\"\nThe maps come less than a month after a report in which the commission narrowed its focus to these two pricing models.\nFirth, however, said the maps are far from finished products and are simply meant to spark conversation as the commission heads into another round of public consultations starting Feb. 22.\n\"We just want to get some first reactions and some first concerns and questions that people have so that we know what more research we need to focus on,\" he said.\nThe maps do not indicate how much the charges would actually be. Firth said pricing is \"the hardest part of it\" and will require more research and feedback from stakeholders.\n\"It needs to be just enough that you're getting just a few people to change their behaviour without being so much that it makes transportation unaffordable,\" he said.\nBut several Metro Vancouverites say that no matter the pricing or the model, they will be worse off.\n\"I'm not a fan,\" said Vancouver resident Daniel Kobylka. \"I already pay enough as is—why an additional charge?\"\nWest Vancouver resident Donal O'Callaghan said the while he’s not entirely opposed to congestion charges, the pricing models could be a case of \"choose your poison.\"\nBased on Firth’s experience with similar initiatives in cities such as London and Stockholm, however, drivers begin to support mobility pricing once it is implemented and “people see the congestion benefits.”\nGordon Price, director of The City Program at Simon Fraser University, said Metro Vancouverites are unlikely to face these charges anytime soon.\n\"It's a good time to be talking about it, but I think we're going to be talking about it for a while,\" he said.\nPrice said part of what will take time will be reconciling what he called \"fairness issues\" that arise from how differently congestion charges would affect a downtown Vancouver resident as opposed to someone living in Langley, for instance.\n\"It's being able to understand what the fairness issues are and address them in a way where people feel 'OK, you've heard me,'\" he said. \"You are going to have to do tradeoffs. This will not be a perfect solution for everyone.\"\nCongestion charging has been credited with helping reduce gridlock in major cities such as Stockholm, where traffic decreased by 10 per cent after officials implemented a mobility pricing system.\nIt's also uncertain how an NDP government that campaigned on a promise to remove tolls from the Port Mann and Golden Ears bridges will respond to the commission's recommendations.\nIn January, Premier John Horgan would not rule out the possibility of bringing in new tolls.\n\"The tolls that we removed were in one part of the Lower Mainland and unique to British Columbia, and it was the fairness question we raised during the election campaign,\" he told reporters. \"I'll wait and see what they have to say and then we'll act on it.\"\nOfficials have warned that doing nothing is not an option, given the increasing congestion on roads and public transit in a region expected to grow by more than a million people by 2045.\nThe commission, which reports to the TransLink Mayors' Council, is expected to deliver a more extensive report in April.\nIn the meantime, people can sign up for updates at the ItsTimeMV website.\nWith files from CTV Vancouver's David Molko",
    "source_domain": "bc.ctvnews.ca",
    "title": "Mobility pricing maps show where and how drivers could be charged",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/mobility-pricing-maps-show-where-and-how-drivers-could-be-charged-1.3788028"
}