{
    "authors": [
        "Dario Balca"
    ],
    "date_download": "2017-12-12 01:53:30+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 15:35:00",
    "description": "Bacon was accused of first-degree murder and conspiracy to commit the murder of 21-year-old Corey Lal.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fcrown-lawyers-appeal-stay-of-jamie-bacon-s-charges-ask-for-new-trial-1.3717024.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.1913940.1405382897!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Crown lawyers have filed an appeal of the B.C. Supreme Court's decision to stay charges against Jamie Bacon, one of the men accused in the “Surrey Six” murders.\nIn a statement issued Monday, the BC Prosecution Service announced it is asking the province's Court of Appeal to set aside the stay and order a new trial for Jamie Bacon, who was accused of first-degree murder and conspiracy to commit the murder of 21-year-old Corey Lal.\nLal and five others, including two bystanders, were killed in an execution-style massacre at Surrey’s Balmoral Tower in October 2007.\nBCPS said the appeal is a matter of public interest and that the Supreme Court ruling \"reveals errors of law.\"\n\"A reasonable argument can be made that the ruling would not necessarily have been issued if the errors were not made,\" the statement read.\nAn abbreviated ruling released by the Supreme Court on Dec. 1 says Bacon's lawyers had obtained privileged information they were not allowed to use in his defence and could compromise his right to a fair trial.\n\"In part, this arose from the manner in which the police handled aspects of privileged and confidential information,\" the ruling said.\nThe judge also said the Crown cannot call someone Person X to the stand during trial.\nIn 2009, Person X, whose identity is protected by a publication ban, pleaded guilty to three counts of second-degree murder and conspiracy to commit murder in connection with the killings.\nThe details of what led the judge to stay charges against Bacon, however, remain sealed by the court.\nThe decision sent shockwaves across B.C. earlier this month, with Premier John Horgan calling the ruling \"a setback for all of us\" that threatens to erode public trust in the justice system.\nAttorney General David Eby also expressed his \"tremendous disappointment\" at the news.\n\"Where's the justice in this?\" said Eileen Mohan whose son, Christopher Mohan was one of two bystanders died in the gangland killings along with Ed Schellenberg.\nBacon remains in custody on a separate charge of counselling the murder of an individual. His trial is scheduled to begin on April 3, 2018.\nNone of the allegations in that case have been proven in court.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Crown lawyers appeal stay of Jamie Bacon's charges, ask for new trial",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/crown-lawyers-appeal-stay-of-jamie-bacon-s-charges-ask-for-new-trial-1.3717024"
}