{
    "authors": [
        "Andrew Weichel"
    ],
    "date_download": "2017-02-15 01:58:14+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Some of the pioneers of Vancouver's LGBT+ community are squaring off against the local Black Lives Matter chapter over the presence of uniformed police in the annual Pride Parade.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fdo-not-tell-us-how-to-organize-petition-calls-for-vpd-to-remain-in-pride-parade-1.3285402.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.2498734.1438486619!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Andrew Weichel, CTV Vancouver\nSome of the pioneers of Vancouver's LGBT+ community are squaring off against the local Black Lives Matter chapter over the presence of uniformed police in the annual Pride Parade.\nWeeks after BLM launched a petition calling for the Vancouver Police Department to voluntarily withdraw from the 2017 event, a counter-petition is circulating asking the force to remain a part of the parade.\n\"We're calling for inclusion,\" said Velvet Steele, a transgender rights activist who helped draft the petition. \"A police officer in or out of uniform is still a police officer at heart.\"\nBlack Lives Matter members have argued that while police should be able to take part as individuals, having them appear in uniform representing law enforcement as an institution is inappropriate.\nThat doesn't sit well with Gordon Hardy, who co-founded the Vancouver Gay Liberation Front in the 1970s. He credits the VPD, which has been taking part in the parade since 2002, with decades of positive engagement with the LGBT+ community in the city.\n\"Do not tell us how to organize our Pride Parade,\" Hardy told CTV News. \"It's annoying, to say the least, for these young people from Black Lives Matter to pop up and tell the rest of us what we should do.\"\nBlack Lives Matter did not respond to a request for comment, but its petition notes a number of examples of what members see as institutional issues in Canada's policing community, including the widely reported inaction toward cases of missing and murdered aboriginal women.\n\"The policing institution is an instrument of state violence and oppression. Dressing up in rainbows and feather boas does not change that fact,\" it reads.\n\"If they really support queer and trans people of colour they need to do a lot more work to earn their spot. There are so many other ways they can show meaningful initiative to work to protect the most marginalized groups.\"\nBLM also highlighted a 2015 Human Rights Tribunal decision against the VPD that found \"systemic discrimination\" in the way members dealt with transgender people. (LINK)\nThe counter-petition acknowledges Black Lives Matter's objections as a valid reflection of \"historic and ongoing injustices\" against black communities, but asserts that they don't reflect the Vancouver LGBT+ community's relationship with local police.\nAsked about the BLM petition last week, a Vancouver Police Department spokesman said members would be participating in this year's parade unless officially asked to withdraw. Forces in Toronto and Halifax have already announced they will step aside over the concerns of some in the community.\nNearly 700 people have signed BLM's petition, while the counter-petition has been signed more than 1,200 times.\nWith files from CTV Vancouver's Sarah MacDonald",
    "source_domain": "bc.ctvnews.ca",
    "title": "'Do not tell us how to organize': Petition calls for VPD to remain in Pride Parade",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/do-not-tell-us-how-to-organize-petition-calls-for-vpd-to-remain-in-pride-parade-1.3285402"
}