{
    "authors": [],
    "date_download": "2017-01-02 08:53:57+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "The water temperature was a frigid seven degrees Celsius and the air temperature was just plus one.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fmore-than-1-500-brave-frigid-waters-for-97th-annual-polar-bear-swim-1.3224159.json",
    "image_url": "http://bc.ctvnews.ca/polopoly_fs/1.3224166.1483323379!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "About 1,500 people braved the chilly waters of English Bay on Sunday to take part in the 97th annual Vancouver Polar Bear Swim.\nAt 2:30 p.m. when everyone took the plunge, the water temperature was a frigid seven degrees Celsius and the air temperature was just plus one.\nA stiff wind off the water made it feel even colder than that for the mix of rookies and veterans.\n“One year the snow was deeper, but the wind is bad this year,” said Jim Baxter who has participated every year since 1985.\nKen Hamilton took part for the 41st consecutive year, and he was joined by his adult children and 30 friends.\n“First timers, just get in and do it. Don’t hesitate. Run and jump in. And the rule is you have to get your head wet,” he advised those who had never done it before.\nAmong the rookies in his group was Devon Gorman, who didn’t know exactly what to expect.\n\"It was great. All I could think about was turning around and then I saw like 3,000 people running at me splashing in the water,” said Gorman.\nThe number of participants decreased from the 2,110 who took part last year – and was well below the record of more than 2,500 who took the plunge in 2014 when the temperature was a comparatively balmy eight degrees.",
    "source_domain": "bc.ctvnews.ca",
    "title": "More than 1,500 brave frigid waters for 97th annual Polar Bear Swim",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/more-than-1-500-brave-frigid-waters-for-97th-annual-polar-bear-swim-1.3224159"
}