{
    "authors": [],
    "date_download": "2017-10-06 20:44:01+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 08:54:00",
    "description": "The suspect suffered an apparent broken leg after falling from a parkade Thursday, police said.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fpolice-watchdog-called-after-prolific-offender-injured-in-abbotsford-1.3622340.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3622726.1507316875!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nB.C.'s police watchdog has been called to the Fraser Valley after a prolific offender was injured while allegedly fleeing from officers.\nPolice said the 37-year-old, who was wanted on outstanding warrants for driving offences, was seen speeding 90 km/h over the limit in Chilliwack Thursday morning. Officers then tracked him to the parkade at Sevenoaks Shopping Centre in Abbotsford.\nWhen they tried to arrest him, he allegedly resisted and fell roughly four metres from the second level of the parkade to the ground.\n\"The suspect was injured as a result of an impact with the ground but limped to a nearby vehicle that he attempted to steal. Police arrived quickly to that location and arrested the suspect,\" the Abbotsford Police Department said in a news release.\nThe unnamed offender was taken to hospital with what police suspect was a broken leg.\nThe department said one officer was also injured during the arrest, but it's unclear how seriously he was hurt. Police said he received treatment in hospital.\nThe Independent Investigation Office, which is tasked with investigating all police incidents that result in death or serious injury, was called to conduct a preliminary probe of what happened and determine if officers’ actions contributed to the suspect’s injury.\nPolice are recommending several charges against the prolific offender, including driving while prohibited, dangerous operation of a motor vehicle, resisting arrest, flight from police, hit-and-run, and attempted theft.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Police watchdog called after prolific offender injured in Abbotsford",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/police-watchdog-called-after-prolific-offender-injured-in-abbotsford-1.3622340"
}