{
    "authors": [],
    "date_download": "2017-08-15 03:46:38+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 07:46:00",
    "description": "The provincial government is offering $1,500 grants to small businesses impacted by evacuation orders.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fsmall-businesses-affected-by-b-c-wildfires-get-emergency-grants-1.3544836.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3538102.1502246475!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nWILLIAMS LAKE, B.C. - Small businesses affected by devastating wildfires in British Columbia will be getting some financial relief from the provincial government.\nForests Minister Doug Donaldson says small businesses, First Nations whose livelihoods are based on cultural practices and not-for-profit organizations that have been under evacuation orders or alerts are eligible for a $1,500 emergency grant.\nThe funding also applies to small businesses operating in areas affected by closures along Highways 20, 97, 26 and the eastern Cariboo Regional District, an area hard hit by fires.\nThe money will be distributed by the Canadian Red Cross, which received $100 million from the province when a state of emergency was declared in early July.\nDonaldson says small businesses are the lifeblood of rural communities and the government will be provide the necessary programs to support their recovery.\nExecutive director Claudia Blair of the Williams Lake Visitor Centre says businesses have already lost thousands of dollars after the area was evacuated last month, and the recent closure of the backcountry is expected to create more economic hardship.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Small businesses affected by B.C. wildfires get emergency grants",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/small-businesses-affected-by-b-c-wildfires-get-emergency-grants-1.3544836"
}