{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-02-02 23:08:03+00:00",
    "date_modify": null,
    "date_publish": "2018-02-02 11:25:00",
    "description": "The risk of human-triggered and natural avalanches is considerable to high for the North Shore mountains.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Favalanche-risk-high-in-some-elevations-this-weekend-1.3787334.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3662828.1509738077!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Officials are warning anyone heading to Metro Vancouver mountains this weekend to exercise extreme caution.\nSteady rain is in the forecast Friday, and combined with rising freezing levels, \"this is a great recipe for avalanche activity,\" Avalanche Canada said.\nThe agency raised the risk to \"high\" in higher elevations Friday, while it's considered \"considerable\" at the treeline level.\nAs of Friday morning, Avalanche Canada expected the risk in higher elevations to decrease to \"considerable\" for both Saturday and Sunday.\nWhen the risk is high, conditions are considered very dangerous, with natural avalanches considered likely and human-triggered slides very likely.\nIf the risk is considerable, conditions are considered dangers and human-triggered avalanches are likely.\nThose heading uphill are advised to avoid avalanche terrain and check conditions before heading into backcountry.\nIn addition to hills located on B.C.'s South Coast, the risk was also high for mountains in the Northwest Coastal, Cariboo, North and South Columbia and Purcells regions of the province.\nOther high-risk areas include Glacier, Jasper, Banff, Yoho and Kootenay National Parks and the Lizard Range and Flathead area of Alberta.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Avalanche risk high in some elevations this weekend",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/avalanche-risk-high-in-some-elevations-this-weekend-1.3787334"
}