{
    "authors": [],
    "date_download": "2017-12-11 19:45:33+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 08:42:00",
    "description": "Four byelections are taking place Monday, with the most heated race playing out in Metro Vancouver.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Ffederal-liberals-try-to-steal-seat-in-south-surrey-white-rock-byelection-1.3716295.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.205377.1430494826!/httpImage/image._gen/derivatives/landscape_620/image.",
    "language": "en",
    "localpath": null,
    "maintext": "The Canadian Press\nOTTAWA - The Trudeau government will get a chance to test its popularity today with four federal byelections.\nThe most heated race is the British Columbia riding of South Surrey-White Rock where the Liberals are making a concerted effort to steal the seat from the Conservatives.\nElections Canada: What you need to know about voting in a byelection\nBoth Prime Minister Justin Trudeau and Conservative leader Andrew Scheer have campaigned in the riding, which was held by Tory MP Dianne Watts who jumped to provincial politics.\nThe Conservatives have tried to stir up voter anger in the riding over the Liberal government's tax reforms that include closing loopholes for small business owners.\nThe Conservatives are considered in the driver's seat in the western Saskatchewan riding of Battlefords-Lloydminister, which has voted for right-wing parties since the 1990s.\nThe other two ridings, in Newfoundland and Labrador and Toronto, are considered safe Liberal seats.\nThe riding of Bonavista-Burin-Trinity became vacant last summer when the province's representative in the federal cabinet, Judy Foote, resigned for personal reasons.\nFoote had represented the area as a Liberal MP for the past decade.\nThe Toronto riding of Scarborough-Agincourt became vacant due to the death of Liberal backbencher Arnold Chan.\nIt has been in Liberal hands since the '80s.\nThe Saskatchewan seat became vacant this year when former Conservative cabinet minister Gerry Ritz left politics.\nIn the last election the New Democrats were a distant second in Ritz's riding and a distant third in the other three ridings.\nNDP Leader Jagmeet Singh the day before the vote shaking hands and greeting voters at an outdoor shopping centre in Montreal, nowhere near any of the ridings in play.\nSingh declined to speculate on his party's chances, saying only that he'd “called and spoken” to all his candidates and was happy with their campaigns.\n“They're running great campaigns and I'm confident they're going to put up a good representation of our values and what we believe in,” Singh said Sunday.\nThe Liberals hold a comfortable majority in the House of Commons so the outcome of the races will have little effect on the balance of power.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Federal Liberals try to steal seat in South Surrey-White Rock byelection",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/federal-liberals-try-to-steal-seat-in-south-surrey-white-rock-byelection-1.3716295"
}