{
    "authors": [],
    "date_download": "2017-04-18 04:15:57+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 13:28:00",
    "description": "Three people in hoodies kicked in the front door before bursting inside, surveillance video shows.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fgrandma-chases-intruders-armed-with-pepper-spray-out-of-burnaby-home-1.3372126.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372801.1492481348!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nA Burnaby woman in her 80s chased a trio of robbers out her front door after a home invasion that left her grandson with a face full of pepper spray.\nThe 22-year-old grandson, who asked to only be identified as Pav, said he was watching a movie on Easter Sunday around 10:45 p.m. when three people dressed in hoodies kicked in the front door.\nA surveillance camera in the front of the home captured two people aiming kicks at the door. From the video, it appears it took the suspects five kicks to open it.\nPav said he was in the washroom when he heard the kicking. He ran out, and by that time one of the intruders had reached the living room at the top of the stairs of his home.\nHe told CTV News he ran at the suspect to confront him, and was hit in the face with pepper spray.\n\"I was just down right away,\" Pav said.\nAs he lay on the living room floor, the suspects moved through the house quietly for the next five minutes, apparently looking for items to steal. He said he isn't sure what they ended up taking , but that his car keys appeared to be missing.\nHis sister-in-law, Mandeep, ran out of the back of the home, called 911, and hid in the yard until police arrived.\nWhile Pav and Mandeep both leapt to action, a third member of the family surprised them both with how she reacted.\nPav's 86-year-old grandmother went after the intruders, shouting at them to \"get out.\" She chased them out of the house, and was seen on surveillance video confronting them outside the front door, although Pav said she doesn't speak English.\nVideo showed her following the suspects outside, then going back inside the house. After she went in, a suspect followed her back into the home, then came back out with her behind him.\nPolice arrived seconds later, and the three suspects fled the area on foot. Burnaby RCMP brought in a K-9 unit, but were unable to track them. Mounties told CTV no arrests have been made, and they're still looking for three suspects.\nPav told CTV News he had no idea why the men targeted his home, and he believes his family was mistakenly hit. He guessed that maybe they thought the home was empty, because the lights in the front were off at the time.\nHe said he regrets confronting the man in his home, and says he wishes he would have run away instead.\n\"In hindsight it was a bad decision, but I only saw one, so I thought, I might be able to take this guy. Who knows?\" Pav said of the incident that left him with a face full of pepper spray.\n\"It was just a burning sensation, like my eyes were on fire.”\nFirefighters gave him some water and some kind of liquid, which he said may have been soap, then recommended he try cold milk.\n\"That was the game changer. I was able to see after I poured that in.\"\nWith a report from CTV Vancouver's David Molko",
    "source_domain": "bc.ctvnews.ca",
    "title": "Grandma chases intruders armed with pepper spray out of Burnaby home",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/grandma-chases-intruders-armed-with-pepper-spray-out-of-burnaby-home-1.3372126"
}