{
    "authors": [
        "Joan Bryden"
    ],
    "date_download": "2017-12-12 07:05:30+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 08:42:00",
    "description": "Liberal Gordie Hogg won the South Surrey-White Rock riding with 47 per cent of the vote.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fliberals-win-three-of-four-byelections-including-upset-in-b-c-1.3716295.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3717187.1513038982!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Joan Bryden, The Canadian Press\nOTTAWA - Justin Trudeau's Liberals scored another byelection upset Monday, snatching the British Columbia riding of South Surrey-White Rock away from the Conservatives.\nGordie Hogg won the riding with 47 per cent of the vote, just five percentage points ahead of Conservative Kerry-Lynne Findlay, a former Harper-era cabinet minister who represented a neighbouring riding for one term before being defeated in 2015.\nIt's the first time in 70 years that a Liberal has represented any portion of the riding, the boundaries of which have changed a number of times.\nHogg's squeaker victory marks the second upset win for the governing Liberals in as many months. They stole a riding in Quebec's nationalist heartland away from the Tories in a byelection in October.\nFor Andrew Scheer, the outcome marks the second byelection loss since he became Conservative leader in May. In three other federal byelections Monday, the Liberals retained safe seats in Newfoundland and Labrador and Toronto, while the Conservatives held onto one of their own safe seats in Saskatchewan.\nBut only in South Surrey-White Rock was the result ever in any doubt.\nThe riding was left vacant after Conservative MP Dianne Watts resigned to run for the leadership of the B.C. Liberals. Watts, a high-profile former mayor of Surrey, narrowly won the seat in 2015 with 44 per cent of the vote, less than 1,500 votes ahead of the Liberal contender.\nHogg, a former mayor of White Rock and a former B.C. MLA, essentially reversed the 2015 result, eking out a narrow victory of less than 1,500 votes over Findlay. Scheer, who campaigned with Findlay twice, had billed the contest as a chance for voters to send “a mid-term signal, that what the Liberals have been doing for Canadians hasn't been working.”\nFindlay dismissed suggestions that Monday's loss is a reflection of Scheer's leadership. “What I've been hearing is they like Andrew ... People seem to enjoy his positive Conservative message and his approach,” she said in a phone interview, adding that voters were concerned about “the Ottawa Liberals' higher taxes and low ethics.”\nShe put the loss down to the fact that Prime Minister Trudeau called a “snap byelection” in the riding, before she'd even been nominated as the candidate, which cost her a week of the five-week campaign. “I just think we didn't have enough time.”\nThere was some solace for Scheer in the safe Tory riding of Battlefords-Lloydminster in Saskatchewan, where Conservative Rosemarie Falk captured 69.6 per cent of the vote - more than 55 points ahead of any of her competitors and an eight-point improvement over veteran Conservative MP Gerry Ritz, who had held the riding for 20 years before retiring last summer.\nThe NDP ran a distant second in the riding Monday, as it did in 2015, scoring 13.2 per cent, just ahead of the Liberal, who took 10.4 per cent.\nIn Toronto's Scarborough-Agincount, meanwhile, Liberal Jean Yip captured 49.4 per cent of the vote to hold the riding left vacant by the untimely death of her husband, Arnold Chan, in September. Conservative Dasong Zou took 40.5 per cent while the NDP contender took just five per cent.\nYip acknowledged her victory was “somewhat bittersweet.” “Every step of the campaign, I thought of (Chan) and I knew he would've enjoyed it and sometimes I would turn around and I would want to ask him something and he's not there,” she said in an interview.\n“I think he would be so happy though,” she added.\nIn Newfoundland and Labrador, fellow Liberal Churence Rogers easily retained Bonavista-Burin-Trinity, the safest Liberal seat in the country. The former head of the province's federation of municipalities captured 69.2 per cent of the vote - 46 percentage points ahead of his nearest competitor, Conservative Mike Windsor.\nWindsor, who ran in 2015, nevertheless managed to double his share of the vote to 22.9 per cent, while the NDP candidate finished a distant third with less than five per cent.\nAs impressive as Roger's margin of victory was, he did not meet the standard set by his popular Liberal predecessor, Judy Foote, who retired from cabinet and federal politics due to family health concerns.\nShe won the strongest majority in the country during the 2015 election, taking a whopping 81.8 per cent of the vote.\nMonday's byelections mark the second electoral test for Scheer and newly-minted NDP Leader Jagmeet Singh. Neither fared particularly well in their first test in October, when the Liberals scored a stunning upset over the Conservatives in the Quebec riding of Lac-Saint-Jean. The NDP, which had finished a close second in the riding in 2015, wound up a distant fourth.\nIn all six byelections since Singh took the helm of the NDP in early October, the party has seen its share of the vote decline.\nOf Monday's outcomes, the result in Scarborough-Agincourt is likely the most worrying for New Democrats. The riding has a predominantly immigrant population, including a sizeable South Asian population - the kind of riding where the NDP hopes Singh can make inroads in the next federal election Moreover, Singh grew up in Scarborough.\nNevertheless, the party saw its share of the vote in the riding drop to about five per cent Monday, down three points from its already dismal showing in 2015.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Liberals win three of four byelections, including upset in B.C.",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/liberals-win-three-of-four-byelections-including-upset-in-b-c-1.3716295"
}