{
    "authors": [],
    "date_download": "2018-02-04 01:01:44+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 14:31:00",
    "description": "Corinne Lea estimates she would need between $1 million and $1.5 million as a down-payment.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fowner-hopes-to-buy-building-to-save-rio-theatre-1.3788474.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3788398.1517689750!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nFor the crowds that gather nightly at the Rio Theatre on Broadway in East Vancouver, the building holds a singular place in the cultural landscape of Vancouver.\n“This place is wonderful,” said Scott Cowan while waiting in line at theatre’s box office Friday night. “It's one of the few places like this left in the entire city.\"\n“We get to do a lot of weird shows that you wouldn’t really get to do other places,” said burlesque performer Kitty Glitter.\nThe Rio has been around for nearly 80 years, operating primarily as a movie theatre between 1938 and a renovation a decade ago that added live music and theatre performances to the rotation.\n“I saw my first show at the Rio,” said performing artist Julia Lank. “I was 15 and I came to the midnight screening of the Rocky Horror Picture Show … I felt so grown up.”\nMemories like Lank’s are part of the old theatre’s appeal and its staying power, but recent rezoning by the city has thrown the ability of future crowds to create future memories into doubt.\nThe theatre’s location is now zoned for residential towers up to 10 stories tall, and that has the owners of the building - who are not the same as the operators of the theatre - looking to sell.\nCorinne Lea is the owner of the Rio Theatre - the business, not the building. She has an eight-year lease on the space, which a new owner would have to either assume or buy her out of, unless she buys the building herself.\nLea estimates that she would need between $1 million and $1.5 million to put down as a deposit in order to finance a mortgage on the building. She has until Feb. 6 to make an offer.\nLea told CTV News she has known for roughly a year that the building was for sale.\n“We were kind of biding our time trying to get ourselves in a better financial position so that we could make an offer to the landlord so that we could own the property,” she said. “Since the listing went viral last weekend because there were a lot of people concerned about the future of the Rio, it also drew attention to developers and now we have more competition.”\nThe city’s rezoning places a requirement on any would-be developer that it must include a theatre in its plans for a new building on the site. A new theatre wouldn’t necessarily be a live-performance venue, however, Lea said, and it wouldn’t replace the history of the current building.\n\"I absolutely love what I do,” she said. “I feel so lucky because I know not everyone is able to find that career or that thing that they love to do.\"\nWith files from CTV Vancouver’s Ben Miljure",
    "source_domain": "bc.ctvnews.ca",
    "title": "Owner hopes to buy building to save Rio Theatre",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/owner-hopes-to-buy-building-to-save-rio-theatre-1.3788474"
}