{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2017-06-15 04:41:28+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 17:32:00",
    "description": "The Chilliwack woman drove to a shelter in Sacramento, Calif., which was so overcrowded that staff waived adoption fees.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fb-c-woman-drives-16-hours-to-rescue-pit-bull-at-crowded-shelter-1.3459919.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3459947.1497486644!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "A Chilliwack woman looking to expand her fur family drove 16 hours to rescue a pit bull from a California shelter after receiving a tip from a dog-loving border agent.\nPaula Power was looking for a new dog, but found that there were very few up for adoption in the Lower Mainland at the time.\nThat’s when she decided to look at dogs in U.S. shelters, and called the Canada Border Service Agency to find out what she'd have to do to bring a new dog across the border.\nBy coincidence, she ended up speaking to a dog lover who had answers to everything she needed to know – including where to get the dog she now calls \"Sophie.\" The representative she spoke to on the phone told her about a shelter in Sacramento, Calif., where staff members were struggling with the number of intakes.\nPower looked up the Front Street Animal Shelter on Facebook and found a post outlining the shelter's \"crisis.\"\nThe post said the shelter was so crowded they'd run out of space, so it offered free adoptions for the month of June \"as an emergency lifesaving measure.\"\nSo Power and her son headed south, driving 1,500 kilometres down the coast to pick out a dog in need of a home.\n\"Everybody was quite amazed that we drove all that way to come to the shelter,\" Power told CTV News Channel on Wednesday.\nThe shelter had a \"meet and greet\" event, and one of its staff members thought a dog named Joyce might be a good fit for Power.\n\"At that point, the rest was history,\" Power said.\n\"She was very attentive and loving… She's very calm and we've found out since then that she is amazing and smart.\"\nThe wriggly pup who stole Power's heart never really responded to the name \"Joyce,\" so Power renamed her \"Sophie.\"\nThe shelter shared a video on Facebook of the moment Power and the pit bull fell in love, using the hashtag \"#lovecanada.\" The post has been shared more than 4,000 times, and hundreds of people have commented thanking the family.\nAnother video, posted on Sunday, said so far 275 pets have been adopted from the shelter in just a week and a half, including many dogs who'd been waiting months to find their forever homes. The shelter is no longer \"overflowing,\" but adoptions will continue to be free for the rest of the month.\nIn addition to Sophie, some of the other dogs that have recently found homes are also pit bulls – a blanket term for dogs including American pit bull terriers, Staffordshire bull terriers, American Staffordshire terriers, other formal breeds, crosses and dogs that resemble the formal breeds.\nPit bulls have the lowest adoption rates of any breeds in the shelter system, according to advocacy group HugABull. The group, which is based in Metro Vancouver, says some shelters have an automatic euthanasia policy for the dogs, knowing it's difficult to find homes for them, especially if they have behavioural issues caused by trauma at their previous homes.\nThe dogs have been banned in Ontario and in some cities, including Montreal, but are legal in B.C.",
    "source_domain": "bc.ctvnews.ca",
    "title": "B.C. woman drives 16 hours to rescue pit bull at crowded shelter",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/b-c-woman-drives-16-hours-to-rescue-pit-bull-at-crowded-shelter-1.3459919"
}