{
    "authors": [],
    "date_download": "2017-10-07 04:28:11+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 09:24:00",
    "description": "One was convicted of second-degree murder, the others of manslaughter.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2F3-more-youths-found-guilty-in-killing-of-19-year-old-luka-gordic-1.3622419.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3623433.1507345391!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nThree more youths have been found guilty in the swarming death of 19-year-old Luka Gordic in Whistler.\nThe young men, who can't be named because they were underage at the time of the 2015 attack, were handed their verdicts Friday evening by a B.C. Supreme Court judge.\nOne was convicted of second-degree murder, the others of manslaughter.\nWhile reading the verdict, Justice Terence Schultes described how surveillance video from a nearby business on the night of the swarming shows Gordic backing up as people approach him.\nThe 19-year-old is seen collapsing as he re-enters the frame. Based on that footage, Schultes said it appeared the attack had unfolded in as little as 17 seconds.\nEmotions ran high throughout the trial, resulting in some heated arguments between relatives of the victim and the accused.\n“We’re happy with the judge’s decision,” Gordic’s mother, Clara, told reporters after the hearing. “We relive this every day”\nThe victims’ father, Mitch Gordic, said he hopes the men will be sentenced to “many years in jail.”\nFriday’s verdict was handed down in courtroom 20, which was built for the Air India trial and has an extra layer of screening, including a metal detector and bag checks.\nA fourth young man, Arvin Golic, was charged with second-degree murder, but convicted on the lesser count of manslaughter in June.\nThe court heard Golic, who was 18 at the time of the killing, did not deliver the fatal blow but did organize the beating after Gordic stood up for a young woman they both knew.\nNo sentencing date was set for the three men found guilty on Friday.\nWith files from CTV Vancouver's Nafeesa Karim",
    "source_domain": "bc.ctvnews.ca",
    "title": "3 more youths found guilty in killing of 19-year-old Luka Gordic",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/3-more-youths-found-guilty-in-killing-of-19-year-old-luka-gordic-1.3622419"
}