{
    "authors": [
        "Kendra Mangione"
    ],
    "date_download": "2018-04-25 02:45:50+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 19:09:00",
    "description": "Police came to the home where Lisa Dudley had been shot, but never went inside. The 37-year-old was in the home for five days, paralyzed and tied to a chair.",
    "filename": "https%3A%2F%2Fbc.ctvnews.ca%2Fcoroner-s-inquest-into-grisly-b-c-murder-to-begin-in-june-1.3900839.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.1175227.1524621684!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Nearly a decade after Lisa Dudley was shot and left to suffer for days in Mission, B.C., the province's coroner has scheduled an inquest into her death.\nDudley was 37 when she and Guthrie McKay were shot in their living room in September 2008. McKay was shot three times and died, but Dudley lived for days, paralyzed and tied to a chair.\nThe woman's parents blamed local Mounties for her death. A constable was called to Dudley and McKay's home for reports of gunfire the night of the attack, but he never stepped out of his cruiser to investigate, nor did he speak with the person who called 911.\nDudley was found five days after the shooting, and died in an ambulance before reaching the hospital. She was able to identify the shooter by blinking to answer police questions, Mounties said.\nIn 2010, officials announced there would be an inquest into her death, but the date wasn't set until this week because the final man accused in the grisly incident wasn't sentenced until 2017.\nOn Tuesday, the BC Coroners Service announced that the inquest will begin June 11, 2018 in Burnaby.\nDuring the inquest, the coroner will hear evidence from witnesses under oath to determine the facts surrounding the death. A jury will have the opportunity to make recommendations aimed at preventing similar situations, a statement said.\nThe inquest is meant to determine facts surrounding why a death occurred, not to find fault.\nThe coroners service is permitted to hold inquests in cases that are of the public interest, or when there is a risk that circumstances surrounding the death could be prevented in the future.\nBased on the circumstances of this case, the coroners service has decided it will no longer hold an inquest into the death of McKay.\nDuring the trials held for four men alleged to have played a role in their deaths, the court heard Dudley ran a marijuana grow-op business with suspect Tom Holden. She and Holden had a romantic relationship previously, but Dudley chose to end it when Holden refused to leave his family.\nDudley believed she was owed money, the Crown said, and demanded to settle the debt. It is alleged that she and her next boyfriend, McKay, threatened Holden and his family, so Holden organized a hit that led to both the murders.\nThe gunman, Jack Woodruff, was paid $25,000 for killing her, the court heard during trial. Woodruff pleaded guilty to first-degree murder and was sentenced to life in prison, while Holden pleaded guilty to one count of conspiracy to commit murder and was sentenced to 10 years in prison last year.\nTwo other men, Bruce Main and Justin Andrew MacKinnon, both pleaded guilty to two counts of manslaughter and were sentenced to seven and eight years in prison, respectively.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Coroner's inquest into grisly B.C. murder to begin in June",
    "title_page": null,
    "title_rss": null,
    "url": "https://bc.ctvnews.ca/coroner-s-inquest-into-grisly-b-c-murder-to-begin-in-june-1.3900839"
}