{
    "authors": [],
    "date_download": "2017-04-17 21:40:41+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 14:20:00",
    "description": "Burger Heaven in New Westminster has been running \"bun-official\" polls for decades.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fvote-with-your-gut-burger-joint-back-with-another-election-poll-1.3372167.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3372259.1492463859!/httpImage/image.png_gen/derivatives/landscape_620/image.png",
    "language": "en",
    "localpath": null,
    "maintext": "CTV Vancouver\nStill on the fence about who to vote for in next month's provincial election? A New Westminster burger joint is once again inviting customers to vote with their gut in a \"bun-official\" poll.\nBurger Heaven has designed three special hamburgers representing the leaders of B.C.'s major political parties, and is tallying up the purchases to determine who's the most popular candidate – in burger form, anyway.\nAs of Monday morning, the John Horgan Burger led the pack with 286 votes, followed by the Andrew Weaver Burger at 243 and the Christy Clark Burger at 186.\nThe NDP's leader's hamburger is described as a \"Lean-to-the-Left\" beef patty topped with \"strong o(u)nions,\" mozzarella and \"H-organ-ic mango habanero sauce.\"\n\"Lettuce lead and we'll Relish the opportunity to drain some fat out of the liberally cut slice of Bacon and make sure that if this burger eater 'works hard he or she is paid a fair wage,'\" reads Burger Heaven's description.\nWeaver's burger features organically grown tomato and lettuce, and, like his B.C. Green Party, has \"come a long way to 'ketchup' in the political kitchen of popularity,\" the restaurant said.\nCurrently in last place, Clark's hamburger boasts a “Lean-to-the-Right” patty, a Liberal slab of cheddar cheese, special sauce and milder o(u)nions.\n\"According to the proverbial 'pipeline' this very well-seasoned burger also wants to lead again so as to continue to stimulate the economy and ensure that the minimum wage is raised for [Burger Heaven] servers,\" the eatery wrote.\nBurger Heaven, which has been holding election polls for over two decades, also lets customers cast a secret ballot if they'd prefer to order off the regular menu.\nAs such, there are currently 66 \"bun-decided\" voters in the poll.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Vote with your gut: Burger joint back with another election poll",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/vote-with-your-gut-burger-joint-back-with-another-election-poll-1.3372167"
}