{
    "authors": [
        "Ben Miljure"
    ],
    "date_download": "2017-02-15 01:58:16+00:00",
    "date_modify": null,
    "date_publish": null,
    "description": "Inspired by the struggles of long-distance relationships, the gloves allow users to feel others' movements.",
    "filename": "http%3A%2F%2Fbc.ctvnews.ca%2Fstudent-designed-gloves-use-wi-fi-to-let-users-feel-touch-from-a-distance-1.3285845.json",
    "image_url": "https://www.ctvnews.ca/polopoly_fs/1.3285849.1487121575!/httpImage/image.jpg_gen/derivatives/landscape_620/image.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Valentine's Day can be bittersweet for couples in long-distance relationships. But help may soon be on the way thanks to students at Simon Fraser University's School of Interactive Arts and Technology.\nThey have created a working prototype of a product they call the \"Flex and Feel\" – a pair of Wi-Fi connected gloves that allow people to share human touch through cyberspace.\n\"For example, if the index finger on the flex glove is bent, you will feel the vibration on the index finger on the feel glove,” explained Samarth Singhal, one of the graduate students working on the project.\nSinghal’s girlfriend studies at Northeastern University in Boston, thousands of kilometres from the Surrey, B.C. campus where he goes to school, so he knows how challenging long-distance relationships can be.\n\"Intimacy is just one part of the glove. I think it's more about the emotional connection you form through touch,” he said.\nStudents in the lab are all focused on projects that connect people around the world.\n\"Basically any relationship that we can connect across distance, we try to make it easier for people to feel sense of social presence with those individuals,” said associate professor Carman Neustaedter.\n“I’ve never felt anything like it,” said Lilian Yang, another student, as she experienced the gloves for the first time.\nThe students see a lot of potential uses for the Flex and Feel, from simple things like people holding hands during video calls, to more intimate activities.\nActual couples have used the gloves in trials observed by researchers but so far their activities have been relatively tame.\n\"Sexual intimacy came up and I think that's a potential use for it,” said Neustaedter. “We designed the gloves to be really flexible so you can almost do anything you want to with them. And some people might find that that is a use they have for it.\"\nThe gloves are only in the prototype stage but the creators hope to one day see them sold in stores.",
    "source_domain": "bc.ctvnews.ca",
    "title": "Student-designed gloves use Wi-Fi to let users feel touch from a distance",
    "title_page": null,
    "title_rss": null,
    "url": "http://bc.ctvnews.ca/student-designed-gloves-use-wi-fi-to-let-users-feel-touch-from-a-distance-1.3285845"
}