{
    "authors": [],
    "date_download": "2017-08-14 22:09:27+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 15:45:20",
    "description": null,
    "filename": "https%3A%2F%2F303cycling.com%2Fcolorado-classic-howes-comes-oh-so-close-to-title%2F.json",
    "image_url": "https://i2.wp.com/303cycling.com/wp-content/uploads/2017/08/photo-3.jpg?fit=1200%2C793&ssl=1",
    "language": "en",
    "localpath": null,
    "maintext": "From The Denver Post\nBoulder cyclist settles for 3rd place in inaugural event\nDENVER— Alex Howes left the inaugural Colorado Classic clutching a growler of beer courtesy of Denver’s Epic Brewing Company, but the Boulder resident’s hangover will come from missing out on an epic victory he could almost taste.\nRELATED: 303 Contributor Ryan Muncy’s Colorado Classic Photo Album –\nStages One and Two\nStage Three\nStage Four\nHowes, who estimates he made 500 ascents of Lookout Mountain while growing up in Golden, finished third Sunday in the general classification (overall standings) after four days of racing and was the top American behind Manuel Senni of Italy and Serghei Tvetcov of Romania. Howes won the toughest stage in Breckenridge with a thrilling sprint finish Friday but finished 31 seconds behind Senni on Saturday, and that’s where he wound up when the event concluded.\n“I came here to win,” Howes said somberly.\nRELATED: Check out photographer Reid Neureiter’s Colorado Classic photos\nRacing for Cannondale Drapac, Howes came out of Breckenridge in a virtual tie for the GC lead but lost the precious 31 seconds on Saturday’s 81 mile trip from Denver to the Peak to Peak Highway and back when he and others in the peloton got confusing information about the gap between them and the leaders off the front.\nRead the full story HERE\nShare this:\nTweet",
    "source_domain": "303cycling.com",
    "title": "Colorado Classic: Howes Comes Oh So Close to Title",
    "title_page": null,
    "title_rss": null,
    "url": "https://303cycling.com/colorado-classic-howes-comes-oh-so-close-to-title/"
}