{
    "authors": [],
    "date_download": "2017-08-14 22:08:03+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "The lineup for the four tour dates will feature Don Henley, Joe Walsh and Timothy B. Schmit with Frey's son Deacon and Vince Gill.",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F08%2F14%2Fthe-eagles-2017-tour-dates%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/08/the-eagles-kennedy-center.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Annie Reuter\nThe Eagles have announced four new concert dates. The lineup for the short run will feature Don Henley, Joe Walsh and Timothy B. Schmit with Frey’s son, Deacon, and Vince Gill filling in for the late Glenn Frey.\nRelated: Vince Gill to Join Eagles for Classic East and West Shows\nAn Evening with the Eagles will stop at the Greensboro Coliseum in North Carolina on October 17 followed by a show a Philips Arena in Atlanta, Georgia. on October 20. The band will return to Louisville, Kentucky on October 24 at KFC Yum! Center before traveling to the late Glenn Frey’s hometown of Detroit, Michigan on October 27 to wrap up the run at Little Caesars Arena.\nTickets for the four new dates go on sale at Saturday (Aug. 19) at 10 am. An American Express card member pre-sale starts on Tuesday while VIP packages will be available through Eagles.com.\nThe four new tour dates follow the success of the band’s Classic West and East shows, earlier this summer. Deacon and Gill also played with the band for those shows.\n“Bringing Deacon in was my idea,” Don Henley told the LA Times. “I think of the guild system, which in both Eastern and Western cultures is a centuries-old tradition of the father passing down the trade to his son, and to me, that makes perfect moral and ethical sense. The primary thing is I think Glenn would be good with it—with both of these guys. I think he’d go, ‘That’s the perfect way to do this.'”",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "The Eagles Add Four New Dates to 2017 Tour \" 93.1 Jack FM",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/08/14/the-eagles-2017-tour-dates/"
}