{
    "authors": [],
    "date_download": "2017-10-06 19:23:08+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "AOL Instant Messenger, the ubiquitous program that gave rise to online chat and countless abbreviations and acronyms, will be discontinued this year, its parent company Oath announced Friday.",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F10%2F06%2Faol-instant-messenger-to-be-discontinued-this-year%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/10/aim-discontinued.jpg?w=628",
    "language": "en",
    "localpath": null,
    "maintext": "LOS ANGELES (CBSLA) — AOL Instant Messenger, the ubiquitous program that gave rise to online chat and countless abbreviations and acronyms, will be discontinued this year, its parent company Oath announced Friday.\nMichael Albers, VP of Communications Product at Oath – the new company made up of Verizon, Yahoo and AOL properties – said in his announcement that the program now better known as AIM “tapped into new digital technologies and ignited a cultural shift, but the way in which we communicate with each other has profoundly changed.”\n“As a result, we’ve made the decision that we will be discontinuing AIM effective December 15, 2017,” Albers said in his statement.\nAIM was launched as a standalone app in 1997 after proving to be wildly popular within the AOL desktop program. Arguably, it was more widely used than competitors like ICQ, and messengers from Yahoo and Microsoft MSN, but usage began to slow when Google launched GChat, which was discontinued earlier this year in favor of Google Hangouts.\nFacebook Messenger, and Facebook’s practice of pushing its 2 billion users to download the mobile app, all but guaranteed other chat programs’ demise.\nRead more at CBSLA.com.",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "AOL Instant Messenger To Be Discontinued This Year",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/10/06/aol-instant-messenger-to-be-discontinued-this-year/"
}