{
    "authors": [],
    "date_download": "2017-01-02 16:40:47+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F01%2F02%2Fofficial-rules-supercross-2017-tickets-sweepstakes%2F.json",
    "image_url": "https://s0.wp.com/wp-content/themes/vip/cbs-local/images/global/facebook/facebook-share-260x260.png",
    "language": "en",
    "localpath": null,
    "maintext": "93.1 JACK FM/KCBS-FM\nSUPERCROSS 2017 TICKETS SWEEPSTAKES\nOFFICIAL RULES\nNO PURCHASE OR PAYMENT OF ANY KIND IS NECESSARY TO ENTER OR WIN. A PURCHASE OR PAYMENT WILL NOT INCREASE ENTRANT’S CHANCE OF WINNING.\n1. HOW TO ENTER\na. These rules govern the SUPERCROSS 2017 TICKETS SWEEPSTAKES (the “Promotion”), which is being conducted by KCBS-FM (the “Station”). The Promotion begins on JANUARY 2, 2017 and ends on JANUARY 16, 2017 (the “Promotion Dates”).\nb. To enter the Promotion entrant may enter online beginning on JANUARY 2, 2017 at 6:00 am Pacific Time and ending on JANUARY 15, 2017 at 11:59 pm PT (the “Entry Period”) as follows:\ni. To enter online, visit http://www.931jackfm.com/category/contests and follow the links and instructions to enter the Promotion and complete and submit the online entry form during the Entry Period. Online entrants are subject to all notices posted online including but not limited to the Station’s Privacy Policy. Limit one (1) entry per eligible person during the Entry Period regardless if entrant has more than one email address. Multiple participants are not permitted to share the same email address. P.O. Boxes are not permitted. Entries submitted may not be acknowledged or returned. Proof of submission of an entry shall not be deemed proof of receipt by the Promotion administrator.\nc. There will be up to a total of one (1) winner selected in the Promotion.\n2. ELIGIBILITY RESTRICTIONS\na. The Promotion is open to all persons who are legal U.S. residents 18 years of age or older and who reside in the following Southern California Counties Los Angeles, Orange County, San Bernardino, Riverside, San Diego and Ventura and have a VALID driver’s License. Void where prohibited or restricted by law. Employees, officers, directors and agents of FELD ENTERTAINMENT, INC., the Station, CBS Radio Inc., their corporate affiliates, Station’s advertising and promotional agencies, participating sponsors, prize suppliers, their respective affiliates (collectively, the “Promotion Entities”) and other radio stations in the Los Angeles metropolitan area, the members of their immediate families (spouse, parents, siblings or children) and those living in the same household of each (whether related or not), are ineligible to enter or win. This Promotion is subject to all applicable federal, state and local laws and regulations. By participating, entrant agrees to comply with these Official Rules and the decisions of the Station, which are final and binding in all respects.\nb. Listeners are eligible to win a prize valued at $50 or more or event tickets valued at $100 or more from KCBS-FM only once every thirty (30) days, and listeners are eligible to win a prize in a Promotion conducted by the Station only once every sixty (60) days if the prize is valued over $600 and only once per year if prize is valued over $1,000. Only one (1) winner per household is permitted in any Station –conducted promotion.\nc. The winner must provide valid government-issued photo identification and provide their complete address, date of birth and phone number to claim a prize. If the winner is a minor, a parent or legal guardian must claim prize on his or her behalf.\nd. Entrants are required to provide truthful information and the Station will reject and delete any entry that it discovers to be false or fraudulent. The Station will disqualify any entrant who does not meet the eligibility requirements and will also delete any entry as required by law. Any entrant or winner who is found to have sold, attempts to sell, or gives away any prize will be disqualified from participating and winning any future Station contest for a minimum of two (2) years.\n3. PRIZES\na. One (1) prize will be awarded in the Promotion. Prize consists of a pair of tickets to the MONSTER ENERGY AMA SUPERCROSS at Angel Stadium on January 21, 2017. The Approximate Retail Value (“ARV”) of the prize(s) is $130.00.\nThe winner(s) will be solely responsible for all taxes and all other fees and expenses not specified herein associated with the receipt and use of the prize(s). The prize(s) is awarded as is. Tickets valid only on the date(s) printed on the tickets. Tickets are not refundable or transferable, and may not be substituted or exchanged for cash or credit at any time, nor will tickets be replaced if lost or stolen. Tickets may not be sold to a third party. If a prize-related event is unable to take place as scheduled, for reasons such as cancellation, preemption, postponement or unavailability, including for weather, or for any reason beyond the control of the Promotion Entities, their sole responsibility to the winner(s) will be to award the remaining available elements of the prize(s) and no substitution or compensation will be provided for the unawarded elements of the prize(s). The Station, in its sole discretion, reserves the right to deny entry to or to remove the winner(s) and/or guest(s) if either engages in disruptive behavior or in a manner with intent to annoy, abuse, threaten or harass any other person at any prize related event.\nb. No more than the stated number of prizes specified in these official rules will be awarded. All prizes or prize certificates must be claimed at the office of the Station at the address below during regular business hours. The winner(s) will forfeit any prize(s) or prize certificate(s) not claimed within thirty (30) days of winning. In the event that a prize or prize certificate is mailed or shipped to the winner(s), it will be with the prior written consent of the winner(s) and therefore, winner(s) assumes the risk of its loss. The Station is not responsible for the safe arrival of a prize(s) or prize certificate(s).\nc. Prize(s) is not transferable, and no substitution, assignment or cash equivalent of prize(s) is permitted, except by the Station (solely at its discretion), which reserves the right to substitute a prize or prize portion with another prize or prize portion of greater or equal value. The prize(s) are expressly limited to the item(s) listed above and unless otherwise expressly specified, do not include taxes, gratuities or any other expenses. Promotion Entities are not responsible for winners’ limitations that prevent acceptance or use of prize(s). Entrants acknowledge that the Promotion Entities have not made, and are not in any manner responsible or liable for, any warranties, representations or guarantees, and hereby disclaim any and all warranties, expressed or implied, whether by contract or law, concerning any prize, including without limitation, implied warranties of quality, merchantability, mechanical condition or fitness for a particular purpose. Other restrictions may apply.\n4. WINNER SELECTION AND NOTIFICATION\na. Decisions of the Station management with respect to the Promotion are final.\nb. One (1) winner will be selected on JANUARY 16, 2017 at approximately 10:00 a.m. PT in a random drawing from all eligible online entries received.\nc. Final winner will be determined by JANUARY 16, 2017.\nd. Odds of winning depend on the number of eligible online entries received.\ne. Prize winner(s) will be notified by telephone on or around time of winning. Prize(s) will be awarded only upon confirmation of eligibility and completion of all requisite releases. The winner(s) must execute and return any required affidavit of eligibility and/or liability/publicity release by JANUARY 20, 2017 or prize(s) will be forfeited and an alternate winner will be selected (time permitting). If a winner has not reached the age of majority in his/her state of residence, the prize(s) will be awarded in the name of his/her parent or legal guardian. If a potential winner(s) cannot be contacted, fails to sign and return the required fully-executed affidavit of eligibility and/or liability/publicity release within the required time period, or if a prize or prize notification is returned as undeliverable, the potential winner forfeits the prize(s).\n5. CONDITIONS\na. Payments of all federal, state and local taxes are solely the responsibility of the winner(s). The winner(s) may be required to complete and submit an IRS Form W-9 with the winner’s full Social Security Number or the equivalent for receipt of any prize(s) and will be required to complete and submit an IRS Form W-9 with the winner’s full Social Security Number or the equivalent for receipt of any prize(s) valued at $600 or more or for any prizes awarded by the Station (or any other CBS Radio station in Station’s market) in a calendar year with an aggregate value of $600 or more. Failure to submit a complete W-9 or equivalent will result in forfeiture of the prize(s). Such winnings of $600 or more will be reported to the IRS.\nb. Participation in the Promotion and/or acceptance of prize(s) constitutes entrant’s and/or winner’s (and guest’s, if applicable) permission for the Station or its designees to interview the winner(s) (or guest(s), if applicable), to photograph, film and record each winner (or guest, if applicable), and to use in commerce and in any media, now or hereafter known, throughout the world, in perpetuity, his/her name, prize(s) won, hometown (city and state), biographic information, likeness, photograph, voice, audio or video recording and/or any statements made by him/her regarding the Station, the Promotion and/or its sponsor(s) for purposes of trade, publicity or promotion without notice or additional compensation, notification or permission, in perpetuity, except where prohibited by law. Each winner (and guest, if applicable) agrees to sign a publicity release confirming such consent prior to acceptance of the prize, except where prohibited by law.\nc. Participation in the Promotion and/or acceptance of prize(s) constitutes entrant’s and/or winner’s (and guest’s, if applicable) agreement to release, discharge, and hold harmless the Promotion Entities and their respective officers, shareholders, directors, employees, agents and representatives and all of their successors and assigns (collectively, the “Released Parties”) from and against any and all claims or liability arising directly or indirectly from any prize(s) awarded and participation in the Promotion, including, but not limited to, personal injury, death or damage to or loss of property, which may occur in connection with, preparation for, travel to, or participation in the Promotion, or delivery, possession, acceptance and/or use or misuse of any prize or participation in any Promotion-related activity, including, but not limited to, any claims based on publicity rights, defamation, invasion of privacy and merchandise delivery.\nd. If for any reason this Promotion cannot be executed as planned, including but not limited to, as a result of infection by computer virus, tampering, unauthorized intervention, fraud, technical failures, or any other causes beyond the control of the Released Parties that corrupt or affect the security, administration, fairness, integrity or proper conduct of the Promotion, or if the Promotion is compromised or becomes technically corrupted in any way, electronically or otherwise, the Station reserves the right to cancel, terminate, suspend and/or modify the Promotion. If the Promotion is terminated before the original end date, the Station reserves the right, in its sole discretion to, to modify the procedure for selecting winner(s), unless the nature of the event giving rise to such termination renders it impossible to select winner(s).\ne. The Released Parties are not responsible for (i) typographical or other errors in the printing, the offering or the administration of the Promotion or in the announcement of a prize(s); (ii) incorrect or inaccurate entry information, human error, failure or omission; (iii) unauthorized human intervention; (iv) lost, stolen, mangled, misdirected, postage due, illegible, incomplete or late entries; (v) entries not received due to difficulty accessing the internet, service outage or delays, computer difficulties, telephone service outages, delays, busy signals, poor signals or signal interference, accidental disconnection or equipment malfunctions or any other technological problems or failures of any kind; or (vi) any cancellations, delays, diversions, substitutions or omissions whatsoever by any transportation providers or any other persons or entities providing any services to winner(s) (and guest(s), if applicable) including any results thereof such as changes in services or location necessitated by same. Further, the Released Parties are not responsible if any part of a Promotion prize cannot be awarded due to acts of God, acts of war, natural disasters, weather, acts of terrorism or other factors beyond the Released Parties’ control.\nf. Any attempt by any entrant to obtain more than the stated number of entries by using multiple/different email addresses, identities, registrations and logins or any other methods may void that entrant’s entries and that entrant may be disqualified. The use of any device to automate entry is prohibited. Any use of robotic, repetitive, automatic, programmed or similar entry methods or agents (including, but not limited to, promotion entry services or proxies) will void all entries by that entrant at the Station’s discretion. The Station’s or its Promotion administrator’s computer or telephone system is the official time keeping device for this Promotion. In the event of a dispute, online entries will be deemed to have been submitted by the Authorized Account Holder. The “Authorized Account Holder” is the natural person who (i) is assigned to an email address by an internet access provider, online service provider or other organization that is responsible for assigning email addresses for the domain associated with the submitted email address or (ii) is assigned to the text or mobile telephone number by a telecommunications provider, or other organization that is responsible for assigning such numbers. The Station, in its sole discretion, reserves the right to disqualify any person who it believes is tampering with the entry process or the operation of the Promotion. Failure to comply with the rules of the Promotion may result in an entrant’s disqualification and/or forfeiture of any prize or prizes. If the Station makes a good faith determination that an entrant has cheated or committed fraudulent activity in connection with a Promotion, the Station may disqualify that entrant from entering and/or winning this and any or all future Station-administered Promotions and seek damages to the fullest extent permitted by law.\ng. The Station reserves the right to make changes to the rules of the Promotion, including, without limitation, the substitution of a prize(s) of equivalent value, which will become effective upon announcement. If due to circumstances beyond the control of the Promotion Entities, any competition or prize-related event or travel is delayed, rescheduled, postponed or cancelled, the Station reserves the right, but not the obligation, to cancel, terminate, suspend or modify the Promotion and shall not be required to award a substitute prize(s).\nh. Except where prohibited, by entering the Promotion, each entrant agrees that: (1) any and all disputes, claims and causes of action arising out of or connected with this Promotion or any prize(s) awarded shall be resolved individually, without resort to any form of class action, and exclusively by state or federal courts situated in New York, NY; (2) any and all claims, judgments and awards shall be limited to actual out-of-pocket costs incurred, but in no event shall such costs include attorneys’ fees; and (3) no punitive, incidental, special, consequential or other damages, including, without limitation, lost profits may be awarded (collectively, “Special Damages”), and (4) entrant hereby waives all rights to claim Special Damages and all rights to have any damages awarded multiplied or increased. New York law governs the interpretation and construction of these Official Rules and all aspects related thereto.\ni. For a copy of these Official Rules, send a self-addressed stamped envelope (VT residents may omit return postage) for receipt by JANUARY 15, 2017 to “SUPERCROSS 2017 TICKETS – Official Rules,” Attn: Promotions, KCBS-FM 5901 Venice Blvd. Los Angeles, CA 90034. For the names of the prize winner(s) send a self-addressed stamped envelope (VT residents may omit return postage) for receipt by MARCH 16, 2017 to the above address marked “SUPERCROSS 2017 TICKETS – Winner List.” The Official Rules and the Winner List (when completed) shall also be available during regular business hours at the main offices of the Station and may be posted online at http://www.931jackfm.com.\n6. PRIVACY\na. By participating in the Promotion, entrant agrees to the Station’s Terms of Use Agreement and to the use of entrant’s personal information as described in the Privacy Policy located at http://www.931jackfm.com. In the event of conflict between the Station’s Terms of Use Agreement and these Official Rules, the terms of these Official Rules shall apply.\nAdministrator: KCBS-FM 5901 Venice Blvd. Los Angeles, CA 90034.\nSponsor: KCBS-FM 5901Venice Blvd. Los Angeles, CA 90034; FELD ENTERTAINMENT, INC 800 Feld Way, Palmetto, FL 34221",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Official Rules: SUPERCROSS 2017 TICKETS SWEEPSTAKES",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/01/02/official-rules-supercross-2017-tickets-sweepstakes/"
}