{
    "authors": [],
    "date_download": "2017-10-06 20:46:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "\"I support you ladies and I am sure you will not be the last to come forward now that the dam has burst.\"",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F10%2F06%2Fkid-rock-supports-harvey-weinsteins-sexual-accusers%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/10/kid-rock-approvedjpg.jpg?w=1500",
    "language": "en",
    "localpath": null,
    "maintext": "By Scott T. Sterling\nControversial musician Kid Rock has come out in strong support of the women accusing powerful Hollywood producer Harvey Weinstein of sexual harassment.\nRelated: Kid Rock Release Country Rocker ‘Tennessee Mountain Top’\nHollywood has been rocked by the reports of Weinstein’s behavior which broke this week after years of rumors and innuendo.\n“I do not know all the women who have come forward per the New York Times piece on Harvey Weinstein and I am not a fan of many of them, in many ways, especially of their politics (I am certain they are not too fond of me or mine as well!),” Rock wrote on his official website.\n“But I applaud their courage to come forward and support them all 100%. Most of us in the entertainment business have heard of these disgusting stories for years about these scumbag heads of studios, record labels, Fortune 500 companies, etc and how they prey on young women and men, especially in Hollywood,” he continued.\n“Why even comment on this and put my own neck out there in a fight that’s not mine? For my granddaughter, my sisters, my mother, my fiancé, but mostly for the people who have no voice. And I am also not beholden or scared of anyone!,” the rocker added.\n“Once again, I support you ladies and I am sure you will not be the last to come forward now that the dam has burst,” Kid Rock wrote at the end of the post. “I do wish for the most positive outcomes for all involved and for some real change in this disgusting space.”\nSee Kid Rock’s full statement here.",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Kid Rock Stands in Support of Harvey Weinstein’s Sexual Harassment Accusers",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/10/06/kid-rock-supports-harvey-weinsteins-sexual-accusers/"
}