{
    "authors": [],
    "date_download": "2017-10-06 19:22:59+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 00:00:00",
    "description": "Each release will be available on limited edition 180 gram vinyl in a dazzling array of colors.",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F10%2F06%2Fpaul-mccartney-announces-slew-of-archival-reissues%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/10/paul-mccartney-kamil-krzaczynski-afp-getty-images.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Scott T. Sterling\nChristmas is coming early for Paul McCartney fans.\nRelated: Billy Joel Joins Paul McCartney Onstage\nOn Nov. 17, the Beatles legend is set to release eight new titles from the Paul McCartney Archive Collection: McCartney, McCartney II, Tug Of War, Pipes Of Peace, Paul and Linda McCartney: Ram, Paul McCartney and Wings: Band On The Run, Wings: Venus And Mars, At The Speed Of Sound.\nEach release will come in single CD digi-pak and 180-gram black vinyl single LP formats—as well as limited edition 180-gram color vinyl pressings. All vinyl LPs in the Archive Collection will feature a download card and fully restored artwork.\nEvery release in the ongoing Paul McCartney Archive Collection is supervised by McCartney himself, who oversees all aspects of each title from remastering to the curation of lost tracks, outtakes, artwork, photographs and video from his personal vaults.\nThe titles and corresponding limited edition vinyl colors are as follows:\nPaul McCartney: McCartney – RED\nPaul McCartney: McCartney II – CLEAR\nPaul McCartney: Tug Of War – BLUE\nPaul McCartney: Pipes Of Peace – SILVER\nPaul and Linda McCartney: Ram – YELLOW\nPaul McCartney and Wings: Band On The Run – WHITE\nWings: Venus And Mars – RED & YELLOW\nWings: At The Speed Of Sound – ORANGE",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Paul McCartney Announces Slew of Archival Reissues",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/10/06/paul-mccartney-announces-slew-of-archival-reissues/"
}