{
    "authors": [],
    "date_download": "2017-04-18 05:30:22+00:00",
    "date_modify": null,
    "date_publish": "2017-04-17 00:00:00",
    "description": "From trivia nights to female empowerment events, you’ll find something that appeals to all interests this week.",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F04%2F17%2Fbest-activities-to-do-this-week-in-orange-county-april-17%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/04/into-the-woods-1-susie-sprinkel-hudson1.jpg?w=1200",
    "language": "en",
    "localpath": null,
    "maintext": "Eclectic activities are just part of living in Orange County, and this week is no different. From trivia nights to female empowerment events, you’ll find something that appeals to all interests this April. Mid-week, you can also experience a live performance of “Into the Woods” and an array of visual art at the Newport Beach Film Festival. End the week right with an appetizer-filled cooking class, a goodbye to a local amusement park ride or a fashion show that will benefit members of the local community.\nMonday, April 17\nReady to Wear Trunk Show\nNeiman Marcus\n601 Newport Center Drive\nNewport Beach, CA 92660\n(949) 759-1900\nwww.moniquelhuillier.com Neiman Marcus601 Newport Center DriveNewport Beach, CA 92660(949) 759-1900 Fashion designer Monique Lhuillier, based out of Los Angeles, will host a two-day trunk show beginning Monday at 10 a.m. Visitors can stop by the Neiman Marcus at Fashion Island in Newport Beach for a chance to shop the designer’s collections. While she is known for her stunning wedding gowns, the ready to wear collection features plenty of dark colors, floral prints and interesting fabrics that will have you looking hotter than anyone else in OC. The brand will follow this show up with a bridal show on April 27 in their Los Angeles showroom as well as a trunk show for their Bliss line in Brea on April 28.\nTuesday, April 18\nThe S.H.E. Event\nRoad Runner Sports\n24291 Avenida De La Carlota\nLaguna Hills, CA 92653\n(949) 855-9252\nwww.eventbrite.com Road Runner Sports24291 Avenida De La CarlotaLaguna Hills, CA 92653(949) 855-9252 Women rejoice because The S.H.E. Event is just for you! Local ladies should check out this one-night event, which celebrates the female gender with an event that is labeled Strong, Healthy, Empowered. Gather your friends and head to Road Runner Sports in Laguna Hills for a night of inspiring talks. Presented by Brooks, the event features plenty of fun, including special bra fittings and basic workout routines. There will also be healthy treats available for all to enjoy throughout the event, which runs from 6 to 8 p.m. Don’t forget to enter the free raffle, where guests can win up to $500 in prizes, including things like Brooks shoes, sports bras and apparel. The grand prize is a complimentary entry into the Rock ‘n’ Roll Marathon Series that will take place on April 27.\nWednesday, April 19\nSee “Into the Woods”\nLyceum Theater\n55 Fair Drive\nCosta Mesa, CA 92626\n(714) 668-6145\nwww.vanguard.edu Lyceum Theater55 Fair DriveCosta Mesa, CA 92626(714) 668-6145 The Theatre Arts department at Costa Mesa’s Vanguard University presents “Into the Woods,” a famous musical by Stephen Sondheim that combines the stories of several fairytale characters in one exciting story. Based largely on the characters’ wishes, the show kicks off at the Lyceum Theater on Wednesday, with shows each day until Sunday. Student actors will perform, taking on the roles of characters such as the Baker and his wife who want to have a baby, a poor boy named Jack who just wants to milk his milk-less cow and Cinderella who wants to attend a royal festival. Directed by Vanda Eggington and orchestrated by Jonathan Tunick, the show is ideal for anyone over the age of six.\nThursday, April 20\nAttend The Newport Beach Film Festival\nVarious Locations\nNewport Beach, CA 92660\n(949) 253-2880\nwww.newportbeachfilmfest.com Various LocationsNewport Beach, CA 92660(949) 253-2880 For one week, the Newport Beach Film Festival will fill the area with a variety of film and gala events that will “go deeper,” as per the event’s theme. With over 350 movies already scheduled for this year’s event, there is something for every interest. Opening night on Thursday will feature “Take Every Wave: The Life of Laird Hamilton,” which details the life of the famous athlete who changed the world of surfing forever. Other notable titles include “A Family Man,” “Paris Can Wait,” and the closing night “The Exception.” The event will feature foreign films as well, such as Brazil’s “Ballad of Return” and the U.K.’s “Golden Years.” Aside from international spotlights, there will be a collegiate showcase, a youth film showcase and a family film series.\nFriday, April 21\nGirls Day Out\nThe Wine Artist\n21064 Bake Parkway\nLake Forest, CA 92630\n(949) 297-3656\nwww.thewineartist.com The Wine Artist21064 Bake ParkwayLake Forest, CA 92630(949) 297-3656 The theme of The Wine Artists’ current Girls Day Out is healthy appetizers. From 10 a.m. to 12:30 p.m., participants will learn to make healthy options for dinner parties or simply for their families to taste on any given night. While you will learn to create some delicious recipes—ones you may not have thought up on your own—you will also be able to take home some of the main ingredients so that you can recreate them in your own kitchen. These clean eating choices include no bean hummus, paleo flatbread, zucchini pesto rolls, quinoa pizza, sweet potato nachos and buffalo cauliflower bites. The cost for the event and materials is $80.\nSaturday, April 22\nRide Boomerang For The Last Time\nKnott’s Berry Farm\n8039 Beach Boulevard\nBuena Park, CA 90620\n(714) 220-5200\nwww.knotts.com Knott’s Berry Farm8039 Beach BoulevardBuena Park, CA 90620(714) 220-5200 For 27 years, Boomerang has left an impact on visitors to Knott’s Berry Farm, serving as one of the most intense, loop-filled coasters in the park. Situated in the Boardwalk area at the back of the theme park, the bright green ride takes thrill seekers forward then all the way backward along the same 875-foot track. Saturday is the perfect time to get your last ride in because the coaster will close on April 23, along with the park’s famed Boysenberry Festival. Take one last spin on this classic piece of Knott’s Berry Farm before it’s replaced by something new and exciting, and eat some boysenberry-filled treats while you’re at it.\nSunday, April 23\nEVENT\nStyle Show\nWestminster Rose Center\n14140 All American Way\nWestminster, CA 92683\nsoroptimisthuntingtonbeach.org Style ShowWestminster Rose Center14140 All American WayWestminster, CA 92683 Hosted by Soroptimist International Huntington Beach, the annual Style Show is a great way to find some new fashions while supporting some special people in the local community. This year’s luncheon, held at the Westminster Rose Center, will feature a variety of clothing that cannot be purchased in stores. Women who the organization has helped in the past will model the apparel, and the proceeds will go entirely to their programs to help improve the lives of women and girls throughout the area. There will be prizes as well, including Disneyland tickets. The show will run from 11 a.m. to 2 p.m. and tickets at the door will cost $50.",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Best Activities To Do This Week In Orange County - April 17",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/04/17/best-activities-to-do-this-week-in-orange-county-april-17/"
}