{
    "authors": [],
    "date_download": "2017-08-14 22:07:59+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "It’s that time of year again when the LA County Fair returns to the Fairplex in Pomona!",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F08%2F14%2Fguide-to-the-2017-l-a-county-fair%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/08/ferriswheel.jpg?w=1500",
    "language": "en",
    "localpath": null,
    "maintext": "It’s that time of year again when the LA County Fair returns to the Fairplex in Pomona. What started in 1922 as a 5-day gathering of 100,000 people enjoying chariot races, harness racing, and a very exciting toothpaste-making demo, has transformed into the largest country fair in the U.S. with attendance ten times as large. This year the fair is embracing past tradition with blue ribbon contests, even more adorable farm animals than before, hula hoop and bubblegum-blowing contests, food competitions, and much more.\nWhere & When\nLos Angeles County Fair\n1101 W. McKinley Ave.\nPomona, CA 91768\n(909) 623-3111\nwww.fairplex.com\nDates: Friday, September 1, 2017 – Sunday, September 24, 2017 Pricing & Admission\nAdults: $14 on weekdays; $20 on weekends & holidays\nChildren 6-12: $8 on weekdays; $12 on weekends & holidays\nSeniors 60+: $10 on weekdays; $15 on weekends & holidays\nChildren aged 5 and under: free Season passes are available for $29.99. Group tickets and picnic packages are also available, and new to this year is a Passport to Savings Coupon Book including over 100 food, ride, shopping, and attraction offers valued at $1,000. Find a complete price listing here.\nGetting There & Where to Stay\nThe L.A. County Fair is right off the 10 freeway in Pomona, conveniently located off the Fairplex Dr. exit. General parking is $15, or splurge on VIP parking for $25 (when available at Gate 17 and 9), or Valet (Gate 3) for $30. If you’re planning to go a few times, a season pass for $60 might be your best bet. With the Fairplex right near the L.A./San Bernardino County line, the location can be a bit of a trek. If you’d rather not hassle with the drive twice in one day, consider staying at the newly renovated Sheraton Fairplex Hotel & Conference Center. Not only is it a super convenient place to rest your head after a day of fun, but they also offer exclusive fair packages including discounted tickets for concerts and fair admission. You can also bring a tent, camper, trailer, or RV and “rough” it at the Fairplex KOA.\nWhat To Eat\nIt’s all about great food at the Los Angeles County Fair. This year the Fair is pulling out all the stops, with offerings ranging from light and healthy to devilishly decadent. Deep-fried, on a stick, covered in chocolate, full of bacon, there’s no wrong way to feast at the fair. Over 1,2000 different menu items are ready to tantalize your tastebuds this year, including returning favorites like: Plant Food for People\nBack for a second year after a wildly successful first, Plant Food for People is offering a menu of all plant-based Mexican inspired cuisine. Vegans and non-vegans alike flock to their shredded jackfruit tacos, as well as their vegan nachos with homemade “cheeze” and tortas. It’s a good choice for some lighter fair fare. Chicken Charlie’s\nFair favorite Chicken Charlie’s is returning with two locations dishing up the ultimate in deep-fried everything. Don’t miss the Funnel Cake Burrito: a flour tortilla with deep-fried funnel cake, scoops of apple pie filling and vanilla ice cream, topped with cinnamon and caramel. He’s also serving up his popular Krispy Kreme Ice Cream Chicken Sandwich, and Krispy Kreme Cheeseburger. The Midway Gourmet\nFood vendor for the carnival and Ray Cammack Shows, The Midway Gourmet is offering spectacular fair food at his stands throughout the area. He’s firing things up by putting a Flamin’ Hot Cheetos twist on roasted corn on the cob, cheese fries, and pizza, and cooling it down with Nitro Pop (think frozen popcorn ice cream). He’s also bringing his TV-famous “The Pickle Cheese” to the carnival, a jalapeño cheese filled dill pickle, dipped in corn dog batter, and deep fried. Afters Ice Cream\nUber popular ice cream shop Afters is joining the fair for the first time this year, selling their famous “Milky Buns” donut ice cream sandwiches, and individual scoops. A few fair flavors include: Cookie Monster (bright blue vanilla ice cream with crushed Oreos, Famous Amos cookies, and a fudge swirl), Milk & Cereal (sweet cream ice cream blended with house-made corn flake topping, topped with more caramelized cornflake topping), and just for the fair, a Deep-Fried Twinkie flavor featuring the dessert swirled throughout Twinkie-infused ice cream. Other Notable Eats\nMany of last year’s big and unique food hits are also returning, like Deep Fried Guacamole, Kool-Aid Hot Wings, Deep Fried Butter, Chicken and Waffle on a Stick, Bacon-Cheddar Brat Burgers, Affogato Ice Cream Sundaes, and of course every form of funnel cake imaginable.\nWine, Beer, and Spirits Marketplace\nNot exactly food, but just as important to many fairgoers is the return of the Wine, Beer, and Spirits Marketplace. Inside you’ll find a showcase of some of the finest domestic and international drinks around. Partake in a tequila tasting or a wine education class – there’s no wrong way to raise a glass and say salud!\nTop Attractions\nThe Magical World of Dragons, Wizards and Beasts\nLocation: Building 10\nEnter a realm of fantasy and imagination as you step inside a gothic castle filled with interactive experiences, knights, wizards, and beasts both real and imagined. Visit dragon perches, listen to Merlogan the tale-spinning wizard, and see if you can catch references to “Game of Thrones” and “Harry Potter” while engaging with interactive devices full of pop culture info. Art Classic Presents: One Path Two Journeys\nLocation: Millard Sheets Art Center\nThe Millard Sheets Art Center is participating in the Getty Museum’s initiative Pacific Standard Time: LA/LA program, aimed at exploring Latin American and Latino art in dialogue with the city. The exhibit features works by Judithe Hernandez and Patssi Valdez as part of their “One Path Two Journeys” show. Wonderland: A Floral Fairytale\nLocation: Flower and Garden Pavilion\nChannel your inner Alice and step into a Wonderland of flora and fantasy. Inspired by Lewis Carroll’s enchanting novel, the exhibit will transport you down the Rabbit Hole and into a giant display of flowers and plants. Stroll through the gorgeous displays, and behold “woodland creatures” like flamingos, caterpillars, and a hedgehog. The Bug Barn\n“Bugs: The Good, The Bad and The Yummy” is shedding light on bugs as a great food source.\nSample dishes from Chef Cricket’s Culinary Kitchen & Bug Tasting Bar, serving up cricket tacos, chirper chip cookies, bamboo worms, salted grasshoppers, bug kebobs, and lots more. If you prefer your bugs not as a meal, catch the Creepy Crawler Show. The Igloo\nLocation: Expo Hall 9\nThe perfect way to cool off at the fair is at the indoor ice skating rink, The Igloo. Lace up your skates and take a spin around the Polar Ice Rink, and check out unique products at the Arctic Promenade. At night the rink turns after-hours club with DJs spinning away right alongside you. There’s an additional $5 charge for all ages to enter. Mojo’s Wild & Crazy Lagoon\nLocation: Lagoon\nThere’s no business like monkey business, and the fair’s resident Capuchin monkey and her animal friends are ready to teach you a thing or two about it. Learn about the native habitats of various exotic animals, and get close-up with reptiles, birds, kangaroos, capybara, peacocks, and a few animals you’ve probably never even heard of. Evening fairgoers will have the chance to dine with the animals (times posted daily), and see Zor, the resident fire eater who incorporates martial arts and dance into his exciting one man show. Esmeralda’s Traveling Circus\nLocation: Grandstand Neighborhood\nStep right up and enjoy the high-flying, daring talent of Esmeralda’s Circus. This real traveling circus puts on several must-see-to-believe shows, including Le Cirque Aerial Arts mid-air acrobatics, a Wizard of Oz inspired magical production, The Side Show featuring a 3,000+ pound horse, and a circus school that’ll teach you to juggle like a pro. Shows are free, and a nominal fee applies for some attractions.\nRides & Games\nRay Cammack Shows returns again this year, providing the largest midway in the nation. Over 70 thrilling rides await your laughs and screams, including an all-new ferris wheel for 2017. Forty fun-filled games also return to test your skill (and patience), and reward you with large stuffed prizes. Tickets are sold by the pack, and a Carnival Ride Wristband Voucher ($50) is available.\nEnd of Summer Concert Series\nNo matter your musical taste, the fair has got something for everyone in this year’s End of Summer Concert Series. Big names like Fifth Harmony, Chicago, Patti LaBelle & Queen Latifah, Hunter Hayes, and so many more will be gracing the stage. An “I Love the 90s Tour” featuring Salt N Pepa with Spinderella, Biz Markie, All 4 One, Color Me Badd, Coolio, and Rob Base kicks off the series on night one, September 1st.\nArticle by Kellie Fell.",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Guide To The 2017 L.A. County Fair",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/08/14/guide-to-the-2017-l-a-county-fair/"
}