{
    "authors": [],
    "date_download": "2017-02-15 16:50:42+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "“I haven’t seen him like that in 20 years,” drummer Lars Ulrich told James Corden last night on 'The Late late Show.' \"I mean, he was livid.”",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F02%2F15%2Fmetallica-james-hetfield-livid-after-grammy-performance%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/02/laday-gaga-james-hetfield-grammys.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Jon Wiederhorn\nMetallica’s performance with Lady Gaga at the GRAMMY’s on Sunday (Feb. 12) was one of the explosive highlights of the evening even though frontman James Hetfield’s mic wasn’t working for much of the song. But at the end of the number, he threw his guitar and kicked over a mic stand. Then he stormed offstage and flipped out.\nRelated: Watch Metallica & Lady Gaga’s GRAMMY Performance with Working Audio\n“I haven’t seen him like that in 20 years,” drummer Lars Ulrich told James Corden last night on The Late late Show. “I mean, he was livid. I mean, he’s aged really well and he’s a pretty chill guy, but the first five or 10 minutes in that dressing room was not a lot of fun.”\nWhile GRAMMY champion Adele was able to start her tribute to George Michael again after a technical problem that wasn’t an option for Metallica. “In the heat of the battle you’re out there you’re playing when it’s a technical issue you don’t really know is it going to the house, are his vocals gong to the truck?” Ulrich said. “Maybe it’s the monitors, so you just gotta keep playing.”\nTo compensate for the technical failure—which was reportedly caused by a stagehand accidentally pulling out the wrong plug—Hetfield sang into Gaga’s mic during the show as flames shot up around them and behind Ulrich. And Gaga’s stage dive was certainly exciting.\n“We fought through it,” Ulrich said. “And, you know, with the fire and Gaga in my lap for a minute at one point, it was just keep going, keep going. keep going. So we just fought through it, and a lot of people said it at least made for great television.”\nHetfield might have been upset about more than the defective mic. Though Metallica was announced to play the GRAMMYs long before it was announced that Gaga would join them, their name was accidentally excluded from the performance introduction by Laverne Cox.\n“I know Metallica, so this is the thing—people think that I do not know Metallica,” she told People explains in an apology. “It was on the teleprompter and I was in a moment, and I just thought I said them until afterwards.”\n“It was just a mistake,” she added. “I love Metallica, I love metal, and I got into heavy metal actually because a lot of the boys I was interested in back in the day were into metal. It was not me dissing them at all. I love Metallica — I’m so sorry. I apologized to them on Twitter and to all the fans. It was just a mistake. I’m human.”\nI am so sorry to #Metallica and all their fans. I am told I didn't say their names during the intro. Love you Metallica. You Rock. #Grammys —\nLaverne Cox (@Lavernecox) February 13, 2017\nWatch Lars Ulrich on The Late Late Show:",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Metallica’s James Hetfield was ‘Livid’ after GRAMMY Performance",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/02/15/metallica-james-hetfield-livid-after-grammy-performance/"
}