{
    "authors": [],
    "date_download": "2017-02-15 16:50:44+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "The concept, which has broken YouTube records and dominated social media, remains as simple and delightful as ever. Only this time, a rotating cast of celebrities will replace James Corden.",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F02%2F15%2Fcarpool-karaoke-series-epic%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/02/metallica-carpool.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Hayden Wright\nA trailer has been released for the next sequence of Carpool Karaoke videos, and the lineup is stellar. The CBS late-night segment will stream on Apple Music in a similar format, but with new guests and even crazier moments behind the wheel. The concept, which has broken YouTube records and dominated social media, remains as simple and delightful as ever. Only this time, a rotating cast of celebrities will replace James Corden.\nRelated: Adele’s ‘Carpool Karaoke’ is the Most Popular Viral Video of 2016\nHere are the moments we’re most excited for:\nMetallica making their headbanging mark on Rihanna’s “Diamonds” with Billy Eichner.\nJohn Legend duetting on with Alicia Keys on her breakout hit, “Falling.”\nAriana Grande belting the Little Shop of Horrors soundtrack with Seth MacFarlane.\nJames Corden’s return with Will Smith — they rap the Fresh Prince theme!\nChelsea Handler slinging whiskey and singing Bon Jovi’s “Living on a Prayer” with Blake Shelton.\nCorden also presides over an epic, R. Kelly-inspired key change for the Carpool Karaoke franchise — there’s a helicopter.\nA new installment will drop on Apple Music each week and the premiere is “coming soon.”\nWatch the preview here:",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Upcoming ‘Carpool Karaoke’ Series Looks Epic",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/02/15/carpool-karaoke-series-epic/"
}