{
    "authors": [],
    "date_download": "2017-02-15 16:50:46+00:00",
    "date_modify": null,
    "date_publish": "2017-02-15 00:00:00",
    "description": "\"In these trying times we need some fun. We’re very serious about fun.”",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F02%2F15%2Fblondie-video-new-song-fun%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/02/deborah-harry-getty.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Jon Wiederhorn\nBlondie have released a video for “Fun,” the first single from their upcoming album Pollinator. Directed by Beyoncé collaborator Dikyal Rimmasch, the clip lives up to the song’s title, featuring the band in a space ship, wandering another planet and animated footage of galactic travel contrasted with performance shots and images of people partying on the dance floor.\nRelated: Blondie and Garbage Announce Co-Headlining Summer Tour\nGuitarist Chris Stein said the interstellar theme was an effort to escape the stress and turmoil of modern day events. “Quoting Emma Goldman, ‘If I can’t dance I don’t want to be part of your revolution.’ In these trying times we need some fun. We’re very serious about fun,” he told NME.\n“The video was shot in two places,” he added. “The color stuff was all shot in LA without us and the black and white stuff was shot in New York. It’s got some good cameos—it’s got a pretty big cameo from Raja, who’s one of the Drag Race superstars, and little cameos from Grace McKagan, Duff McKagan’s daughter who has a band called The Pink Slips, and also Tony Maserati, who was a producer and mixer for us.”\nStein and vocalist Debbie Harry wrote the upbeat, disco-inflected “Fun” with TV On The Radio member Dave Sitek. Pollinator, which is scheduled for release May 5, also features writing by Johnny Marr, Sia, Charli XCX, The Strokes guitarist Nick Valensi and Dev Hynes. It will be Blondie’s first record since 2014’s Ghost of Download.",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Blondie Release Galactic Video for New Song ‘Fun’",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/02/15/blondie-video-new-song-fun/"
}