{
    "authors": [],
    "date_download": "2017-06-14 18:15:38+00:00",
    "date_modify": null,
    "date_publish": "2017-06-14 00:00:00",
    "description": "\"With Anita, you knew you were taking on a valkyrie — she who decides who dies in battle,\" wrote Richards.",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F06%2F14%2Fanita-pallenberg-longtime-keith-richards-girlfriend-dies-at-73%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/06/gettyimages-2641007.jpg?w=946",
    "language": "en",
    "localpath": null,
    "maintext": "By Hayden Wright\nAnita Pallenberg, the Italian-German actress, model, and longtime romantic partner of Keith Richards, has died at age 73. She is survived by Marlon and Angela, her two children with Richards. Another son, Tara, passed away as an infant in 1976.\nRelated: Keith Richards Pens Tribute to Chuck Berry\nPallenberg was best known for roles in ’60s classics, including Barbarella and Candy, as well as Performance, the 1970 crime drama starring Mick Jagger. The icon’s offscreen paramours included two Rolling Stones: She became involved with Stones founder Brian Jones before his death in 1969, and later romanced Richards from 1967 to 1980.\n“I like a high-spirited woman. And with Anita, you knew you were taking on a valkyrie — she who decides who dies in battle,” Richards wrote in his 2010 autobiography, Life. He also discussed their shared heroin addiction and penchant for living on the edge. The Stones songs “Angie” and “You Got the Silver” were written about Pallenberg.\n“Anita is a Rolling Stone. She, Mick, Keith and Brian were the Rolling Stones. Her influence has been profound,” Rolling Stones production assistant Jo Bergman once said. “She keeps things crazy.”\nPallenberg’s death was confirmed by Stella Schnabel, a friend and the daughter of artist-director Julian Schnabel. No cause of death has been reported.",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Anita Pallenberg, Longtime Keith Richards Girlfriend, Dies at 73",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/06/14/anita-pallenberg-longtime-keith-richards-girlfriend-dies-at-73/"
}