{
    "authors": [],
    "date_download": "2017-08-14 22:07:52+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 00:00:00",
    "description": "\"I've never missed one gig in my life... well, its been that way till now. The Dr. caught me trying to sneak out.\"",
    "filename": "http%3A%2F%2F931jackfm.cbslocal.com%2F2017%2F08%2F14%2Fnile-rodgers-hospital-toronto-misses-first-ever-gig%2F.json",
    "image_url": "https://cbs931jackfm.files.wordpress.com/2017/08/nile-rogers-we-are-family.jpg?w=1500",
    "language": "en",
    "localpath": null,
    "maintext": "By Jon Wiederhorn\nChic’s Nile Rodgers missed the first show of his career on Sunday (Aug. 13) when an illness forced him to seek treatment at a Toronto hospital.\nRelated: Chic and Earth, Wind & Fire Team for Summer Tour\nThe band was scheduled to play the Air Canada Centre with Earth, Wind and Fire for 2054: The Tour when Rodgers became sick. The news surfaced sound engineer John Ryan tweeted, “Nile Rodgers is in hospital tonight. Lights are out for him.”\nThe Rock and Roll Hall of Famer responded, “Thanks Johnny. I’ve never missed one gig in my life… well, its been that way till now. The Dr. caught me trying to sneak out. #LOVE,” and added that doctors are “taking great care” of him.\nRodgers was diagnosed with prostate cancer six years ago and wrote about his struggle on his blog (via Billboard). After undergoing extensive treatment, he was cured in 2014. He discussed his struggle at the Glastonbury Festival in June.\n“My doctors told me I was suffering from extremely aggressive cancer and that I needed to go home and get my affairs in order,” he said during the show. “Well, I happened to get a phone call from two French guys called Daft Punk and a gentleman named Pharrell Williams and we got together and wrote this song called ‘Get Lucky.’ And I feel like the luckiest man in the world tonight because six years after that doctor told me to go home and get my affairs in order, today, six years later, I am cancer-free!”\nIt is still unknown what caused Rodgers to miss Sunday’s show and whether or not he will be healthy enough to perform tomorrow night (Aug. 15) in Indianapolis, Indiana.\nThanks Johnny. I've never missed one gig in my life... well, it's been that way till now. The Dr. caught me trying… twitter.com/i/web/status/8… —\nNile Rodgers (@nilerodgers) August 14, 2017",
    "source_domain": "931jackfm.cbslocal.com",
    "title": "Nile Rodgers Hospitalized, Misses First Show of Career",
    "title_page": null,
    "title_rss": null,
    "url": "http://931jackfm.cbslocal.com/2017/08/14/nile-rodgers-hospital-toronto-misses-first-ever-gig/"
}