{
    "authors": [],
    "date_download": "2017-08-14 18:27:09+00:00",
    "date_modify": null,
    "date_publish": "2017-08-14 17:16:04",
    "description": null,
    "filename": "http%3A%2F%2F54.159.103.131%2Fstatement-from-100-black-men-of-america-inc-in-response-to-the-horrifying-events-that-occurred-in-charlottesville-virginia%2F.json",
    "image_url": "http://54.159.103.131/wp-content/uploads/2017/08/Website_Hero_Image-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Statement from 100 Black Men of America, Inc. in response to the horrifying events that occurred in Charlottesville, Virginia\nThe 100 Black Men of America, Inc. is profoundly saddened by the loss of life and deeply disturbed by the mobilization and organized bigotry that descended on Charlottesville, Virginia on Friday and Saturday.\nFirst, we offer our heartfelt condolences to those who lost their lives, those who were injured, their families and the community.\nWe expect the full force of the United States Government, local law enforcement, and elected representatives to bring to justice those responsible for inciting the violence that led to unfathomable carnage and deadly outcomes.\nThe vile spirit of hatred and violence permeating in this country will continue until those in power take an aggressive and intentional stand against domestic terrorists, white supremacist, Nazi and white nationalists groups.\nCurley M. Dossman, Chairman of the Board\nBrian Pauling, President and CEO\n100 Black Men of America, Inc.\nGlobal Headquarters, Atlanta, GA\nAbout 100 Black Men of America, Inc.\n100 Black Men of America, Inc. is a global nonprofit mentoring organization committed to the intellectual development of youth and the economic empowerment of the African American community through promoting the precepts of respect for family, spirituality, justice, and integrity. It began with one chapter in New York City in 1963, incorporated in 1986 and today has more than 100 chapters reaching 125,000 youth in the United States, London, and Turks and Caicos Islands.",
    "source_domain": "54.159.103.131",
    "title": "Statement from 100 Black Men of America, Inc. in response to the horrifying events that occurred in Charlottesville, Virginia",
    "title_page": null,
    "title_rss": null,
    "url": "http://54.159.103.131/statement-from-100-black-men-of-america-inc-in-response-to-the-horrifying-events-that-occurred-in-charlottesville-virginia/"
}