{
    "authors": [
        "Katherine Ernst"
    ],
    "date_download": "2017-12-12 00:43:29+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 21:27:22",
    "description": "ARG speaks to Seona Thompson about her star sprinter Aston Dee Bee and her contenders in Thursday's Group 1 Hobart Thousand heats.",
    "filename": "https%3A%2F%2Faustralianracinggreyhound.com%2Faustralian-greyhound-racing%2Fvictorian-greyhound-racing%2Fno-slowing-down-for-thompson-after-dee-bees-ballarat-cup-win%2F90666%2F.json",
    "image_url": "https://australianracinggreyhound.com/wpress/wp-content/uploads/2017/11/Aston-Dee-Bee-Melbourne-Cup-300x154.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "No slowing down for Thompson after Dee Bee’s Ballarat Cup win\nASTON Dee Bee (Barcia Bale x Aston Elle Apr ’15) will have a week away from the race track after recording a brilliant victory in Saturday’s Group 2 Ballarat Cup (450m).\nTrained by Seona Thompson, the powerhouse performer used box one to perfection, barging his way along the fence underneath early leader Chardy (Barcia Bale x Mepunga Nicky Jun ’15) to take the lead around the turn.\nOnce Aston Dee Bee found the front it was all over as the Ray Borda-owned and bred greyhound charged to the line to win by just over two lengths in a sizzling 25.07.\nAston Dee Bee has now won his past five starts, including the world’s richest greyhound race, the Group 1 Melbourne Cup, on November 24.\nThompson believes her star greyhound is starting to come of age and develop into the complete racing package.\n“He took advantage of having box one again and he is racing full of confidence – I think that’s a pretty big thing,” Thompson told Australian Racing Greyhound.\n“He has turned into the ultimate professional. He is a bit of a gentle giant so it took him a while for him to learn to push his way through but he is really putting it all together now.”\nVIDEO REPLAY: Check out Aston Dee Bee's winning chase in the 2017 Energis #BallaratCup. Chardy second and Ando’s MAC third. #GreyhoundRacing pic.twitter.com/gPYw6JzNLj — Greyhound Racing Vic (@GRV_News) December 9, 2017\nAston Dee Bee – which scored his maiden group victory in the Melbourne Cup – has now won 29 races from 50 starts and has been placed on another 10 occasions. His earnings are sitting at $683,025 which puts him in ninth spot on the all-time prize money earner’s list.\nHaving qualified for 10 group races throughout his career, Thompson said it is no surprise to see Aston Dee Bee now piling up the wins at the highest level after winning the Melbourne Cup.\n“Before the Melbourne Cup he had been placed in five group finals but hadn’t had much luck. You see it all the time – once they win one they usually go on and win a few more once they learn what to do.\n“We’ve had him here since he broke in. We knew from day one he was something special – he has always been good. It was just a case of getting him to show it on the track.\n“In his early trials he had good first splits. He doesn’t always show that in his races, but he is very strong and he is a big dog. Now that he has learned he has that size he is starting to push his way through other dogs which he showed again on Saturday night.”\nThompson said she will sit down this week and map out the feature race preparation for Aston Dee Bee, with country cups and the Australian Cup Carnival in the first quarter of 2018 the main goals.\n“There are races on every week so there is no shortage of options,” Thompson said.\n“He isn’t an old dog so he should have plenty of racing left in him. We’ll have a look and see what’s on for him and keep racing him until he tells us he’s had enough.”\nWhile it is going to be a quiet week for Aston Dee Bee, it is still going to be a busy one for Thompson who heads to Tasmania this Thursday night with four runners in the Hobart Thousand heats – Bewildering (Black Magic Opal x Outlandish Feb ’15), Big Flood (Banjo Boy x Easy Baby May ’15), Aqua Cheetah (Cosmic Rumble x Dalta Bale Jun ’14) and Invictus Rapid (Cosmic Rumble x Miss Fiesty Feb ’14).\n“I haven’t been to Hobart before, I’ve only watched on TV, but I think the track will really suit a dog like Bewildering,” Thompson said.\n“It’s a long run down the back straight and he has drawn quite well – hopefully he can have a big of luck and race well.\n“I’m taking Bewildering and Big Flood over with me – the other two are already over there with Mick Stringer.\n“They are both getting a bit older so I sent them over for a trial and a race so they could really see the track before the heats, but neither of them know how to put in a bad race so they’ll both be trying.\n“Hopefully the four of them get some luck and make it around safe.”",
    "source_domain": "australianracinggreyhound.com",
    "title": "2017 Group 2 Ballarat Cup won by Aston Dee Bee",
    "title_page": null,
    "title_rss": null,
    "url": "https://australianracinggreyhound.com/australian-greyhound-racing/victorian-greyhound-racing/no-slowing-down-for-thompson-after-dee-bees-ballarat-cup-win/90666/"
}