{
    "authors": [
        "Katherine Ernst"
    ],
    "date_download": "2017-12-12 00:43:33+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 21:42:19",
    "description": "Gavin Harris speaks to ARG about his exciting sprinter Zinfandel Zara which won the 2017 Doug Payne SA bred final at Angle Park on Thursday night.",
    "filename": "https%3A%2F%2Faustralianracinggreyhound.com%2Faustralian-greyhound-racing%2Fsouth-australian-greyhound-racing%2Fzinfandel-zara-a-south-australian-star-on-the-rise%2F90668%2F.json",
    "image_url": "https://australianracinggreyhound.com/wpress/wp-content/uploads/2017/12/Zinfandel-Zara-300x150.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Zinfandel Zara a South Australian star on the rise\nGAVIN Harris looks to have another smart youngster on his hands after the lightly raced Zinfandel Zara (Fabregas x Wikena Feb ’16) won Thursday night’s $9,365 Doug Payne SA Bred feature (515m) at Angle Park.\nLining up against a classy field which included group class performers Hukanui (Kelsos Fusileer x Daddy’s Muffin Feb ’14) and Windmill Haze (Barcia Bale x Contrary Mary May ’15), Zinfandel Zara stepped beautifully off box seven, settling in second position before finding the front and powering to the line to win by six and a half lengths in a flying 29.66.\nAmazingly, Thursday’s feature was only her fifth race start, taking her record to four wins and over $10,000 for Harris who also co-owns the black bitch with some mates.\n“I was very pleased with her,” Harris told Australian Racing Greyhound.\n“She likes wide draws so I gave her some chance, although I wasn’t expecting her to go as well as she did.\n“I threw her in the deep end a bit, but she handled herself beautifully and it was very exciting.”\nThe 2017 SA Bred Doug Payne was run last night @ APK & most would have gone home thinking they've just seen the next big thing in SA greyhound racing. Zinfandel Zara was having only her 5th lifetime start and blew her rivals away with pure speed in this quality field. pic.twitter.com/etq3oadIxr — Greyhound Racing SA (@TheDogsSA) December 8, 2017\nHarris says the 27-kilogram chaser has always shown plenty of ability and is hopeful that she could turn out to be a bargain buy after purchasing her for a sizeable figure as a pup.\n“She was bred by Kirin Corby who I have had dogs for before. All three dogs of hers which I have trained have won at least 10 races each so I knew it was a good bloodline.\n“She was put through the puppy auctions over here and at that stage her mother had already thrown Harbourmaster which was a fast South Australian dog which won in 29.40 at Sandown.\n“I decided to buy her with a group of people and we paid $5,500 for her. She broke in very fast so we have thought we had something good from day one, but she has surprised us all a little by just how good she is.”\nHarris, who has had success interstate with his top stayer Springvale Bryne (Oaks Road x Little Looper Dec ’13), said he is not afraid to travel around Australia with his newest kennel star, but concedes he is likely to keep her at home for the immediate future.\n“She is still only young so I don’t want to push her too hard straight away. She is still a grade six at Gawler so we might head there and then bring her back to Angle Park.\n“She is paid up for the Breeders Series’ in the next six months and there are a few nice features to win with her around here, but if she is going well enough I would definitely consider going interstate down the track.\n“A good thing about her is that she musters fast and she explodes once she starts moving which should help her to win a few races.\n“Also she is only 21 months old so hopefully the best is still in front of her.”",
    "source_domain": "australianracinggreyhound.com",
    "title": "Zinfandel Zara a South Australian star on the rise",
    "title_page": null,
    "title_rss": null,
    "url": "https://australianracinggreyhound.com/australian-greyhound-racing/south-australian-greyhound-racing/zinfandel-zara-a-south-australian-star-on-the-rise/90668/"
}