{
    "authors": [],
    "date_download": "2017-01-02 05:50:32+00:00",
    "date_modify": null,
    "date_publish": "2017-01-02 00:00:00",
    "description": null,
    "filename": "http%3A%2F%2Fcnnw.com%2Ffired-teacher-to-appeal-loss-of-his-lawsuit%2F.json",
    "image_url": "http://cnnw.com/wp-content/uploads/2013/02/ad_georgefox.png",
    "language": "en",
    "localpath": null,
    "maintext": "PORTLAND — An attorney for Bill Diss, the Portland schoolteacher who claimed he was fired in 2014 for his religious views and pro-life activity, said the recent loss of Diss’s lawsuit against the school district will be appealed.\nThe lawsuit by Diss, who taught at northeast Portland’s Benson Polytechnic High School for more than a decade, was scheduled to go to a nine-day trial in November in U.S. District Court in Portland. But federal Magistrate Judge Paul Papak threw out the case in October, siding with the school district. In a prepared statement, the district said it was pleased by the judge’s decision.\nRebekah Millard, staff counsel for the Life Legal Defense Foundation in Springfield, informed Christian News Northwest last month that notice of appeal in the case has been filed. She deferred any other comment until after the holidays.\nBelieving that his opposition to Planned Parenthood led the Portland schools to wrongfully fire him, Diss, of Beaverton, filed a $390,000 lawsuit in 2014 against the school district. He sought $90,000 in economic damages for lost wages and benefits and $300,000 for emotional distress.\nDiss was formally dismissed by the school board in December 2013 by a 6-1 vote; the firing drew national attention. Board member Steve Buel was the lone dissenter, saying he did not agree with the process that led to Diss’s firing.\nIn a two-hour public hearing the previous month, Diss and his attorney contended that his religious beliefs and his strong visibility in the pro-life movement — including organizing protests of Planned Parenthood entirely away from his work — were factors in the school district’s efforts to oust him.\nA devout Catholic, Diss had led efforts made by concerned Christians against construction of Planned Parenthood’s northeast Portland headquarters, which nevertheless opened several years ago.\nDiss also strongly objected when the school told him he must allow Planned Parenthood’s sex education program in his classroom.\nSchool officials claimed his firing was pursued only because of unprofessional and disrespectful behavior on his part toward both his supervisors and students.\nCarole Smith, then the school district superintendent, had recommended in May 2013 that Diss be dismissed from his teaching position.\nAt the school board’s public hearing later that year, the board room was filled with people who supported Diss, described him as an excellent teacher, and said the district’s actions toward him were unjustified.\nThe 38-page lawsuit stated that Diss lost his job despite for years having received high ratings on job performance reviews.\nAmerican Life League, a national ministry that strongly opposes Planned Parenthood, publicly charged that Diss was being fired because of pressure from that agency.\nDiss said the district scrutiny of his job performance particularly escalated to unreasonable levels after he organized a turnout by hundreds of people at a school board hearing in 2012 to protest Planned Parenthood’s involvement in the schools.",
    "source_domain": "cnnw.com",
    "title": "Fired teacher to appeal loss of his lawsuit",
    "title_page": null,
    "title_rss": null,
    "url": "http://cnnw.com/fired-teacher-to-appeal-loss-of-his-lawsuit/"
}