{
    "authors": [],
    "date_download": "2018-04-24 20:19:32+00:00",
    "date_modify": null,
    "date_publish": "2018-04-24 23:32:06",
    "description": "Babur Junaid Jamshed has been on his father's path since the beginning. Whenever he misses his father, he posts his father's photo or video on his Instagram account and the occasions he misses his dad are seriously uncountable.",
    "filename": "https%3A%2F%2Farydigital.tv%2Fbabur-junaid-jamshed-ties-knot-in-a-modest-ceremony%2F.json",
    "image_url": "https://arydigital.tv/wp-content/uploads/2018/04/Capture.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "The legendary Junaid Jamshed had been ruling over ample hearts while he was a part of Vital Signs. The maestro then turned towards religion, leaving behind his swiftly elevating career but he did not stop winning hearts. He knew that he owned a majestic voice and he recorded abundant Islamic renditions that made a diverse but huge populace admire him. In an unfortunate plane crash, the singer turned religious scholar embraced martyrdom.\nHis son, Babur Junaid Jamshed has been on his father’s path since the beginning. Whenever he misses his father, he posts Junaid’s photos or videos on his Instagram account and the occasions he misses his dad are seriously uncountable.\nBabur has also intoned a tribute to his father which is certainly sufficient to get you in tears.\nAmidst insanely extravagant wedding ceremonies and birthday parties, the young Jamshed has also tied knot albeit in a relatively smaller affair, attended by family and close friends. None of the photos of his weddings have surfaced on the social media neither have any celebrities put up photos on their social media platforms.\nThe groom has told his friends and fans about the wedding via his own Instagram account. He has posted a photo of himself, standing with his spouse Mahnoor Babur.\nMy Bride?? @mahnoorbabur_ A post shared by Babur Junaid Jamshed (@baburjunaidjamshed) on Apr 22, 2018 at 2:22am PDT\nBabur looks dapper in a black Sherwani meanwhile his better half looks absolutely exquisite in red embellished with breathtaking jewelry. The video you are about to see will make you respect this young man. He has kept his father alive in both his heart and spirit. He has sung for his wife and posted the rendition with a caption, ‘Yeh Shaam Phir Nahi Ai Gi’. What a legit genuine man!\nYeh Shaam Phir Nahi Ai Gi… A post shared by Babur Junaid Jamshed (@baburjunaidjamshed) on Apr 23, 2018 at 11:21pm PDT\nMahnoor and Babur have been Nikkahfied since January 14th.\nGot Nikkahfied With Mahnoor Ghaznavi A post shared by Babur Junaid Jamshed (@baburjunaidjamshed) on Jan 13, 2018 at 2:14pm PST\nAnd the cutest young couple shares phenomenal bonding.\nI Love You So Much Mahnoor! A post shared by Babur Junaid Jamshed (@baburjunaidjamshed) on Feb 6, 2018 at 10:08pm PST\nWe wish Babur Junaid Jamshed to live a life full of love, happiness, and contentment.\nWhat are your thoughts about this story? Tell us in the comments below.\nComments\ncomments",
    "source_domain": "arydigital.tv",
    "title": "Babur Junaid Jamshed Ties Knot In A Modest Ceremony",
    "title_page": null,
    "title_rss": null,
    "url": "https://arydigital.tv/babur-junaid-jamshed-ties-knot-in-a-modest-ceremony/"
}