{
    "authors": [],
    "date_download": "2018-02-03 19:37:05+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 17:24:58",
    "description": null,
    "filename": "https%3A%2F%2Farydigital.tv%2Fary-digital-exclusive-drama-meri-nanhi-pari%2F.json",
    "image_url": "https://arydigital.tv/wp-content/uploads/2018/02/meri-nanhi-pari-shedule.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Children are supposed to be God’s ultimate gifts. Parents stay up all night long for the sake of their child’s proper sleep without caring about their own sleep. But what will parents do when they come to know that the child they were nourishing and taking care of, has a dreadful disease?\nSimilarly, ‘Meri Nanhi Pari’ is a story based on the never-ending struggle of Shiza (Ayesha Khan), who is willing to give up anything and everything to save her child Sehar’s life who is suffering from Thalassaemia.\nShiza marries Khalid (Gohar Rasheed) on the terms that their child will save Sehar’s life by donating her bone marrow to Shiza. The second marriage was not an easy decision for Shiza but she took it for the sake of Sehar’s life. But Khalid breaks Shiza’s promise right after the birth of their daughter Saba.\nAlthough Sehar and Saba love each other and have no differences. Saba is even willing to give her bone marrow to her sister but her father Khalid is apparently the villain of this story.\nWill Khalid ever feel empathy for Shiza? Will Shiza ever be able to save her daughter Sehar’s life?\nDirected By:\nAli Faizan\nWritten By:\nNaila Ansari\nCast:\n• Ayesha Khan\n• Gohar Rasheed\n• Mohammad Ali\n• Asma Abbas\n• Ezzah Zulfika\n• Sonia.\nThis drama engulfed with emotions is all set to hit the screens every Monday at 9pm from February 5, 2018. To follow this drama, click here.\nComments\ncomments",
    "source_domain": "arydigital.tv",
    "title": "ARY Digital Exclusive Drama",
    "title_page": null,
    "title_rss": null,
    "url": "https://arydigital.tv/ary-digital-exclusive-drama-meri-nanhi-pari/"
}