{
    "authors": [],
    "date_download": "2017-10-06 22:32:00+00:00",
    "date_modify": null,
    "date_publish": "2017-10-06 19:10:17",
    "description": "10 FACTS TO KNOW ABOUT YASIR HUSSAIN: Yasir Hussain has a big family. He has 12 siblings and he is the youngest one. He always used his elder s",
    "filename": "https%3A%2F%2Farydigital.tv%2Fneed-know-versatile-yasir-hussain%2F.json",
    "image_url": "https://arydigital.tv/wp-content/uploads/2017/10/00-1.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Actors live a different life in front of the camera. Their real life differs from their reel life. Yasir Hussain is the new rising star of Pakistan’s film industry well known for his comic roles. He is a VJ, an actor and a writer. His debut movie was “Karachi se Lahore” in which he played the role of “Moti” and got his name recognized as one the fine names of the industry.\nHere are a few fun facts about Yasir Hussain to help you know him better:\nA BIG TALENTED FAMILY:\nYasir Hussain has a big family. He has 12 siblings and he is the youngest one. He always used his elder siblings used things. He used his one-year older sister’s course books in school and still wears his elder brothers’ clothes. According to him, this increases love between the siblings. Talent is in his family’s blood. One of his sister is a singer, who lives in Dubai and one of his brother is a script writer.\nAN INTROVERT CHILD:\nYasir Hussain who is well known for his out spoken nature was a quiet and reserved kid. He was self-restrained and did not like to communicate with people. He became mischievous in the 6th grade. He loved giving nick names to the people. The funniest name he had ever given was” AFGHANI PERHA” to a girl of her area who had a very fair skin.\nLOVES TO READ:\nYasir Shah’s live-by phrase is, “Books are a man’s best friend.” He is an avid reader. Most of the things he has learnt about acting and script writing is through books. He has always had a “book reading” environment in his home.\nSERIOUS PERSONALITY:\nYasir Hussain actually has a serious personality. He loves to be quiet most of the time. He finds his friends funnier than him. He never minds if anybody makes fun of him. According to him, people make fun of those who is successful.\nCAREER ORIENTED:\nAlthough, Yasir Hussain looks like a carefree person but he is in fact, a career oriented person. He wanted to be an actor since childhood. He started his acting career by performing in theaters in Islamabad. He had also done a script writing course. His aim is to be successful in this industry.\nFITNESS FREAK:\nWe have seen Yasir Hussain as a fat, chubby man in his movies but he actually is a fitness freak. For his first movie’s character he gained up-to 96 Kgs weight to match the character. After that, he followed a strict diet routine in which he was not allowed to eat chapatti and rice. He ate salad in breakfast, pearl millet’s (Bajra) chapatti in lunch and dinner with oil free dishes. His transformation is fitness goals for many people.\nDESIRABLE BACHELOR:\nWell ladies, Yasir Hussain is still single. Who does not want a funny and a good looking husband? But, you have to wait, as he is not ready to mingle yet. He has some goals to achieve. However, he believes in “LOVE MARRIAGE”, so there still is a chance ladies.\nFAVOURITE ACTRESS:\nYasir Hussain has so many favorite actresses but his all-time favorite is Sri Devi. He got disappointed when he saw her husband Boney Kapoor for the very first time.\nFAVOURITE BODY FEATURE:\nYasir Hussain loves women with beautiful eyes. Saba Qamar, Sajjal Ali, Kubra are his favorite Pakistani actresses.\nUPCOMING PROJECTS:\nWell people, you will watch this handsome hunk soon in his new movies. His upcoming movies are Band Toh Ab Baje Ga, Arth 2 and Senti Aur Mental. We wish him good luck for his future endeavors.\nComments\ncomments",
    "source_domain": "arydigital.tv",
    "title": "10 FACTS TO KNOW ABOUT YASIR HUSSAIN:...",
    "title_page": null,
    "title_rss": null,
    "url": "https://arydigital.tv/need-know-versatile-yasir-hussain/"
}