{
    "authors": [],
    "date_download": "2017-12-12 03:56:25+00:00",
    "date_modify": null,
    "date_publish": "2017-12-11 18:22:15",
    "description": null,
    "filename": "https%3A%2F%2Farydigital.tv%2F3-lessons-learn-suhanas-mistakes-teri-raza%2F.json",
    "image_url": "https://arydigital.tv/wp-content/uploads/2017/12/fea-7-2.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Sanam Baloch has been an actress we’ve enjoyed watching on screen, her charming persona, her smile and her versatile acting is what keeps us hooked on to her characters. Teri Raza marks Sanam’s comeback into dramas with Big bang Productions and ARY.\nSanam is currently playing the role of “Suhana” in Teri Raza which she has breathed life into alongside Shehroze Subzwari. She plays a very chirpy character who adores her Dadi a lot. But there are a few things she has been doing wrong and that’s what raised a question for us to look an answer for.\nDecisions taken by parents are the best ones:\nYoung generation often disagrees with the decisions of parents and with what they teach maybe because of generation gap and the world constantly evolving. But because they are always right, once should properly listen to what they are saying and try to keep themselves in their shoes and then should think about it.\nSuhana from Teri Raza agreed for her first marraige upon her parents wish but made sure that her second marraige would be as she wants it to be. After her divorce she marries Rameez without the consent of her parents and now will be bearing the consequences coming to her because of her decision. Imtiaz was the one who use to treat her like a princess wheras Rameez is a casanova who just cares about himself.\nRespect the ones who love you:\nYour parents loves you the most, they are the ones who stay with you thick and thin. We have seen Suhana not respecting her parents in Rameez’s matter. She always took Imtiaz for granted and never tried to love him from the core of her heart. Imtiaz being so much in love with Suhana, does everything as she says and asks for. He opened up a boutique for her so that she can pursue her dream of being a fashion designer. Suhana still paid no heed to his feelings,\nNow when she lives with Rameez and sees his priorities and his family’s expectations from her, will she miss Imtiaz and all the luxuries provided by him for her?\nAlways believe in Allah’s Raza:\nWhatever Allah plans, is the best anyone could get and that’s what Suhana was not satisfied with. Her and Imtiyaz’s istikhara was positive and according to it she well lead a happy life with Imtiaz but despite of cherishing his feelings and love for her, she didn’t stop running after Rameez and ended up marrying him leaving Imtiaz’s love and care behind.\nWe do not always get what we wish for and only Allah knows better what’s good and bad for us. Suhana did a few mistakes in her life and she will for sure regret them. Let’s see at what end she realizes her mistakes and whether she’ll alter them or not that is yet to be disclosed.\nComments\ncomments",
    "source_domain": "arydigital.tv",
    "title": "3 lessons we learn from Suhana's mistakes in Teri Raza!",
    "title_page": null,
    "title_rss": null,
    "url": "https://arydigital.tv/3-lessons-learn-suhanas-mistakes-teri-raza/"
}