{
    "authors": [],
    "date_download": "2018-02-03 19:37:45+00:00",
    "date_modify": null,
    "date_publish": "2018-02-03 13:10:21",
    "description": null,
    "filename": "https%3A%2F%2Farydigital.tv%2Fwill-definitely-start-singing-song-time-reading%2F.json",
    "image_url": "https://arydigital.tv/wp-content/uploads/2018/02/allah-yar-1-450x270.jpg",
    "language": "en",
    "localpath": null,
    "maintext": "Since the ‘Green Carpet‘ of ‘Gluco Allahyar and the Legend of Markhor’, cinemas successfully grabbed abundant of viewers to watch the movie. In the star-studded premiere, celebrities who were not even a part of this movie came to watch it. Most celebs came along with their children since it was a majorly anticipated animation treat.\nThe visual sensation by Uzair Zaheer Khan is engulfed with valuable lessons like loving nature and not judging anyone on the basis of caste or ethnicity. Also, extraordinary music by Ahmed Ali was oozing from the colorful animation which is incorporated keenly into the movie.\nAn amazing soundtrack can elevate the chances to grab spectators’ attention and ‘Allah Allah Bol’ by Ali Noor certainly proved this to be accurate. Directed by Ali Noor’s spouse, Mandana Zaidi, ‘Allah Allah Bol’ has unequivocal ingredients to be the soul of this movie. It would be not a mistake if one claims this song to be a literal winner that is included in any Pakistani movie in years.\nAli Noor has oodles of talent and is an owner to breathtaking looks to pursue a career as an actor anytime he wants but his recent song ‘Allah Allah Bol’ certainly got us glued to hear more from him. Directed By Mandana Zaidi, the song comprised of power packed performances by Ali Noor, Natasha Humera Ajaz, and Anum Zaidi along with few children including Ali Noor’s daughter Sanjana.\nThe song starts with Ali Noor wearing a set of headphones followed by freestyle dances children and adults did. Moreover, a black and white caricature of Allahyar was also seen in the video various times.\nDuring the song, the screen was also taken by Ali Noor’s daughter, Sanjana where she has sung a stanza of four lines,\n“Hum tou nachay gayen gey,\nYun hi muskurayen gey,\nHastay hastay yun hi hum,\nDuniya pe chaa jayen gey.”\nThe music video of the exceptionally charming song has gotten more than 4k views in just few hours and is liked by a massive populace. The movie also contains two more songs which are as fabulous as ‘Allah Allah Bol’ and they’re called ‘Hum Hain Rahi’ by Ali Noor and ‘Muskurai Ja’ by Natasha Humera Ajaz, an altered version of Zohaib Hasan’s ‘Muskurai Ja’.\nHere are the videos of ‘Hum Hain Rahi’ and ‘Muskurai Ja’.\nDo tell us about your favorite song in the comments’ section below.\nComments\ncomments",
    "source_domain": "arydigital.tv",
    "title": "You will definitely start singing this song all the time after reading this!",
    "title_page": null,
    "title_rss": null,
    "url": "https://arydigital.tv/will-definitely-start-singing-song-time-reading/"
}